{
    "title": "This photo \"Happiest Man in China\", was taken in 1901. The man didn't know you're supposed to be serious when posing for a photo",
    "author": "Natchos09",
    "subreddit": "MadeMeSmile",
    "rank": 28,
    "score": 12247,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 100,
    "url": "https://i.redd.it/rt53r61w5iie1.png",
    "id": "1imxblj",
    "selftext": "",
    "comments": [
        {
            "author": "AnHeroicHippo90",
            "body": "How could you not be so happy when you have a hearty bowl of rice and a cool hat?",
            "score": 1659,
            "replies": [
                {
                    "author": "smile_politely",
                    "body": "that's when before happiness were banned",
                    "score": 230,
                    "replies": [
                        {
                            "author": "Chia_10",
                            "body": "Centuries of Confucius gone.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "don_pk",
                    "body": "And nice set of teeth.",
                    "score": 122,
                    "replies": [
                        {
                            "author": "MooCowDivebomb",
                            "body": "I was also gonna say, that man has amazing teeth!",
                            "score": 43,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zealousideal-Book741",
                    "body": "Absolutely! Nothing beats a good meal and a stylish hat. Happiness comes in the little things!",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Angelina_Molly",
                    "body": "That’s crazy that nowadays lots of people got bunch of things but struggle to achieve happiness, I seen some very rich people who are have not had such sincere pure positive emotions for years, I wish people will learn how to be happy again",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Sea-Dawg-24",
                            "body": "It’s true all the things we get and do now aren’t for our mental health",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "GriffinEcho2",
                            "body": "You’re right. Happiness often comes from within, not just things. It’s about connections and inner peace.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "FrostyFirebrand",
                            "body": " The absence of smiles in ancient portraits was also bad teeth, because in those days dental problems were widespread. However, like any broad generalization about cultural traditions is difficult to prove because of the many exceptions.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Adventurous_Soil_184",
                            "body": "I believe that this world needs Jesus. In scripture he tells us a few things about happiness \n\nJohn 16:22 22 “So with you: Now is your time of grief, but I will see you again and you will rejoice, and no one will take away your joy.”\n\nI recommend you check out the bible sometime there’s a whole lot of gems in it😊",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "throcorfe",
                                    "body": "You understand that the movement causing some of the greatest unhappiness in the world right now is evangelical Christianity? Without Christianity, there’d be no Trump. I’m a churchgoer myself, raised Christian but increasingly prefer not to identify that way not least due to thoughtless and irrelevant comments like yours. Go create real joy through your actions (feed the poor, speak out against fascism, fight for trans rights), instead of turning your faith into a sales pitch, to shoehorn into threads that have nothing to do with it.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Hawt_Dawg_II",
                                            "body": ">Without Christianity, there’d be no Trump\n\nThis makes no sense, rich fucks are an inherrent fact of a free economy.\n\n>Go create real joy through your actions (feed the poor, speak out against fascism, fight for trans rights), instead of turning your faith into a sales pitch, to shoehorn into threads that have nothing to do with it.\n\nThis hits though you're on point with that.\n\nAll in all i don't think the church is necessarily the cause of that much grief unless you're actively getting scammed by them. It's just a coping mechanism. That whole bible quote they posted is just a cryptic way of telling yourself to be happy with little things, if some people need to act like some dude said that 2000 years ago to believe it, fine by me.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "grantnel2002",
            "body": "Who says they have to be serious?",
            "score": 609,
            "replies": [
                {
                    "author": "Hairy-Science1907",
                    "body": "Adding to OP's point, people typically don't smile in photos because that's what you do when you sit for a painting. Imagine holding a smile for two or three hours or longer. Yeah, no. People thought that is what you did for a photo as well.",
                    "score": 481,
                    "replies": [
                        {
                            "author": "Cloverman-88",
                            "body": "Also, IIRC originally the photo exposure had to be significantly longer (like, a minute) and if you changed your expression in that period it came put blurry.",
                            "score": 185,
                            "replies": [
                                {
                                    "author": "Hairy-Science1907",
                                    "body": "Yes and no. By the early 1900s, when this photo was taken, exposure times were pretty instantaneous. Some people may have older cameras that still needed longer exposures, sure. But judging by the fact that the photographer was able to pull off this gem of a photo, I think we can safely assume it was a newer model. \n\nBut people, at least in the west, were still taking serious photos.",
                                    "score": 182,
                                    "replies": [
                                        {
                                            "author": "Iowa_Dave",
                                            "body": "The habit of holding still and looking serious probably lingered because most people copy what others around them do.\n\n[Head braces](https://64.media.tumblr.com/983ae7b9aaef4a0e1e1766e1b69d237e/51ed58db19495d06-54/s400x600/b2745053330524899083c1211cee815415fa8117.jpg) were widely used during the Civil War and I'm sure the older cameras and wet-plates were held onto for quite a while.\n\nI used to have a bellows camera and really loved that thing!",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "momomorium",
                                                    "body": "Oh I love this knowledge, thank you for sharing! Seeing a photograph of that age of someone being photographed is really fascinating. I find it strangely exciting to see what feels like a hidden little secret. \n\n\"I'm a very disciplined man. I sat perfectly still in this pose for the whole exposure, no wait don't look over there!\"",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "stewpedassle",
                                            "body": "I read that as part of their point, especially in the context of yours.  You don't smile in a painting because it's difficult to maintain for a period of time (and difficult to replicate well -- like painting the hands). The first cameras didn't really change that because of the long exposure time, so people by and large follow the status quo until information disseminates for \"the new fad\" and the like even though the base technology has long surpassed the original reason for the norm.\n\n\nWe forget just how long it took for information to spread even 150 years ago.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FreakinMaui",
                                    "body": "Lots of reason given. One I read is also the rarity.\n\nUnlike today, the number of times you'd get your photo taken in a lifetime could probably be counted on the fingers of one hand. So it was a 'serious' matter/event.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "golddilockk",
                                    "body": "so are you saying this guy was holding this smile and the rice bowl like this for a minute?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "CrashTestDuckie",
                                            "body": "While hilarious in thought, no. He had no concept of earlier photography limitations so the photo was taken near instantly which captured his silly expression. He didn't learn the \"bad habits\" of those who may have had to deal with older technology",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "FuriousPorg",
                                                    "body": "So this would have essentially been like the “Millennial pause” versus Zoomers just hitting record and leaping right into it. Our dude here just flashing those awesome chompers of his for the camera, versus older people sitting there stone cold serious, waiting for the photo to be taken and then being like “what, it’s done already?”",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "CrashTestDuckie",
                                                            "body": "Holy shit yes! Exactly! I didn't even think of it that way!",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "golddilockk",
                                                    "body": "ah, i misunderstood the earlier comment, thanks.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "N64-NPC",
                            "body": "Now I get why so many people in early photos look either anxiously uncomfortable or ragingly pissed off",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "WaldenFont",
                            "body": "Also, terrible teeth.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DTux5249",
                    "body": "This was back when a photo had the same gravity as having your portrait done; so most people were serious. \n\nThis guy didn't give no fucks. The Chinese didn't have the same portrait zeitgeist as Europeans did.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Natchos09",
                    "body": "Well, back in those times it was pretty expensive for the average person to get a photo, so they usually make it a family photo, thus considered a serious event, so people wouldn't generally want to make goofy faces.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "Key_Floor_6286",
                    "body": "Absolutely! Life's too short not to enjoy the little moments. 😊",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nylonstrull",
                    "body": "Exactly! Looks like he's havin' a great time despite the rules ;)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Monscawiz",
                    "body": "Back then, taking photos was a serious and expensive occasion",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "brave007",
                    "body": "People. People say that. But tbf they say a lot of shit",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Natchos09",
            "body": "Tbh, i would love to meet that guy. Maybe he'll share his rice with me :)",
            "score": 125,
            "replies": [
                {
                    "author": "grantnel2002",
                    "body": "You probably wouldn’t want to meet him today.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "HardenedLicorice",
                            "body": "Too late, he has left his grave and is underway. He was summoned and he is coming.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "grantnel2002",
                                    "body": "🧟",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "juflyingwild",
                                            "body": "Instead of rice, he brings maggots.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "grantnel2002",
                                                    "body": "🤮",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Kiosade",
                                                    "body": "He’d just be bones at this point. Maybe he’d bring milk?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SharkDoctor5646",
            "body": "I love this photo. And the ones of Victorians laughing and goofing off",
            "score": 79,
            "replies": [
                {
                    "author": "MelonLayo",
                    "body": "And that one guy who painted goofy self portraits and is a meme today.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "molsminimart",
                            "body": "There's a whole genre of portraits called *tronies* that do a lot of exaggerated facial expressions as well!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Daisy_Charmm",
            "body": "The photo was taken during Jacob H. Schiff Chinese expedition when a young German scholar Berthold Laufer was sent to China to investigate the foreign culture. During the 3 years, long expedition Laufer gathered 143 photographs, however, there is no information on how he acquired them because there is no evidence that he took the photos himself. There is also no explanation of who is the Chinese man in the photo and why he decided to strike a pose like that. However, some people speculate that when a man was asked to pose for a photo, he wasn’t aware of a western tradition to keep s serious face during the process.\n\nFor around 100 years since photography was invented, smiling was a rare occurrence. It only started to become the norm In the late 1920s. You may wonder how this sort of tradition was born. Well, there several explanations. Some people argue that poor dental hygiene led people to smile less. And while most people could afford to have their photo taken probably once per lifetime, they didn’t want to go down in history by showing a toothless grin.\n\nOther’s say that the time it took to take a picture is to blame. However, it’s only partly true. While the very first cameras did, in fact, had a very long exposure time, some of which lasted around 8 hours, things swiftly changed. By the 1850s and 60s, the exposure time was shortened from hours to seconds, so people didn’t have to stay in the same position for hours, and capturing smiles became easier.\n\nBut probably the most plausible reason is that people early photographers followed the footsteps of painters. Back in the day, many portraits didn’t show smiling people, so it didn’t felt natural to allow people to smile in the photos too.",
            "score": 55,
            "replies": []
        },
        {
            "author": "Latter_Ad_1627",
            "body": "The old tradition of being serious in photos made me believe for an embarrassingly long time, that everyone was miserable all the time in The Past. While things were likely very bad a lot of the time, there was also joy and happiness. I adore seeing relic goofy photos, candid shots of old timey people having fun and smiling. It reminds me that even in hard times there is space for joy. ",
            "score": 34,
            "replies": [
                {
                    "author": "CrashTestDuckie",
                    "body": "Old stoicism because of early photography held over in a lot of society in weird ways. People have a weird belief that Native Americans didn't smile and we get the \"noble Indian\" BS from it.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "sikotic4life",
            "body": "This very much has \"Aang showing off his Airbending to ridiculous effect\" vibes",
            "score": 20,
            "replies": [
                {
                    "author": "MousseImmediate3718",
                    "body": "Glad I'm not the only one who noticed it",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "misterdrm",
                    "body": "https://www.reddit.com/r/ATLA/s/0irx9vjF2Y",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HappyLandscape6736",
            "body": "I bet he had the best photo, i love his smile.",
            "score": 12,
            "replies": []
        },
        {
            "author": "BonjinTheMark",
            "body": "That is an awesome photo.  Esp at that time.  He must have been a character",
            "score": 10,
            "replies": []
        },
        {
            "author": "SpecialistNote6535",
            "body": "Teeth like that in 1901?\n\nBro is rich",
            "score": 10,
            "replies": [
                {
                    "author": "iamadventurous",
                    "body": "Studies show that bad crooked teeth is a modern day problem. People back then didnt have terrible teeth like we are lead to believe. It has to do with the softer food we eat today compared to the food people were eating back then. Something to do with softer food not developing stronger jaw muscles and making the gums holding the teeth stronger.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Captain_DuClark",
                            "body": "This doesn't sound right but I don't know enough about teeth to dispute it",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "CavitySearch",
                            "body": "This isn’t something that would happen in 100 years.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "seventhdayofdoom",
                            "body": "Huh? Humans have been eating soft food since they discovered fire.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrDrPr_152",
            "body": "I’m getting last airbender vibes from this guy",
            "score": 6,
            "replies": []
        },
        {
            "author": "Martydeus",
            "body": "Reminds me of Angs photo from Avatar",
            "score": 5,
            "replies": []
        },
        {
            "author": "BrytheliaSolenne",
            "body": "A large part of the people of the time believed that smiling was appropriate for the mentally ill. For several centuries there was an opinion that smiles were the prerogative of jesters and clowns only. The absence of smiles in ancient portraits was also bad teeth, because in those days dental problems were widespread. However, like any broad generalization about cultural traditions is difficult to prove because of the many exceptions. There are more than two thousand photos online, some of which show people with wide, genuine smiles.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Lemon-Of-Scipio-1809",
            "body": "I just love this photo!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sad-Mastodon-1401",
            "body": "He knew the real secret to happiness, just enjoy your rice",
            "score": 2,
            "replies": []
        },
        {
            "author": "imtourist",
            "body": "I wish I owned a restaurant just so I can this picture up everywhere.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GuerrillaRodeo",
            "body": "An old coworker of mine had this picture framed above his desk. Never failed to put a smile on my face.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Disastrous-Start2067",
            "body": "It took a long time for a photo to be taken in those days. Hard to keep a smile on your face. Also, people generally had bad teeth, so they didn't smile in photos.",
            "score": 6,
            "replies": [
                {
                    "author": "Kiosade",
                    "body": "Nah by then they could take them instantaneously. Victorian-Era people just had a stick up their ass.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "StayOnTarget2",
                    "body": "Made me smile because we have that same table!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "OneSensiblePerson",
                    "body": "Right, the exposure time the cameras of the day required took too long for people to easily hold a smile still enough to capture it in focus.\n\nThis is a great photo.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Iowa_Dave",
                            "body": "Many photo studios had braces that you could press your head/neck against to [help you keep still.](https://64.media.tumblr.com/983ae7b9aaef4a0e1e1766e1b69d237e/51ed58db19495d06-54/s400x600/b2745053330524899083c1211cee815415fa8117.jpg)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "OneSensiblePerson",
                                    "body": "Yes, they did, and that helped. A lot of those photos where the braces are visible were later misidentified as post-mortem photography.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Iowa_Dave",
                                            "body": "I can see why, propping up dead people for one last portrait was definitely a thing.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "OneSensiblePerson",
                                                    "body": "It was. But the equipment for propping up dead people had to be a lot more heavy duty than the braces for just helping to hold someone's head in place.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BizarroMax",
            "body": "Wasn’t the exposure time for photos back then super long, hence nobody smiled?",
            "score": 2,
            "replies": []
        },
        {
            "author": "DreamChant",
            "body": "Someone watches Vsause",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoseWinterr",
            "body": "I like the cut of his jib",
            "score": 1,
            "replies": []
        },
        {
            "author": "mahogani9000",
            "body": "I love him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational_Bee_5253",
            "body": "“Well sir, it takes several moments to develop so”\n“I can smile for a minute”",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomeOneRandomOP",
            "body": "Ive seen this quite a few times, and it still makes me smile. Thanks for sharing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Mastodon-1401",
            "body": "Pure joy captured in a time when smiles were rare",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capt-J-",
            "body": "Simply ahead of his time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SurvCall",
            "body": "How I feel when I eat rice",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrFancyPanzer",
            "body": "This photo looks like an advertisement for rice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katsukuma",
            "body": "This is still an awesome photo!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DLCMotroni",
            "body": "Wow, he looks like a young Pharrell Williams, literally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "a8bmiles",
            "body": "The original Mikey Bustos!",
            "score": 1,
            "replies": []
        },
        {
            "author": "starcaro",
            "body": "He looks Happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Lock6921",
            "body": "Happy guy, love it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "BleednHeartCapitlist",
            "body": "His teeth look amazing compared to people of today",
            "score": 1,
            "replies": []
        },
        {
            "author": "OddImpression4786",
            "body": "Is this a real photo? Source?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jnj0109",
            "body": "Actually, at that time, most people in Asia couldn't afford eating pure white rice every day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pinkamenadianpie",
            "body": "I SWEAR TO GOD I THOUGT THAT WAS KAI CENAT😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Muirefa",
            "body": "That's a Stephen Chow parody of the \"Happiest Man in China\",  taken in 1901, the who man didn't know you're supposed to be serious when posing for a photo",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 0,
            "replies": []
        },
        {
            "author": "Frequent-Hunter532",
            "body": "That guy is dead long ago. He doesn't care.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Adventurous_Soil_184",
            "body": "He looks black lowkey",
            "score": -3,
            "replies": []
        }
    ]
}