{
    "title": "Tell me…",
    "author": "Negative_Budget_598",
    "subreddit": "Republican",
    "rank": 376,
    "score": 2,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 17,
    "url": "https://cmsny.org/importance-of-immigrant-labor-to-us-economy/",
    "id": "1iqk31n",
    "selftext": "Do unauthorized immigrants contribute to the american economy?? \nall opinions welcome ",
    "comments": [
        {
            "author": "murderinmyguccibag",
            "body": "IMO it does not matter.  If you want to live in America, there is a process to go through.  I welcome immigrants to our country, but I want them to be properly vetted.  We have enough crime as it is, I want to do our best to ensure the folks coming into America are good people.  I think most of them are, but not all.  We have to protect our citizens and if even one American citizen is the victim of a crime at the hands of someone who is not documented....that is one too many.",
            "score": 5,
            "replies": [
                {
                    "author": "GiediOne",
                    "body": ">We have enough crime as it is, I want to do our best to ensure the folks coming into America are good people\n\nTo me, this  is the critical issue.  Illegal immigrants do pay taxes and most likely will work.  But it's the criminals and the ones that *don't work* that take resources rather than contribute  to our society.  That is a big problem.   \n\nSocial safety nets are a scarce resource, and they need to be allocated to the most needy *LEGal American Citizen*  not some person that wants to take advantage of the American system as a parasite.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "murderinmyguccibag",
                            "body": "Exactly!  I don't understand why the Left does not understand this.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alarming-Upstairs963",
            "body": "They add supply to the labor pool. This results in lower wages and lower inflation. \n\nSame thing with “free trade” headlines look good but in other words it’s selling out the American worker.",
            "score": 5,
            "replies": []
        },
        {
            "author": "feenytodd",
            "body": "They broke the law and they’re here illegally. That’s all that matters. \n\nWe are either a nation of laws or we’re not.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": []
        },
        {
            "author": "chasonreddit",
            "body": "Yes they do.   Most have to get jobs.  Many that don't contribute to the underground economy, which is still economy. \n\nThe key question is, do they contribute NET to the economy?  They pay many taxes as we all do, sales, indirect property tax through rent, if they have a green card, income tax withholding (although most do not hit a rate where they actually pay, and many get a refund.)\n\nOn the other side, they cost a certain amount, each resident of the US does.  Emergency health care, fire and rescue, police, and of course education.  Water and infrastructure.  And honestly we are all supposed to be chipping in on defense, roads, regulatory agencies, all of that government overhead.\n\nSo is it a net contribution or a net cost?  I don't have reliable numbers but just jotting on the back of envelope it comes out pretty much a wash.  Now if they are not working, are sending amounts of money out of the country, or increasing crime, that is obviously a loss for those.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Goldfishfarmer_",
            "body": "I'm a little tipsy... but from what I remember, about 6 million people in the US are unemployed and around 8 million illegal immigrants have jobs here in the US. I assume those are mostly crappy low paying jobs. So kind of? It's a fine line, too many probably bad, too few bad. But we have become dependent on them in so many ways. Annnnnd I forgot the original question.....",
            "score": 0,
            "replies": []
        },
        {
            "author": "YaBoyEar1",
            "body": "Like someone said they add to the labor pool and usually do the jobs Americans don’t want to. They buy things in American and in turn pay sales taxes. Most undocumented immigrants do pay federal, state, and local income tax. They rent homes/apartments so indirectly pay property tax. So yes they play a part in the US economy just like everybody else.",
            "score": -2,
            "replies": []
        }
    ]
}