{
    "title": "Trump Admin Tells Europeans to List Troops Available for Ukraine",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 343,
    "score": 7,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.breitbart.com/europe/2025/02/16/put-up-or-shut-up-trump-admin-reportedly-calls-on-europeans-to-list-troops-and-weapons-available-for-ukraine-peacekeeping-force/",
    "id": "1iqxfqc",
    "selftext": "",
    "comments": [
        {
            "author": "Comprehensive-Tell13",
            "body": "Is it possible that Trump isn't turning his back on Ukraine but rather forcing those that are forcing the US to protect Ukraine into protecting Ukraine 🤔 think about it why should we be the police of their problems when they won't police their own problems.",
            "score": 13,
            "replies": [
                {
                    "author": "LordZombie14",
                    "body": "This is exactly what he is doing. It's not just our job when they are right next door.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "R3ditUsername",
            "body": "As much as it sucks for Ukraine, and the message it implies, I would agree that a land trade to Russia for peace with a European peace force in place is a less worse outcome than a continued war.  War sucks, especially a modern war of attrition.",
            "score": 10,
            "replies": [
                {
                    "author": "Northzys",
                    "body": "They shouldn’t have put the “land trade” out there before the actual meeting. Conceding before the talks have even happened is a 0/10 strategy.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "SoBasso",
                    "body": "Terrible idea to concede land. If you do that it's just a waiting game until Russia continues its imperialistic ambitions. Ukraine can look forward to another invasion perhaps 5-10 years from now.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoGoPlug",
            "body": "4D chess",
            "score": 3,
            "replies": []
        },
        {
            "author": "Grouchy-Capital3408",
            "body": "Zelensky is arguably more of a dictator than putin is, why do these people love ukraine so much?",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Grouchy-Capital3408",
                            "body": "Yes zelensky is a puppet dictator that cancelled elections, not to even mention the lands russia occupies are russian speakers that were being oppressed by ukraine",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Grouchy-Capital3408",
                                            "body": "America has been subject to anti russian propaganda for over a century now, the lefties are just the ones taking advantage of it.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SoBasso",
                            "body": "NATO is a defensive pact. Having a NATO neighbour isn't going to lead to war, unless the non-NATO country, in this case Russia, starts the hostilities.\n\nI'm baffled that people still buy into the \"Russia was provoked\" nonsense. Fact is, Russia has had imperialistic tendencies ever since the Soviet Union fell. Look at what they did in Georgia. Moldova too. Belarus! Also, was the annexation in Crimea also \"provoked\" by the West, or NATO? No, it wasn't.\n\nPutin is trying to piece back together the USSR.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FrameCareful1090",
            "body": "Germany had plenty of firepower to start WWII, I'm sure than can put a few things together. Tell them to visit the BMW plant that made the Nazi bombers I am sure they can do something,\n\n  \nFun fact: Germany is STILL the world's expert and manufacturer of CREAMATORIUMS, how in the name of fuck are they even allowed to sell them?",
            "score": 0,
            "replies": [
                {
                    "author": "Feeling_Dig_1098",
                    "body": "Today's Germans are nowhere near equipped as their warring fathers of WW1 and WW2. Mind you most Europeans are sensitive now days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -8,
            "replies": [
                {
                    "author": "Lopsided_Vacation_29",
                    "body": "The US has been the premier investor of NATO, while the EU screws us every chance they get. It's FAFO time. Everyone is a badass until it's time to do badass things.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "SoBasso",
                            "body": "This is not true. Europe combined has spent more on Ukraine than the US.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Lopsided_Vacation_29",
                                    "body": "For ONE SINGLE INCURSION, where they have a stake in the outcome. They are in NO WAY being altruistic. The EU is the new Monarchy.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SoBasso",
                                            "body": "Are you calling the Russian invasion into Ukraine an \"incursion\"? Really?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Lopsided_Vacation_29",
                                                    "body": "In the scope of Military history, it's merely a blip.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "SoBasso",
                                                            "body": "It's actually an extremely significant war. Mostly due to the nature (trench warfare, drones, extremely high amount of casualties, Russia goes into war economy) but also due to the fact that it's an imperialist war, ie. Russia wants to take over Ukraine. Conflicts like that are rare.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lopsided_Vacation_29",
                                                                    "body": "Russia wants Ukraine to stay out of NATO. That's all. There is no evidence for any conspiracy theories of \"imperialism\". Do you know how many countries have been taken over by other countries in the history of time? Before you can be a smart-ass first you have to be smart.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SoBasso",
                                                                            "body": "How about you tell me how many countries have been taken over by other countries in the last 30 years? Not many right? And you call this one just a blip?\n\nAlso, one million casualties across both sides seems significant to me, perhaps not you, as is the fact that this is taking place on Western Europe's doorstep.\n\nNot too mention the nuclear sabre rattling...\n\nBut I have a feeling you oversimplify things so this will probably fall on deaf ears.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Bronqiaa",
                                    "body": "Key word, COMBINED",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SoBasso",
                                            "body": "Yes combined. You want Malta by itself to spend an equal amount as the US?\n\nMalta has half a million inhabitants.\n\nYou guys are aware that the EU consists of numerous countries, all of which have an inferior GDP and population compared to the US?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Bronqiaa",
                                                    "body": "And we are one country. Remind me how much we have spent in military aid compared to the INDIVIDUAL countries of the EU",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SoBasso",
                                                            "body": "Yes, the US spent more on Ukraine than Malta. Also more than Portugal and Czech Republic. More than any individual EU country.\n\nBut not more than the EU combined.\n\nAs I mentioned, some countries in the EU have less than a million inhabitants and the GDP of North Dakota.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Bronqiaa",
                                                                    "body": "I think you’re missing the point. It’s misleading to say that the US hasn’t spent as much as the EU because it’s multiple countries. You’re comparing multiple countries to one country",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SoBasso",
                                            "body": "[https://www.ifw-kiel.de/publications/news/ukraine-support-tracker-europe-clearly-overtakes-us-with-total-commitments-now-twice-as-large/](https://www.ifw-kiel.de/publications/news/ukraine-support-tracker-europe-clearly-overtakes-us-with-total-commitments-now-twice-as-large/)\n\n# Ukraine Support Tracker: Europe clearly overtakes US, with total commitments now twice as large",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "M_i_c_K",
                    "body": "Good thing you have no say or clue... 😆",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Feeling_Dig_1098",
                    "body": "To what degree are they doing as much as the US? Folly from the inside is seen the most, it is ridiculous that you as a US citizen are not aware of the degree of effort the US has placed in comparison to our limited allies.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Coast_watcher",
                            "body": "They keep accusing the US as the world policeman. Well the US is now doing de-fund  the police like some want and they're whining .",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}