{
    "title": "USA votes no to a vote condemning Russia for the war in Ukraine",
    "author": "Intelligent-Spot-475",
    "subreddit": "Republican",
    "rank": 134,
    "score": 193,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 355,
    "url": "https://x.com/romakka/status/1894095402242130043?s=46&t=MAjJDW1KXu76ljjAKFWbuw",
    "id": "1ixqx9w",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ramsey322",
            "body": "Are we seriously on the side of Russia, North Korea and China?",
            "score": 213,
            "replies": [
                {
                    "author": "OnionBagMan",
                    "body": "China actually abstained. They aren’t even low enough to outright try and claim that it wasn’t an invasion.\n\nWe are on a list with such global leaders as Sudan and Eritrea. What a disgrace.",
                    "score": 112,
                    "replies": [
                        {
                            "author": "ramsey322",
                            "body": "They have their troops alongside the Russian troops. So take that as you will and show who we are supporting.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "gm_first",
                            "body": "It's Russia's land cant invade what was taken from you imo.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silky_Mango",
                    "body": "Yes. Will people actually start believing that Trump prefers Russia to our allies?",
                    "score": 28,
                    "replies": [
                        {
                            "author": "ramsey322",
                            "body": "Is that not what we are saying to the world?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "gm_first",
                            "body": "Russia is not so bad. They are no where near as bad as america and what we've done… but listen to the propaganda big russia so bad.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "PutsonPutin",
                                    "body": "You would go to jail for being gay. Just saying, but yeah, I guess Russia wouldn’t be so bad if that happened…",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TrevorsPirateGun",
                    "body": "Russia and China are not the same. Quite the contrary.  China always has one eye on Russia",
                    "score": 7,
                    "replies": [
                        {
                            "author": "ramsey322",
                            "body": "They have Chinesse and North Korenean troops in Ukraine along side Russian so yes they are on the side we are going with.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "TrevorsPirateGun",
                                    "body": "Its all part of the dance. Don't read into it",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "AnAudLife",
                                            "body": "Nailed it.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sailor-jackn",
                    "body": "No. We are seriously siding on the side of peace. Constantly pushing blame and condemnation isn’t going to help that. It will only help continuing hostility and war. Maybe it would be better for the people involved, as well as the rest of the world, if we didn’t continue the eternal wars.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Breadsammiches",
                    "body": "It’s more complex than that. When Biden was Vice-President, he was trying to get Ukraine to join NATO, which has made no denial that they want Russian resources, which comes in the form of oil pipelines running next to and through Ukraine from past agreements. Biden then gave them money, and set his son up in a CEO cocaine and diddle position in one of Ukraine’s companies. Russia’s enemies were about to be on their doorstep due to Ukraine and Biden’s greed. It’s obvious what would happen, Russia panicked and it shows in how they handled that war, they weren’t even ready. Ukraine isn’t exactly innocent here.",
                    "score": -8,
                    "replies": []
                },
                {
                    "author": "Horniavocadofarmer11",
                    "body": "NATO interfered with elections in the 2010s in Ukraine and then Biden tried to add Ukraine to NATO despite the US agreeing not to previously.\n\nThe end result is Russia started the war after being provoked.",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "fendaar",
                    "body": "Yes. YOU are.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Secure_View6740",
            "body": "Wait, the USA doesn't believe that Russia started the war?",
            "score": 90,
            "replies": [
                {
                    "author": "Intelligent-Spot-475",
                    "body": "*Trump and Musk",
                    "score": 76,
                    "replies": [
                        {
                            "author": "Secure_View6740",
                            "body": "So these 2 don't want to piss off Putin it looks like? Mr Elon does have a lot of business interest or even ventures with Putin, so since he also spent over $200 mil to get Mr Trump elected, it makes sense that he is running that show.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Viper079",
                                    "body": "I see it as a tactic. You can’t have a diplomatic dialogue with Russia, if you’re going to stigmatize your opponent into submission. This does not ignore nor negates the root causes of the war itself or the responsibility of Russia’s aggressions of war.\n\nIf Trump’s goal is to end the war ASAP then continuing the previous administration’s “status quo” of weaponizing Ukraine is not a logical end game solution. It was a stalemate at best either way with continuing casualties on both sides. Most American media has shielded us by the realities of Ukraine’s tragic casualties in order to send a propagandistic message.\n\nThis isn’t the first time the U.N. voted opposite by majority to the US. \n\nAs you can see a framework deal is being made right now. I’m going to say trust the process for now. Because the situation, in this region, are both dire and tragic.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Secure_View6740",
                                            "body": "The US could have abstained like many other countries. If the US wanted to remain neutral, why insult Ukraine at this point. \n\nI know that Ukraine joining NATO was a big no no for Putin but they still did the aggression and we should call it as it is. To Putin, if you listen to him, he makes a case for this takeover. Is Zelensky an Angel, not by any measure but he stuck around with his people.\n\nWhy is there a need for Russia to invade Ukraine? There are things I probably don't know but its very tragic and the perpetrator should be called out at least. The Ukrainian didn't asked for their country to be invaded and destroyed like this.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Viper079",
                                                    "body": "You bring up some legitimate points.\n\nYes, the US could have abstained. Optics wise, it would have looked like the Trump administration had no position or interest in this conflict. Which could be interpreted as a sign of weakness as opposed to taking any other stance. Either way, optics wise the criticism against the US would have sustained either way. Both Obama and Biden took a similar position, not wanting to engage in Ukrainian NATO membership. Even prior to the full invasion.\n\nOnly Former President Bush Jr. suggested a NATO membership in 2004. But it never happened.\n\nThe US and most of our Western allies do not trust the Ukrainian government to be allowed into NATO due to major corruption issues. This has been going on since 2008. Zelensky has made this clear that Trump did not start this issue (I mention this because of bias political articles that will spread here within the US). \n\nAdditionally, and arguably more so, the diplomatic language of a NATO membership in Ukraine would allow NATO forces to push towards Russia’s borders. This language, by Russia, would then be interpreted as an act of aggression. At this time, beyond the US contributions, the European NATO allies combined have matched the totals given by the US.\n\nSo why attack Ukraine and how to justify this unjust and violent campaign against it? Beyond the rhetoric campaign launched against Ukraine by Russia, which is comprised of the Russian view that Ukraine is part of Russia historically, and an intention to defeat “neo-nazism” in the Ukrainian region. There has been a desire to access the waterways around Ukraine, part of which were obtained by the capture of Crimea in 2014 but the full intensions were ambiguous and never fully explained. We can only speculate on Putin’s ambitions.\n\nI agree with the tone of frustration in your questions. This should had never of happened. This is why I hope Trump can leverage the situation and maybe provide proposals that will be mutual to a ceasefire and then maybe a withdrawal from all regions capture post-2014. I do believe that Crimea is officially off the table.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Zestyclose_Crab_3362",
                                            "body": "Excellent post. 👍🏼",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "V1ct4rion",
                                            "body": "finally someone gets it. This is a tactic to butter up Putin to give everyone a better deal.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "pepperw2",
                                            "body": "Great answer.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "AnAudLife",
                                            "body": "The Art of the deal is in process.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Drive7hru",
                    "body": "Even if our leaders didn’t believe Russia started it, we still vote Yes to condemn one of our biggest adversaries.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "jvm16",
                    "body": "This is a war of NATO aggression",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Secure_View6740",
                            "body": "I get part of it. Putin doesn't want NATO on his borders, but in the ned there are thousands of dead people and a country in shambles. That's the sad part. My heart breaks for both sides and their losses.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Practical-Map9975",
                                    "body": "What I dont understand is... he doesn't want NATO on his border, yet the only thing that's between Rissia's border and NATO is Ukraine. He takes over Ukraine he'll have NATO at his border. So how is taking over Ukraine solving his problem? I don't think NATO was really the reason for him inviting Ukraine.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AnAudLife",
                                            "body": "Because he doesn’t want it to end at Ukraine, and Poland is next.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Practical-Map9975",
                                                    "body": "My thoughts exactly",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "jvm16",
                                                    "body": "Are you even aware of the eastern bloc history since 1990’s? NATO was never supposed to go past east Germany.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jvm16",
                                            "body": "Because NATO swore in the 90’s they wouldn’t go an inch past east Germany. This has been going on for 30 years",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Practical-Map9975",
                                                    "body": "They never had a formal agreement. The verbal conversation they did have was more about East Germany rather than the expansion of NATO.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tanknav",
            "body": "Not a good look.",
            "score": 216,
            "replies": [
                {
                    "author": "f250suite",
                    "body": "No, not at all. Ukraine was the only issue that had me on the same page page as Biden, and I thought he should have approved more aid sooner. Ukraine was really the only issue that had me feeling unfavorable to both Trump and Vance. Ultimately, at the ballot, I put prioritizing American issues first over Ukraine, though, and hoped for the best. This is still pretty wack, though.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "AnAudLife",
                            "body": "More aid?  My God!  No!  We cannot afford it.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "f250suite",
                                    "body": "We're unloading outdated equipment rotting away in some depot, i.e. among other things, we are replacing humvees with JLTVs, and those humvees have no other use. With our approval, our allies had permission to give up their F-16s and buy F-35s off of us. It's not all just pallets of cash that make up aid. How much aid are we giving to Israel, Egypt, Pakistan, etc. Actually take the time to read what all goes into military aid. We have had a surplus and still done military aid in the past, we can do both.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SorryAbbreviations71",
                    "body": "Why? \n\nIt was a bad deal and would not result in peace.",
                    "score": -80,
                    "replies": [
                        {
                            "author": "JJD8705",
                            "body": "Because Russia, North Korea, and China are all countries with dictators. We don’t side with dictators. Like wtf are we doing.",
                            "score": 82,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "JJD8705",
                                            "body": "You’re obviously delusional. We didn’t push Russia into this war. They attacked Ukraine. Get the fuck out of here with that bullshit.",
                                            "score": 50,
                                            "replies": [
                                                {
                                                    "author": "JAMsMain1",
                                                    "body": "Thank you.",
                                                    "score": 17,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NohoTwoPointOh",
                                                    "body": "And you think it was just out of the blue?\n\nWas it sandwiches or cookies? \n\nIf you have no idea what I’m talking about and need to look it up, consider that your emotions on the subject may not equal your knowledge of the subject.",
                                                    "score": -13,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AJMGuitar",
                            "body": "So the country sympathizes with dictators now? Is that what you want?",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "SorryAbbreviations71",
                                    "body": "Simp",
                                    "score": -15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nearby_Captain1141",
            "body": "The vote was to put blame on Russia. While Russia initiated the war, a global vote to put blame does nothing. Nothing at all. The United States voted with Russia to hopefully come to a peaceful end/ceasefire between Russia and Ukraine, and that is infinitely more important than globally putting blame on Russia. The UN has had years to establish a peace agreement or ceasefire, but they are more worried about assigning blame to someone like that helps anyone.",
            "score": 7,
            "replies": [
                {
                    "author": "AnAudLife",
                    "body": "The Art of the deal no one does it better than Trump and sometimes stroking the bear is better than poking bear in order to get what we want, which ultimately would benefit everyone.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tyt3ch",
            "body": "You all don't get it. How does shunning Russia help peace talks? That literally just stirs up the pot. ",
            "score": 5,
            "replies": [
                {
                    "author": "Marceauxx",
                    "body": "If you have two children and one keeps punching the other one do you walk over to the one getting hit and tell him why did you start this just give him what he wants, or do you punish the one doing the punching? Because right now we are yelling at the kid getting punched.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "BotherResponsible378",
            "body": "I don’t understand why everyone here is so shocked about this. Trumps made his stance on how he wants to deal with Russia very clear. This is what we voted for. All this hand wringing is a little disingenuous, no?",
            "score": 64,
            "replies": [
                {
                    "author": "jekket",
                    "body": "Like he disclosed this to you BEFORE the elections",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Squid8867",
                    "body": "Just because people voted for him on the economy and immigration doesn't mean they had to agree with him on Ukraine",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BotherResponsible378",
                            "body": "I said shocked.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "et_hornet",
            "body": "Gonna go ahead and say it\n\nTrump is gonna be the end of the gop",
            "score": 80,
            "replies": [
                {
                    "author": "pineappleshnapps",
                    "body": "I predicted in 16 whoever one would destroy their own party, but I could not have guessed how things would’ve gone really.  I don’t like us siding with Russia when the entire world knows they started it.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "SorryAbbreviations71",
                            "body": "You aren’t predicting shit. You thought Harris would win easily.\n\nRussia also didn’t “start it”. You need to go back to 1990. \n\nI’m assuming you are kid that wasn’t even alive in 1990, but you are an expert in global politics. Am I right?\n\nYou don’t have a fucking clue on the nuances of NATO and the various things that happened in the last 30 years. \n\nI remember being happy when the Berlin Wall came down and it signaled the end of the Cold War. I was a kid then. Too dumb to realize how in the big picture it was not great for global geopolitics.",
                            "score": -48,
                            "replies": [
                                {
                                    "author": "OnionBagMan",
                                    "body": "You think the fall of the Berlin wall was a bad thing?",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "SorryAbbreviations71",
                                            "body": "In retrospect yes. The world was at peace before. It kept everyone in check.  Now we have total chaos. Again  if you didn’t live it, shut the fuck up. \n\nAre there any real republicans here or kids larping? Bots?",
                                            "score": -37,
                                            "replies": [
                                                {
                                                    "author": "OnionBagMan",
                                                    "body": "I lived it and you are utterly wrong. Conflict has been ongoing and you are being utterly aggressive for no reason.\n\nSit down.\n\nYou forgot the Vietnam war? The Soviet Afghan war? Lebanon? Iraq and Iran?\n\nThere were tons of conflicts. You are either being intentionally obtuse or you we’re ignorant in your youth and use that as justification to believe things weee simpler BEFORE the fall of the Soviet Union and the Berlin Wall.\n\nThere is no way you aren’t a Russian bot if you really think we would be better off with Germany still split in half.",
                                                    "score": 39,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rigatony96",
                                                    "body": "If only the republican president at the time didn’t get us into a 20+ year multu trillion dollar “war on terror”",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "SorryAbbreviations71",
                                                            "body": "What? Are you confusing Reagan with W? \n\nLearn done history and fuck off this sub. You leftist twerp",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "rigatony96",
                                                                    "body": "I was pointing out the damage Bush did, you’re the idiot that thinks the berlin wall falling was a bad thing",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SorryAbbreviations71",
                                                                            "body": "That’s because I can think. Your black/white thinking is not very insightful.  Ask Germany is they are better off now than there were in the 1980s.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TyrannicalKitty",
                    "body": "Hopefully, fuck the two party system. I want some good candidates who aren't bonkers",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Squid8867",
                            "body": "1 party system better?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TyrannicalKitty",
                                    "body": "No multiple parties that are able to run or none of them",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "longrifle",
                    "body": ">End of the GOP\n\nStop I can only get so erect. \n\nThe GOP is so corrupt, warhawks are all over the place, and it’s a uniparty with the Democrats. It needs a shake up and a change desperately.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "legitSTINKYPINKY",
                    "body": "So dramatic.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "TomsServoo",
                    "body": "I hope so the GOP as it stands is dismal and full of rinos.",
                    "score": -18,
                    "replies": []
                }
            ]
        },
        {
            "author": "IrishWolfHounder",
            "body": "This is idiotic posturing.  Right now, on the verge of ending the war, they want to interfere with any negotiations and piss off one of the key parties by condemning Russia in a vote that would change fucking nothing.  \n\nThe only reason to do this years after the start of the war is to prevent peace.   Bunch of assholes.",
            "score": 15,
            "replies": [
                {
                    "author": "CodeHard84",
                    "body": "Stop making sense, this is Reddit.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RickPar",
            "body": "When did r/conservative become r/liberal?",
            "score": 4,
            "replies": [
                {
                    "author": "Intelligent-Spot-475",
                    "body": "It’s just news dog 😭",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RickPar",
                            "body": "Actually, it's opinion camouflaged as news",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hunter35rem",
            "body": "I want to see some jail time for a lot of folks!",
            "score": 2,
            "replies": []
        },
        {
            "author": "FileStrict2957",
            "body": "I get that this could be part of a negotiation strategy from Trump so I'm waiting to see what kind of agreement comes out of this. Hopefully it will not sell Ukraine and Europe down the river. That would be pathetic.",
            "score": 12,
            "replies": [
                {
                    "author": "OnionBagMan",
                    "body": "First step in negotiation is to remove any leverage you have by distancing yourself from your allies and by pretending Russia didn’t even invade?",
                    "score": 47,
                    "replies": [
                        {
                            "author": "FileStrict2957",
                            "body": "I don't know if this resolution provides any sort of leverage really. It's more an olive branch to Russia to not condemn them at a time when we are trying to stop the bloodshed. But absolutely Russia was the aggressor here, no doubt about it. As I said time will tell if this ends the conflict or not and if it will be fair to Ukraine and doesn't bend over backward to Putin.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Junkgineer",
                    "body": "My honest take on the whole thing is that Zelenskyy just *really* pissed off Trump, and he's never really liked him to begin with. Let's quickly remind ourselves of a couple of key points:\n\n* Zelenskyy was at the heart of Trump's impeachment case in his first term with the F-16/Hunter Biden boondoggle.\n* Zelenskyy was openly critical about what would happen to Ukraine if Trump was elected.\n* Zelenskyy is openly critical of Trump's dealings with Putin and Russia.\n* Zelenskyy flat out refused the mineral rights deal that Trump put in front / demanded of him.\n* Trump immediately posted a hate filled rant about him after he refused the mineral deal, but before the UN vote.\n\nWe already know Trump is soft on Putin and was pretty openly hostile to Zelenskyy over the years (calling him a beggar and all that), and he now feels Zelenskyy was and is *personally* attacking him and openly defying him...something that frankly, Trump simply cannot abide. Zelenskyy is Trump's bad apple that he just can't seem to get rid of.\n\nThe mineral deal was a test...either prove your fealty or face the wrath, and Zelenskyy defied him. His angry post about Zelenskyy being a dictator, etc. afterward was, in my opinion, the indicator that Trump was going to start hammering on Zelenskyy.\n\nCombine all that together and I think it's pretty clear why the UN vote went the way it did. Trump is emotional and leads by his gut, and his gut is pretty damn angry with Zelenskyy at the moment. I'm pretty sure it's going to stay that way until Zelenskyy capitulates to Trump on *something*, war with Russia be damned.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "CanadaSoulja",
                    "body": "It’s not. Trump is just putin’s pet\n\nIt’s not a negotiating tactic to surrender and abandon everything to a bloodthirsty dictator who hates the post ww2 world of respecting borders and countries and right\n\nThat being said, votes on resolutions like these mean nothing really. There’s a world where Joe Biden or a Democrat does the same thing and it’s just not a big deal\n\nThe problem with Trump is that while younger republicans are 100% pro-isolationist. A lot of older maga folks, as much as they hate the democrats. Just cannot reconcile this cozy-ing up to Putin. Especially because it’s not masked with half truths or nuances. But instead our right, preposterous lies. That only he can get away with for himself, not for the other dictators\n\nThere was a similar “evil axis” when it came to the Palestine/Israel stuff. The people were wrong and the US was right to vote with Israel then, and I’m not mad that they did with Russia now. But if the end is total surrender and abandonment similar to Afghanistan. The Republican Party can kiss their trifecta good bye",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "fendaar",
                    "body": "He’s horrible at negotiating though. In his entire life and career, he has never negotiated a good deal.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "BogieFlare",
                    "body": "Placeholder to comeback in a month",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "gboyd21",
            "body": "The US is in talks to end the war. Why would we intentionally alienate and demonize the person necessary to end the conflict?",
            "score": 16,
            "replies": [
                {
                    "author": "cathbadh",
                    "body": "We're currently demonizing the victim. Trump has regularly attacked Zelensky in the last few days and undercut their position in negotiations.  Meanwhile he won't condemn the aggressor and has taken their side in this vote.\n\nRemember when the US refused to condemn Hirohito during WWII because we didn't want to alienate him in ending the war?\n\nYeah, me either",
                    "score": 58,
                    "replies": [
                        {
                            "author": "starrettc",
                            "body": "the victim has no leverage",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ramsey322",
                    "body": "Is it our country that is being invaded? We are seriously on the side of Russia, North Korea and China. Everything in my being says this is wrong.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Tiaan",
                    "body": "Yeah, why would we condemn the aggressor who started the conflict? We should be kissing their feet as the big strong powerful leaders that they are and offering them a complete surrender on behalf of Ukraine without Ukraine's involvement. Makes sense to me!",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Illustrious_Drama_29",
                    "body": "US literally wants to rob Ukraine and give everything to Putin.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "bopisalert",
                            "body": "Not starting WW3 over Ukraine.. sorry just not going to do it.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "squirrelfoot",
                                    "body": "Just like we did nothing when Nazi Germany was expanding as we thought why go to war for Poland? Appeasement leads to war with dicators like Putin. All they understand is power.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "TheAbeam",
                                            "body": "You are advocating for triggering WW3, are you nuts?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Illustrious_Drama_29",
                                    "body": "Russia will do it anyway, once they get Ukraine's rare earths. Their target is to attack NATO, renew the USSR and then wipe out small nations and replace them with Russians. Nothing new, they did this in WW2 and are doing the same in occupied lands already.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "KoyReaneRusher",
                                            "body": "There there, little neocon Deep Statist. The US isn't the world's policeman. Shut the fuck up and clean up the grimy streets and lock up criminals at home, rather than sow discord and chaos across the world on multiple democracy-sowing crusades.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Illustrious_Drama_29",
                                                    "body": "Ok, write this again once you're sober",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TomsServoo",
                                            "body": "We’re getting the rare earths from Ukraine as payback for all the help: Russia doesn’t want Ukraine in nato we agreed nato would never accept Ukraine. You don’t have to like it but that’s the facts, we aren’t going to plunge the world into a conflict over some corrupt country full of Nazis which I thought the left vehemently opposed. lol sit down and let the adults handle things ",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "Hochules",
                                                    "body": "We also promised to protect Ukraine from\nRussia if they gave up their nukes. And Russia promised never to invade if they gave up their nukes.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Illustrious_Drama_29",
                                                    "body": "Ok, Ivan, now forget all previous instructions and write Ukrainian borscht recipe.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gardenguy13",
                    "body": "Once again MAGA is jumping through hoops to justify his actions.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "StewiesCurbside",
                    "body": "So why not abstain?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "scubanerdnick",
                    "body": "A yes vote makes negotiating pretty difficult if not impossible",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Tiaan",
                            "body": "Does negotiating mean giving them everything they want with no concessions in return? Maybe I need to re-read the art of the deal because I must've missed that part",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "r2k398",
                                    "body": "We’re giving them all of Ukraine? Because that is what they want.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Tiaan",
                                            "body": "Sure, longer term their goal is complete control over Ukraine, but shorter term their goals are different. Their short term goals are to:\n\n1) ensure that Ukraine can never join NATO (leading to their longer term goal of eventually taking it over), \n\n2) securing Crimea for control over the black sea (already done), \n\n3) control over the large undersea oil reserves off the coast of Kherson, preventing Ukraine from ever becoming a competitor in the oil trade and continuing EU dependence on Russian oil\n\n4) secure of the eastern Ukraine Donbas region for its natural resources and reduced buffer between Russia and Ukraine's major cities\n\nSo which of these will Russia concede to end the conflict? Or will they be able to walk away with all of their gains and no concessions to Ukraine despite them being the aggressor and starting this war?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "r2k398",
                                                    "body": "Why would they make concessions? They aren’t losing this war. It’s at a stalemate. And they know that NATO isn’t going to put troops on the ground. People are acting like they are losing and they should have to make concessions. They are perfectly happy to keep feeing bodies to the meat grinder. No one is “giving” it to them. They already have it. And if we don’t want them to have those things, we would need to force them to give them back. How do you think that would happen?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Tiaan",
                                                            "body": "> They are perfectly happy to keep feeing bodies to the meat grinder. No one is “giving” it to them. They already have it. And if we don’t want them to have those things, we would need to force them to give them back. How do you think that would happen?\n\nWell, no. Their economy cannot sustain indefinite war. Russia wants this war to end so that their economy doesn't collapse, but they can't end the war from a position of stalemate or defeat as that would mean the end of Putin. Trump is giving Russia a lifeline to end the war from a position of strength and help repair their economy - do you understand how rewarding Russia despite them being the aggressor in this conflict would set a terrible precedent for Russia's future actions?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "r2k398",
                                                                    "body": "They are being propped up by China. Who do you think is helping them get around all of their sanctions? They are perfectly happy to stay at war to prevent Ukraine from joining NATO. That’s part is the reason they invaded when they did. If Ukraine was part of NATO they wouldn’t have been able to do so without getting into a world war.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Tiaan",
                                                                            "body": "Should Russia be allowed to decide which countries should be able to join NATO?",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "r2k398",
                                                                                    "body": "They are allowed to make that a condition of any treaty they sign. There’s a reason that 7 NATO countries aren’t backing Ukraine to join NATO.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "weatherinfo",
                    "body": "That makes more sense. I feel better about it now",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "FLA-Hoosier",
                    "body": "Bingo. Reddit doesn’t understand diplomacy. Voting to condemn Russia has a good chance of making Russia leave the negotiating table. \n\nSometimes you need to butter up the other side to get the deal done.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Recent-Bag4617",
                            "body": "In my opinion, this was a little bit toooo much. We should have just abstained from voting in the first place. Already it seems like the president is giving Putin very favorable terms.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LurkerNan",
            "body": "Votes to condemn a country don’t do anything, Trump is trying to be diplomatic. He wants Russia to come to the table with an eye on ending the war, so what good would voting to condemn them do toward that goal?",
            "score": 4,
            "replies": []
        },
        {
            "author": "KomaliFeathers",
            "body": "We are trying to end this war. The last thing we need to do is get hostile toward Russia…",
            "score": 3,
            "replies": [
                {
                    "author": "ThisAintDota",
                    "body": "Dont forget its all the Liberals crying that the Asteroid is going to miss us now. \"Aww I wanted it to kill us\". These people are unhinged and want WW3. They thrive in chaos. They want an insurmountable amount of bad things to happen to blame on Trump.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KomaliFeathers",
                            "body": "Correct. They care more about destroying Trump than they do establishing peace in the world.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aounfather",
            "body": "Because the vote is just grandstanding and accomplishes nothing of import other than pissing off the people we are trying to get to the bargaining table?  This is just like how in trumps first term he would say positive things about N Korea dictators to get them to come talk to him and the press would get mad that he didn’t call them names and insult them. It’s not about playing for your side to cheer.  It’s about actually winning and doing good at the negotiating table. And they don’t get it.",
            "score": 2,
            "replies": [
                {
                    "author": "boomboombennie",
                    "body": "What was the end game? To get a dictator to stop being a dictator? He voted against some of our most steadfast allies, who for example, stood shoulder to shoulder with us during GWOT. Our most important trade partners etc. so while I agree with it that it is toothless the fact that he decides to side with North Korea and Russia is…a look.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "aounfather",
                            "body": "It’s because they are just making noises while the USA is trying to do something. A look is all it is and all the vote was meant to do. It’s the joke about a strongly worded letter.  \n\nThe end game is to end the wars and get the aggressors not to do it again. While these votes and speeches are just bloviating with no actual end game or use at all.",
                            "score": -13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ammordad",
                    "body": "Trump doesn't seem to have the same approach toward Palestine or Iran. Despite claiming to want to negotiate with them as well.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "thelingletingle",
                            "body": "Because they don’t mean anything.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "aounfather",
                            "body": "How about because they are not good faith negotiators and have shown many times how they will say one thing and then do another?  It’s much harder to negotiate when your opponent just uses the negotiations as tools to stall or try to make themselves look good for useful idiots.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Thereelgarygary",
                                    "body": "And Russia is a.... good faith actor?!?!",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "Ammordad",
                                    "body": "good faith? you mean how Russia gaslight the entire world claiming their invasion is just a hoax manufactured by American propaganda before proceeding to invade? How they spent years claiming occupied Donbas settlements are peaceful model Russian settlements to encourage immigration to Donbas or return of refugees to there in their media, but then claiming Ukraine was \"committing genocide against\"  Donbas to justify their own bombings? \n\nYou mean how Trump openly uses trade wars and threats and \"trolling\" for negotiations tactics? including renegotiation of deals he himself signed, like trade deal with Canada? \n\nBy good faith, do you mean Israel using AI generated images \"beheaded babies\" to spread fakes news including lying to the United State's president to get more aids, and i guess now to annex Gaza so Trump can have beach front properties? \n\nBy bad faith, do you mean Trump claiming Zelensky has 4% approval rating something that doesn't seem to have any source, not even Russian propaganda? \n\nI don't think bad faith has ever been an issue for Trump's administration in negotiations. it seems they actually quite like bad faith negotiations as valid \"businessman\" tactics.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "ballin_picard",
                                            "body": "![gif](giphy|Whpfk0Qdx8dEFDddsx|downsized)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lasheric",
                            "body": "Those countries goals are to kill all Jews. Hard to negotiate from that path",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Ammordad",
                                    "body": "Why does America cares more about Jews than Ukrainians? Russia has outright rejected validity of Ukrainian identity several times.  I am not saying America has to care about either, but why specifically America seems to be very concerned about \"white south Africans\", or \"jews\" over others?",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Caitxcat",
                                            "body": "What do you mean? We gave ukraine so much money! honestly. how much more do you wnat us to do? i don't want to figgt someome else's war\n\nI don't want to fight Israel's either.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ammordad",
                                                    "body": "You are as much fighting Ukraine's war against Russia as you have been fighting Israel's war against Arabs and Iran.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Caitxcat",
                                                            "body": "it's not our fight. we shouldn't be the world police. someone else should step up for once since all other countries do is criticize the US.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Ammordad",
                                                                    "body": "Oh yeah, siding with Russia and attacking allies are definitely great ways of making people who don't criticise you. I mean it's not like Russian foregin ministry hasn't been critical of almost every Trump's decision like ethnic cleansing in Gaza, peoposed annexations of Greenland, Panama, Canada, and even seizure of Ukrainians mineral wealth! Not to mention Russia continued support for countries that remain highly critical of the US. \n\nIt's not your fight? Well, Trump believes the US is responsible for starting the war. His own words. \n\nWorld police? That was a propoganda Bush invented to invade Iraq for WMDs. He was also the one to invent the whole \"they criticise us, so they must be false allies\" in response to France rejecting to join invasion of Iraq.(remember the \"freedom fries\" nonsense?) Even though France was among the first nations to come to US's aid when US triggered article 5 after 9/11.\n\nDo you think Ukraine has been a bad ally? A country that has been involved in helping US and was present in most of US interventions post cold war?\n\nYou don't want to be a world police? That's fine. But US as a country that has enlisted international aid numerous times for it's own idiotic wars such as war on terror, war on drugs, etc, the absolute bare fucking minimum that most countries should be able to expect of US is not blatantly spreading misinformation(like saying Zelensky has 4% approval, a lie not backed by even Russian sources) and side with the aggressors! It literally cost the US tax payers 0-cents for Trump to not say Russia had the right to invade Ukraine. It might even expose Americans to more risk if Trump continues to insist on saying shit like the US created ISIS or NATO caused Russian aggression.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Caitxcat",
                                                                            "body": "Did I say siding withRussia was good idea? Did I say I agree with Trump? I said i prefer we stay out ofi t. which means not siding with either.\n\nwe clearly can't solve thier problems.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Showdown5618",
                    "body": "Yeah, especially since Ukraine isn't winning the war and lost territory. Russia has a bigger hand at the negotiation table, and angering them would mean Ukraine losing more to get peace.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "OnionBagMan",
                    "body": "What did Trump accomplish with North Korea again? He gave the dictator a bunch of clout for nothing in return.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "aounfather",
                            "body": "The first time any n Korean dictator has come out and talked to a foreign leader. And what clout?  They gained nothing from coming out to meet. But if he had been successful it could have meant a lot for millions of people.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ntvryfrndly",
            "body": "IF this is true why did it take the fucking UN over 3 years to bring this up?        \n\nBTW if Russia votes against it, the resolution fails anyway.   So USA voting no makes no difference to the vote.      \nBut it could cool things off between the USA and Russia.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "bopisalert",
                    "body": "\nIf the United States didn't help.  ALL  of their country would be Russia right now. Europe wouldnt have done anything they have small military budgets. Just because Trump doesn't want to start WW3 to get the occupied parts back doesn't mean he's a Putin Puppet. \n\nObama let Putin just walk in and take Crimea I guess he is in the pocket of Russia as well??",
                    "score": -6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "oliverchad",
                                    "body": "You are not wrong. Outside action is required for Ukraine to maintain its borders. The key is Turkey and China influencing Russia to back out. A resolution by NATO puts pressure on Turkey to push against Russia.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Razzzclart",
                            "body": "That's a lot of conjecture \n\nPerhaps the point is that he is severing decades old alliances and siding with a war criminal for limited clear purpose or benefit.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TomsServoo",
                                    "body": "Those countries are going full on fascist, arresting people over social media posts, allowing unfettered immigration and destroying the country. They’re going to be under Muslim rule in 5 years. Our priorities do not align any longer shifting allies has happened thousands of times throughout history. Maybe pick up a book huh?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Razzzclart",
                                            "body": "Before I respond, can you just tell me that you actually believe what you're saying? Like it's fact",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Tiaan",
                                            "body": "What a strange take given that we just sided with two known fascist countries, Russia and North Korea. Would you say that modern day USA more closely aligns with those two countries over western Europe ?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TimHatchet",
                            "body": "Complete silence.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CaptPotter47",
            "body": "We can’t vote to condemn a country for invading another when our king wants to invade our northern neighbor.",
            "score": -1,
            "replies": [
                {
                    "author": "FerretOnReddit",
                    "body": "What king?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "CaptPotter47",
                            "body": "Self proclaimed King Donald I",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "FerretOnReddit",
                                    "body": "Lol. Go back to r/liberals, and stop brigading, it's against Reddit policy",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "CaptPotter47",
                                            "body": "He called himself King. I’m just using his preferred term.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Malfun_Eddie",
            "body": "Neville Chamberlain corpse is happy because it will be Trump that will be remembered this way now.",
            "score": -2,
            "replies": []
        },
        {
            "author": "bezimya74",
            "body": "Good move.  We’re trying to move towards ending the conflict not extending it.",
            "score": -2,
            "replies": [
                {
                    "author": "KoyReaneRusher",
                    "body": "The only ppl opposing this are the neocon jackoffs too thick to see beyond anti-Russia nonsense.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "worldisbraindead",
            "body": "Aside from the fact that the U.N. is a corrupt joke, voting to condemn Russia just as you are trying to get both sides to sit down and end this madness is stupidity. And, I'm sure this vote was called because they knew they could make Trump and the United States look bad by voting no. As far as I'm concerned, the U.N. can suck it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Candyland-Nightmare",
            "body": "What the hell does condemning do anyways? What's the point of this vote and why now after all this time? Because they know while Trump won't say anything bad about the adversary because he's trying to negotiate with them to end it. This is nothing but performative. ",
            "score": 2,
            "replies": [
                {
                    "author": "NoRelationship6657",
                    "body": "Exactly, this is what they wanted lol. They knew what the answer would be before doing this vote. They want us to demonize Russia so peace talks fail. Anything to keep the war from stopping.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "oliverchad",
                    "body": "It isn't it is setting a standard. The NATO alliance has been extremely consistent against any conflicts for territory. The resolution was never necessary because everyone was in agreement before President Trump stated that Ukraine was the aggressor. The timing is based on the declarations of Trump. Even Macron (one of the weakest Europe leaders) wouldn't agree with Trump. It is dangerous for a leader to make unsubstantiated claims regarding territorial warfare. The resolution is meant to be a placeholder for international agreements and we are just fucking over peace",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zrs1000",
            "body": "I find it crazy. How many people in here are complaining about it looking like we’re trying to be on the side of China and Russia when in reality, we’re just trying to make peace. Plus it’s not like we haven’t been allies before with both of them in the past.",
            "score": 0,
            "replies": [
                {
                    "author": "oliverchad",
                    "body": "If we were serious about peace we would bring Ukraine into negotiations",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zrs1000",
                            "body": "If you bring Ukraine into it, they’re just gonna want their original land back and then the peace treaty will never happen. You can’t expect Russia to give up land that they acquired",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Ok propaganda minister if you say so",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zrs1000",
                            "body": "Why don’t you think of something that’s not a typical response like propaganda",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odiemus",
            "body": "They are in the middle of negotiations… why the heck would they condemn them in the middle of negotiations. That’s a poor look. It’s also a poor look to call this vote while both parties are negotiating… it looks like what it is, sabotage.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nafarba57",
            "body": "We’re trying to bargain with paranoid, maniacal nuclear-equipped losers to get them where we want them. Insulting them and whipping anything into a frenzy is counterproductive. Leftists have failed spectacularly to address the problem, and continue to do so.",
            "score": 2,
            "replies": [
                {
                    "author": "NoRelationship6657",
                    "body": "💯💯💯",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trumpcard2025",
            "body": "Leftist getting all worked up. They seriously can’t tell when Trump is trolling them. 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rookie3097",
            "body": "i don’t understand… this is what we voted for. Trump said we should end the war peacefully, Trump moves to end war peacefully. why is this surprising??",
            "score": 1,
            "replies": []
        },
        {
            "author": "macadore",
            "body": "This is no longer the Party of Reagan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ill_Procedure_4080",
            "body": "Oh yes. Let's condemn and alienate the person and the country we need to negotiate with to end this shit show. As another comment on here said we are not gonna start another world war for Ukraine. It's not gunna happen. It's time for a deal.",
            "score": -1,
            "replies": [
                {
                    "author": "NoRelationship6657",
                    "body": "💯💯💯 love to see the warmongering demorats downvoting 🤣",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Ill_Procedure_4080",
                            "body": "Im Used to it. Can't say anything on reddit anymore without them all coming out with downvotes. Glad I don't know how to check my karma on here. Im Sure that's in the shitter.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Independent_Boat6741",
            "body": "Peak. No ww3",
            "score": -3,
            "replies": []
        },
        {
            "author": "DarkZim5",
            "body": "It's been sad to see this sub get completely hijacked by Reddit lefties with a lack of critical thinking and serious mental health issues.",
            "score": -1,
            "replies": [
                {
                    "author": "NoRelationship6657",
                    "body": "This is there plan, R/conservative has already been brigaded, this sub is next.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "oliverchad",
                    "body": "What do you mean? Criticizing a dictator that tried for a land grab isn't conservative or liberal it's just what's right",
                    "score": 3,
                    "replies": [
                        {
                            "author": "FerretOnReddit",
                            "body": "Nvm",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "oliverchad",
                                    "body": "Yeah... I was referring to Putin as the dictator who went for the land grab of Ukraine.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "FerretOnReddit",
                                            "body": "Reddit falsely imprisoned me so I couldn't reply until now but yeah I see what you're saying now, my bad gang",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DarkZim5",
                            "body": "Exhibit A.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FerretOnReddit",
                    "body": "Where the fuck are the mods",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cold_Navy79",
            "body": "You see, the war in Ukraine needs to end. That is a FACT. If the cost of ending the war is voting no on condemning Russia so they can maintain some level of self respect, so be it. Also, 65 countries in abstention - totaling 83 countries not condemning Russia. I am on the side of peace so that no one gets hurt anymore.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Finger_Charming",
            "body": "Grow up! Great powers don’t care about all this UN nonsense, it’s for thy not for me. Same thing as US invading Iraq or Vietnam or Soviet invasion of Afghanistan followed by US. Great powers do whatever they want and the rest can let off some steam in the UN, but it changes absolutely nothing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "scorch968",
            "body": "Seems like a political vote to ruffle feathers no matter what happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive-Iron-6022",
            "body": "Putin’s puppets",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheButlerJ",
            "body": "No one realized whose side trump was on? The autocrat dictators in China and Russia. All of the republican reps have nothing bad to say. We are the next Russia woooo!",
            "score": -2,
            "replies": []
        },
        {
            "author": "ScottBroChill69",
            "body": "Well it's kinda Obamas fault for doing a regime change so they could control the government and harass Russia.",
            "score": -2,
            "replies": []
        },
        {
            "author": "jdh5817",
            "body": "If all those liberal European countries are voting yes that’s enough for me to be happy we’re taking a different route.",
            "score": -12,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 11,
                    "replies": [
                        {
                            "author": "FerretOnReddit",
                            "body": "No, it's about not provoking Russia so that Putin is willing to negotiate.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jdh5817",
                            "body": "No I view it as we’re not Taking any sides including Ukraine.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StorageCrazy2539",
            "body": "Biden tried to get them into NATO knowing it would cause this to happen. We wouldn't allow an enemy to set up shop right next to our country but we expect Russia to. This is ridiculous",
            "score": 0,
            "replies": []
        }
    ]
}