{
    "title": "BOMBSHELL: New FBI Director Kash Patel Launches Investigation Into James Comey's Secret 'Honeypot' Operation Targeting Trump's 2016 Campaign",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 123,
    "score": 192,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 27,
    "url": "https://conservativeroof.com/new-fbi-director-kash-patel-launches-investigation-into-james-comeys-secret-honeypot-operation-targeting-trumps-2016-campaign/",
    "id": "1iyayn2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grouchy-Capital3408",
            "body": "Good, now release the epstien files already, quit being sus.",
            "score": 32,
            "replies": []
        },
        {
            "author": "-Cerberus",
            "body": "gona be wild when he finds that people were pardoned by president trump for lying to the FBI about meeting with Russia.",
            "score": 12,
            "replies": [
                {
                    "author": "jbl1091",
                    "body": "The dems couldnt find anything to pin on him, what are you talking about",
                    "score": -6,
                    "replies": [
                        {
                            "author": "-Cerberus",
                            "body": "Yes, and it still happened. It doesn't mean any nefarious happened, but you do have to remember that Trump has to pardon people from his team that lied to the FBI about being in contact with Russia.  Why lie about it? \n\n\nhttps://www.bbc.com/news/world-us-canada-55420365",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "elwappoz",
                                    "body": "Would not trust or cite the BBC as a source for anything but weather.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "-Cerberus",
                                            "body": "Well thats unfortunate, but they are also simply reporting on the pardons form trump and what they were for. and Groge was pardoned after being busted for lying about talking to russia.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "elwappoz",
                                                    "body": "Not saying it isn't true, just that I would verify elsewhere. 👍🏻",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quirky_Chicken_1840",
            "body": "Finally!  Shine that spotlight in the dark corners of liberal corruption",
            "score": -1,
            "replies": [
                {
                    "author": "WildeBeastee",
                    "body": "Comey was a Republican until Trump fired him.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "OnionBagMan",
                            "body": "Comey also bombed Hillary during the election. ",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "lousycesspool",
                            "body": "> Comey was a Republican\n\nuntil he got TDS and decided to join the swamp\n\nhis actions are dishonorable - his first meeting with Trump was basically an attempt to hamstring Trump",
                            "score": -6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "billtamara",
            "body": "Such a relief to finally see our law enforcement and justice departments not being weaponized.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Malibucowboy",
            "body": "This doesn’t seem like the most efficient use of government resources.  I’m calling Elon!",
            "score": 0,
            "replies": []
        }
    ]
}