{
    "title": "Newly Confirmed FBI Director Kash Patel to Announce UFC Partnership for Agent Training",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 100,
    "score": 50,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 33,
    "url": "https://conservativeroof.com/newly-confirmed-fbi-director-kash-patel-to-announce-ufc-partnership-for-agent-training/",
    "id": "1izthxc",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ahent",
            "body": "I legit thought I was going to see a Babylon Bee link.",
            "score": 36,
            "replies": [
                {
                    "author": "BjornAltenburg",
                    "body": "Same",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dlw26",
            "body": "BJJ will be very common in LEO training going forward. My department started doing it two years ago.",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 6,
            "replies": []
        },
        {
            "author": "CanadaSoulja",
            "body": "Good idea, but these people also have real jobs that should still be prioritized.",
            "score": 5,
            "replies": [
                {
                    "author": "Busy-Method9970",
                    "body": "Yes but just like any other law enforcement job you have continued training. Every so many months you are required to train in different things. I'm not sure what FBI requirements are but for regular law enforcement it's pretty often. So many hours a cycle. It would serve a really good purpose to spend a couple of days every cycle or hand to hand combat tactics.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "sixtysecdragon",
                            "body": "I do not understand why you’d be down voted. One of the concerns many have had with current FBI is that the Special Agents aren’t sufficiently trained. Their firearms requirement is pretty minimal. It would seem having them spend time regularly engaging in the physical aspects of their job would be a good thing.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Busy-Method9970",
                                    "body": "Man I've done gave up trying to understand why some common sense comments get downvoted here lol.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "802Ghost",
                                            "body": "Bc it’s Reddit and it’s anti Trump all the time to some of the ppl who live in their moms basements.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "sixtysecdragon",
                                            "body": "Amen.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wafflehabitsquad",
                            "body": "The problem is the influence of money here that your comment doesnt touch on. Training is good, but obviously there is money being handed over for this to happen. We are again making the rich, richer, just with less steps and in the open. Hope this helps.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Okay_Sweller22",
            "body": "BAD ASS!! \n\nGet the Tates involved, we need alpha males to serve king trump!!",
            "score": -6,
            "replies": [
                {
                    "author": "DeanDaddyDugong",
                    "body": "Kickboxing, BJJ, and arms training is all you need!\n\nThe unstoppable King's guard!",
                    "score": -4,
                    "replies": []
                }
            ]
        }
    ]
}