{
    "title": "Department Of Defense To Cut Troops With Gender Dysphoria",
    "author": "Equivalent-Ad8645",
    "subreddit": "Republican",
    "rank": 96,
    "score": 204,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.dailywire.com/news/department-of-defense-to-cut-troops-with-gender-dysphoria",
    "id": "1izu1i5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cold_Navy79",
            "body": "The DOD discriminates against all kinds of medical issues. For example, you cannot join if you have Type 1 or 2 diabetes, too tall, too short, too skinny, too fat, missing toes or fingers… or if you can’t walk, can see, have a mental disorder such as being bipolar… Gender dysphoria is no different.",
            "score": 48,
            "replies": [
                {
                    "author": "FerretOnReddit",
                    "body": "I wouldn't call it \"discrimination\", it's more out of concern for these people's own well being. Being a solider while being blind or having schizophrenia or something like that... yikes, nobody should have to experience that. As someone with a certain genetic condition which doesn't seriously impair me but would still require me to get a waiver if I wanted to enlist, I wouldn't want to be in the military anyway. I'm on a med to manage my genetic condition, and when I don't have access to the med for longer periods of time, it starts causing issues, and I'm at risk of actually being seriously impaired, like as in paralysis from the waist down, or worse.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Cold_Navy79",
                            "body": "You’re right, there are some cases that can receive a medical waiver. That being said, there are some that cannot. People with gender dysphoria are 80% more likely to have suicidal ideations (this is a fact). In the military, we call them Suicidal Related Behavior (SRB). If you have an SRB, you are no longer in a deployable status and it can take months or years to clear the individual. In the cases I have seen (which is sadly more than I care to have seen), we have needed to medically process out these sailors for SRBs. \n\nI do not doubt their resolve and or their commitment to serve.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ct-5736-Bladez",
                    "body": "Tbf there are ways the dod can use these people they just refuses to have the slight headache in doing so. There are so many non combat roles that need filled constantly.\n\nE: Lol downvote all you want it won’t change the fact that the dod can use these people as pencil pushers or in the logistics chain",
                    "score": -2,
                    "replies": [
                        {
                            "author": "jmsnys",
                            "body": "The issue with that is regardless of what you consider a “pencil pusher” if they are forward deployed there’s always going to be the potential for contact and a reaction.\n\nEven the office jobs require you to maintain fitness and weapons qualification. Most of the pencil type jobs are filled by civilians (GS employees) not soldiers (or airmen or sailors or whatever your flavor is)\n\nRegardless of what your job is, the military is a constant stress pool. There’s a reason that the medical standards exist. It’s also not so much that we can get soldiers to join, it’s that we can’t get them to stay in",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Cold_Navy79",
                            "body": "You are 100% correct. They are called GS employee. None of the limitations I mentioned above apply to them. Great way to serve your country.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lower-Ad6435",
            "body": "The military is for national defense and to enforce the nation's interests abroad. A person's feelings about themselves are secondary to that. Those with gender dysphoria are a liability to any military unit, not an asset.",
            "score": 8,
            "replies": [
                {
                    "author": "twinkiesnketchup",
                    "body": "My son wanted to join the Air Force so badly but he was rejected because he had juvenile migraines. The AF determined that he was too much of a liability. I have compassion for anyone who wants to serve but it is not for everyone.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "author": "cjallin",
                    "body": "Why is people in quotation marks?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "dlw26",
                                    "body": "Despite your disgust for them, they are still people.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}