{
    "title": "Thanx to the Zelenskyy posts today, we got PROBABLY over 100 liberals identified and banned from the sub. Tag em when you see em and we will do our best to stay on top of it.",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 70,
    "score": 461,
    "upvote_ratio": 0.62,
    "num_comments (reported by reddit)": 329,
    "url": "https://i.redd.it/epufzf6lh0me1.jpeg",
    "id": "1j0ryzx",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RadioControlled13",
            "body": "I’m a free market conservative.  I’m a traditionalist Catholic social conservative.   I believe in traditional western values.  I live them.  \n\nThis sub is no longer conservative.  It is for populists.  \n\nReagan wouldn’t have given one inch to the Russians.  \n\nBan me, if you must, for speaking truths. \n\nA man is right, even if he is the only one who is right.",
            "score": 15,
            "replies": [
                {
                    "author": "flyingchimp12",
                    "body": "Well this is r/republican not r/conservative and guess what the Republican Party is populist as it should be",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "flyingchimp12",
                    "body": "So you would press a button that kills 500,000 human beings if it meant Russia can’t have eastern Ukraine… wtf is wrong with you.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Worldly_Ice5526",
                            "body": "Is that true? No. You’re reaching. You sure don’t sound like a republican.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Worldly_Ice5526",
                    "body": "I’m a Catholic as well. I couldn’t agree more with you. So much more needs to be done here. Let’s take Reddit back",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zaknoid",
            "body": "It's  crazy that its not enough liberals consume 99 percent of reddit, they just can't handle anywhere that has different thought.",
            "score": 147,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "No they cannot, they need to infect every last inch of conservative space.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Constant_Growth5751",
                            "body": "There's always twitter.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Lethal_Warlock",
                                    "body": "The Democrats are pretty much getting smashed on X these days. Huge numbers of Republicans dominate the space.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "NonNPC_MaxLevel",
                                            "body": "This definitely checks out. ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Viper079",
                            "body": "It’s like the movie 300 but in Reddit form. Or maybe a better example Bravo Two Zero. \n\nAbsolutely insane the topics I see just randomly pop in. The commentary feels like they all need to sit in an auditorium and get educated on reality. Having a difference in opinion is fine but they think they are having a digital protest and that’s going to get their message across effectively. 🤣",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ButterCup955",
                    "body": "i once talk to a liberal, he said hearin conservative view ll stress him out n made him depressed lol! weak minds weak minds, i swear their brain r made out of mashed potatoes.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "Moonshot_42069",
                            "body": "Don’t talk about mashed potatoes like that",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Ace_W",
                                    "body": "Agreed. Bit of gravy and black pepper, awesome 👌",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "West-Chest4155",
                    "body": "Wouldn't banning them be the same \"not handling a different thought\"?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Candyland-Nightmare",
                            "body": "If this was a general sub open to that, it would bethe same. Like pics or politics. But this sub is *for* Republicans. We don't complain about us getting a ban on r/democrat or any other sub only for them. You're trying to compare an apple to a fruit bowl. ",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "JustOldMe666",
                            "body": "there are few places we can discuss without them insulting, name-calling and bringing nothing to the conversation. That's why they shouldn't be allowed.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -4,
                    "replies": [
                        {
                            "author": "GameWizzard2",
                            "body": "I got banned from that for just linking an article that countered someone's argument🤣.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "HolyTerror4184",
                            "body": "Are you still full of creeps arguing for the legalization of child porn and asking what the capital of a country we're considering invading is, or have you purged yourselves?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Jolly_Job_9852",
                                    "body": "1. I've never seen anyone advocate for the legalization of that on the libertarian sub.\n\n2. No one that I've seen has asked that question.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "HolyTerror4184",
                                            "body": "1. Look elsewhere on the internet. \n\n2. Gary fucking Johnson asked that during a public debate.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ILikeLiftingMachines",
                            "body": "Lol-bertarians ain't it. The Anarcho-capitalists think you're compromised.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Candyland-Nightmare",
                            "body": "Are you forgetting the name of this sub? Getting banned on any not specifically aligned sub it NOT the same here.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BrandDC",
                            "body": "<<I don't understand why...\" \n\nLook at the sidebar on the right; \n\n# Who this sub is for\n\nThis sub is for Republicans and is curated for us. *This is not a debate sub.* We ask that if you are not a Republican, to leave the vote button alone.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "fartyunicorns",
                                    "body": "Polling suggests that about 30 percent of republicans want aid to Ukraine to continue. Are they not republicans?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "BrandDC",
                                            "body": "How is that relevant to my post addressing the liberal who seeks debates?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "fartyunicorns",
                                                    "body": "With the title of the post, I’m not sure how much republicans on here can support Ukraine without getting banned. But yeah having liberals constantly berating people on this sub sucks",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BrandDC",
                                                            "body": "Victim mentality. We all support Ukraine. POTUS's priority is America First. Allies second. \n\nBiden/Harris donated billions whereas others loaned billions. Trump is protecting American taxpayers while continuing to support an ally.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BrandDC",
                                                                            "body": "Ukraine isn't a \"no go\"... Stop this ridiculous misinformation.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "zachomara",
                                                                    "body": "I think that's a big point that people don't realize.  A lot of Trump's rhetoric is just that--rhetoric. He hasn't turned off the aid to Ukraine. He's making sure we get something out of it. In this case, it looks like he's gunning for rare earth metals and right of first refusal for Ukraine's redevelopment after the war is over.\n\nAs much as Europe likes to complain, it hasn't been European weapons systems that have triumphed in Ukraine. It was American Bradleys, M777 howitzers, Humvees, F-16 fighters, M4 rifles, and tourniquets (and others). The only thing they can really boast about is the Leopard tank, and there are a lot of asterisks there (we told them that the Abrams wasn't appropriate for the fighting because of logistics issues).",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Foolishmortal098",
                                                                            "body": "I’m so fascinated how you feel now that the things you claim he wouldn’t do, he has now done.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "zachomara",
                                                                                    "body": "Which is? Me specifically? Did I claim any of those?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Foolishmortal098",
                                                                                            "body": "Oh don’t be coy. You argued as if it was an acceptable tactic if it was only a bluff or negotiating tactic that you very clearly implied you didn’t think would happen. \n\nFocus on answering what you think now.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Trumpcard2025",
                                                                    "body": "I dunno, it’s hard to support a country that whines as much as Ukraine. 😂",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BrandDC",
                                                                            "body": "Don't blame the country for their President's words and actions.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Trumpcard2025",
                                                                                    "body": "Okay, fair. But they did vote him in. It’s hard to feel too sorry for them when they vote in a literal comedian",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "BrandDC",
                                                                                            "body": "Reagan was an actor. Trump is a real estate developer, former reality tv host, etc. \n\nBoth solid US Presidents.\n\nConsider your logic.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Trumpcard2025",
                                                                                                    "body": "Yeah, Trump is a real estate developer, and knows how to run a business. He’s the exact president we need right now after the libs have spent decades giving our money away to anyone who asks. And I wouldn’t have voted for Reagan if my country was on the brink of a war, you vote for the guy who has the balls to get things done.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "BrandDC",
                                                                                                            "body": "Your opposition would highlight his bankruptcies. [https://en.wikipedia.org/wiki/Personal\\_and\\_business\\_legal\\_affairs\\_of\\_Donald\\_Trump](https://en.wikipedia.org/wiki/Personal_and_business_legal_affairs_of_Donald_Trump)\n\n<<Yeah, Trump is a real estate developer, and knows how to run a business.>>",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Constant_Growth5751",
                                                            "body": "A strong mind can handle dissent. Guess that didn't happen during the meeting.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Constant_Growth5751",
                                                    "body": "None of those 'millions' are American lives - just dollars and stuff already paid from American suppliers, stockpiled by DoD. If anything - turnover helps the defense industry.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "murderinmyguccibag",
                    "body": "I was banned for asking someone for their opinion.  Then I was given the option to \"appeal\" and I asked why would I want to do that?  You banned me for asking a question, no thanks.  Then I was told if I sent them another message it would be harassment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moon_shooter01",
            "body": "Mod I have a question what would u consider a liberal? If u can check my comment history on this sub would u consider me one. I am not a big Trump fan but still consider myself a conservative.",
            "score": 70,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "This sub is for conservatives to converse, it's not for liberals to reply to everything with monologs on how much they hate Trump. \n\nWe aren't gonna ban ANYONE for their post history in other subs, only for how they conduct themselves here.",
                    "score": 154,
                    "replies": [
                        {
                            "author": "SackDanDruff",
                            "body": "Libs literally have the other 99% of Reddit to bitch and moan.",
                            "score": 90,
                            "replies": [
                                {
                                    "author": "WillofCLE",
                                    "body": "The marketing director for Reddit sits on the board of an NGO, financed by USAID, which in turn contributes money to Reddit. \n\nIn other words, our tax dollars are used for Reddit to attack Conservatives",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "UnrealRealityForReal",
                                    "body": "99.99% lol",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "marksman81991",
                            "body": "We aren’t like r/pics banning people because they have posted on this sub…",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "GriffinObuffalo",
                                    "body": "That's correct. Nobody gets a ban here for their post history in other subs. They get a ban here for their conduct here.",
                                    "score": 32,
                                    "replies": []
                                },
                                {
                                    "author": "independentlywrong",
                                    "body": "Lol I posted this a while back and got banned\n\nhttps://preview.redd.it/5q1sqeyhm3me1.jpeg?width=892&format=pjpg&auto=webp&s=672b416c6ee46fd6c92dfb63bb54bc40b6fcd382",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "SuchDogeHodler",
                                            "body": "Why,  that's funny as hell.  I think you just got caught by friendly fire.  You should message the mods about that.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "A_AR0_N",
                                    "body": "I got banned from r/pics just the other day and I never even joined it lol",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "atomic1fire",
                            "body": "This is the fairest way to do it.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "alexaboyhowdy",
                            "body": "That's good to know! \n\nI've been banned just for posting in some sites- not because of content, but because of where I've joined.\n\nWas speaking with a friend who pointed out- the left is saying there are going to be camps, forced marches, no medically needed pills, killing old people, etc...but that is what they would do, so they are projecting.\n\nAnyway, thanks for being good mods.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Moon_shooter01",
                            "body": "Ah ok thanks. By the way I’m wondering why all these political subreddits have so many memes about the opposing side. I don’t get what they have to do with politics on this sub and others. My friends and I are split between republican and democrat but they all want low prices too. I don’t agree with a lot of what they say but I can have a good argument about it. And I think doing this leads us closer together just like we should be idk abt mocking the other side it just annoys both sides I dislike when either one does it but idk maybe there is a reason? All the other posts are great tho. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Candyland-Nightmare",
                                    "body": "Browse the few right leaning sub, then browse any left leaning or simply left biased sub. See where you read more hatred, more insults, name calling, calls for violence. Its not coming from the right. They are the reason we can't come together and have a civilized debate. Its like arguing with a toddler. ",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Lethal_Warlock",
                                            "body": "Agree, I have an Aunt who’s in here late 70’s and she’s a hardcore Democrat. We spoke once on Facebook and the first thing out of her mouth was an attack and pure hatred. I tried to get her to drop the political rhetoric and she became even more aggressive. I swear this woman who I knew for decades as a devout Catholic was possessed by a demonic force. There was no middle ground as much as I tried.\n\nIt’s really sad how nasty they have become.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Conservatief",
                                    "body": "Conservatives aren't the ones who should reach out more since we have always done that. The lefts responce has always been hate, namecalling, (threats of) violence and exclusion. If we want to post memes mocking their stupid ideas or behavior, we will post them.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "BigIronOnMyHip45-70",
                                            "body": "Yeah for being the oh so inclusive left (self labeled of course) they are extremely closed off. Don’t share the same opinion on something? All of a sudden you’re a racist, misogynistic nazi and they want you gone or dead lol.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Constant_Growth5751",
                                    "body": "Going to the zoo versus zoo animals coming to you. \nPeople here like to go to the zoo.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sitherio",
                    "body": "I've commented a few times here. I'm not a big Trump fan either but my comments try to be neutral at worst. I'm here to see what Republicans are saying, not argue or belittle, as the mod post says I should, and I haven't gotten banned or warned yet.\n\n\n\n\nI think someone tried to label me for a ban but I was allowed to reply and avoid it I believe since it was a tech misunderstanding, not a \"liberal attack\".",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Jolly_Job_9852",
                    "body": "You should be fine. The basic rule of this sub is to treat everyone with civility as mod MikeyPH put it to me a few weeks ago. As long as you do that you should be fine. Happy to have you here.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "cordell-12",
                    "body": "I'm not a trump fan either, his Internet troll status I find hilarious though, who wouldn't lol. I'm not sure I am a full blown conservative either, many things conservatives value are masked ideals, they sound good but at the end of the day big businesses are the only ones who truly benefit from them. I feel when the boomer aged people pass, conservative will take on a new meaning with new ideals and I am okay with that. GenX here for reference",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Seedpound",
            "body": "Awesome news",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lifeisagreatteacher",
            "body": "The problem is they don’t come to post an alternative view. The problem is they just come to troll.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Canad3nse",
            "body": "I am a conservative and a trump supporter, but I am 100% on Ukraine's side.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LorrMaster",
            "body": "Being pro US-Ukraine relations is not conservative now?",
            "score": 27,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Not at all. But coming in hot with \"F that orange pos\" then going into a rant about how you didn't like his position is not how ANY true conservative I know speaks. \n\nThese people are liberals pretending to be conservatives. As mods, it's pretty easy to differentiate them from those who really just disagree with policy.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "LorrMaster",
                            "body": "Okay, that's good to know. I'm sure moderating right-wing subs on Reddit is an uphill battle. However, I have become increasingly concerned about the social media Biden-effect of \"you don't know you're driving off a cliff until you are already in free fall\". My conservative bubble is \\*not\\* happy with the Trump administration right now.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "independentlywrong",
                                    "body": "Should have been handled different for sure.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Candyland-Nightmare",
                                    "body": "No one is going to love everything he does. Also the left like to make a mountain out of every molehill he creates, so there's also that. ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "klikekyle",
            "body": "The amount of liberal democrats sitting behind their mighty keyboards on Reddit amazes me. I open the main page and even general subs like /pics is just liberals spewing their Trump Derangement Syndrome for all to see. Keep it up!",
            "score": 22,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "They've infected most of the top nonpartisan subs but protest when they're banned for trolling here. Mental.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Gallaga07",
                            "body": "I got banned from a bunch of non-partisan subs just for commenting in a Trump sub, it’s crazy",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alucard1991x",
            "body": "This mod needs a medal guys he’s out here making moves to clean up this garbage!",
            "score": 15,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "I'm trying 😂 u/MikeyPH also crushing it for us 💪🇺🇲",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "WPWeasel",
            "body": "Sweet. You're doing Gods work.",
            "score": 29,
            "replies": []
        },
        {
            "author": "FMJ-ake",
            "body": "Good. Liberals are out of control on reddit. Good thing they don't leave their mom's basement",
            "score": 22,
            "replies": []
        },
        {
            "author": "and-i-feel-fine",
            "body": "Ome of the old rules of the Internet - I forget from where - said \"any conservative online space must either ban liberals or become dominated by liberals\".  Because conservatives have jobs and families and social lives, while liberals just shitpost from their parents' basements all day, so liberals easily dominate most online spaces and they'll drown out conservative voices if left to spew their bullshit unmoderated. \n\nFree speech is different from *unregulated* speech.  The heckler's veto is beloved by the left but antithetical to the First Amendment.  It's as true online as it is in real life.\n\nThanks, mods. I hope when Reddit rolls out subscription-based subreddits you'll get to cash out some of your hard work.",
            "score": 19,
            "replies": [
                {
                    "author": "Coast_watcher",
                    "body": "I suspect some bots too",
                    "score": 8,
                    "replies": [
                        {
                            "author": "HandicapMafia",
                            "body": "Bad actors from shit hole countries too",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silver_Blacksmith_63",
                    "body": "Truly hope they don't roll out subscription models but I'm sure they will. I'm already mad I have to pay for\nAI because Google search has gotten so bad.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "and-i-feel-fine",
                            "body": "I might be a little countercultural here, but I still remember the old online adage: \n\nIf you're not paying for the product, *you're* the product. \n\nI'd rather pay for a search engine, and know I'm the consumer and it wants to keep *me* happy, then use a free service like Google Search where ad companies are the consumer and Google wants to keep *them* happy.\n\nThat's capitalism in action - the good and the bad. \n\nI know nobody likes to pay for online content. But wouldn't you like a version of Reddit that's designed to earn *your* money instead of advertiser money?  That doesn't have heavy-handed admin moderation because it's not worried about offending advertisers with harsh language or dank memes or hot takes, and just cares about being the free speech platform its subscribers want? \n\nThe more I think about it, the more I feel like paid subscription Reddit could lead the way back to the glory days of 2008 when free speech was genuinely free.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Silver_Blacksmith_63",
                                    "body": "Those days are long over--even if you're paying for it you're the product. X, Truth Social, Amazon Prime, Netflix, and on and on. They all reserve the right  to use and sell your data anyway.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "and-i-feel-fine",
                                            "body": "If I don't notice it, I'm okay with it. \n\nI mean, I know for a fact Cambridge Analytica targeted me as a swing voter in 2016 - and I'm grateful for it, because they gave me the information I needed to commit to President Trump 110%, and I don't know what sort of a loser I would be without them 😆 \n\nBut I think there's a difference between something like Google, which enshittifies my search results with all kinds of garbage from the people actually paying it, and something like Amazon Prime, which basically begs me to resubscribe every time I cancel it.  \n\nThey may sell my data, but I get a lot more out of it, because they don't want to lose my money either. And as long as they're prioritizing my user experience and giving me what I want, I'm okay with them selling my data.  And as long as I'm paying them, they have incentive to prioritize my user experience.  So it's a win-win.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Silver_Blacksmith_63",
                                                    "body": "Except it's not really win-win. If you don't notice it, you're not paying attention. The actual experience is the same. Amazon Prime Video now has two levels--with and without ads. And the videos used to be free. Same thing happened with X. Used to be free (and still has a free version, but if you compare the experience, it's not different). I really like the experience of Reddit--particularly that I don't have to pay for it and give them credit card information which will most likely be hacked like every other platform. \n   I'm sure it will happen, but Reddit is basically the last service like this.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "and-i-feel-fine",
                                                            "body": ">I really like the experience of Reddit--particularly that I don't have to pay for it and give them credit card information which will most likely be hacked like every other platform. \n\nThat's what DOGEcoin is for 😆 \n\nI get your point, but at the same time, it's unreasonable to expect in a world where everything is getting more expensive that you can keep the same service for free. \n\nSocial media, especially. Facebook started in what, 2006? 2007? This whole ecosystem is barely 20 years old, and for most of its life it was subsidized by venture capitalism in the hope that its business model would be profitable.\n\nTurns out the \"serve users and sell ads on the side\" model doesn't make enough money to cover expenses for YouTube and Facebook and so on.\n\nThat's why Musk had to change X.  And why the whole social media ecosystem is shifting to one of three models - subscription based, heavily monetized ad-based, or the fediverse network of small volunteer servers subsidized by individuals.\n\n In the long run everything costs money and *somebody* has to pay.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "and-i-feel-fine",
                            "body": "I recognize your sarcasm.  But look.\n\nI don't have a problem with, say, r progressive banning conservatives.  That sub is explicitly leftist and its rules ban for viewpoint.  They ban us, we ban them, everybody who posts knows what they're going to get.\n\nI have a big problem with giant subs like r politics and r news - or entire sites like Facebook and Instagram - banning conservatives.  *They* claim to be politically neutral.  Their own rules don't permit banning for viewpoint.  *American law* doesn't permit them banning for viewpoint.  But they do it anyway.\n\nThat's the difference between moderation and censorship.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StumpyJoe-",
                    "body": "That's not why liberals dominate most online spaces.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KingSlayer606",
            "body": "Hazza",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheTrackTitan",
            "body": "Fuck Zelenskyy and the ungrateful Ukrainians and mass media. Putin’s laughing his ass off at y’all.",
            "score": 2,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Don't be uncivil. Comment respectfully.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quirky_Chicken_1840",
            "body": "Great work!",
            "score": 2,
            "replies": []
        },
        {
            "author": "I_queefed_a_pickle",
            "body": "I think you can be a conservative and agree with the point that trump was trying to make but still be concerned with how he conducted himself and the message it sends",
            "score": 2,
            "replies": []
        },
        {
            "author": "_playing_the_game_",
            "body": "👏👏👏",
            "score": 2,
            "replies": []
        },
        {
            "author": "redditdidit0",
            "body": "Thank God for Mods with common sense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BadWowDoge",
            "body": "We are giving Liberals more of a voice here than they give us on any of the other groups…",
            "score": 2,
            "replies": []
        },
        {
            "author": "NonNPC_MaxLevel",
            "body": "There's still a lot of this going on unfortunately.... It seems like maybe you need more mods. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "FileStrict2957",
            "body": "I like that this sub will allow for discussion but will remove users that are liberal. My feed is filled with liberal BS. There's plenty of places to go for them and to push there agenda to people that don't want to even read it. And thanks for not getting into that Flaired User crap that some other conservative boards do. All it takes is a little moderation.",
            "score": 3,
            "replies": [
                {
                    "author": "CatWithoutABlog",
                    "body": "This place seems to have a better community and I see both better posts and conversations due in part to it not being so limited which attracts a lot more pests imo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quirky_Chicken_1840",
            "body": "Thank you!   I volunteer to to help moderate Griffin.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Smiles4YouRawrX3",
            "body": "Ya love to see it, fuck yeah!\n\n![gif](giphy|l2JhIUyUs8KDCCf3W)",
            "score": 7,
            "replies": []
        },
        {
            "author": "xxPOOTYxx",
            "body": "This needs to happen on the conservative sub. I'm convinced it's 95% astroturfed over there. All a bunch of Ukraine simps hating on Trump. Taking the fake moral high ground hoping liberals will love them. Eff zelensky, trump was right to kick him out for wanting us to fund an endless war.",
            "score": 11,
            "replies": [
                {
                    "author": "Justindoesntcare",
                    "body": "Oh dude 100%. They don't even hide it well. How often do you see comments with hundreds of downvotes or comments with thousands of upvotes and awards for saying something most people would have disagreed with just days ago?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ReaganRebellion",
                    "body": "I, a conservative, was banned from the conservative sub. They do plenty of it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Candyland-Nightmare",
                            "body": "Liberals somehow are able to get flair to shit post, yet my comments about obviously conservative, yet I can't get flair despite asking twice now. How are they able to?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BWSmally",
            "body": "Good.  I'm getting to the point where I don't want to respond even in this sub because the libs seem to taking it over. I posted some pretty basic conservative principles in another post this week that got seriously down voted.  Not exactly the open discussion of thoughts and ideas...",
            "score": 3,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "The bancount is def over 200 now, stick with us 🍻",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Candyland-Nightmare",
                            "body": "Can I get flair? I asked r/conservative twice but they ignored me. I'd like Vance2028, but a simple conservative will do. Thank you.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GriffinObuffalo",
                                    "body": "You can choose one we already have them set up! Three dots, top right in the app, select flair option 🇺🇲",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Candyland-Nightmare",
                                            "body": "I'm on mobile site, not app. I'll still look and see if it has that too.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Candyland-Nightmare",
                                            "body": "I found it. Thank you. Idk why conservative can't at least respond and tell my why I can't have flair instead of ignoring me. I've been on here for 8+ years. After a huge collection of bans for wrong think as well as auto bans, my account got nuked by reddit. \n\n\nIf it becomes more obvious Vance in running in 2028, add a Vance flair! I'm most excited about him this administration around.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BWSmally",
                            "body": "Thanks.  Overall, I'm enjoying the sub.  I'm more of a classic libertarian but I think this sub is a breath of fresh air from the rest of reddit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "v1nesauce",
            "body": "Great, nice to see the mods of a sub taking action and not sitting on their ass twiddling their thumbs. Glad I joined",
            "score": 3,
            "replies": []
        },
        {
            "author": "KetoLifter21",
            "body": "Thank you so much!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SignificantSnow1348",
            "body": "Yup. Thanks to all the mods, gotta love em. I had to argue with a liberal for an hour and thanks to the mods I no longer had to argue, so thank YOU and u/mikeyPH",
            "score": 9,
            "replies": [
                {
                    "author": "PsychologicalBit803",
                    "body": "Just report and mute them. Arguing with them is just giving them what they want. If they get blocked and nobody engages they lose.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SignificantSnow1348",
                            "body": "I did, I lost my shit and reported them",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GriffinObuffalo",
                    "body": "Fellow patriot 🤜🤛🇺🇲",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SignificantSnow1348",
                            "body": "🤜🤛🇺🇸🇺🇸🇺🇸🇺🇸 indeed the people in this sub are the last fellow patriots left on Reddit and some on r/conservative and r/conservatives",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "SignificantSnow1348",
                            "body": "https://preview.redd.it/tczpree8n0me1.jpeg?width=1080&format=pjpg&auto=webp&s=44143eb492d7315c21c55f12b78dc101049d39b0\n\nBeware. There is going to be a nationwide protest.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skeet_Davidson101",
            "body": "Banning people is some weak nonsense.",
            "score": 3,
            "replies": [
                {
                    "author": "Gwyneee",
                    "body": "It isnt if you want to actually converse with fellow conservatives and not liberals or astrotrurfs",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "GriffinObuffalo",
                    "body": "Banned 😂",
                    "score": 26,
                    "replies": [
                        {
                            "author": "NonNPC_MaxLevel",
                            "body": "Thats awesome lmao. Better yet, he went over to /Conservatives and tried to cry about being banned, and it looks like the same thing happened to him over there. Absolutely hilarious.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "GriffinObuffalo",
                                    "body": "Jokes on him, I'm a mod there too. Though I do spend most of my time here, I can always hop over and make a special visit 😂",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "NonNPC_MaxLevel",
                                            "body": "That's awesome!!! I love it. Its nice to see some of this stuff getting cleaned up too, much appreciated! These people have plenty of spaces already, especially on Reddit but also elsewhere, to spew their nonsense.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Rabbit9778",
                            "body": "based",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alivenotdead1",
                    "body": "It's fine. Compared to conservative bans, the dent made in dem numbers is quite weak.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "defect674279",
            "body": "Who’s afraid to debate them?  Do censors and silencers run this sub? Don’t get mad when they call you a fascist for it.",
            "score": 3,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Like moths to a flame 😂😂 Banned.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "ProblemSolver72",
                            "body": "Bro haha that's amazing keep it up",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "peeps2020",
            "body": "cringe post",
            "score": 3,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Cringe fake Republican. Banned.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "PooPooDooDooPants",
                            "body": "Lol, yessss weed these idiots out of here!\n\n![gif](giphy|Od0QRnzwRBYmDU3eEO|downsized)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThrowRA_startledslot",
            "body": "Gotta love free speech eh?",
            "score": -1,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Keep outing yourselves. Banned 😂",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "DEA187MDKjr",
                    "body": "and you gotta love censoring everyone and using the online definition of Nazi and shit. You liberals are so hypocritical, literally a double standard with yall",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mmura09",
            "body": "Ban them all please. I posted in r/national parks that I thought hanging the American flag upside down was un American and got banned. What a joke",
            "score": 2,
            "replies": []
        },
        {
            "author": "vipck83",
            "body": "I have to wonder how many of those crying over “the  disrespectful and embarrassing way Trump treated our precious little Zelenskyy baby” actually saw the entire video. \n\nI also am loving how “THIS IS THE FINAL STRAW!!!” … again. \n\nOhhh baby, I thought the last *insert thing you are told to be mad about* was the last straw.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quirky_Chicken_1840",
            "body": "I’d happily help moderate",
            "score": 2,
            "replies": []
        },
        {
            "author": "fffanguy",
            "body": "Yes Sir!! 🫡",
            "score": 2,
            "replies": []
        },
        {
            "author": "shield124",
            "body": "What a joke. Not having any free speech is what is bad about liberals. I guess both sides are fucking nuts now.",
            "score": -2,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "It's a PARTISAN SUB, the left owns 98% of Reddit, we've got a handful of subs at best, get over it.\nBanned.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "the_nytman",
                            "body": "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)\n\nBased 😩😩😩",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "SignificantSnow1348",
                                    "body": "Reported",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "the_nytman",
                                            "body": "For? The mod is based af for this, I’m so sick of this sub being overrun",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ButterCup955",
            "body": "as much as i hate liberals, i support free speech, unfortunately there isnt a single platform dat tolerate bipartisan discussion nowaday. youtube used to do great, but liberal love suppressin free speech, n turn it into liberal communist-tube.",
            "score": 1,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "This isn't a debate sub though, it's a place for conservatives to chatter.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "BjornAltenburg",
                            "body": "Republicans at least, As someone who is very active in local politics and has worked his own campaign the few times I've tried bringing up like issues with the data center, lack of support at the national level with candidate infrastructure, and god knows so many issues with fund distribution and deadlines; tend to fall under the radar compared to just endless news articles pushed by bots. I wish we would talk about ground campaign and digital infrastructure issues.  [https://ballotpedia.org/Bjorn\\_Altenburg#Campaign\\_themes](https://ballotpedia.org/Bjorn_Altenburg#Campaign_themes) Me for the record.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jolly_Job_9852",
                    "body": "R/moderatepolitics does bipartisan discussions. It's very nice to hear other views than my own and see another perspective.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "socalsilverback",
            "body": "Just want to say thank you to our mods here ,  thanks yall great job🫶👍🤞",
            "score": 2,
            "replies": []
        },
        {
            "author": "FlashpointStriker",
            "body": "I will still never understand how so much of the GOP decided Putin was a reasonable partner for peace. President Reagan saw clearly the kind of threat the Russians posed to the free people of Europe; they will not stop trying to  remake the Russian Empire until they are stopped. There is nothing more conservative than standing for liberty worldwide, which is why we (the US) spend fifty years after WW2 fighting to preserve capitalist, democratic states  threatened by the godless Communist dogs. Ukraine today is what Poland was in the 90s and what South Korea was in the 50s when we drove the Reds from their soil.",
            "score": 0,
            "replies": [
                {
                    "author": "Xin_chao2u2",
                    "body": "Ummm, America did not drive the Soviets out of Poland nor South Korea.\n\nSolidarity union  movement over two decades toppled the Russian backed government that enabled Marshal law in early 80s before it all fell apart in 89. Soviet troops did not leave Poland until 93.\n\nRemember Korean War? The south and north are technically still at it, we left because we lost and the Korea's were divided / still are.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FlashpointStriker",
                            "body": "We backed the Poles the entire time, including secretly sending money to Solidarity and by publicly showing support for the Polish national movement. We could not drive the North Koreans out of North Korea in large part due to the Chinese Army, but we did save 1/2 of Korea. We won the Korean war because we completed some of our objectives while the Reds completed none of theirs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Acmer77",
            "body": "They have almost all the reddit to post what they think. If they specifically come here to troll, they should be banned from the internet. I am not a republican, but I do respect your place and your rules.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crowefeathers",
            "body": "Griffin you are doing gods work man, keep it up",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Then just go away. No need to play \"martyr\"... You won't be missed.\n\n<<Hi, can I be banned? I support free speech. Banning anyone for slightly not agreeing isn't what I want.>>",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "JoRhino1982",
            "body": "https://preview.redd.it/p6mc26ci61me1.jpeg?width=1080&format=pjpg&auto=webp&s=3c2f3efec4ee16219de6b130c94dd224102f623c\n\nI run counter ops the best I can ..",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Don't ne naïve. The trolls are obvious.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aeropar",
            "body": "Can someone fill me in, what's the latest?",
            "score": 1,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "With the President and Ukraine? Or what appears to be going on in the sub?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aeropar",
                            "body": "Zelensky",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jolly_Job_9852",
                                    "body": "At the present time, it's in a holding pattern.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Xeroaze",
            "body": "Sadly, this is the only reddit sub that I can build karma for me to go spend. 99% of the rest of reddit I get downvoted into oblivion for saying things like \"I'm happy with my life\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "IHateDunkinDonutts",
            "body": "I would hope you don’t ban for disagreements or a little bit of trolling.\n\nI’ve been banned for the slightest of arguments and comments on liberal subs - rather than come up with a response I’m simply banned.\n\nI’m not exactly losing sleep over it, but I’d like to be a little better than our leftist counterparts, as they don’t engage with any discussions outside of the derpy comments of Trump being a Nazi or a dictator. \n\nLet’s be better than them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ikoiwm_1",
            "body": "SIR YES SIR",
            "score": 1,
            "replies": []
        },
        {
            "author": "DingleBerrieJerry",
            "body": "This is just amazing I love this so much keep up the great work❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dank-Brandon420",
            "body": "Love it lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "angryandunreasonable",
            "body": "They can't help but coming to screech about how much they hate Trump. Good job rooting them out!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheConservativeTechy",
            "body": "Will you post a list of the banned accounts so we can judge for ourselves what opinions were being banned?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worldly_Ice5526",
            "body": "About time… a lot more needs to be done. Too many hiding behind a false Republican flair.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArchivalSearch",
            "body": "I don’t think we should be banning anyone unless they become a repeat harassment issue. Otherwise we are mimicking the same intolerant behaviors of the left",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baller-Mcfly",
            "body": "We are the party of free speech. Let them stay.",
            "score": -1,
            "replies": [
                {
                    "author": "CatWithoutABlog",
                    "body": "It's more about being on-topic (and civil imo). Mod specifies that libs come here just to monologue their hate for Trump [here](https://www.reddit.com/r/Republican/comments/1j0ryzx/comment/mfe0wc1/).",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Lower-Ad6435",
                    "body": "Sometimes you have to get rid of the poison though.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Baller-Mcfly",
                            "body": "Look, that's a very leftist thing to say. Only better speech can rid free speech. We will have bad actors come in. We just have to sharpen our tongues on their nonsense.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Lower-Ad6435",
                                    "body": "Lol not at all. Lies cause harm. Sometimes you have to shutdown the lies and misinformation so people don't get misled.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Baller-Mcfly",
                                            "body": "That's what the left says. That's what democrats say. You are the problem.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fast-Top-5071",
                    "body": "If they want to stay on topic, fine.   If they want to pronounce on liberal talking points, well, that is spam in this particular sub, and spammers are unwelcome anywhere.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "krayhayft",
            "body": "You're now as bad as the liberals.\n\nhttps://preview.redd.it/8ndul7pej0me1.jpeg?width=600&format=pjpg&auto=webp&s=60383a2b0c1dc771ac5a07da8aa69b8a64308ef1",
            "score": -7,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Banned.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoishaSchwarzter",
            "body": "What did I miss? I was taking a mental health break from reddit",
            "score": 1,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Just the typical liberal plague, it's not enough that they own 98% of Reddit, they want to infect the small handful of subs Conservatives use as well",
                    "score": 12,
                    "replies": [
                        {
                            "author": "MoishaSchwarzter",
                            "body": "In the words of Joshua Graham\n\n\"The time for talk has passed, the Lord's work must be done\"\n\nKeep swinging that hammer and nailing them outta here!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TexBourbon",
            "body": "👏🏻👏🏻👏🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ace_W",
            "body": "![gif](giphy|sQCwnA888oJY4)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Titan_Food",
            "body": "Cant wait for elon to dredge their bot network out of the depths of the deepstate swamp \n\nI wonder how much money they shill out to keep it running",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frosty-Flower-3813",
            "body": "If I was to say\n\nw\n\nh\n\na\n\nc\n\nk\n\na\n\nl\n\ni\n\nb\n\n  \nwould I end up with 7 day ban for promoting violence?? cause I am not!!  just light humor.. see you next week! Love you alL!! byeeeeeee \n\n\\-- BANNED --",
            "score": 1,
            "replies": []
        },
        {
            "author": "openupshop78",
            "body": "It’s crazy we didn’t mention crap about how shitty Biden was the last 4 years. But we hear it EVERYDAY! So annoying",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeaOfMagma",
            "body": "Mods:💪🗿",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZestycloseAlfalfa736",
            "body": "Zelenskyy has been sucking the U.S government titty for far too long.",
            "score": 1,
            "replies": []
        },
        {
            "author": "callmeyouraveragejoe",
            "body": "Umm...",
            "score": -6,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Umm umm banned.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "RNHood51",
            "body": "Trump destroyed Zelenskyy",
            "score": -2,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Trump and Vance simply reacted to his insolence and entitlement. The tail doesn't wag the dog.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Scene_5551",
            "body": "We should be better than them. Let them stay and hopefully absorb SOMEthing. \n\nThink of how many times you're banned from their subs",
            "score": 0,
            "replies": []
        },
        {
            "author": "EternalFlame117343",
            "body": "Reddit shouldn't be their 'safe' place.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BookRevolutionary943",
            "body": "just wondering do the other subs do this? like r/liberal?",
            "score": -8,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "You really have to wonder how conservatives are treated in liberal subs? Seriously Clark?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "BookRevolutionary943",
                            "body": "ur right thats my fault i went to r/liberal for one second and realized",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Any_Pudding_1812",
            "body": "very brave",
            "score": -8,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "And YOU sir are STUNNING and brave. And banned.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Even_Buddy_7253",
            "body": "Yeah but lets also not be like them. If someone of liberal beliefs is here for genuine progressive and respectful political discussion and understandings, they should be welcomed to debate and discuss such topics with grace. We dont need to insult anyone, kick them out or ostracize them for just being liberal. While i dont see much of that on this sub, just want to remind everyone were better than that. Idk about you but it genuinely concerns me seeing the massive divide and hate that comes from the left towards us as a party or even if simply someone(republican) comes from a place of respect chipping in on discussion on one of their subs, its fucking worrying for humans in general.",
            "score": -3,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Kumbaya. The trolls are the problem. FAFO.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "mgeek4fun",
                            "body": "The meme writes itself, \"I like drugs, and Reddit\" lol, dude's not a conservative",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VinnieWilson02",
            "body": "I mean it's crazy someone disagrees with you and you call them a liberal. Trump is just a regular man he makes mistakes in his thinking as well. He's a hell of a lot better than Commila but still has made at least 25% of his decisions poorly this time around as well.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wikkid_witch",
            "body": "I don't thing censorship is the answer.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BattleshipTirpitzKai",
            "body": "You are no better than those who are deceived. Remember we’re here to be better than them. If they can’t handle being here then they will inevitably lose their will",
            "score": -6,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Sounds like something you pulled from a Japanese cartoon... What are you trying to say?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BattleshipTirpitzKai",
                            "body": "This is an opportunity to let those people put targets on themselves and prevents us from being accused of the same things they do to us.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "BrandDC",
                                    "body": "Prevents??? The radical lunatic left accuses regardless. Where have you been?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}