{
    "title": "Check it out Patriots, we've made the news on another subreddit! 🤣🤣🤣🤣",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 53,
    "score": 80,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 52,
    "url": "https://i.redd.it/nyjscu1vvbme1.jpeg",
    "id": "1j1z683",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "tekk1337",
            "body": "The hypocrisy is strong with that one. We make any kind of comment at all on their subs, and we get autobanned.  The real irony is if they announced that they were doing the exact same thing, these same people would be cheering them on.",
            "score": 19,
            "replies": []
        },
        {
            "author": "V_Cobra21",
            "body": "They ban us from all of their subs so I don’t see why they’re crying about it if we do it back.",
            "score": 83,
            "replies": [
                {
                    "author": "AraMercury",
                    "body": "Facts",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "FlyFit9206",
                    "body": "Yep, 100%",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "Seliftidder",
                    "body": "Remember as a child being told “don’t be a tattletale”? \n\nI swear liberals are a mix of this idiom and “throwing mud at the wall…”",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "snookpudge23",
            "body": "I haven't been band from subservience yet but what i find is the liberal subs can not take the heat they dish. It's hilarious.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Medic644",
            "body": "Man... this post should catch a few more. Someone is definitely humping the downvote button on every comment.",
            "score": 17,
            "replies": [
                {
                    "author": "Solid_Effective1649",
                    "body": "Can’t see who downvotes. Can only see if people comment or report",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alucard1991x",
            "body": "It honestly does already feel like a whole new sub over here without the trolls! Keep doing gods work fellas! 🫡 🦅 🇺🇸",
            "score": 7,
            "replies": []
        },
        {
            "author": "Quirky_Chicken_1840",
            "body": "The mods here are doing an awesome job",
            "score": 10,
            "replies": []
        },
        {
            "author": "moeshiboe",
            "body": "Fist in the air to the land of hypocrisy - Zach de la Rocha",
            "score": 3,
            "replies": []
        },
        {
            "author": "Candyland-Nightmare",
            "body": "I don't understand how it fits that sub tho. How is it a leopards ate my face thing? There are a lot of leftist subs I can see using it to make fun of Republicans. We're used to that shit. But aren't posts supposed to fit the sub in some way?",
            "score": 17,
            "replies": [
                {
                    "author": "Inevitable_Catch_566",
                    "body": "I doubt it does, but since its criticizing r/republican , they’ll allow it.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "jam69bot420",
            "body": "I'm sure this sub is the subject of many screeching tirades among the mods of the left wing subs and site admins.",
            "score": 18,
            "replies": [
                {
                    "author": "Novel-Care7523",
                    "body": "![gif](giphy|u8u0R51ND9L2|downsized)",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "woman-ina-mansworld",
            "body": "The iron dome of \nMods",
            "score": 4,
            "replies": [
                {
                    "author": "SoilEquivalent4460",
                    "body": "Pew pew",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pm_me_ur_anything_k",
            "body": "lol meanwhile those crybabies ban people for posting in subs they don’t like.",
            "score": 11,
            "replies": [
                {
                    "author": "Strange-History7511",
                    "body": "that's the craziest part, auto banning you for even commenting in a sub they don't like. Def not fascists",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrevorsPirateGun",
            "body": "Does anyone else hate that leopards ate my face saying as much as me?   \n\nLibs are so corny. Remember they were using \"weird\" for a bit bc that doofus Walz used it?",
            "score": 6,
            "replies": [
                {
                    "author": "Zaknoid",
                    "body": "Theyre such npcs and followers, whatever talking point they get they fixate on for a while then drop it for the next one.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "tvfucker89",
            "body": "These mfs ban us from almost every subreddit for our mere existence. Why are they complaining now that we're doing the same?",
            "score": 3,
            "replies": [
                {
                    "author": "AnAudLife",
                    "body": "Amen damn it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "You clearly don't understand partisan subs. No one here is going to leftist subs.  The complaint is being banned from NONPATRISAN subs like \"worldnews\" and \"pics\" that have been infested with the liberal woke lunatics.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "MikesHairyMug99",
            "body": "The whining on every sub is unreal right now.  TDS infections are bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "shadowamongyou",
            "body": "What was the trap? I haven’t been on the sub in a minute",
            "score": 2,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "Libs always flock to these posts to call us names, makes it SOOO easy to identify and ban em 😂",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "sagittarius_90",
            "body": "👏🏻👏🏻😂😂",
            "score": -1,
            "replies": []
        },
        {
            "author": "ScottBroChill69",
            "body": "Goddamn theater kids thinking they're cool.",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "Busy_Respond5443",
                    "body": "https://preview.redd.it/zvkgxbw47cme1.jpeg?width=1284&format=pjpg&auto=webp&s=a6da6498b816bffeac4c478ac0084fa675e8f598\n\nOh no, looks like your girls’ club is bleeding out. And that’s what won Trump the election. ☹️",
                    "score": 0,
                    "replies": [
                        {
                            "author": "LifeIsBetterDrunk",
                            "body": "Maybe they shouldnt call women \"people that menstrate\"",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Seliftidder",
                                    "body": "Careful… no term yet for XX chromosomes post menopause.",
                                    "score": -2,
                                    "replies": []
                                },
                                {
                                    "author": "BrandDC",
                                    "body": "check your spelling.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AnAudLife",
                            "body": "They just don’t get the fact that they are the reason that Trump won. I know some democrats that voted for Trump simply because liberals just take it too far and they don’t wanna be associated with it anymore.  And they don’t wanna vote for liberal candidates.  They’re tired of the insanity and frankly, I am relieved, happy and grateful that democrats, some democrats, are finally seeing the light",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PretendChef7513",
            "body": "Lol. More like a sub for extremely selective news articles. Nothing is ever posted about obvious bad moves like the cyber operations halt that happened today",
            "score": -13,
            "replies": []
        }
    ]
}