{
    "title": "English Is Spoken Here: We Finally Have a National Language Thanks to Trump Executive Order",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 49,
    "score": 105,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 39,
    "url": "https://redstate.com/bobhoge/2025/03/02/english-is-spoken-here-trump-signs-order-making-us-one-of-181-of-195-nations-with-an-official-language-n2186174",
    "id": "1j244ro",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "futuristicplatapus",
            "body": "EOs have a time limit so it will be the Americans language for X amount of years",
            "score": 5,
            "replies": []
        },
        {
            "author": "Kabuki_Wookiee",
            "body": "I had just assumed English is the official language because that is what all of our official documents are written in.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Instr-FTO",
            "body": "Great, because I was getting tired of pressing 1 for English. 🙄",
            "score": 18,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "😂😂😂😂",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Onetwelf",
                    "body": "Yes but you still got Ali baba on the phone.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "drunkerton",
            "body": "I always thought it was pretty cool that we were the only major country that didn’t have a national language. I guess I never got offended over something as minuscule as someone not speaking the same language as me. \n\nI would like to add the constitution was written in German and Dutch but we only see the English one because that’s what most of us speak.",
            "score": 6,
            "replies": [
                {
                    "author": "Purple_Ninja8645",
                    "body": "I don't think many are actually offended, but more so confused as to why it was never the official language in the first place. 80% of the population speak English. It's the dominant language by far. Getting everyone on the same page just seems logical to me.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "drunkerton",
                            "body": "It is already a requirement that you speak English to gain your citizenship. In my opinion all this does is empower the “go back to your country” people",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Purple_Ninja8645",
                                    "body": "If it's a requirement to know English when applying for citizenship and the vast majority speak English in the US, then it's only logical English is our official language. \n\nArguing against that makes absolutely zero sense. What is your purpose to be against it other than to argue?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "drunkerton",
                                            "body": "I am not arguing but stating my opinion it’s how people have conversations. Just because you don’t agree with my opinion does not instantly mean it’s an argument. \n\nIf you are interested in reading an article that can articulate this opinion better than I can. This is a good one\n\n[Why the United States Doesn’t Have an Official Language](https://scientificorigin.com/why-the-united-states-doesnt-have-an-official-language)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RickPar",
            "body": "All these ED'S are great, but we need to turn them into law.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scottstots-88",
            "body": "My brother took me to New York in 05 and I bought a tshirt that had a picture of the Statue of Liberty and it said “Welcome to America, Now Speak English”. The irony- I bought it in Chinatown from a woman who spoke ZERO English.",
            "score": -1,
            "replies": []
        },
        {
            "author": "DoomsdayTheorist1",
            "body": "Missed the chance to create a language called American and make that the official language.",
            "score": -11,
            "replies": []
        },
        {
            "author": "aruzinsky",
            "body": "Make it illegal to advertise in a foreign language.",
            "score": -3,
            "replies": [
                {
                    "author": "raidmytombBB",
                    "body": "There's a difference between calling a language the official language and forcing everyone to speak that language only.  \n\nI had always assumed and I think it's fine to say English is the official language.  But I don't see any reason why we have to force everyone into the language.  If they prefer to speak another language, that's on them.  They may struggle to communicate with others but they can figure it out.  \n\nIf a Spanish channel wants to advertise in Spanish, what's the issue?  \n\nI don't recall ever seeing an ad on an English channel that was in anything other than English.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "aruzinsky",
                            "body": "The Spanish channel could be an exception because its ads aren't an ambush to people who only speak English. But, most ads are an ambush.  I have received foreign language junk mail, foreign language phone calls, and seen foreign language signs. The main argument for such ads is that foreign language advertising gives a company a competitive advantage.over companies that don't but, by making it illegal, the playing field is flat and a company doesn't have to worry about competitors doing it.  And it puts more pressure on immigrants to learn English.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DialPlumeria",
            "body": "Don't all countries have an official language?",
            "score": -1,
            "replies": [
                {
                    "author": "JorgiEagle",
                    "body": "No, and not all countries have a single official language.\n\nSouth Africa has 11",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}