{
    "title": "Senate Republicans Torch Dems For Failing To Protect Women’s Sports",
    "author": "Equivalent-Ad8645",
    "subreddit": "Republican",
    "rank": 37,
    "score": 17,
    "upvote_ratio": 0.52,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.dailywire.com/news/senate-republicans-torch-dems-for-failing-to-protect-womens-sports",
    "id": "1j2y4df",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dewalt-Shampoo",
            "body": "Dems are such idiots. Women's sports exist for this exact reason!! PS it's based on your chromosomes, not how you feel.",
            "score": 22,
            "replies": []
        },
        {
            "author": "sullyqns",
            "body": "These guys playing dress up can’t beat men so they try to compete against the women. It’s pretty pathetic.  I thought the left were hardcore feminist 😂",
            "score": 10,
            "replies": []
        },
        {
            "author": "Dapperdirty",
            "body": "But but I thought Trump was supposed to take away women’s rights according to Democrats.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dapperdirty",
            "body": "Inferior men playing dress up supported by inferior minds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fun_Speed_5818",
            "body": "If Obama or Clinton wanted to protect girls sports, they would be on it like flies on shit, but it’s Trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "Viper079",
            "body": "I guess the Democratic Senators enjoy their own self-discovered pastime. Digging their own political graves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "leafcomforter",
            "body": "Men who cannot compete in men’s sports, pretending to be women, to steal their trophies. Any win is absolutely illegitimate. Demoncrats hate women, but virtue signaling is rampant. They are wearing pink tonight to prove how much they support women.\n\nA man jumped eight feet farther than any girl ever has. Make it make sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plastic_Eagle_3662",
            "body": "Non debatable issue honestly. The fact they chose to support this is a huge reason why long life people on the left changed sides.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -4,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "What does that have to do with the topic being discussed?",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}