{
    "title": "Liberalism is a mental disorder.",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 19,
    "score": 346,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 118,
    "url": "https://i.redd.it/dt1i90jwdqme1.jpeg",
    "id": "1j3kdwq",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "squirrelfoot",
            "body": "This is getting silly. These are our fellow Americans, our neighbours, our work colleagues, maybe even our in-laws or other family members. Sure, they have some different values from us, but they are not all the lunatic fringe of the left. (I mean, feel free to hate on the nutters, but remember our side has those too.)",
            "score": 238,
            "replies": [
                {
                    "author": "No-Quarter4321",
                    "body": "Very well said.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "International-Ad3447",
                    "body": "These people literally hate trump just because the TV tells them too",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "TrevorsPirateGun",
                    "body": "Neighbours? Where you from stranger",
                    "score": -34,
                    "replies": [
                        {
                            "author": "squirrelfoot",
                            "body": "I livee in France now. My colleagues are nearly all British.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GG__OP_ANDRO_KRATOS",
                                    "body": "Do they steal from you too?",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "squirrelfoot",
                                            "body": "No, of course not. My Head of Department is Democrat, but nice, my colleagues kind and helpful and my students lovely.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Grouchy-Capital3408",
                    "body": "If you are anything left of center in the current year you basically stand for social communism and to a lesser extent economic communism, their entire platform is anti religion, anti white, and anti family. Whether they admit it or not that is the direction they want us to head in",
                    "score": -68,
                    "replies": [
                        {
                            "author": "Cacub92",
                            "body": "You say this, then the left says, \"if you're anything right of center, you're a fascist,\" so aren't we all just the opposite sides of the same coin?",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "Grouchy-Capital3408",
                                    "body": "Stay asleep then man, its simple pattern recognition, look how much has changed in the last 20 years, look at the propaganda in every form of media. We will become the next europe if we dont stop the leftist globalists soon. The main difference between the left and what I said is that the leftists are ignorant of their politicians globalist agendas, on the other hand they claim we are all nazis, I blame them for their ignorance not what the average leftist voter but they are complicit in the destruction of western civilization.",
                                    "score": -33,
                                    "replies": [
                                        {
                                            "author": "TroutCharles99",
                                            "body": "Which country in Europe are we becoming? Are we becoming like France, Switzerland, the Netherlands, Greece, Ireland, Spain, Portugal, Italy, or Russia? Each one of these countries have their own set of morals, beliefs, origin stories, languages, culture, and levels of government involvement in their economies. I, for one, am Greek by blood and can assure you that the Greeks still believe in family and faith very strongly.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Grouchy-Capital3408",
                                                    "body": "I mean western europe, eastern europe and the balkans still have a national identity. France germany and england have a real islam problem though, and you as a greek Im sure understand what islam has done to your people, and the Ottamans were even tolerant by islamic standards. But if you look at the demographics of places like england and france its getting bad",
                                                    "score": -10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cacub92",
                                            "body": "\"Stay asleep then man, it's simple pattern recognition, look how much has changed in the last 20 years, look at the propaganda in every form of media. We will become the next Russia if we don't stop the fascists soon. The main difference between the right and what I said is that the right is ignorant of their politician's fascist tendencies, on the other hand they claim we are all delusional globalists, I blame them for their ignorance not what the average right-wing voter but they are complicit in the destruction of progress and rise in fascism.\"\n\nSame thing, just different buzzwords. You'd probably see this in a liberal subreddit. Different side, same coin.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Grouchy-Capital3408",
                                                    "body": "Ok dude, have fun replacing americans with indians, But its all cool because they are legal!",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Cacub92",
                                                            "body": "I don't see any white people being deported, so no one is being replaced, and yeah, if they are here legally, then cool indeed!",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "Grouchy-Capital3408",
                                                                    "body": "Yes, whites are being replaces, look at migration and birthrates. Replace the people and you no longer have the same country, culture, or religion. Magic soil does not exist. The attitude you have is the problem with the right, you stand for nothing, you genuinely think you can turn an Indian into an american. It doesnt work, civic nationalism is braindead as fuck.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TroutCharles99",
                                                                            "body": "Most of Europe is homogenous. Perhaps you would prefer to live there? The attitude you expouse is exactly the kind of nativism that is an anathema to America. Sorry, but had you been around 100 years ago, my Greek family would not be welcome in your America.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Cacub92",
                                                                            "body": "LOL you are making a very large assumption that I am a part of the right. I joined this subreddit to learn what the right is talking about here. But again, whites aren't being replaced when they are still here and can be a part of society. The Replacement Theory is just a way to get people riled up about immigration. Is America supposed to have all the same culture and religion? No. It's supposed to be a melting pot with components that all work together, so I strongly suggest you start looking at the commonalities with people as opposed to continuing narratives that push division.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Grouchy-Capital3408",
                                                                                    "body": "What america is supposed to be is completely a matter of opinion, and yes the white replacement theory is just a fact at this point, its just up to if you care or not",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Cacub92",
                                                                                            "body": "What exactly makes it fact? And what should America be to you, then? Should it be just one culture and religion?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Grouchy-Capital3408",
                                                                                                    "body": "Because it is undeniably happening at this point, look at the births and immigration statistics, europe too. America doesnt need to be one culture and religion no, but if you replace the majority it ceases to be the same country.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Cacub92",
                                                                                                            "body": "A number of things regarding this...What is your source on this that you are pulling from? I have seen different sources conflicting each other on the true nature of birth rates in our country (most likely to push an idea/agenda). Second, so if birth rates are actually lower, no one is actually being \"replaced.\" That is the incorrect term to use. No one is being forced out of the country and replaced with another human being. The media uses the term \"replace\" to make you more afraid of people you are immigrating into the country. It's a scare tactic to create more division. Third, our country has never consistently been the same at every point of its history. Again, our country is a melting pot, and sometimes different ingredients are added to the stew. Fourth, you never answered my questions. What should America be to you, personally, if not a melting pot? Should America just be one culture and one religion?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Grouchy-Capital3408",
                                                                                                                    "body": "It doesnt need to he forced to be a replacement, there is a reason the globalist pushed things like birth control and abortion, dont be so dense. Yes we are a melting pot, of european christian peoples not the global islamic world. America does not need to be 100% one culture and religion, but it needs to be a majority for it to remain the same country",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Cacub92",
                                                                                                                            "body": "No need for insults. It's not a matter of being dense but being able to see a classic scare tactic. Simply, the definition of \"replace\" is one entity being put in place of another. If someone is not being birthed, and someone comes into the country, they aren't being put in place of that person who doesn't exist. Oh, ok, so what percentage do you personally feel that America needs to be of European Christian peoples? If that's what you feel we should be as a majority, which religions and cultures do you feel are ok being a part of the minority? You brought up Islam, so is it ok if there are those here who practice Islam, as long as thry stay a part of that minority?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Grouchy-Capital3408",
                                                                                                                                    "body": "Islam has no place in civilized society and in a perfect world a religion like that wouldn’t exist in the first place, they start as a minority and then will take over and subjugate once they reach sufficient numbers and they freely admit this, Europe has a huge problem with that, its not too bad here yet. On the topic of what religions are acceptable in the minority I say smaller christian denominations, the people that wrote the constitution werent thinking of massive islamic and hindu waves of immigration, the freedom of religion was meant for minority christians, such as myself, I am a catholic. It is an organized replacement, as I said earlier there is a reason the globalists love abortion and birth control so much and push careers over family, it is a deliberate effort to tank the native american birthrate and replace us with cheaper labor. As a side affect of this replacement america as a culture and a people are completely destroyed, despite what we have been taught to believe America is a people too, it isnt just a set of ideas.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "iambkatl",
                            "body": "To be fair, the left isn’t a party and have no platform. They are spattered amongst the Democratic Party, which is made up of many different views. The dems have an issue with catering to the far left just like Republicans have an issue with catering to ignorant far right folks with limited world views outside of church, golden coral and Walmart.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tater72",
                    "body": "Nutter butter, if you will 🤣👍",
                    "score": -14,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrimordialJay",
            "body": "What, specifically, are Republicans doing to promote self-love for everyone? I'll admit that the Democrats have gone overboard with demonizing white males. I think it's important to realize you don't need to tear down one group to bring a different one up.",
            "score": 71,
            "replies": []
        },
        {
            "author": "EarlOfEther",
            "body": "I’m growing increasingly frustrated with the hate and lack of civility from both sides. It is constant escalation, which only leads to physical violence. We’re better than that. If this continues we eventually won’t have a U.S.A..  So please, stop the insults and name calling. Instead take a minute to call out those who behave badly regardless of which side they are on. It’s in our best interest.\n\nThanks for listening.",
            "score": 53,
            "replies": [
                {
                    "author": "GymnasticSclerosis",
                    "body": "Bingo 💯",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "International-Ad3447",
                    "body": "It's as planed divide and conquer",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "thewonderfulpooper",
                    "body": "Been observing as a center left from Canada. I'm anticipating civil war. I read an analogy where US politics is treated like sports and both sides are like fans. I was like that sounds accurate. Then when the dude was kicked out of the speech at congress today and politicians started singing \"nah nah nah nah hey, goodbyeeee!\" really made me go wow, wtf! I hope you guys can sort this out soon. You have a great fucking country and deserve more than this insanity.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CodeHard84",
                    "body": "Can't call out a liberal you'll just get cancelled or down voted into Reddit jail. Liberals don't want dialogue.\n\nGod Bless America",
                    "score": -15,
                    "replies": [
                        {
                            "author": "HealedVenom",
                            "body": "Some do! It’s only the far left that doesn’t want a discussion",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "CodeHard84",
                                    "body": "The liberal down vote brigade begs to differ. Just look at the counter on my original comment. :)\n\n🙏",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "HealedVenom",
                                            "body": "That’s Reddit lefties, they down vote anything that scares them, I have friends who are leftists and we have a dialogue and sometimes we agree to disagree others we find common ground",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BlueAig",
                            "body": "Reddit isn’t the same thing as the entire far left. If you look at the world through the filter of internet behavior, you’re destined for disappointment.\n \nI’m on the left. I’d love to talk to you.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "EarlOfEther",
                            "body": "Maybe. But I’ve found if you remain civil and present a good argument to behave well some will listen. The more who call out others the more it will catch on. Just treat everyone equally regardless of which side they are on, even if it’s yours. No better way to stop a bar fight than to have a friend tell you to knock it off.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tiaan",
            "body": "It's funny because if you ask any liberal, they'd say all of the above is coming from the right. They feel that the right hates their sex and sexual orientation (unless they're a straight male), they hate their race (if they're not white they're just DEI), they hate their religion (unless they're Christian), and they hate this country unless their own politicians are in charge.\n\nThis is the problem: both sides have a seriously warped view of what the other truly believes",
            "score": 16,
            "replies": []
        },
        {
            "author": "KyleGene1989",
            "body": "lol this is one of the dumbest things I have ever seen. \n\nHaving a different view point from someone else makes it a mental disorder? How does that even make sense.",
            "score": 67,
            "replies": [
                {
                    "author": "world-is-lostt",
                    "body": "It’s only “dumb” to the ones who are too dumb to comprehend it.",
                    "score": -16,
                    "replies": []
                }
            ]
        },
        {
            "author": "awesomefacedave",
            "body": "I mean…..growing up catholic taught me to hate myself",
            "score": 24,
            "replies": []
        },
        {
            "author": "Tasty-Shower-7635",
            "body": "Calling mentally illed one American out of two is actually crazy, come on guys..",
            "score": 22,
            "replies": []
        },
        {
            "author": "Efficient-Cap-8409",
            "body": "You post this but can you please link some proof that this is actually happening? I don’t see any discriminatory “hate” coming from liberals. You should add facts or evidence next time instead of just empty words.",
            "score": 34,
            "replies": [
                {
                    "author": "Bronqiaa",
                    "body": "There are people getting assaulted because they are trump supporters. Google it",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "HealedVenom",
                    "body": "A lot of far leftists are saying a lot of anti white rhetoric and trying to change culture to benefit them and their ideas, pushing agendas and politics in games, education and books and tv shows it’s really bad",
                    "score": 5,
                    "replies": [
                        {
                            "author": "raidmytombBB",
                            "body": "Any source for this commentary?  Articles describing this behavior?  I am surprised to see multiple comments about liberals being anti white.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HealedVenom",
                                    "body": "https://nypost.com/2024/03/01/entertainment/bella-hadid-shares-anti-white-ideologues-on-instagram-to-60-million-followers-report/\n\nhttps://www.foxnews.com/media/woke-department-defense-equity-chief-writes-anti-white-posts-exhausted-white-folx.amp\n\nIf you need more look at what Disney is doing with Snow White, and littler mermaid. Both where supposed to be white characters but are replaced by people of color, and Snow White is supposed to be the fairest maiden of them all and is being played by someone who should of been castes for the evil queen lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GuyBanks",
                            "body": "But you could say the same for those who are far-right.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HealedVenom",
                                    "body": "You are not wrong, but I will say I haven’t seen/read someone on the far right saying racially motivated saying, like “you cant be racist to white people” have they said that in the past, probably even behind closed doors, I’m sure of it, I know there is evil on both sides, and I’m not discrediting what your saying about the hatred on both sides, I honestly think the whole reason we are in this mess is because of main stream media, not teaching people common sense or critical thinking, that’s why people like Hassan piker get to stream terrorist propaganda on places like twitch",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "GuyBanks",
                                            "body": "I do agree that the \"far-right\" stuff that I see, comes mostly from news sources and I can't really think of a time where I've experienced anyone who is \"far-right\" - but do have family members who could be classified as \"far-left\".",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "HealedVenom",
                                                    "body": "I have the same thing with my family as well, all except one of my aunts and her family hates trump, and none of them are willing to listen or talk",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "GuyBanks",
                                                            "body": "It’s weird how a family can all grow up together, in the same area, experience the same things and have wildly different views on even the most common sense things.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Efficient-Cap-8409",
                            "body": "I also have not seen any “anti- white” rhetoric. If you’re talking about anti -racism, and sources pushing for recognition of privilege? Personally, I don’t think anyone is “anti- white” even DEI is not anti white, it’s a way to combat systemic racism which is a very real issue. shows are being more recognizing for LGBT and minorities. Is that also pushing agenda? I am just curious what you think",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "HealedVenom",
                                    "body": "DEI in theory is great, I am disabled and having that should be a benefit for a job I should be qualified or studied in, but that’s not how it’s being done, from what I learned the government is giving money to companies who have hired more people of color or people with disabilities they aren’t looking at qualifications really at this point, if that was the Hollywood would be destroying/raping mine and others childhood, western game companies wouldn’t be shutting down studios left and right for slop that they where forced to make by companies like sweet baby Inc.  That’s the current problem with DEI, they are also trying to rewrite history in movies and TV shows too, for instance there was a documentary (I think) of cleopatra and was played by Jada Smith (I think) and claimed that cleopatra was black, when in reality she wasn’t black, and Egypt sued the net work for spreading lies about cleopatra, there are others instances of this happening in modern media",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xAuntRhodyx",
            "body": "Liberal doesn't mean left leaning.. it is generally associated with it these days, but people really dont know the meanings of words. There are Liberal righties lol.",
            "score": 3,
            "replies": [
                {
                    "author": "Ok_Quail9973",
                    "body": "What’s the difference?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "xAuntRhodyx",
                            "body": "To simplify it, they are, in fact, more moderate than anything. More bluntly, moderate capitalist with either left or right leaning ideology compared to actual moderates who feel both parties are too ideological for simple partisian solutions to work. Liberals still support capitalism (for the most part), amongst other things. They may seek reform but not a revolution of sorts. Meaning, they typically do not want a socialist society. They support greater internationalism while maintaining capitalist ideals. So they usually differ in foreign policy more so than domestic policy from a typical righty, and they may differ more in domestic policy compared to foreign policy from a lefty. It goes deeper, but for the most part, that is what it boils down to. An example could be healthcare. A liberal or rather a right leaning liberal would be more in favor of not having free health care but a more affordable health care by seeking reforms in the health sector without primarily abolishing it. A left leaning liberal may share these sentiments but would want to push for them in a more generous stance. While a socialist or a modern leftist would suggest free health care across the board. Compared to a traditional righty who would want more of the same or more restriction. Another example would be foreign support for Ukraine. A liberal righty would suggest continuing support but maintaining the status quoe or even a more give and take type of support like in the form of loans instead of grants. While a liberal leftist would rather see increased action and support for them in the form of grants and fewer loans. At the same time, a hard-core righty would be more in favor of withdrawal of support and isolationism while maintaining a more traditional stance of give an take. Compared to a hard-core, lefty who would be more inclined to just keep giving without anything or little in return while increasing support. Granted, it is a spectrum for a reason, but this outlines it in a broader sense. There are hard core liberal lefties and hard core liberal righties, just like there are just hard leftists (socialist) and hard righties (traditionalists). It's like how rebublicans are to conservatives and democrats are to socialist. They are similar but different and lean on their respective sides of the spectrum. I'd say most people fall somewhere in between that in America. However, as the divide worsens, so does the radicalism of each ideology and the support behind them. So, in turn, we are actually seeing fewer liberals and more socialist and more conservatives instead of having more Democrats and more Republicans. We went over the left and right scales, but there is also the up and down axis as well. This is where you get fascists, socialism, libertarianism, communism, etc. Depending on the left and right leanings in relation to your up and down leanings. That's a whole nother topic, though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thewalrus117",
            "body": "Project much? This seems hateful lol",
            "score": 10,
            "replies": []
        },
        {
            "author": "iwasuncoolonce",
            "body": "Politics is a mental disorder, it's kind of sad we have to argue what's the right thing to do",
            "score": 6,
            "replies": []
        },
        {
            "author": "hlipschitz",
            "body": "\"Sir, put down the meme\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "GeorgeLFC1234",
            "body": "Guys can you please tell your party to stand up for your country as you seem to have decided your not republicans anymore but just trumps lackeys.",
            "score": 5,
            "replies": []
        },
        {
            "author": "oritsky",
            "body": "This is a complete damn lie.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoGoPlug",
            "body": "If you believe the left is the party of Tolerance and Compassion, you’ve missed the plot.",
            "score": 3,
            "replies": [
                {
                    "author": "CodeHard84",
                    "body": "I have yet to meet a liberal even the closest of family members that will: \n\n1. Say I love the United States. \n2. Believes that we're the best country in the world. \n\nThe only thing I disagree with MAGA folks on is you can't Make America Great Again because it has always been and always will be great.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GuyBanks",
                            "body": "Some people have different life experiences that would make them not say \"I love the United States\", or not believe the America is the greatest country in the world - we all have different perspectives on things.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CodeHard84",
                                    "body": "If those people truly understood their freedoms they would love the source from which they were derived.\n\nI don't know of any other country that offers the level and protection of personal freedoms than the United States. \n\nPlease note I said personal freedoms before someone brings up abortion.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GoGoPlug",
                            "body": "Amen!  I use their self descriptors to point out the hypocrisy they live by.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "friday567",
            "body": "I thought self hate was similar to be major religions.  Similar to sin! I know i sin and i need to repent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bronqiaa",
            "body": "lol almost all the top comments in this post are painfully obvious brigaders",
            "score": 1,
            "replies": []
        },
        {
            "author": "Similar-Flan5114",
            "body": "And then they try to fix it with psychotic talk of “self love.” Give me a break. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "handyfogs",
            "body": "I mean. This is lowkey true but the format is giving Facebook meme... 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "stayathomedad79",
            "body": "It definitely is a mental disorder",
            "score": -10,
            "replies": []
        },
        {
            "author": "Ruthless_American",
            "body": "The left is a different kind of stupid",
            "score": -4,
            "replies": []
        },
        {
            "author": "Aweknowing",
            "body": "It'll definitely be studied in the future. Maybe one day they'll even find a cure for it 🤞",
            "score": -15,
            "replies": []
        },
        {
            "author": "leafcomforter",
            "body": "It is hate towards women for one thing. All of them voted to keep **MEN IN WOMENS SPORTS**. Even after a man jumped eight feet more than any woman has ever done. Even after men have injured girls in sports. \n\nIt is the demeaning of and belittling anyone and everyone who doesn’t follow the party line. Heck, they all have their own prewritten script to read. All exactly the same. \n\nIt is a mental disorder where they aren’t using their full frontal lobe. All living in the lizard part of our brain, the amygdala.  It is a disease that spreads through the population a rapid speed. It isn’t evolving, it is regressing, devolving.",
            "score": -4,
            "replies": []
        }
    ]
}