{
    "title": "🤷‍♂️🤷‍♂️🤷‍♂️",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 9,
    "score": 857,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 206,
    "url": "https://i.redd.it/n4yb4m3zarme1.jpeg",
    "id": "1j3orfu",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyP82",
            "body": "Can’t I just hate the Russian government?",
            "score": 84,
            "replies": [
                {
                    "author": "Soggy_Associate_5556",
                    "body": "We all hate Russia, but we don't hate enough to lay our necks out for others.",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "No why would you want to hate",
                    "score": -37,
                    "replies": [
                        {
                            "author": "RyP82",
                            "body": "Because I’m a proud American, Ivan, and the Russian government is contrary to most everything I believe in and is hostile to the American way of life.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "xJustin_Crediblex",
                                    "body": "I could see that being true If we were talking about the ccp or NK but what is the problem with Russia and who's ivan?",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "Fiending-Nemo",
                                            "body": "i know i wasn’t initially part of this thread but russia has been our enemy for a long time. from psy ops to propaganda and backstabbing. they are a country that we truly cannot trust. we “fought” the cold war with them just because we were afraid of them possibly attacking us there were no direct battles (many proxy wars)",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Laylow2100",
                                                    "body": "War is our enemy.  War with Russia especially is our enemy. No one is saying Russia is our friend but giving billions of dollars to Ukraine for a never ending war when we have our own disasters at home every day - that should be our enemy.  The war needs to end. We are helping moderate that.  Zelensky is no prince he’s a dictator who is also doing horrible things to his people.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Gallaga07",
                                                            "body": "Let’s try and stick to the truth on the right, Zelensky was elected, like him or not you are engaging in the same dishonest rhetoric as the left calling everyone a Nazi",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Fiending-Nemo",
                                                            "body": "while i understand this stance and agree to an extent, we also have to look at the fact that communism is also our enemy, not just russia. we have always tried to stop the spread of communism with our policy of containment established in the monroe doctrine. we have the strongest military in the world and i believe it is our duty to maintain it and prevent the spread of communism.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Fiending-Nemo",
                                                                    "body": "sorry i meant truman doctrine* though the monroe doctrine established us as a protective force over southern america which started our history of protecting the little guys when they got into trouble. zelenskyy fought alongside his men in the battlefield he is no dictator.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok-Weakness-3902",
                    "body": "Hate drives people apart, hope. Hope for change",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BD_McNasty",
            "body": "Why does standing with Ukraine mean u cannot stand with the US at the same time? Our interests are aligned. They are under invasion and war from a common enemy of ours and it's in both our best interest to see Russia fail. All the trolls have come out since this whole debacle.",
            "score": 157,
            "replies": [
                {
                    "author": "fartyunicorns",
                    "body": "Unfortunately Ukraine is now part of the ever growing culture war",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "GreenSplashh",
                    "body": "So can I stand with USA and not stand with Israel?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Rednexican429",
                            "body": "You can do whatever you want",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GreenSplashh",
                                    "body": "tell that to the other guy",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xJustin_Crediblex",
                            "body": "https://preview.redd.it/m4cpssp0yrme1.jpeg?width=1888&format=pjpg&auto=webp&s=79341f9d9e61aa15c4f11608600653f18c721da2\n\nSure but shits about to get great",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "lXPROMETHEUSXl",
                                    "body": "“MIGA”…doesn’t quite have the same ring to it lol",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "xJustin_Crediblex",
                                            "body": "Sounds kinda mexican... or if you bought generic cabinetry, \" what is that material?\" Oh, it's formiga it's like formica, but instead of being made from craft paper, it's made frome reclaimed toilet tissue.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "xxxman360",
                                            "body": "Maybe it'll sound better if said as MAI-guh",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok-Analyst-874",
                            "body": "Israel is dealing with a terrorist group that deliberately endangers Palestinians, yet the Left refuses to blame Hamas. That doesn’t seem “American” it’s seems new, anti-anything traditional American. \n\nI can see standing with Ukraine even through I don’t. But standing with Palestine is just ridiculous. They haven’t had free elections in close to 20 years, they believe in 2 genders, they believe in Men running households, etc. The Left is standing with Hamas because they don’t understand how fighting against terrorism actually works, and are too ignorant to realize some things you shouldn’t have an opinion on if you’re clueless.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "GreenSplashh",
                                    "body": "I AM AMERICAN\n\n  \nI LOVE AMERICA\n\n  \nI DO NOT STAND WITH ISRAEL",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Ok-Analyst-874",
                                            "body": "How’d you feel about General Sherman’s Atlanta campaign? \n\nWhat about the fall of Berlin in WWII? Hitler’s last ditch efforts happened before the city was evacuated, were we wrong in marching to Berlin nonetheless? Was artillery & air support wrong for reducing the city to rubble? \n\nThat Leftist 💩doesn’t win military campaigns & gets people killed & allows desperate terrorists potential time to regroup.\n\n#Let a violent, wanted fugitive deliberately run into a Mall, deliberately endangering innocent people and you’d blame the fugitive …",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "GreenSplashh",
                                                    "body": "Are you seriously comparing not standing with modern Israel to freaking Hitler? what is wrong with you?\n\n  \nI DO NOT STAND WITH ISRAEL. AMERICA FIRST. ALWAYS.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Ok-Analyst-874",
                                                            "body": "**Civilian casualties**. That’s my point. And stop sensationalizing everything that ever involved Hitler, to the point that you lose all rationality. That’s what Leftists do. Civilian casualties in war was clearly my point & I gave plenty of examples.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GreenSplashh",
                                                                    "body": "You do know I'm not left, right? You can argue that many things are happening around the world , point is that's not my problem and our own people comes first. We are in an economic crisis right now, exactly why does the money I make need to go to Israel by force?",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Soggy_Associate_5556",
                    "body": "And refusing to stand with Ukraine means we stand with Russia?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "International-Ad3447",
                    "body": "So send more people to die for the next few years instead of signing a peace deal with the US",
                    "score": 0,
                    "replies": [
                        {
                            "author": "xJustin_Crediblex",
                            "body": "Hey, that's what their pres said as well, i think....",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "kickbn_",
                            "body": "Sometimes you have to keep on fighting instead of bending the knee. The British were in the exact same spot 80 years ago and back then the US understood that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "5138008RG00D",
                                    "body": "Great Britain and Ukraine are not equal, nor deserve equal protection from America.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "International-Ad3447",
                                    "body": "Keep fighting more like the peasants keep fighting while the rulers just sit back and watch even the Ukrainians don't want to fight they're being dragged from their homes and off the street into it against their will",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "The Ukraine is one of the most corrupt places in the world...zelenski and vlad deserve one another. I mean, Putin did vow to put Russia back together again. And i'm pretty sure the ukraine was a piece of it. But I digress. i just want to know where the other half of the money we sent is.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "This_was_hard_to_do",
            "body": "It’s wild that people are trying to lump Palestine and Ukraine together, maybe it’s in an attempt to make Ukraine less popular.  \n  \nThere are those of us that believe helping Ukraine, or maintaining strong foreign policy is in the US best long term interests. Like it or not, this world is globalized now, and isolationism will just result in us getting left behind. It’s naive to think that our authoritarian competitors will stop because we ask them to.",
            "score": 34,
            "replies": [
                {
                    "author": "xJustin_Crediblex",
                    "body": "It is the same shit. Far off people wanting to kill each other over some dumb shit that has nothing to do with us. We need to consolidate and think things over we need to straiten our own household before we worry about our neighbors shit, much less the dude, on the other side of town.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "This_was_hard_to_do",
                            "body": "If it’s a chance to make our adversary weaker, it has to do with us. The US is the number one country right now precisely because we have the strongest presence in the world. People here have taken American hegemony for granted.  \n  \nStepping back from the world stage will lead to more competition as our adversaries get stronger. That is what will cause the next world war, not appeasement. We should be making demands to Russia not Ukraine.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "xJustin_Crediblex",
                                    "body": "Adversaries are already getting stronger and actively weakening us because we're not paying attention to them and we're focused on bigger things but we're slowly dying a death from a thousand cuts through a hand that feeds. china is fighting a war of civilian slaughter and enfeebeling through subterfuge we need to absolutely be more careful and we don't need to completely isolate we still need the world economy to get this terriff money our national debt is stupid.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FerretOnReddit",
                    "body": "\"palestine\" doesn't even exist. It was never meant to exist. It's stolen land from Jewish people, both ethnically and religiously. First the Romans kicked the Jews out. Then the Muslim colonists kicked the Romans out. And now after being punted around Europe for almost two millenia, Jews are being told to \"go back where you came from\". But nope, they're not even allowed to do that because of ISIS (Hamas) trying to claim land that isn't even theirs.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "jdub213818",
            "body": "Despite the traditional values often associated with Republicans and conservatives, the current administration is exposing its true priorities. This isn’t about Democrats versus Republicans or what’s best for the American people—it’s about serving the ultra-rich while keeping the rest of the country trapped in a cycle of financial struggle. Instead of policies that uplift working families, we see decisions that benefit the wealthiest few at the expense of everyday Americans who are just trying to make ends meet. The real divide isn’t between political parties; it’s between those who have immense wealth and power and those who are being left behind.    Tell me I’m wrong ….",
            "score": 24,
            "replies": [
                {
                    "author": "xJustin_Crediblex",
                    "body": "I thought that was the last admin was doing that's why inflation is so high currently i mean it doesn't really effect the people who got money in the bank it effects the pay check to pay check regularly folks",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Bronqiaa",
                    "body": "Ok. You’re wrong. Everything you just said actually happened under Biden. Trump is currently trying to fix all of Biden’s screw ups",
                    "score": -8,
                    "replies": [
                        {
                            "author": "jdub213818",
                            "body": "Look, I believe in conservative values—fiscal responsibility, a strong middle class, and making sure American workers can thrive. But let’s be honest: Trump’s 2017 tax cuts weren’t for us, they were for the ultra-rich and corporations, adding nearly $2 trillion to the national debt while wages for the middle class barely budged. Under Biden, unemployment hit a 50-year low, real wages actually started rising, and manufacturing jobs returned to the U.S. for the first time in decades. Meanwhile, Trump’s first term saw record-breaking corporate stock buybacks, CEOs pocketing billions, and everyday Americans struggling with stagnant wages. If ‘fixing Biden’s screw-ups’ means going back to that, then who is Trump really working for? Because it sure isn’t the working class.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Gallaga07",
                                    "body": "Show some proof for any of those leftist talking points you just spouted off.  It’s like you verbatim spit out the script.  Not a single real conservative would praise the unmitigated disaster we had for the last four years.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "jdub213818",
                                            "body": "I don’t need a ‘leftist script’—a simple Google search will do….I just look at the numbers. Trump’s 2017 tax cuts added nearly $2 trillion to the national debt, with 83% of the benefits going to the top 1% by 2027 (Congressional Budget Office). Real wages for working Americans barely moved under Trump, and manufacturing jobs fell by 170,000 in his last year alone (Bureau of Labor Statistics). Meanwhile, under Biden, unemployment hit a 50-year low at 3.4% in early 2023 (BLS), and over 800,000 manufacturing jobs have returned since 2021 (National Association of Manufacturers)).\n\nNow, am I saying Biden is perfect? Hell no. Inflation hit hard, and I’m not a fan of his spending, but let’s not pretend Trump was some economic genius. If he was, why did the deficit explode, the stock market tank 35% in his last year, and the economy lose 22 million jobs during COVID? And before you say ‘but the pandemic’—Biden had to deal with the aftermath and still managed to bring jobs back.\n\nIf Trump’s idea of ‘fixing things’ is more tax cuts for billionaires while the debt climbs and wages stagnate, I don’t see how that helps everyday conservatives like us.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Gallaga07",
                                                    "body": "Dude your second paragraph is so out of touch with reality it is astonishing, you answered your own question.  Pandemic fucked up the economy, and when everyone realized it was not that bad, and the vaccine came out, the economy bounced back.  Biden had to deal with the aftermath, aka things rebounded towards pre-pandemic levels, as one would expect.  Trump is cutting taxes across the board, and this better cuts for the rich is the theoretical impact of tariffs, not some rich favoring policy that the left fabricated.  You aren’t a conservative, at all, everyone can see through that blatant lie.  Try and think critically, instead of misinterpreting statistics.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "jdub213818",
                                                            "body": "Call me a republican sure, conservative sure , MAGA fuck no.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Gallaga07",
                                                                    "body": "I couldn’t care less what you call yourself, TDS strikes again.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jdub213818",
                                                                            "body": "TDS is spreading like a wild fire, that’s for sure.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PerformanceBubbly393",
            "body": "Don’t bring Ukraine into this",
            "score": 34,
            "replies": [
                {
                    "author": "9842vampen",
                    "body": "Care to elaborate? He/she is actually making a great point m",
                    "score": -18,
                    "replies": [
                        {
                            "author": "PerformanceBubbly393",
                            "body": "Like half of Ukraine supporters are Right wing conservatives that believe in a strong foreign policy and countering our rivals. All Palestinian supporters are leftist or Muslim.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "9842vampen",
                                    "body": "I'm a conservative Muslim so what do I believe?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PerformanceBubbly393",
                                            "body": "Eh that’s fair I think the whole argument is stupid that you can only like one country like it’s stupid criticizing Ukrainian-Americans or Mexican-Americans for still sympathizing with their people.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fartyunicorns",
                            "body": "Supporting Ukraine is not just a left wing position and should be a bipartisan issue, at least in acknowledging Russia is the enemy and Ukraine should win the war. (Sending weapons and money is more contentious and open to debate)",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Candyland-Nightmare",
                                    "body": "There is zero path for Ukraine to \"win the war\", not without foreign troops on the ground. No amount of weaponry given to them will matter without soldiers to use it. They don't have it. Meanwhile Russia has vastly more soldiers they can pour into it. No other country is going to put their own boots on the ground.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "fartyunicorns",
                                            "body": "Kinda depends on what classifies as ‘winning’ doesn’t it?. You could argue that anything short of Ukraine completely collapsing is a win since that is ultimately Putin’s goal. Regardless you can still want Ukraine to beat Russia whilst also admitting that it would be unlikely to happen.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "AlmacitaLectora",
                                                    "body": "They literally don’t have young men left to fight the war. It’s already lost. It needs to be a peace deal or there will be a lost generation in Ukraine.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "phil96744",
                                            "body": "I fully understand not wasting our tax dollars on Ukraine but why tf is the US easing up on Russia?\n\nlifting sanctions?\nstopping cyber ops?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Candyland-Nightmare",
                                                    "body": "Idk anything about the cyber stuff beyond a few headlines so I'm not going to wager any guesses on that. However maybe for lifting some sanctions its to show good faith neutrality in order to keep Russia at the table for a ceasefire. Trump already negotiated one that Z screed the pooch on. How else does the US keep Russia willing to negotiate while waiting for Z to get his priorities right?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "phil96744",
                                                            "body": "The US does not have to do any deals to bring peace in that region. I thought we are not the world police? Just stay away from that region entirely and let those countries figure it out. I'd rather the US stay away than be seen cozying up with the russians.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Gallaga07",
                                                                    "body": "How is sanctioning and cyber attacking Russia staying away from the region exactly?  The US is not forcing Ukraine to stop fighting, we are pressuring them sure, but they came crawling back immediately, because they know without US support they are screwed.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Candyland-Nightmare",
                                                                    "body": "The US, as well as everyone else, will benefit from a peace deal ending Russia's war on Ukraine. Peace with other major global nuclear powers is *always* in the best interests for the US. You're missing the forest for the trees.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "IJustWantToBePure",
                                            "body": "This 💯",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "xJustin_Crediblex",
                                                    "body": "Pssst i still don't know why I should hate russia...they gave us Alex terrible the television and millions of slavic beauties...they used to be ran by the mafia? Is that why we dislike them?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "IJustWantToBePure",
                                                            "body": "You better keep that to yourself!!! We send billions to countries that literally want to kill us, burn our flag while chanting \"DEATH TO AMERICA!!!\", and have killed Americans.... yet Russia is seen as the ultimate evil. The Russian people hold no ill feelings towards us. It is our governments that have created and grown this perceived rift between us.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "marksandwich",
                                            "body": "That's absolute bullshit. Ukraine has held for 3 years against russia while russia had a massive man and material advantage that has evaporated with their economy. The only thing we needed to do is maintain sanctions and send old weapons from our stockpiles. Weapons we can then replace using american labor. America was made great by weapon sales from the world wars, and anyone suggesting otherwise is a fool, a foreign shill, or fails to understand the realities of our nation's hiatory.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Gallaga07",
                                                    "body": "Ukraine is facing a very serious manpower problem, any solutions for that?  I don’t want to send them any more American tax dollars, who knows how long they would need to hold out for.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "marksandwich",
                                                            "body": "Allow them to continue the draft they already have in place that has put them on parity with russian armed forces in regions? Conscription sucks, but when you are defending your homeland from an existential threat, it becomes necessary.\n\nAs for tax dollars, you could reduce it by using them smartly. Shipping out american made weapons in storage and replacing them with american made weapons from american factories puts tax dollars back in worker's pockets while creating livable wage jobs. I saw this morning trump is forbidding intel sharing, which is essentially bought and paid for already and costs 0 extra dollars to share with ukraine.\n\nThe only way this war ends is when russia stops fighting. We are applying pressure in the wrong direction at the moment if you want peace.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Candyland-Nightmare",
                                                    "body": "Anyone who truly believes that is a damn fool. Ukraine does not have the man power to win this war. They don't have the soldier, the population. Russia does. Without more boots, foreign boots, in the ground, Ukraine cannot take back their land and win. By do you want to prolong this unwinnable way? Do you have investments making bank right now from it?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "marksandwich",
                                                            "body": "If russia has that, why do we see them send waves of men on crutches into fire lanes? Russia would need a general mobilization to put much more men on the line, men they already struggle to supply and feed. I've seen the russians go from using BMPs to golf carts for frontal assaults in three years, from military trucks to civie trucks to donkeys for supply runs. I've seen russians dying from dysentary after not being supplied water and drinking from puddles. I appreciate your attempts to undermine my credibility, but you are wrong if you think this war is unwinnable.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Candyland-Nightmare",
                                                                    "body": "You're a fool.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "You standing with ukrain bud you got your lil toesis touching zalenskis lil footsies huh baby need a bah bah and nap nap oooo goochie goo.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "AuriiGold",
                            "body": "This was flat out embarrassing dude",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "xJustin_Crediblex",
                                    "body": "Sorry, i literally just got done watching Ace ventura. I'm kind of proud of myself, actually my first with no cursing, I think... I may be becoming a better person through cringe posts...thanks for pointing that out, man",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PerformanceBubbly393",
                                            "body": "Goated movie Jim Carrey will always be peak",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "drunkerton",
            "body": "https://preview.redd.it/lgg4yv6zrsme1.jpeg?width=600&format=pjpg&auto=webp&s=1ed6ee3c4a93b98685d687f330e6af2ab96e7e97",
            "score": 13,
            "replies": []
        },
        {
            "author": "pig_mom",
            "body": "They didn't even stand for a 13 year old child fighting brain cancer, they are disgusting",
            "score": 2,
            "replies": []
        },
        {
            "author": "Even_Ferret6333",
            "body": "They really showed how classy they are when they refused to show support for a child that overcame cancer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mysterious-Coconut24",
            "body": "Why the hell would anyone normal want to support civilian killing and raping disgusting terrorists? Supporting Ukraine is fine, don't want a penny of tax payer money going to Palestine and by extension, Hamas.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnowWhite3366",
            "body": "I stand with America ❤️ and Israel where my family and ancestors call home 💙🤍🇮🇱",
            "score": 5,
            "replies": []
        },
        {
            "author": "soupdawg",
            "body": "Elon said it best. They fall for Weaponized Empathy.",
            "score": 2,
            "replies": [
                {
                    "author": "Otherwise_Gas_6819",
                    "body": "Omg yes 🙌",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Otherwise_Gas_6819",
            "body": "Exactly !!!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "cptjaydvm",
            "body": "The left views everything in the lens of oppressors vs oppressed. Even though Ukraine is a predominantly white country, they were invaded by the evil horrible no good Putin who they blame for making Trump president. In that same lens they view Palestine as brown oppressed people so they prefer them to the white Jews. Finally, America is the biggest oppressor of them all and is always bad and terrible. Once you understand that frame of mind, it all makes sense.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ANTH888YA",
            "body": "They always are. I don't understand why don't they go fight for those countries or just move!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Today_is_the_day569",
            "body": "Don’t forget the LGBTQ flag or banner!",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Today_is_the_day569",
                            "body": "Very intelligent comment!  Not!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BrandDC",
                                    "body": "that troll is gone.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "3ndorphinzz",
            "body": "Maybe ask why your president is israel first. Maybe ask yourself why DOGE saves money everywhere but sending israel billions is so important.  Why is 500 million dollars to tel aviv university so important. Or why foreign aid has stopped everywhere except for israel. The truth is.  The United States will always be israel first.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_playing_the_game_",
            "body": "It is easy to critisize the nation that gives them the freedom to critisize it.\n\nIn palestine gays, trans or lgbtqabcdefg are not tolerated.\n\nIn ukraine the men would be forcefully rounded up and sent to the front lines.  \n\nThe main thing the left worry about in this nation is having their pronouns said incorrectly or being misgendered.\n\nThey truly do not understand how lucky they have it.",
            "score": 2,
            "replies": [
                {
                    "author": "FerretOnReddit",
                    "body": ">In palestine gays, trans or lgbtqabcdefg are not tolerated.\n\nExactly. And yet Hamas is the Liberals darling \"freedom resistance movement\", as if Hamas isn't dressed exactly like ISIS and acts exactly like ISIS... oh wait, Hamas **is** ISIS, just a different part of that God forsaken desert.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "Shit i know what ive been blessed with im a proud American baby and id lay my life down for this piece of paradise right now if i had to and things are only gonna get better now we got uncle trump back.\n\n*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FerretOnReddit",
            "body": "I stand with 🇮🇱 and 🇺🇦 and I'm 🇺🇸 with primarily 🇲🇽 and 🇩🇪 ancestry",
            "score": 2,
            "replies": [
                {
                    "author": "SnowWhite3366",
                    "body": "🙏💜",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Well_Bye76",
            "body": "Seeing lots of “I stand with Ukraine” posts…. Where are the “I stand with America” posts? If these libs want to stand with Ukraine, head over there and stand on the front lines, put your money where your ignorance is.",
            "score": -1,
            "replies": [
                {
                    "author": "Silver_Blacksmith_63",
                    "body": "It's not Ukraine or US. It's Ukraine or Russia. The U.S. is supporting neither--but Ukraine is closer to our value set. That's a false dichotomy on both sides.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Hobbyfarmtexas",
                            "body": "Ukrainian or US is what the democrats are presenting. Ukraine and US is what the republicans are presenting. \n\nEndlessly putting the US at more debt for an undefined and likely unachievable goal is Ukraine or US. \n\nA mineral deal which protects Ukraine and help recoup funds is Ukraine and US. Anyone who counters there is no security guarantee is overlooking the fact that a deal with a country that does not exist is no longer a deal. So long as there is strong US interest the country will exist and be protected.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sagittarius_90",
                    "body": "That's what I said on a post in pics 👏🏻👏🏻",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Well_Bye76",
                            "body": "Which I’m sure got downvoted given that sub. lol.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "sagittarius_90",
                                    "body": "I've been downvoted a lot in this sub too 🤷🏻‍♀️😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "![gif](giphy|6AKlAppbyjuiJ1eQ4a)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wise-Caramel-3188",
            "body": "That’s not it at all, I’m not left or right, I stand for what is right and anything else is cowering to what is wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AncapRanch",
            "body": "What? left (Socialits and Communist & Satatist) with Ukraine? Nope man kkkkkk you are Wrong, the left is Sith Russia, Putin huge statism and dciatorthorship, in US in Brazil the left extremist party PT (Workers Party, Socialist party and) are with Russia in all kinds. Liberals in US are not “revolutionaries left” is progressivist left) but the tradicuonal left in the world marxist etc is pro-russia, soviet union and loves Putin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LarryMyster",
            "body": "I also find it extremely hypocritical that they are all about socialism and communism yet really dislike Putin and Russia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shockrush",
            "body": "Well, I'm Canadian left, so I'd rather do that then the country attacking me lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApeSleep",
            "body": "They hate America. It’s evident. Very sad. I love this country bc it is in fact the best country in the world.",
            "score": -4,
            "replies": [
                {
                    "author": "Nebraska716",
                    "body": "Supporting a country that is at war doesn’t mean they hate America.  It’s not a one or the other thing",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Otherwise_Gas_6819",
                    "body": "They love to say they hate America but they sure do love the freedoms they have in America don’t they ?? Pisses me off",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xJustin_Crediblex",
                            "body": "![gif](giphy|ZKDbv75FWjdC4cwSe7|downsized)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sauron_II",
                    "body": "It ist in fact not",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RiekaNA",
            "body": "I don't understand. If they hate the united states so badly... why don't they move to the countries they support?",
            "score": -3,
            "replies": [
                {
                    "author": "BlacksheepEDC",
                    "body": "I think they just like complaining. They have nothing better to do.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "jeffbagwell6222",
                    "body": "When you are jobless and depressed you have nothing but time on your hands. These people need a hobby and some sunshine.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "JoeDukeofKeller",
                            "body": "Maybe they should go consider the Ukrainian Foreign Legion.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jkjkjk73",
                    "body": "I know right? I spent 10 yrs overseas in 4 different countries for a job. I'm so happy to be back in the USA.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Caitxcat",
                    "body": "Also other countries have more strict immigration laws.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "FerretOnReddit",
                            "body": "I find it funny how in literally ANY other country if you're an illegal immigrant you immediately get booted out. America is the ONLY country in the world where booting out people who shouldn't be here is a debate, when the rest of the world has decided its nondebateable. Classic America.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ed_mcc",
            "body": "I can not like Russia and also not want to give taxpayer dollars to Ukraine. Especially when zelensky has made it clear that he doesn't care about peace, he wants that territory back, which if I was in his position I probably would too. However, this war is an endless money pit for the US if we keep half ass supporting it. If we want to get Ukraine their territory back, for whatever geopolitical reasons, send the fuckin boys and blow the damn commies outta there. If we aren't willing to do that, it's not worth pumping money into this Ukrainian money laundering scheme IMO.",
            "score": 1,
            "replies": [
                {
                    "author": "Yulong",
                    "body": "“Pumping money” to degrade our #2 biggest enemy is the world isn’t a bad deal when our “money” is mostly old MRAPs, cluster munitions and Bradley’s that have been gathering dust out in the Mojave. \n\nTo be honest I think restoring Ukraines territorial integrity is a foregone conclusion too, but that doesn’t mean we can achieve other goals like putting the screws to the Ruskies for their chauvinism.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xJustin_Crediblex",
                    "body": "Hey bro what did putin do that was so terrible I feel like I'm outta loop 🥸 let's keep this covo on the dl my guy 🕵‍♂️",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brave-Elk-3792",
            "body": "https://preview.redd.it/8qa8pn2ffsme1.jpeg?width=500&format=pjpg&auto=webp&s=26ca8e7e8941840e0f07579a26098f4f2405c0f3",
            "score": -2,
            "replies": []
        },
        {
            "author": "GuyBanks",
            "body": "Liberals love the thought of being the world’s police.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BadWowDoge",
            "body": "Yes, I have noticed. We have noticed and voted accordingly.",
            "score": -2,
            "replies": [
                {
                    "author": "xJustin_Crediblex",
                    "body": "![gif](giphy|1lk1IcVgqPLkA)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MooshMM",
            "body": "those that actively root for another country and not their own are the traitors",
            "score": 0,
            "replies": []
        },
        {
            "author": "JudasForsaken",
            "body": "It is sad for sure.. let us help our brothers and sisters first before helping others",
            "score": -3,
            "replies": [
                {
                    "author": "Otherwise_Gas_6819",
                    "body": "Thank you !",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Birdflower99",
            "body": "…. The media doesn’t tell them otherwise",
            "score": -4,
            "replies": []
        },
        {
            "author": "69Jasshole69",
            "body": "Fet",
            "score": -1,
            "replies": []
        },
        {
            "author": "Alternative_Party277",
            "body": "Because Democrats think America is the best and is unbreakable. It doesn't need standing up for, America itself stands up for the weak.",
            "score": 0,
            "replies": []
        },
        {
            "author": "NegativeCricket5308",
            "body": "Yup!",
            "score": 0,
            "replies": []
        },
        {
            "author": "ferrum-pugnus",
            "body": "And they call patriotic and America First Americans treasonous. The irony is strong with them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mr_Ashhole",
            "body": "Biden sent a lot of bombs to Israel.",
            "score": 0,
            "replies": []
        },
        {
            "author": "AightThatsCool",
            "body": "Why does supporting Ukraine and Israel mean not supporting the United States?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Klok_Melagis",
            "body": "They wouldn't even know about Ukraine had the media not told them about it. While it's a serious issue and one we should keep our distance the truth is for the hardcore leftists \"Standing with Ukraine\" is a trend just like their support for Palestine you hardly hear them talk about Palestine anymore. This current trend with Ukraine risks Nuclear War maybe WW3, let's hope the next trend is a lot less harmless.",
            "score": -4,
            "replies": [
                {
                    "author": "FerretOnReddit",
                    "body": "Standing with Ukraine should be a bipartisan thing though, I'm right leaning, not old enough to vote yet lawl, but I stand with 🇮🇱 and 🇺🇦. Especially because I have two Jewish Israeli IRL friends and a Ukrainian Discord friend.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}