{
    "title": "🚨 Breaking: Elon Musk & Trump Answer Questions on DOGE!",
    "author": "Magro18",
    "subreddit": "Republican",
    "rank": 497,
    "score": 60,
    "upvote_ratio": 0.65,
    "num_comments (reported by reddit)": 65,
    "url": "https://www.youtube.com/live/VZzXQgZGlDE?si=0glOdMrHyxfTJE2p",
    "id": "1incuqv",
    "selftext": "https://www.youtube.com/live/VZzXQgZGlDE?si=0glOdMrHyxfTJE2p",
    "comments": [
        {
            "author": "None",
            "body": "Crazy times… what an odd video all around",
            "score": 64,
            "replies": [
                {
                    "author": "Equivalent-Web-1084",
                    "body": "Elon is strange on camera I think because he is on the spectrum",
                    "score": -25,
                    "replies": [
                        {
                            "author": "vipck83",
                            "body": "He is definitely on the spectrum. Funny how the left has no problem making fun of that.",
                            "score": -9,
                            "replies": []
                        },
                        {
                            "author": "Purple_Nerve_7115",
                            "body": "He’s a genius. Ever met one that wasn’t? Even most doctors are socially awkward.",
                            "score": -34,
                            "replies": [
                                {
                                    "author": "Agreeable-Shock34",
                                    "body": "He is certainly something",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BadWowDoge",
                    "body": "Elon is an odd person, I love it.",
                    "score": -21,
                    "replies": []
                }
            ]
        },
        {
            "author": "billstopay77",
            "body": "So, what are they saying. Get rid of the judiciary?",
            "score": 52,
            "replies": [
                {
                    "author": "EFpointe",
                    "body": "Yes",
                    "score": 15,
                    "replies": [
                        {
                            "author": "billstopay77",
                            "body": "Ughh, thats not a good thing.",
                            "score": 83,
                            "replies": []
                        },
                        {
                            "author": "billstopay77",
                            "body": "Ughh, thats not a good thing.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "ass_whiskers",
                                    "body": "I disagree, I think it’s overdue",
                                    "score": -96,
                                    "replies": [
                                        {
                                            "author": "billstopay77",
                                            "body": "How is getting rid of the judiciary which is the checks and balances a good thing?",
                                            "score": 67,
                                            "replies": [
                                                {
                                                    "author": "jedi21knight",
                                                    "body": "It’s not and I want to hear an argument that it is a good thing.",
                                                    "score": 41,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ass_whiskers",
                                                    "body": "Why do we need federal and state level oversight?? Decisions should be made faster, laws could be implemented faster without the Bureaucratic bs. The legal process needs to simplified and tailored to local and state level needs.",
                                                    "score": -74,
                                                    "replies": [
                                                        {
                                                            "author": "billstopay77",
                                                            "body": "The judiciary is there for checks and balances, its one of the 3 federal branches and is part of the constitution and has been since the beginning of our founding. If a law is so good then it shouldnt have any of the bureaucratic hurdles that you claim. If a proposal is stopped by the judiciary and if that proposal is so great then it should be able to be appealed and argued in court. The judiciary is there to uphold the constitution and the law, both sides have benefited from it. We cant suddenly decide lets get rid of it because we want to pass laws that are unconstitutional and we want to just do whatever the hell we want.",
                                                            "score": 86,
                                                            "replies": [
                                                                {
                                                                    "author": "THatMessengerGuy",
                                                                    "body": "Thank you for being the voice of reason here. I really mean it. People are really showing their unconstitutional leanings and political illiteracy with this situation.",
                                                                    "score": 47,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Agreeable-Shock34",
                                                            "body": "No, just no. We want to clear this subreddit from trolls, start with this guy who is clearly here to make us look like idiots.",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ghilliegal",
                                                            "body": "So a dictatorship, you want a dictator… 🙄",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Practical-Map9975",
                                                            "body": "Would you feel the same if a Liberal president wanted to do whatever he wanted without anyone stopping him?",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "grassi00",
                                                                    "body": "Most people should.  This isnt about wanting your specific team to win.  If a “liberal” president/judge/whoever was actively ruining how the country is run, then they should be stopped. This isnt a dictatorship, and thats how Don is trying to run it",
                                                                    "score": 36,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "cathbadh",
                                                            "body": "Are you sure you aren't a Maoist?",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cathbadh",
                                            "body": "So, just straight up dictatorship then?  The Founders gave us courts and separation of powers for a good reason.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 79,
            "replies": [
                {
                    "author": "StigMX5",
                    "body": "Like when your boss is speaking in meetings.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "El_Dorado817",
                    "body": "Maybe because Elon is running DOGE and not Trump so it would make sense for Elon to talk about what they’re doing? It’s a cabinet like rank, surely you know how a presidential cabinet and the other key roles work? Like the principle of it ?",
                    "score": -13,
                    "replies": []
                },
                {
                    "author": "pink-cocaine-mane",
                    "body": "Show some respect son. 👶🏾",
                    "score": -56,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bronqiaa",
            "body": "A lot of brigaders in the comments",
            "score": 6,
            "replies": [
                {
                    "author": "ClammySam",
                    "body": "A TON of them lol downvotes everywhere and non-r/republican points of view being upvoted.\n\nAn exhausting activity to engage in, I feel bad for them",
                    "score": 5,
                    "replies": [
                        {
                            "author": "cathbadh",
                            "body": "The downvotes ate crazy bad, but there are plenty of reasonable complaints here. Also, I think mass downvotes for the folks advocating removing the courts are well deserved.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dingobabies",
                    "body": "This sub is hit constantly not with not just down voters but dissenting opinions that get upvoted. I miss thedonald so much.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lamar_jamarson",
                    "body": "Lol, I noticed that too. The top comments are all left leaning POV, and actual conservative takes are downvoted to oblivion. Can't even have a discussion on an even playing field.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jokes-exe",
            "body": "More comments than upvotes, this subreddit is actually being targeted. Imagine having so much free time😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "Substantial-Raise144",
            "body": "It’s disturbing the shit the US taxpayers dollars have gone to!!!",
            "score": -4,
            "replies": []
        },
        {
            "author": "Geo-Bachelor2279",
            "body": "Those press people are so out of touch with the majority of Americans.",
            "score": -12,
            "replies": []
        },
        {
            "author": "Geo-Bachelor2279",
            "body": "I love the media question on if Elon's actions are being regulated and overseen.  Lady....the man finds shit and makes recommendations to the President.  He's not setting any policy or making any decisions.",
            "score": -13,
            "replies": []
        },
        {
            "author": "attempthappy2020",
            "body": "I watched the whole video here and Elon Musk seems direct and honest about examining the books!",
            "score": -6,
            "replies": []
        },
        {
            "author": "-Erase",
            "body": "Oh, I saw this and everything that Elon Musk said was fabulous. But my favorite part was at the end when he talked about the antiquated place they need to go to fire people and that it’s down  of mineshaft. And that if the elevator breaks, no one can get fired. 🤣\n\nHonestly, we need to move everything to electronic and we need someone that really knows tech to get it done. I’m thrilled he is in there to fix things. We don’t need a bureaucrat. We need a businessman.",
            "score": -30,
            "replies": [
                {
                    "author": "GiediOne",
                    "body": ">Honestly, we need to move everything to electronic and we need someone that really knows tech to get it done. I’m thrilled he is in there to fix things\n\nI'm beginning to think some of the things Elon has to deal with  in the government - like the mineshaft - was set up around 1776❗️👀",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juliusnvincevega",
            "body": "Pull thus down bro, thats a malicious link...",
            "score": -27,
            "replies": [
                {
                    "author": "AvidStressEnjoyer",
                    "body": "It’s a YouTube video.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "juliusnvincevega",
                            "body": "Bro, i do not believe anything was malicious,  but it tried to pull info and then immediately tried installing app...  nothing but love for my republicans...",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "juliusnvincevega",
                                    "body": "https://preview.redd.it/08xgsvt6omie1.jpeg?width=1736&format=pjpg&auto=webp&s=1342366bb3bbec8d0f010868772c23b49f91bb75",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "juliusnvincevega",
            "body": "The link pulled down info and tried installing an app...",
            "score": -21,
            "replies": [
                {
                    "author": "AvidStressEnjoyer",
                    "body": "It’s a YouTube video.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "juliusnvincevega",
                            "body": "OP,  i tried the link again, and it's the same shit...   must be on my end...   \n\nCheers 🍻",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}