{
    "title": "Dear Associated Press: It Is Not a Constitutional Crisis When You Are Disinvited From the Oval Office",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 452,
    "score": 213,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 91,
    "url": "https://redstate.com/bradslager/2025/02/12/dear-associated-press-it-is-not-a-constitutional-crisis-when-you-are-disinvited-from-the-oval-office-n2185498",
    "id": "1inymu3",
    "selftext": "",
    "comments": [
        {
            "author": "AvidStressEnjoyer",
            "body": "I agree that the press are definitely butthurt over this, but this strikes me as a disingenuous manipulation of what is going on, because we are in a constitutional crisis if Trump decides not to follow the legal process.",
            "score": 46,
            "replies": [
                {
                    "author": "THatMessengerGuy",
                    "body": "Beautiful to see some sense. Been seeing too many folk comfortably wiping their behinds with the foundational political structure of our country lately. \n\nApparently people think they’re pro America while actively weakening our country, pro freedom while supporting others abusing their powers, pro democracy until democracy is inconvenient, pro republic until their chosen representatives need to be held accountable and pro military while ignoring the constitution those troops swore their oaths on (amending/changing it is fine, but straight up disregarding it or twisting its intent is wildly unAmerican).\nShameful.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "kin3tiks",
                    "body": "This is disguised as credible. What process are you referring to being a “constitutional crisis?”",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "M_i_c_K",
                    "body": "Lead, follow or get the \"F\" out of the way.👍\n\nI'm sick and tired of the woke Bullshit !!!",
                    "score": -24,
                    "replies": [
                        {
                            "author": "AvidStressEnjoyer",
                            "body": "It’s not “woke” to break the government to have your way. \n\nThat’s a slippery slope.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "M_i_c_K",
                                    "body": "See above... 👆",
                                    "score": -15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CaptPotter47",
                            "body": "Following the Constitutional Process isn’t woke. It’s literally how our country is designed. If you don’t like it, find a new plot of land and setup TrumpLandia. \n\nNo one is above the Constitution and that where my concern about what he is trying to do it. Killing agencies, cutting funding, etc. that all stuff that Congress approved. Him basically trying to slash and do an end around Congress is an issue. Each branch of government is supposed to be a check on the others and right now Trump seems to be attempting to prune the other branches.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "M_i_c_K",
                                    "body": "You're in the way... IMHO,  you can take your tiny violin on down road. 😁",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "CaptPotter47",
                                            "body": "So you are ok with Trump potentially violating the constitution? \n\n*you’re",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "M_i_c_K",
                                                    "body": "I'm ok with doing what it takes to make things right again.  You people with tiny violins have had control for long enough. It's time for the adults to do what needs to be done to fix your F'ups.  😁👍",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "CaptPotter47",
                                                            "body": "Got it. You don’t actually care about the constitution and laws of the country.",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "M_i_c_K",
                                                                    "body": "Got it, you care more about playing that tiny violin than having a strong nation. 😁👍",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CaptPotter47",
                                                                            "body": "lol. \n\nNo I prefer a nation of laws and a strong constitution. \n\nIf the constitution is the tiny violen in playing, then yep sign me up for the orchestra.",
                                                                            "score": 13,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "M_i_c_K",
                                                                                    "body": "You play that tiny violin to avoid facing the music. 🤣",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CaptPotter47",
                                                                                            "body": "🎻\n\nWe the People of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defence, promote the general Welfare, and secure the Blessings of Liberty to ourselves and our Posterity, do ordain and establish this Constitution for the United States of America.",
                                                                                            "score": 9,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "M_i_c_K",
                                                                                                    "body": "I'm done here,  get your tiny violin re-tuned. 👍",
                                                                                                    "score": -4,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CaptPotter47",
                                                                                                            "body": "There is a lawful method to revise the Constitution. The president running roughshod over it isn’t that method.",
                                                                                                            "score": 9,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Adorable_Magazine_81",
                                                                                    "body": "The meme is accurate, calling it a \" constitutional crisis\" is dishonest.  It's not like Trump's trying to shut down the ap like Obama tried to shut down Fox news. Ofcourse libs cheered for that. I bet you cheered when Alex Jones got banned from Twitter too. So spare us your fake outrage and fake admiration for the constitution.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CaptPotter47",
                                                                                            "body": "Obama was wrong for trying to keep new orgs out also. \n\nAs far as Alex Jones goes, that’s not a 1st amendment issue at all. Twitter is a private company, the 1st amendment only applies to government regulating speech, or trying to dictate how the covers a story.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Adorable_Magazine_81",
                                                                                                    "body": "Uninviting the ap from the white house isn't a first amendment issue either.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CaptPotter47",
                                                                                                            "body": "The government punishing a news organization because they don’t like how they report the news, is a 1st Amendment issue.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Adorable_Magazine_81",
                                                                                                                    "body": "It's not effecting their ability to report their garbage stories and garbage narratives soooo no. Saying that it's a first amendment issue is both false and dishonest. Yes Twitter is a private company but files revealed that they were working with the intelligence agencies to ban people and control the narrative.  That definitely IS a first amendment issue!",
                                                                                                                    "score": -1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "raidmytombBB",
                                                            "body": "Can you define what 'make things right again' means?  Would like to understand from your pov what he is righting with the way he's running the govt",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Segelboot13",
                                                                    "body": "Securing the border, cutting wasteful spending, doing away with race and gender entitlements, reducing the size and scope of federal government, returning transparency to government, allowing the press access to the president for interviews and pressers, focusing on America first.....and the list goes on.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "raidmytombBB",
                                                                            "body": "Some things I agree with you on.  But others I disagree.\n1.  There's no transparency .  Just tweets and sound bits throwing out big numbers with no substance behind it.  \n2.  Press always has access to president, but most president's don't do daily press.  But controlling which press has access is not free world.\n3.  We talk about reducing size, scope, and cost but what do you think about the latest news wanting to add more debt?  Shouldn't they cut spending, not spend more.\n4.  One of the biggest items Trump ran on was lowering cost...eggs were called out by him.  Everything is more expensive, and inflation just went up.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Segelboot13",
                                                                                    "body": "Give me a break. The guy has been in office 3 weeks and done more good than President Potato did in 4 years. Be patient. It will take time to undo the clusterf%$& that President Biden left behind.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Whiterlight9",
                                                                                            "body": "I dont think you understand how economics works if you think the actions that have been taken in those 3 weeks are going to turn inflation lower, thats kinda the point here. Tariffs and lower interest rates means higher inflation, higher cost of goods (domestic and foreign). Thats not because it takes awhile, its because of what those actions do.\n\nSimilarly, the argument \"do whatever it takes\" is saying the ends justifies the means. If you get a powerful nation but that nation now works that law and rights are decided solely by the rich, is that worth it?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "raidmytombBB",
                                                                                                    "body": "Yes but transparency doesn't take time.  If you put a claim or statement about how much fraud you have uncovered, it's easy to back that with proof.  I honestly hope he's cutting back on unnecessary spending and he also sees how much money US has to spend for him to go spend time at mar lago and cuts those coats out.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CaptPotter47",
                                                                                                            "body": "He is forcing cuts on unnecessary spending sure. But he is also cutting spending that is for the greater good of America. \n\nThere are some things that USAID for example is doing that is good. Drug and disease research for example. \n\nAnd then he is introducing unnecessary spending.  The Gulf of America thing is the perfect example of unnecessary spending. Changing the name costs money, in time by the various organizations to update references and material with new signage. Wholly unneeded but feeds his ego. And sadly, there will be more cost when the next president undoes it.",
                                                                                                            "score": 4,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "M_i_c_K",
            "body": "https://preview.redd.it/hvtmnlabhrie1.png?width=1080&format=png&auto=webp&s=4322ccd87ba0a92b7301c73053734917fc5e9546",
            "score": 27,
            "replies": [
                {
                    "author": "Bdmason10",
                    "body": "Dawg do you have a job or something, u are literally posting shit every like minute. Human to human regardless of political affiliation this is not healthy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "M_i_c_K",
                            "body": "You do you... 😁",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "anarcho-slut",
                                    "body": "Nah cuz that's what all these other Repubs like to say about everyone else, it's always \"Oh these libtards should be working instead of being on reddit all day\" or \"these protesters never put in an honest days work\". So which is it? Or are you just immune to any kind of accountability or holding yourself to the same standards y'all espouse and then completely ignore anyone calling you on your bs?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Bdmason10",
                                    "body": "Same to you. I’m curious what line of work you are in that allows u this amount of free time, and how can I get involved.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "M_i_c_K",
                                            "body": "Hard work when you're young, pays off later. \n\n😁👍",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Bdmason10",
                                                    "body": "I hope when I’m at your age the family I have worked hard to cultivate will be around to keep me busy enough so I’m not spamming on Reddit all day.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "anarcho-slut",
                                                    "body": "So you're a retired grifter who has nothing better to do than rack up fake internet points. I guess you're winning at life. /s",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "IamNana71",
                                            "body": "Some of us are retired!",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ThatBankTeller",
                                                    "body": "Username checks out",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Pennsylvanier",
                                            "body": "It’s a bot",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Maccabee2",
                                                    "body": "Or retired 😁",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LuckOutrageous9627",
            "body": "It's crazy how many subs are anti republican now I try to fuck em back much as possible!",
            "score": 12,
            "replies": [
                {
                    "author": "None",
                    "body": "I jump in and stir the pot. They get mad then project onto me their anger.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "LuckOutrageous9627",
                            "body": "lol Ya I agree , I'm guilty to but it's real responses",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I have real responses until they resort to talking shit and so I gave up on being cordial",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PunchTilItWorks",
                    "body": "“Now?”  (Insert the always-has-been gif)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DividedWeStandTil",
            "body": "One item of note about AP is it publishes a style guide that many publishers use for guidance. I worked in magazine publishing for a time, and we followed the AP style guide. If they aren’t including Gulf of America then lots of other media won’t either. \n\n(Barbra Streisand is in the guide because so many spelled it Barbara)\n\nMore on the what the style guide: \nThe Associated Press Stylebook, commonly known as the AP Stylebook, is a comprehensive writing and editing reference guide used by journalists, newsrooms, classrooms, and corporate offices worldwide. It provides guidelines for American English grammar, punctuation, spelling, and usage, as well as principles of reporting. The AP Stylebook aims to ensure consistency, clarity, accuracy, and brevity in writing while avoiding stereotypes and offensive language.\nKey Features\n\t•\tComprehensive Coverage: The AP Stylebook includes over 5,000 entries covering various aspects of writing and reporting.\n\t•\tRegular Updates: It is published annually to reflect new additions to the English language and address common verbiage in media.\n\t•\tMultiple Formats: Available in paperback, spiral-bound, e-book, and online subscription versions.\n\t•\tWide Adoption: Used by many newspapers, magazines, and public relations offices across the United States.\nOrganization\nThe AP Stylebook is organized into sections, including:\n\t•\tBusiness Guidelines\n\t•\tSports Guidelines and Style\n\t•\tGuide to Punctuation\n\t•\tBriefing on Media Law\n\t•\tPhoto Captions\n\t•\tEditing Marks\n\t•\tDigital Security\nBy following AP style, writers can enforce consistency in their content, making it easier to write and more pleasant to read.",
            "score": 3,
            "replies": [
                {
                    "author": "M_i_c_K",
                    "body": "It would seem like the AP, their guide is seriously in need of having it's validity questioned.  🤔",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaptPotter47",
            "body": "AP is one of the biggest and most respected news services worldwide. Rejecting them because they don’t make Gulf of America as the primary in their style guide that is referenced worldwide is at the least petty. But give our freedom of press, might be a Constitutional issue.",
            "score": 11,
            "replies": [
                {
                    "author": "-Erase",
                    "body": "https://preview.redd.it/dvk8k23hhrie1.jpeg?width=1290&format=pjpg&auto=webp&s=f147bc732fa084528e5429766b4a12c2fd6ed7f2\n\nYou are thinking years ago, before they put all their stuff behind a pay wall. But now they have gone far left, and they are extremely liberal. Don’t believe me? Look at the screenshot above. It’s a far left organization that is straight up biased.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Bdmason10",
                            "body": "I mean people on this sub post tons of biased news articles. If we are gonna criticize the AP for it we need to be criticizing Fox News, newsmaxx, etc.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "I-am-the-Canaderpian",
                                    "body": "People in this sub do. They’ve learned to not blindly trust news media or their takes at face value and have some salt while they digest the information. \n\nThe issue lies within the common wo/man who do not do this, reading only headlines or stories that are less than 2 paragraphs long.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Bdmason10",
                                            "body": "I’ve been on this sub for years and shitty news sources are constantly spammed, and a ton of people believe it immediately. \n\nI am neither a Republican or a democrat and I think this problem affects both sides immensely. I actually identify more with republicans but if you truly think this isn’t a huge issue in the Republican/conservative sphere you are being willfully ignorant.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Tater72",
                                                    "body": "While I agree it does affect both, it doesn’t excuse AP for their actions.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Bdmason10",
                                                            "body": "Calling the Gulf of Mexico the Gulf of Mexico ? \n\nThis is so ironic, if a trans person told you to call them their new name you’d have a shit fit. Let’s be consistent.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Tater72",
                                                                    "body": "Interesting analogy, oddly I have.  That said, being in the Oval Office is a privilege not a right, there are plenty of organizations that don’t get that privilege.  They didn’t remove AP from the White House reporting pool",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CaptPotter47",
                            "body": "I’m not commenting on their political leaning. Only that worldwide they are one of the most respected news services and their style guide is used by news services worldwide, in addition to universities, schools, etc. \n\nThem still recognizing the Gulf as Gulf of Mexico makes sense since the world will still call it the Gulf of Mexico and the next president will just undo it anyway.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mrswashbuckler",
                    "body": "So every news agency should have a right to be crammed into the presidents office? Hundreds or thousands of people? Being in his office is s privilege not a right. Hell, under Biden, I don't think they even had the president take questions in his office. Reporters were forced to yell at him as he walked out to his helicopter or plane",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CaptPotter47",
                            "body": "There should be standards, but those should be based on reach, relevance, etc. not based on agreement or disagreement with the president’s policies.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "mrswashbuckler",
                                    "body": "Agreement/disagreement with America's policies you mean. The name change is an official act of the government. He wants it enforced. It would be a simple thing for AP to comply and just refer to it by its actual name. They would get their privileged access back very quickly. At least the Whitehouse is being very transparent on the why and actually allowing the press access to the president at all, unlike the last four years",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "CaptPotter47",
                                            "body": "If the AP was a US Centric organization sure. But they are an international organization. \n\nAnd remember this isn’t about what stories the AP is writing, but the Style Guide they publish. The style guide that used worldwide and given that everywhere except the US will still refer to the Gulf as Gulf of Mexico, their style guide would reflect the Common Name. This is the same reason Wikipedia isn’t change the article title for the Gulf.\n\nEven most Americans, including Republicans, are still going to refer to it as the Gulf of Mexico. Family are all pretty hardline republicans, and we all think it stupid and recognize the next president will just “change” it back.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "mrswashbuckler",
                                                    "body": "Nah, JD will keep it in place I'm sure. After twelve years of it being the Gulf of America people will have adjusted. And the AP doesn't have to do anything. They are free to do whatever they want with their style guide. The president doesn't need access to the AP. The AP needs access to the president. It is no hardship for trump to never take a single question from the AP again. There are plenty of other media outlets that will ask him questions and disseminate the information. Nobody is worried that they will not hear trump answer questions due to the AP having access to the oval office limited. They are redundant",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "CaptPotter47",
                                                            "body": "2 times in the past 100 years has the presidents party retained the WH when the sitting president isn’t running. \n\nI doubt Vance has much of a shot even without that consideration.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "mrswashbuckler",
                                                                    "body": "And there is no way trump could win a second term while being indicted and branded a Nazi insurrectionist. One of us can't read the room",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CaptPotter47",
                                                                            "body": "Given how bad Biden and Harris were both, I was pretty sure they would lose no matter who we ran. \n\nOf course Vance could win, particularly if Trump has a high approval rating. But historically it’s pretty uncommon. \n\nThe only presidential election I have been surprised by was Trump beating Clinton.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mrswashbuckler",
                                                                                    "body": "I don't see a bench full of winners lining up for 2028. The Democrats still haven't learned any lessons from November and I'm not convinced their voters will allow them to. There is a cultural shift happening in America right now and it isn't in the Democrats favor.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CaptPotter47",
                                                                                            "body": "Maybe. Depends on how many of his voters get fired as part of the sledgehammer Elon has right now. \n\nAnd of course if prices end up rising as result of the tarrifs.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "mrswashbuckler",
                                                                                                    "body": "DC is 96% democrat voters. Especially in federal government employment rolls and I'm confident the economy will be in fantastic shape by 2028. How much of the grant money that is getting shut off has been laundered into democratic party coffers will be a bigger influence on the election more than federal employees getting laid off will. DC is only 3 electoral votes. The money spigot getting shut off could be worth many more electoral votes",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CaptPotter47",
                                                                                                            "body": "Oh honey. \n\nYou think federal workers live in DC.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "StigMX5",
                                                                            "body": "He also lost after his first term to Biden.  Peoples viewpoint of presidents change over time.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "M_i_c_K",
            "body": "Waves 👋 at mentally perverted leftist stalker humping the down vote button, always desperately seeking attention. 🤣",
            "score": 13,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 21,
                    "replies": [
                        {
                            "author": "M_i_c_K",
                            "body": "There seems to be no limit to the perversion of the lowlife scumbags . 🤔👍",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "LuckOutrageous9627",
                            "body": "Exactly as if we didn't know it was evident",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "et_hornet",
            "body": "It’s not a constitutional crisis but it’s petty and stupid of Trump to not allow the reporter because AP calls it the Gulf of Mexico (which it still is in the rest of the world).\n\nHe’s making himself more controversial than he already is",
            "score": 2,
            "replies": [
                {
                    "author": "M_i_c_K",
                    "body": "Dead naming is generally not acceptable... Why should AP be treated special. 🤔",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reddit_Rollo_T",
            "body": "They forgot what an invitation means",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuckOutrageous9627",
            "body": "Ya keep bringing up Biden and they have no defense",
            "score": 3,
            "replies": []
        },
        {
            "author": "SuchDogeHodler",
            "body": "you can work for the American people, or you can work for the Democrats, but you can't do both!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tater72",
            "body": "What we need is congress to take up and attack MSM.  They need to create something that requires fair and unbiased news.  If they are that way they need to declare as such.  This is how it used to be, the national enquirer said what they wanted but it was clear they were not “news”",
            "score": 1,
            "replies": []
        },
        {
            "author": "BadWowDoge",
            "body": "It’s also not a Constitutional Crisis when your financials get audited…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agreeable-Shock34",
            "body": "Not a constitutional crisis but super petty on both sides. This is a layup for him to be showing that he is being transparent in admin, not sure why he wont shoot it.",
            "score": -2,
            "replies": [
                {
                    "author": "M_i_c_K",
                    "body": "\"Not A Constitutional Crisis\" \n\nNo more to say. 👍",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "It is a direct assault on free speech my friend. So. Yes. It is.",
            "score": 0,
            "replies": [
                {
                    "author": "Segelboot13",
                    "body": "Hardly. They're just not used to being on the outside looking in. There are tons of media outlets that don't have invitations to the oval office. they are still in the White House briefing room.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}