{
    "title": "Hell yeah this is an important one!",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 402,
    "score": 469,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/yk7t8rcrh1je1.jpeg",
    "id": "1ip3ej0",
    "selftext": "",
    "comments": [
        {
            "author": "MamaD79",
            "body": "Kash, Kash, Kash..... USA USA USA! 🙏🏻🦅🇺🇲🙏🏻",
            "score": 3,
            "replies": []
        },
        {
            "author": "ElizabethThomas44",
            "body": "The very fact that so many Dems and known cheaters are working so hard to villainze him means only one thing - he is the Good and Sane one.  That is why dems etc are so afraid of him.  Most such people in past were only fox in sheeps clothes, but because all looked like sheep - most of us gave a benefit of doubt and they all ensure eps\\*in files nevery ever came out. Nor did most important ones.  This guy is GENUINELY good.  I hope he does bring out those files + all such ones.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 8,
            "replies": [
                {
                    "author": "Roudyrepublican",
                    "body": "The 'whistleblower' is democrat Dick Durbin. At this point any claim Democrats are making against Trump's admin needs to be backed up with proof, not just a letter to the inspector general. I will give this my attention when it's proven and IF it's proven then I expect Kash to be out. \n\nI won't hold my breath though...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jackiebrown1978a",
                            "body": "Yeah. They have tried this crap too many times for us to believe them now.\n\nI'm still waiting for some made up bombshell kid porn accusation coming out. The Democrats have no shame and will keep this up.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "This guy creeps me out for some reason, can’t quite put my finger on it yet",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Substantial-Raise144",
            "body": "Finally folks we can trust to get the shit going on cleaned up 🇺🇸",
            "score": 6,
            "replies": []
        },
        {
            "author": "DON_SaadZ",
            "body": "I am not that much into politics and also not in the US. But isn't Trump getting soft on Russia? I mean it seems like Trump likes to cool things off and leave Ukraine than strengthen it and risk a total war with Russia.",
            "score": 3,
            "replies": [
                {
                    "author": "Comprehensive-Tell13",
                    "body": "What's that got to do with Kash",
                    "score": 14,
                    "replies": [
                        {
                            "author": "echo_supermike352",
                            "body": "Because anything related to politics will always be related back to Trump. That's how it's always gonna be today",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TotalRelevantMiddle",
                    "body": "The USA violated a longstanding agreement that Ukraine wouldn't join NATO. Ukraine knew this and they and the previous administration let it happen. They knew it would happen. They wanted to give their vested interest blackrock more contracts, they are warmongers. We violated first, Trump realizes that and is trying to set things straight.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "skinniks",
                            "body": "> The USA violated a longstanding agreement that Ukraine wouldn't join NATO.\n\nLike the longstanding agreement that Russia would respect Ukrainian borders in exchange for Ukraine giving up their nukes?",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "toterra",
                            "body": "> The USA violated a longstanding agreement that Ukraine wouldn't join NATO\n\nNot even remotely true. The 'agreement' would have been between James Baker and Gorbachev. It did not appear in any text of the actual agreement. And both James Baker and Gorbachev have clarified in interviews that no such agreement existed. This 'agreement' really has only existed in the minds of Russian propagandists trying to justify breaking the actual agreements.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Comprehensive-Tell13",
                            "body": "I'm surprised more people are not speaking the truth the way you did. I'll bet there are very few people that can link  that little bit of reality with trumps off the wall desire for Greenland.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "ImThe_One_Who_Knocks",
                                    "body": "Because if you speak out in favor of peace or seeing things from both sides you’re seen as a “collaborator” or a “shill/agent of the enemy”. The deep state has managed to convince people that only total decimation of the enemy is an acceptable end to the war.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "ForumsDweller",
                                    "body": "Didn't Russia break an agreement with Ukraine to respect Ukraines borders in exchange for them giving up their nukes to Russia?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Biden: \"I think Ukraine should join NATO.\" Famous last words. History tells us not to do that.....",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "independentlywrong",
                    "body": "You're not into politics but decided to troll this one post? Gtfoh",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "SIewfoot",
                    "body": "Feel free to have your own country send weapons and people to fight the Russian army.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "StigMX5",
            "body": "I'm asking to understand some comments here better.  What's the appeal of Kash to those that support him?\n\nOther Republicans from the past Trump administration (Gina Haspell, etc) have said  he's unqualified and a partisan hack, why do you feel he's qualified to lead the FBI?  \n\nFrom what I've read about him, his background is concerning along with his finances.  Let alone the children book craziness - seems like just like he's being place due to his Trump loyalty, not his true qualifications to lead the FBI.",
            "score": 2,
            "replies": [
                {
                    "author": "noxnocta",
                    "body": "> he's unqualified and a partisan hack\n\n* Federal Public Defender\n* DOJ Prosecutor and Legal Liaison to Joint Special Operations Command (in the Obama administration, btw) \n* Committee Aid to House Intelligence Committee \n* National Security Council Staffer \n* Senior Director of Counterterrorism Directorate \n* Principal Deputy of the Director of National Intelligence \n* Chief of Staff to the Secretary of Defense",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "SurvivalSequence",
                    "body": "I honestly don’t know a whole lot about him but I’ve seen his pro 2A stance and that is something I absolutely get behind.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "You could say the same about other nominees like Pete Hegseth. Hegseth isn’t even a major, let alone someone with the experience to run the DoD. The job requires managing a massive global force, coordinating with top military leaders, and handling complex defense strategy. \n\nHis background? Cable news host and a stint as a National Guard captain. There are actual generals with decades of experience who answer to this role, and we’re supposed to believe he’s the best pick? Come on.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MamaD79",
                    "body": "He's as qualified as anyone! (See response comment to you)🙏🏻🇺🇲🦅🙏🏻",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "MamaD79",
            "body": "👏🏻👏🏻👏🏻👏🏻 🙏🏻✊🏻✊🏻✊🏻🇺🇲🦅🇺🇲🙏🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appleguy4life",
            "body": "Get ready for the media manufactured outrage",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frequent-Worth5202",
            "body": "We need this man as head of the FBI.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Putin finally feeling americas full smite. Our president finally putting Putin in his place. So tough, so strong. What a win",
            "score": -2,
            "replies": [
                {
                    "author": "Thyne22",
                    "body": "Why did vivek dip out? Was it really to run for mayor? He was all in up until Elon it seemed like and he was in the fantastic 4",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rockerharder1",
                            "body": "My guess is that it was an ego thing. Putting him and Elon together to head DOGE probably didn't sit right with him.  \nAfter all, he was running for VP. After getting passed up for that.. who knows.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "No_Virus_7704",
                                    "body": "He's running for gov of Ohio.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MamaD79",
                            "body": "No not Mayor, Governor of Ohio",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EmuRepresentative663",
            "body": "#TeamKash 👏👏👏",
            "score": 0,
            "replies": []
        },
        {
            "author": "Dapper-Bluebird2927",
            "body": "Go Kash!!",
            "score": -4,
            "replies": []
        },
        {
            "author": "ElementsUnknown",
            "body": "![gif](giphy|YOqgIna6v6fGPHio5j)\n\nGive us the Kash!!!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "skynet-1969",
            "body": "👏👏👏",
            "score": -6,
            "replies": []
        },
        {
            "author": "BillionaireBulletin",
            "body": "Dissolve the entire FBI.  If any one of the old FBI is left in, they will be like a cancer that comes back and destroys the organization again.",
            "score": -3,
            "replies": [
                {
                    "author": "Equivalent-Web-1084",
                    "body": "This is my fear of this entire effort of the Trump admin, it's like putting a Band-Aid on a cancerous tumor. I'll stay optimistic and enjoy the wins never the less.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Version-8548",
            "body": "Wait, what about Tulsi Gabbard?",
            "score": 0,
            "replies": [
                {
                    "author": "MamaD79",
                    "body": "What about her? She is highly qualified for the job she was voted into: United States Director of National Intelligence! 🙏🏻🇺🇲🦅🙏🏻",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Unique-Version-8548",
                            "body": "Oh nvm. Yes she is very qualified and I am glad, and also glad that dude as well",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MamaD79",
                                    "body": "And she's already been confirmed! 👏🏻👏🏻👏🏻👍🏻🙏🏻🦅🇺🇲🙏🏻",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "arpitas30",
            "body": "We like this DEI hire now?",
            "score": -7,
            "replies": [
                {
                    "author": "SurvivalSequence",
                    "body": "wtf are you talking about?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MamaD79",
                            "body": "Wondering the same 🤷🏼‍♀️",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}