{
    "title": "In case you’re having trouble keeping up, here’s a summary . . .",
    "author": "None",
    "subreddit": "Republican",
    "rank": 404,
    "score": 151,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 56,
    "url": "http://www.wh.gov",
    "id": "1ip84dz",
    "selftext": "In case you’re having trouble keeping up, here’s a summary . . . \n\nTrump: I am cutting wasteful spending by our Government.\n\nDemocrats: IMPEACH HIM! We told you that Trump would be a dictator on day 1!! \n\nElon: We are $36T in debt, let’s find ways to cut Government spending.\n\nDemocrats: NO ONE VOTED FOR ELON MUSK!\n\nRFK Jr.: I want to make America Healthy Again!\n\nDemocrats: WHAT!?! Noooo!!! You can’t do that!!\n\nTrump: I will be putting a 25% Tariff on Mexico and Canada for refusing to work with America to stop the trafficking of deadly drugs coming into our Country.\n\nDemocrats: WTF!! Americans will now have to pay higher prices for Avocados and Coronas.\n\nTulsi: We should discuss the U.S. DoD funded bio labs in Ukraine.\n\nDemocrats: OH!! HELL NO! Tulsi is Putin’s puppet!!\n\nTrump: I am deporting criminals who are in our Country illegally.\n\nDemocrats: Ummm?!?! Who will pick our crops????\n\nRFK Jr.: I want to put an end to the rise of Chronic Diseases in children.\n\nDemocrats: Hey, dummy…that is literally Big Pharm’s job!!\n\nTrump: We should look into ending all Federal Incomes taxes.\n\nDemocrats: WTF!! What about egg prices?!?\n\nElon: We should investigate how members of Congress making low end 6-figure salaries become multi-millionaires.\n\nDemocrats: PANIC!! Billionaire Musk will have access to your home address and social security number!\n\nTrump: I want to move forward with eliminating Federal Income Taxes on Overtime & Social Security.\n\nDemocrats: AHHH!!! YOU ARE LITERALLY HITLER!\n\nHegseth: We shouldn’t spend billions protecting foreign borders, while completely ignoring our own.\n\nDemocrats: WHAT ABOUT EGG PRICES?!?\n\nRFK Jr.: We need to ban toxic dyes and bring awareness to the negative impacts on Fluoride in our water.\n\nDemocrats: SOMEONE, STOP HIM!! He is a crazy conspiracy theorist!!!\n\nTrump: I am protecting women’s sports by signing an Executive Order to ban biological males from biological female’s sports.\n\nDemocrats: HORRIBLE!!! Only evil people would do such awful things to transgender women!!!\n\nElon: Should we audit the IRS next?\n\nDemocrats: The Rocket Scientist is, like, the dumbest billionaire, like, ever..!!!!!!!!",
    "comments": [
        {
            "author": "New-Conversation3246",
            "body": "Just remember that none of this is organic. Reddit is 90% manufactured propaganda, assisted with bots and (likely) paid liberal agitators. How do I know this? 1) Trump won the election despite Reddit’s assurances this would not happen. His high ratings also tell a contradictory story. 2) People are still buying Teslas; the stock is doing quite well. 3) The world is done with woke bullshit and electing conservatives governments worldwide",
            "score": 85,
            "replies": [
                {
                    "author": "SIewfoot",
                    "body": "Probably a lot of foreign governments trying to undermine the US as well.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "ConsistentType4371",
                            "body": "Hate us cuz they ain’t us",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "FerretOnReddit",
                                    "body": "Hate us cuz they not like us",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SIewfoot",
                                            "body": "Hate us cuz they anus",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FerretOnReddit",
                    "body": ">3) The world is done with woke bullshit and electing conservatives governments worldwide\n\nIsn't Canada also electing conservatives? And maybe the UK as well, but the situation in the UK is dodgy right now, last I checked they were dumb enough to allow Muslim Fundamentalists into the government, and now pubs and stuff are being shut down in the UK and Ireland because of Sharia Law",
                    "score": 5,
                    "replies": [
                        {
                            "author": "New-Conversation3246",
                            "body": "Maybe they were too hung over to notice before. I think that’s changing",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UnlikelyStaff5266",
                    "body": "The Harris campaign flooded Reddit with pro Harris and anti Trump posts.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Competitive_Sail_844",
                    "body": "Manufactured via USAID",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wide_Wrongdoer4422",
            "body": "This needs to be upvoted more. Instead of addressing the fraud and waste that his going on, the opposition questions the legitimacy of those that found it.",
            "score": 39,
            "replies": []
        },
        {
            "author": "internalbrowser",
            "body": "I was about to quit Reddit from all the liberal propaganda , so thank you",
            "score": 24,
            "replies": [
                {
                    "author": "The_Dirty_3rd",
                    "body": "I have 4 subs I now follow and ignore all others. r/conservatives r/Republican ,one other that's work related and one for fantasy football. I even had to quit looking at the sub for my hometown because it hurts my soul knowing there are so many morons who are my neighbors apparently!",
                    "score": 11,
                    "replies": [
                        {
                            "author": "woman-ina-mansworld",
                            "body": "Your hometown subs are took over by a very few and are paid by dark money to sit in their basement to hurt your sole. Their funding sources will dry up when we follow the money. \n\nRemember…, we are in the majority and it’s time that we all show we’re not scared to show our support to the man that took a bullet for us.\n\nWe have the Dream Team",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ConsistentType4371",
                            "body": "I have muted and unsubbed to everything but conservative/republican subs because this site has become so incredibly inflammatory",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "BleachBrain",
                            "body": "Same. Been blocking SOOO many subs lately.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SteveyCoupons",
            "body": "What people don't understand is Trump has been saying Elon was gonna be the main person leading the charge in government efficiency LITERALLY since he started his campaign. He's been saying it. I know what I voted for. ANTHONY FAUCI (AN UNELECTED OFFICIAL) MANDATING VACCINES, but of course they don't want to talk about that. Karma's a bitch and his name is Elon Musk. Deal with it like we dealt with fauci's ass.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SashaG239",
            "body": "Very accurate record. Thanks for the play by play.",
            "score": 21,
            "replies": []
        },
        {
            "author": "MaBonneVie",
            "body": "Love this!\n\nAs fast as things are moving, I’m having trouble keeping up. Maybe you could do a daily/weekly update.",
            "score": 13,
            "replies": [
                {
                    "author": "warhorse500",
                    "body": "I'll second this.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "justrob32",
            "body": "https://preview.redd.it/zzqo0vqwu4je1.jpeg?width=1170&format=pjpg&auto=webp&s=9f3b520c0cf3623a22847952c992e426631fcc51",
            "score": 8,
            "replies": []
        },
        {
            "author": "Roudyrepublican",
            "body": "Trump's admin asking all the real questions! I swear I've been asking since I was a teenager how these people in DC make 6 figures, but have millions in net worth.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lynke524",
            "body": "Seeing it all laid out like this makes me wonder how they come up with their ideas. The republicans say something and the democrats make outlandish statements.",
            "score": 4,
            "replies": []
        },
        {
            "author": "FerretOnReddit",
            "body": "This is literally so accurate. Trump and Elon and RFK could find the CURE TO CANCER and the Libtards would find a reason to hate them, they'd just say \"WHAT ABOUT EGG PRICES?!\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "sailor-jackn",
            "body": "This is pretty accurate. Crazy people saying crazy things.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Unable_Ideal_3842",
            "body": "Spot on",
            "score": 5,
            "replies": []
        },
        {
            "author": "Zealousideal-Run8592",
            "body": "The Elon being dumb does it for me 😂😂😂",
            "score": 6,
            "replies": [
                {
                    "author": "SashaG239",
                    "body": "The bartender from NY felt some way about him. I'm sure she's qualified to render such an opinion.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ambidextr_us",
                            "body": "Haven't you heard? AOC is a multi-billionaire scientist. /s",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lokulater",
            "body": "Cant wait for  “Now that is what we call a President “\nVolume 2",
            "score": 2,
            "replies": []
        },
        {
            "author": "RickPar",
            "body": "That's brilliant",
            "score": 4,
            "replies": []
        },
        {
            "author": "Forsaken-Ad-7502",
            "body": "Well said, thank you.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zealousideal-Run8592",
            "body": "And the democrat voters are echoing what ever they’re told! 🤡",
            "score": 3,
            "replies": []
        },
        {
            "author": "LakeLoverNo1",
            "body": "Well said. 😎",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "They need to look to Japan and China for drugs also....",
            "score": 1,
            "replies": []
        },
        {
            "author": "sinisterkyrin",
            "body": "What about people claiming how eliminating DEI also affects disabled people from getting jobs, and other types of people? \n\nAnd why did he change the name of the gulf?? What was the point of that? \n\nWhy did Trump fire thousands of FAA employees? Isn’t that the reason for the plant crashes we’re now seeing so often? I’m genuinely asking to ask, not to be an asshole.\n\nDidn’t Elon also do a heil seige…? I don’t know, that seems kinda fucked up to me.\n\nLastly, it looks like RFK is potentially limiting SSRIs and mood stabilizers… which has been helping people tremendously with depressions",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "🤡",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scourmont",
            "body": "Biolabs in Ukraine... 🤣 🤣 😂 😂",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "Did I stutter? https://www.peoplesworld.org/article/after-months-of-denial-u-s-admits-to-running-ukraine-biolabs/",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}