{
    "title": "BOOM: DOGE Gets a Sweet Victory in Court",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 354,
    "score": 203,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 38,
    "url": "https://pjmedia.com/matt-margolis/2025/02/15/boom-doge-gets-a-sweet-victory-in-court-n4937010",
    "id": "1iq59ng",
    "selftext": "",
    "comments": [
        {
            "author": "infiniteoo1",
            "body": "Shall we post to r/law and watch them boil over",
            "score": 67,
            "replies": [
                {
                    "author": "soupdawg",
                    "body": "That sub should be called r/delusinallaw",
                    "score": 13,
                    "replies": [
                        {
                            "author": "BigIronOnMyHip45-70",
                            "body": "You could do that with most of the subs tbh.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LakeLoverNo1",
                    "body": "Do it. 😎",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Silver_Blacksmith_63",
                    "body": "No--it's too early. This is a good start but we need Congress to put the nail in it. Contact your Comgressman",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FerretOnReddit",
                    "body": "https://www.reddit.com/r/law/s/uhuYpOgD03\n\nOne of the top comments in this post is \"Free Luigi\", as in that guy who shot the CEO. These Libtards are insane. First they chant for the death of Israel, and now they're chanting for a murderer to be freed. So loving and tolerant /s\n\n\n\nEdit: These Libtards can't stop comparing Trump to Hitler it's actually concerning. And they claim to hate Nazis but it's the DEMOCRATS chanting \"from the river to the sea\", which is literally a call for a genocide of Jews. The projecting is actually fucking insane.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "usernamesarehard1979",
                    "body": "R/lawyer might be better. Then you get to see all of the reddit morons pretend to be a lawyer.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "FerretOnReddit",
                            "body": "r/itsalowercaseR",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "usernamesarehard1979",
                                    "body": "Tell Reddit. It automatically capitalizes at the beginning of a sentence.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Substantial_Two983",
            "body": "God Bless AMERICA!!!!",
            "score": 8,
            "replies": []
        },
        {
            "author": "quaifonaclit",
            "body": "\"Curiously, lawyers for DOGE have attempted to avoid the \"agency\" label during court hearings despite its \"strong claim\" to agency status, Bates wrote. \"This appears to come from a desire to escape the obligations that accompany agencyhood\" — such as being subject to the Freedom of Information Act, the Privacy Act and the Administrative Procedures Act — \"while reaping only its benefits,\" the judge wrote.\n\n\nAccountability for thee, not for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "tomcat91709",
            "body": "Lawfare fails again.\n\nEvidently,  the Democrats and Liberals are slow learners who are getting increasingly desperate. \n\nKarma is coming.  It is unavoidable.",
            "score": 42,
            "replies": [
                {
                    "author": "Silver_Blacksmith_63",
                    "body": "No this is still temporary. Contact your Comgressman to get them to specifically authorize and then there's no legal standing",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silver_Blacksmith_63",
            "body": "This is a good start, but the journalist overstated the actual filing--he did NOT rule that DOGE is a department. He ruled that IF it's a department THEN they're on solid ground. \nCongress should pass an emergency measure NOW and give them authority. It takes all the wind out of the sails. \n  Expect lawfare to continue until the House and Senate stand up and support Trump. Otherwise, it's shaky. Musk hasn't been confirmed by the Senate and there's no legislation yet giving authority.",
            "score": 11,
            "replies": [
                {
                    "author": "SnooPeripherals2495",
                    "body": "Yeah it’s a win for them but the article was kind of a bunch of half truths",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mdws1977",
            "body": "More of those victories for DOGE are coming.",
            "score": 8,
            "replies": []
        },
        {
            "author": "KyleforUSA",
            "body": "I’m so excited that something is happening with this.  Every politician talks about doing it, but nobody ever actually tackles it.  I know it won’t be perfect, but it feels like Trump/Musk might be the perfect storm of crazy enough to do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial-Tone-576",
            "body": "Judicial branch block executive orders?",
            "score": 1,
            "replies": [
                {
                    "author": "Silver_Blacksmith_63",
                    "body": "That is the point of the Constitution. The issue here is that the Republican Congress needs to grow a pair and give authorization. If they specifically give authorization, there is no legal ground. The issue is that the Libs are relying on executive overreach which should be easy to overcome",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "M_i_c_K",
                    "body": "Judicial overreach much... 🤔",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Substantial-Tone-576",
                            "body": "“But, that’s what they are there for” people who don’t understand all are Biden appointees that probably got kick backs too.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "giff_liberty_pls",
                                    "body": "I've read so far that there have been blocks from judges appointed by Reagan, Bush W., and Trump himself as well. There's a LOT of cases right now.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Substantial-Tone-576",
                                            "body": "The executive branch is doing a lot and getting people angry. I hope wars are stopped not started but I think change needs to come or America will fail.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Silver_Blacksmith_63",
                                                    "body": "Contact your Congressman.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "tim310rd",
                                    "body": "The Rhode Island judge's wife was the head of a non profit that receives USAID funding, huge conflict of interest and he should have recused.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Substantial-Tone-576",
                                            "body": "Yeah that sounds about how it goes. But they don’t recuse themselves because they think they won’t get in trouble?",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "M_i_c_K",
                                    "body": "From kick backs to a kick in the butt in a matterof weeks... 😁👍",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "No_Virus_7704",
                                    "body": "People who don't understand can't afford to understand that they are flat out delusional (about many things).",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Silver_Blacksmith_63",
                                            "body": "No the issue here is that Trump could have avoided all this by just asking Mike Johnson to get a bill through giving access. We have a Republican Congress. The judicial branch is simply saying that the executive branch can't act unilaterally--which is a GOOD thing! Imagine if we didn't have this when Biden tried to just forgive the student debt. We liked that ruling because it put the executive branch in check. We worked hard to get Republican House, Republican Senate, and Republican White House. Trump has to use that instead of just signing pieces of paper.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FerretOnReddit",
            "body": "It's only temporary for now, but even if it becomes official the Libtards will scream \"corruption\" 🙄🙄🙄🙄",
            "score": 1,
            "replies": []
        }
    ]
}