{
    "title": "Ohio bill would make it illegal to ejaculate without the intent to conceive a child ... You'll never guess who's exempt",
    "author": "Ask4MD",
    "subreddit": "Republican",
    "rank": 378,
    "score": 5,
    "upvote_ratio": 0.54,
    "num_comments (reported by reddit)": 31,
    "url": "https://notthebee.com/article/ohio-bill-would-make-it-illegal-to-ejaculate-without-the-intent-to-conceive-a-child?",
    "id": "1iq9cjq",
    "selftext": "",
    "comments": [
        {
            "author": "DaDawkturr",
            "body": "https://preview.redd.it/4ajv7ev7ycje1.jpeg?width=480&format=pjpg&auto=webp&s=4e43d534ae6341d556fc6320b04e3273512910f7",
            "score": 9,
            "replies": []
        },
        {
            "author": "dudeimdead187",
            "body": "https://preview.redd.it/2yn9nkdb1dje1.jpeg?width=1170&format=pjpg&auto=webp&s=6e6888b575c69298ee8868495d64b27d5f62260a",
            "score": 16,
            "replies": [
                {
                    "author": "stlyns",
                    "body": "🤣😆🤣😆💀",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "tomcat91709",
            "body": "Due to the exemption, this has discrimination all over it.",
            "score": 11,
            "replies": []
        },
        {
            "author": "iLikeSmallGuns",
            "body": "Whew! Glad I’m exempt… this would cost me around $210,000 per week.",
            "score": 5,
            "replies": []
        },
        {
            "author": "KyleforUSA",
            "body": "Liberals are silly people.  At this rate they are going to manage to destroy their party.",
            "score": 7,
            "replies": [
                {
                    "author": "Difficult_Place_7329",
                    "body": "I’m sick and tired of people and their whining and crying about how they’re scared of this country and they want to move, to these outrageously expensive countries like Norway and Australia. They couldn’t afford it. All of the internet is liberal bullshit propaganda. None of it is facts. None",
                    "score": 2,
                    "replies": [
                        {
                            "author": "KyleforUSA",
                            "body": "There really is no greater country, this is why everyone still wants to come here.   It's sad to think about how great we truly could be if our money wasn't squandered.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shutupdrphil",
                    "body": "They already have, they have hitlers dick in their mouth 24/7",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WPWeasel",
            "body": "And this is why the Democrats are up shit creek - people can't pay their bills and they're floating fining people for emptying their ball sack.\n\n\nClearly they're trying to make some bizarre point undoubtedly related to abortion. However they're increasingly viewed by voters as unserious drama queens with a penchant for theatrics. And that's not a recipe for gaining back the trust of pissed off voters. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "Conscious-Duck5600",
            "body": "Ok you kids, no more sleeping. It's illegal to have wet dreams. The last time I had sex in public was-never. So how in hell are you going to catch someone?",
            "score": 4,
            "replies": [
                {
                    "author": "Longjumping_Type_901",
                    "body": "Dems just think a cum shot is equivalent to a woman paying a \"doctor\" to murder her unborn baby.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Profit_Euphoric",
            "body": "I hope no one in this thread believes that this is real legislation. It’s just mocking how as of lately, women have been pushed back with what they can/can’t do with their bodies. \n\nThen, the legislation is doing the same for men and NOW it’s a big fat no? The irony is at peak. 😂",
            "score": 2,
            "replies": [
                {
                    "author": "Dismal_Survey_539",
                    "body": "I said something similar. My guess is anyone taking this seriously is either a bot or a dumbass",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Fake news. Liberals only know hyperbole and embellishment. That’s why they LOSE",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdExcellent4663",
            "body": "The gays are exempt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ConceptJunkie",
            "body": "Peak cringe.  These people are working hard to look stupid.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Read the article. The bill is a troll against conservatives and anti-abortion measures.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dismal_Survey_539",
            "body": "I have to assume we are all aware that this isn't a serious bill right? It is supposed to piss people off because they claim it shows a double standard for laws governing men's versus women's bodies. \n\n\n\nI really  hope people here aren't stupid enough to give this even a sliver of credence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NikoCorleone",
            "body": "I'm down for this if it also outlaws gay butt sex",
            "score": -1,
            "replies": []
        },
        {
            "author": "AdExcellent4663",
            "body": "The gays are exempt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guinnessron",
            "body": "So it outlaws discharging genetic material.  EVERY woman is. Ow fined for having their period.  Nice work. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Longjumping_Type_901",
            "body": "Libs have been using that to make their point time to time for at least 6 or 7 years ",
            "score": 1,
            "replies": []
        },
        {
            "author": "IceCreamIceKween",
            "body": "I once seen a pro-choicer try to make the argument that pro-lifers should be making more gay propaganda because if their goal is to truly stop abortions, then logic follows that gay relationships are the goal since they don't produce a pregnancy.\n\nThat's how lost they are.",
            "score": 0,
            "replies": []
        }
    ]
}