{
    "title": "House Republicans prepare to impeach federal judges blocking Trump, DOGE policies",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 341,
    "score": 265,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 100,
    "url": "https://justthenews.com/government/congress/house-republicans-prepare-impeach-federal-judges-blocking-trump-doge-policies",
    "id": "1iqeusw",
    "selftext": "",
    "comments": [
        {
            "author": "Snarti",
            "body": "I assume the legal reason is that their decisions don’t uphold the rule of law.  In the same manner that Alexander Mayokas ignored the law wrt immigration.\n\nIf that’s not it, then it’s a bad move.",
            "score": 59,
            "replies": [
                {
                    "author": "redcat111",
                    "body": "The district court judges are acting outside of the Constitution. They can’t tell the President/Executive how to manage the executive branch. If the President, who is the executive branch, decides to do an audit and act on the results of that audit thy have no standing to order the executive that he can’t. Impeachment of judges that are acting as in an unconstitutional manner is absolutely acceptable.",
                    "score": -23,
                    "replies": [
                        {
                            "author": "R3ditUsername",
                            "body": "The judges are there to rule on the legality of things the other branches do.  The judicial branch is an equal part of the 3 government bodies and sets rulings based on a legal interpretation of the laws passed by the legislative and executive branches.  Did the US completely lose all comprehension of the Constitution?",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "redcat111",
                                    "body": "Point out where district judges are in the constitution. You can’t because the district courts were created by congress. Point out to me, in the constitution, where district judges have the power to decide nation wide injunctions over the executive. You can’t because it doesn’t exist. These partisan hacks are about legitimate as Soviet judges during the USSR. Every single one of them should be disbarred.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "ThunorBolt",
                                            "body": "So what CAN judges do in your point of view? Because I thought it was too make sure the other two branches follow the law. \n\nThe executive branch doesn't have unlimited authority, if the judicial branch can't keep it in check, what can?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "redcat111",
                                                    "body": "They are to make sure that the executive is enforcing the laws that the legislature has passed and that the executive, which is the president, is enforcing the legal laws within the Constitution. They cannot make laws. That is the within the legislature of Congress. They have no power over the president because he is the executive branch, especially at the district level of government courts. They are not the government. The president, AKA the executive, has every right to control the executive branch.\n\nWhy is this so hard for leftists/Marxists so hard to understand?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Few_Ad_7613",
                                                            "body": "Because it doesn't fit the communist agenda.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ThunorBolt",
                                                            "body": "So I say the executive doesn't have unlimited power, and you call me a Marxist... strange times we live in. \n\nMy question was what keeps the executive branch in check. I didn't say anything about legislating from the bench. \n\nIf trump were to sign an E.O. that halted all social security payments for the sake of saving money, something that millions depend on and are entitled to, would the judicial branch not be able to put a stop to that order?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "redcat111",
                                                                    "body": "At the Supreme Court level they have some very questionable legal precedent that largely goes back to Marbury Vs Madison. BTW many founders believed that the Supreme Court was acting largely out of their power to do so. A district judge has no such authority.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ThunorBolt",
                                                                            "body": "If they have no authority someone would've challenged it by now. YOUR interpretation of the constitution says they have no authority. \n\nAlso, your interpretion invests a massive amount of power into one person that would rival any Marxist's wet dream.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "redcat111",
                                                                                    "body": "So, you’re saying that the executive doesn’t have control over the auditing of the executive branch and the coequal judicial branch has more control over the executive? That’s an absurd claim.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ThunorBolt",
                                                                                            "body": "That's not what I said. \n\nWhat I'm saying, if the executive issues an E.O. that violates the law, the judicial branch has the power to stop it.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lasheric",
                                            "body": "lol so many downvotes . It’s almost like this isn’t a republican Reddit page",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "redcat111",
                                                    "body": "😂 You may have guessed that I don’t care about my “karma.”",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Competitive_Sail_844",
                            "body": "To continue with that, the executive and legislative should go back to the law to clarify their positions and possible interpretations.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lt_Snuffles",
            "body": "left will return to power after some time; may be after 4 years, may be even 12 years. All these \"out of the norm\" precedence will be used to use against right too. Just like Obama's excessive executive orders during ACA paved the way for later presidents. That's how check and balance dies, and republic dies",
            "score": 26,
            "replies": [
                {
                    "author": "Lt_Snuffles",
                    "body": "after recent events, I have new found respect for Reagan. He had bigger mandate than any of the recent president,and he could do anything with it. However he still respected the institution. I guess you don't have to weird stuff if you have actual support.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImperialxWarlord",
            "body": "I don’t think this is a good move…",
            "score": 63,
            "replies": []
        },
        {
            "author": "SmokedRibeye",
            "body": "Why go through the effort… if the policy they are blocking is important enough… congress can codify it… I’m sure it’s easier than impeachment",
            "score": 22,
            "replies": [
                {
                    "author": "Lasheric",
                    "body": "Cause we don’t need judges like that",
                    "score": -4,
                    "replies": [
                        {
                            "author": "SmokedRibeye",
                            "body": "I agree… but it’s taking away valuable time and resources from congress which has more important things to do. It would also be more permanent to codify trumps agenda",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smile_drinkPepsi",
            "body": "The GOP wants to impeach judges for doing their job of judicial review because they didn’t like the outcome?",
            "score": 23,
            "replies": [
                {
                    "author": "None",
                    "body": "Is that a question? Welcome to 2025 Adam Weber.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "redcat111",
                    "body": "Point out where judicial review is in the Constitution. You might imply that in the Federalist Papers (78 I think) but it’s not explicitly stated in the Constitution.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "fffanguy",
                    "body": "This isn't judicial review, it's judicial activism. Regardless of what the judge in the Treasury case thinks of the legality of DOGE, he violated the separation of powers by then saying the head of the Department of the Treasury also was not allowed access to the systems needed to do the job he was legally appointed to do by the President and the Senate. This judge will be impeached, so should the rest of them. Their rulings are naked partisan stall tactics not in line with the law or the Constitution.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "gallant_hubris",
            "body": "This adds so much passion to the “this is a coup” narrative",
            "score": 56,
            "replies": [
                {
                    "author": "bigdelite",
                    "body": "The impeachment process will weed out the truth. If they have not done anything biased or wrong, they keep the job.",
                    "score": -39,
                    "replies": [
                        {
                            "author": "gallant_hubris",
                            "body": "This was not the mindset when your guy was on trial",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "bigdelite",
                                    "body": "Who is my guy? And whose mindset do you think you know? You some kinda pinko? Don’t believe in the American justice system? Got blue hair and just don’t care?",
                                    "score": -45,
                                    "replies": [
                                        {
                                            "author": "gallant_hubris",
                                            "body": "I assumed you were a Republican. I apologize.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Secure-Ad6869",
                                                    "body": "Assuming makes an ass out of you and me",
                                                    "score": -9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lasheric",
                    "body": "Who the hell cares what they say about us? They will say whatever they want and lie whenever they want. Rather just bulldoze through all of it and keep implementing the agenda",
                    "score": -4,
                    "replies": [
                        {
                            "author": "gallant_hubris",
                            "body": "Nobody says whatever they want and lies near as much as the Republican Party of the last decade.  They get the all time winner trophy for that.  It’s not even close to debatable.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Lasheric",
                                    "body": "Nah, that’s debatable",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 31,
            "replies": [
                {
                    "author": "ddx-me",
                    "body": "Checks and balances to prevent one branch from gaining too much power. That's been the story for almost 250 years",
                    "score": 53,
                    "replies": [
                        {
                            "author": "nmj95123",
                            "body": "IOW, what the judges are doing?",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "ddx-me",
                                    "body": "Doing the same that is blocking the extremes of power, as it with Biden and Trump",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "nmj95123",
                                            "body": "So, they're doing their job?",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "author": "ddx-me",
                                                    "body": "Yes they are doing their job of stopping overreach and keep a functional government, just like with student loans",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "nmj95123",
                                                            "body": "So... You agree that they're doing their job?",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "ddx-me",
                                                                    "body": "Yes they are. If Dems were doing all of what's Trump's doing with executive orders a year ago, you'd be seeing  forgiven student loans and cutting jobs at the border already",
                                                                    "score": 11,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 23,
                    "replies": [
                        {
                            "author": "nmj95123",
                            "body": "Yes, that would be why executive actions are being reviewed by the judiciary.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "swanspank",
                                    "body": "And why the judiciary is being checked by the legislative branch. Balance of powers thingy.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "nmj95123",
                                            "body": "What impeachable offense has been committed? Disagreeing with other branches is kind of the point ",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "swanspank",
                                                    "body": "Didn’t say any were. But hey anyone can make shit up. Every other day Democrats are screaming about impeachment of President Trump. So let’s see what I can make up about the judge. \n\nHow about abuse of judicial authority because of political bias stopping execution of executive orders. \n\nThere you go. Does not mean it’s true but with votes in the House of Representatives, which Republicans control, you got yourself a little impeachable offense against a judge. \n\nNow you can argue all you want about that being wrong of not grounds but the House gets to set the rules and NOBODY can stop them. NOBODY.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MikeyPh",
                    "body": "You do if they are ruling based on politics and not the law.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Tater72",
                    "body": "Depends on if they are trying to set policy or rule on the law.   Some of these judgments are based on setting policy.  That isn’t their role. \n\nThe president (no matter which side they come from) shouldn’t share their authority with 300 judges.  I’m not saying they can’t be questioned on if they are following the law, what I’m saying is that’s all the judges do is confirm it’s legal according to the law on the books.  No more no less",
                    "score": 4,
                    "replies": [
                        {
                            "author": "nmj95123",
                            "body": "What rulings have not followed the law?b the proper remedy to that, by the way, is an appeal, not impeachment.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Tater72",
                                    "body": "Appeal the ruling but if a judge themselves are not following the rules, it is an impeachment \n\nWhy would it not be?  Setting policy or being an activist from the bench is a violation of their oath.  This is what we’ve seen over the recent years.  It BULLSHIT!!  Judges should be impartial and only rule on laws.   It’s what their role is, NOT MORE!!  We need to NOT be using the judicial branch to set policy or attack people through lawfare, it undermines the entire judicial system",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "nmj95123",
                            "body": "How have they strayed outside of their lane? Reviewing the legality of actions is kinda their purpose.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "nmj95123",
                                            "body": "Why do you think the judiciary has injunctions?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "nmj95123",
                                                            "body": "So you have no idea what courts do? Cool.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "nmj95123",
                                                                            "body": "Which decisions were activist decisions and why?",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Jolly_Job_9852",
                                                            "body": "My Republican bro, have you read this Supreme Court case?\n\nhttps://en.m.wikipedia.org/wiki/Marbury_v._Madison",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jolly_Job_9852",
                                                                            "body": "Executive Orders have the same force of law.\n\nhttps://constitutioncenter.org/blog/executive-orders-101-what-are-they-and-how-do-presidents-use-them",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Morgue724",
                                            "body": "Funny I didn't hear you saying they should punish biden when they ruled he couldn't forgive student loans and tried to several more times.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Difficult_Fondant580",
            "body": "I’m not in favor of impeaching unless committing a high crime or misdemeanor.  Republicans don’t use impeachment powers when they don’t like something, like the Dems.",
            "score": 23,
            "replies": [
                {
                    "author": "gallant_hubris",
                    "body": "Or… do they?  \n\nI agree with your sentiment.  But this guy kinda seems to just do what he wants\n\nEdit typo",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "katielisbeth",
            "body": "Can you guys flair yourselves when you comment? It's hard to tell who's who on this post.",
            "score": 4,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "Forgive me. Is your flair ironic or are you actually a liberal providing commentary?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "katielisbeth",
                            "body": "I'm actually a liberal lol, I usually don't comment but saw this post had clearly been brigaded. I'm just subbed to stay open to different perspectives.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Jolly_Job_9852",
                                    "body": "I see. I has never seen the flair used before. Thanks for the conversation.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "fffanguy",
                                    "body": "For what it's worth, these two statements make you a cut above most liberals.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "*Some* Republicans are **not** psychotic Conservatives. Our Party was completely overrun and co-opted. Just because someone doesn't agree with your take does not mean they aren't a Republican.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "katielisbeth",
                            "body": "I never said that lol. I just saw that this post had clearly been brigaded and I'm not a Republican, so I wanted to know what the discussions were between the actual members of the sub.\n\nDespite our respective biased news sources, I'm aware that not every Republican/red voter agrees with Trump and Elon's actions (and not every Dem/blue voter thinks all Republicans are nazis). We love our two party system.\n\nIt *is* interesting to me that you say your party was overrun. That's the kind of discussion I came here to read, but I can't do that if we're brigading y'all and not flairing up.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RustyPaw7325",
            "body": "Yep, we are no longer a democracy. America, 1776-2025---👼",
            "score": 13,
            "replies": [
                {
                    "author": "TomsServoo",
                    "body": "Can you point to DOGE in the constitution? There is no law or constitutional issue for them to vote on they have no standing and are just trying to impede things for the sake of their democrat masters. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "8K12",
                    "body": "Enjoy Wisteria Lane",
                    "score": -9,
                    "replies": []
                }
            ]
        },
        {
            "author": "TomsServoo",
            "body": "Funny how nobody had an issue when Biden ignored the SJC. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal-Top-958",
            "body": "I wouldn’t even consider our president to be a republican atp, it’s more like a cult",
            "score": 1,
            "replies": []
        },
        {
            "author": "octyv2",
            "body": "Welp.. if they are in the way of finding out where my tax dollars are going and they want to die on that hill then let us move along with it. They can always step aside but that might hurt their pocket books.. The judiciary system in this country is just as corrupt as the far right and the far left..",
            "score": -3,
            "replies": []
        },
        {
            "author": "DaRiddler70",
            "body": "Mostly what the judges are doing is passing temporary restraining orders until a \"formal legal opinion is ruled\". It's an abuse of power, especially if you know what is happening is actually LEGAL.\n\nIf their sole job right now is to delay anything the current administration is doing....that's not being a legitimate judge, and they need removed.",
            "score": -7,
            "replies": [
                {
                    "author": "R3ditUsername",
                    "body": "Yeah, that's how it works.  Much like the injunction against the ATF's pistol brace ban while they determine the legality of it.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DaRiddler70",
                            "body": "No doubt there are many instances where it is needed. That was my point.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CoinDexter101",
            "body": "Heads will roll! \nKeep up the good work, DJT and EM.\nWooHoo!! WOOHOO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaggz691",
            "body": "I mean I can understand where they are coming from this is why it takes so long to get anything passed. Everyone has an opinion on it. The democrats in congress are mad Trump is signing so many executive orders so they have the closest viewpoint Supreme Court judge knock it down. It’s just a game of tag that will never end. Don’t get me wrong we 100% need this as to ensure we don’t move towards one way more than the other. Sometimes it is tiring to hear about it considering he is just doing what he said he’d do. A president that keeps the majority of his promises thus far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GGHades",
            "body": "Good. They are activists and nothing more. They don't want fraud and corruption investigated? For what reason?",
            "score": -2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Trump announced his intention to be a Dictator on Day 1. If you voted for Trump, and any Republican for any office, you have voted to end democracy. If that wasn't what you were hoping for, I am sorry, but that is what you will get. You can down vote this comment, but it wont change reality. It wont change what we signed up for. On behalf of the entire country, Thank You.",
            "score": -2,
            "replies": []
        },
        {
            "author": "DryTangerine3379",
            "body": "Good",
            "score": -8,
            "replies": []
        }
    ]
}