{
    "title": "Clarification on what Anti-Republican means - Also just some tips on being decent.",
    "author": "MikeyPh",
    "subreddit": "Republican",
    "rank": 338,
    "score": 22,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/Republican/comments/1iqtdzo/clarification_on_what_antirepublican_means_also/",
    "id": "1iqtdzo",
    "selftext": "EDIT: Based on an heavily brigaded post that gained a record number of comments for our sub in just a few hours and some of the comments I saw there from people claiming they are Republicans (the brigade was largely from Europeans, Canadians, and the left though), I feel I need to put this back up. END EDIT.\n\nI covered leftist talking points in the last announcements (and I'll take that down once it seems the leftists, trolls, and bots have abated for the time being), but I wanted to discuss what it means to break our anti-Republican rule, along with our Reagan's 11th Commandment rule... because they are basically the same rule.\n\nI'm going to go through some common complaints we get from banned users and how to avoid being banned like those users.\n\n-**I was just stating a fact. What, FACTS aren't allowed anymore??**\n\nFacts are allowed. They have always been allowed and even encouraged. But if your fact is laced with commentary, then it is not longer \"just a fact\". Here are some examples.\n\n* **Fact**: The sky is blue.\n\n* **What gets you banned**: The sky is blue, you fucking fascist.\n\nTake note, because many do not notice the subtle difference between these two comments. Many who write something similar to the second comment will frequently in modmail say \"I was just stating a fact!\" This is so common, it's not funny.\n\nHere's another one:\n\n* **Fact**: Musk and Trump are uncovering a lot of fraud. While mistakes are being made, they are also being corrected, and Musk only has the power to report findings, not make final decisions.\n\n* **What will get you banned**: Musk and Trump, man... these guys are running amok. I'm deeply concerned about how Musk is just firing people.\n\nDo you see the difference? One is a fact, one is commentary and kind of half fact and half untruth. Many users do not see the difference. Be a user who does.\n\n-**Just because I don't suck Trump's dick means I'm anti-Republican! I have been registered Republican for [X number of] years!**\n\nThis is one we get a lot. You must understand that we are a large umbrella. There are MAGA Republicans. There are Trump supporters who love Trump for this time in history but want to see leadership arise that is a bit more conventional as a leader and a bit easier for moderates to swallow. There are Republicans who absolutely hate the current president and the direction of the party.\n\nWe don't care what category you fall under. What we care about is that you show deference to fellow party members.\n\nIf you don't like the memes of Trump, fine, but don't trash people who do. And if you think it makes us look bad, I would just point out that the left has called us racists and bigots for literally decades and we took it in stride. They memed us in the media constantly before memes were even a thing.The character assassination attempts they did to Trump, they also did to Romney, to McCain, to Bush Jr., to Bush Sr., they accused Clarence Thomas of rape just like Kavanaugh. This is the left's M.O. and it has been for longer than I've been alive, arguably since before the Civil War.\n\nYou don't have to like the memes President Trump posts or that we on the right are making and posting. I don't particularly like them myself. But to trash fellow Republicans for it, without giving any understanding to the fact that the left have memed us and called us racists and bigots for decades, is disrespectful to your fellow Republicans.\n\nYou can argue it makes us look bad. But do so with respect.\n\n* **What's acceptable**: I don't like this meme and doesn't think it helps our cause, but I can see why people find it funny and find it to be a valid answer to what the left has done to us for decades.\n\n* **What's not acceptable**: The MAGA's who suck Trump's dick love this shit, but it makes us look bad.\n\n*I would say to all the users who worry about looking bad to the left*: I know you care about looking bad to the left, but how about looking bad to your fellow party? Comments like the one just above make YOU look bad to ME and many of your fellow Republicans.\n\nShow respect.\n\n-**[Insert Prominent Republican's Name] is a piece of shit! He's a traitor to the party!**\n\nI am a Christian first, a member of my family second, an American third, and a Republican lower on the list. I hope all of your have a similar hierarchy. Political parties are not the be-all and end-all. \n\nPolitical parties are tools to pool votes in a coalition to create a platform that a large number of people with many varying views can get behind and vote for in the face of another party that is doing the same with views we largely disagree with. They have value in the situations, but I kind of hate that they exist.\n\nThat said, being a sub FOR the party (although we are not affiliated with the GOP in any official capacity, we are just fellow Republicans), we do need to show deference to the party, we need to respect the party, we need to respect the umbrella, and we need to respect the individuals in the party.\n\nI am not a fan of Romney but I respect that he is a Republican. So if I criticize him, I might have a little fun, but I won't just trash him. **Keep in mind, would you rather the left win, or have a [insert Republican you don't like]?** In my case, I'd rather have a Romney than an Obama.\n\n* **What is acceptable**: Romney doesn't feel all that Republican to me these days and I really don't like how he keeps breaking from Republicans on so many issues, to the point I'd call him a RINO. But he's a strong business man and I'd take him over Obama any day.\n\n* **What is not**: Fuck that loser Romney. He's a RINO piece of shit. I don't trust him.\n\nDo you see the difference? One way criticizes while showing solidarity with the party, the other way is making it difficult to have any solidarity because it's so disrespectful.\n\nWe need solidarity. That does not mean we accept \"traitors\" if indeed we have any, but that does mean that we do not treat our fellow Republicans like crap. We don't throw them to the wolves unless it is clear we must. We don't cast them aside unless the allegations against them are credible. If they are indeed a RINO, show the receipts, but be respectful.\n\nMatt Gaetz is a prime example. The right thing to do was to cut ties with him, but not before allegations were credible enough (especially knowing the left has made so many false accusations before). And also it should be done with the understanding that a lot of senators and congressman of all parties have likely been in a similar situation but just haven't been caught. He shouldn't have done what he seems to have done and it's inexcusable, but it also seems like a political targeting. Both of those things can be true at the same time.\n\nWe don't jump down a Republican's throat at the first accusation of impropriety, we let the facts come out and then deal with it appropriately. Getting hysterical about it from the first moment would lead to us not having Clarence Thomas or Brett Kavanaugh on the bench. We wouldn't have Trump. And think about how many it worked on. It worked on Romney, it worked on Bork (look him up), it worked on so many others. This is the left's MO. They tried to get rid of Hegseth because of a tattoo and baby clothes. Don't buy their hysterics, let the facts come out.\n\nI hope this clears things up.",
    "comments": [
        {
            "author": "odieman1231",
            "body": "How strict is the \\*\"Facts are allowed. They have always been allowed and even encouraged. But if your fact is laced with commentary, then it is not longer \"just a fact\". Here are some examples.\"\\*\n\nI ask because a ton of articles get posted in here with absolutely no work to double check if the article is laced with pro-agenda pushing narrative and a lack of actual accurate facts. Article gets posted. A bunch of \"hell yeahs\" in the comments supporting it. Someone comes in with actual numbers and data with sources and then it devolves into \"oh look, a covert Lefty trying to make us question our loyalty\".",
            "score": 25,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "> I ask because a ton of articles get posted in here with absolutely no work to double check if the article is laced with pro-agenda pushing narrative and a lack of actual accurate facts. \n\nKeep in mind how reddit works. I do not have the time nor the power to view every single article that comes into our sub. We work to restrict some sites that have proven to be quite dishonest with their \"facts\", but even good sites can be wrong, and even bad sites can be useful to talk about.\n\nThe way this is supposed to work is that an article is posted and we READ the article, we fact check the article rather than rely on fact checkers for us, and then we discuss the article: its veracity, perhaps its omissions, perhaps the bias and so on. Then in discussion we correct the errors or maybe point to better articles. That is how we get to a deeper conclusion. And that largely happens here when we are diligent as users.\n\nIf you want all articles that suck to be banned, we don't have that power (nor time) and I don't want that power. If you want every article to be perfect and without any flaws, then I don't know what reality you are living in.\n\nThe 4th estate only works well if the people who are consuming the media the 4th estate produces actually analyzes and critiques their media rather than just accepting it or rejecting it..\n\nSo in short, YOU have responsibility in all this as well. We try to remove objectively bad articles because of their dishonesty, and we try to leave articles we may not like but tell the truth. But the quality of the discourse is heavily reliant on the people doing the discourse. \n\nSo you should explain why and article is bad or good or somewhere in between. You should actually read the article and not just the title. You should see if you can find a better article if the one posted is terrible or dishonest.\n\nThat is how this works, that is how to be an informed citizen and not just someone that is fed what the media wants to feed you. If you just want to be fed, then why even discuss anything? We have a huge problem with that in the world today and it is hard to not just want to be fed (myself included).\n\nEDIT: typos and altered to not sound quite so defensive.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "odieman1231",
                            "body": "Thanks for the clarification.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "No problem. Sorry if I came off defensive. I initially read your comment as a bit more of an attack than it appears (because we get that all the time).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "odieman1231",
                                            "body": "It’s ok. I think everyone has been on “defense mode” lately.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "atomic1fire",
            "body": "Yeah I don't really see a problem with this.\n\nToo much of the internet is obsessed with the immediacy of saying something and never considerate of how they say it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "browncharlie1922",
            "body": "Thank you.\n\nLet's not let our sub descend into the vulgar echo chamber that is all of the other reddit subs the delve into politics.",
            "score": 6,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "They will still call us an echo chamber. And I would argue over and over again that we cannot be an echo chamber because we literally cannot escape the left's clear domination over reddit. In order to live in an echo chamber on reddit, a Republican would have to not be subbed to anything but maybe this sub, r/conservatives, r/conservative (though they have the resources and big enough mod team to allow a bit more debating than we can).\n\nAlso, it is okay to have place where it is just us conversing. That is not a safe space unless an individual using it never hears other points of views. There have always been clubs where likeminded individuals can come, but others cannot. And there is nothing wrong with that. It is always incumbent on the members of such clubs to make sure they are informed as individuals. I cannot force our users to be informed on alternative points of view, even if I sticky them, they can ignore them. But we are not here to inform our users of every idea out there, we are here to inform them of the day's events and to allow them to discuss them.\n\nThis safe space talk that I hear from the left because of our sub is so superficially applied and it is yet another sign that the discourse is in trouble.\n\nBtw, the founder of this sub originally wanted it to be a place where people could talk and debate, but the left couldn't handle that, and so we made it a sub for us.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "browncharlie1922",
                            "body": "But at least we're an honest one. The hypocritical cant of other subs professing to be unbiased while harassing, bullying and banning conservatives will-nilly is appallingly hilarious.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "Yeah, this reminds me of how people want the media to be. So many want the media to be unbiased, yet they know that is impossible. You can have more middle of the road, just telling the facts media, but you can never trust that they are completely unbiased and you should still fact check them. I think better informed people look at biased media on both sides and more moderate media.\n\nBut you still have these people that cling to the idea of unbiased media and think they can make it happen. No. Just be balanced in your media consumption. You'll be better informed anyway.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "giff_liberty_pls",
                            "body": "I think this is the least echo chamber Republican-related subreddit I've seen so far.\n\nI've traditionally been a Republican leaning person, but I tend to disagree with how the current administration runs things. I feel like this is the only place I can have Republican concerns about the Republican party with other Republicans. Quoting Reagan on a left leaning subreddit just doesn't hit the same. It's a fine line and I appreciate the tough job you have to keep it that way!",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "Thank you!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kaisernx",
            "body": "A quick shout out to the mods as this is overall thankless work and must not be easy.  There has been an increasing amount of toxic posts, and I know some of these reviews must be manual and not picked up by automod.  \n\nI personally am not a fan of memes and in general low quality posts (yes, the internet is rough for me lol), and one of the things that would be great and may cut down on some of these issues as well is stricter posting guidelines.  It shouldn't be surprising that posts meant to incite emotions do just that.  Because the internet makes posts tone deaf - I'm not criticizing, but offering a suggestion while also sharing my preference.",
            "score": 5,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "I agree - the memes really bug me. On a related note, I even dislike content that dehumanizes others. Even language like 'libtard\", \"magats\", etc. Definitely worrying to me when we are using this kind of language to describe fellow Americans, as it implies people who are different lack humanity. And IMO it justifies apathy and paves the road to violence.\n\nAt the same time, I can see how some of this content inspires discourse. But I wish there was a way to inspire discourse in a manner that was more dignifying. That's just me though.\n\nTo embody my own values in this subreddit, I share articles from sources I consider reputable. And then I'll share particular quotes to try to kickstart a discussion. I would encourage other folks to do the same. The more of us that do this, the easier it will be to have a productive discussion and really understand the broad range of perspectives within this subreddit.\n\nIt sort of goes both ways. Maybe some folks want opinion pieces, and others dislike it. But I'm sure there are some folks that want quality pieces. For those folks, we should try to share those pieces and kick off the kind of discussions we want to see. I like to think it will help in the long run, because it will increase the odds that members of this subreddit will see a broader range of news sources, not just the op-eds.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "AzureWra1th",
                    "body": "https://preview.redd.it/xat591dx7jje1.jpeg?width=1126&format=pjpg&auto=webp&s=b1cfe888ec63741aa50f38d1a97653c5092898a9\n\nEither way, it’s an issue we should fix.\n\nI don’t think tariffs is necessarily the way, and of course, we also have a lot of drugs (and weapons) going from the USA going into Canada. After reading a lot of people’s responses, viewpoints, and articles I have come to the conclusion that I don’t support the tariffs on our northern border neighbor. I think there are better ways to go about it, how exactly, I don’t know. (I support the tariffs elsewhere though, and I’m not necessarily against the tariffs against Canada, I just don’t think they are the best solution)\n\n[https://www.cbp.gov/newsroom/stats/drug-seizure-statistics](https://www.cbp.gov/newsroom/stats/drug-seizure-statistics)\n\nEDIT: Idk if the image I sent actually uploaded lol, but the link should bring you there if you configure it to \\[Northern border\\] and select the 2024 and 2025 years\n\nEDIT 2: That’s not to say I’m super against the tariffs. I just don’t think they are the best solution to the problem. By only looking at the drug seizure statistics, and comparing that which comes from the US to Canada, yes, that wouldn’t be a particularly fair reason to impose tariffs, but there are more reasons as to why they did. So once again, I don’t support the Canadian tariffs, but I’m not completely against them.\n\nThese issues include lack of militarization and uncontrolled immigration, especially when we don’t have very good border security at the north.\n\nMy original comment may have made it seem like I’m against the tariffs; that’s not partially true. I just don’t think the are the best solution (they are better than nothing though). The reality is Canada needs to be held somewhat accountable for these issues among others, some way or another, especially when they haven’t shown any real interest in fixing them. So how do we hold them accountable?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": "That user doesn't care. They are a troll. Their history shows it. They took the \"we accept facts\" and trolled by posting a fact that promoted their opinion without stating their opinion. It also had nothing to do with the post. The troll is intending to derail the conversation. This behavior should always be a red flag for users.\n\nAgain, this user is trying to derail our conversation with a non-sequitur and a technically \"rule following\" comment. It works very very well. Two users responded to him in a reasonable manner, when the truth is this user is trying to stick it to you and is not here in good faith at all.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AzureWra1th",
                                    "body": "I meant from a drug standpoint. There are other reasons to support the northern border tariffs. Not that I think tariffs are particularly the best solution BUT I do believe that there could be better solutions.\n\nCanada has an overeliance on the security provided by the USA having a strong military. They also haven’t shown an interest in militarizing, which is particularly an issue due to the ice caps melting. They don’t hold the military strength to secure any trade routes, especially with Russia and China as primary contenders there. They also don’t want to become a US state, and haven’t shown any intent to accommodate US military operations further north.\n\nSo in the end, i stand by my saying that I don’t support the tariffs on Canada, but I also think it is a better solution than just doing nothing. I do think there could be better solutions, but the question would be whether Canada would be open to such things.\n\n\nAlso awesome job with the post, it’s really well constructed",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "R3ditUsername",
                    "body": "Your point illustrates something very important to me, and I'm glad you posted this.  This is why it's important to make decisions based on information and not take everything at face value.\n\nI tend to lean conservative on most points.  I just don't like the meme-like behavior that is coming from the current party because of details like this.  At face value, one would believe that fentanyl from Canada is a huge problem, and we need to strong-arm them.  In reality, Canada should be strong-arming us to stop it (if the expectation is tarrif threats).  I don't think the current method of negotiating with the world is the best way to ensure American dominance because it is going to push them away.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": "Just a heads up, the user you responded to is a troll. The non-sequitur quality of their comment is intended to take one thing I said (that we accept facts) and isolate that little bit out of the entirety of what was said so that they can troll by posting a fact that promotes their belief that Republicans are fascists (without saying it directly... though they implied it much more heavily in other comments). \n\nThis is a common tactic of trolls. It's also a suspicious account, likely a ban evader. I like that you responded in a reasoned way, but it's best to just report and move on.\n\nEDIT: by the way, we often remove comments of banned users (though we'd generally and philosophically like them to stay) because users will often revise their comments after being banned as a final gotcha or to appear like they didn't break the rules.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "R3ditUsername",
                                    "body": "Thanks for the heads up.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "squirrelfoot",
            "body": "This all sounds very reasonable. Thank you for your work on this. It's not easy to moderate discussions when people get really passionate about issues dear to their hearts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aweknowing",
            "body": "I just like commenting on the mental illness that's rampant on the far left.\n\n*Supporting fact* The inability to look in the mirror and see a penis and still not know you're a male. 😂",
            "score": 1,
            "replies": [
                {
                    "author": "JekyllAndJinn",
                    "body": "This very comment appears to completely miss the message OP was trying to convey. Unconstructive and inflammatory commentary does not benefit the conversation.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnooFloofs1778",
            "body": "I would maybe require user flair to comment. Then the trolls at least have to be sturdy enough to make a choice.",
            "score": 0,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "If we could edit our flairs I'd be okay with that suggestion",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AccordingStop5897",
            "body": "Not to be that guy, but the sky is actually bluish purple, even more purple than blue. However, we can't see the purple due to the blue light being dominant in our vision.",
            "score": -1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Lol fair enough. But I would argue that it is also just blue. Snow is also not actually white, it just appears white. This is one of the reasons why I get annoyed with science, not because it doesn't give us great insight, but because it inadvertently (or sometimes the people in science do this on purpose) they assert a new reality when the older reality is true as well. In other words, it is true to say \"snow is white\" because it is . That doesn't mean that statement is false in another context. Snow is not white when you look at it through a microscope. Snow is also not white when you look at how light refracts and reflects through it and you consider that white light is actually all colors of light.\n\nAll of those things are true, but snow is also white. \n\nWhat you said is true, but the sky is also just blue. How it appears is not invalid. It is still factual. Science uses the appearance of things to help determine deeper truths, the appearance of something doesn't stop being true when you look deeper.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "AccordingStop5897",
                            "body": "Lol, yeah, I just couldn't resist. Thanks for the great job you guys do.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tomcat91709",
            "body": "Hey, Mods?\n\nThanks for this post!\n\nThis is the way...",
            "score": -1,
            "replies": []
        },
        {
            "author": "-Erase",
            "body": "This is a fantastic article and I loved everything in it. Great job mods!",
            "score": -3,
            "replies": []
        },
        {
            "author": "Worried_Character_97",
            "body": "So r u pro republican or anti-republican? Because Sky is blue, you fucking fascist only comes from Democrats. And I can bet, they won't get banned for saying that",
            "score": -8,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "I'm not sure what you're asking here. \n\nThat example was just a point about facts and respect.",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}