{
    "title": "Elon Musk doesn’t work for DOGE - What is the Play here?",
    "author": "Dismal_Survey_539",
    "subreddit": "Republican",
    "rank": 281,
    "score": 2,
    "upvote_ratio": 0.52,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.theverge.com/news/614253/elon-musk-not-doge-leader-presidential-advisor",
    "id": "1ishn2e",
    "selftext": "",
    "comments": [
        {
            "author": "ninjay209",
            "body": "Its obviously to distance himself from DOGE because there is a conflict of interest where he could be investigating departments that are also giving his companies multi million dollar orders. It's more than our damn congress or senate members do when they are directly making laws impacting the stocks they own.",
            "score": 13,
            "replies": [
                {
                    "author": "None",
                    "body": "They should be disbarred from owning stocks once they become servants of the public. They serve at our pleasure not the other way around. Should be made to divest and purge their portfolios due to any misconstrued conflict of interest or collusion.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Dismal_Survey_539",
                    "body": "So was he in charge before and now he is not? Thats what im trying to understand, was he never in charge and all the comments from congressmen, Trump and vance were just wrong?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "noodlesallaround",
                            "body": "They probably figured out the stuff he might be doing is illegal (as a non elected official, no security clearance, conflict of interest  etc… ) and are covering their butts.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "scubasky",
                                    "body": "He has had a security clearance for years.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "noodlesallaround",
                                            "body": "Different kinds. Also his staff..",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stansvan",
                    "body": "My prediction is that there is already plenty of evidence to show Elon was in charge, it was a conflict, and there will be lawsuits.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "alrightbudgoodluck",
            "body": "There isn’t a “play.”  There is just an extremely intelligent man who wants to solve problems. Ulterior motives defined the Biden presidency. That’s over now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ApathyofUSA",
            "body": "Ah yes. Left leaning Verge is making \"republicans\" converse like it's a legitimate source.\n\nY'all are bunch of bots",
            "score": 2,
            "replies": [
                {
                    "author": "Dismal_Survey_539",
                    "body": "This has nothing to do with the article and everything to do with the white house statement, this was just the first article I found that had the PDF... Here is a Breitbart article came out 7 hours later than the one I linked [White House says Elon Musk is Trump's adviser and not the DOGE administrator - Breitbart](https://www.breitbart.com/news/white-house-says-elon-musk-is-trumps-adviser-and-not-the-doge-administrator/). Believe it or not, some sources are better than others when it comes to publishing the source documents.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LoveDaLordYourGod",
            "body": "The play is to take the savings and get humans to Mars ASAP. The left has destroyed this world and will continue to do so. We have a window right now where we can save some humans by getting them to Mars. We need to let him do whatever it takes to get us there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Banjofencer",
            "body": "I really don't care who he works for as long as he keep the dumbocrats house of cards tumbling down.",
            "score": -3,
            "replies": [
                {
                    "author": "mikemeyers-90210",
                    "body": "Not sure if Musk is faithful to the MAGA movement. Sometimes feels like he is playing and pretending for his own profit. Can’t put my finger in it though",
                    "score": 2,
                    "replies": [
                        {
                            "author": "et_hornet",
                            "body": "He definitely is doing it for his own benefit. He, and a lot of the other big billionaires, are only allying with Trump in return for lax regulations. They did the same with Joe.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "One-Pudding9667",
                                    "body": "Musk supported Trump at great risk long before it looked like he had a chance of winning.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Dismal_Survey_539",
                                            "body": "Thats because the Biden admin froze him out, he had nowhere else to turn and was staring down several investigations into his companies in the event trump didnt clear out the DOJ",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BWSmally",
                    "body": "Despite what they're saying on The View, Musk is doing more for the country than DOGE is doing for him.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "futuristicplatapus",
            "body": "He’s always been a show. His social presence is high and gets high visibility from people but news outlets. He’s just a man with a megaphone. He’s definitely bringing people’s attention to what’s going on so his purpose is working .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jolly_Job_9852",
            "body": "A senior advisor to the President should really be advising him or her on domestic or foreign policy. While cutting government waste can count as domestic policy, making the cuts themselves isn't a good look if they hold the title of advisor. \n\nI have heard that President Obama created a position similar to DOGE to cut waste, so if that still exists then Trump could appoint Musk there and if it requires Congressional approval then that should be a top priority after the confirmation of the rest of the cabinet",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": "No he didn't. Several presidents have said they will cut waste. Clinton and Trump have been the only ones to actually do it.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "FireX81",
                            "body": "How was it tweaked?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RadiantWarden",
                                    "body": "That's more an insider question and I am not aware of what was done.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Dismal_Survey_539",
                                            "body": "So how do you know thats even true?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unable_Ideal_3842",
            "body": "Guessing it's for legal reasons. Conflict of interest, or protection from lawsuits. \n\nI have no doubt that he is the man behind the curtain still.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RogerAzarian",
            "body": "He doesn't. He works for the President. He has no authority other than carrying out direction from the President.",
            "score": -3,
            "replies": [
                {
                    "author": "Mal_Pal123",
                    "body": "If the President is the government and Musk works for the President than doesn't Musk work for the government?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShadowsGlow",
            "body": "It is to insulate Elon—he is over his skis. He is messing with the military-industrial complex now. These boys don’t play-should be interesting. Musk has numerous conflicts of interest and has acted outside the law. Trump,is now saying he is not part of DOGE. HE IS VAGUE—is he an employee? Is he acting on his own behalf and trespassing? Under what authority has he violated the law-violated HIPPA laws and privacy laws? Each actor in DOGE-to include the young men-need to be sued in civil court. Serve them now-call them out-expose each and every one of them. Make them famous-Trump can’t dismiss civil claims!",
            "score": -4,
            "replies": [
                {
                    "author": "Dismal_Survey_539",
                    "body": "I always thought once the DoD was explored that would be the end of DOGE.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ShadowsGlow",
                    "body": "To have STANDING—just find some people whose privacy rights have been violated.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShadowsGlow",
            "body": "They don’t want to vet him-they only have so long as a temporary employee. He has violated privacy rights of millions of people. Each and every person who did so, should be sued-in civil ct-Trump can’t dismiss that. Depose them, sue them and stop them from plundering. It will force them to declare their authority-in court-under oath. Then u can impose rules of conduct.",
            "score": -2,
            "replies": []
        }
    ]
}