{
    "title": "Far-Left Rep. Eric Swalwell Accuses Trump of Causing More Plane Crashes in First Month Than Any Other President in U.S. History",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 246,
    "score": 31,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 23,
    "url": "https://conservativeroof.com/far-left-rep-eric-swalwell-accuses-trump-of-causing-more-plane-crashes-in-first-month-than-any-other-president-in-u-s-history/",
    "id": "1isjdka",
    "selftext": "",
    "comments": [
        {
            "author": "Lifeisagreatteacher",
            "body": "Swalwell is not a serious person. Nothing he ever says can be taken except untrue political rhetoric, just like Trump is a Russian Agent. Preposterous.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ABlackEye",
            "body": "This is the guy who is the Chinese spy’s bitch right?",
            "score": 8,
            "replies": []
        },
        {
            "author": "BF2468",
            "body": "Hahahaha what an idiot….. only the libs can be this stupid!!!",
            "score": 3,
            "replies": [
                {
                    "author": "JimKkkrow",
                    "body": "Amen brother!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "EliteFactor",
            "body": "Says the man sleeping with the enemy.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Lopsided_Vacation_29",
            "body": "Douche",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordZombie14",
            "body": "This guy is a Special kind of Stupid.",
            "score": 0,
            "replies": []
        },
        {
            "author": "TheShayger",
            "body": "Don’t you know? Trump is purposefully crashing planes now. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoishaSchwarzter",
            "body": "Get him out",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogerAzarian",
            "body": "And don't get us started on how many puppies and kittens are being burned alive in sacrifice and jubilation!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "LompocianLady",
            "body": "Just laying off FHA \"support staff\" causes no harm, and sending out the \"resign immediately or your job might be cut\" to all FHA employees had no effect on our flight controller staff. They must have realized, prior to getting asked to quit, that it was going to happen, so there is no excuse for losing attention at work. \n\nStress is no excuse for doing a bad job at work! And, quite obviously, the danger of working distracted in this job can mean people die! \n\nSwalwell must be wrong. These crashes must just be flukes. If we can go without any more crashes for a year, that would go a long way to show how WRONG Swalwell is, correct? Just wait and see!",
            "score": -4,
            "replies": []
        }
    ]
}