{
    "title": "Its going down",
    "author": "Far_Lawfulness5744",
    "subreddit": "Republican",
    "rank": 280,
    "score": 0,
    "upvote_ratio": 0.38,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/law/s/aotVjbPvAE",
    "id": "1isxlc3",
    "selftext": "",
    "comments": [
        {
            "author": "Celebril63",
            "body": "Those agencies are *already* under control of the Executive Branch.  Both Congress and SCOTUS have the constitutional checks unimpeded.  The bureaucracy is answerable to the president, not the other way around.  Nor are they a 4th branch of government.  Trump is asserting the president’s right to exert authority over the branch for which the constitution vests him with authority.  \n\nThis isn’t a coup.  It is the first steps of *undoing* a coup by unelected bureaucrats.",
            "score": 26,
            "replies": [
                {
                    "author": "strykersfamilyre",
                    "body": "Democrats constantly forget the Constitution.\n\nArticle II, Section 1 – \"The executive Power shall be vested in a President of the United States of America.\"\n\nArticle II, Section 3 – \"He shall take Care that the Laws be faithfully executed.\"",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Celebril63",
                            "body": "And that is exactly what i was thinking.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "strykersfamilyre",
                                    "body": "Time to spread the word, then! I don't get the meltdown....",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Shodan30",
                                            "body": "Since when do liberals need a valid reason to cry?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "strykersfamilyre",
                                                    "body": "Also a fair point",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "John_E_Vegas",
                    "body": "Eh...I don't disagree for the most part, but technically on some of the agencies the president merely APPOINTS the officials, and has no other direct oversight. I'm not saying it's a good thing, but they are supposed to be technically INDEPENDENT agencies capable of acting without direction intervention by a president.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Alarming-Upstairs963",
                            "body": "INDEPENDENT = unaccountable \n\nNot anymore 💪",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WildeBeastee",
                                    "body": "No, independent means accountability. Direct reporting removes checks and balances even if it's a trump order.\n\nInternal audit groups and separate functions at agencies and corporations are there to prevent fraud. Trump just took all the credibility away from our federal agencies foreign and domestic. More so than they were before, unless he implements a new system to restore confidence.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Alarming-Upstairs963",
                                            "body": "There’s nothing in the constitution about unelected bureaucrats being a check on the presidency. \n\nMost of these agencies were created through EO \n\nIf they can make it with EO it can be dismantled through EO \n\nThere’s over 400govt agencies that’s nuts",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "WildeBeastee",
                                                    "body": "Agreed, nothing about that in the constitution.\n\nI'm talking about American confidence our agencies will do their assigned jobs. The point of these agencies is to effectively administer the function of the government they manage. If you install a white house liaison and add extra purity testing steps we're literally adding more bureaucracy. This batch of orders in combination are way more involved than we're used to and I expect growing pains.\n\nThe wording even notes that Trump can have them interpret the law however he wants, even if he breaks the law. Given Trump can't be held accountable it's extremely hard to find out what happens if Trump's interpretation is wrong.\n\nThis is like using a jackhammer to carve marble. His EO and plans to implement them have no immediate transparency and have already affected important federal jobs and nonprofits. \n\nI don't really have an issue of a liaison being there though\n but how this will be implemented affects millions of lives.",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "strykersfamilyre",
                            "body": "The idea that some agencies are truly independent and free from presidential oversight is a myth. Yes, the President may only appoint officials in certain agencies and might have limited power to remove them, but that doesn’t mean these agencies operate in a vacuum, untouched by the executive branch. They still exist within the presidency’s constitutional authority, and their decisions, budgets, and priorities are all shaped by White House influence.\n\nThe term 'independent agency' is more about structure than actual autonomy. Congress may give agency heads some job protections, like staggered terms or limited removal conditions, but that doesn’t mean the President loses oversight. The White House still controls appointments, budget approvals, and policy direction. Courts have repeatedly upheld that the President must retain some level of supervision, even over so-called independent bodies.\n\nIn reality, no federal agency operates in total isolation (minus perhaps black budget groups which I assure you will not be audited by DOGE.) The President may not be signing off on every decision, but to suggest these agencies act without any presidential influence ignores how the executive branch actually functions. Come on, dude.... They are part of the system, and at the end of the day, the person sitting in the Oval Office is still the one at the top.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Odiemus",
                            "body": "Which works as long as they remain under the supervision and direction of the president and not working against him. They cannot receive authority through him and then turn around and use that authority against him.\n\nAnd for the most part the EO does retain giving them independence just with a lot more oversight.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TestPilot68",
                            "body": "Where do you see that in the Constitution?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aecyberpro",
            "body": "There are multiple posts about this on Reddit, and I'm absolutely amazed at the way those people think who are commenting on them. They say it's the end of Democracy, but how the hell do they believe that unelected government employees making regulations that are enforced as law is democratic? That's the opposite of democracy. I just saw comments from people suggesting violence in response to Trump's EO which returns us closer to democracy. Democrats are truly the party of insanity.",
            "score": 3,
            "replies": []
        },
        {
            "author": "smauseth",
            "body": "I thought that the regulatory agencies were supposed to be under executive branch anyway?  What am I missing.? When was ever these agencies ever supposed to be independent?  Who were the regulatory agencies accountable to before this EO?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Daharve01",
            "body": "Interesting that he left the FED/JPow alone…probably would have tanked the market.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HolyTerror4184",
            "body": "Jesus, the meltdown in that thread is nuts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jvmjr1973",
            "body": "The comments in that sub reddit are despicable.  With outright threats to the President.  They should all be reported.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lilpixie02",
            "body": "I’m curious to know what your thoughts are on this EO.",
            "score": -2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "teslastats",
                            "body": "So no checks and balances? This was 5th grade history dude",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Alucard1991x",
                                    "body": "Checks and balances refers to the trinity of power (president,house,senate/congress) so that one of those three could not rule tyranically. Three letter agencies should never be independent and have no bearing in checks and balances as they are employees under the government not above the government. This should never need clarification our schools really have gone to shit since the 90’s",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "teslastats",
                                            "body": "The president and atty general have final say on legal matters. Why do we even need congress or the supreme Court?",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Scatoogle",
                                    "body": "He didn't dissolve the judicial and legislative. Did you take civics?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "teslastats",
                                            "body": "If he has absolute authority, why do we need those branches?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "InadvertentObserver",
                                                    "body": "He’s only asserting his absolute authority over the Executive Branch.  Which….reads Constitution…checks out.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Scatoogle",
                                                    "body": "He..... Doesn't? Did you grow up in common core classes? Because I'm getting the sense that reading comprehension isn't a strong point for you.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TestPilot68",
                                    "body": "5th grade? Almost everything in history or civics you learned about in 5th grade turned out not to be correct, or least the not whole story.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}