{
    "title": "Sounds like the Kash vote happens tomorrow. Prepare your popcorn... He's gonna shake things up.",
    "author": "BrandDC",
    "subreddit": "Republican",
    "rank": 208,
    "score": 121,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 20,
    "url": "https://x.com/SenMullin/status/1892023550837420458",
    "id": "1itlvn5",
    "selftext": "",
    "comments": [
        {
            "author": "aquatone61",
            "body": "Bongino says he knows where the bodies are buried, let’s hope he right.",
            "score": 21,
            "replies": []
        },
        {
            "author": "None",
            "body": "The issue isn't exposing crimes & treason...that's easy. The true test will be the action taken, if any. Everyone knows crime & corruption is rampant, but no one goes to jail or gets executed for treason.  The ruling elite never receive any repercussions for their crimes.",
            "score": 16,
            "replies": [
                {
                    "author": "Fun_Speed_5818",
                    "body": "This is the closest “we the people” have ever come to getting justice. Burn the system down and lock up ANY corrupt politician no matter their party affiliation!!!!!! It’s high noon thieves, time to face the reaper 😡",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "BrandDC",
                    "body": "Unfortunately Kash will be under the microscope for alleged retaliatory hits once he takes office. They're all expecting heads to roll.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Fusion999999",
                    "body": "The first person to be excuted for treason  has to be Trump.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "whozwat",
                    "body": "Seriously you guys believe there's rampant corruption?  Not everybody believes this",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "noone1968",
            "body": "The word is, it will be a secret ballot in an executive session",
            "score": 5,
            "replies": []
        },
        {
            "author": "LakeLoverNo1",
            "body": "It needs to happen. I’m looking forward to him being confirmed.",
            "score": 12,
            "replies": [
                {
                    "author": "Appleguy4life",
                    "body": "He was",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Psychosis99",
            "body": "I hope he gets in.",
            "score": 5,
            "replies": [
                {
                    "author": "Appleguy4life",
                    "body": "He did",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KoetheValiant",
            "body": "Beck said day 1 Epstein list gets released we will see",
            "score": 2,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "I believe I saw that on Valuetainment. Day 1 is a flurry of activity including swearing in... I would expect Week 1 but I wouldn't hold him to Day 1. The libs had meltdowns when Trump didn't accomplish a few things on Day 1.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "woman-ina-mansworld",
            "body": "Don’t publicly announce what you are doing, just do it and put out a memo to the agency on a gag order on any and all FBI business and track down leakers and send them packing. \n\nWith a finders fee to whomever turns in the leakers",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnooFloofs1778",
            "body": "Leftids will forget DOGE exists.",
            "score": 8,
            "replies": []
        }
    ]
}