{
    "title": "Question, please. What does impeachment mean for a judge? What is the process? If he is impeached, does that mean he's off the bench? Sorry, I don't have a link so I am just putting google in the link area. I only have questions today. Thanks!",
    "author": "ifellicantgetup",
    "subreddit": "Republican",
    "rank": 231,
    "score": 0,
    "upvote_ratio": 0.4,
    "num_comments (reported by reddit)": 6,
    "url": "http://google.com",
    "id": "1itmt8u",
    "selftext": "",
    "comments": [
        {
            "author": "MKE1969",
            "body": "Same as any other Federal Impeachment. The House votes to bring charges (they won’t) and The Senate voted to convict and remove from office (they won’t).",
            "score": 3,
            "replies": [
                {
                    "author": "ifellicantgetup",
                    "body": "Thank you so much! So what do they do with a crappy judge that isn't following the law?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "MKE1969",
                            "body": "In a perfect world he would be voted out (elected Judge) or impeached/Removed (appointed) Judge. But neither will happen because half of the country is completely fine with Judicial Activism. Wisconsin Supreme Court is controlled by activists who said in the campaign trail that they would overturn abortion laws, without even seeing the case arguments. (They did). This is happening everywhere. As the left loses legitimate power they turn to the only power they have left. Judicial Activism/Legislation. As Elon said, if one Judge in a Blue State can overturn a President, we don’t have much of a Democracy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ifellicantgetup",
                                    "body": "Thank you!!!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "woman-ina-mansworld",
                                    "body": "Until what’s happening starts to work for every day Americans….., then we have a super majority in both chambers and we reverse course on this judicial activism.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MKE1969",
                                            "body": "From your iPad to God’s ears.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}