{
    "title": "DHS on High Alert—BOMBSHELL: Secretary Kristi Noem Orders Polygraphs to Catch Leakers",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 199,
    "score": 68,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 32,
    "url": "https://conservativeroof.com/kristi-noem-orders-polygraphs-to-catch-leakers/",
    "id": "1itz44n",
    "selftext": "",
    "comments": [
        {
            "author": "Jolly_Job_9852",
            "body": "Aren't polygraph tests notoriously unreliable and often won't hold up in a court of law?",
            "score": 57,
            "replies": [
                {
                    "author": "definitely_right",
                    "body": "Yeah, but dhs lady hot so doesn't matter",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Jolly_Job_9852",
                            "body": "I'm having trouble if you're being serious or making a joke.\n\nI'll assume you're being serious and say this. Someone attractiveness shouldn't be the reason we implement a policy designed to police every single individual.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "definitely_right",
                                    "body": "Joking. This is the attitude of a lot of MAGA I know.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Jolly_Job_9852",
                                            "body": "I gotcha. I was in a discussion yesterday on the Presidents subreddit and someone made a reference to Trump and Zelenskyy but phrased it in a WW2 context which went straight over my head. But we have meme Mondays in thst sub so I thought this isn't Monday so I had thought it was a legitimate question and I was hit with all sorts of downvotes. Lol.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LordZombie14",
                                    "body": "Curious, why is it you see it as \"policing every single individual\" and not, trying to catch the few bad guys leaking Department of Homeland Security data?\n\nOn top of it all, all she is doing is adding one question, to the already being done, polygraphs.\n\nJust curious.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Jolly_Job_9852",
                                            "body": "It's the libertarian in me, screaming about too much surveillance. In an ideal society, leaks like these would not happen. Since we don't live in an ideal society there are safeguards in place to prevent such leaks. I find additional surveillance(like the proposal above) to be authoritarian. \n\nLet's suppose the leaks are stopped with the new surveillance, does Secretary Noem repeal said measures or would she keep them in place during her tenure? If she would remove them after the leaks stop, I'd happily eat crow, but as we've seen with almost every government program, once they have room to grow roots it's very hard to remove them.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "LordZombie14",
                                                    "body": "No, I see your point, once they add something they tend to stay in place. They never get rid of it and it slowly starts to eat away our freedoms",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ghanlaf",
                    "body": "Fun fact.  Wayback in a previous profession i had the privilege of teaching people how to beat polygraph testing.\n\nIt's a lot easier and a lot harder than it seems.  It's easy to beat, but if you have a good technician administering the test, it's also easy for you to get caught beating it if you're not careful or you're not a sociopath.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Important_Piglet7363",
                    "body": "Federal employees are not covered by the The Employee Polygraph Protection Act (EPPA), but even the EPPA allows polygraphs to be given if there is reasonable evidence that an employee’s actions may have been injurious to the employer.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Jolly_Job_9852",
                            "body": "I see that. I'm was repeating what I had often heard, that polygraph tests are unreliable and often don't stand up to scrutiny in a court of law. I think we're talking past each other. I didn't know that federal employees were not protected by this act, why is that?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Important_Piglet7363",
                                    "body": "I would imagine because a federal employee’s honesty might be a matter of national security.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ahent",
                    "body": "Yes the machine is unreliable. I watched a documentary on them and it's the user of the poligraph that is the real detector. The way they ask the questions and get the person to talk the polygraph taker can eventually give enough info to prove they are lying or telling the truth. In the documentary I was watching some people would actually admit to doing whatever they were questioned about because they thought the polygraph would give them away if they didn't. It was fascinating. Most of it was about infidelity cases but they said a lot applies to criminal stuff as well. With criminal cases they said they sometimes can get enough info from the possible criminal's answers (or just what he says to the examiner) to get a warrant they couldn't get before due to lack of evidence.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cathbadh",
                    "body": "Yeah, they're a step above voodoo in reliability.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Feeling_Dig_1098",
                    "body": "What could be done to better supervise individuals in the agencies? America has many traitors and mercenaries ",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Jolly_Job_9852",
                            "body": "Instituting loyalty tests and random polygraph tests won't stop the leaks and increased surveillance in our agencies would only further increase the bureaucracy by hiring additional people to monitor the people already there \n\nI would say that if a person is leaking information, the matter should be investigated and if the person did leak information related to the government operations in a specific policy area(border security) they should be fired.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ntvryfrndly",
                                    "body": "IF, when a leaker is factually found, they throw them in gitmo for 10 years I guarantee the leaks will stop.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TestPilot68",
            "body": "Polygraphs are very easily fooled by experts. DHS is chock full of those experts.\n\nSeems like a waste of time and more likely to falsely clear leakers vs catching any.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Main_Decision4923",
            "body": "What a waste of government resources. Next she’ll get plastic surgery on the government dime",
            "score": 5,
            "replies": [
                {
                    "author": "kcabyats",
                    "body": "I really hope this is sarcasm because of all the waste that was found.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImperialxWarlord",
            "body": "This sounds wasteful given how untrustworthy those tests are. And also just…unethical. This sounds more like something you’d hear from Russia or China lol. And as much as I dislike whistleblowers at times, they are necessary. But I guess that only matters when it’s not us they speak out against lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "iLikeSmallGuns",
            "body": "I like it. If you’re not loyal to what the country wants, then GTFO.",
            "score": -10,
            "replies": []
        },
        {
            "author": "LakeLoverNo1",
            "body": "Awesome! While a polygraph may not be usable in court, police use it all the time to narrow down suspect lists. I understand the CIA and FBI use it. These leakers need to be confirmed, fired and prosecuted.  OPSEC is serious and breaches literally places our immigration agents in grave danger.  Think about it. If a heavily armed and violent gang doesn’t know about a raid, you catch them by surprise. Not only are you going to capture more folks because they will not know you’re coming, but they won’t be armed and prepared for your entrance.  If they know you’re coming, they have two choices. They can leave so you don’t capture them - which is what happened so far.  Or, they can set up an ambush and murder several agents.  As these gangs get more desperate, I hope I’m wrong but I anticipate more desperate measures from them.  This is serious business.  FAFO.",
            "score": -5,
            "replies": []
        }
    ]
}