{
    "title": "When Trump and Elon start sending out checks out Will democrats cash them or throw them in the trash in protest?",
    "author": "Past-Chip-9116",
    "subreddit": "Republican",
    "rank": 190,
    "score": 187,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 236,
    "url": "https://www.livenowfox.com/news/5000-doge-dividend-check-trump-backs-savings-americans",
    "id": "1iu5c21",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "[removed]",
            "score": 211,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "I did when President Biden sent me a check",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Communal-Lipstick",
                            "body": "And Democrats did when Bush sent out checks. No one is going to turn down money.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Jolly_Job_9852",
                                    "body": "I actually think I used a good portion to buy a handgun in all honesty. The rest of the money I should have put away in a rainy day fund. Ah well c'est la vie",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Bennysuly1",
                                            "body": "That’s exactly what I did with mine!💪🏻🇺🇸🔫",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thelingletingle",
                    "body": "They’ll cash the checks and say they’re “taking it so Elon can’t steal it” or some bullshit like that.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "I never even saw a stimulus check. I was busy in the military being an essential worker during the pandemic.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mojeaux18",
                    "body": "I do recall Dems refused to take the Trump vax, but when it became biden’s they tried to make it mandatory.  So 🤷🏻‍♀️?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bonfire3939",
                    "body": "Oh you mean the the policies you make that even happen for Biden..I know how the liberals like to use that line well Biden did all this for trump it's because of the past policies...try again we will be here waiting to put you back in your policy grave again",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AdExcellent4663",
                    "body": "How is that the same thing? The government was reimbursing us for hurting the economy. It boiled down to reparations. This is just taking the savings that dems are protesting and giving it back to the people.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tommy9mil",
                    "body": "But dont Democrats always talk about how we shouldn't cut taxes and we need to pay taxes ? That would seem to me that you wouldn't want that money.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "Maybe when they think this through, but many do not. Many just say \"The wealthy do not pay enough!!!!\" and don't fucking care where the money is going.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MikeyPh",
                    "body": "The difference is that they are protesting that they think all these cuts are wrong. Also categorizing what farmers get as \"socialized\" is silly and kinda tips your hand. Take care.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tekk1337",
                    "body": "I actually didn't accept mine because I didn't want it to be included on my taxes.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "30_characters",
                            "body": "Bad call, it wasn't treated as taxable income.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "ChaoticSquirrel",
                            "body": "Why tho? You'd still come out ahead.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StopManaCheating",
            "body": "Is this actually happening or is Trump just trolling?",
            "score": 15,
            "replies": [
                {
                    "author": "loonydan42",
                    "body": "If it does it will be a few hundred dollars.  Not the $5000 they have been saying.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "00000000001488",
                    "body": "I say it has a 60-70% chance, it'll get more people on board with the whole government efficiency = good idea, and it'll be hilarious to see liberals rage cashing their checks with trump and elons name and signatures on it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "cantmakemetalk",
                            "body": "This. It’s essentially just a bribe for liberals to buy into DOGE. That’s why it’s a percentage of that value. Essentially, “The more we cut, the more you get!”\n\nDoesn’t change the fact that it’s going to drive up inflation just like last time.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": ">It’s essentially just a bribe for liberals to buy into DOGE.\n\nNo. It's a sign of what they are doing and how much money it represents in the pockets of tax payers. It is helping people FEEL where their taxes go. The government has made the tax system something that you don't feel, you just know you're getting this much money taken out of your check each month. You should feel it. It's the same idea as using a debit card vs spending cash, you will spend less when you use only cash because you feel it.\n\n>Doesn’t change the fact that it’s going to drive up inflation just like last time.\n\nNo, this would have a neutral effect on inflation. The spending is ending. Government spending IS inflation. However that money that would be coming back to us is not going to the debt to pay it down. This is not a negative, it is a positive, but it is not a positive for its effect on the economy. It is a positive because it makes people FEEL their taxes again as THEIR money not the government's.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mean_Bread_8760",
                            "body": "It will cause inflation.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "No, it will have neither a negative or positive affect on inflation.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JerichoMassey",
                    "body": "I’d go lean to yes.   This isn’t the sort of thing you put into words and then take away.  You can’t unring a bell like this",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tsmittycent",
            "body": "The checks are a terrible idea, pay all that money in the deficit, are they sure this isn’t going to spark more inflation? We owe 9 trillion in interest alone this year pay it all on the debt!",
            "score": 12,
            "replies": [
                {
                    "author": "Due_Butterscotch499",
                    "body": "Trump’s proposal is to add 3T to the deficit via tax cuts that don’t even start unless you, as an individual, make over $800K per year.\n\nHe doesn’t give a sh*t about the deficit or inflation. The tariffs just jacked up imports by 25%. ",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Catalina_wine_mix",
            "body": "Any extra money should be paying debt, because it is all borrowed from future generations.",
            "score": 71,
            "replies": [
                {
                    "author": "Guinnessron",
                    "body": "And sending out checks of ‘free’ money drives inflation.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "GodzillaDoesntExist",
                            "body": "Also costs the government to cut the checks.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "J_Side",
                                    "body": "Do you literally receive a paper check in the mail?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Beneficial-8273",
                                            "body": "Sure.  I forget how that works but you might also be able to have it directly deposit but you can definitely get a check",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tsmittycent",
                            "body": "They said it won’t spark inflation because it’s money that needs to be distributed and has been taken from tax payers already but idk if I believe that",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Pebbles963",
                                    "body": "Is the check taxable?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MikeyPh",
                                    "body": "It's true. Think about your own budget. Let's say you take in say $10,000 in a month. Let's assume you have $100,000 in debt. There are three possibilities for your household.\n\n* 1 - You are paying down your debt\n* 2 - You are adding to your debt\n* 3 - You are adding to your debt as much as you are paying it down\n\nIt's kind of a continuum. You could be really good at paying down your debt, you could be doing it very very slowly. On the other side, you could be adding to your debt just a tiny bit each month, or you could be spending like an idiot and ruining your life.\n\nAnyway, let's assume you are the neutral household. You're paying off enough debt and covering the interest enough that your debt is ballooning out of control, but you also aren't making any headway.\n\nThe entire $10,000 you make in the month goes to your subscriptions, your bills, your coffee in the morning, your food... everything. You put that money aside... you may not have spent it yet, but it is as good as spent because it WILL be spent.\n\nNow, you decide that you don't need your subscriptions to Netflix and Disney+ anymore. Let's say that's $40. You already allocated that money as going out, you are not relying on that money to go elsewhere, so you don't need to borrow money and add to your debt to cover some other cost.\n\nSo it is not adding to your debt because you have done both what you need to pay down your debt that month and keep yourself in that neutral position.\n\nIt will not hurt you to spend that money at this point. So you COULD just put it all towards your debt and become someone who is lowering their debt, or you COULD save it so you have some discretionary money to use, you could invest it and hope it grows and allows you to pay your debt down faster later, or you could spend it.\n\nThose are all decent options. Some would say just pay the debt down with it, that would be the smartest move, but what if you spent that $40 dollars on something that will benefit you long term? Again, it has no negative affect on your debt right now.\n\nThat is what Trump and Musk are deciding. Paying down the debt is the best move, but also letting people spend some of it will help people see just how much of our taxes are being used and it will help us feel what ending that spending will accomplish in the long term.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "blownawaynow",
                                    "body": "They also said it may reduce inflation because people will choose to save it! Hope they find more ways to boost tax payer savings.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MikeyPh",
                            "body": "No t quite, government spending does.\n\nThis money is basically already spent. They are not adding to the deficit with this money because it has already been added to the deficit. In other words, if I itemize all the money I have set to go out to all the things I buy in month: the Netflix subscription, the utilities I know I'm going to pay, the rent, the frivolous monthly subscriptions and food. I have set all that money aside to pay those things. But then I cut my subscription to Netflix and don't have to pay that anymore. I can pay that money towards my debt, or I can buy something that will help me. If I buy something better for me than Netflix that may actually help me further reduce my spending, then I haven't lost anything but a Netflix subscription. That money going to something else doesn't change my budget for that month, but it does change it for the longer term. \n\nIt had no effect on any payments I'm making towards the debt, I just put that money somewhere useful rather than something wasteful.\n\nThat is what is happening here. Spending beyond our means adds to the debt, spending in away that doesn't add or subtract to debt just kicks the can down the road isn't helpful. This decision would split the difference.\n\nIt would be like taking that netflix subscription money and using a little to buy myself a motivational treat, and taking the rest to pay just a tiny bit more of my debt.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Guinnessron",
                                    "body": "Ok you’re responsible, as am I & I’d pay down debt too.  Based on past behavior on covid stimulus checks, a vast majority are not and will buy things they want and previously couldn’t afford.  That drives demand for things and inflation.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MikeyPh",
                                            "body": "But keep in mind Covid checks were printed/borrowed money so that added new debt. This money is *already* borrowed, so it has already added to the debt, we are just changing where it's going. I would hope Americans spend it on worthwhile things like paying down their own debt or using it to build their wealth.\n\nCovid money was also worse because it was paying people to NOT be productive. It had the added effect of basically giving people the okay not to work because some of that money was in the form of unemployment checks. This is not doing that.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Guinnessron",
                                                    "body": "We are both right. Covid checks were worse. But this would not be good. It should be used to pay down the national debt. As small a dent as it would be.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ordinary-Piano-8158",
                    "body": "Or paying back social security",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Dewalt-Shampoo",
                    "body": "Yes. Our INTEREST payments alone on the national debt are over half a trillion dollars. We need to at the very least balance the budget, and really should be paying down the debt.\n\nThank goodness this administration is finally looking into to waste in force. Unlike Biden who never even mentioned it, just tax and spend...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Catalina_wine_mix",
                            "body": "The interest on our debt is closer to a trillion and will exceed it in the coming years.  This does not take into account the social security and Medicare which will go negative in the coming years.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dewalt-Shampoo",
                                    "body": "Wow you are right the number two years ago I saw was $650B and last year was $880B. Crazy.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lord_Gibby",
                    "body": "They will be, this isn’t a set in stone plan but the goal currently is 20% back to tax payers, 20% to paying the debt and 60% to lowering future costs of government spending which would lower inflation",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TungstenBronze24",
                            "body": "What does \"60% to lowering future costs of government spending\" mean? That it goes to fund DOGE? Or that it goes to tax cuts?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Lord_Gibby",
                                    "body": "Pretty sure it means it will be used to pay for next years budget. So we won’t have to take out loans to pay for the budget.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TungstenBronze24",
                                            "body": "I'm a bit confused, as that seems like the same thing as paying off the debt, but maybe it's just a detail of who gets paid when.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Lord_Gibby",
                                                    "body": "No, debt is past bills, future spending is next years budget",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TungstenBronze24",
                                                            "body": "Yeah, but since we're deficit spending it doesn't really matter. If we give $20 to some bond owners, then we just borrow $20 from different people by issuing new bonds next year. If we give $20 direct to contractors next year, then we didn't pay back the bond owners. It's all the same, bar the change in interest rate between previous and future bond owners.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Opposite_Ad_9491",
                    "body": "It is our money that they took I wouldn’t mind some back!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CallMeCraizy",
            "body": "I'm against this idea. 100% of the savings should be applied to the debt/deficit.",
            "score": 26,
            "replies": [
                {
                    "author": "usernamesarehard1979",
                    "body": "I’m not going to pass on it if they send it out, but I would rather it pay down debt.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "tsmittycent",
                    "body": "Likewise.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RickPar",
            "body": "I'm with the other people here who say use it to pay down the debt. Or fund social security or something.",
            "score": 5,
            "replies": [
                {
                    "author": "cantmakemetalk",
                    "body": "Social security is next on the chopping block bro. It’s literally socialism. Make the smart move and fund your own retirement.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Max_Suss",
            "body": "I’m all for cutting waste etc. but we’re bankrupt, use the savings to pay down the debt.",
            "score": 23,
            "replies": []
        },
        {
            "author": "docroc-----",
            "body": "No checks, please. Pay the debt down. No tax cuts either. Get this house in order.",
            "score": 29,
            "replies": [
                {
                    "author": "SuperLil1",
                    "body": "They need to tax the rich and send out monies to everyone else.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gurganus88",
            "body": "They shouldn’t send out checks period. Use the money towards the deficit and debt.",
            "score": 12,
            "replies": [
                {
                    "author": "SuperLil1",
                    "body": "Tax the rich and they’ll bring down debt!!!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Gurganus88",
                            "body": "If you confiscated the combined wealth of the top 1% in the US you’d only be able to fund the government for less than 3 months. The US has a spending problem not a tax problem.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "rhinestonedcowboy",
                                    "body": "I saw your comment and I looked it up. It said that the combined wealth of the 1% was 49.2 trillion and our national debt is 36.2 trillion. So while your statement may be true, we would also be debt free.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Beneficial-8273",
                                            "body": "If someone or rather some group stepped up today and payed off the debt, the government would end up back in debt tomorrow... it's as if they can't help themselves. Hopefully the Donald  will start a new trend.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "TungstenBronze24",
                                            "body": "I'm generally on board for progressive taxation, but this is a bit disingenuous. This wealth isn't all in yachts and in cash in overseas bank accounts. It's in the stock market and capital for businesses. You take it and the stock markets crashes, the government takes control of huge swaths if industry (factories, buildings, IP...). What's the country gunna do with the IP to Mickey mouse? \n\n\nThe liquid non-invested wealth is much lower (though of course not low enough to suggest it's fair, by many people's estimation). If you want to tax rich people spending their money on frivolous behavior, tax the frivolous behavior (sales taxes) or close loopholes for them getting income tax free (e.g. borrowing from banks with stock at collateral). Make it so it's better for them to keep wealth invested and productive. ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tsmittycent",
                            "body": "Trump would never but that’s exactly what will save this nation",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SuperLil1",
                                    "body": "He’s not saving any of us, just the rich and super wealthy. I doubt you’re one of those if you’re on here. 🤷🏽‍♀️",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jdh5817",
                            "body": "You don’t think rich pay their fair share? Their tax bracket likely almost triples yours.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "tsmittycent",
                                    "body": "and it should be",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SuperLil1",
                                    "body": "Do you think they pay their fair share? Yall are so weird always thinking you’ll ever be close to their wealth and blaming everyone else for your problems except for the actual people. \n\nYou must not know that Elon Musk, for example, accepts billions in government funds (our taxes) and gets taxed much less than what he receives so basically our taxes covers what he pays which means he doesn’t pay any at all. Here’s an example, if I pay $10 in taxes but I receive $150 from govt funds (every one else’s taxes), am I paying my fair share? I know it’s hard to believe but yall have been bamboozled and brainwashed, sorry to break it to you.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Beneficial-8273",
                                            "body": "When you go buy a car company and a rocket company,  you will probably be eligible for some guv money too. You will accept it gladly.  It's called BUSINESS...",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SuperLil1",
                                                    "body": "You completely missed the point. I have a business and I know how govt funds work. \n\nIf you are THAT rich (which you & I will never be, I know it’s hard to accept but very true), you do not need handouts from poor people (anyone living paycheck to paycheck which most of us are). You can afford to pay all that stuff on your own; work hard, stop being lazy, pick yourself up from your boot straps, work 24/7 (you know, all the things rich ppl say about everyone else). \n\nYou’re delusional to believe that “successful businesses” (billion dollar businesses) need poor people’s tax monies!✌🏽",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Beneficial-8273",
                                                            "body": "I never said they needed it but they are going to take it. It's BUSINESS!! Why wouldn't they take it? Elon didn't make the rules. He'd be out of BUSINESS  if he didn't take it and all his competitors did. THIS IS A CAPITALIST COUNTRY!!!  ha, and you have no idea how rich I am.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SuperLil1",
                                                                    "body": "You’re not rich at all. ✌🏽lol",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Beneficial-8273",
                                                                            "body": "How do you know anything about my wealth? See, you lost the argument so you just lash out like a fool. Be well my friend.  And continue to hate Elon for trying to help keep your tax money safe. Tell ya what, hate him because he's smarter and richer than you but respect him for trying to save your money from being wasted. Best thing you can do is be quiet for a year and see how it turns out then you won't look so very ridiculous.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Beneficial-8273",
                    "body": "Yeah alot of people saying they should pay the debt and I agree but that money will stimulate the economy as well. People will spend it. Some will save it. It will help in the economy too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NegativeCricket5308",
            "body": "Cash them!   Reap the benefits that they are all complaining about",
            "score": 3,
            "replies": []
        },
        {
            "author": "stlyns",
            "body": "I saw on another post that it could be 4 billion dollars split amongst 79 million taxpaying households for about 50 dollars each.",
            "score": 10,
            "replies": [
                {
                    "author": "tsmittycent",
                    "body": "At that rate why even give it ? It’s be about $38 aftwr taxes. Just pay it on debt",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Beneficial-8273",
                            "body": "AGREE",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beneficial-8273",
                    "body": "Yeah don't plan on it being much... Don't know the numbers yet.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Pebbles963",
                            "body": "It will cost more than $50. just to write the check, because I would imagine the employee/employees who process it get good pay for their job, and then the checks mailed cost money, even the DD cost money. I bet it’s over $50. to give checks out. Why do that? Just pay the debt.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fake_Gamer_Cat",
                    "body": "If I got 50$ that means I'm 50$ closer to new PC parts. I see that as a win-win lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "QuettzalcoatL",
            "body": "Until it happens, it's bollocks.\n\nIf it does happen, I would just save it because it's going to cause major inflation yet again.",
            "score": 6,
            "replies": [
                {
                    "author": "tsmittycent",
                    "body": "They are saying it won’t because this is money that’s already been taken from tax payers and they won’t have to print any new money. Not sure I believe that. It’s like Donald doesn’t have capable economists advising him",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Evil_Garen",
            "body": "Lol you think Dems won’t cash that shit?!?!  Bwahaha",
            "score": 4,
            "replies": []
        },
        {
            "author": "Inevitable-Store-837",
            "body": "This is exactly the kind of crap that got us into this mess. The point of trimming the fat of the federal govt is not to charge the credit card right back up. No girl math",
            "score": 4,
            "replies": []
        },
        {
            "author": "roynoise",
            "body": "If they really want to put their money where their mouths are, they would hand their checks over to a Donald voter and say thank you/I'm sorry. Alas.",
            "score": 2,
            "replies": []
        },
        {
            "author": "earl_lemongrab",
            "body": "Well Elon isn't sending out anything, he has no authority to do so.  Now does Trump have the ability to just decide to do it.  Congress would need to approve something like this, as with the COVID stimmy checks.  \n\nOf course any checks would come from the Treasury Department which is naturally part of the President's executive authority.  But simply saying \"Trump would start sending out checks\" is not how any of this works.",
            "score": 2,
            "replies": [
                {
                    "author": "Past-Chip-9116",
                    "body": "When Elon finds out what some of them congress members have been up to the second amendment comes into play. Trump and Elon are modern day George Washington and Paul Revere type gentlemen. Congress should be worried",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Morgue724",
            "body": "You ever meet a dem that didn't want to spend money? Me neither.",
            "score": 1,
            "replies": [
                {
                    "author": "fromtybee",
                    "body": "These are the Republicans spending our money, please try to keep up.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Morgue724",
                            "body": "Hard to tell when the trolls do drive by memes.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "fromtybee",
                                    "body": "It is not hard to tell who votes on legislation and approves the spending.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Coast_watcher",
                    "body": "Like Cyndi Lauper sings, \" I see your true co!ors shining through \"",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Morgue724",
                            "body": "They aren't shing through I am flying them like the rest of the freaks do.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AechBee",
            "body": "I would imagine a greater protest would be cashing the check and donating the money to UNICEF/World Relief/etc.",
            "score": 2,
            "replies": [
                {
                    "author": "AechBee",
                    "body": "The downvotes confirm my theory ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MaBonneVie",
                    "body": "I like to give to my local charities and services.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "wally002",
            "body": "Impeach him for bribery!",
            "score": 1,
            "replies": [
                {
                    "author": "Aforementionedlurker",
                    "body": "Elon proved during the election bribery is ok",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "This is the stupidest take I have heard. \n\nCommunism is when the \"people\" control the means of production and no one owns anything, which require EXTREME government control, effectively negating the idea that people control anything.\n\nThis is not communism at all. This is giving people back their money OR paying down debt OR a mix of the two. This has nothing to do with communism.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "That money was already allotted to be spent. By simply changing where it is going, you are not adding to the debt. You COULD pay down the debt with that money instead. That is the debate, should it all just go to paying down the debt, or should Americans get some of that money and help pay down some of their own. This will not increase inflation nor will it decrease inflation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrilliantSecure8473",
            "body": "They will cash them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeautifulExternal943",
            "body": "I can’t love this post more than",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mojeaux18",
            "body": "I hope so. I hope they burn their checks.  :) I can dream can’t I?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Balmungxx",
            "body": "Nearly half of Americans live paycheck to paycheck. Of course they will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lt_Snuffles",
            "body": "just going to donate to bernie and aoc using that money",
            "score": 1,
            "replies": []
        },
        {
            "author": "HorrifyingPoundcake",
            "body": "One too many outs there bud.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Billpace3",
            "body": "Hell, it's our money in the first place!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "No. It's money that ALREADY caused inflation. If I take out a $10000 loan to buy a bunch of things I think think I need, well that money is now borrowed. If I decide then that one of those things I \"needed\" to buy wasn't actually needed, I can spend that money on something else without hurting myself more.\n\nI COULD pay that money back immediately and reduce my debt, but taking that money and spending it on something else doesn't put me in any worse a position.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dirt_Illustrious",
            "body": "My guess would be that they will spin up some type of rogue DEI fund and those drinking the woke-aid will happily endorse their checks and deposit them into the fund. They will then likely attempt to leverage this fund to continue their defamatory campaign of divisive rhetoric. It will amount to nothing more than a few bizarre MSNBC broadcasts, a few Don Lemon coping sessions (while he continues to beg his YouTube followers for donations- pathetic, I know). Oh, but all their efforts won’t be in vain, because they will live on in perpetuity a la r/cringetiktoks and on X (#libsoftiktok)",
            "score": 1,
            "replies": []
        },
        {
            "author": "tech_guy1987",
            "body": "Don’t be naive… they are not sending us checks. They barely gave us a one time $2,500 check during a global pandemic 😂 I highly doubt they are going to “refund” us money they save from cutting programs. But they are smart to get us thinking there will be a refund check and then when it doesn’t come they will blame democrats for blocking it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-8273",
            "body": "The dems will scream and curse in protest, .....all the way to the bank.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BleachBrain",
            "body": "They'll cash them, even though they've been voting to throw tax money in the trash for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PinkClouds20",
            "body": "I'm pretty sure they will cash them. You have to be a complete moron to throw it away.",
            "score": 1,
            "replies": [
                {
                    "author": "Past-Chip-9116",
                    "body": "Well to be fair we are talking about the left, they have been know to be morons",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emphasis_on_why",
            "body": "Neither they will give the money to scam cons who will make some new dumb three letter acronym about what matters, while buying three or four mansions around the country",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdExcellent4663",
            "body": "Probably the second option. The third option would be to donate it, but they're not good enough people to think of that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "You got checks (or direct deposits) under Trump.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GiinSeeker",
            "body": "To be fair, when Biden’s administration handed out cash during the pandemic, what did everyone do?  Cash them or throw them in the trash?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpaceCadetBob",
            "body": "I’d like to see some of that money go into helping poor school districts with issues like Title 1 and IDEA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Breadsammiches",
            "body": "Those checks ruined my life. After the first check was issued, rich California Liberals swooped into my state, bought up all of the rental properties, then raised my rent from $765 up to exactly $1,400 a month. Then seeing as I was a working student, i didnt get any of the stimulus checks, so I was forced to drop out and move, meanwhile the crackheads in the area started walking around with new phones and expensive sneakers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "You are an idiot. The money is already spent and the debt burden has already been taken on. After you take on the debt, if you change what the money goes to, you are not affecting the inflation more that it already has been. The damage was done already. The last time this happened, that money largely had to be borrowed, so it made inflation worse.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "APerspicaciousHuman",
            "body": "If they do send out checks, they lose all credibility about trying to fix the budget deficit, so I put the probability of this happening at 2%.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonfire3939",
            "body": "Its insane how quickly we forget things in politics..Hilary and Obama saying you will learn English if you come here and you will be deported if you commit a crime...then found out they could vote along with dead people and now then the res carpet comes out...don't make me pull the tapes libs you know it happened just accept the truth...ive got the tape ready if you really want to look like fools more then the party already does. ...",
            "score": 1,
            "replies": []
        },
        {
            "author": "XancasOne",
            "body": "As much as I can use that money, it would be smarter to pay it toward the deficit or pay it into Social Security to help it stay solvent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thirdlost",
            "body": "Democrats should not throw them in the trash, they should sign them over to the treasury and send them back",
            "score": 1,
            "replies": [
                {
                    "author": "Past-Chip-9116",
                    "body": "YEAH RIGHT 🤣🤣🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "max-in-the-house",
            "body": "Sure I'll cash it because I'm paying for it either way.",
            "score": 1,
            "replies": [
                {
                    "author": "Past-Chip-9116",
                    "body": "Better than it going to some foreign country to indoctrinate the children with transgender propaganda",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sinjix",
            "body": "Cash them and immediately find a reason to blame them for it not being more money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Scene_5551",
            "body": "The democrat way is to criticize the system while exploiting it, and ending in 🏳️‍🌈🙏",
            "score": 2,
            "replies": [
                {
                    "author": "Collection_Similar",
                    "body": "And Republican plans on raising the debt ceiling 4 trillion more $$ is what?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Collection_Similar",
                            "body": "Is this a spitball fight? What do you think of that plan to raise the debt ceiling?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "CykoticXL",
                                    "body": "Do you spend all day thinking about Trump",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CykoticXL",
                                                    "body": "Try posting about him another 5 times today. You’re doing well for yourself",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MikeyPh",
                            "body": "Please do not call our opponents nazis, or you will be banned.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "villaisgorilla",
            "body": "It better not happen.  \n\nPaying everyone $5K would be roughly $1.7T.  Last year the US over spent by $1.8T swelling total debt to about $36T.\n\nWe need a balanced budget.  All this money that President Trump and Jafar keeping claiming they are saving needs to be put to our national debt.",
            "score": 2,
            "replies": [
                {
                    "author": "tsmittycent",
                    "body": "Absolutely",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "Beneficial-8273",
                    "body": "Yeah. Lock em up. I agree. I want my damn money back too even if it's spent already. It needs recovered somehow for many years back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fuck-face-actual",
            "body": "We all know they’re gonna cash em. Life’s hard out there for young adults living in their parents basement that have never had a real job.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Happy_Rule168",
            "body": "Since the democrats hate him and have no faith they should be skipped over.  Surely they wouldn’t want anything that comes from Trump/Elon.",
            "score": 1,
            "replies": [
                {
                    "author": "Beneficial-8273",
                    "body": "True. If you are a dem you should consider this blood money and refuse it. They can give me your share...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Happy_Rule168",
                            "body": "They won’t though",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheseConsideration95",
            "body": "I am going to put it towards a deposit on a Tesla.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happy_Rule168",
            "body": "I hope they do…they should since all they do is protest about him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bdmason10",
            "body": "Send me the money, if you aren’t using my taxes for shit give it back. I didn’t go bankrupt the fucking government did (I understand that’s not how economy works blah blah blah) why tf is these guys overspending my fuckin problem? I’ve got shit to pay for",
            "score": 1,
            "replies": []
        },
        {
            "author": "delectable_memory",
            "body": "You know they won't turn down free money",
            "score": 1,
            "replies": []
        },
        {
            "author": "BadWowDoge",
            "body": "Reparations for the past 4-years under Biden",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea_Wind3843",
            "body": "Ask one and see what their answer is. However, have you ever met a dem that doesn't weave a web of lies that fits their agenda?",
            "score": -4,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Yes. I have met many. Please do not demonize an entire group of people. Many of them have been lied to for years. It is hard to wake up from that. So they will inadvertently spread lies because they trusted those who told them those lies.\n\nHate the manipulators not the people who were manipulated.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BeachWoo",
            "body": "They sure as shit aren’t going to throw the $ away. I’m still waiting for them to open their home doors to the illegals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "woman-ina-mansworld",
            "body": "I’d rather be given a tax credit than giving money to some crack head in some shit hole city that doesn’t pay taxes",
            "score": 0,
            "replies": [
                {
                    "author": "tsmittycent",
                    "body": "They said only tax payers will get it",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xxPOOTYxx",
            "body": "They won't. They will use it to put a down payment on a new Subaru and buy soy lattes. Then continue to cry on the internet from Starbucks wifi.",
            "score": -2,
            "replies": []
        },
        {
            "author": "independentlywrong",
            "body": "Yes they will cash them and bitch about having the money",
            "score": -1,
            "replies": []
        },
        {
            "author": "Confident-Database-1",
            "body": "Yep same thing I did when they sent out Covid checks. Cashed them. If the cookie jar is open, you are not hurting anyone but yourself if you don’t take a cookie.  At least if these DOGE checks happen it will be actual money that was going to crooks anyway. With Covid checks it was just money freshly printed.",
            "score": 0,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "This is the key and what so many are not understand. Covid checks was borrowed money and added to the debt. This money (depending on the number that they send us and if they do) would be money that was already printed/borrowed so it is not adding to the debt. It could pay down the debt, which would be good, or just be spend on better things by the government, or by we the people.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TT0069",
            "body": "Rhetorical question, because we know they’ll virtue gesture all day about the woke ways they’re spending it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "futuristicplatapus",
            "body": "Donate them to Ukraine ?",
            "score": -1,
            "replies": []
        },
        {
            "author": "MikeyPh",
            "body": "With how much they complain about these families losing their jobs because of the layoffs, I think they should start a fund and put their money where their mouths are. But they won't.",
            "score": -5,
            "replies": [
                {
                    "author": "MYIDCRISIS",
                    "body": "Wouldn't they have to pull their heads out of their asses to do that first?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "roynoise",
            "body": "If they really want to put their money where their mouths are, they would hand their checks over to a Donald voter and say thank you/I'm sorry. Alas.",
            "score": -1,
            "replies": []
        },
        {
            "author": "RadioControlled13",
            "body": "I’d really rather we pay down the deficit rather than send out checks.  \n\nWe’re running an annual deficit, let alone the national debt.",
            "score": 0,
            "replies": []
        },
        {
            "author": "TungstenBronze24",
            "body": "Not only would this not help pay down the debt, it'd also flame inflation we just got under control. Bad idea.",
            "score": 0,
            "replies": [
                {
                    "author": "tsmittycent",
                    "body": "Inflation isn’t under control. How would it not help\nPay down debt?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TungstenBronze24",
                            "body": "Because the money would be given to citizens instead of bond owners. You don't pay down your debt by earning $10 and then giving your friend $10. You give the $10 to the credit card company.\n\n\nInflation is at 3%, which is a normal value. It may go up because of tarrifs (which trump himself says, he just thinks it's worth the battle https://apnews.com/article/trump-tariffs-canada-mexico-china-trade-surplus-3010e6368545e2976feb5ac6b41e528e) but it's down at normal levels right now and has been since about June of 2023 (https://www.bls.gov/charts/consumer-price-index/consumer-price-index-by-category-line-chart.htm)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stunning-Level4882",
            "body": "It would be super funny if they only mailed them out to republican voters. And when the Dems cry they didn’t get one, our reply can be … well you didn’t vote for this or he’s not your president",
            "score": -6,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": "The user is fucking joking. Relax. What is it with people like you who take everything literally and can't take a joke?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChaChaBear59",
            "body": "Great Point",
            "score": -1,
            "replies": []
        }
    ]
}