{
    "title": "Redditor planning on bringing a gun to DC to assassinate Trump. Post gets 700+ upvotes.",
    "author": "MikeyPh",
    "subreddit": "Republican",
    "rank": 184,
    "score": 258,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 73,
    "url": "https://x.com/reddit_lies/status/1892667287674519614",
    "id": "1iucjn6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DS8234",
            "body": "Reddit is a giant cesspool of extreme left nutjobs and brainwashed sheep sharing disinformation and anti American propaganda. This is no surprise.",
            "score": 93,
            "replies": [
                {
                    "author": "lolwatdahek",
                    "body": "Feels like it started happening around the time reddit got sold to that Chinese company *Tencent.*",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Don_The_Great2024",
                            "body": "Nah man don't blame china for this. It's definently the people that have mental illnesses on this app",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bozzhawgg",
                    "body": "People really need to stop sniffing glue. There are so many threads on seeking asylum in Canada and European countries. I asked \"what did I miss\" on one of them and had 100 downvotes. I don't understand the hysteria",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "that_guy_ontheweb",
            "body": "I have been saying for quite some time that it’s only a matter of time before one of these dumbos tries to do something stupid and gets someone killed.\n\nReddit needs to get this shit under control or the government will do it for them.",
            "score": 26,
            "replies": []
        },
        {
            "author": "BrandDC",
            "body": "# I hope this gets Kash's attention...",
            "score": 45,
            "replies": []
        },
        {
            "author": "BeautifulExternal943",
            "body": "Typical redditor Have you seen these posts? They’re rabid And god forbid you comment You get downvoted into oblivion",
            "score": 12,
            "replies": []
        },
        {
            "author": "atomic1fire",
            "body": "Looks like they got suspended from reddit.\n\nAlso logic dictates that they'll get a visit from the secret service, and either get arrested or weasel their way out of an felony.\n\nOut of all the people you can not absolutely threaten, the president is at the very top of the list. I mean you shouldn't threaten people in general, but the president has an entire law enforcement branch dedicated to tracking down internet tough guys and also checking to make sure you're not making fake dollar bills. I mean they do other stuff like participate in federal investigations, but they're mostly known for fighting counterfeiting, and protecting select politicians but mostly the president.\n\nThere's like 3 internet rules everybody should follow and one of them is don't make the cops mad, but if you're gonna make a cop mad don't pick the secret service.",
            "score": 5,
            "replies": []
        },
        {
            "author": "ChknParmasean",
            "body": "Anti-Gun left lol",
            "score": 4,
            "replies": [
                {
                    "author": "Repulsive_Pop_2105",
                    "body": "Right they are the same people who scream guns are bad and then they talk about using them. Even though every leftist with a gun holds it like a dead rat 😂",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea-Assignment-4037",
            "body": "I hate Reddit I want to see what is happening in my community without the politics. I go onto my local city page and it should change its name we hate republicans .",
            "score": 3,
            "replies": []
        },
        {
            "author": "HolyTerror4184",
            "body": "Was this reported?",
            "score": 10,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "User is suspended so I assume so.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Hope they track the IP address and have some scary guys with guns banging on the door... scare the little shit out of his mommys basement shitless",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "namelessgangsters",
            "body": "I hope that person gets arrested for that threat. It's one serious threat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Right, you missed it: \n\n\"It's time. It's a class war.\n\nDeny. Defend. Depose.\"\n\nNow in fairness, depose doesn't mean assassinate, but it does mean remove by force. Thinking that doesn't mean this user is willing to kill is missing the subtext.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shepsdaddy",
            "body": "That would lead to a deadly backlash against these Sh#t-4-Brains leftists quicker than they can imagine.  \n  \nI can't imagine the horror that would rain down on their ilk.  \n  \nThey never learn.... Like spoiled children with a death wish.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pjmlez",
            "body": "This is a cross post on a sub Reddit of a post on a subreddit of a screenshot of twitter of a post on a subreddit. This is like a cross-cross-x-cross post.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Guinnessron",
            "body": "They better be in prison within days.",
            "score": 5,
            "replies": []
        },
        {
            "author": "fksakeisaidnobabe",
            "body": "It's just sad. Hard to even get angry about this stuff anymore.\n\nLike, this is the environment we've created. Where people are this deluded, en masse.\n\nSomething needs to be done to bring the extremes back to the center (on both sides of the spectrum). I don't know what.",
            "score": 9,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "I agree with you mostly. The \"on both sides\" bit though throws me for a loop these days though. Certainly there are crazies on the right. I don't deny that at all. But the proportions are just not the same. \n\nWe would shut that shit down in a conservative sub. \n\nAnd then look at the riots when Trump was first elected. Now I'll grant that there were provocateurs in the midst, likely some feds, and then you had Antifa mixing in with the crowds. Antifa is very left, and most of the participants in those riots across the country were on the left. Both sides have crazies, yes. But if we took all the crazies on the right and made them fight all the crazies on the left, the right would get destroyed because there are just sooooo many more crazies on the left.\n\nThose riots were all over the country. Even if you count J6, the left's riots were all over the country and lasted days, and then they did it again with Floyd. J6 involved a large number of feds AND Pelosi has admitted that she botched the security. She admitted that Trump offered something like 10,000 troops and she blocked it. \n\nSo again, I agree with you in part, but we are quite tired of the \"both sides\" thing.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": "No, an insurrection would be an organized, armed event. Calling it that is a gross misrepresentation of what it was and ignores the many odd occurrences of it, like that Pelosi denied more security that Trump wanted. You are perpetuating a false narrative. No one is saying what happened at J6 is good, nor that people on the right acted well in that, but an insurrection? Fuck that.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MikeyPh",
                                    "body": ">For sure there may have been a small number of confidential informants, I just can't find any credible sources on them actually instigating the riot.\n\nWhy would they admit to it. He said they were there and you can even see suspicious fed looking types in the videos.\n\n>You won't find any evidence of the 10,000 number quoted, nor any formal order to deploy them, so there was nothing for Pelosi to block.\n\nThen why [this](https://cha.house.gov/2024/3/chairman-loudermilk-publishes-never-before-released-anthony-ornato-transcribed-interview)\n\nAnd we did [Pelosi take the blame for J6 on camera?](https://www.youtube.com/watch?v=m96u5xVGm08)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "drgmaster909",
            "body": "It's always the \"Gets 700 upvotes\" that gets me.\n\nNutjobs gonna nutjob.\n\nBut nutjobs _flocking to them in huge numbers_ (keep in mind that's net-ish 700 so it could be 3700 ups and 3000 downs (the algorithm is fuzzier than that))... that's what worries me.",
            "score": 3,
            "replies": [
                {
                    "author": "BeautifulExternal943",
                    "body": "Yes! I’ve seen posts with like 16k upvotes Hyperbole of insanity They also hyjacked one of our posts -the one about Dems posting and arguing…made it into something that didn’t happen And of course the snowflakes are having a day baby!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LakeLoverNo1",
            "body": "Secret Service and DOJ should arrest and charge. That’s a felony.",
            "score": 3,
            "replies": [
                {
                    "author": "woman-ina-mansworld",
                    "body": "And don’t make it public…, find out who leaked it and arrest them as well",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "He's saying he's doing to depose Trump, that means forcefully remove. Get out of here.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Relevant-Fig7910",
            "body": "Say what you will about whoever you support or don’t support. You want change to happen, that’s why you vote, that why you peacefully protest. But these types  of actions are unacceptable and must not happen. Have your disagreements with whoever is in power, fine. But there is no justice in actions like this.",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "I agree mostly. There is eventually a point where citizens need to arm themselves against the government. The founding father believed that and that principle is foundational to what our government is. But this is not one of those times.\n\nThe left loves to look at stopping their craziness as a reason to break up. They did it in the Civil War so they could keep their slaves as anti-slavery sentiment was growing, and they're doing it now as anti-trans and anti-abortion ideology is growing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": ">Yall went from 2a no matter what to lock him up in a matter of minutes XD\n\nWe were never 2a no matter what. We always believed there are restrictions including sound ordinances and safety ordinances. And we always believed that if you commit crimes you shouldn't have a gun. \n\nWhat an ignorant person spreading stupidity.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SoParkRepublican",
            "body": "This guy should be arrested for threatening to assassinate the president.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KevSanders",
            "body": "Once you understand that the majority of the people on Reddit feel the US is on stolen land with no right to exist, their positions and actions all makes sense",
            "score": 1,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Yeah. It's so painfully stupid though. The natives fought each other and took each other's land tons before we even got there, and if Europe didn't expand first, Asia would have. They also don't get that the reason for these take overs of land is not hatred of other people, it is competition and survival. If England didn't compete with France, France would have taken them over. A large part of that competition was expansion.\n\nNo one is saying it is good, but it's also not evil to expand in the face of threats. And unfortunately, more primitive people lose out on that... but a good society will try to assimilate them in, most have just enslaved them or killed them.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lokulater",
            "body": "People are idiots",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight_Raisin_3510",
            "body": "He even got awarded smh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nimrod_Esquire",
            "body": "Can he find his way out of his parents basement?",
            "score": 0,
            "replies": []
        },
        {
            "author": "ahent",
            "body": "https://www.piratewires.com/p/the-terrorist-propaganda-to-reddit-pipeline",
            "score": 1,
            "replies": []
        },
        {
            "author": "mototramp",
            "body": "He’s just trolling lol. Is this what we say when someone says something ridiculous?",
            "score": -2,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Saying to start a war and depose the president?\n\nThe post was titled \"Americans, We The People have been summoned to DC\".",
                    "score": 1,
                    "replies": [
                        {
                            "author": "that_guy_ontheweb",
                            "body": "It almost exactly mirrors the rhetoric getting tossed around on subreddits. Reddit is literally brewing left wing terrorists.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "atomic1fire",
                    "body": "Swatting is also a form of trolling but it's still super illegal and dangerous.\n\nYou can't naturally assume someone is trolling and do nothing about it because you don't want to be the one person who assumes a troll and then find out it isn't. Same with school shooters.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low-Piglet9315",
            "body": "That's one fast way to find yourself behind bars.\nWhen it came out that John Hinckley's motive for trying to kill Reagan was to get the attention of actress Jodie Foster, a St. Louis shock jock said on the air, \"If I could get with Jodie Foster, I'd take a shot at Reagan too.\"  (Note: obviously this was before she came out as a lesbian...)   \n\nAt any rate, an FBI agent was waiting for the DJ in the station green room after his shift was over.  The DJ received a full performance of the riot act from the FBI agent, who let him know he was lucky to not get thrown in the slammer for his little joke.",
            "score": 1,
            "replies": []
        },
        {
            "author": "independentlywrong",
            "body": "I tried to look up the username",
            "score": 0,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "They're suspended. But everyone who upvoted it should be, too.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "treffmatthiesen",
                            "body": "Everyone who upvoted it should be lucky to avoid a visit from the feds.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "independentlywrong",
                            "body": "Yes, I agree",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Coast_watcher",
            "body": "Doubt he goes through with it. Internet courage.",
            "score": 0,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Agreed, but you only need one. Especially if there are probably people who could use this guy to try an encourage them to go after Trump, which it seems there are.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ivylass",
                            "body": "There's already been two attempts.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ivylass",
            "body": "u/clairenator account is gone.",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": "Yes, but they were suspended by reddit. They didn't run and delete their account... at least not at the time I last looked it up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Connorray1234",
            "body": "Where's Clint hill when you need him?",
            "score": 0,
            "replies": []
        }
    ]
}