{
    "title": "VA Crisis Line Employees Among Those Fired Amid Federal Workforce Purge",
    "author": "APerspicaciousHuman",
    "subreddit": "Republican",
    "rank": 179,
    "score": 35,
    "upvote_ratio": 0.62,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.military.com/daily-news/2025/02/19/va-crisis-line-employees-among-those-fired-amid-federal-workforce-purge.html?amp",
    "id": "1iv40w9",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low_Theory_2795",
            "body": "They fired *ALL* the crisis line employees?",
            "score": 3,
            "replies": []
        },
        {
            "author": "YoureInGoodHands",
            "body": "sharp zephyr theory aware pie office thumb books telephone nutty\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 31,
            "replies": [
                {
                    "author": "Tater72",
                    "body": "Well said, don’t forget that the media is all bad on Trump now yo drag his ratings down to try to hurt the cuts from the left.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LVDave",
            "body": "Its called \"Collateral Damage\"... Those VA crisis line people are VERY MUCH needed...",
            "score": 12,
            "replies": [
                {
                    "author": "howjoebujen",
                    "body": "The sheep will follow rhe flock.  Listen to the them baa.  I agree with you 100%.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juliusnvincevega",
            "body": "The VA doesn't save lives. They make it miserable...    most horribly staffed idiocy ever!  Im a vet, ive dealt with VA ...  \n\nThose fcks can suck my balls through my drawels..  \n\nFck those assholes!",
            "score": 2,
            "replies": [
                {
                    "author": "Dismal_Survey_539",
                    "body": "Blame the leadership that constantly guts their funding. The VA could be great with good leadership and good pay but instead they nickel and dime you guys while cutting funding every year. No respect for the vets on either side.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ntvryfrndly",
            "body": "Oh no!   Just under 2% of the people that have been working for the VA for less than 1 year have been let go.",
            "score": 0,
            "replies": [
                {
                    "author": "mickey0969",
                    "body": "Not true",
                    "score": -5,
                    "replies": [
                        {
                            "author": "ntvryfrndly",
                            "body": "Oops.  My bad.      \nJust OVER 2% of probationary employees (less than 1 year employed) were let go.       \nDamn it to hell, we are doomed!     \nDoomed, I say.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Doggoroniboi",
                                    "body": "Not sure about the va but DoD probationary period is 2 years. Not that much of a difference, but for the sake of factual details I figured I’d chime in",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Zealousideal-Top-958",
                                    "body": "let’s all laugh at the people who lost their jobs!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GodDammitKevinB",
                                    "body": "Anyone with a recent promotion is under probation.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Lower-Ad6435",
                                    "body": "Now instead of waiting for a year or so for the Va to deny referrals from my doctor for physical therapy, I'll have to wait a year and a month or two.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Coast_watcher",
                                            "body": "Deny Defend Depose right ?",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "flambuoy",
            "body": "We have to cut somewhere or we end up bankrupt. Even things that sound good aren’t worth going into massive debt over.",
            "score": -14,
            "replies": [
                {
                    "author": "odieman1231",
                    "body": "Hear yourself for just a moment. \n\nThese people save lives. The lives of people who fought and killed for this country. The people who are the literal reason you are able to even vote for DJT. \n\nBut the countries bottom line is more important to you. \n\nWild.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "flambuoy",
                            "body": "I’d like you know what services you think we’ll provide to veterans after bankruptcy.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "odieman1231",
                                    "body": "As if we couldn’t possibly find the money elsewhere.\n\nAfter it was announced the middle class and poor will pay more in taxes and the rich gets tax breaks and you are seriously asking where we could get the money? \n\nThats like you wanting to cut your budget for your family because you are overspending and instead of asking your wife not to get Starbucks everyday, you decide to not feed your kids. \n\nYou don’t ask people to put their life on the line and then screw them when they are suffering from the experience they had while putting their life on the line. We can both agree cutting spending on wasteful things but this isn’t it.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "flambuoy",
                                            "body": "Strange to argue for the absolute necessity of an “unknown number of Department of Veterans Affairs employees”. \n\nYou don’t know anything about these people, how good they were at their job, or how essential they were to the functioning of the VA. \n\nWe do know three things: we are 36 trillion in debt, have been running massive deficits for years, and some people will jump out of the woodwork to complain at each and every cut to government spending.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "APerspicaciousHuman",
                                                    "body": "The House voted to increase the debt limit by $4.5T as part of its budget plan to pay for tax cuts. Doge's actions are basically a rounding error. If they were serious about reducing the deficit, they wouldn't be planning to have an unfunded tax cut.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Timely_Froyo1384",
                    "body": "That’s not how government finances work.  \n\nWe don’t go bankrupt the masses get a Great Depression period.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "mickey0969",
            "body": "False narrative no one has been fired. They have until July 28,2025 to go back to woeiking in an office or take the severance. Also some programs that are vital will still allow work from home.",
            "score": -20,
            "replies": [
                {
                    "author": "ninjay209",
                    "body": "This isn't true at all. From the VA themselves: [https://news.va.gov/press-room/va-dismisses-more-than-1000-employees/](https://news.va.gov/press-room/va-dismisses-more-than-1000-employees/)\n\n  \nThat being said the VA has reinstated \"some\" of the fired employees.\n\n  \nOn a side note I always check the history of people I interact with, my God man, try gooning less haha.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Doggoroniboi",
                            "body": "lol you weren’t lying, dude is thirsty 😂",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CantSmokeThisJay",
            "body": "This is what we voted for. Fuck off",
            "score": 0,
            "replies": []
        },
        {
            "author": "Kooky-Succotash8478",
            "body": "Lmao",
            "score": -5,
            "replies": []
        }
    ]
}