{
    "title": "Please standby....",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 164,
    "score": 618,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 52,
    "url": "https://i.redd.it/f5yjdki4pqke1.jpeg",
    "id": "1ivqgof",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morgue724",
            "body": "They don't need a resaon anymore it is just his fault when anything they don't like happens.",
            "score": 10,
            "replies": [
                {
                    "author": "howjoebujen",
                    "body": "The sheep will follow the flock.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "IJustWantToBePure",
                            "body": "Flock all those flockers!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sir_pugalot",
            "body": "Anyone know a truly neutral news area? I know fox news is hard right and Cnn is hard left, but I can never find a source that doesn't have an obviously detectable bias in political opinion.",
            "score": 4,
            "replies": [
                {
                    "author": "Delicious-Use-8789",
                    "body": "https://ground.news/",
                    "score": 3,
                    "replies": [
                        {
                            "author": "StunningPerformance1",
                            "body": "Yep. Their ability to show both sides of the story is invaluable.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "This-Cover8851",
                    "body": "Redacted on YouTube",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 10,
            "replies": [
                {
                    "author": "Frequent-Structure81",
                    "body": "To be fair, it’s been like a month.  The president doesn’t wake up and set the price of eggs in the morning.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "villaisgorilla",
                            "body": "Then he shouldn't have ran on that platform.  To be fair, he has signed 70 executive orders but done nothing to curb the cost of living except make excuses why he can't do it.  I am only holding him to the same scrutiny and expectations that he does for his administration and staff.  We have all seen what happens to people who do not do what President Trump expects.  \n\nIf the job is too hard to do then don't make those promises.  I understand it was never going to happen on day one.  But he has done nothing to even begin curbing it.  Some might say he has made it worse.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Evan_Douglas",
                                    "body": "It should be well known by now that the majority of the \"laying flock\" in America were purged in anticipation of bird flu. Chicken farms which had no symptomatic chickens were completely purged at the direction of the inspector generals at the USDA in conjunction with the CDC. It will take about 2 to 3 months to get new chickens to mature, then the price of eggs will stabilize.\n\nWas it right or wrong to fire all of the inspector generals? Who is to say? If there really is so much rampant waste and corruption in the government, it appears the inspectors general were doing close to nothing or at worse aiding and abetting.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MamaD79",
                    "body": "Oh yeah, everything that goes wrong everywhere..... let's blame President Trump; I don't think so. I'm guessing that you're one of those people who think the lunatic lefties are correct in thinking that the plane crash in CANADA was his fault, too. Then again, I think those lunatic idiots, need to start eating their crow anytime now.  The newscaster who was interviewing the head of the FAA asked him If it had anything to do with people that President Trump fired; he said, \"Absolutely not.\" \nI can't remember what he said verbatim, but the employees were not in those positions! \n\n[Blaming President Trump for plane crashes ](https://www.newsweek.com/bakari-sellers-donald-trump-american-airlines-plane-crash-2023597\n\n\n\nIt's no secret that the lefties have no brains, but anybody with even half a brain would know that this man could not do everything overnight! He's only been in office a month and has done amazing things so far. No one should expect him to do everything overnight. If one was listening, he did say prices will spike for a minute, but then they'll go down. \n\nHave you been watching anything that he's doing with Putin and Zelinsky? Do you realize that the reason he hasn't blown Hamas to smithereens, is because he would kill our hostages as well? That's why he's accepting the way they're coming back, and they are coming back slowly but surely. \n\nHe re-closed the border, thank God. This was his first and foremost campaign promise!\n\nHe stopped the handouts to the ILLEGAL ALIENS, and that means more for citizens who need it. Some people are seeing it, and some are not yet. Getting rid of ILLEGAL ALIENS has a domino effect; for instance, if they have a farm job illegally, that's a job for one of our citizens.\n\nSpeaking of prices, locally, our gas went down a few cents on January 21st, and it's been going down. In fact, at some stations, it's gone down to a total of $0.60! \n\nYes, He's doing things at breakneck speed; maybe people just can't keep up with him and miss everything that he's doing!\n\nGood God give the man a chance to do his job.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "villaisgorilla",
                            "body": "No, I am an American!  Blue, Red, Conservative, Liberal, I am all of them. I am one of those awful people who choose to not assume I know a person based off of a Reddit post. I am one of those lunatic idiots who want to have intelligent open minded conversations with other Americans to hopefully understand and learn from a different perspective. It is assumptions and labels like the ones from your post that perpetuate the ever growing division and hate in our country. Be better!  \n\nYes, when a leader makes promises, there needs to be results. I am simply expecting the same thing he would from his own staff. If he can't do it then he should have kept his mouth shut and ran on a different platform. \n\nHe claims to be the best President in the history of the United States, but so far he is just another 10,000 pound gorilla beating his chest.    \n\nI hope he proves me wrong and he really does Make America Great Again, but so far it has just been another episode of the Apprentice.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MamaD79",
                                    "body": "Oh the funny thing is, he's doing every single thing he said he would do. He did say that there would be a rise in the cost of living for a short period, then it would go down. Like I said it's a domino effect, you'll see. He's not a stupid man and he didn't make those promises to not keep them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "uskevinmc",
                    "body": "You complained doesnt make it a story jack, get a life",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Klutzy_Carpenter_289",
            "body": "Add Reddit to that list. I’m about >< this close to leaving because I can’t stand it anymore. I don’t look at the Popular subs, no way. I only go to my chosen subs that are non-political, & a few republican ones. But tonight on r/knee replacement there was a few comments about not being able to march against white supremacists, & on r/interiordesign a post about a white wall brought on comments about Elon Musk. It’s ridiculous.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MamaD79",
            "body": "Isn't that the God's honest truth? I think if one of them had their toilet back up, spilled their Coke, their car broke down or they ate too much....they're going to find a way to blame President Trump for it! SMDH 🤦🏼‍♀️",
            "score": 4,
            "replies": []
        },
        {
            "author": "MoishaSchwarzter",
            "body": "Don't forget slate news",
            "score": 2,
            "replies": []
        },
        {
            "author": "Instr-FTO",
            "body": "Figures. Just goes with the last decade of lies and pathetic journalism",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonfire21",
            "body": "Isn't this the truth lmfao",
            "score": 2,
            "replies": []
        },
        {
            "author": "bonfire21",
            "body": "Lets do what killery and Obama said while campaigning but realized illegals could vote and left skid marks a mile long changing the position on immigration..don't make me pull the tapes if you want to fact check it i have them waiting...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Coast_watcher",
            "body": "They all fall under the umbrella network of, not TBS but TDS",
            "score": 0,
            "replies": []
        }
    ]
}