{
    "title": "JUST IN: Federal Judge Theodore Chuang Blocks Trump From Making Immigration Raids at Churches",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 141,
    "score": 102,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 86,
    "url": "https://conservativeroof.com/federal-judge-theodore-chuang-blocks-trump-from-making-immigration-raids-at-churches/",
    "id": "1ixcbu7",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "panchoJemeniz",
            "body": "Where was this judge when they were locking down churches.",
            "score": 66,
            "replies": [
                {
                    "author": "Mw4810",
                    "body": "Great point. And where are the leftists who celebrate religious institutions harboring illegals, but then wanted police to come into churches and synagogues if they weren’t wearing masks?",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "rigatony96",
                    "body": "Honestly why weren’t there any Republican judges that blocked it, seemed like a slam dunk to shut down for multiple first amendment violations",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odiemus",
            "body": "Not gonna lie… as a long holdover process regarding church sanctity… and I’m not even religious… no, you can’t do raids in churches. You can blockade them and negotiate, but no raids.",
            "score": 49,
            "replies": [
                {
                    "author": "yazzooClay",
                    "body": "yea, church raid is a bit sus tbh.  They can circle back if they need to.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "panchoJemeniz",
                    "body": "They cannot supersede federal law of harboring illegals",
                    "score": 22,
                    "replies": [
                        {
                            "author": "reamo05",
                            "body": "I'm not religious so I tend to agree that churches should be held to the same standards as everyone else. \n\nBut, a significant portion of our nation believes God's laws are the highest, followed by ours. And those are generally probably like, 80% or more Republican voters. \n\nBe interesting to see how that one plays out if the admin pushes it.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Odiemus",
                                    "body": "Churches have always provided sanctuary… and a means for criminals to peacefully negotiate their surrender. I don’t agree with illegals just using them to escape or evade police nor would I agree any protections exist for churches/clergy who break the law in aiding or abetting. But there is a long standing tradition and acceptance within western culture that a churches sanctuary is a thing that exists. Legally, no there isn’t anything enforceable, but I think most guidance still says to exercise restraint when working on sensitive areas, which includes churches. This would reasonably preclude a raid into a church, but may instead mean a cordon around a church, with presumably the church providing religious counsel before those seeking refuge turn themselves in.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BraveCranberry9863",
                                            "body": "Visions of Lon Chaney yelling “Sanctuary” while climbing to the bell tower.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CaptBland",
                    "body": "Yeah, I am fine if Churches, Mosques, Quakers, and Jewish temples are used to house immigrants",
                    "score": 8,
                    "replies": [
                        {
                            "author": "shakennotstirred72",
                            "body": "They will turn them out when as soon as the funds and donations run out. And I don't think religious organizations should be allowed any taxpayer funding. Then ICE can handle it.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Doggoroniboi",
                    "body": "I agree",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "chasonreddit",
            "body": "*ARE* they doing raids in churches?  I haven't seen it.  The only thing I have seen is people with outstanding deportation papers being picked up.",
            "score": 3,
            "replies": []
        },
        {
            "author": "not_my_real_name_2",
            "body": "Opinion here, https://storage.courtlistener.com/recap/gov.uscourts.mdd.575074/gov.uscourts.mdd.575074.60.0.pdf",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoIDontwanttobeknown",
            "body": "So legally no place of worship in America has some sort of special right to keep the government out from arrest or deportation. \n\nThat being said a lot of places in America care deeply about there places of worship and most politicians tend to avoid causing these sort of issues, even making policies in various departments saying how unless necessary they won't enter \"sensitive\" areas for arrest like churches, graveyards, or hospital rooms.",
            "score": 2,
            "replies": []
        },
        {
            "author": "et_hornet",
            "body": "Am I the only one that isn’t opposed to this?\n\nCall me a Bible beater all you want but yanking someone out of a church mid-mass because they’re here illegally mildly violates their 1st amendment rights.\n\nWait till they leave the building",
            "score": 17,
            "replies": [
                {
                    "author": "Grouchy-Capital3408",
                    "body": "They arent yanking people mid mass, its for if churches are intentionally harboring them",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Sillyputtynutsack",
                            "body": "Why would church people think doing that is Christ like?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Grouchy-Capital3408",
                                    "body": "Because a lot of church people arent christ like, such as that “bishop” if you remember her",
                                    "score": -11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ImperialxWarlord",
                            "body": "Churches have a history of doing such things. Just wait them out, the house of god is no place to be doing this.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Grouchy-Capital3408",
                                    "body": "You cant compromise with the left, as Milei said, if you give them an inch they will use it to kill you",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "cathbadh",
                                            "body": "Christianity is now \"the left?\"",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Grouchy-Capital3408",
                                                    "body": "Not real christianity, but lots of “churches” are blatantly satanic and promote abortion and gay marriage",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ImperialxWarlord",
                                            "body": "Much of the church agrees? Which church lol, there’s a slew of different sects. Why is this of all places the place this should happen? I’m all for deporting people but FFS just wait outside, churches are a place of sanctuary.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Doggoroniboi",
                            "body": "In principle sure, but what’s stopping them from just going in because they think they’re in mass? Is there a specific passage that only allows them to enter if they are harboring? Because I doubt it lol",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Grouchy-Capital3408",
                                    "body": "There isnt a specific passage but why would ICE do that? They arent just gonna barge into a church with no target and round up every mexican in there, thats some MSDNC world shit right there that just isnt real life",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aukstais",
                    "body": "So if there is a dangerous criminal who is also an illegal immigrant, you are ok to let him be in a building full of innocent people?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "pro_nosepicker",
                    "body": "I don’t disagree in general except illegal immigrants have no constitutional rights",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Josh9inty28",
                    "body": "\nSo Christian of you, they can be safe. Untill they walk outside the house of the lord. Really puts jeezus’s message into prospective",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Candyland-Nightmare",
            "body": "Honestly places of worship have no place in immigration policies. They are a sanctuary to all seeking to worship.",
            "score": 9,
            "replies": [
                {
                    "author": "Grouchy-Capital3408",
                    "body": "A criminal hiding out in an immune area isnt seeking worship",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Candyland-Nightmare",
                            "body": "I am all for deportation of anyone who doesn't belong here. I understand some may intentionally hide out in a church, but I don't believe the numbers are high enough to warrant a raid in any place of worship. I'm not religious by any means, but I do respect any house of worship for any religion. I just think that's one place they leave alone. They'll catch whomever hides eventually.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Pebbles963",
                                    "body": "Curious. How would you feel if they get on their bullhorn after church services and ask the illegal immigrants to come out of the church? Serious question.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Grouchy-Capital3408",
                                            "body": "Its not about raiding church services, its about harboring them in a basement",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Pebbles963",
                                                    "body": "Oh ok. Got it. Get them out any way.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "krayhayft",
            "body": "While I want to get rid of illegals, churches are supposed to be places of sanctuary unless there's evidence of possible dangers to others.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TruthIsSilenced",
            "body": "It's odd how the leftists hate religious people till it fits their agenda. \n\nNo, I'm religious but places of worship should not be safe from the enforcement of the law. They don't get to be havens for criminals just as nowhere should be. \n\nI'm sorry they chose to break the law and do this to themselves but the rules and laws were known and they chose to gamble. So they accepted losing.",
            "score": 9,
            "replies": [
                {
                    "author": "cathbadh",
                    "body": "OK then let's look at it from a practical standpoint:\n\nWhat will 2026 midterms look like when the Dems already have the historic advantage and ads are running 24/7 of priests being held at the point of machine guns while screaming people are dragged out of churches?  Ya think Republicans will continue with the trifecta when a church ends up burned to the ground from an errant flash bang?  The ads write themselves. How will conservative policy be implemented if we lose both halves of Congress over a minor part of immigration enforcement?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TruthIsSilenced",
                            "body": "Fair point. Some ills we must endure if we want a cure to take effect.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Business-Writer-7874",
            "body": "These activist judges can’t stop this",
            "score": 2,
            "replies": []
        },
        {
            "author": "PoppyVanWinkle_",
            "body": "Even way back when, a church was always considered a place of sanctuary, even if they don't pay taxes.",
            "score": 0,
            "replies": []
        },
        {
            "author": "howjoebujen",
            "body": "Once Trump gets the immigrants, he is coming for you.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hunter35rem",
            "body": "Illegals should live every minute of their lives like there’s a target on their backs! Go back where you came from and get off our dole!",
            "score": -1,
            "replies": []
        },
        {
            "author": "TomsServoo",
            "body": "I’m sure Tom Homan saw this and was like yeah no, we’re going where we have to. These judges are ridiculous and need to be impeached. Rule on law morons not on your political disdain, harboring a fugitive is ILLEGAL regardless of where. Ignore this order and keep going, what’s he gonna do send his bailiff into the White House to come get you? 🤣",
            "score": -2,
            "replies": []
        },
        {
            "author": "RickPar",
            "body": "I'm not sure about this, but aren't Catholic churches considered to be Roman embassies?",
            "score": 1,
            "replies": []
        },
        {
            "author": "KetoLifter21",
            "body": "Ignore it. Keep going. Activist judges are evil.",
            "score": 0,
            "replies": []
        },
        {
            "author": "TT0069",
            "body": "There will be some virtue gesturing churches that harbor illegal aliens and criminals, but it will be public now.",
            "score": -3,
            "replies": []
        },
        {
            "author": "HonoraryNwb",
            "body": "DEI judge hands down unconstitutional order. No surprise there...",
            "score": 0,
            "replies": []
        },
        {
            "author": "I-am-the-Canaderpian",
            "body": "Not just churches, but Quakers and mosques as well. Two solutions to this:\n\n1. Ignore the lower federal court’s stupid-ass decision, have Trump sign an EO to do it anyway and deem it as duties of the President, so it cannot be used in a separate court of law against him, or;\n2. Wait just off-site of the areas for worship, and screen those who come in when the person is still on public property and not church/mosque/religious ground. \n\n“No, no - we’re not preventing them from going to their places of worship. We’re making sure they aren’t using that place to shelter illegal immigrants, and since it’s off your property… nuts to you.”",
            "score": -9,
            "replies": [
                {
                    "author": "WildeBeastee",
                    "body": "1. That's dictator shit, and fascist.\n2. That's harassment and can constitute as a violation of the first amendment since Trump and ICE are the government. See point 1.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "I-am-the-Canaderpian",
                            "body": "To point 2: Then organizing a stop and search function, say, to ensure that nobody is drunk or on illicit substances would also be harassment and a violation of the right to freedom of speech and/or their right to exercise their freedom of religion?\n\nAn odd interpretation of the first amendment.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "WildeBeastee",
                                    "body": "We have freedom of religion as a right. What they do in their church is a right to the point it hits a legal challenge. Satanist protestors are a great example, they'll do displays and perform provocative acts to audit their first amendment. You couldn't walk up to someone publicly praying and terry stop because that's not legal.\n\nYour point was suggesting putting ICE checkpoints on the sidewalk to stop people going to church without a warrant or reasonable suspicion.\n\nStop and frisk, or terry stopping, is something upheld by the Supreme Court when there is reasonable suspicion or a search warrant. Stopping a drunk driver is not the same as raiding a church haphazardly. You can observe someone is drunk by lane changing, you can't tell someone is an illegal immigrant by looking at them.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "I-am-the-Canaderpian",
                                            "body": "You can also block or restrict lane movement to force people to drive through a checkpoint to observe them closely; just the notion of needing to speak to a police officer might deter someone from attempting to drink and drive (*or transport an illegal immigrant to/from religious grounds*).\n\nHappens all the time around big celebrations.\n\nLook, the examples or options I have obviously ruffled feathers - but if you feel uneasy about it, either loosen your ethical and moral boundaries for a bit, or get used to the idea of religious grounds becoming the new hill for the Left to die on (*hilariously enough*).",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "WildeBeastee",
                                                    "body": "Yes, police assist in directing traffic and depending on the state have the authority to set up checkpoints. Personally I am for it as DUI checkpoints are proven to lower accidents especially in densely populated areas like cities.\n\nYou don't get to pin transport illegal immigrants to it. The situation isn't that bad.\n\n1. I will not and cannot justify populist policy that is harmful and will target our rights as Americans. Those are the freedoms everyone keeps talking about.\n2. This relaxation is spurred on by Trump firing another ICE director, the Laken Riley Act not being as effective, and our deportation numbers not approaching the millions of people Trump ran on. This administration can't use this proposed power effectively.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fishsandwichpatrol",
                    "body": "Number 1 sounds like a terrible idea. We need to respect the courts and the process even if we think their ruling is stupid.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Grouchy-Capital3408",
                            "body": "No, oppose their ruling to challenge it and get a higher court to fix it",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "fishsandwichpatrol",
                                    "body": "Appealing and going through the process is fine, I would expect that, but don't just ignore it and order your underlings to do it anyway. That's a door we do not want to open.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Grouchy-Capital3408",
                                            "body": "You realize breaking the law to get higher courts attention has been a pretty common thing throughout this countrys history right?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "swanspank",
            "body": "So does this include murders, rapist, child molesters?  How about suspected drug dealers, armed robbery suspects?  Or are illegal immigrants more equal than others?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Iamninja28",
            "body": "At least the activist judges are making it easier for the system to figure who needs disbarment.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SuperLil1",
            "body": "Good job judge!  Some common sense! 👏🏽",
            "score": 0,
            "replies": []
        },
        {
            "author": "thorleywinston",
            "body": "AFAIK there is not legal basis for churches being any sort of \"sanctuary\" from law enforcement nor do I think there should be.  Most likely this decision will be overturned on appeal but the Trump administration should respect the ruling until that's happened.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SuccessfulRanger2024",
            "body": "The sanctity of churches and religions should not be infringed on. However professing religious devotion only to subvert the law and engage in treason against a sovereign nation IS wrong and dangerous to the innocent people in those places of worship. Naturally the most dangerous and wanted criminals are going to shelter in a church trying to blend in with the otherwise kind and friendly illegals. How do you separate one from the other? Wolves in sheep’s clothing are everywhere.",
            "score": -5,
            "replies": []
        }
    ]
}