{
    "title": "Steep Drop in Credit Scores Hits Student-Loan Borrowers. About 43% of those who owe payments haven’t resumed making them",
    "author": "Beliavsky",
    "subreddit": "Republican",
    "rank": 103,
    "score": 37,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.wsj.com/personal-finance/student-loan-payment-pause-resumes-credit-score-498763af",
    "id": "1izrg18",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "woman-ina-mansworld",
            "body": "The boomer parents will have to bail them out , then realize that the institutions have been ripping their kids off…, then say maybe college isn’t for you after all.",
            "score": 10,
            "replies": [
                {
                    "author": "Profit_Euphoric",
                    "body": "This would be a terrible idea if this goes through. 🥲",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MicahWeeks",
            "body": "Hell, if they're anything like my neighbor, who could blame them?!  He keeps getting messages that his loan has changed services and others saying it has been put in administrative forbearance due to pending litigation involving fraudulent or exploitative lending and more. He can't even tell what his pay off amount is because his balances all have shown zero due to whatever that litigation is.  Why would he pay?  For that matter, **what** would he pay?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lifeisagreatteacher",
            "body": "43%!!!!!\n\nDon’t they know the Democratic Party lost?",
            "score": 7,
            "replies": []
        },
        {
            "author": "elwappoz",
            "body": "Economist Thomas Sowell has some interesting observations about the education system and debt.  Well worth a look.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beliavsky",
            "body": "archived at [https://archive.is/n7baF](https://archive.is/n7baF)  \n  \nGood. People won't repay loans unless there are consequences for not doing so.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KetoLifter21",
            "body": "College is such a rip off.",
            "score": 1,
            "replies": []
        }
    ]
}