{
    "title": "Transgender Activists Storm Iowa Capitol as Lawmakers Debate Removing ‘Gender Identity’ as Protected Class",
    "author": "origutamos",
    "subreddit": "Republican",
    "rank": 95,
    "score": 170,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 72,
    "url": "https://www.breitbart.com/politics/2025/02/27/transgender-activists-storm-iowa-capitol-as-lawmakers-debate-removing-gender-identity-as-protected-class/",
    "id": "1izxfiu",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdamJMonroe",
            "body": "It's ok because they all just ran into the ladies' room.",
            "score": 15,
            "replies": [
                {
                    "author": "cajundaegoes2",
                    "body": "🤣🤣🤣🤣",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lopsided_Vacation_29",
            "body": "Just wait a few weeks. Their USAID $$ will dry up.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Left_Macaroon_9018",
            "body": "These February 28 rioters should be locked up",
            "score": 41,
            "replies": [
                {
                    "author": "origutamos",
                    "body": "Same treatment as the Jan 6 rioters. Remember the left said \"nobody is above the law.\"",
                    "score": 18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BrandDC",
                                    "body": "J6? After 4 years in prison.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "BrandDC",
                                    "body": "Pardoned after serving four years, some held under bogus charges.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MoisterOyster19",
                    "body": "INSURRECTION!!!!",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "v1nesauce",
            "body": "What exactly do these people think they'll accomplish with this, aside from inviting more hate and disgust in their movement?",
            "score": 11,
            "replies": [
                {
                    "author": "MonstersandMayhem",
                    "body": "Narcissists rarely think beyond how things impact themselves.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "deadrory",
                            "body": "So they are narcissistd for no rolling over and letting bad things happen to them? Your rhetoric sounds like that more akin of a narcissist.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "MonstersandMayhem",
                                    "body": "Theyre narcissists for being more interested in self righteous virtue signalling than real action. Career protestors accomplish nothing but intergroup activist cred(read: nothing). There are people going through recourse that ACTUALLY gets results, audiences with representatives, legal pursuits, but if youre more interested in blocking traffick or storming the capitol, dunno what to tell you. People who make actual change rarely make headline news.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "MonstersandMayhem",
                                                    "body": "K, have a great day.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "True_Grocery_3315",
            "body": "Insurrectiony",
            "score": 27,
            "replies": []
        },
        {
            "author": "No_Corgi7272",
            "body": "so, its not an insurrection when they do it?",
            "score": 17,
            "replies": [
                {
                    "author": "Imyourhuckl3berry",
                    "body": "As someone else here said it’s (D)iffrent",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Human_Substance_2109",
            "body": "The only class that needs protecting is the American citizen. Period. End of story. Not your race, religion, sexual orientation, what you identify as. Etc..",
            "score": 6,
            "replies": []
        },
        {
            "author": "krayhayft",
            "body": "How about we get rid of the entire concept of \"Protected Class\".",
            "score": 37,
            "replies": [
                {
                    "author": "WildeBeastee",
                    "body": "Why?\n\nWithout a protected class you could discriminate against anyone. The only thing it enables is the right to sue someone for discriminating against your identity. You can still fire, evict, or refuse service on any other ground,.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "SirLongwood-ThePenal",
                    "body": "All for that one. No class should be protected with exception of certain disabilities like blind, or disabled veterans, and not even all of those.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rhubarb5090",
            "body": "And they wonder why they are shown in such a negative light….maybe it’s the oh idk terrorist threats they make to these officials??",
            "score": 6,
            "replies": [
                {
                    "author": "pow-erup",
                    "body": "are the terrorist threats in the room with us? tf are you on.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Rhubarb5090",
                            "body": "https://youtu.be/1mGYm-VOAwQ?si=hX8TFRedQDsQF-AC This contains footage of transgender activists THREATENING to make their city unsafe. \n\nAccording the Oxford Languages: a terrorist is: a person who uses unlawful violence and intimidation, especially against civilians, in the pursuit of political aims.\n\nAnd according to the FBI. A federal branch of the government: the unlawful use of force or violence against persons or property to intimidate or coerce a Government or civilian population in furtherance of political or social objectives.\n\nYou cannot tell me that what these people are saying in that video is NOT the definition of terrorism\n\nEdit: i dont know how to grab specific timestamps for which i deeply apologize but the time to look at is 3:42 of the video",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "pow-erup",
                                    "body": "dude, that video isn't from or about this protest. it's almost two weeks old, and this protest was within the past 24 hours. \n\nwith that argument, any protest is \"intimidation\". if you don't want protests to take place in the state houses, just say that, but don't come at it from a backwards ass way. Republicans and MAGA are guilty of the same shit bffr",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Rhubarb5090",
                                            "body": "Dude are you suffering brain damage? Its not the protest that is the problem, freedom of speech is a protected right, is the direct threat to safety made by these people who were ALSO protesting. Whether or not a threat of terrorism was made in THIS protest does not reduce or remove the fact that a threat of terrorism was made during a protest from this group of people.\n\nEdit: Protest all you want, it’s your right, but DO NOT threaten people in the process of doing so. That is not and has never been ok",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "pow-erup",
                                                    "body": "that's marginalizing asf. you can't justify your destain for a large group of Americans bc of the few. \n\nIm already 90% sure ik what you're going to say so here is my counter - I don't hate Republicans, I don't hate moderates, I don't hate conservatives but I will argue with it bc i think its wrong majority of the time, I hate MAGA as an organization. they're built on the hate of minority groups and are based in white supremacy.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Rhubarb5090",
                                                            "body": "You can suddenly read minds? I never indicated or believed you hated anyone. Do I believe you are incredibly foolish? Yes but that’s my opinion and only influences my judgement. I feel like you are deflecting from the fact a threat WAS made against a city by protesting transgender activists, with video proof but instead of acknowledging it you continue to attack my stance like that somehow makes what they said less of a problem. Is MAGA doing some insane things? Unfortunately yes and frankly I wish they would throttle back but we’re here now and no amount of grandstanding or tears will stop them. They are on the warpath. Do I hate transgender people? No. Do I wish that the loud minority of them would shut up and let the vast majority of them live in peace? Yes.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "pow-erup",
                                                                    "body": "Lmao, I wish I could read minds. I provided my counterpoint based on my pretty reasonable idea that you could've turned \"Republicans and MAGA are guilty of the same shit too\" back on me and used the same stance that I was using. \n\nI definitely do see how you came to your conclusion, but I still stand by the marginalizing point. ALSO, I dont know if I'd call it a terroist threat as much as something like intolerance to intolerance; however, I'll admit a little bit bias is showing in that point. I do see how you got there, though. It doesn't sound good. But for an additional example, the border Czar recently promised to \"bring hell to Boston.\" Do you take your same stance of terrorist threats here? bc to me, they seem like the same thing.\n\nOut of curiosity,  someone else commented here that we should remove the protected people alws all together. Do you think that we should do that? and if so, how would you recommend it, or how do you think that we stop discrimination from continuing to occur? bc, to me, as long as the faaaaaaar right continues to advocate there will always be discrimination.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Rhubarb5090",
                                                                            "body": "thank you so much for being patient, I am home, computer is fired up and I am ready to answer your questions. \n\nso, without any context to \"bring hell to Boston\" I would treat like a person in a halo lobby telling me they're going to kill me. With a quick Google search I feel that it is not considered a terrorist threat, least in the context I'm seeing. It appears to be aimed at the legislation of Boston less so the city itself, but I could be very wrong and there is more to the story that changes the context. it also takes on a different meaning coming from a person in power vs a regular citizen. Example: Putin saying \"we will attack America\" vs some Russian citizen saying the same thing. same words but the implication is vastly different. I feel like that can be applied but again that is just my take, and I very well could be entirely wrong\n\nContext for my answer: [Trump’s border czar vows to bring ‘hell’ to Boston over immigration policies | GBH](https://www.wgbh.org/news/local/2025-02-24/trumps-border-czar-vows-to-bring-hell-to-boston-over-immigration-policies)\n\nto the second question of the protected people's laws let me preface this by saying in a perfect world everyone would be on a level playing field where one group being protected over the other shouldn't be a thing and everyone is equal, but I concede that this is not how things have gone. My stance on such laws from the research I have done. No, I do not believe they should be removed as they still function as originally intended. now there are people taking advantage of them, but this is true of any system built to aid those who cannot aid themselves",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "pow-erup",
                                                                                    "body": "I can for sure agree with the context of a citizen vs. a politician. However, I do still perceive Hoffmans quote as a threat even if it's directed at the laws and not necessarily the people. Mainly because legally, he has no justification to say or do anything as police departments are not legally required to assist ICE or its operations. I think the point at which I'd be okay with it is if Boston police were arresting ICE agents or outing them to the public; direct obstruction, you know. But at this point, all they've done, as far as i know, is refuse to take part in ICE operations which their prefectly allowed to do.\n\nOkay, I'm glad we can agree that discrimination does still exist. Who do you think is taking advantage of these systems? The whole reason I aksed is bc, just from personal experience, I find that a lot of right leaning people, not necessarily you or anyone you're associated with, either refuse to accept that it still exists (direct from my own family's mouths as theyve tried to convince me that there isnt prejudice anymore) or they are a part of the issue. I'm from the midwest, so I mean ofc I gotta bring that we literally just had ACTUAL swastika flying Nazis in Cincinnati.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "pow-erup",
                    "body": "as long as anti-discrimination laws remain in place, idk if they really gaf if you support or acknowledge it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DS8234",
            "body": "So it’s ok for the left to storm political buildings now? No jan 6th outrage type of stuff? What a joke lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "BayBel",
            "body": "Omg I wish I could have seen that. All the he-she’s running up the steps. Hysterical.",
            "score": 3,
            "replies": []
        },
        {
            "author": "pm_me_ur_anything_k",
            "body": "“Transurrection”\n\nLolol",
            "score": 2,
            "replies": []
        },
        {
            "author": "roynoise",
            "body": "February 28!!! February 28!!! Oh the humanity!!! We'll be talking about this nonstop for at least one election cycle!!! February 28!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "TT0069",
            "body": "🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "ahent",
            "body": "MSM didn't cover how nasty these people were. They were so loud they were trying to disrupt subcommittee meetings this whole week. They keep saying no one wants this because barely anyone speaks in favor of it in the meetings, however, I know some folks that were at those meetings (legislators and citizens) and the crowd and the subreddit for Iowa was very threatening to them. One of the legislators had his wife's work info doxxed on the sub, she's a teacher. It's crazy.  None of the MSM that I have seen, so far, have covered the detransitioner who came out to speak in favor of these changes. Their opinion and views should be something people would want to hear because they were on both sides of this issue in their lives. These folks live on Reddit and think they have the majority because of the echo chamber effect but in Iowa the Dems control 30% of the Senate and I think even less of the House. Source, I live here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nsfw_ever",
            "body": "The whole disabled vets thing is a huge scam. I feel really bad for the ones that need it. So many people take advantage of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable-Pair-3840",
            "body": "This is the first time they are not protesting for an intifada and to destroy Israel. Let me take that as a win.",
            "score": -1,
            "replies": []
        }
    ]
}