{
    "title": "Don’t forget: Trump is not the first U.S. president to lash out at Zelenskyy for being ungrateful",
    "author": "iLoveFortnite11",
    "subreddit": "Republican",
    "rank": 91,
    "score": 49,
    "upvote_ratio": 0.56,
    "num_comments (reported by reddit)": 54,
    "url": "https://www.nbcnews.com/news/amp/rcna54592",
    "id": "1j0kuwp",
    "selftext": "https://www.nbcnews.com/news/amp/rcna54592",
    "comments": [
        {
            "author": "Viper079",
            "body": "I love how because the optics were far from desirable, to some, that it doesn’t mean Zelenskyy hasn’t done this before already. He did it to Biden and he literally insulted Obama and Biden in the Oval Office about not supporting enough.\n\nIt’s near comical when I read people’s opinions, that are so diehard to go fight Russia head on yet even the Europeans are very reserved on such an action. I wonder why? As if it wasn’t obvious enough… 🤔\n\nSome of you, I swear, when I read these comments, you think war is like Call Of Duty…I may be a civilian but I have many veteran friends. This is something we do not want to do. I’d take whatever diplomatic attempt that works over the idea of war.",
            "score": 45,
            "replies": [
                {
                    "author": "Lower-Ad6435",
                    "body": "Those who yearn for war should be sent to the front lines.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LowFlowBlaze",
            "body": "> While Trump berated Zelensky in front of a worldwide television audience, he’s not the first president to get into a spat with Zelensky as his predecessor had a similar exchange with the Ukrainian leader, however under far different circumstances and in a much more private setting.\n\n> NBC News exclusively reported in 2022 that Biden lost his temper on a phone with Zelensky soon after Russia’s invasion. According to NBC News Biden had called the besieged leader to tell him that he had just greenlit another $1 billion in aid to Ukraine. Before Biden could reportedly even finish his sentence Zelensky began firing off a list of additional help he needed and wasn’t getting at the time. Biden reportedly quickly lost his temper, sources familiar with the call told NBC News.\n\n> Biden administration officials told the outlet that Biden and Zelensky’s relationship only improved since that June 2022 phone and never rose beyond Biden losing his temper.\n\nhttps://www.the-express.com/news/us-news/165107/bidens-furious-phone-call-zelensky/amp",
            "score": 13,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "Extremely rare Biden w",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Crying_Viking",
                            "body": "Even a stopped clock is right twice a day",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "squirrelfoot",
            "body": "Obama did nothing whatsoever when Russia took the Crimea, Biden gave Ukraine enough support to keep fighting, not enough to win, and now Trump is ending a war effort which wasn't in the interest of the Ukranians as it was just a long, bloody and incredibly destructive defeat. Biden's administration used Ukraine to bleed Russia, there was never any serious attempt at ensuring Ukraine could win. Ukraine has no reason to be grateful to us. \n\nRussia has always been seen by Americans as the enemy, but that's not how Trump sees things. We are currently shifting support away from our traditional allies, so it's not astonishing we are getting closer to Russia. They are an oligarchy, something the US has been moving towards with the growing power of our tech giants. We saw the power of tech leaders behind Trump when he was elected, and Elon Musk's review of government finances underlines it. By electing Trump, we chose American power and economic succeess over traditional democracy. Friendship with Russia is a natural extension of that. \n\nRussia will be able to slowly expand its power and influence in Europe because European powers have not bothered to maintain an effective defence force, but have expected the US to provide their protection for free.",
            "score": 17,
            "replies": [
                {
                    "author": "jrs1982",
                    "body": "Obama did sanction them in regards to Crimea. Problem is a bunch of European countries then took the opportunity to buy oil from them at a reduced price. No matter what we do we are the bad guy to our European allies.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "LordIzalot",
                    "body": "I think something you said here is interesting.  Moving to an oligarchy is what we knew we were getting when we elected trump.  I dont think enough people understand what oligarchy means and we should have a large conversation on it.  I kind of feel we have been moving in that way for a while but now it is just in the open.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Constant_Growth5751",
                    "body": "Yes. Zelenksy openly called out every president since 2014. Obama, Trump, Biden, Trump.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Nebraska716",
                            "body": "As he should have.   A US presence in Ukraine would have avoided this entire conflict.   And would have been much less expensive.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "LurkerNan",
                                    "body": "And once again, it’s not our job, it’s never been our job. It is literally Europe’s job because it’s on Europe’s doorstep, not ours.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lakrfan247",
            "body": "So this is just all libs and never Trumpers now, frickin Reddit.",
            "score": 14,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MikeyPh",
                            "body": ">Blind support helps in no way\n\nNor does blind opposition. You are lying here. You are arguing as if everyone here is always on board with Trump. The vast majority of us call balls and strikes and I have heard many of us call strikes when Trump has messed up.\n\nBut to people like you, support is binary, either you support the person or you don't. That is not how reality works. I support him generally, but not on every decision he makes.\n\nStop with this pathetic absolutism.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 6,
            "replies": [
                {
                    "author": "iLoveFortnite11",
                    "body": "Doesn’t Belgium have a bunch of seized Russian assets they can use to pay for the war?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "fartyunicorns",
                            "body": "Absolutely they should use those assets but the US also has some frozen assets. I don’t understand why no one has just seized them to pay for the war",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Elbowmacncheese514",
                    "body": "Russia took parts of Ukraine while Biden was in office. Now Trump is left to try to reach a peace deal. As opposed to Biden who would’ve continued to try and funnel taxpayers dollars to an entitled and ungrateful country. \n\nWhy should it be done on a private phone call as opposed to in front of the media. We’ve been calling for government transparency and here it is!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "iwasuncoolonce",
            "body": "Good find",
            "score": 4,
            "replies": []
        },
        {
            "author": "Honest-Guy83",
            "body": "I just seen a post on r/europe talking about brave Zelensky was for standing up to the mean bully of Donald Trump. 😆😆😆",
            "score": 4,
            "replies": [
                {
                    "author": "CodyJKirk",
                    "body": "I'm starting to hate Europeans because they simply don't realize there is NO defense against any attack without the US in Europe their own countries won't even spend money on defense. The US has to BEG them to increase defense spending. Like a country a whole ocean away has to convince you to defend yourself? But now you're going to talk trash about the US because we're tired of giving out money. Grow the fuck up realize you cannot win the war and bargain. I agree with Trump \"you don't have the cards\" because they don't. Europe won't help them win, we see that. Ukraine relies on the US.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Crying_Viking",
                            "body": "Use it as a retort when they start bleating on about how great their “Universal Healthcare” is: maybe if they paid for their own security , they wouldn’t be able to afford it?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Honest-Guy83",
                                    "body": "Hahaha that’s a really good retort 😆",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "F2007KR",
                            "body": "They are truly the most ungrateful, entitled vassals to have ever existed.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nebraska716",
                    "body": "What else would you call what Trump did?   It was super unprofessional.   The insults should have been saved for a private phone call.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Honest-Guy83",
                            "body": "It’s called being a strong leader. Trump was very clear that he is looking for peace not continuing to fight Ukraine’s war for them. I’d have to agree with him on that. We shouldn’t continue to fund the Ukraine war.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "Viper079",
                    "body": "So when you going to volunteer? You sound eager. They are currently conscripting ages 25 and older.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "WildeBeastee",
                            "body": "I have no idea why you're responding with a loaded question.\n\nProblems of this scale cannot be resolved with a single action or life. It is a war that's been going on for a decade between a dictator and a member of the UN. Also, an EOP through NATO. The reason we give them money is so we don't need to send US troops to the Ukraine and Russian border.\n\nWhat Trump is suggesting is that we embolden imperialism. Which is undeniable given he wants us to take Greenland, Panama, and Canada apparently. Also, his constant support of Israel.\n\nThis is a decision of if protecting their border requires US intervention or if peace negotiations will swing in either direction. Putin is in a bad spot to be considered a trusted leader.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Viper079",
                                    "body": "First off it’s not a loaded question. Answer my question please. If not then don’t respond back to me. That’s fine too.\n\nYou’re conflating optics of a diplomatic meeting that occurred in front of cameras (which is rarely if ever seen) with that of no solutions of your own. Other than continuing to support Ukraine financially. That’s been your only talking point. Oh, and accusing Trump of being, “imperialistic” by creating a business partnership with Ukraine for rare earth minerals.\n\nEven with all the money received they have resorted to the lowering of conscripting age. Eventually, you won’t have enough people healthy of age to fight. The goal is to keep Ukraine intact (minus Crimea) and get Russia to withdraw.\n\nSo, I will assert that the evasive options for Ukraine are the only viable option you got in your arsenal. Until you provide a proper remedy that clearly you have over Trump and his cabinet.\n\nThis whole event is far from over. Gotta stop overreacting. Zelenskyy will be back. He has no choice.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dkglitch82",
                    "body": "I remember Schiff making up a whole script about what was said regarding that conversation.\n\nIs 500 billion enough? A trillion? Just wondering when you turn off the spigot. \n\nZelenskyy went back on the mineral rights deal to create peace and that's what led to the blowup.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ProblemSolver72",
                    "body": "Womp womp",
                    "score": -1,
                    "replies": [
                        {
                            "author": "ProblemSolver72",
                            "body": "They got conquered, lost land, time to face facts and end it. Get over yourself",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SoBasso",
            "body": "I agree that Zelenskyy hasn't been forthcoming enough with his gratitude for all the aid he is receiving, also from Europe. I also think he didn't handle himself particularly well during the exchange, but he was being attacked quite viciously by a bunch of people who clearly wanted to ingratiate themselves with the big man, in other words: kiss ass. \"Why don't you wear a suit?\" I mean seriously. The world is watching my guy.\n\nHowever, for Trump & Vance to throw a hissyfit like that in pain view of the world is extremely embarrassing. If the world stops looking up to the US you now know why. Soft power is a thing America! Trump is throwing fistfuls of it away right now and isn't easily won back. That's permanent damage imo.\n\nI think Vance was shrewd with his \"litigate the matter in front of the press\" and he did Trump a favour there. Trump was a disaster from start to finish.\n\nRight now I give Trump the benefit of the doubt on domestic policy. Internationally its a unmitigated disaster.",
            "score": 3,
            "replies": [
                {
                    "author": "CodyJKirk",
                    "body": "You say this but Europe has no defense against anything without the US so screw Europe then. We're tired of wiping everyone's ass and getting nothing for it. Pay for your own defense and return some money to us too. It's not post WW2 anymore. Your economies are rebuilt and it's time to start paying up.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SoBasso",
                            "body": "That's fair and that's happening. \n\nNot a reason to leave Ukraine hanging though. But it seems that what Trump wants his legacy to be.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fckafrdjohnson",
                                    "body": "If it was happening they wouldn't be left hanging without our support, but they are.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CykoticXL",
                    "body": "Who gives a shit if the world looks up to the US? lol the world will still continue going to the US for their aid and support",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SoBasso",
                            "body": "Isn't that the whole point of Trump's foreign policy, that they won't?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "CodyJKirk",
                            "body": "Exactly they beg for money left and right for aid. I wonder what they would do if they stopped getting it. I see that with Zelensky. Cries like a baby. I see everyone mad at the meeting at the oval office but no one is mad that the whole of Europe won't even fund its own defense let alone lend more money to Ukraine.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FileStrict2957",
                    "body": "Did you actually watch the video. It was Zelenskyy that had the hissy for fit.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thebackbone12",
            "body": "\nI believe the last administration just bowed down to anything he wanted, and it became an expectation for him and that’s why he comes across ungrateful",
            "score": -2,
            "replies": []
        },
        {
            "author": "FileStrict2957",
            "body": "He's done it constantly. Most people have not watched the whole video. He's like an entitled child. He's no diplomat. You don't use a press conference to try an argue your case to the public and press. That should be done in private. He was there to sign a mineral deal and had no intention of doing so. He just wants to keep doing the same thing years on end costing money and lives. If anyone looks at it realistically, unless there's a cease fire, Russia will keep on fighting. And if there's no cease fire you can't even begin to negotiate. Zelenskyy has made it clear that he wants all the captured territory back. Let's face it, its not happening. And who's going to make Russia give it back. Obviously nobody. So grind away. It's sad. I do respect Zelenskyy, but as Trump said he doesn't have the cards.",
            "score": -1,
            "replies": []
        }
    ]
}