{
    "title": "Texas lawmaker proposes bill to ban gender transition treatment for everyone, including adults",
    "author": "hispanicvotesmatter",
    "subreddit": "Republican",
    "rank": 75,
    "score": 106,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 79,
    "url": "https://www.foxnews.com/politics/texas-lawmaker-proposes-bill-ban-gender-transition-treatment-everyone-including-adults",
    "id": "1j0tulc",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baller-Mcfly",
            "body": "If someone wants to cut their dick off, let them. Just don't use my money to pay for it.",
            "score": 11,
            "replies": []
        },
        {
            "author": "v1nesauce",
            "body": "Eh. Adults can do whatever they want to themselves (as long as it doesn't hurt or negatively influence anyone else). Going to a therapist would probably be more cost effective than transitioning but what do I know. As long as my taxes aren't going to that shit.",
            "score": 34,
            "replies": []
        },
        {
            "author": "ddx-me",
            "body": "Once people turn 18 years old and can rationalize a decision, they have the right to modify their body including tattooing and getting testosterone",
            "score": 96,
            "replies": [
                {
                    "author": "YoureInGoodHands",
                    "body": "marry alleged square like smart jeans nine rob touch price\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Lakrfan247",
                    "body": "So if an 18 year old wants a surgeon to remove an arm that’s all good.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "incoherentpanda",
                            "body": "Ah, but then, if it's about preventing someone from hurting themselves, then who decides what is harmful? What about drinking alcohol, inoculations, overeating, eating spoiled food, or risky behavior like extreme off grid camping?\nThat's actually my issue with free speech. Who decides that one word is a nono word vs another one?",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Lakrfan247",
                                    "body": "The answer is that’s not all good, there is something very wrong with someone’s brain if they want to remove their perfectly healthy arm. They should be treated by a psychiatrist. It would be unethical for a surgeon to perform that operation.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Ph4antomPB",
                                            "body": "I agree with that. What I’m saying is, if a legal adult wants to ruin their life by chopping off their arm for no reason, they should have the legal right to do so. I am by no means saying I support this action though.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Lakrfan247",
                                                    "body": "I don’t believe as a society we should allow crazy people to harm themselves just because they’re over 18.  More so a doctor with no mental disability should never agree to do this.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Ph4antomPB",
                                                            "body": "I agree we shouldn’t. I just don’t think it should be illegal because it will give the government a lot of power in deciding what is considered “harming yourself” and therefore including that in the ban. I think we should be more focused on expanding mental health access instead of trying to ban things, since it isn’t solving the underlying problem",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Substandard_Senpai",
                                            "body": ">It would be unethical for a surgeon to perform that operation.\n\nAgreed, but laws for the people shouldn't deal with ethics.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "TrevorsPirateGun",
                                            "body": "Exactly",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "falconguts",
                                            "body": "You asked a disingenuous question about personal liberty and rights and got the correct answer. This is a republican subreddit.\n\nYou’ve then gone off and immediately started talking about ethics and mental health.\n\nIf a person wants a healthy arm removed, they have the right to seek it. That doesn’t  translate to a right to provide that will inherently force a care provider to cut off an arm on that basis alone by infringing on a care providers own personal liberty and rights.\n\nThose are unequivocally not the same thing and it’s disingenuous to even suggest they are.\n\nLikewise a care provider is likely to do exactly what you suggested, recommend a 72 hour for psychiatric evaluation. But even that does not infringe on the person right to seek the arm removal.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Banjofencer",
                                            "body": "By that argument, there is also \"something very wrong with someone's brain\" if they want to mutilate their sex organs and risk infection, never having an organic again, etc as well as screwing up their bodily functions by taking hormones.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Ph4antomPB",
                                            "body": "How? If a legal adult wants to potentially ruin their life, that’s their decision. I never said I agreed with it.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "howie47515",
                                            "body": "How",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SirWompalot",
                            "body": "Yup. Look up trans-abled people.\n\nPeople have a right to be lunatics and harm themselves.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CalmHabit3",
                                    "body": "No doctors will amputate a working arm or leg ",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "geogiam2",
                                            "body": "How naive! If course such Doctors exists. Just give them gooood money.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pro_nosepicker",
                            "body": "That’s a bad analogy",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "thelingletingle",
                            "body": "If they find a surgeon that will do it, sure. Then two brain dead people can make a deal and we let Darwinism run its course.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ddx-me",
                            "body": "That is indeed a challenging situation since arm removal has major irreversible repercussions whereas meds are a lot easier to reverse. Would want to make sure all reversible things are addressed like depression or coercion",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Lakrfan247",
                                    "body": "It’s not challenging, if someone wants to remove a perfectly healthy arm they’re clearly suffering from a psychological condition.  It would be unethical for a surgeon to do the operation.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wafflehabitsquad",
                            "body": "This is a terrible comparison.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EnricoDandoloThaDOV",
                    "body": "It's interesting the way that we simply assign some mystical decision making quality on 18 year olds, as if a person who is 16 or 17 is somehow markedly different in this area. Requiring young people to wait until they've already experienced puberty just implicates more procedures in the future should they choose to transition. For me, that seems like a much less favorable outcome for all involved",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Practical-Map9975",
                    "body": "I agree, but I'd raise the age to 21. Technically 25 would be netter (when brain is fully developed).",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "ddx-me",
                            "body": "But I can still join the military, smoke, and vote at age 18.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "ddx-me",
                                            "body": "But it's about all people, not just kids. Straight from the article: \"A Texas state lawmaker introduced legislation that would amend the state's ban on gender transition...to **also apply to adults in the Lone Star State.\"**",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "ddx-me",
                                                            "body": "It misrepresents my whole point, which is banning gender transition to all people, including young adults who can choose to vote, join the military, and adults over the age of 25 (you even edited your statement from 21). I never mentioned people under the age of 18 when they are legally minors",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "iLikeSmallGuns",
                                            "body": "You can’t take away adult freedoms just to protect kids. Parents should protect their kids, not rely on the government to hold their fucking hands and wipe their asses 🙃",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LordIzalot",
                                    "body": "Can't drink because you not old enough for that responsibility/s",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Expert-Gur-1270",
            "body": "The party of small government is calling from inside the house.",
            "score": 34,
            "replies": []
        },
        {
            "author": "im_not_bovvered",
            "body": "Aren’t they also trying to ban mastectomies and vasectomies??",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ph4antomPB",
            "body": "Cringe. Once you’re 18 you should be able to do whatever the hell you want to your body",
            "score": 34,
            "replies": [
                {
                    "author": "not_my_real_name_2",
                    "body": "Except drink alcohol...",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "TeaBaggerBoy",
                    "body": "Sure but you can’t then claim you are ACTUALLY the opposite sex then you are biologically and expect people to affirm that delusion.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Ph4antomPB",
                            "body": "I agree with you. I never said I did agree with it, but rather people should have the right to do what they want to themselves as long as it doesn’t harm others",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DialPlumeria",
                    "body": "So if you want to remove your eyes you should be able?\n\nLook up that woman that went on Dr.Phil after she threw Chlorox in her eyes because she wanted to be blind",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "BraveCranberry9863",
            "body": "If an adult wants an addadicktome or a putatwatinme that is fine. Just keep it away from children.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pugs-and-kisses",
            "body": "Just a reminder that lots of bills are introduced, very few ever pass.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dryfishman",
            "body": "Gender transitioning is wrong, but we shouldn’t get to decide what adults do.  We don’t have to pretend with them and indulge in their make believe fantasies, but we shouldn’t stop them from altering their bodies. \n\nIt’s much different for children. Many children are being raised by insane parents who are encouraging their children to transition for their own virtue signaling purposes. Kids brains are not fully developed yet and they should wait until they’re out from under their parent’s influence to make such a decision. But adults can do whatever they want to their own bodies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlBundyJr",
            "body": "Suicide Reduction Act.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuccessfulRanger2024",
            "body": "Adults should be able to do what they want but they need to ban allowing insurance to cover any surgery, scripts or treatments. Those costs get passed on to the rest of us insured.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emotional-Hope7398",
            "body": "Good. Bring religion back into government! The founding fathers would be appalled at what is happening now!",
            "score": -22,
            "replies": [
                {
                    "author": "Substandard_Senpai",
                    "body": "This doesn't have to do with religion.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Most_pdf",
            "body": "LFG!",
            "score": -1,
            "replies": []
        },
        {
            "author": "DialPlumeria",
            "body": "Good.\nCutting off good body parts should be illegal.\n\nLook up meat pocket and get traumatized, they remove the male member and make a hole that NEVER heals...some rot...\n\nWhat people are doing to themselves should be illegal",
            "score": -1,
            "replies": []
        }
    ]
}