{
    "title": "'You Don't See All The Things That Led Up To This': Rubio Defends Trump ...",
    "author": "BrandDC",
    "subreddit": "Republican",
    "rank": 86,
    "score": 0,
    "upvote_ratio": 0.38,
    "num_comments (reported by reddit)": 27,
    "url": "https://youtube.com/watch?v=P4MzGljlpr8&feature=shared",
    "id": "1j1vc96",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrandDC",
            "body": "Zelensky was performing before a live audience. Marco spills the proverbial tea.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Coast_watcher",
            "body": "If a big Ukraine supporter like Lindsey Graham can react like that after, some foreign visitor done fucked up.",
            "score": 4,
            "replies": [
                {
                    "author": "squirrelfoot",
                    "body": "Lindsey Graham is, first and foremost, a big supporter of president Trump. He follows the leader.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "oliverlmx",
            "body": "I get this administration’s idea of building a bridge for negociation with Russia. I also think the change of tone and tactics is strong enough to maybe give results.\n\nWhat i don’t get is:\n\nA. The fact they think that for this to work they don’t have to sell this idea to Ukrainians. They’ve only been antagonistic with Ukraine on this matter. If the table is US and Russia its not going to do anything. When i hear the president its seems the peace plan is to give Russia what it wants and for Ukraine to give up. Maybe if he would sell it better to Ukrainians, Zelenski would be forced to accept? Right now they must think the US sees peace only happening through capitulation.\n\nB. Why does this admin does not seem to think Ukrainians are 100% morally right in their defense of their full sovereignity the same way Israel is? I think Israel is completely in its right and i don’t see why Ukrainians would not be.",
            "score": 5,
            "replies": [
                {
                    "author": "AzureWra1th",
                    "body": "A. Yes, one large part of a ceasefire deal would be some loss of land by Ukraine. This however, is better than Ukraine as a whole falling due to an eventual lack of manpower or the start of WW3 because of NATO troop mobilization in the Ukrainian/russian front\n\nB. It’s not about who is morally right or wrong. Trump can’t say whether he thinks Zelensky is in the right or wrong- that would potentially ruin relations with Putin and make a ceasefire deal much harder to initiate. Also, in the case of Israel and Pakistan- neither is a major world power, much less a nuclear power. The issue with this is we are playing with Russian imperialism and Nuclear war, we have to be much more careful.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "oliverlmx",
                            "body": "I agree with the Ukrainian having to give up land. Also think that for this to work they won’t get any justice. But the Trump admin should at least try to sell them the idea of this new shape of peace and explain to them how this mineral deal is a kind of security garantee. That this is win-win-win for Ukraine, Russia and the US.\n\nThat’s what i mean by ‘selling them the idea’. Peace won’t happen by building a bridge with Russia if you burn the one with Ukraine.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "AzureWra1th",
                                    "body": "Ah yeah. That I do blame on Trump and Vance- they should have been more effective in communicating their idea. Their idea/plan is solid, but it’s either that it wasn’t well communicated or Ukraine is completely shut off to the idea",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AccordingStop5897",
                                            "body": "Tuesday, the media, the U.S., and Ukraine government officials said they agreed to a deal. Can't blame Trump. He thought they were they to sign a deal. Zelensky appealed to the American people, saying he wanted to be in NATO even after Trump said that it was off the table and why it took the last 2 weeks to negotiate a deal.\n\nhttps://www.reuters.com/world/zelenskiy-plans-travel-us-meet-trump-minerals-deal-sources-say-2025-02-25/\n\nIf that source doesn't work, CNN, FOX, NPR, BBC, Barrons, Bloomberg, AP, ABC, and NYT reported that they were there Friday to sign an already agreed to deal.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AzureWra1th",
                                                    "body": "Yeah, Zelensky has skirted past signing deals similar to this multiple times in the past, this isn’t a first time thing, it’s just the first time it’s aired live.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Morkava",
                            "body": "https://preview.redd.it/1igb0wt60cme1.jpeg?width=1170&format=pjpg&auto=webp&s=ca7dae3d4b632616f41c71e9a4229c0b68412f33\n\nDude, changed your mind recently?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Open-Barnacle-9210",
            "body": "Great job by Rubio. CNN is garbage and he crushed it. This is simple for a negotiator like Trump. Talk to Putin. Get him to the table. Which likely he has done. Sign a mineral deal…it’s not for the money….we don’t need his minerals. But what that does is give us leverage with Russia. Because we now would have a vested interest in Ukraine not being overtaken by Russia. This puts Russia in a tough position. Then what. You need to give the Russians something to save face. You have to give some of the bordering property to Russia that they have old claims to. Yes people will be displaced but you get the Russians to pay for the re-location. You divide a new border. You build a wall paid for by Russia. Russia provides much needed oil to Ukraine. You sign a deal with any future advancements beyond the wall that it is an act of War whereas the US and our weak EU friend commit to. This isn’t that herd folks. Did the Russians invade them.? Yes they did. Should they have? No. Did we have a President (Biden) who was an idiot and woke? Yes. Fact is it happened. Know there is a new negotiation. If your wife does something wrong in your opinion do you keep bringing it up over and over and hold the line. No you both agree to move on even if you think you’re right. It’s frustrating to me how dumb people are in general.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Comprehensive-Tell13",
            "body": "Ge it kinda looks like someone did a run around on Trump  and Rubio wondering exactly who that could have been.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Left_Macaroon_9018",
            "body": "lex fridman Who interviewed Zelensky said he doesn’t want peace he wants justice and afraid that it will never happen and",
            "score": 0,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "Z demands justice at the expense of his countrymen's lives and at the expense of his allies...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "BrandDC",
                                    "body": "No it won't.\n\n<<Giving up on Ukraine now will mean that anyone can violate international norms, invade other countries, and be rewarded with huge chunk of new territories.>>",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "BrandDC",
                                                    "body": "Giving up on Ukraine does not automatically dismantle international norms, as global mechanisms like sanctions, diplomacy, and international law still function to maintain order. Territorial gains through aggression may bring short-term rewards, but they come with long-term economic, political, and reputational consequences that deter future violations.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Justhangingoutback",
            "body": "Has anyone yet seen the preliminary results of the Trump negotiations with Russia for a cease-fire? What are their initial requirements? Certainly one of the requirements will be an end to the threat of NATO membership for the Ukraine. This has persistently been threatened since 2008. Even our Congress has referred to the Ukraine as ' NATO+' and has foolishly taunted Russia with NATO membership for the Ukraine. Perhaps a compromise would be the establishment of a 'EU police force' to provide security to the Ukraine without NATO involvement.",
            "score": 0,
            "replies": [
                {
                    "author": "Candyland-Nightmare",
                    "body": "Ukraine would also get an indirect security guarantee from the US if we have financial interests in their resources. They don't seem to grasp that, but then neither does the left.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}