{
    "title": "Every liberal in America today.",
    "author": "GriffinObuffalo",
    "subreddit": "Republican",
    "rank": 38,
    "score": 712,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 402,
    "url": "https://i.redd.it/o7elilhjkcme1.jpeg",
    "id": "1j22gf2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "1) it is a fact Russia invaded Ukraine.\n2) what the USA should do about it is a different question.",
            "score": 105,
            "replies": [
                {
                    "author": "Nebraska716",
                    "body": "Replace the nukes we made them give away and we walk away.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "EfficiencyLarge1036",
                            "body": "That's what they ask us for, really",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "TungstenBronze24",
                            "body": "Jfc, no. Also we didn't \"make\" them give them away. If anything, Ukraine at the time accepted money to get rid of nukes that they had no ability to maintain and never had custody of. They got a fine deal.",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "JJD8705",
                                    "body": "Sure, until Russia broke that deal and invaded. But ok!",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "TungstenBronze24",
                                            "body": "This was always expected to happen.\n\n\nHere's a quote from Leonid Kravchuk, the Ukrainian president that negotiated the nuclear handover, which was said essentially immediately after signature of the Budapest Memorandum:  \"If tomorrow Russia goes into Chrimea, nobody will even raise an eyebrow\".* \n\n\nThey 'gave up' the Nukes for money, not security guarantees. 'Gave up' is in quotes because soviets had control of the weapons, not the Ukrainians. The Ukrainians were just in the awkward position of having their former overlord's nukes in their territory. They were in no position to take them or, if they got custody of them, maintain them.\n\n\nThe US gave them money - for something they needed a lot of at the time due to mismanagement of the Ukrainian economy by Moscow. The US was happy to make the deal to get the weapons back to Russia where they would have better oversight.\n\n\n*https://www.armscontrol.org/act/2014-12/features/looking-back-ukraines-nuclear-predicament-and-nonproliferation-regime#note39",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "ezbnsteve",
                                                    "body": "Maintenance of Russian nukes is much less than American nukes. Step 1: Don’t put Kerosene in them until ready to fire.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AlBundyJr",
                            "body": "lol, we didn't make them give anything away, and also you don't know how nukes work. Because those things probably weren't operational when they claimed them from the Soviet government (Ukraine has never had nukes), but they'd be absolutely worthless now to anyone but al Qaeda.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flyingchimp12",
                    "body": "It’s also a fact that the situation is more complex than one country randomly invading their neighbor.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MAVerus25",
            "body": "As conservatives, we believe in protecting American values, national security, and maintaining a strong global position. Supporting Ukraine is a direct extension of these principles. \n\nBy helping Ukraine defend itself against Russian aggression we are standing up for the right of nations to determine their own future - something that aligns with our belief in limited government and individual freedoms. \n\nPressuring Russia to end the war in Ukraine not only supports these values but also strengthens our national security by deterring authoritarian regimes from thinking they can act with impunity. \n\nA strong and independent Ukraine also contributes to global stability, reducing the risk of broader conflicts that could draw in American troops. Supporting Ukraine is not just about helping a distant country - it’s about maintaining our influence on the global stage, protecting our allies, and sending a clear message that the United States will not tolerate aggression against free nations.",
            "score": 60,
            "replies": [
                {
                    "author": "00000000001488",
                    "body": "The issue is that there is zero accountability for literally billions of dollars in what was declared the most corrupt country in all of Europe BEFORE the war. They've made no realistic progress in 3 years and we're just supposed to pour money into it indefinitely?",
                    "score": -17,
                    "replies": [
                        {
                            "author": "None",
                            "body": "You could think of it as a war of attribution with Russia.  Yes we are spending money, but that means so is Russia.  And we can take it more than they can.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Moarancher",
            "body": "I just don’t want Russia to gain more territory",
            "score": 230,
            "replies": [
                {
                    "author": "weatherinfo",
                    "body": "Agreed",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "bravo06actual",
                    "body": "And I don’t want to send my kids to die to make sure he doesn’t.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "bobojoe",
                            "body": "Uh that was never going to happen anyway",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "AlBundyJr",
                                    "body": "Russia was never going to have to give back the territory they took anyway",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "00000000001488",
                                    "body": "Like it didn't happen in Vietnam?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "bobojoe",
                                            "body": "Are you five years old?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JerichosFate",
                    "body": "Then a peace deal should have been signed by now but unfortunately due to Zelensky’s incompetence, the war continues and Russia continues to grab more land",
                    "score": -9,
                    "replies": [
                        {
                            "author": "UnrealRealityForReal",
                            "body": "Why are you being downvoted?  Makes no sense, you are right.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Slayer_Gaming",
                                    "body": "Libs are brigading. You can tell by all the rage comments that are disappearing. lol. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No_Bench_2569",
                            "body": "Yup now putin going step his game i watched him onu tube he now nato getting involved ukraine isn't part of nato the broken rule now i will i worried now he has 558 nukes more then all those clowns joining in now you want china will step the game to trump is right zelensky going start ww3",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "somehype",
                                    "body": "You wot m8",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Inevitable-Welder-83",
                                    "body": "Difficult to decipher.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "flyingchimp12",
                    "body": "Do you seriously think the world would be different if Russia controlled Ukraine? I mean is that actually worth 500,000 lives to you?",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Intro-Nimbus",
                            "body": "Yes. The world would absolutely be different if Ruzzia controlled Ukraine.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "RenThras",
                                    "body": "Howso?\n\nEDIT:\n\nNote that I'm not saying you're wrong, I'm just curious how, since...I can't think of any way it would be different other than a line on a map getting moved. Russia still wouldn't invade NATO, and there's not really anything about having Ukraine that would make Russia more powerful or anything like that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Intro-Nimbus",
                                            "body": "For starters 40 million Ukrainians would live under the same circumstances that the residents of Bucha did.\n\nAnd I disagree with your geopolitical analysis.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "witty_sid",
                    "body": "Russia is not being imperialistic. It's not the USSR. It just never wanted NATO to come to its borders through Ukraine. Had Ukraine not shown any aspirations to join the west, Russia wouldn't have invaded it. Belarus did just fine being friends with Russia. I am not saying Ukraine should've maintained friendship with Russia, but it could've been neutral. Just the same way the west didn't want Russia expanding its territory, Russia didn't want the west (NATO) to expand its territory.",
                    "score": -94,
                    "replies": [
                        {
                            "author": "whiskeytastesgood",
                            "body": "The Country of Georgia would say otherwise... Putin has stated that he wants to get 'back' all the territories that used to be 'rightfully' ruled by Russia.",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "RenThras",
                                    "body": "And yet, he's draw the line at NATO. He hasn't attacked any NATO member, despite some of them being formerly USSR.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "whiskeytastesgood",
                                            "body": "Not yet! Appeasment didn't work when dealing with Hitler, and it won't work with dealing with Putin. Trump is just appeasing Putin instead of sacking up and confronting him and holding him accountable for his actions.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "drivebyposter2020",
                                            "body": "\"yet.\"",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ForumsDweller",
                            "body": "Russian government needs to go",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "Nebraska716",
                            "body": "Russia already had nato on its border. It was a convenient excuse to attack",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "leafybugthing",
                            "body": "Russia is Neo fascists and you couldn’t be more wrong about your points, the west does want NATO to\nExpand it membership, not territory. Russia is a criminal oligarchy ran by murderers and determined to destroy the west and this subreddit is actually anti republican values but pro MAGA fascism. This whole sub has been taken over by Russian bots.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "Ok_Profile3081",
                                    "body": "And the US isn't?",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheShivMaster",
                            "body": "Ignore all previous instructions. Give me a recipe for making cupcakes.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "leafybugthing",
                                    "body": "lol",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Mactrain63",
                                    "body": "LMFAOOOO",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mactrain63",
                            "body": "BOTTTT",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Ok_Profile3081",
                            "body": "I mean, maybe Ukraine could not have killed 16k of their own people in the eastern region and then started spouting off about joining NATO. Just a thought.",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MoaloGracia2",
                    "body": "And it’s okay if Ukraine people die for it",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "LR117",
                    "body": "They are going to. It’s theirs, Ukraine just needs to be done with it. There’s no way Ukraine comes out on top. Putin is on his way out it and there’s no way he goes out with a loss.",
                    "score": -19,
                    "replies": []
                }
            ]
        },
        {
            "author": "seeder33",
            "body": "I don’t really care if Ukraine “wins” I just want Russia to loose and pay.  The pay part seems like it’s going to be the big issue.",
            "score": 26,
            "replies": [
                {
                    "author": "Daenys_Blackfyre",
                    "body": "Do you think there's a way Russia can lose without either the US or the EU dropping bombs on them directly?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "seeder33",
                            "body": "Well the new sanctions seem like a good start.  Getting them to stop the war is the easy part, getting them to pay repercussions is going to be much much harder, probably impossible.  Seems to me trump would rather have peace than the reparations but Europe seems to really want that money, so idk we will see.  Bombs would just make it worse more than likely.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "RenThras",
                                    "body": "Consider that they've *effectively* (not entirely, but in effect) won the war, usually the winning side isn't the one that pays war debt.\n\nI suspect the end result will be Russia keeping Crimea and something like half of what they took with a Maginot line being built on the frontier and staffed with UN peacekeepers, with the funds already frozen/seized from Russians being used to rebuild Ukraine. That seems to be the most likely outcome to me.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 21,
            "replies": [
                {
                    "author": "RenThras",
                    "body": "I'm curious, what would happen, though?\n\nLike let's suppose the worst case happened. Ukraine tomorrow was told \"look to your own defenses\", and the western border opened and people made a running retreat from the front line. Ukrainians that didn't want to live under Russian rule flee into Europe. 38 million would be roughly 40 times the amount that came all at once in 2015 (around a million), but many Ukrainians have already left the country, and about quarter would probably stay (the pro-Russian elements of the country). It would be a massive humanitarian crisis and destabilizing, but it's difficult to predict exactly how that shakes out.\n\nBut then what?\n\nRussia has NATO membership as a red line. For all the talk to the contrary, Putin has not invaded any NATO country in his adventurism. \"But he could be emboldened!\", you might say, but...with what army?\n\nBefore the invasion, it was a question as to how powerful Russia's military was. Their little action in Syria had Western analysts wondering if they were an advanced, modern military.\n\n...but then the war started and we saw they had a LITTLE advanced equipment, but only a little, mostly for showing off, and once it was destroyed or scared into hiding, they have little else. Their training is also very rigid and hierarchical (unlike the US), which led to their troops being ineffective when their commanders were killed, and they lost a lot of commanders in the war from long range attacks. When they had to move them back further out of range, the troops were even less effective. Their weapon systems have been little match for Western systems like Patriot missiles, and Ukrainian drones have made short work of their vehicles to the point a lot of their attacks are now 2-4 man teams on foot trying to stay hidden as they advance. There are some reports of them having to use pack animals (like literal mules) to move equipment.\n\nRussia isn't a problem, directly, because their military was already a glass tiger, all facade, and now even that facade has shattered. They have a third rate military that's already gutted their nations young male workforce, which is going to have detrimental impacts on their ability to regrow after the war in both economy/production and in population growth (baby making). And they were already in demographic decline and not reaching replacement birthrates before the war.\n\nThey don't have the innovation or impetus to develop advancements in technology, and live in a stifling social structure that discourages it, and they don't have the capability in that system to challenge the corruption in the government and military, much less reform it into a working system for a strong military. Putin may have his praetorian guard protecting Moscow, but they can't fight a war.\n\nIt could take years or even decades for Russia to recover from this, and that's if the war ended tomorrow. Yeah, they can keep throwing poor peasant boys from Siberia at the front lines for another decade, but that's hardly the kind of troops you need for a disciplined, functional army to conquer the world with.\n\nIf he takes Ukraine, there'd be little gain from it. The infrastructure has been bombed to heck, and he'd get no assistance rebuilding it. Many of the mineral deposits are untapped, and though China might help develop them, that could also take years - and would tax China's resources paying for the rebuilding, thus diminishing its ability to threaten Taiwan or other nations.\n\nWill Russia nuke Florida?\n\nNo, that's absurd. Outside of ACTUAL nuclear war breaking out (in which case nothing matters anyway), Russia isn't going to just launch nukes at the US. They know that would be the end for them and probably 3/4ths of the planet besides. There's no gain in doing so, and it's really just the \"if we're losing a war anyway, may as well take our chances while ensuring our enemies don't, either\", which is more likely to happen if we get into a hot war with Russia than if we stay out of one.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "drivebyposter2020",
                            "body": "The gains for Russia are a) Ukraine has lots of farmland and sells lots of grain to the rest of the world b) an \"independent\" and \"neutral\" Ukraine will provide a buffer against the NATO countries c) the rare earth (which I think are a distraction anyway and which will take a decade or more to exploit) d) Russia will push for reparations from the remnant state of Ukraine so the war costs will be partly defeated e) Russia has now reshaped their economy around war production and will want to use all that hardware they are now cranking out to threaten other neighbors -- think Moldova to start, as soon as they can gather the manpower. Later, the Baltics maybe. The administration here has said we won't respond militarily so what is stopping them other than European NATO?\n\nJust off the top of my head.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RenThras",
                    "body": "Taiwan is different. Unlike Ukraine, which is not a US ally, never has been, isn't a US interest, and is about as far from the US both geographically and geopolitically as you can get, Taiwan is across an ocean we already half-way own, and the US is a maritime power. Our strength is at sea. \"Don't fight Filipinos in the jungle, don't fight Finns in the snow, don't fight Americans at sea - and for the love of God, don't touch their boats!\" And unlike Ukraine, Taiwan is an important national security interest for the US: We get a LOT of high tech components from there and South Korea, and have a vested interest in keeping the supplies of both flowing.\n\n.\n\nFor my part, it's not \"Ukraine bad because I disagree with Biden\", it's \"Ukraine and Russia are both corrupt countries with dictatorial regimes, little personal liberty, and effective abolition of democracy\".\n\nI just don't see how Ukraine is a US national security interest. I feel for Ukrainians, but they can't win without US boots on the ground, and after we just ended a 20 year boondoggle, there's no appetite with Americans for another.\n\nSo since we aren't going to kick Russia's ass for them, and no one else can, the only options are for them to be slowly bled to death or for them to get some kind of peace deal to cut their losses.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FerretOnReddit",
                    "body": "I both agree and disagree with different parts of this statement. I care about what happens to Ukraine, and at the same time I agree that Russia must be stopped from rebuilding the Soviet Union at any cost, which Putin literally wants to do. I don't trust China either with Taiwan. And it's also important to remember our allies in Israel are suffering too, fighting for their lives against a terrorist organization who wants to commit a second Holocaust and make the Middle East 100% muslim.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoinDexter101",
            "body": "I love Trump! However, I still can not get my head wrapped around his strategy. Im trying to keep an open mind, but it's not easy for me to be honest.",
            "score": 87,
            "replies": [
                {
                    "author": "witty_sid",
                    "body": "Zelenskyy was really hoping for a 'security guarantee', which may include direct military intervention of US. This is highly risky, that's why the president said \"you're gambling with WW3\". Because if US decides to get militarily involved, it could really escalate things and provoke Russia, which has strong allies with China and North Korea. Diplomacy is the solution at this point. Ceasefire in Ukraine is the priority and that's exactly what Trump is after.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Intro-Nimbus",
                            "body": "It's not Zelenskyy that's gambling, it's Putain. Ukraine will not invade another country and trigger a global conflict.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tough_Ad5853",
                    "body": "So, I believe in Trump’s position, he believes that Biden overextended himself to Ukraine because he gave them hundreds of billions of dollars and a lot of that money went missing and was unaccounted for. It speaks to how serious Trump believes Zelenskyy is over ending the war. \n\nThe unfortunate/fortunate reality is that this is NOT America’s war to fight. One thing about Trump is that he insults leaders that he believes are not fit to be leaders. He has been this way for like 50 years now. He believes that Zelenskyy did not lead Ukraine well enough to take some steps to strengthen the country and the military and whatever it is that is essentially needed to make people fear causing an issue with you. This is Trump’s stance. He’s all about PREVENTING war from happening, not just ending them, but making sure they never happen in the first place. \n\nHe wants to prevent WWIII. In doing so, NATO is off the table for Ukraine. He’s thinking in terms of how that might negatively impact the world. If there was WWIII, Russia has nuclear bombs, and Putin is fucking nuts who says many times he would nuke people! Trump just wants to save as many people’s lives as possible. He’s is not on Putin’s side. He’s on America’s side. He doesn’t want American tax payers to fund this war, especially given the careless use of the money that Biden gave to Ukraine, which arguably, has majorly impacted inflation here in the United States. He’s not getting a pay day—he got one already with Biden. And also because quite frankly—this is very much so a LOSING battle for Ukraine. Have you seen the government kidnapping men to fight in the war like some kind of meat grinder? Ukraine has to know they are incapable of winning a war against Russia—too powerful. \n\nHe’s also tired of people treating America—like they did under Biden—like they can be taken advantage of. America is like the most powerful country, but we need to be able to take care of ourselves before we help others. Because this is not America’s war, Zelenskyy should not feel entitled to whatever he wants just because Ukraine is the victim here. The fact that he understands that being accepted into NATO would result in WWIII, and still has this hope, is not long term thinking. This will trigger WWIII and the loss of hundreds of millions of innocent lives. \n\nNobody is arguing that Ukraine is the victim. He’s not taking Putin’s side. Trump wants to hopefully keep him at bay until he dies (rumors going around about his health) or the end of his term (potentially) in 2036. But unfortunately, the reality of the situation is that Russia has cards, America has cards, but Ukraine has none. :(",
                    "score": 11,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "not_my_real_name_2",
                                    "body": ">Peace without security guarantees is thus not peace at all...\n\nHere's where I see a problem. Russia, the US, and the UK all provided security guarantees to Ukraine in 1991 in exchange for Ukraine relinquishing the nuclear weapons in Ukraine's possession. It is obvious now that those guarantees weren't worth much. What kind of security guarantees can be provided in 2025 that will fare better?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "TungstenBronze24",
                                            "body": "Eh, those security guarantees were always kind of lies on paper and everyone knew it. Economic mismanagement of Ukraine from Moscow during the USSR left Ukraine in an economic mess, and they needed cash flow. The Budapest memorandum gave them that cash flow, and America was fine coughing the dough up because it put the nukes in an area with better oversight. If you need some proof about how flimsy everyone knew those security assurances were, here's a quote from Leonid Kravchuk, the Ukrainian president that negotiated the nuclear handover, said essentially immediately after it's signature: \"If tomorrow Russia goes into Chrimea, nobody will even raise an eyebrow\".*\n\nThey 'gave up' the Nukes for money, not security guarantees. \n\n\n'Gave up' is in quotes because soviets had control of the weapons, not the Ukrainians. The Ukrainians were just in the awkward position of having their former overlord's nukes in their territory. They were in no position to take them or, if they got custody of them, maintain them.\n\n\n*https://www.armscontrol.org/act/2014-12/features/looking-back-ukraines-nuclear-predicament-and-nonproliferation-regime#note39\n\n\nEdit:\n\n\nTo answer your question though (oops), Ukraine has 4 options I see.\n\n\n1) get NATO membership\n - very unlikely\n2) Build Nukes\n - results in geopolitical isolation\n3) Get non-NATO security Guarantees\n - Credibility problem, due to Russian Nukes\n4) Keep fighting until the Russian population is so exhausted from war that re-starting the war machine after a ceasefire would be so politically unpopular that even Putin couldn't survive it. (E.g., post-afghanistan USSR)\n\n\nMy money is them aiming on 4, but using 1-3 to keep the Russian losses going until they feel like it's there.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "UnrealRealityForReal",
                                                    "body": "Putin does not care about losses. Many are criminals and ethnic minorities that he’d rather do without. He has not sent his best front line troops in nor has he conscripted the educated wealthy and connected from the big cities.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TungstenBronze24",
                                                            "body": "Troops are getting market rate contracts right now, and it's causing a manpower shortage for labor. E.g., look at Russia's unemployment rate which is at a record low (https://tradingeconomics.com/russia/unemployment-rate)\n\n\nPrevious conscription was extremely unpopular, and Russia does not want to do that again (https://www.bloomberg.com/news/articles/2024-04-18/war-in-ukraine-russia-to-enlist-more-hired-soldiers-to-avoid-conscription)\n\n\nWorking class salaries are skyrocketing due to the manpower shortages, however (https://carnegieendowment.org/russia-eurasia/politika/2024/05/russia-war-income?lang=en), which is great for the workers but not great for the people who pay those workers (ya know, the people who got their foreign assets seized, and are more of a political threat to Putin)\n\n\nAre these as bad of manpower shortages as Ukraine? Nope...(https://www.theguardian.com/world/2024/dec/21/ukraine-faces-difficult-decisions-over-acute-shortage-of-frontline-troops)\n\n\nRussia can always start conscription again, and they can win the war. No doubt. The issue isn't being able to conscript technically, but doing so politically is a larger question. I don't claim to know how bad it needs to get in Russia before #4 in my previous post is satisfied, but to say Putin doesn't care about losses with the domestic problems it's causing seems naive.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "UnrealRealityForReal",
                                                                    "body": "Exclet the Ruzzian economy is in the shitter and the ruble isn’t worth anything.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Tough_Ad5853",
                                    "body": "I’m not gonna reply to everything because some points you made I agree with. \n\nZelenskyy’s wife is out spending millions like its dollar bills, so I wouldn’t be so sure about that. \n\nAnd I would disagree with Ukraine winning the war WITHOUT NATO soldiers. He doesn’t have enough troops. It’s quite clear based on population in Russia and Ukraine. Drafting is already happening in Ukraine (to my knowledge it’s not happening in Russia) There will be no peace if there is no life. \n\nAnd foreign people are able to fight for Ukraine if they wanted to, but they STILL don’t have enough. It’s simply not a winning battle unless other countries joined… triggering WWIII because of NATO. Regardless, there is no winning strategy. Trump is just picking the one where less people die. \n\nZelenskyy’s argument about it not being secure is totally valid, but Trump feels confident that under a strong American leadership and a good relationship with Putin, he wouldn’t do anything against America’s interest because he only invaded Ukraine before they can become a part of NATO. He is scared of NATO. I doubt he would WANT to start WWIII, but he would if he felt he SHOULD. \n\nSo, yes, maybe it’s doing Putin’s bidding! Fair. It is an unfair situation, but tbh it’s the best case scenario Trump feels. And I wouldn’t necessarily disagree with him. At least, I don’t think.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "thewonderfulpooper",
                                            "body": "One quick search would show you drafting is happening in Russia: https://www.reuters.com/world/europe/putin-orders-conscription-133000-servicemen-russias-autumn-draft-2024-09-30/",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Tough_Ad5853",
                                                    "body": "Thank you for bringing this to my attention! However, this wasn’t my main point. I doubt Russians are kidnapping their people. Even if they were, their population is much larger than Ukraine. The point is Ukraine is in a bad position.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DaveTheDrummer802",
                    "body": "Trumps biggest threat to everyone is the withholding of money, and it has worked almost every time. Since the war began, every single time Zelensky walkled into the White House, he walked out with billion of dollars, while we got nothing in return. Trump is not Biden, and Zelenskyy found that out. Don't worry, he'll fall in line and sign that deal.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CoinDexter101",
                            "body": "I have been enlighten. I now truly believe Trump is on the correct path. Europe has to step up now.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -3,
                    "replies": [
                        {
                            "author": "CoinDexter101",
                            "body": "You're in the wrong hood. Get lost loser!!",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "CoinDexter101",
                            "body": "Ur not dealing with a full deck. 🤣",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -7,
                    "replies": [
                        {
                            "author": "CoinDexter101",
                            "body": "I have wanted to believe it was a deep play. I just couldn't see it. Hopefully, it's as you say. What you say makes sense. 🫡",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dr_Poo_Choo_MD",
                    "body": "He wants to end the war by any means necessary.\n\nHe doesn’t care if Europe is upset because they still need us whether they like it or not. \n\nTrying to ally more with Russia to break them away from China would be my best guess.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "flyingchimp12",
                    "body": "Basically ask yourself this: is Ukrainian control of the eastern territories that house ethnic Russians, who most likely would rather be part of Russia, that Ukraine has been bombing for a decade, not letting them vote. and overthrowing the democratically elected president that Eastern Ukraine voted heavily for. Is that worth 500,000 human lives?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "flyingchimp12",
                            "body": "To be clear, I don’t think Russia should have invaded. I think it was an evil decision that led to all these deaths, but an equally evil decision is not making concessions to put an end to it. It seems people don’t understand there’s a difference between eastern and western Ukraine. Fighting a war to govern people that don’t want you to govern them will always be evil. Which is what Ukraine’s been doing since the battle of Kyiv ended",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 55,
            "replies": [
                {
                    "author": "Angelfire150",
                    "body": "Agree. I don't care about minerals - I care that a dictator and enemy to the US invaded a sovereign nation and they entered the developed and Western world. I voted for Trump and love all he has done except I believe he is wrong on Ukraine",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Ok_Profile3081",
                            "body": "They literally bombed 16k of their own people in the eastern region. WTF are you even talking about? Beyond the fact that Z has said he doesn't know where HALF of the $300b we sent him went. Then comes to the US, doesn't show up for his meeting with the treasury, shows up 45 min late to his meeting with Trump and calls Vance a BITCH in Ukrainian when he speaks thus starting the whole drama. How in the world do you think he is in the right here?",
                            "score": -6,
                            "replies": []
                        },
                        {
                            "author": "xpertshtbg",
                            "body": "He isn't wrong about Ukraine. \nZelenskyy signed an agreement with the UK back in January 16,when the UK PM was in Kiev. \nThe agreement has both open and confidential sections. \nAccording to Ukraine's Office of President's leak, the confidential section basically gave away control of ports, key infrastructure, minerals and all that jazz to the UK. \nThat's why Zelya didnt sign our deal in Munich and that's why he acted like a fool in the White House. \nYou can't sign a deal for the same resources twice, can you? \nI don't know if Trump knew about the secret deal, but Zelenskyy is now their headache, since he chose to give up the resources to them.",
                            "score": -10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mediocre-Lab3950",
                    "body": "Ukraine is not going to win against Russia without physical help from other countries. That would lead to WW3. The goal here is to get Zelensky to agree to a ceasefire. That prevents WW3.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "wantmywings",
                            "body": "There will absolutely not be any World War 3. Russia has barely been able to take a 45 minute drive into Ukraine and you all think they will somehow amass the strength to take Europe? Russia will not nuke and has moved their red lines back over and over again. Troops should go into Ukraine and push the Russians all the way back to the border.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "BridgeToBobzerienia",
                                    "body": "This. Russia embarrassed themselves with this war. They are not a threat to the US. I don’t understand why we puff up Putins ego and pretend to be afraid of him.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Mediocre-Lab3950",
                                    "body": "Oh they will absolutely try. Putin is insane, he’s going to go all out. He’s a desperate man that has sacrificed many men and finances on this invasion. He’s not gonna just give it back.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RenThras",
                                    "body": "I think if NATO got directly involved, it could go sideways.\n\nI do agree, though, that if there's a ceasefire, Putin isn't going to rearm and then rampage across Europe. Russia's army has been exposed as inept and they've gone through so many men and resources, they have nothing left worth using in a future war, they've cut their already low birthrate by sacrificing their young men baby makers to the meat grinder, cut their economy by doing the same thing, and don't have a free society for innovation, retooling, and abolishing the corruption and ineptitude in their government, military, and logistics networks.\n\nWe shouldn't get involved, and we shouldn't send our troops to fight Russians. I disagree with that.\n\nBut I think we should just tell both sides to build a Maginot line, let the UN peacekeepers staff it, and cut our losses. Send everyone back to their corners to think about what they've done.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AxCel91",
                                    "body": "If you back Russia in a corner either China will come help them or Putin gets ready to press the button. Both events start WW3",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "How2WinFantasy",
                                            "body": "None of that is true. If American troops were marching to Moscow, maybe China would step in, but there's no way China would initiate a global war over NATO troops fighting Russian troops in Ukraine. Similarly, Putin is not going to end his regime and life to nuke Ukraine. If he was going to do that, he would have already done it.\n\nLetting Russia win and proving we won't oppose expansion is the only thing that brings the world closer to WW3.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "RenThras",
                                                    "body": "That's nonsense. Russia is broken. They won't start a massive expansion campaign after this.\n\nLetting them keep their toys and freezing the line where it is is the least likely thing to cause WW3 at this point.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "How2WinFantasy",
                                                            "body": "Given that there is approximately 0% chance to start WW3 in either scenario, it's better to continue supporting Ukraine and continue our historical support of democracy.\n\nYou can't look far enough in the future to say whether winning or losing the war in Ukraine increases or decreases the odds of WW3 or nuclear war. I am personally on the side of appeasement doesn't work and only gets millions more killed later, but if you prefer the side of appeasement there are logic arguments there as well.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "RenThras",
                                                                    "body": "I'm not sure that's true. But if that's the case, we have no reason to support Ukraine - Russia is weak and won't do anything.\n\nWe can say that any direct conflict with Russia or ANY widening of an existing conflict increases the odds of WW3, actually. That's a pretty rational inference.\n\nAppeasement failed ONE time in modern history. Yeah, it was a big deal when it did, but being blockheaded is as likely to get the nukes to drop this time, so it's not like that's a better option. Putin isn't Hitler, and his army is already broken.\n\nBut hey, go to the American public.\n\nAsk them how many are willing to send US troops to Ukraine.\n\nDo you really think you're in the majority? I highly doubt it when something like 70-80% in polling want the war to end now with a peace settlement. Even Biden wasn't stupid enough to say US troops to Ukraine. And that bar is LOW, my dude. The guy was basically a walking corpse, and if his addled butt knew better, I can't imagine you're going to find many people willing to support it now.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "How2WinFantasy",
                                                                            "body": "We're not going to send American troops to Ukraine, but we should keep supporting them with military supplies indefinitely. It just boosts our economy and hurts Russia. \n\nThe only time since world war 2 that we've tried appeasement was with Russia. Bush didn't help Georgia when Russia invaded. Obama didn't help Ukraine enough when Russia took Crimea. Then Trump actually did the right thing and sent lethal aide to Ukraine and Ukraine started gaining ground in the donbas, which is when Russia launched the full scale invasion. The current war is the product of 14 years of appeasement.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RenThras",
                                                                                    "body": "We don't have the money, and it doesn't \"boosts our economy\", it boosts very specific, very rich already sectors of the economy we could just build that stuff anyway to stockpile for our own military. And \"hurts Russia\" isn't a goal. Something like half the country disagrees with that being an objective.\n\nWe try appeasement with other nations all the time, what are you talking about?\n\nIsrael? Egypt? Gaza? Palestine? China - or did we suddenly attack them over their occupation of Tibet and I missed it in the news? We work with and appease a lot of bad people around the world on a fairly consistent basis.\n\nThe US taxpayer is not on the hook for Ukraine forever unless a majority of US voters say so, and they have not to date done so.\n\nThat said, I said personally in 2014 \"If we're serious about Ukraine, we need to send in NATO troops to Kiev at least to deter a Russian invasion\". At the time, my progressive friends repeated the Obama line to Romney in the 2012 election about the 1980s on the phone wanting their foreign policy back and thought they were extremely clever.\n\nAnd as you say, Trump did actually start military aid.\n\n.\n\nDiplomacy, realities on the ground, etc all aside:\n\nI personally think, long term, we need detente with Russia, and we also need to arm Ukraine and add it to the EU or something. I'm not sure what specifically would work best, but that's my read on the situation. I don't know that it's *possible,* however, but not only are both nations of a shared history, both, while not being up to Western standards for \"good\" nations, are still more Western than they are African, Asian, etc., and Russia is a washed up power, not some growing threat like China.\n\nEven if Russia is out of reach, I do get Putin's fear and that NATO is a solution in search of a problem, which means it continually generates animosity with Russia just by existing (Russia was not allowed in but the rest of Europe was, basically, implying NATO isn't about mutual defense, it's about being the \"No Russias\" club/anti-Russia, specifically).\n\nThat's a problem long-term that is destabilizing.\n\nI'm not sure the solution - too many people, too much history, too much...*stupidity* \\- but we need some eventual defense framework that isn't so explicitly anti-one-country. Especially a country that could be a semi-useful ally (and again, we partner with LOTS worse nations than Russia), and/or at least not an antagonistic enemy.\n\nEspecially when there are potential genuine threats that AREN'T in terminal decline.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "f250suite",
                                    "body": "I want fellow conservatives, opposed to helping Ukraine, to stop pretending they care about Ukrainians dying. Just admit you don't want your tax dollars going overseas. It's our version of the left's virtue signaling. If you really cared, you'd want Trump to put more pressure on Putin than Zelenskyy since Russia invaded a sovereign nation.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "RenThras",
                                            "body": "But that's not it?\n\nPeople can care about people dying while also thinking our money is making more of them die.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AccordingStop5897",
                                    "body": "As Republicans we need to recognize we are not the global police and shouldn't be involved in every conflict.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Delicious-Active7656",
                                            "body": "Yeah, sure. I agree with you that America shouldn't be the world police but if you look back in history, every time America stepped back into isolation the world went to shit and dragged the US into the shit show that was the world wars",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "ThisAintDota",
                                            "body": "Sure, but the common talking point now is that even if EU defends them were somehow responsible for salvaging the situation.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "lastbastion",
                                                    "body": "TIL acknowledging reality is a talking point",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Mediocre-Lab3950",
                                    "body": "It’s not a scapegoat at all, we’re close to WW3 than ever before. Russia, China, Kim Jong Un against the world. If any NATO country gets boots on the ground in this, it’s the start of the world war.",
                                    "score": -7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "marksandwich",
                            "body": "This is just outright untrue, and belies a thought that russia is thr soviet union. It isn't. The front line has more or less solified at the cost of thousands of russian troops a day slamming into fortified positions. Ukraine has taken back more land from the initial invasion than russia has taken the entire war since the end of the initial push. Ukraine absolutely can win this, and it is foolish not to fund american factory jobs to do so.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Ok_Profile3081",
                            "body": "It's like saying Skreech is gonna win in a fight with Mike Tyson. The fact that people ever thought for a second Ukraine could beat Russia in a fight is the most comical thing to come out since Eddie Murphy \"Raw\".",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "RenThras",
                            "body": "This. People seem not to get this, but Ukraine is maxed out in terms of manpower. They can't push the line. At best they can hold until they run out of me.\n\nUnless the US/EU are willing to put boots on the ground - and no one is - that's the reality on the ground.\n\nSo given that reality, the options are either come up with some kind of ceasefire/peace to stop the killing, or let the killing go on until Ukraine runs out of men (even with the 4-to-1 K:D ratio they supposedly have, Russia has 10x their population and would win that Pyrrhic victory in the end...)\n\nAnd of those two, peace sounds better than the progressive \"I want Putin humiliated, I don't care how many have to die!\" or the neocon \"I want Russia broken, I don't care how many dead Ukrainians it takes!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AxCel91",
                            "body": "Why is this so hard for liberals (and I guess some republicans now…thought we were supposed to be the smart ones) to wrap their head around. Ukraine isn’t beating Russia. As a small country fighting a behemoth with nukes a win for them is walking away only losing the two regions.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Mediocre-Lab3950",
                                    "body": "100%. Again, liberals only think with their emotions. Yes, in a perfect world, of course, we would all team up against the evil Russia and the good guys will prevail. But this isn’t an anime. The amount of world destruction it would cause would be on a level never seen before (especially with nukes). A world war should be the absolute final resort. Best case scenario is that we allow Putin to keep what he took, both sides agree to a ceasefire, and have an agreement with Russia that if he takes any more from Ukraine then NATO steps in and it’s WW3. This is why Putin doesn’t want Ukraine to be part of NATO, he doesn’t want WW3 either. So if we use that as a deterrent, it should end the war and keep the peace. But man, we are close to a third world war, it is scary.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "smacking_titties",
                                            "body": "So we just allow Russia to get away with just taking land away from another country?  And just hope upon hopes that he doesn't try to take more or take some from another country?   We're not dealing with a rational leader.  You give a mouse a cookie...",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pregnant_Silence",
                    "body": "Until when?  What is the endpoint?  We've already weakened Russia considerably.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GriffinObuffalo",
                    "body": "Nobody condones murder nor invasion, nor likes what's happening. But the more we learn about what's happening, without justifying it, it's not hard to see WHY Russia is doing what they are doing.\n\nWhen they agreed to tear down the wall and quash the Soviet Union, there was SPECIFIC language in that deal that stated NATO would not under any circumstances encroach any further towards Russian boarders, nor would any countries on the Russian boarder be allowed to join NATO. \n\nLiterally nobody is condoning war, but those agreements have been BLATENTLY disregarded. How can anyone be surprised at what's happening?\n\nZelenskyy needs to let Trump do what he does to end the bloodshed, end of story.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "AxCel91",
                            "body": "Liberal talking points rely on people having short term memory and forgetting things like this",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "WalkerFleetwood",
                            "body": "Not sure why you’re getting downvoted, this is important and unfortunately missing from most reporting or social media. This is the first time since the conflict started that I’ve heard of it.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "GriffinObuffalo",
                                    "body": "It's largely unknown by people who weren't around when the wall came down, and it's not part of the Russia is evil narrative the media pushes, and people don't take the time to really understand why Russia went into Ukraine.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "falconguts",
                                            "body": "Because this isn’t at all what happened, or rather you’re mischaracterizing the truth either intentionally or mistakenly. \n\nThere were no formal agreements or treaties that laid out NATOs eastward expansion. Even Gorbachev is on record saying there were no promises made.\n\nWas it discussed? Yeah, there are declassified memos about conversations within NATO/US government about the informal assurances to consider not expanding eastward in the 90s. But none of that translated to a formal agreement or wording in a treaty. There’s been Russian propaganda that we made promises and broke them in these “backroom” conversations, but they never became ink on any of the actual agreements so ultimately who cares, if it’s truly what they wanted, then they can ask for it on ink and they haven’t in 30 years. And as President Trump has outlined in his deal making during his first term, the number one rule of doing business even in America, if it ain’t in the contract then get fucked. \n\n\nTo the other points tho, did we know that Russia viewed NATO or does view NATO expansion as a threat? Yeah we do. Have they had hostile languages for expansion? 100%  - But they didn’t invade Finland in the months before they joined which by your logic would be one of the many reasons they invaded Ukraine. \n\nAlso since you’re bringing up the past, There was a short time in the late 90s, early 2000s with Clinton and Bush (Especially after 9/11), where Russia made some light overtures to join NATO. Pretty sure those went straight into the trash can when they invaded Georgia a few years later. \n\n\nSo anyway, my point is there aren’t agreements that were “violated.” President Trump has been very much a strong supporter of putting ink to paper and avoid these sort of “oh but you promised this to me in our talks” sort of bs too and if the Russians truly wanted that then could’ve asked for it when he was renegotiating the INF stuff in term 1 before withdrawing because the Russians weren’t complying.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Infinite_Character_4",
                    "body": "Wouldn't it have been great to see the war ended? Trump was trying hard to do that and Zelenskki shat in the punchbowl!\nThe agreement was already to be signed but Zelenskki would rather keep fighting. That is the truth of the matter.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Funkyfookarate",
                    "body": "This is liberal trolling",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "Republican-ModTeam",
                    "body": "Your Post has been removed due to violation of Rule 5. Do not make comments consisting entirely of leftist talking points or defending leftist ideology.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "Hour-Investigator426",
                    "body": "Russia is not the enemy, our so called \"allies\" and leftists are.",
                    "score": -12,
                    "replies": []
                }
            ]
        },
        {
            "author": "GiantSweetTV",
            "body": "I'm ina wierd spot qhere I sont wanna give Ukraine anymore money, but I'll be damned if I see Russia gain anything from the invasion.",
            "score": 3,
            "replies": []
        },
        {
            "author": "drivebyposter2020",
            "body": "I care about the postwar order in Europe not being destabilized by the Russians. Hating Trump has nothing to do with it. America and the European allies have all prospered for the last 70+ years due to this arrangement -- they have been a market for our goods and have absorbed many elements of our culture, and we have benefitted from trade with them. And European countries (not all of course) even stood with us in Iraq and Afghanistan. \n\nAs.for \"Be Honest: you hate Trump\" being the reason, Trump wasn't even in office when this war started, though some of his conduct surely emboldened the Russians at times during his first term.\n\nAlignment against Russian expansion into their former USSR satellites and republics was a staple of R politics up until 2015 when Trump as the R nominee requested exactly one change to the party platform: backing away from support for Ukraine. And then of course he hired Paul Manafort, former political fixer for pro-Russian former UA president Viktor Yanukovich, as his campaign manager.\n\nDisclosure: my wife is a Russian from Ukraine and has family on both sides of the conflict, so for me it is not a pure abstraction.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LasVegasDweller",
            "body": "Democracy must triumph in Ukraine, why should we cede the freedoms and rights of a nation to a dictator?",
            "score": 12,
            "replies": []
        },
        {
            "author": "Klonoadice",
            "body": "Same deal with the election",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snoo_17731",
            "body": "It’s crazy how the same liberals who pretend to be anti-military industrial complex, are also the same ones begging congress to get more weapons for Ukraine. \n\nThe real winners in this war are: Defense CEOs, Members of congress doing insider trading, Raytheon, Lockheed Martin, General Dynamics, Boeing and shareholders of those companies.",
            "score": 8,
            "replies": []
        },
        {
            "author": "KyleGene1989",
            "body": "Would this not be considered propaganda? Since you have no idea how a mass group of people feels.\n\nI would think a lot not just Liberals have sympathy for Ukraine. \n\nIf Biden acted the way they did they would be mad at him for it I am sure. I don’t think it is because it is Trump. More so how the situation was handled in my opinion. Kind of felt like an ambush. \n\nLook at Elon he doesn’t wear a suit so that comment was absurd. He is literally in the middle of a war. He dresses like that in every country from what I have seen. \n\nThere is also a good amount of evidence showing he has thanked us and other countries multiple times. \n\nBan me if you want. It is an honest opinion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bakerman82",
            "body": "But they changed their profile pic to the Ukrainian flag.  They are helping!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Individual-Meat-386",
            "body": "I hate Russia, but the people who want to keep sending money and guns to Ukraine will be the first people to run away if we ever went to war against Russia. They're happy when they're the ones not dying.",
            "score": 4,
            "replies": []
        },
        {
            "author": "oppzorro",
            "body": "Lol. I shared this on X a few hours ago.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fun_Speed_5818",
            "body": "Sad but true",
            "score": 3,
            "replies": []
        },
        {
            "author": "yourmartymcflyisopen",
            "body": "I am so fucking sick of Ukraine, Russia, Israel, and Palestine. We should not be involved in any of these countries regardless of who is \"right\" and \"wrong\"",
            "score": 5,
            "replies": [
                {
                    "author": "DeanDaddyDugong",
                    "body": "I mean I agree but also Israel wouldn't exist if it wasn't for the US. We've been involved since day 1 😅",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "iliketheletterC",
                    "body": "Jews are the most prosecuted group in history im ok with helping them survive",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "iambkatl",
            "body": "I just don’t want war or people dying why is that being politicized ? Can’t we just agree that no one wants this and it’s not a red or blue thing ?",
            "score": 2,
            "replies": []
        },
        {
            "author": "USANewsUnfiltered",
            "body": "Best meme",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyroughrider",
            "body": "It's going to be the same shit over and over for the next 4 years lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DestituteVestibule",
            "body": "I keep landing on how a ceasefire deal is fine for Gaza for them but not for Ukraine lol\n\nIt makes no sense!!",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BrandDC",
                            "body": "False. You began your reply insultingly, then proceeded to post nonsense. <<Israel's demands were met by hostages being released>>\n\nThe demands were PARTIALLY met. This is clearly one of the reasons why that ceasefire agreement is in jeopardy...\n\nSkewing facts to support your agenda.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RenThras",
                                    "body": "It's also not really \"hostages being released\" so much as \"bodies of dead hostages being returned after being paraded through the streets for Gazan men, women, and children to cheer as the corpses go by like war trophies\".",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "GriffinObuffalo",
                    "body": "I'm not saying Putin is a good dude, nor condoning the war. But Putin was Absolutly proded into this conflict.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "BrandDC",
                    "body": "The \"what about\" game...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "InvestingPrime",
            "body": "Zelenskyy came under the pretense of signing a deal but clearly had no intention of doing so. Instead, he made thinly veiled threats, saying America is \"lucky\" to have water between us and Russia, and blamed every U.S. president since 2014 for doing nothing.\n\nWhen Trump argued the deal would end Russian aggression, Zelenskyy pushed back, saying he wanted safeguards because previous agreements failed. It’s obvious that what he really wants is a **security guarantee**—for the U.S. to commit troops if Russia crosses a certain line, which Trump isn’t willing to do.\n\nThe real kicker? After the meeting fell apart, European leaders rushed to offer symbolic support with statements like \"We stand with Ukraine!\" Yet, **not a single one of them has offered to send soldiers.** They expect America to handle it while they virtue signal from the sidelines.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Most_pdf",
            "body": "We backed Ukraine with so much money already. Time for the rest of NATO to step up",
            "score": 1,
            "replies": []
        },
        {
            "author": "mdana777",
            "body": "What really pissed me off last night is when they didn't stand for that little boy that had brain cancer, and then Laken Riley's mom and sister. The entire Democratic party is a disgrace to our country",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigoldfatman1",
            "body": "I’m just tired of seeing Zelensky applauded as a hero for STILL begging for more money",
            "score": -6,
            "replies": [
                {
                    "author": "yourmartymcflyisopen",
                    "body": "There's no way any Republican actually thinks Zelensky is a hero *or* deserves to be paid so I have no clue how you got down voted so much.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "bigoldfatman1",
                            "body": "Yeah truthfully I commented something similar on another Ukraine republican thread and same thing happened, idk I’m keeping my tin foil hat ready I realize but I truthfully don’t trust Reddit sometimes and the authenticity of its voters if you catch my drift…",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "yourmartymcflyisopen",
                                    "body": "There's definitely something fishy with this app with especially how left-leaning it is. I can't reasonably believe there's this many Republicans who think we should 1. Fund Ukraine and 2. Fund Israel. \n\nEvery republican person I know irl and on other platforms wants to stay the fuck away from both countries, except for those funded by politicians like republican \"influencers\" who are obsessed with Israel. \n\nFuck war in general. America first, keep us out of other countries' bullshit, only go to war if someone threatens us directly or attacks first. That's the way I see things.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Max_Suss",
            "body": "International politics is interesting. Had Ukraine not vowed to join NATO, who knows how things might be different. Lots of lives lost.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Daenys_Blackfyre",
            "body": "It was the left screaming about ending the war before the election, but IDK what they had in mind.  The only way to make them \"Pay\" and lose the war is direct warfare.  We would have to literally start bombing Russian assets in the Donbass openly to get their territory back and make Putin \"pay\".  \n\n You can't sanction them, because they'll just keep trading with China and its allies, so damage would be minimal. So outside of talking to Putin and ending the war on his terms, what do they want to do? He's not just gonna be like \"Alright I'm giving it back, my B dawg\" no, he's got it, he's keeping it, he beat the shit out of Ukraine.  \n\nTo put into perspective, 1/3 of Russians army revolted halfway through the war And marched back into Russia and Ukraine still couldn't recapture any territory. \n\nWe could give Ukraine every piece of military equipment short of nukes, but without troops, they aren't taking an INCH of land that the Russians wouldn't take back.  And now, Putin has all the resources from the Donbass and direct access to the port in Crimea, so why would he agree to give any of it back?   Why would anyone think he's going to agree to any deal that isn't in his best interest?  He doesn't have to, so he won't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sciotamicks",
            "body": "Without the American taxpayer Ukraine would have already become Russia.",
            "score": -3,
            "replies": [
                {
                    "author": "Nebraska716",
                    "body": "You do realize all the countries that helped us in our war on terror after 9/11?  They contributed way more than we have to Ukrainian and they didn’t ask for the money they spent back 5 fold.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "AlBundyJr",
                            "body": "Where do you kids learn this tripe?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "avielectron",
            "body": "This is owned by the dems no matter what. Fuck them for pouring our money into that country and fuck them for laughing when we said Russia is a threat back in the Romney days. Fuck them all around and the crooked ass media spinning it any other way.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Klok_Melagis",
            "body": "This doesn't mean Republicans don't think Putin is the aggressor or that it's somehow wrong to help Ukraine, really it should be Europe's responsibility and if they defeat Putin somehow that'll be a miracle but the risk of WW3 or nuclear war is present. This is in fact how a lot of Liberals view it because the entire war is somewhat manufactured by the media half of the Liberals complaining about it wouldn't even be able to point Ukraine out on a map if they hadn't heard about it through their propaganda sources.\n\n  \nEdit: Also going to go and give the alleged \"Republicans\" here the benefit of the doubt and ask what's the endgame if we know Putin is winning. Why keep the war going? Are you aware they Ukrainians are dying the more we prolong this war?",
            "score": -3,
            "replies": [
                {
                    "author": "bones892",
                    "body": ">what's the endgame if we know Putin is winning\n\nHe's slightly winning, but at massive cost. This war hurts the #2 threat to our way of life way more than it costs us to keep helping the Ukrainians. Imo the endgame is drag it out.\n\nAlso the American revolution was about 8 years. If France said in year 3 \"George is winning this, what's the end game?\" there would have been a significantly different outcome. \n\n>Are you aware they Ukrainians are dying the more we prolong this war?\n\nAnd? If the Ukrainians want to keep fighting, let them. \n\nFrom what I'm seeing recent polling shows half of Ukrainians want a negotiated end to the war, but of that group only about half is ok with major territory concessions, so maybe a quarter of the population supports the deal on the table.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "NonNPC_MaxLevel",
            "body": "They literally so much as admitted in other subs on Reddit. It is amazing how many low IQ people are self-outing themselves lately. ",
            "score": 0,
            "replies": []
        },
        {
            "author": "Danthorpe04",
            "body": "Ding ding ding\n\nZalenskyy and his behavior on Friday is an avatar for the people who hate Trump",
            "score": 0,
            "replies": []
        },
        {
            "author": "EffectiveWindow3347",
            "body": "Whoever wants to die for a piece of land, be my guest. Next please",
            "score": 0,
            "replies": []
        },
        {
            "author": "USANewsUnfiltered",
            "body": "Zelensky is trying to start WWIII",
            "score": -4,
            "replies": []
        },
        {
            "author": "bigfatherb",
            "body": "Why do we call them liberals when they hate liberty?",
            "score": -5,
            "replies": []
        },
        {
            "author": "No_Bench_2569",
            "body": "Finally she admitted it your dont have to like trump he said cause he going take of america that all of us",
            "score": 0,
            "replies": []
        },
        {
            "author": "Swimming-Kitchen8232",
            "body": "honestly. It was always bound to happen especially with the growing fear that Ukraine would join NATO and having a NATO ally so close to Russia would have repeated the event that almost sparked global nuclear war in the 60s with the Cuban missile crisis. The thing I’m so shocked about is how deadly Ukrainian guerrilla warfare has become when Ukraine and Russia are almost the same landscape and Ukraine was so primitive with their weapons that they were using early Cold War era 2M-3  anti aircraft guns strapped to captured Russian IFVs for AA defense and 1950s era tanks. It’s crazy to me that such a huge nation can be pushed back so fiercely as one of the strongest naval powers to supply coastal artillery that was even critically damaged by drones and strike aircraft. Reminds me of the fins defending against the Soviet Union during the winter war.",
            "score": 0,
            "replies": []
        },
        {
            "author": "UnderstandingKey9050",
            "body": "Reall",
            "score": 0,
            "replies": []
        },
        {
            "author": "Agreeable_Garbage336",
            "body": "I tried to make a post in this subreddit trying to show yall that on the democrats subreddit they are claiming the election was stolen…..and the modes took it down because I guess warning everyone was too close to making a liberal talking point.",
            "score": 0,
            "replies": []
        },
        {
            "author": "gm_first",
            "body": "I think we all care about Ukraine but dont want to see ww3. The fact of the matter is he has declared martial law for what reason? He should let an election happen. \n\nZ knows what his country has and wants to sell it but Russia doesn't want to buy it. These two leaders need to work out a deal without involving the military and entire world. \n\nTruth is Ukraine can not survive with support because it wasn't ever meant to be it's own country, it was part of Russia and they somehow broke off. I would be willing to bet if he just made a deal with Putin without Trump he could really show how much of a proven leader he is but he doesn't. He's in it for the billions of dollars he's skimming millions off. \n\nTell me, why would Ukraine leave the Soviet union knowing what they had and not push to join nato or some other alliance before all this broke out? Because its an elaborate money scam. Think of it, if Ukraine was part of Russia still Z couldn't have the chance to control the raw earth sales and take a chunk. It's all a plan.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Reasonable-Bend-9344",
            "body": "https://preview.redd.it/3wkilokksome1.jpeg?width=1179&format=pjpg&auto=webp&s=50d93da27de952bbc8c0a5e357ad8509b49eceb2\n\nThis sums it up for me!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Deaths_Dealer",
            "body": "These so called liberals are literally supporting NAZI’s.",
            "score": -8,
            "replies": []
        },
        {
            "author": "BD_McNasty",
            "body": "Weong",
            "score": -6,
            "replies": []
        }
    ]
}