{
    "title": "The judge who tried to stop the deportation planes is not happy with the Trump administration",
    "author": "drjjoyner",
    "subreddit": "politics",
    "rank": 19,
    "score": 1151,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 197,
    "url": "https://www.politico.com/news/2025/03/17/judge-boasberg-trump-deportation-hearing-00234945",
    "id": "1je4433",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "genital_lesions",
            "body": ">“My oral orders don’t seem to carry much weight,” the judge said.\n\nYeah, well, maybe enforce your orders with the US Marshals so that there is some weight. \n\ntrump's regime is literally doing the same old tactic they've been doing for years: delay with excuses while they get away with everything. Immediate action needs to be done.",
            "score": 1,
            "replies": [
                {
                    "author": "Olderscout77",
                    "body": "The Marshall's Service IS the enforcement arm of the Judiciary BUT they work for the Attorney General who works (or not) for TRUMP.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dry_Examination3184",
                            "body": "Courts can deputize outside of them. Also it's law to follow a legal contempt order, it's stated the Marshalls WILL go so I am hoping someone in there still cares about their job but doubt it. Deputize anyways",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "chaos0xomega",
                                    "body": "Yep, Capitol Police, Metro Police, State Police, etc can all be used to enforce court orders. These judges have a lot of power, they can make life miserable for a lot of people. Id like to see them do something other than make passive aggressive remarks about being ignored.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "I am so burnt out on the finger wagging and brow furrowing. They are continuing to take the axe and the damage is irreperable with no signs of slowing. We know what they are doing and now they are purging all women and minorities, including war heroes, from databases. I am disgusted. The courts need to band together and use the power they have to say enough is enough and halt this. Desperate times call for desperate measures.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "upthetruth1",
                                            "body": "You know Trump will invoke martial law as soon as that happens",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "chaos0xomega",
                                                    "body": "Martial law is more a theoretical concern than a practical one. Theres not a lot of constitutional or legal basis for it, and what basis does exist allows for both Congress and the President to exercise or cancel it, largely as a result of court precedent. Its more likely hed try to leverage the insurrection act (which isnt martial law) to use the military in a law enforcement function to resist court orders, which would very quickly put \"obey lawful orders\" oaths to the test.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "rain-cl0uds",
                                    "body": "If anyone needed a selfish reason, the guy who finally arrests one or more of these pieces of shit for what they're doing will be a national hero.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HyperactivePandah",
                                            "body": "Or a martyr.\n\nEither way the Trump admin has to deal with it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LouQuacious",
                                    "body": "I wonder what happens when deputized marshals try to arrest other deputized marshals.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "Maybe if the people have a court to move with we will move in support with them. We need a leader so bad.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "goneresponsible",
                                            "body": "Pretty sure that’s close to the plot of U.S. Marshalls with the Tommy Lee Jones…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Big-Industry4237",
                                    "body": "AG and the DOJ under trump basically said they wouldn’t enforce anything a judge says if contrary to trump.  That was news weeks ago",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "I am not sure if he purged all of them or not who aren't his. Regardless fuck them, deputize.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "blergola",
                                            "body": "The other tool in the court’s belt is to disbar anyone facilitating the administration ignoring a court order. Trump is only for the next four years. These attorneys will need work after that.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Hillbilly_Boozer",
                                    "body": "Will it matter? Trump is 'immune' and if it's a federal crime then he'll just pardon them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "Civil and state are immune to pardon, the courts can hold them indefinitely until they do what they ask.\n\nAlso, Trump is just a stupid raging old dementia patient. Elon is the one with the axe, Elon is the one keeping it alive with money.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "2a_lib",
                                                    "body": "To that point, $TSLA down 50% since the salute.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nola_husker",
                                            "body": "Not immune from a bullet.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ballrus_walsack",
                                    "body": "Anyone they arrest and charge federally will just be pardoned by trump.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "Not on civil or state charges.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ballrus_walsack",
                                                    "body": "Hence my use of the key word “federally”",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Dry_Examination3184",
                                                            "body": "From what I understand a lot of these cases are specifically trying to avoid that.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ballrus_walsack",
                                                                    "body": "I am not sure what the word “that” means in your reply.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "random-user-8938",
                                                                            "body": "interesting how you change your projected level of reading comprehension based on what fits your argument better.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SampleForsaken1264",
                                    "body": "Courts can also apply civil penalties, that are then directly collected via the financial system.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "blzac33",
                                    "body": "Honest question...couldn't trump just pardon them?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dry_Examination3184",
                                            "body": "Can't pardon state or civil charges.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jgoble15",
                            "body": "Apparently judges may be able to seize property and finances to coerce someone into following the judicial’s orders. Don’t really know much about it but the thought is pretty intriguing. Greed is what got us into this mess, so greed could be turned on itself possibly",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AJFrabbiele",
                            "body": "They need to start handing out contempt orders for fines and/or jail to everyone who disregard, ignores, is slow to act on orders like Oprah. Sure, there will probably be a flurry of pardons, but the repeated couple hours or days in the court's lockup might  start to get the point across at those lower levels.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "greenbigman",
                            "body": "\nIf the Marshals Go Rogue, Courts Have Other Ways to Enforce their Orders\n\nhttps://www.democracydocket.com/opinion/if-the-marshals-go-rogue-courts-have-other-ways-to-enforce-their-orders/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "findingmike",
                    "body": "One remedy I don't see mentioned often is that the judge can refer the lawyers for disbarment. This would create some serious problems for the DOJ.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheSteelBlade",
                    "body": "“I tried nothing and I’m all out of ideas”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lantech",
                    "body": "Surprise,  the United States Marshals Service is actually part of the executive branch.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "greywar777",
                            "body": "Surprise uno reverse card-a court can deputize people to carry out its orders.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ArdillasVoladoras",
                                    "body": "Certain orders in certain circumstances****\n\nThis will only be applicable to civil suits (Trump will pardon or not prosecute criminal matters), which doesn't carry any penalty that is meaningful.\n\nWhat judges can do is sanction the attorneys and also start the process to get them disbarred if conduct is egregious (it is). This is probably the better route anyway since it forces the attorneys to risk forfeiting their future career.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NobodyLikedThat1",
                    "body": "Maybe put them in contempt of court instead of whining about it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AliceInMyDreams",
                    "body": "Where do you think he should have sent the US Marshalls, exactly? To catch the planes in the air? To arrest the executive branch? The Trump admin's arguments for why the orders were invalid or inapplicable are clearly in bad faith, but they are still pretending to follow the law. And when they cease to, expecting judges to be the ones to trigger your revolution isn't very realistic.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "amateurbreditor",
                            "body": "have you ever been to a court or saw a movie or tv show about the law? a judge can send you to jail on the spot. a judge can send a lot of these guys to jail. so dont tell people nothing can be done.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WhiskeyT",
                                    "body": "> or saw a movie or tv show about the law?\n\nThink about the argument you’re presenting here.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lower_Reaction9995",
                                            "body": "They ain't thinking, that's the problem. These people live an idealized world, not reality. They focus on how things should be, not how they are. Screaming at the sky for justice, when the only ones capable of that justice are the people on the ground. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "identifytarget",
                                    "body": "> a judge can send a lot of these guys to jail. so dont tell people nothing can be done.\n\n\"Balliff, arrest that man.\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Paparage",
                                    "body": "A judge can't send you anywhere if there is no one there to enforce their ruling. That's the issue.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AliceInMyDreams",
                                    "body": "A judge can send a random person to jail, but a judge can't exactly send the entire US executive branch to jail - and the decision to ignore the order came from the highest level. What do you think would happen if a judge tried to send US Marshall to throw, say, Elon Musk to jail? Do you think Marshalls would obey? And do you think Elon would comply? I don't think any judge is itching to trigger this kind of conflict.\n\n\nEither the executive as a branch (and not isolated individuals part of the executive, which could indeed be arrested under a rule of law following government) follows the rule of law, and judges don't need to use force, or it doesn't, and judges can't.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "firelight",
                                            "body": "> I don't think any judge is itching to trigger this kind of conflict.\n\nThe conflict is here. If judges are not willing to use force, we no longer have the rule of law. If a judge has reason to jail Musk and the Marshalls won't do it, they'll have to find someone who will and deputize them.\n\nIf the US Executive Branch is not willing to follow The Constitution, then they must be arrested and removed, by (legitimate) force if necessary.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "aspirationless_photo",
                                                    "body": "When judges figure out their unenforcable rulings mean nothing up the hierarchy, I'm afraid most of them will settle for carving out their own fiefdom, ruling down-class: evicting downtrodden homeowners, sending the homeless to prison, etc.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "amateurbreditor",
                                            "body": "you are just repeating the same failed argument.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AliceInMyDreams",
                                                    "body": "You don't exactly have counterpoints...",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "amateurbreditor",
                                                            "body": "I already explained that is not how it works. reddit loves to predict the future, say things that will be true in the future, say so and so cant do that even when they can. A judge can hold anyone in contempt. the only person who is exempt would be the president. to say they cant have musk arrested is simply not true and no one knows what will happen so saying you know just is not true.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AliceInMyDreams",
                                                                    "body": "The framework in which a judge can hold anyone in contempt is the exact same in which judicial orders would be followed by the administration, and in which the executive branch couldn't grant itself prerogatives reserved to congress - or use police force to force entry in a non profit without any legal reason behind it, to take the latest occurrence. \n\n\nJudges have a terrible record of holding people in power accountable even without a hostile executive branch breathing down their neck. In the current climate, that hope basically turns into wishful thinking, because not only would a judge have to decide to involve marshalls, but the marshalls would have to actually comply ignoring their orders from the doj, and then the Trump admin would have not to use force.\n\n\nBut don't take it from me, [take it from a former federal judge](https://www.npr.org/2025/02/11/nx-s1-5292199/retired-federal-judge-nancy-gertner-trump-federal-funding-freeze-restraining-order) :\n\n\n> Nancy Gertner: The court, a judge has said, has tools available to him or her in the first instance. They can cite the parties in front of them for contempt. They can impose fines, of course, since one of the parties—arguably, here, Elon Musk—it's not clear that fines are going to make a particle of a difference. There's even the possibility of imprisoning someone until the order is followed. All of these are obviously empty threats with respect to the defendants in this case. The marshals would have to enforce whatever orders the judge entered. The problem is that the Marshal Service is under the Department of Justice, and if Trump wanted to fully not comply, he could direct the Department of Justice not to comply.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "amateurbreditor",
                                                                            "body": "well that has been debunked on here many times. they can deputize people and absolutely enforce the law. its always been that way. it doesnt go away just because they have more power. musk has no legal power to begin with.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AliceInMyDreams",
                                                                                    "body": "So we've gone from \"redditors make up stuff without knowing the law\" to \"redditors already debunked federal judges, federal judges simply don't know the power they have\".\n\n\n> it doesnt go away just because they have more power.\n\n\nThat's how power tends to work though.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Lower_Reaction9995",
                                    "body": "Which person can they send to jail, be specific.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "afriendincanada",
                                            "body": "Anyone. \n\n“This court gave an order and it was disregarded. I am holding you two (counsel) in contempt and remanded into custody.  Call your bosses and let them send someone down to speak to this. Tell them to bring a toothbrush. We will reconvene at 2.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lower_Reaction9995",
                                                    "body": "And how well has that worked so far? Has Trump responded appropriately to these orders? No? Are officers lining up to arrests the offenders? No? \n\n\nOrders are only effective if there are people willing to follow them. We are well past that.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "afriendincanada",
                                                            "body": "It hasn’t happened yet",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lower_Reaction9995",
                                                                    "body": "And it won't, Trump is so far above the law it's ridiculous. I want nothing more than for this admin to spend the rest of their lives in prison, but it just won't happen. At least not until some type of revolution type event or something causes his base to turn on him. Our justice system just doesn't work as intended. It's a very horrible thing ",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "afriendincanada",
                                                                            "body": "Don’t let the perfect be the enemy of the good. A judge sending counsel out in handcuffs is more than has happened so far.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PlaySalieri",
                                            "body": "Well you can start with the lawyers",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lower_Reaction9995",
                                                    "body": "Which lawyers? Be specific. \n\n\nPeople are always outraged, but they can never articulate what exactly needs to be done.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PlaySalieri",
                                                            "body": "I'd start with the government lawyers in the very case he's ruling on. You throw them in for 24 hours. When they come out you demand the names of the people who put them on the flight.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lower_Reaction9995",
                                                                    "body": "Lawyers are not responsible for the illegal actions, they simply represent the client. The lawyers aren't the ones that are in non compliance, you wouldn't arrest a lawyer if their client continues to break the law.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "PlaySalieri",
                                                                            "body": "Boasberg orally issued an order Saturday to “immediately” turn the planes around. DOJ argued they weren’t bound by the oral order—claiming it didn’t count until written. If the judge believes the government intentionally ignored a valid order, that’s the textbook scenario for contempt.\n\nFrom the article:\n\n> “Why are you showing up today and not having answers to why you can’t even disclose it to me?” the judge asked.\n> \n> As the hearing neared its conclusion, Boasberg demanded that the government answer — by noon tomorrow — a series of questions about the flights and their passengers, as well as exactly when Trump signed the proclamation calling for the alleged gang members to be expelled from the country. He also ordered the filing of more briefs on the legal arguments in the case.\n\nYou throw them in jail for 24 hours for contempt... especially if they ignore this second order.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Lower_Reaction9995",
                                                                                    "body": "I just don't think you get it, Trump admin does not care about court orders, they will just ignore them. No officer is going to arrest these individuals, it will continue to be ignored, just like all the other times Trump has ignored court orders. Orders are meaningless if no one enforced them, the enforcement just will not happen. This is now the reality, Doge has proven that this admin will do whatever they want, regardless of legality.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheDamDog",
                            "body": "The marshals *should* have been on the runway when those planes landed to arrest everybody on board for defying a lawful court order.  They should have gone to the DoJ to arrest all the lawyers who took part in this scheme as well as the AG for ordering it.\n\nBut we don't live in a just world.  There is no justice.  Just us.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cream_Stay_Frothy",
                    "body": "Based on what was said - I think he said that in a condescending way to be a smart ass, not to appease their claim as valid. \n\n  \nI will be curious to see how they respond to his questions and followup, and hopefully, to your point, there are some teeth to any repercussions from the defiance of this order. I am assuming he will now be looking for any little misstep to make a smack down. \n\nHaving the Trump administration boldly defy the court, then DEFY any repercussions is gonna be the moment that really tests whether our institution of democracy works, or if we are gonna have to take a little lessons from History in order to bring the power back to the People: \n\n1989 - Romania\n\n1945 - Italy\n\n1793 - France",
                    "score": 1,
                    "replies": [
                        {
                            "author": "genital_lesions",
                            "body": ">Based on what was said - I think he said that in a condescending way to be a smart ass, not to appease their claim as valid. \n\nIt's difficult to tell since it's reported in a written form, so we aren't able to gauge inflection and tone of voice. \n\nBut even if it was said as a sarcastic remark, it's still not helpful. This person is a federal judge. Judgements are to be enforced, and the judge is failing to meet the moment by making the trump regime comply vis-a-vis *law enforcement* personnel.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Stillwater215",
                    "body": "If there’s no consequences for disregarding oral orders, then in fact they do not have weight. An unenforced law isn’t a law; it’s a suggestion.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IrishMosaic",
                    "body": "How soon will we run out of Tren de Arabia members at the current rate?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yourlittlebirdie",
            "body": "I don't think most people realize just how incredibly frightening and dangerous this is. Our democracy is teetering on the edge of a cliff here.",
            "score": 1,
            "replies": [
                {
                    "author": "whatproblems",
                    "body": "sc better get a strong word in or it’s all off the rails.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cloudy_ft",
                    "body": "I don't think most Americans realize that the rules will not matter if no one in the government will stand up and hold him accountable especially if all those agencies that are **supposed** to be doing this are being dismantled... \n\n  \nAt some point, the laws will be less what we have decided together as a society, and more to what Trump and the cult says it to be. \n\n  \nThe man is literally making up that boycotting and protesting is a crime. We laugh at how ridiculous that sounds, until it's not. The irony of Kanye West warning people long ago, no man one should have all that power... What kind of fucking timeline are we in.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "howisthisacrime",
                            "body": "He can't be held accountable by the law anymore. The supreme court already ruled that he can't be charged for \"official\" acts so unless some citizens string him from some rafters he will face no consequences.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "UniqueUsername82D",
                                    "body": "It seems there is only one way we make it out of this with the country intact, and it's for someone to take action and soon.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Mutchmore",
                                            "body": "Sorry mate but the country will not make it out intact\n At the very least on the international stage",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "heatherLovesbrandon",
                    "body": "Those of us that do know are really screaming into the abyss here...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "superturtle48",
                    "body": "I’m sure many people are ok with it because they agree with Trump’s agenda of deporting immigrant “criminals,” and they don’t have the critical thinking or information sources to not take him at his word. Similarly, he’s also been going after pro-Palestine and Muslim immigrants without due process since the “fighting antisemitism” angle also gets popular support. Obviously, both of those agendas are just cover-ups for racist xenophobia but twisted to seem like common sense. Trump’s going to start with what seems like popular and sensible actions that violate court orders in order to get the public rooting for him, and then he’s going to push it farther and farther until the courts might as well not exist anymore and it’s too late to protest. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yourlittlebirdie",
                            "body": "Literally what the \"first they came for\" speech is all about.\n\nWhy is it so hard for people to learn from history? It never stops with \"those people.\" Sooner or later, you, too, will become one of \"those people.\"\n\nAnd it never ceases to amaze me how many of these same people think we have the 2nd amendment to \"prevent tyranny.\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Popculturemofo",
                    "body": "I think it’s already fallen off the cliff.  It’s gone.  We now have a dictatorship.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yourlittlebirdie",
                            "body": "We don't literally have a dictatorship yet, and I wish people would stop obeying in advance and giving up already.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "massive_cock",
                                    "body": "Dictatorial actions do not make a dictatorship. Compliance does. This is exactly right. So many people giving up with just the first few court rulings, or violations thereof...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BanjoB0b",
                    "body": "Democracy has gone \"off\" the cliff. Your president is ignoring the law, and so does the rest of his party. And the Democrats are doing nothing to stop them, and you civilians are doing nothing to stop them. Who or what exactly will save your democracy?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yourlittlebirdie",
                            "body": "I realize that people want simple, Hollywood-like answers to everything but it's a lot more complicated than this. We have not actually gone off the cliff yet, and giving up and saying \"well it's already a dictatorship now\" is not helpful.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Brock_Hard_Canuck",
                    "body": "\"John Marshall has made his decision, now let him enforce it!\"\n\nSCOTUS: \"Hey Mr. President, maybe take things a bit easy on the Native Americans there, okay?\"\n\nAndrew Jackson: \"Screw you, I'm gonna do what I want!\" *(Begins Trail of Tears)*\n\nAndrew Jackson realized almost 200 years ago that the Court's power comes from good faith, and respecting the Court as an institution.\n\nAs for what happens now?\n\nWell, I bet we'll see more of the same as we've been seeing recently. Judges wagging their fingers at Trump in a futile effort to control him, while Trump happily ignores the courts and has his presidential style go full Cartman - \"Screw you guys, I do what I want! Respect my authoritah!\".",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tookoofox",
                    "body": "I do. Fat lot of good it's doing me.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Few_Village_7183",
                    "body": "It’s scary than an appointed judge thinks he can have planes turned around mid flight at his whim. Hopefully our democratically elected officials can curtail these acts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "yourlittlebirdie",
                            "body": "What do you think the job of a judge is, exactly?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Silver_Double4678",
                            "body": "You don’t understand how laws work",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "vicvonqueso",
                            "body": "Planes are diverted just to serve warrants and this is where you draw the line?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DartTheDragoon",
                            "body": "> It’s scary than an appointed judge thinks he can have planes turned around mid flight at his whim.\n\nWhat about that is scary. It's a pretty mundane request.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LatterTarget7",
                            "body": "The officials shouldn’t be able to just ignore the judge. That’s not how it was designed.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Indubitalist",
                            "body": "I love that you seem to be inadvertently arguing for proportionate checks and balances. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MagicBingo",
            "body": "Trump's actual defense is that \"the planes were in the air and a verbal order doesn't have the weight of a written order so we ignored it\".\n\nThe party of Law and Order.",
            "score": 1,
            "replies": [
                {
                    "author": "Cute-Ad2879",
                    "body": "They are testing the waters here with the verbal order thing. I'm not sure what the end game is but Levitt was saying they were going to fight that part in courts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HarpySeagull",
                            "body": "It is not “testing,” they literally just did what they intended and said whatever; meanwhile everyone focuses on what they said instead of what they are doing and will continue doing, and there are zero meaningful consequences.\n\nThere is no “end game,” buddy, this is it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "I_who_have_no_need",
                                    "body": "Court cases turn slowly.  The prosecutor flat out told the judge that this was the position of this superiors at DOJ.  Expect senior prosecutors and perhaps department head Bondi answer as Boasberg builds the case for sanctions and contempt.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ArdillasVoladoras",
                            "body": "There's nothing to fight, attorneys have a duty to inform their client of proceedings in court. It has been covered before. The attorneys need to be sanctioned and/or disbarred.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Cute-Ad2879",
                                    "body": "No, she literally said that they are going to find out just how binding an oral order from the courts are. They are taking the stance that oral court orders are not real. \n\n\nIt looks like a way of just doing shit they want regardless of the courts ruling until the courts process paperwork, which can take hours or days. Basically a free pass with no repercussions. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ArdillasVoladoras",
                                            "body": "They have always been binding, it's basic professional ethics for attorneys. Like a lot of what they're doing, they know the fight is stupid and just wasting resources for the Court. The judges need to sanction the attorneys.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rickeyspanish",
                    "body": "I don’t even know why they even tried. They should’ve sent an intern to yell baba booey at the judge. The outcome would’ve been the same.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "inquisitive_guy_0_1",
                    "body": "Which is completely asinine. The judge wasn't ordering the planes, the judge was ordering the administrators to (order the) plane to turn around.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "McNuttyNutz",
            "body": "Less talk more arrests ffs",
            "score": 1,
            "replies": []
        },
        {
            "author": "justbecauseyoumademe",
            "body": "So what will happen.. more paddles in congress.. a strongly worded letter.\n\n\nGasps of surprise?\n\n\nMaybe they will coordinate the outfits they are wearing. ",
            "score": 1,
            "replies": [
                {
                    "author": "Bhockzer",
                    "body": "I'm waiting for the installation of a Congressional Fainting Couch",
                    "score": 1,
                    "replies": [
                        {
                            "author": "QuicklyQuenchedQuink",
                            "body": "Should improve efficiency over gasps and paddles",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wtkillabz",
                    "body": "I bet they get a stern finger wagging this time!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cantgrowneckbeardAMA",
                            "body": "Schumer is gonna glare at them over his glasses so hard this time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "genescheesesthatplz",
                    "body": "You’re forgetting being very concerned!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moda75",
            "body": "There is no way that we are going to avoid some very ugly times here in the US. Whether the people push the issue or the fascists go too far, there WILL be a breaking point. I just don’t see how we get out of this without something incredibly stupid happening. I have a daughter about to go off to college in the fall. A son in middle school and this is the shit that they are facing. I know I am not unique, that there are millions and millions in the same situation, but it is just heartbreaking that we went from where we were to where we are headed. Seemingly inevitably.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiedfor3rd",
            "body": "Well it’s a good thing he’s immune to prosecution for all his crimes. Otherwise he may be held accountable.",
            "score": 1,
            "replies": [
                {
                    "author": "Rguy315",
                    "body": "Trump might be, but trump wasn't the one flying the plane. People carry out unlawful or unconstitutional orders and they are not immune.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tiedfor3rd",
                            "body": "Oh you think Like Elon said “Hitler didn’t kill people civil servants did” that’s a good one…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Trapezoidoid",
                    "body": "Thank goodness for the fearless Democratic Party leadership and their abject failure to take any action whatsoever to stop this over 4 years entire years in power. Obviously America needs decorum more than it needs justice or democracy or checks and balances or consequential action against tyranny.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "key1234567",
            "body": "Thanks alot Merrick Garland, Mitch McConnel,John Roberts, Joe Biden, these men didn't do shit. It is what it is, we will get through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ashamed_Anywhere_877",
            "body": "It’s the same episode everyday.. it’s beyond dull at this point",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cute-Ad2879",
            "body": "Ooo that judge is so mad. There is going to be some real tutting going on. Trump better watch out because he is going to get a visit from the marshalls with a letter that lets him know how mad this judge is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Koharagirl",
            "body": "Maybe he should try wagging his finger at them. That’ll teach them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raspberries-Are-Evil",
            "body": "Judge is a coward like the rest of them.\n\nHold these lawyers in contempt. Put them in fucking jail for 48 hours every single time they refuse to answer a question, or, fucking lie.   Sanction them, and then report them to the bar- if every lawyer who does this shit for Trump winds up in jail and disbarred, they won't have many lawyers left willing to keep breaking the law.\n\nFight these fucking fascists Im so tired of the \"not happy\" and \"slams.\"\n\n  \nDO SOMETHING.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wynnduffyisking",
            "body": "This is just a continuation of the strategy followed since the minute Trump took office: gradually (but quickly) push the entire system of government to its limits and see where the cracks develop. Then exploit those cracks and undermine the system like termites until everything except the executive branch collapses. Then you have your king. \n\nStart out by gutting federal agencies without consent from of congress… nothing happened - great. Next, try stripping away the rights of a group of people already demonized by disinformation campaigns… crickets. Awesome. Now it’s time to blatently ignore court orders and see how that plays out. \n\nWhat’s next? \n\nThis is not a slippery slope. This is a steep hill that’s been greased up more than Trump’s arteries. And America is hurdling down it. \n\nAnd we here in the rest of the world are watching it happen in part disbelief, part disgust and part fear.",
            "score": 1,
            "replies": []
        },
        {
            "author": "atticusfinch1973",
            "body": "So who's going to actually do something about it. This is the equivalent of saying \"Stop! Or I'll say stop AGAIN!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stinkstinkerton",
            "body": "The checks and balances I was endlessly told about in school haven’t  done Jack shit to stop this orange bag of human garbage and his greedy fascist cohorts. As an American citizen what are my options ? \nWait for the next election that might never happen again ? Pay my taxes get nothing back  and hope it all goes away ? Leave the country ? \nProtest and get arrested or killed ? \nAmericans have been fucked hard this time and this hasn’t even gotten started yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mkt853",
            "body": "He's not happy because he just realized his job is pointless if he can just be ignored.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StarsBear75063",
            "body": "It is said that President Andrew Jackson had a problem with a Supreme Court decision and said, \"John Marshall has made his decision; now let him enforce it\".  \n\nRealistically, what CAN the judiciary do?",
            "score": 1,
            "replies": [
                {
                    "author": "Shatteredreality",
                    "body": "The judiciary can hold officials (up to and including POTUS) in contempt and order them jailed. \n\nTraditionally the US marshals would be the ones responsible for enforcing a contempt charge but as they ultimately report through the DOJ the courts may need to deputize an outside party (local or state police as an example) to carry out the order. \n\nOf course there are other logistical challenges but that should be the mechanism used.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Enchilada0374",
                            "body": "Under what authority can judges deputize?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Shatteredreality",
                                    "body": "It’s one of those things that I’m not sure has been truly tested but the thinking stems from Federal Rules of Civil Procedure rule 4.1. \n\nIt’s the provision that gives the marshals the authority to enforce civil contempt and also allows for others appointed by the court to serve a similar function.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Enchilada0374",
                                            "body": "Is that an act that can be repealed by Republicans?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "damnthistrafficjam",
            "body": "“Do what thou wilt shall be the whole of the Law”- Aleister Crowley \n\n(and Donald Trump)",
            "score": 1,
            "replies": []
        },
        {
            "author": "HungryPurplePanda",
            "body": "Let’s see some corrective measures please, what did they call it? Balanced checks, checking balance, checks and balances? Do we even remember anymore?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thedoppio",
            "body": "Which lawyers are being charged with contempt? Anyone in the administration being charged? No? Another strong worded letter that will be thrown out before reading incoming…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Searchlights",
            "body": "And because Trump controls the entire law enforcement apparatus, unhappy is the most a judge can be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Punner-the-Gr8",
            "body": "Same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "astral__monk",
            "body": "Hey Your Honor, guess what? If you don't actually do anything about this attack on your legal authority, then you're *complicit*.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoTomorrow2020",
            "body": "By their arguements, I could be given a restraining order, but until it was written down and in the public record, I could stand 2 ft from the person despite the judge ordering me to be 50' away from them.  I don't have to do anything a judge says unless it is written down?  Yeah, that arguement isn't going to float.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Codipotent",
            "body": "> Only minutes before the hearing Monday, the Justice Department took the unusual step of asking a federal appeals court to remove Boasberg from the case altogether.\n\nInsane considering Jack Smith never asked for Canon’s removal, even though she broke the law over and over again to benefit Trump.\n\nBut Trump’s DOJ has no issues asking for such remedies. We were all told how hard it is to get removal so it’s smart to not ever ask yada yada. \n\nI feel like Smith, Mueller, Garland had to have all been in the bag for Trump. It makes no other sense how they slow walked and did barely anything to ensure the country would be protected from this take over. They apparently had every tool available and chose to use none of them. Absolutely insane",
            "score": 1,
            "replies": []
        },
        {
            "author": "chubs66",
            "body": "The Trump admin's worst nightmare has just arrived. The judge whose lawful order they ignored is unhappy with them. This will definitely deter this kind of lawless behavior in the future. Great job, judge. Way to hold them to account.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ObscurePaprika",
            "body": "He should ask some dems in congress to strenously object with him. That'll do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "518doberman",
            "body": "Trump already  dude threatening him, it's time the judicial starts flexing and putting this administration to the test to see what our future is truly going to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lostpassword100000",
            "body": "Contempt of court.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kind-City-2173",
            "body": "This isn’t about criminals and gang members. This is about having a process in place. Right now, the White House can unilaterally say who is a gang member without presenting evidence or having a court hearing. That should scare everyone.\n\nOutside of this, there have been numerous instances of scary situations with border control and ICE regarding properly documented people with no criminal record while trying to get back into the country",
            "score": 1,
            "replies": []
        },
        {
            "author": "VictoriousTree",
            "body": "He’s unhappy? Well that will sure show him. 🙄",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_Composer43",
            "body": "But is he as “concerned” as Susan Collins?  Or is he actually going to hold them accountable?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Popculturemofo",
            "body": "America is now a dictatorship.  Can’t say we didn’t warn you.",
            "score": 1,
            "replies": [
                {
                    "author": "Punner-the-Gr8",
                    "body": "[DiCaprio pointing gif]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JWBeyond1",
            "body": "There are no judges under a dictatorship. Enjoy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lnc_5103",
            "body": "Trump is threatening the Judge again on Truth Social. Blabbering idiot but still horrifying and needs to stop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Birdius",
            "body": "I mean, what does it matter when the judge apparently doesn't have any authority?",
            "score": 1,
            "replies": [
                {
                    "author": "MarsupialNo908",
                    "body": "The lawyers for the government aren’t fighting that in court. The judge clearly has authority as has been shown by several court hearings on the matter. The issue at hand now is whether the Trump administration willingly and knowingly defy the order.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DickWallace",
                            "body": "\"...defy the orders.\"\n\nThey have and they'll continue to do so until there's consequences.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Imagine_soggy_bread",
                                    "body": "You should do something besides type on a keyboard about it, bro. Anybody can type fanfiction on Reddit, but do you have the balls to actually do something?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DickWallace",
                                            "body": "Yes. Where to start?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Olderscout77",
            "body": "The Judge is SOL because Trump could care less what any Judge tells him. The Founders gave the Legislature the Power of the Purse, and the Republican Legislature has handed that over to Trump. They gave the Judciary the Power of the Law, but Trump has ignored the Law his entire life and is not about to start now. The only power remaining is the Power of the Sword, and Trump is purging the military leadership to make sure he alone can wield that sword.",
            "score": 1,
            "replies": [
                {
                    "author": "TheDamDog",
                    "body": "The Republican legislature and 10 Democrats.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "This submission source is likely to have a soft paywall. If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\". [More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "godzillachilla",
            "body": "I bet they're shaking in their boots",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevolutionNumber5",
            "body": "I mean, who is?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brisbanoch30k",
            "body": "Another NoShitSherlock moment",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrymmTravel",
            "body": "Commence with the finger wagging!",
            "score": 1,
            "replies": []
        },
        {
            "author": "kittyonkeyboards",
            "body": "the judge needs to escalate. we can't survive more judicial cowardice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AppleExotic7494",
            "body": "There is another hearing today at noon, I believe. FYI.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sandsnorkle1",
            "body": "I know that Trump basically has immunity because of the supreme court’s ruling but can’t everyone else involved be arrested for contempt?",
            "score": 1,
            "replies": []
        },
        {
            "author": "wutangslangsword",
            "body": "Same bro!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blackboard_Monitor",
            "body": "Who could have seen this coming!?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few-Influence-398",
            "body": "So he will…?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MajorBeyond",
            "body": "Look out, he's got a harshly worded memo!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Schiffy94",
            "body": "Not happy, galled, evident frustration, raised voice. \n\nYou know what all these are missing, Judge Boasberg? Actionable charges.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fake-name-here1",
            "body": "Incoming stern letter. Watch out!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eddiebaby7",
            "body": "Oh no!  Will he use harsher language next?!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Okanaganwinefan",
            "body": "Dear 🇺🇸your Constitution is under attack…. Open eyes, the Orange Dictator is coming for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MGrantSF",
            "body": "Uuuuooaaahhhh, strongly worded letter incoming. That should do it. /s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "inbredalt",
            "body": "Judge is crying but like, just do something about it ffs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ging287",
            "body": "Hold the show cause hearing judge. Eviscerate them on the record. Make your record very clear. Do what you have to. To ensure the rule of law continues and your orders are not flaunted. Let the chips fall where they may.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azdatasci",
            "body": "He needs to hold them in contempt and jail them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "marksrod",
            "body": "Democracy is dead. \nThe President is not accountable to the Supreme Court or the Constitution and is free to reign as he pleases. \nThe Supreme Court is not accountable to the Constitution because it’s a handpicked extension of the GOP policy machine and twists the constitution to support a fascist Christian nationalist agenda. \nCongress is not accountable to its constituents because the oligarchs pay for their election campaigns and have unfettered access to dictate how they vote on issues (see town halls-this is NOT how oligarchs communicate with members of congress) \nThe press (who is supposed to have an adversarial relationship with Washington) is owned by the oligarchs, in bed with the politicians, is muted by money and not accountable to the people. \nIn other words, unless you have billions, the only role you play in Democracy is to add a veneer of legitimacy by “voting” on issues that you have been lied to about on TV and the media which is controlled or at least influenced by the oligarch billionaires. (See every right wing show, podcast, news etc…)",
            "score": 1,
            "replies": []
        },
        {
            "author": "sonofachikinplukr",
            "body": "The Judges need to deputize some retired federal marshalls and maybe a few sheriffs. The marshall service was started to enforce the rule of law. Then some idiot put them under the doj",
            "score": 1,
            "replies": []
        },
        {
            "author": "ericypoo",
            "body": "How long until he’s killed or fired?",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Counter9859",
            "body": "These judges are underqualified if they're not checking the branches to the proper extend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AllUsernamesInUse_",
            "body": "Legitimate question here, I see day by day people saying that trying to deputize Marshalls or other court officials will be pointless as they will refuse to comply as there is a high likelihood they are Trump supporters. \n\nCould a court hypothetically deputize private citizens willing to make the arrest on behalf of the Court? There are plenty of private citizens who would be willing to come and do this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisHalfBakedGuy",
            "body": "Then fucking doing something about it!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deckard2022",
            "body": "The very example of white washing. \n\nShame on you America, sort your shit out !",
            "score": 1,
            "replies": []
        },
        {
            "author": "THSSFC",
            "body": "\"Alleged\" Venezuelan nationals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "THSSFC",
            "body": "\"Alleged\" Venezuelan nationals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "teebird_phreak",
            "body": "Looks like we can all just break whatever laws we want now",
            "score": 1,
            "replies": []
        },
        {
            "author": "rerunderwear",
            "body": "Brows have been furrowed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saxobeat28",
            "body": "Ok. THEN ACTUALLY DO SOMETHING.",
            "score": 1,
            "replies": [
                {
                    "author": "mrbbrj",
                    "body": "Se d the US Marshals",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deep-Ad9239",
            "body": "What is with these lame silly headlines",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feeling-Guitar6046",
            "body": "we’re headed for a major confrontation. I believe we’re headed for a civil war. I know which side I’m on. I’m with the good guys here. I’m a 60 year-old white cradle Roman Catholic tell recently registered Republican who knows which side I’m gonna fight on in this fucking civil war against these motherfuckersthese Nazi motherfuckers",
            "score": 1,
            "replies": []
        },
        {
            "author": "iMDirtNapz",
            "body": "Should have just complied with the judge and turn the planes around. \n\nThen roll up to the judges neighborhood and release all the deportees. I’m sure the judge won’t mind.",
            "score": 1,
            "replies": []
        }
    ]
}