{
    "title": "Islam talks about people comparing him to Khabib",
    "author": "Shamsud-deen",
    "subreddit": "ufc",
    "rank": 17,
    "score": 1605,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 146,
    "url": "https://v.redd.it/24zdth37lepe1",
    "id": "1jdzqiq",
    "selftext": "",
    "comments": [
        {
            "author": "Eagle-Goat",
            "body": "https://i.redd.it/eyjbruavtepe1.gif\n\nFame and money showed the type of person Khabib is..",
            "score": 483,
            "replies": [
                {
                    "author": "BenjyNews",
                    "body": "poor conor",
                    "score": 95,
                    "replies": [
                        {
                            "author": "Meg0vore12",
                            "body": "Used to feel bad for him, at this point he’s beyond a lost cause",
                            "score": 77,
                            "replies": []
                        },
                        {
                            "author": "Eagle-Goat",
                            "body": ">poor conor\n\nI find it hard to feel sympathy for a rapist.",
                            "score": 107,
                            "replies": [
                                {
                                    "author": "Snoo_64007",
                                    "body": "Ehhh was it proven though?",
                                    "score": -66,
                                    "replies": [
                                        {
                                            "author": "BKR93",
                                            "body": "Really?",
                                            "score": 31,
                                            "replies": []
                                        },
                                        {
                                            "author": "BismarckBug",
                                            "body": "Bro if you don't believe it at this point then you're just a rape apologist, idk what else to say.",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "Snoo_64007",
                                                    "body": "That would be true.... if he were proven guilty 🤷🏾‍♂️",
                                                    "score": -38,
                                                    "replies": [
                                                        {
                                                            "author": "NotAnNpc69",
                                                            "body": "My man he fucking paid out the girl who was alleging rape.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "Expensive-Twist8865",
                                                                    "body": "That's not an implication of guilt... Many cases get paid off because it's easier and cheaper than fighting it in court.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ItsMichaelScott25",
                                                                            "body": "To be fair - he did fight it in court and he lost. He didn’t just pay her off and get an NDA signed.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Expensive-Twist8865",
                                                                                    "body": "He lost a civil case, where the standard of proof is \"the balance of probabilities,\" which is lower than the \"beyond a reasonable doubt\" in a criminal court. He also didn't pay her off, it was a court ordered payment.\n\nThen finally, he was found liable of sexual assault, not specifically rape. Sexual assault can be something as trivial as unwanted touching or verbal coercion. Unless they make note of the severity, it's vague.",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ItsMichaelScott25",
                                                                                            "body": "> cheaper than fighting it in court.\n\nOh I agree - I'm just pointing out that in this case Conor didn't just pay her off and fought the case in court.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "tvsklqecvb",
                                                                    "body": "Can we not spread misinfo at least? He's a piece of shit, but that was a civil court. What the fuck do you think the jury voted. \n\nThere was no damning evidence, her story was shaky at best. They also spotted her on camera *hugging* him goodbye the night of the alleged rape. She also claimed he said \"ill show you what it feels like to tap\" while supposedly choking her. Like there's a lot of good reason to doubt her as well. \n\nGuys like Connor are easy fucking targets because of their garbage personas, doesn't make them a rapist. The amount of athletes that get baited into this shit its like daily my guy. \n\nIf he raped her and there was solid evidence, fine go castrate and send to jail forever. But all evidence pointed to her story being bullshit, and pretty much would've been tossed out in a criminal court. They did the smart thing to get money off him.\n\nHe's a piece of shit but rapists are fucking scum, even worse than Connor. I hate how easily that word gets thrown around cause people don't like the guy. Like being a rapist is fucked up, one of the worst things you can possibly be.",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GasMysterious3386",
                                                                            "body": "Stop being a rapist defender, it’s weird 🫤",
                                                                            "score": 9,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "National-Bit519",
                                                                            "body": "This is the most amount of sense anyone has spoken on this subreddit. but you'll get downvoted coz it doesn't suit the agenda of the haters.",
                                                                            "score": -6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GasMysterious3386",
                                                                                    "body": "There’s more than one reason to hate Conor 😂",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Snoo_64007",
                                                                    "body": "Wait, Wait, Wait, time out. Take it off Conor for a second, you saying he paid the girl like that proves something. You think paying someone who accuses you of something is an admission of guilt? He had to do that because for every day that case is active he loses money. He very well could be guilty but the that he paid the girl off doesn't prove that shit at all.",
                                                                    "score": -5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ketofol-",
                                                            "body": "Everyone knows OJ was guilty. Even the black people supporting him knew he was guilty. Yet he was acquitted. \n\nDoes that change the fact that OJ is a murderer?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Snoo_64007",
                                                                    "body": "People know that OJ did it because he wrote a book detailing how he did it 😂😂😂😂 TF are Y'all talking about?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "CryptoBanano",
                                                            "body": "There was a trial, and yet you still deny and will come up with a shitty ass excuse. Youre a rape apologist just admit it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Snoo_64007",
                                                                    "body": "My boys you sound dumb af. \"Oh there was a trial\" yes because when you're charged with something and you fight it, you go to trial. You have no idea how the Law, take that shit somewhere else.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CryptoBanano",
                                                                            "body": "Imagine defending a rapist for free on the internet",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Snoo_64007",
                                                                                    "body": "Imagine being illiterate. Thank God I can't relate.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MillwrightTight",
                                            "body": "Yes, actually. Dude was convicted",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Snoo_64007",
                                                    "body": "No he was, he was just found liable.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Expensive-Twist8865",
                                                    "body": "He wasn't though",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "SaveMeSomeBleach",
                                                            "body": "Right, but arguing semantics in this case is no different than taking the stance that OJ wasn’t a murderer.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "JuggernautGog",
                                                    "body": "You can find a lot of reasons to hate him, so I don't think you don't have to spread misinformation to dump on the dude. He is **not** a convicted rapist.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Sad-Investigator-991",
                                    "body": "How you know he is a rapist?",
                                    "score": -39,
                                    "replies": [
                                        {
                                            "author": "Eagle-Goat",
                                            "body": "I'm not interested in starting a 243 comment chain about semantics and the weight of civil judgements. He is a rapist, that is all.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "Sad-Investigator-991",
                                                    "body": "So you don't have an answer you follow what the system says and your feelings to judge someone without having any proves except what other people say without thinking it's true or not. 🐑",
                                                    "score": -41,
                                                    "replies": [
                                                        {
                                                            "author": "MillwrightTight",
                                                            "body": "It's called a court of law dude. What else do you have to go off?",
                                                            "score": 24,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Sacabubu",
                                                            "body": "I'm a sheep for the court and the \"system\". You're a sheep to a coke addict.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RBZk",
            "body": "Everyone deserves friends like Khabib and Islam",
            "score": 209,
            "replies": [
                {
                    "author": "RealNajiOnTop",
                    "body": "But bad people take advantage of good people.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Silent_Shaman",
                            "body": "If the nice person is Khabib I think they'd reconsider",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "SendTittyPicsQuick",
                                    "body": "You really don't want to fuck with either Khabib or Islam. Imagine you know they're also humble dudes, fucking crazy man. I'd just smack my own teeth out I think.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "traws06",
                                    "body": "😂 this is true",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "The_Nomad89",
                    "body": "Everyone? I disagree",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stunning_Grape3316",
            "body": "You have friendship like this and then you have friendship like Artem and Conor",
            "score": 208,
            "replies": [
                {
                    "author": "TraditionalYear4928",
                    "body": "They still talk\n\nBut only through lawyers",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "AnimatorKris",
                    "body": "Lol what happened between them?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "TarasBulbaNotYulBryn",
                            "body": "Sued each other",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "AnimatorKris",
                                    "body": "Over what?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FragileAnonymity",
                                            "body": "Iirc, Artem claimed that the whiskey idea was his or he was a contributing factor to it.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Pop2662",
            "body": "I wish somebody would talk about me like Islam talks about khabib",
            "score": 53,
            "replies": [
                {
                    "author": "realtomedamnit",
                    "body": "Watch Khabib and his team talk about Abdulmanap and you'll understand",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Professional_Pop2662",
                            "body": "Coach please let me out!!!!!!!\nBrother look at me please this could be the last moment of your life 😂😂😂😂😂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "suffering_online",
            "body": "I genuinely don’t understand how anyone can hate Khabib and Islam. The Abdulmanap legacy is one of the most compelling stories in MMA.",
            "score": 306,
            "replies": [
                {
                    "author": "TraditionalYear4928",
                    "body": "I think a lot of their hate stems from their cultural and religious beliefs.\n\nHaha downvoted just for saying my opinion on it.\n\n\nProved my point.",
                    "score": 213,
                    "replies": [
                        {
                            "author": "Augustus_Chevismo",
                            "body": "Yeah Khabib’s belief that saying it’s ok to draw cartoons and you shouldn’t be murdered for it is worse than murdering people over cartoons.\n\nType of thing that makes it hard to be a fan of the guy.",
                            "score": -116,
                            "replies": [
                                {
                                    "author": "PropertyOk9904",
                                    "body": "I’m a little lost on this. Did khabib explicitly support the killing of cartoonists ?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "PantojaLover69",
                                            "body": "He didn't. He commented on macron allowing the mockery to occur and insulted macron. Very high iq professional Redditors take it as him endorsing the killings.",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "author": "PropertyOk9904",
                                                    "body": "Ah I figured -the classic Reddit strawman: If you don’t explicitly condemn every unfortunate event, you endorse it.",
                                                    "score": 17,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheConsultantIsBack",
                                                    "body": "https://preview.redd.it/0jrzerjhlhpe1.jpeg?width=1080&format=pjpg&auto=webp&s=c3ae187bef4f062dd2a8eeacc909ef4c520523cd\n\nBreh he didn't just comment lmao, what is this revisionist history... He posted a photo of Macron with a boot imprint over his face immediately after Macron made a speech saying the execution of teachers for drawing cartoons of Mohammed is unacceptable.\n\nEdit: here I found the post, just a cute lil comment on the matter, nothing to be concerned about here.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "PantojaLover69",
                                                            "body": "🤡",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "PropertyOk9904",
                                                            "body": "Still didn’t say cartoonists should be killed tho",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "azarov-wraith",
                                                            "body": "You are lying through your teeth. Macron outright stated that he supports mocking the prophet and said literally that they will teach their children to mock Islam, while also displaying offensive cartoons of Muslims on presidential buildings.\n\nHe went out of his way multiple times to antagonize Islam as a religion. He is scum, I don’t support terrorism but that doesn’t make macron less of a piece of shit.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "TheConsultantIsBack",
                                                                    "body": "I'm lying? I literally posted a screenshot of the source...\n\nMacron defended the right to do that. Ik that might be tough for you to understand but yes, in democratic societies that value freedom of speech you do indeed have the right to mock any belief and not risk getting decapitated for it.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "azarov-wraith",
                                                                            "body": "Macron didn’t defend the right to do that. He went out of his way to participate in it!!\n\nWhat individual citizens do is not equitable to what a government sponsors in its totality. Macron used France as a cudgel to attack a whole religion (which many French people call their own). \n\nYour purposeful obtuseness is not conducive to a proper discussion and therefore I won’t waste my time with you anymore",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TraditionalYear4928",
                                    "body": "And that's fair and I completely disagree with that view and his views on women.\n\nBut some people like to pretend that's not a reason why he has haters, they downvoted it instead of admitting it like you.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "VivianRichards88",
                                    "body": "You’re right, that’s all islam is about",
                                    "score": -32,
                                    "replies": [
                                        {
                                            "author": "Augustus_Chevismo",
                                            "body": "Never said that. Can you provide an example of Khabib speaking up for the victims or condemning the attackers?",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "VivianRichards88",
                                                    "body": "Yes because that’s what expected of a Muslim to be a good person, condemn others",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "Augustus_Chevismo",
                                                            "body": "Yes a willingness to express complete disapproval of murdering innocent people is a requirement to be a good person.",
                                                            "score": -9,
                                                            "replies": [
                                                                {
                                                                    "author": "CanadianCamel",
                                                                    "body": "Ah yes such moral high ground from someone who probably never condemns the USA for constantly bombing innocent people, constantly starting wars in other countries, and continuing to provide millions so that Israel can keep bombing children",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Augustus_Chevismo",
                                                                            "body": ">Ah yes such moral high ground from someone who probably never condemns the USA for constantly bombing innocent people, \n\nI condemn the USA for bombing innocent civilians.\n\n>constantly starting wars in other countries, \n\nI condemn USA starting wars in other countries.\n\n>and continuing to provide millions so that Israel can keep bombing children\n\nI condemn the USA’s support of Israel.\n\nNow that that’s done can you condemn Islamists murdering people over cartoons and show sympathy for the victims.\n\nCan Khabib?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "CanadianCamel",
                                                                                    "body": "If only the average USA citizen could say the same. \nYes I can condemn extremists killing people and misrepresenting Islam. \n\nNot a hard thing to condemn… I’m sure Khabib would say the same, why don’t you go talk to him and ask him instead of assuming what his stance is.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mamadou-segpa",
                                                                                            "body": "Lol.\n\nIm not taking any side in that debate, but why are you acting like anyone can walk up to Khabib and ask him anything",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "CanadianCamel",
                                                                                                    "body": "Because he’s acting like Khabib has to make a public statement for every single extremist that chooses to do something in the name of his religion, as if it’s his responsibility..",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DetroitLionsEh",
                    "body": "It’s not that people hate them as much as they hay their fans \n\n> I think a lot of their hate stems from their cultural and religious beliefs.\n\n> Haha downvoted just for saying my opinion on it.\n\n> Proved my point.\n\nLike these type of comments are on every Khabib post you see\n\n“Downvotes prove I’m right” and everything.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "suffering_online",
                            "body": "Seen this exact excuse thousands of times. They are no worse than any other fanbase",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Distinct-Hold-8673",
            "body": "send him USA 2-3 months and forget",
            "score": 39,
            "replies": []
        },
        {
            "author": "SHAQBIR",
            "body": "In terms of MMA legacy, Islam is already better than Khabib but in terms of humanity, I don't know man,",
            "score": 63,
            "replies": [
                {
                    "author": "This1999s",
                    "body": "The thing is khabib is a big part of islam's success and has helped a  lot of other mma fighters also, so in terms of mma legacy it will be very hard for ANYONE to beat khabib there are only handful of people in the entire sport with this  level of contribution in growing the sport",
                    "score": 101,
                    "replies": [
                        {
                            "author": "Roundballroll",
                            "body": "Khabib also fought in the biggest fight in the history of the ufc. People still talk about that fight all the time and it’s been almost a decade later. I don’t think Islam could ever have a fight on that level.",
                            "score": 58,
                            "replies": []
                        },
                        {
                            "author": "BenjyNews",
                            "body": "Khabib has a bigger MMA Legacy than DJ / Silva but people aren't ready for that discussion.",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "TarasBulbaNotYulBryn",
                                    "body": "And his legacy is still growing because he is like Bill Russel in the NBA. Champion as a player/coach.\n\nHow many UFC champions went on to coach and corner champions from their own gym where they are head coaches? Coach Javier Mendez gets half the credit of course and is a legendary coach in his own right. But Khabib cornered Islam to become champion and also Usman Nurmagomedov who would probably be the #1 LW in UFC behind Islam if he came over. They also have a guy in Dubai that is better than most UFC LWs but he has to wait his turn.\n\nKhabib did the training camps for Belal when Belal TKO Sean Brady and for when he beat Leon Edwards for the title.\n\nAll of those things add to overall legacy which is measured in terms of impact on the sport.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "TarasBulbaNotYulBryn",
                                    "body": "And his legacy is still growing because he is like Bill Russel in the NBA. Champion as a player/coach.\n\nHow many UFC champions went on to coach and corner champions from their own gym where they are head coaches? Coach Javier Mendez gets half the credit of course and is a legendary coach in his own right. But Khabib cornered Islam to become champion and also Usman Nurmagomedov who would probably be the #1 LW in UFC behind Islam if he came over. They also have a guy in Dubai that is better than most UFC LWs but he has to wait his turn.\n\nKhabib did the training camps for Belal when Belal TKO Sean Brady and for when he beat Leon Edwards for the title.\n\nAll of those things add to overall legacy which is measured in terms of impact on the sport.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "1998ChevyTaHoe",
                    "body": "I wouldn't even bother to compare their \"humanity\" or morals because they're both fucking incredible people. You don't have to compare 2 good things to see what's better. Islam and Khabib are the best couple of guys.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "mosarosh",
                    "body": "Don't agree. Legacy is more than stats. Khabib walked so guys like Islam could run.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "SHAQBIR",
                            "body": "I don't believe that legacy makes any sense when you have roided defaulters like jones in the talks.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "OwOsch",
                                    "body": "Mma goat debates are in general kind of dumb. Different eras, different weight classes, roids and cheats, GOATs not facing each other because of said weight classes etc. Oh, and some weight classes are just much better than the others. Lightweight or Bantamweight are far ahead of HW",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Snoo_64007",
                    "body": "Islam lost long before he even had the opportunity to be compared to Khabib career wise.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SHAQBIR",
                            "body": "Islam has a better resume than Khabib and having a perfect record does not matter as much, this is my opinion .",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Snoo_64007",
                                    "body": "Well lets see. Islam beat Arman, Hooker, Poirier, Oliveira, and Volkanovski. Those are his best wins.\n\n\nKhabib beat McGregor, Poirier, Gaethje, RDA and Barboza\n\n\nBy comparison Khabib had the more impress wins and a perfect record matter more than almost anything in my opinion.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Twerksoncoffeetables",
                                            "body": "Islam is not done yet though. Ilia could be a great win, Max would be a good win, Justin+Arman 2 since the arman win was so long ago would be great on his record for saying he completely cleared out the current division. There’s still more great wins for Islam to get, specifically Arman 2 and Ilia, probably Justin as well just to finish off the division for good. Also Islam has a more diverse record in terms of how he’s won fights as well, he’s just more well rounded. \n\nSo if he wins vs Ilia and Arman (2)+ maybe Justin and then moves up to WW to fight for double champ status and wins that belt, that’s absolutely more than Khabib did at least without requiring Connor. We’ll see what happens but the fact Islam is still going means we’re not comparing full pictures here.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Snoo_64007",
                                                    "body": "Yeah I agree Islam still has some good potential fights out there although the level of competition might've been tougher back then. And yeah he is definitely a more well rounded fighter but he's not as dominant. \n\nAs far as I see it though if he goes up and wins a belt at 170 then yeah he's definitely passed Khabib but that's still a tall task.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Twerksoncoffeetables",
                                                            "body": "I’d say he is almost more dominant honestly. The amount of ways he’s won via submission is absolutely insane, I believe he has the most diverse submission win record in the ufc and quite a few of them are very rare to see and difficult to pull off. Some of them against the best in his division. In order to do that, you need to be dominant. \n\nThe only reason fights go on longer with him is largely because he likes to strike and he tests his striking against the strikers/boxers he faces like Dustin. Dustin improved his defense on the ground so much and he still couldn’t fend off Islam once it went to the ground, and it usually goes to the ground whenever Islam is ready for it. He is extremely dominant, he just doesn’t use his strongest asset against non wrestlers immediately like Khabib did, mostly because Islams striking is better than Khabibs and he likes to use it. Otherwise every fight would be on the ground in round 1 or early 2 and he also knows that’d be boring as hell, ie the moicano fight.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Snoo_64007",
                                                                    "body": "Islam is definitely dominant, just not as dominant as Khabib but his submissions have been incredible especially his chokes. He has insane grip strength. When it comes to the ground game though, Khabib has the advantage. We saw Dustin struggle more with Khabib than he did with Islam on the ground and Dustin was a BJJ Blackbelt even back then. Plus Khabib wouldn't have had nearly as hard of a time with Volkanovski as Islam did. Volkanovski was actually able to defend takedowns from Islam as a Featherweight. Khabib would've ran him over.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hfucucyshwv",
                                                                            "body": "Dustin blackbelt 😂. Everybody has a blackbelt, that doesn't mean they are good(relative to other mma fighters) grappelers.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Snoo_64007",
                                                                                    "body": "Name somebody else that was able to hold him down besides them 2.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "hfucucyshwv",
                                                                                            "body": "😂😂😂😂great question, tell me who he fought that would?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Snoo_64007",
                                                                                                    "body": "Charles Oliveira, Michael Chandler, Eddie Alvarez... Twice. 😐",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "hfucucyshwv",
                                                                                                            "body": "So when a belt is not on the line muscle Mike, and a guy that's attempted 1342 strikes and...68 takedowns. In the division with the best grappelers in the sport.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Snoo_64007",
                                                                                                                    "body": ".... What?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "hfucucyshwv",
                                                                                                                            "body": "Porier is not fighting grappelers and thr ones he did fight beat him?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SHAQBIR",
                                            "body": "Islam has more finishes than Khabib and Khabib has man U- Dec, plus Khabib was fed strikers while Islam was fed both strikers and and grapplers.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Snoo_64007",
                                                    "body": "What does \"Man U-Dec\" mean? Nevertheless, of course Islam had more finishes, because he had easier opponents. And Khabib had wins over BJJ Blackbelts and D1 Wrestlers, the strikers just happened to be the best in the division. Khabib while facing harder competition has more 10-8 rounds than Islam and any other fighter ever. Khabib is Statistically the most dominant fighter ever while Islam's record already has a debatable against a Featherweight on it.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lars6",
                            "body": "Khabib didn’t retire early, he retired on top. Khabib was in the UFC before fighters like DC and has more UFC wins than BJ Penn. Young Khabib beat RDA who became a champ later and has wins over guys from top 10 p4p. Only Islam has more defences than him. Khabib also helped Islam and his entire team to become champs",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "SHAQBIR",
                            "body": "I think he was not in it anymore after his Father passed away, mother worrying did not make it any better either  and he took his Father's role for the others like his Islam and his brothers .",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Doten1",
                    "body": "Humanity? Islam is a better person than Khabib lol, Khabib has clips of him saying crazy stuff",
                    "score": -6,
                    "replies": [
                        {
                            "author": "SHAQBIR",
                            "body": "can you send link bratha",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Doten1",
                                    "body": "Basic ‘cultural’ whatever ‘belief’ stuff like a girl asking him on advice to become mma fighter and him saying you should be a good wife instead. You can search it up. \n\nThat’s why I like Islam, never heard him preach this stuff even when getting asked questions like that.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Xpander6",
                                            "body": "That's not crazy stuff.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "straight_lurkin",
            "body": "Conor is foaming at the mouth right now",
            "score": 15,
            "replies": [
                {
                    "author": "WhenMeWasAYouth",
                    "body": "Oh shit, someone get the Narcan.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "jak777777777",
            "body": "Khabib is different level brather",
            "score": 12,
            "replies": []
        },
        {
            "author": "Previous-Tangerine-2",
            "body": "Khabib and Connor really were the hero and villain huh",
            "score": 23,
            "replies": [
                {
                    "author": "hfucucyshwv",
                    "body": "It was the perfect storm. A clash of cultures, of fight styles, of careers, of personality at the peak of their careers. Connor is basically the blueprint for every western fighter while Khabib is the same for the Eastern/Muslim region. I feel like that's the biggest thing missing in the sport, every fight just seems kinda lukewarm. People hate what Connor has become but no one else is brave enough to make the fight mean something. They all have the attitude of \"it's just a fight,\" while Connor was willing to stake his reputation and basically his whole career on that one moment.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConstructionDue7562",
            "body": "![gif](giphy|pLdOIZiYUbWGSZkPQE|downsized)",
            "score": 10,
            "replies": []
        },
        {
            "author": "thisisthetom",
            "body": "I'm not crying, you crying",
            "score": 13,
            "replies": []
        },
        {
            "author": "Albaaneesi",
            "body": "Allah know this, alhamdulillah. His father is smiling in paradise. People always try to put a thorn between these two brothers but they don't know they are on a level far above them.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Jayantwi98",
            "body": "Can you make the music a bit louder? I could almost hear Islam",
            "score": 4,
            "replies": []
        },
        {
            "author": "No_Mercy_4_Potatoes",
            "body": "Was that dumb music really necessary?",
            "score": 16,
            "replies": []
        },
        {
            "author": "darwinevo",
            "body": "The press ruins everything with these stupid gotchas, they're both all time greats in their own right.",
            "score": 5,
            "replies": [
                {
                    "author": "hfucucyshwv",
                    "body": "That was a good question...there was nothing inflammatory about it and it let Islam glaze his boy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrimReaper247365",
            "body": "Connor on the other hand just does a lot of coke, and everyone knows it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "allyolly",
            "body": "*cut to Conor being a sociopath in the white house",
            "score": 3,
            "replies": []
        },
        {
            "author": "yvesstlaroach",
            "body": "He’s the goat",
            "score": 3,
            "replies": []
        },
        {
            "author": "TarasBulbaNotYulBryn",
            "body": "Confirmed: Islam is a Dagestani glazer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Husdakiddo",
            "body": "Khabib is role model for new generations",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sad-Investigator-991",
            "body": "They are good guys I respect them. I would like to one day pay a drink for them and talk a little about life.",
            "score": 4,
            "replies": [
                {
                    "author": "ketofol-",
                    "body": "Some Irish proper 12 whiskey?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sad-Investigator-991",
                            "body": "A bottle please.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HeftySafety8841",
            "body": "Islam has way more impressive wins IMO.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RobertJ93",
            "body": "lol that interviewer sounds a lot like the dude from Black Bird.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive_Hold_5740",
            "body": "Khabib is a very good person. \n\nBut I think the question was about their fighting style....",
            "score": -2,
            "replies": []
        },
        {
            "author": "Top-Flow6279",
            "body": "what a guy Kebab is",
            "score": 0,
            "replies": []
        },
        {
            "author": "Horror_Cut_6896",
            "body": "I mean i don't know if leaving your family for 2 months just to hang out and \"help\" is a good thing. Simply because it's not like he's absolutely essential, Islam and others have their trainers, a solid camp... I feel like it's an excuse for Khabib to hang out with the boys.",
            "score": -22,
            "replies": [
                {
                    "author": "NoIdeaTF",
                    "body": "I hope you know this is why you’re a failure in life❤️",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Horror_Cut_6896",
                            "body": "Suck it",
                            "score": -9,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}