{
    "title": "Six months what a joke",
    "author": "Reasonable-Buy1989",
    "subreddit": "ufc",
    "rank": 5,
    "score": 560,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 72,
    "url": "https://v.redd.it/86lmur006jpe1",
    "id": "1jeiv79",
    "selftext": "😭",
    "comments": [
        {
            "author": "Ihavenolifelmfao",
            "body": "It's so incredibly obvious he's gonna wait the 6 months and then bail with some fabricated excuse so he can waste more of aspinall's career.",
            "score": 269,
            "replies": [
                {
                    "author": "scottymackay89",
                    "body": "Surely there will be a contract stipulation where of he pulls out, Tom is undisputed champ regardless. I mean I hope so. Fool me once shame on you, fool me twice…",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Ihavenolifelmfao",
                            "body": "I think they'd just strip him and we'd get Tom vs mostly likely gane but possibly pavlovich or volkov for the vacant",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "iSpeakforWinston",
                                    "body": "Aspinal can't possibly jump any higher for the UFC as it is, but forcing the Interim, who's being ducked by the reigning, to vacate their interim title to fight for the undisputed would be... so on par for the UFC. Damn.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Legendary_Hercules",
                                            "body": "Book Gane vs Almeida on the same card and when Jon pulls out, Aspinall vs Gane.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "scottymackay89",
                                    "body": "Yep. Or even Jailton Almeida. Any of those scenerios are ,as joe rogan would say…”entirely possible”",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Barthalamu65",
                            "body": "“There’s an old saying in Tennessee — I know it’s in Texas, probably in Tennessee — that says, fool me once, shame on — shame on you. Fool me — you can’t get fooled again.”",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "ShitSlits86",
                                    "body": "\"they call me the knife.. heh. Butter knife... Heheh.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NastySeconds",
                            "body": "We won’t get fooled again?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "scottymackay89",
                                    "body": "No role models and I’m here right now! \n\nI hope this was a J Cole nod. If not I feel dumb.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "stiffyonwheels",
                            "body": "Cant get fooled again",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "-S-P-Q-R-",
                            "body": "The fight date should be for the undisputed title regardless of who fights.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "il_VORTEX_ll",
                            "body": "Has ever occurred to you that maybe Tom doesn’t want to be the undisputed champion but simply wants to…fight?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cherrypoppinpop",
                    "body": "No he’s doing the 6 months so he can do a steroid cycle",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Rolandog21",
                            "body": "Probably lol... dudes putting up time so he can get away with it later on... testing anything soon will probably get him to test positive again",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MPS_",
                    "body": "He's gonna test postive or get injured or arrested. I won't believe the fight is on until they lock the cage.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "NeroFMX",
                    "body": "He must have learned this tactic on a coke bender with Conor.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MarlonShakespeare2AD",
            "body": "6 months more with the title  \n\nPOS needs to be stripped",
            "score": 106,
            "replies": []
        },
        {
            "author": "Cherrypoppinpop",
            "body": "6 months so he can do a proper steroid cycle, it’s obvious",
            "score": 71,
            "replies": []
        },
        {
            "author": "RadleyRadiation",
            "body": "He’s going to wait 6 months, make an excuse to delay, but the 6 months allows him time to juice between being tested and hope that he can learn something uncharacteristic that Tom may not expect while wasting more and more time for Tom and creating more “rust” on him",
            "score": 35,
            "replies": [
                {
                    "author": "Cherrypoppinpop",
                    "body": "Yup 6 months so he can do a steroid cycle and also creates time for Aspinall to develop ring rust due to inactivity for over a year",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Devlnchat",
                    "body": "Jones' and his fans biggest hope is to just delay the fight as long as possible hoping that Tom either loses or had a bad performance in the meantime so they can go \"see? They thought this guy could beat the goat\".",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "friendly_outcast",
            "body": "At this rate Tom’a gonna retire and Jon is still gonna be trolling us online lol",
            "score": 24,
            "replies": []
        },
        {
            "author": "BurtDickinson",
            "body": "It’s fucking been five months since he fought and he knew who was next up a year ago.",
            "score": 17,
            "replies": []
        },
        {
            "author": "JBlendz757",
            "body": "Calling it now. Gets “hurt” during sparring. Changes mind. Retires.",
            "score": 15,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Exactly he’s pulled out of so many fights against killers like rampage Jackson, DC, Gane, machida, chael, dudes never fought an all time great smh. \n\nNot like Aspinall taking on the GOATS like Curtis blaydes and Stuart Austin",
                    "score": -6,
                    "replies": [
                        {
                            "author": "BobbyRayBands",
                            "body": "Not sure using DC is too good of an example considering he had to use roids to beat him. “THEY ALL DO!” But DC didn’t pop.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jfsoaig345",
                                    "body": "He didn't pop the first time and it was a smooth decision.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BobbyRayBands",
                                            "body": "He was also in his prime at 27 fighting a 35 year old man and it had to go to decision. Now that the shoe is on the other foot he’s too scared?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "jfsoaig345",
                                                    "body": "DC at 35 is not the same as Jon at 35 and you know that lol. DC was in his prime both times he fought Jon. I'm not saying Jon's not ducking Aspinall but trying to cheapen Jon's first win over DC by pointing out DC's age or the fact that it was a decision is miserably casual take",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "glockenballz",
            "body": "Even if Chaels performances weren’t always the best the man was at least never afraid to catch a fade",
            "score": 12,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "It’s almost like a correlated directly so if he was gonna get a nice paycheck or not",
                    "score": -2,
                    "replies": [
                        {
                            "author": "glockenballz",
                            "body": "He wanted the belt and he did everything in his power to do so including fighting the GOATs of 3 separate weight classes. I can respect it even if the man is a decent wrestler with 0 standup.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "turnupsquirrel",
                                    "body": "He wanted the money that came with it. He’s not fighting these guys for free is all I’m saying. He took the biggest paycheck he could get",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "howmanyturtlesdeep",
            "body": "This laugh is so fake, but he isn’t wrong.",
            "score": 43,
            "replies": [
                {
                    "author": "wudp12",
                    "body": "At that point I'm sure Chael's character has taken precedence over real Chael",
                    "score": 25,
                    "replies": [
                        {
                            "author": "DawdlingScientist",
                            "body": "I’m the dude playing the dude disguised as another dude!",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "TurboTingo",
                                    "body": "Dude where's my car?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "dagui12",
                                    "body": "What do you mean “you people”?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ronnietea",
            "body": "![gif](giphy|88iYsvbegSUn9bSTF8)",
            "score": 6,
            "replies": []
        },
        {
            "author": "Em4rtz",
            "body": "How they not strip this dude of the belt yet..",
            "score": 5,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Go to his gym and take it from him 🤷‍♂️",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "turnupsquirrel",
                    "body": "Or go train and beat him yourself…",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheCowhawk",
            "body": "GOAT-(With 6 months prep)",
            "score": 18,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Exactly no one should have a fight camp. Just call someone out, get out their the same night and bang",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AresRai",
            "body": "lmao upvote this to the top of reddit",
            "score": 12,
            "replies": []
        },
        {
            "author": "slampig3",
            "body": "How much prep time does batman i mean jones need to defeat aspinall",
            "score": 3,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "The same amount of money Batman needed to be anybody 🤷‍♂️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tdrivers1999",
            "body": "Maybe Tom will go to boxing too",
            "score": 2,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Yeah he’s a household name with a deep resume vs the best",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "T0NEZZY",
            "body": "6 months to retrain his eyepokes, foot stomps, & oblique kicks",
            "score": 2,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Exactly that’s the only reason we beat stipe or Gane",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "counterstrikePr0",
            "body": "STRIP JONES ALREADY",
            "score": 2,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Why don’t you go to his gym and do it?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "counterstrikePr0",
                            "body": "Good one dude",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "georgepharma",
            "body": "strip jon already",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moviereference210",
            "body": "It’s crazy how much of a petty ass this duck is",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElMirador23405",
            "body": "the ultimate shit stirrer",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lars6",
            "body": "🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "IncessantApathy",
            "body": "He beat the fuck out of you chael…",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShitSlits86",
            "body": "UFC needs to get its shit together and actually have something in place to stop fighters from doing this shit.\n\nI mean, on a legal front there should be something that can be called upon when a person is actively and intentionally stifling the career progression of a coworker.\n\nNumba 1 bullshit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Junior-Worker-537",
            "body": "You guys don’t get it the cards are in his hands lmao . He is the champion . They need to pay him what they and he feels is right and he can ask for the time . At this point, I think he’s trolling you guys more than anything else",
            "score": 1,
            "replies": []
        },
        {
            "author": "gernygern",
            "body": "Uncle still mad he couldn't even make it 2 rounds with jones haha",
            "score": 0,
            "replies": []
        },
        {
            "author": "nsaps",
            "body": "Six months is pretty short notice, it’s only been 3 since his last fight. He needs to bulk",
            "score": -6,
            "replies": [
                {
                    "author": "Cherrypoppinpop",
                    "body": "It’s so he can do a steroid cycle",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "rorroismyname",
            "body": "Jon jones is the GOAT. And I’ve always believed that, but damn, all this dodging and pretending to not be dodging hurts his legacy man …that is bc he is a current ACTIVE fighter.",
            "score": 0,
            "replies": [
                {
                    "author": "turnupsquirrel",
                    "body": "Who did GSP duck? No one will remember this in exactly 3 years Lmaoo whether he decides it’s worth his time to fight or not.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "IncessantApathy",
                            "body": "Gsp also stayed at 170….",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}