{
    "title": "Food bank whipping cream gold",
    "author": "brisknipples",
    "subreddit": "Frugal",
    "rank": 4,
    "score": 2510,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 51,
    "url": "https://i.redd.it/oey2uhg3cape1.jpeg",
    "id": "1jdif4g",
    "selftext": "As a diabetic, I eat keto so I buy a lot of heavy whip from Costco. I primarily use it for my coffee but also for keto baked goods too.  It’s pretty expensive but it lasts me a long time. This month I decided to visit a food bank to take a little off my grocery bill because my hubby is changing jobs. To my surprise, I got a big Costco carton of heavy whip! Unfortunately the best by date was two days ago and I had just purchased a carton last week… what to do with all this heavy whip?? I know, make delicious homemade butter! I usually avoid doing this because it’s just cheaper to buy butter in terms of ounces I use, but this worked out great! I’ve also been preserving fruits and veggies. I get from the food bank as well because there’s just no way I can eat them before they go. Food from the food bank is usually already on its way out sadly.",
    "comments": [
        {
            "author": "RelayFX",
            "body": "Locked due to targeted attacks against OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Virtual_Cow3340",
            "body": "Some of these comments are so shameful. There was a point in my life where I stole TP from the bathroom at work because I literally had no money to buy any. I did this while wearing a $100 pair of shoes on my feet, the same shoes I walked home in because I couldn't afford bus fare and had no car. Shoes were purchased when things were better in my life, and I was very lucky to have them because walking miles requires good footwear. Things are much better now for me now financially and I am so grateful.\n\nIf you are judging someone because they have a mixer, shame on you. Maybe spend less time judging about situations you know nothing about, and spend more time helping in your community. Lots of people out there struggling and need help.",
            "score": 2572,
            "replies": [
                {
                    "author": "wannabeelsewhere",
                    "body": "Heeeey I stole a roll of trash bags cuz we desperately needed them. Here's to better places for both of us!",
                    "score": 410,
                    "replies": []
                }
            ]
        },
        {
            "author": "BunniFruFru",
            "body": "Please don't listen to the comments saying you shouldn't use the food bank. Use it, it is there for you to use before you have to sell a kidney to make ends meet.",
            "score": 1116,
            "replies": []
        },
        {
            "author": "livelylou4",
            "body": "Yum! What do you use the buttermilk for?",
            "score": 288,
            "replies": [
                {
                    "author": "brisknipples",
                    "body": "I don’t know yet! Have any ideas?",
                    "score": 111,
                    "replies": [
                        {
                            "author": "livelylou4",
                            "body": "Waffles for sure",
                            "score": 107,
                            "replies": []
                        },
                        {
                            "author": "gi_fm",
                            "body": "Cornbread too 😋",
                            "score": 107,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "squirrelinhumansuit",
            "body": "That's brilliant. Please ignore the haters, there are people who make themselves feel better by attacking strangers online. 🙄",
            "score": 348,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -138,
            "replies": [
                {
                    "author": "wendee",
                    "body": "So people have to sell everything of decent quality and downgrade to crappier kitchenware that’ll break faster before they can use a food bank? How is that frugal? Also, what if they bought something nice secondhand like from a thrift store or an estate sale?",
                    "score": 219,
                    "replies": [
                        {
                            "author": "wannabeelsewhere",
                            "body": "Excellent point! I've got a $200 espresso machine in my kitchen that raises eyebrows when I have people over, I got it at goodwill for $10.",
                            "score": 161,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FloraDecora",
                    "body": "Someone gave me a KitchenAid for free dude\n\n\nStfu frankly",
                    "score": 471,
                    "replies": [
                        {
                            "author": "Remy_IsAMonster",
                            "body": "Same! It was my moms!",
                            "score": 147,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Charloxaphian",
                    "body": "Tell a diabetic that a low/no-carb diet is a luxury and not actual medical treatment? Do better.",
                    "score": 290,
                    "replies": []
                },
                {
                    "author": "squirrelinhumansuit",
                    "body": "Keto is recommended for a lot of diabetics FYI. I'm diabetic and my food costs are bigger than my insulin, glucose monitor, or glp-1 medication. This comment sucks for so many reasons but I just wanted to mention you sound like you don't know what you're talking about w diabetes. \n\nYou're responding to someone who is doing their best w what they have and making sure nothing goes to waste",
                    "score": 148,
                    "replies": []
                },
                {
                    "author": "YellowBrownStoner",
                    "body": "Disabled and broke people have medically necessary diets too. I got my stand mixer before I became disabled and while I was still working. She pays for herself in terms of what I can make cheaply.\n\nAnyway food banks are perfectly capable of policing their own clientele for who they prefer to help, no need for your unnecessary shaming or gatekeeping. Do better!!",
                    "score": 234,
                    "replies": []
                },
                {
                    "author": "LilNuggieNuggs",
                    "body": "How rude. You have no idea the circumstances when they acquired those things vs now. Not to mention people get gifts?",
                    "score": 117,
                    "replies": []
                },
                {
                    "author": "DumpPedoTrump",
                    "body": "You really like putting people down, it's pretty obvious because you said do better, twice. How OP spends their money is their business, he could have gotten a mixer as a gift. Grow up",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "Nateandgypsy",
                    "body": "Do better. You're giving shit to a fellow working class person bs placing the blame on our political figures and corporations exploitative ways. Take that same energy and tell a rich person to fuck off.",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "Assasinscreed00",
                    "body": "Keto diets have improved health outcomes for many people with certain conditions, people’s financial situation change, people get handed down/given nice appliances, and a million different things that can reasonably give context for this situation. You don’t need to know them (even though they gave a perfectly fine explanation of why they went)\n\nFood banks decide who to give food too. If you wanna be the arbiter of who’s worthy of help, open a food bank.",
                    "score": 69,
                    "replies": []
                },
                {
                    "author": "HalloweenMishap",
                    "body": "What a useless thing to say",
                    "score": 70,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -75,
                            "replies": [
                                {
                                    "author": "nononanana",
                                    "body": "I volunteer at a food bank. We don’t care. We aren’t there to judge. \n\nAlso, this person is diabetic so mind your business about their dietary needs.",
                                    "score": 88,
                                    "replies": []
                                },
                                {
                                    "author": "farmallnoobies",
                                    "body": "How do you know OP doesn't need to use the food bank?",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Wooden-Committee4495",
                                            "body": "I was going to say the same thing as you: we don’t know her circumstances and aren’t here to judge. The food banks are for people who need it. Theoretically, a millionaire could lose their job and have no disposable income and it would be perfectly acceptable for them to use the food bank because they NEED IT.\n\nHowever, her statements about her “husband changing jobs and using the food bank to take a little off my grocery bill” does make me raise my eyebrows a little…but, again, I don’t know their cash flow or need. I hope she NEEDS it and isn’t trying to be FRUGAL.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "wannabeelsewhere",
                                                    "body": "I'm guessing that means he's between jobs atm, or won't get his first pay for a couple weeks. I've been there and I wish there were more resources near me because I ended up having to rack up credit card debt to get us through it.\n\nIt's tough out here :/",
                                                    "score": 28,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Frugal-ModTeam",
                                    "body": "We are removing your post/comment due to civility issues. \n\nHarassment, personal attacks, or hate speech are not tolerated. Similarly, don’t be baited. Use the report button instead. Mods will handle it.\n\nPlease see our full rules page for the specifics. https://www.reddit.com/r/Frugal/about/rules/\n\nIf you would like to appeal this decision, please [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2FFrugal&subject=Removal%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because) within one week of this notice being posted.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "leilavanora",
                                    "body": "Do you know how their local food banks work? Please educate yourself. Anyone who wants to use the food bank should use the food bank. Having the mentality that you’re taking from others stops people from using it. My local food bank lets ANYONE use it and the more people who use the food bank the more funding it gets. You should never shame anyone for using a food bank jfc.",
                                    "score": 43,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bienenstush",
                    "body": "Dude, who asked you???",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -25,
                    "replies": [
                        {
                            "author": "Frugal-ModTeam",
                            "body": "We are removing your post/comment because of low effort, off-topic, or overly specific content. This includes content described as:\n\n- Off-topic\n- Venting or ranting\n- Inane or crude\n- A meme, repost, or chain-post\n- Overly specific to a product or service.\n\nPlease see our full rules page for the specifics. https://www.reddit.com/r/Frugal/about/rules/\n\nIf you would like to appeal this decision, please [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2FFrugal&subject=Removal%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because) within one week of this notice being posted.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Miiirob",
                            "body": "This is why I've stopped giving to our food bank. I've seen too many people who could afford to buy groceries go there. And then post about their trip to Mexico, their new boat etc.",
                            "score": -115,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -146,
            "replies": [
                {
                    "author": "squirrelinhumansuit",
                    "body": "I had no idea that owning a kitchenaid mixer came w a guarantee of lifelong wealth. Where do I sign up for my checks??? I received one as a wedding present 10 years ago and I use it daily to make cheap bread at home. The husband I married has since left and doesn't help myself or our child financially anymore. I had no idea that owning this makes me rich. very exciting news! Can't wait to let my medical debt know! ❤️",
                    "score": 582,
                    "replies": [
                        {
                            "author": "Prestigious_Spell309",
                            "body": "Right. I got a kitchen aid mixed as a christmas present from an ex boyfriend 7 years ago. It has not made me fabulously wealthy 🤣",
                            "score": 152,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brisknipples",
                    "body": "It was given to me after my grandmas passing.",
                    "score": 414,
                    "replies": []
                },
                {
                    "author": "Frankyfan3",
                    "body": "Using the foodbank when in between jobs isn't \"stealing from the poor\" by any stretch of the imagination.\n\nKetogenic diets are common for many medical conditions. I have many criticisms for keto, but if you're on it because your doctor told you to do that, idgaf, that's **not my business**, that's yours.\n\nMind your own.",
                    "score": 170,
                    "replies": []
                },
                {
                    "author": "LINDARRAGNAR",
                    "body": "They may have bought that kitchen aid 10+ years ago, when times were easier.",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "Frugal-ModTeam",
                    "body": "We are removing your post/comment due to civility issues. \n\nHarassment, personal attacks, or hate speech are not tolerated. Similarly, don’t be baited. Use the report button instead. Mods will handle it.\n\nPlease see our full rules page for the specifics. https://www.reddit.com/r/Frugal/about/rules/\n\nIf you would like to appeal this decision, please [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2FFrugal&subject=Removal%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because) within one week of this notice being posted.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "sunnyflow2",
                    "body": "Keto has little to do with money status and much more to do with health. Why can someone with diet restrictions not be allowed at the food bank?",
                    "score": 38,
                    "replies": []
                }
            ]
        },
        {
            "author": "Normal_Promise6695",
            "body": "Maybe don’t take food you don’t need and can’t use right away",
            "score": -1059,
            "replies": [
                {
                    "author": "sunnyflow2",
                    "body": "In my area, all the food banks are drive thru... you get what you get, or get nothing... is how it works here.",
                    "score": 432,
                    "replies": []
                },
                {
                    "author": "brisknipples",
                    "body": "They just hand you a huge box, you don’t get to choose.",
                    "score": 685,
                    "replies": []
                },
                {
                    "author": "wholesomebloob",
                    "body": "maybe stop being a hater and worry about yourself. Interesting how you think you know what OP needs and doesn’t need.",
                    "score": 296,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Frugal-ModTeam",
                                    "body": "We are removing your post/comment due to civility issues. \n\nHarassment, personal attacks, or hate speech are not tolerated. Similarly, don’t be baited. Use the report button instead. Mods will handle it.\n\nPlease see our full rules page for the specifics. https://www.reddit.com/r/Frugal/about/rules/\n\nIf you would like to appeal this decision, please [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2FFrugal&subject=Removal%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because) within one week of this notice being posted.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Frugal-ModTeam",
                                            "body": "We are removing your post/comment due to civility issues. \n\nHarassment, personal attacks, or hate speech are not tolerated. Similarly, don’t be baited. Use the report button instead. Mods will handle it.\n\nPlease see our full rules page for the specifics. https://www.reddit.com/r/Frugal/about/rules/\n\nIf you would like to appeal this decision, please [message the moderators by clicking this link](http://www.reddit.com/message/compose?to=%2Fr%2FFrugal&subject=Removal%20Appeal&message=Author%20would%20like%20to%20appeal%20the%20removal%20of%20their%20post%20because) within one week of this notice being posted.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}