{
    "title": "The Reaping of a Round Bed: An Exercise in Common Sense (AKA Please help me)",
    "author": "nofoamcapp",
    "subreddit": "Frugal",
    "rank": 19,
    "score": 2,
    "upvote_ratio": 0.58,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Frugal/comments/1jdnrf1/the_reaping_of_a_round_bed_an_exercise_in_common/",
    "id": "1jdnrf1",
    "selftext": "Apologies in advance if this isn't the right place for this question, but I thought immediately of several posts from this sub recommending that people either *never* purchase soft furniture secondhand, or to proceed with caution, lest they risk bed bug infestation.\n\nSo, several days ago I found a listing online for an item I have been coveting since middle school: *A round bed!!!* Circular mattress *and* boxspring!! I fear that elation has blinded me. Never in my life did I expect the opportunity to own one--Those things are expensive!!! Prices vary online, of course, but the few I found that were similar to the listing went for $500 into the thousands--not including bedding, which is its own monster.\n\nHere's the rub: The listing is from an online auction. It's near enough to me that I wouldn't have to pay for shipping (thank god) but they don't allow previewing, so I can't inspect prior to purchase. From the photos they provide it looks to be in pretty decent shape, all things considered. I don't see any damage to the frame, no rips or tears in mattress, and very minor sagging, if any.\n\nWhat I'm wondering here is: Is it worth it, or am I turning a blind eye?",
    "comments": [
        {
            "author": "serenasplaycousin",
            "body": "No previewing?  Unless you can inspect it in person, I’d pass.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Previous-Bottle1449",
            "body": "Unless you are willing to literally throw the purchase price away. You'd need to say no. Maybe they or the marketplace will refund your money if there's an issue. If not, sorry.",
            "score": 12,
            "replies": []
        },
        {
            "author": "cheshirecatomsk",
            "body": "Needs more context. What kind of auction? An estate sale? An antiques site? Regardless it’s a gamble, but you probably have already made an informed inference based on the source.\n\nEasy for others here to tell you no. If middle school was 5 years ago, maybe sit on it; if it was 10, 20, 30 years and you still want it… when are you going to get another chance? Worth weighing not just the likelihood that it ends up being a bust, but also the likelihood that you never again get to fulfill this desire.\n\nIt’s also an auction. Let the price decide it for you. Set a number where if this goes south, it’s a fun memory, not a painful one, and don’t go past it. Good luck.",
            "score": 4,
            "replies": [
                {
                    "author": "cheshirecatomsk",
                    "body": "Also: if it’s near enough to you that you won’t have to ship, you can drive over there and ask to preview. They’re not going to turn you away. Just go and be polite.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CopperGoldCrimson",
            "body": "If you can find a round mattress cover, I wouldn't be that concerned. Folks sleep on other people's cumstains in hotels, just slap a cover on it. I doubt that the sort of people who have round beds overlap heavily with bedbug ridden places. Maybe not a bad idea to give it a good dust down with diomataceous earth (ant powder at home stores), wrap it in plastic and keep it in your garage for a couple weeks to make sure nothing comes out, though.\n\nUnless you live in a place that has a lot of notorious bedbug infestations (like NYC), I'd just do that. I buy soft furnishings secondhand all the time (antique).",
            "score": 7,
            "replies": []
        },
        {
            "author": "Short-Sound-4190",
            "body": "This sounds like a terrible idea. A traditional mattress with box spring is only supposed to last 6-8 years, there's almost no.chance they're selling a barely used new mattress that costs a lot for dirt cheap because they decided they didn't like it, and it's also unlikely for a 1-2 year old mattress because again, they'd want to recoup some money. Selling and demanding full payment before viewing and shipping is a choice that only three types of sellers make: 1) there is no mattress 2) the mattress is old and/or damaged and they know it wouldn't sell at that price or higher if a buyer saw and felt it in person but they're hoping someone with money to burn falls for buying it sight unseen just for the oddity/rarity factor even though it's not worth that much, but they aren't letting people see it first because they already know based on prior experience and incoming messages asking questions about it that an astute buyer will pass on it if they do. They're trying to avoid paying someone $50-100 bucks to haul it to the dump so of course they are willing to sell cheap. 3) very rich people who decide their time isn't worth the hassle of getting a good price, they just want it out fast before they have to pay a mover or garbage disposal fee to get rid of it, and they will in fact pay someone $50-100 bucks to haul it if they don't find a private buyer who doesn't care about seeing the condition it's in first so it's meaningless to them to waste time showing or answering questions. \n\nOnly in the third category could you possibly get lucky and have it be a new mattress and box spring in good condition. That's still a chance it's 4+ years old or in poor condition and it's also a far slimmer scenario. Scenario 2 is the most common reason - it's an expense for them to dispose of it so they're selling it cheap. \n\nFrankly, Just save your money for a new and good quality mattress - they're really not that expensive and will ship to your door, newer foam mattresses like Casper and Purple don't even need a box spring and will last longer in years without compression and grossness over time compared to traditional or pillow top style mattress. Buy three half moon ottomans if you want the circular bed vibe that badly - you can use standard bedding and it'll be more functional and frugal.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ollie2Stewart1",
            "body": "I think that the bedding you’d need would be hard to find and expensive.",
            "score": 1,
            "replies": []
        }
    ]
}