{
    "title": "Did you have to learn frugality the hard way?",
    "author": "CertainDamagedLemon",
    "subreddit": "Frugal",
    "rank": 10,
    "score": 57,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 74,
    "url": "https://www.reddit.com/r/Frugal/comments/1jdq0qi/did_you_have_to_learn_frugality_the_hard_way/",
    "id": "1jdq0qi",
    "selftext": "If so, what would have helped you learn earlier? \n\nI'm wondering if anybody who has really struggled with spending in the past has any insights into what would have helped you when you were younger, or if learning the hard way was just what it took for you to get the picture.\n\nI have a teenager who is a very hard worker, but struggles to save money. She has a lot of expensive wants (that she pays for herself), is very generous with her friends and is constantly running out of money and asking to borrow. We are trying to exemplify and teach her frugality, personal finance, etc. but also letting her make mistakes on her own. I am wondering what else we could do to help her learn. ",
    "comments": [
        {
            "author": "Fire-Philosophy-616",
            "body": "Hell yeah I did. Mortgaged to the hilt, three expensive car payments, lots of cc debt, personal loans all of it. So proud to be debt free now. Never going back.",
            "score": 53,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "What would have helped you back then?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Fire-Philosophy-616",
                            "body": "I had such an abusive boss. This guy was the absolute worst. 10/10 this guy sucked. The stress was unbearable, I had heart palpitations every day. I made a decent amount of money and had all this debt and I could not find another job that paid my debt thus I could not quit. One day I got a new job that paid a little more and my wife and I sold everything and handled the debt Dave Ramsey style(not actually Dave Ramsey but same thing) I got big into r/fire. Never looked back. Debt free.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smooth-Review-2614",
            "body": "It was being stupid enough to not file my marriage license with the navy and trying to float an apartment without BAH. Bouncing grocery bills is a great way to get a wake up call. I am very happy I had no credit cards. \n\nThe trick is to find the scare point. For me that scare point is rent and food. I remember them being unstable when I was a teen. \n\nAs long as the kid does not have a credit card let them fall hard. Let her burn a bridge with a bank due to overdraft. Do not allow her to borrow any more money from you. Let the clue by four hit in a safe place where the damage is minimal.",
            "score": 24,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "Yeah, my hope is that it hits earlier rather than later for sure",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Smooth-Review-2614",
                            "body": "This is a normal issue.  You see this in colleges and in the military when people get that first bit of freedom and money.  As long as there are no loans or credit cards involved it normally sorts itself out in a few months to a year.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "WinterIsBetter94",
                                    "body": "Credit card companies LOVE college students. The minute each of mine got out of high school the Crapital One and C!t! offers were relentless.  I think they want to hook them young and keep them in debt the rest of their lives.  But I'm a cynic.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Smooth-Review-2614",
                                            "body": "No it’s just the young and dumb issue. It’s the same reason a lot of my classmates got a sports car with their bonus check.  The first few years away from home is when a lot of people go a bit stupid. ",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "curtludwig",
                                            "body": "A little of column A, a little of column B. The credit card companies make money on the transactions too.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "curtludwig",
                    "body": "This is similar to my story, fail hard when the stakes are low, its so much easier to climb out of a small hole...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lynxtosg03",
            "body": "My parents taught me frugality from a young age and forced me to manage money. In my teenage years and as an adult the lessons stuck with me.\n\nHave her put together a budget for when she's an adult and then introduce scenarios of misfortune like needing a root canal, car breaking down, or getting fired. Hopefully she sees the need to save for hard times. When she's good at that, take it to the next step and have her evaluate what retirement looks like. It might be a good idea for you as well if you haven't looked.",
            "score": 13,
            "replies": [
                {
                    "author": "whoquiteknows",
                    "body": "Same here. When I was really little, we did the rule of 60/30/10 (or whatever the formal version is) of 60% for “bills”/spending, 30% for savings, and 10% for charity. Granted our allowance was tiny so it didn’t get far, but the savings rule really stuck out in my head. Especially watching the 2008 recession play out.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "lynxtosg03",
                            "body": "Those that saved and prepared for that time did well. I was fortunate enough to be one of those people. I would have a hard time affording a house in today's financial climate.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "CertainDamagedLemon",
                            "body": "This is our general guideline too, but we don't force it on our kids. That's kind of what I'm wondering if we need to do.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CertainDamagedLemon",
                    "body": "We're maxing out our 401k right now and on track age-wise, but thanks for the reminder! \n\n\nIt's really difficult to get her to take it seriously - her philosophy is that she's a kid and these years are for having fun and she'll change when she has to. And I'm not sure how much I should push, since there's a part of that that's right?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lynxtosg03",
                            "body": "If she's working and paying her own bills then you can't do much. If she's dependent on you for an allowance then stick to a budget and don't let her borrow money without credit card levels of interest. The best motivations are necessity, desire, and pain. However they best internalize these will be your path towards teaching them. As their parent you'll have the best insights into which levers to pull to incentivize them.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "CertainDamagedLemon",
                                    "body": "She is 15 and works odd jobs to pay for her \"extras\" - we won't pay for starbucks and a fancy phone or eating out with friends, etc. She is my \"wantiest\" kid, but also the hardest worker. ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "lynxtosg03",
                                            "body": "Hedge your bets on frugality with high wages and encourage her to enter the field of engineering. It's one of the harder areas to enter but if you have a strong work ethic you can make a high wage with amazing benefits.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PollyWolly2u",
            "body": "Yes! I spent like a drunk sailor when I got my first job. I got a nice car, a nice apartment, new \"professional\" clothes, charged the CC to furnish the apt, ate out, etc.\n\nGot in over my head within a couple of years, and then spent three more to dig myself out of debt by cutting way back. I was so proud to pay off my car in Year 4 and then buy a house in Year 6, although I was living like a college student again, lol.\n\nWhat would have helped is for my parents to have taught me to budget. Sit me down, write out the expenses, separate needs from wants, discuss delayed gratification, and practice it all over several years.\n\nWe never had money talks in my household growing up. We were upper middle class, I had an allowance, but no coaching in managing money \n\nInstead, I was just kind of thrown into the abyss once I started making my own money. Not a great time or way to learn! I am lucky I figured it out quickly.",
            "score": 11,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "Yeah, we're doing our best to teach financial literacy, so hopefully at some point the lessons will stick. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IsThataButtPlug",
            "body": "I grew up with pseudo-rich parents.  My school clothes were from big department stores, my summer clothes were always ‘trendy’.\n\nAs I grew up and out of the house, I had to learn where to shop that I could afford.  My parent’s money was theirs, and I was on my own if I wasn’t with them.\n\nSo, when I got married, my registry was geared towards what I liked and what I thought was reasonable to ask my friends to buy (if they wanted).  I didn’t want fine dishes or crystal glassware.\n\nMy mom lost her ever loving shit when she saw I was registered at Target!  Like it was for poor people and that insulted her.\n\nAnd I laughed and opened my Loch Ness Monster stacking ladles with joy.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Delli-paper",
            "body": "Have to? Probably not. But my parents didn't feel like teaching, so I did. \n\nIf I were you, I'd consider having her put away, say, 30% of her income and say \"this is low-end what you should expect for rent and it's good to learn now when you can fail safely than later when it can cost you something important.",
            "score": 8,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "So you think forced savings vs letting her learn to make that choice on her own? ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Delli-paper",
                            "body": "Not quite. I think even offering \"hey, lets practice by doing this while you don't get hurt\" would go a long way. If you can afford it, you can even incentivise saving by oding some sort of match with her (2:1, 5:1, even 10:1).",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "how_obscene",
                            "body": "forced savings is hard bc she’s 15 and might lash out. instead you could just stop loaning her money. if it gets really bad, you could threaten rent. but beware: that’s why my dad moved out of his house at 18 bc he didn’t want to pay rent to his own parents. but he was forced to choose between college or paying rent so he just moved out. but honestly. just doing check ins with her on a consistent schedule will be great. allowing her the space to talk to you about her own worries and issues she’s facing. don’t save the day by giving her money, but share the tools with her on how she can help herself.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CertainDamagedLemon",
                                    "body": "Right, we've only loaned her money once, to fix a phone she dropped and broke. She was really good about paying us back in a timely manner. We didn't charge interest though. Wouldn't threaten rent at 15, but maybe later on down the road.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Diet_Connect",
            "body": "Had to relearn it, actually. Grew up poor, started making decent money, and started making bad habits. Tried to do everything my richer peers did growing up that I missed out on. \n\n\nRealized I wasn't any happier and started changing my habits back. ",
            "score": 6,
            "replies": []
        },
        {
            "author": "dudreddit",
            "body": "Having parents who were children of The Great Depression helped.  Oh, the stories I heard!  People often complain about how \"bad\" things are today.  Take a hot tub time machine back to 1932 for a few weeks then return ...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Longjumping_Wrap_810",
            "body": "I hate to say it, but for me, it was more of a panic thing. I was about to turn 30, had basically zero savings, a couple thousand in credit card debt after barely making it during covid, was paying student loans off, and was so easily influenced and addicted to buying wasteful shit online. I felt so behind any time I talked to any of my friends, who were already planning out having kids and talking about how they were already saving for retirement. \n\nI also had a stressful realization that I was really living paycheck to paycheck and that I couldn’t handle any emergencies if I lost my job, which is an uncertainty I couldn’t afford to ignore in this current economy and state of my country (USA). While we both make modest salaries, have a mortgage together, and definitely aren’t flush with cash, my husband is much better at saving than I am. He’s been there with me every step of the way as I learn to become more frugal and save money. Saving together (both together in a joint account and for our retirement accounts) is still a pretty early work in progress, but we’re working on it. \n\nNot saying that everyone needs to learn the hard way, but sometimes the wake up call when you’re in a little over your head is the most effective saving method.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JackFate6",
            "body": "My parents lived through the great depression",
            "score": 3,
            "replies": []
        },
        {
            "author": "Prestigious_Earth102",
            "body": "I definitely did all of this. Overly generous with friends, spent all of my money on fast food and restaurants, and then I'd ask to borrow money from my father. I am just now realizing how bad that is at age 26. Well I always knew but I was struggling with finances and used that as an outlet for getting my needs met. If that makes sense. I no longer borrow money from my father or partner. My biggest reasons for my spending were lack of money (I know that sounds contradictory but it's an emotional thing) and the fact that I was young and insecure. Maturing helps over time. Realizing I can't retire as quick as I want because I'm paying off my debt from 5 years ago. (5 more years to go). I would blow $200 on whatever and not have anything left. Now that I make decent, I want to actually save it or pay off debt. Food was an emotional thing for me and eating junk felt good. Cutting that out and eating simple meals helped. \n\nKnowledge of what debt can do to you if it gets too bad (homelessness, no retirement, etc) would have helped me a lot.",
            "score": 3,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "I will say, I find that people who are spenders tend to be very generous people!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "sohereiamacrazyalien",
            "body": "I think it is the way I was raised. we did not get everything we wanted and if a parent said no to something , it means no it doesn't mean if you have your pocket money on you , you can get it. I mean you could come buy it later but if it is no usually there is a reason. I was also thought self restraint I guess that helps (usually not eating or just a little at other people's places, no asking for things, being bratty etc)\n\nmy cousins were raised differently and it shows.\n\ngenerosity is totally different I grew up in an environment were people were generous so yeah I have always shared and bought things for my friends or paid for others (which later was a problem when I changed environment because people would take advantage and not reciprocate but that's an other story)... if it will make the other person happy or if I can pay for it I will, but yeah like for me within reason .\n\nI guess also I was raised and also perhaps never cared for (my brother is a bit different from that regard) to not value or think of brands as superior, and more look at the product itself (so we had branded and non branded clothes but often had non branded yet good and lasting clothes despite being way cheaper)\n\nI was also raised in an envirnment where if you don't have the money don't buy it, like credit is seen as a bad thing \n\nhonestly I would not give her the habit of borrowing from you except if there is an emergency or something... later she will borrow from the bank. if she has no money left she has no money left... she will have to deal with it.\n\nalso maybe explain how the expensive wants especially if they are not used often can be avoided idk.\n\nmaybe I am a bad example because I was abroad, alone at 17 having to manage my budget , food (well there was supposed to be a canteen but it closed that year so yay me) clothes and everything and in case of emergency no one was around . yet it was not that hard because of how I was raised. I never  was over budget .",
            "score": 3,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "Yeah, the only thing she's borrowed money from us for was to fix a phone that she dropped and the screen broke. We set up a payment plan and she did great and paid us back every bit of it. (We didn't charge interest.) But she asks! \n\n\nWe are debt free aside from our mortgage and don't finance things as a rule, so I hope we're setting that example! \n\n\nWe're also big on the thrift store and I've showed her how to make coffee from things we have at home, but \"it's not the same!\"",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sohereiamacrazyalien",
                            "body": "I mean she is a teen so what she learnt is already there and she might change her attitude later when she gets older.\n\noh the it's not the same crowd really make me laugh as if paying mare make things taste better (or be better if it's not food).... well you can make her coffee and charge her for it is will be the same ! lmao! \n\nunfortunatly even if you are like that the environment plays a big part of what kids perceive , admire, aspire to etc ...; what they see in school, their friends, society , tv , etc ...\n\nmaybe find a hook for her like an influencer or something that does and explain more sustainable things (which in general equal frugal) maybe people she can admire or relate to?\n\nfor me it's not really about the money only but all the garbage the waste the destroying the planet, I don't want to contribute to that also I don't want to be the dumb consumer that is taken advantage of and pays 10/2à times the price  for something worthless or unecessary.\n\nto be fair as a student I would have been in trouble if I exceeded my budget but really I did not envy or what the crap that my school mates had ... I didn't see the appeal or the necessity.... the sandwiches outside were not as good as homemade, I don't have 20 feet so I don't need plenty of shoes that would fill my limited space and so on, I loved markets , the produce are fresh, it is lively , we had always gone there , it's an outing and often the prices were cheaper....\n\nso she could be motivated by something else? been sustainable? green? zero waste? anti consumption (if she sees the real impact on the environment of all the junk we buy) ? or saving for charity? or having a hobby of charity instead of the coffee shop and whatnot\n\nidk maybe I am just rambling",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "cashewkowl",
                            "body": "Next time I’d consider charging interest, if there is a next time. \n\nOne thing I did with my kids was to help them open an IRA once they were earning money. Then I promised to match up to the first $1,000 they put in, but making sure they understood that this was retirement money. I showed them the graphs of how much the money you save early is worth later.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "I-own-a-shovel",
            "body": "No. I did it naturally. My grand pa gave me cash as a little kid, I piled up everything in a huge rain coat can. \n\nWhen I got my first job I also piled up everything. Was able to leave my parent house with a decent cash down for an house.",
            "score": 3,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "One of my other kids is like this, and so was I!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Few_Onion9863",
            "body": "I still make poor financial decisions, but I certainly don’t spend money I don’t have. \n\nI grew up fearful of going into debt — my family never had much money, and they very carefully chose how to spend it. I grew up yearning and longing for a lot of the toys, clothing and experiences my peers owned and enjoyed. It l felt like the answer was always NO when I asked for something. Even at holidays and on my birthday I’d get knockoffs of things for which I’d asked. \n\nCould my parents have afforded them? Absolutely they could’ve, but they didn’t want to spend much at all on their kids. \n\nThis was the 80s and the quality of our food was never premium either because my mom shopped in the frozen and canned sections. So I got jobs early — starting age 10-11 — and learned how to save for the “frivolous” things I desired — jeans that fit me, shoes other kids didn’t make fun of me for wearing, shampoo that wasn’t generic, etc. As an adult I still shop the sales, don’t really vacation or spend much at all at salons or on hobbies etc. \n\nSo … my family was never in danger of like going hungry or getting kicked out of our home, but we always drove unreliable cars that broke down a lot and prevented us from making plans or traveling out of town for YEARS. Any club at school or subscription was usually a no, unless I paid for it myself. \n\nWas it learning frugality the hard way? I guess not, especially compared to folks living in poverty or who are being financially manipulated etc. It wasn’t easy, but it wasn’t exactly traumatizing either.",
            "score": 3,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "This sounds similar to our situation. We're solidly middle class in a HCOL area with 4 kids on a single income, so although we don't  drive cars that break down, they aren't anything fancy. The kids all do sports, but just rec, not club or travel. We shop at thrift stores and Aldi and usually take small trips a few times a year. These choices have allowed my husband to max out his 401k, which is great, but don't leave a lot left for the extras that my daughter buys for herself. ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnalystAlarmed320",
            "body": "Yeah. Grew up poor, but my parents always wanted to be rich. We would have designer clothes but no food in the house. I do not doubt they have tons of credit card debt still and are still living beyond their means despite my mom making really good money now. However, they worked minimum wage jobs until I was in my 20s, so I never knew anything but near poverty.\n\nI had to learn frugality on my own. I placed paying my basic necessities above all else. Learned about food pantries. Fell into the pit of predatory loans and pulled myself out. Learn to cook really good meals to avoid going out. I fell into unemployment for 4 months, drained our savings trying to get another job, and learned many good lessons. Learned different trades, saved up money, and learned to keep to a strict budget. \n\nMy proud point is I have never been evicted, I have never had my electric or utilities turned off, I have never had my car taken away and I have always had food in the house. It is much more than my parents ever did and this is achieving my childhood dream.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Impressive_Tigress",
            "body": "I was raised by a single dad and grew up in a house where we bought things we needed and only very rarely bought things we wanted but didn't need. I wasn't given an allowance and I had to get jobs if I wanted money. Also, my dad was big on reading consumer reports and really researching different products before making big purchases so as not to waste money. This modeling helped.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Avenged_7zulu",
            "body": "I lived in literally poverty for quite a while. Thats when i learned. thats when i looked at me and decided i was going to re-invent myself as corny as that sounds. Some people, myself included, for some reason have to learn somethings the hard way. Its part of the journey of life. Unsolicited advice will almost always fall of deaf ears even if its your child. If they are like me you can offer advice but dont make it become a \"you're doing it wrong\" conversation. Not really sure theres any one thing that someone could've said to me to snap me out of it. If i could go back i would tell myself nothing but i would tell those around me let me make mistakes and pay the consequence but dont tell me how right you were and definitely dont just watch me suffer. Kinda like some of the kids on scared straight. Just a quick taste of the path they were on helped them, they didnt need to serve a year at county to learn their lesson.",
            "score": 2,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "That's a good point. I tend to harp on things, like when she gets paid and then buys Starbucks every day for a week. ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Avenged_7zulu",
                            "body": "Well if she wants money from you it should be on your terms. Perhaps theres some kind of debt card out there with parental controls that limits spending. Or just give a refillable card or an envelope of cash for each month and say once its out its out. Show her a budget in that way. Maybe then she will be more conscious of her spending and make changes on her own. Expect push back if this is a boundary you've never enforced before but just stay firm, calm and confident. Good luck to you both.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CertainDamagedLemon",
                                    "body": "She has a teen checking account and a debit card. No overdraft yet! The boundaries have always been there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "violetstrainj",
            "body": "If you mean from birth, then yes. I don’t know what would have helped me other than being born to parents that weren’t crazy, and last time I checked it was too late for that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Disastrous-Wing699",
            "body": "It's hard to say what piece of information will click at any particular time. Things I heard at one age didn't make any sense until I lived through the moment they clicked, and suddenly I didn't know how I'd lived without that understanding. Things that bounce off now - or appear to - may be sinking in in ways that won't become evident until later.\n\nFor young people (and their parents), I highly recommend Gail Vaz-Oxlade. She has several books and television shows that explain many vital concepts in approachable language, with a firm-but-kind tone. I think at least one of her shows streams free on Tubi or the Roku channel, and her books are available at the local library.\n\nI also really like How To Survive Without A Salary, though that's geared towards people who've entered adulthood. It could be worth taking a flip through, if only because it frames finances and budgeting in a unique way, though it is now several decades old. Your mileage may vary.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OjoDeOro",
            "body": "Honestly what helped me was moving out & on my own. Frugality became a game for me so I actually enjoyed the challenge. Now I am not so extreme but I still have several of my frugal habits🙂",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdImportant4369",
            "body": "No",
            "score": 2,
            "replies": []
        },
        {
            "author": "EnigmaWearingHeels",
            "body": "I was the kid with expensive wants whose parents told me what they wouldn't pay for (clothing, make up, frivolties of youth). When they refused to finance my lifestyle, I got jobs. Let her figure it out. Don't loan her money when she comes up short- let her realize that lending money leaves her short. Better for her to learn it while the biggest consequence is missing friend time or missing buying a trendy item rather than leaving her homeless. I learned to manage my money in my early 20s, because I turned 21 in 2008 and everyone was on a budget that year and subsequent years. I've always been a hard worker and I now run a few successful small businesses. If the work ethic is there, it's likely the rest of the youthful indiscretionary spending will work itself out.",
            "score": 2,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "This gives me so much hope that we're on the right path, thank you!  Did you ever resent that your parents didn't finance your wants? ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "EnigmaWearingHeels",
                            "body": "Nope they did me a big favor in that one regard!\n\n Even after I got a job and was paying for my own stuff, my mom would still make comments about my frivolous spending, which I still recall. I finally looked at her and asked if she'd prefer I buy drugs instead of make up and she knocked it off. Sounds like your daughter is a go getter!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CertainDamagedLemon",
                                    "body": "Hahaha! I love that, and good point. I am a big reader and buy tons of books from the library stores and I always tell my husband \"It could be drugs. Would you rather it were drugs?\" So that hits home.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "EnigmaWearingHeels",
                                            "body": "Visit the website second sale! Just a few dollars a book on most anything and free shipping on orders like $30 or $40. My go to source for new to me books. Books are intoxicating! Definitely drugs 🤣",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElizaDoGood",
            "body": "I think it’s easier to spend a lot and ignore frugality when you have a safety net of parents willing to bail you out. I didn’t learn to be frugal until that safety net gave out on me and then I was forced to make some hard changes. Your kid would do well to learn these lessons now while safe at home, but I get it—some lessons we only learn the hard way. I’d say the money you lend her should be a loan that she pays back at the end of the month or some other deadline so she has some structure. Then I’d put that money in savings and give it to her when she moves out as a nice head start.",
            "score": 2,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "Yes, that's close to how we've done it. She's been great about paying back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BeckQ47",
            "body": "My parents were not frugal, and now they have crippling debt and terrible credit scores. A big eye opener for me was getting close to not being able to pay for basic bills, and knowing my credit score would tank if I didn't figure it out. Unfortunately, in the US a credit score is super important, but it means I have a metric for how I need to be living my life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sidewalk_Tomato",
            "body": "I was raised frugal, and stayed that way.\n\nAs a teen, I occasionally asked my Dad for money sometimes ($10 or $20) but that was fair.  It was from a death in the family, and legally, it was my money too.\n\nI would say that she needs to be told how much it costs to live (rent, utilities, food), having it explicitly spelled out, and she needs to be taught how to do taxes, at least the \"short form\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Gear_1093",
            "body": "When I first got my allowance my parents were clear that I wasn't allowed to borrow money. I spent every penny for the first few weeks then figured it out from there",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lanky-Reaction4346",
            "body": "Nope\n\n\nWas raised by a single mother and it taught me the value of being grateful for what you have and also BUDGETING!\n\n\nUnlike parents today she didn't hide the finances from me. I went with her to pay bills. I remember how upset she was when bills were higher than what she expected.Also I remember how small her check was compared to all of it.\n\n\nHeck I didn't even ask for a prom dress for prom. I wore a dress I already had that way she didn't have to fork over 600 bucks she didn't have",
            "score": 2,
            "replies": []
        },
        {
            "author": "WinterIsBetter94",
            "body": "Kind of.... when I was married without kids and we both had well-paying jobs, we spent frivolously (it was the early 2000s, life was nowhere near as expensive as now).  When first child came along, I decided to stay home with her (1-1/2 years after she was born, daycare issues with her being repeatedly bitten) and our HHI was cut by 53%, boy did I learn \"frugal\" fast. I'm currently 2 months from paying off a 0% interest card that was used for a home improvement, after that the only debt we have is the house.\n\nOur first kid is now the most frugal human I've ever met, LOL. She makes more than me and saves faster (she lives at home, on purpose, to save). She buys to support her MTB and stringed instrument habit, LOL, but she plans for purchases and maintenance and pays cash. I doubt she'll ever 'not' be frugal.\n\nHer little brother, though, has a part time engineering-related job while in college and super expensive hobbies (mountain biking - there's an expression \"get your kid into mountain biking, they'll never have money for drugs!\" - but what it means is they'll never have money to save.  He's now a bike mechanic and photographer / videographer. While he has side hustles that offset the bikes / cameras / drones, he spends 67-90% of what he earns any given month. I think he'll need a 'hit the wall' moment to become frugal.\n\nHe's about to be engaged, though, maybe needing to save for their own place will flip the switch.  Fingers crossed!",
            "score": 2,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "That's what I\"m finding with my kids is they definitely have different personalities when it comes to money, but so do my husband and I!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "amla819",
            "body": "Yup. Put stuff on CC’s when I was young and took out student loans. Still working on keeping afloat. I’m not sure what would’ve helped me learn earlier though bc having those lines of credit made it so that I could buy groceries and go to school. I would have probably been homeless without them, I was pretty frugal even as an 18 year old given the circumstances bc I had to be. So yeah I guess some money earlier on plus basic knowledge about budgeting and investing all together could have made a difference",
            "score": 1,
            "replies": []
        },
        {
            "author": "District98",
            "body": "I think I typically did fine with money, but one thing I’ve become more frugal about is paying attention to small amounts and small percentages. Whereas years ago I would go, eh, who cares about 2% or $2, now I am PAYING ATTENTION to that type of sale. It’s not a huge amount but over time it’s a good habit to be in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proud_Republic4545",
            "body": "Been homeless a few times in my life so I got very good with money once I ended up getting a decent job. I started saving and I kept my mouth shut about how much I had and played broke ",
            "score": 1,
            "replies": []
        },
        {
            "author": "poshknight123",
            "body": "I think there's two parts here:\n\n1. Have you actually sat her down and talked about money in and money out? Priorities? Pen to paper type stuff. Sounds like you're taking a hands off approach, but maybe a lesson or two will help.\n\n2. The other thing is to help her examine her motivations. Is this a work hard/play hard scenario? Like is she doing this because she deserves it because she works? Or is it a feeling rich scenario? Like she has her own money and they sky's the limit? There are other scenarios, too, but these are common ones. These are complex emotions that a teenager might have a hard time processing and working through. Learning to budget while having these emotions might be difficult, and I think addressing how she is feeling with her money might go much farther than simply teaching her how to budget using a spreadsheet.",
            "score": 1,
            "replies": [
                {
                    "author": "CertainDamagedLemon",
                    "body": "I think right now her primary objective is just to have fun because she's a kid. We have talked priorities, what she could be doing now to prepare for the future, etc. But her philosophy is that she'll worry about that when she has to and not before.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ctzn2000",
            "body": "I think the best way to handle is to give her an allowance that's reasonable and that's it. If she spends it all in 3 days that's on her. No credit cards (don't put her on yours), unless they are her own and she pays the bill herself. She can use a debit card from her checking account and she should monitor it herself. Make the allowance like a bi-weekly paycheck to mimic the real world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdRoutine8022",
            "body": "Here i learned more than anywhere else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "curtludwig",
            "body": "I got super lucky and made my mistakes early and scared myself when I was only hundreds of dollars in debt. So I learned to keep my debt under control.\n\nIt took me a LOT longer to learn to keep my spending under control and interestingly it came from eating out. I found the bad feeling I got from realizing I couldn't do the things I wanted to do (like buy a house) because I was squandering my money eating out on food that really wasn't that good.\n\nEven thinking about it now, nearly 20 years later I feel, bad isn't the right word, I guess embarrassed more than anything. Did I really need that mediocre ruben with fries?\n\nBeing house poor for a few years was very instructional for me.\n\nMy advice for your daughter is to not front her money. Especially when its something she really wants to do. \"Mom I really really really want to go to this show but I don't have the money.\"  \n\"Guess you should have thought of that when you spent it on other stuff.\"\n\nWe all need to realize that resources are finite. Its not a fun realization but its an important one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "22poppills",
            "body": "Yep, \n\nLots of debt from an alcohol addiction and chose the worst time get back on my feet but I knew I had to start somewhere. Got a $1 planner from the dollar tree and started counting every dollar.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spidersinthesoup",
            "body": "i have become more frugal since i retired because i am now in charge of the house/cooking and such. i love this sub because of it also. so many new ways to use stuff again that also get me looking for new ways of using stuff we already have for new projects. shit is begetting over here all the time :)",
            "score": 1,
            "replies": []
        }
    ]
}