{
    "title": "Pro tip: when asked what size free tshirt you want; always say,",
    "author": "beestockstuff",
    "subreddit": "Frugal",
    "rank": 16,
    "score": 0,
    "upvote_ratio": 0.33,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Frugal/comments/1jeif8c/pro_tip_when_asked_what_size_free_tshirt_you_want/",
    "id": "1jeif8c",
    "selftext": "“The biggest one you have” \n\nThis way you get the most possible fabric and you can reuse for more rags after you wear it out. \nPossible uses include; grease wraps, cleaning rags, quilts, patches, there are hundreds of possibilities for a giant old tshirt! \nAlso you can primarily use it in the beginning for a sleeping shirt and if big enough it can work as a whole outfit!",
    "comments": [
        {
            "author": "DarthTempi",
            "body": "There are sources of free clothing, this goes past frugal to just stupid",
            "score": 41,
            "replies": [
                {
                    "author": "JerryBoBerry38",
                    "body": "Yeah, this one is pretty dumb.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "therealhlmencken",
            "body": "Do you do this with all clothes?",
            "score": 8,
            "replies": [
                {
                    "author": "KarmaSilencesYou",
                    "body": "Nah,  no one gives me free underwear.  Even only fans charges me for them.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "beestockstuff",
                    "body": "Just when I’m asked what size free tshirt I want. I’m not really going to wear it in public much so\nI get the gown size and wear it till it’s wore out then make as many rags as possible",
                    "score": -13,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grand-wazoo",
            "body": "How often are you encountering a free T-shirt scenario that you think this becomes applicable to every day life?\n\nIt's easily been five years or more since I can recall the last time.",
            "score": 7,
            "replies": [
                {
                    "author": "Texastexastexas1",
                    "body": "I’m a teacher so 2-4x year.\nAnd it’s a great tip because I never wear them.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "AurelianaBabilonia",
                            "body": "I'm a teacher and I've encountered this scenario never in my 15 years of work. Where do teachers get free t-shirts from? Now I need to know.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Texastexastexas1",
                                    "body": "We get one at the start of every year, one \nfor Homecoming (this small town lets school out at noon for the parade), one from the district every odd year and this year we got one for DrSuess week.\n\nI usually donate them because I don’t wear them outside of work. Using them sounds like a better idea.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "beestockstuff",
                            "body": "Thank you! Exactly!!!",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Visible-Traffic-5180",
            "body": "But if you're wearing a bigger shirt, it uses more water/energy/detergent to clean it during its lifetime, surely? Which probably negates any savings on, uh, rag money. ",
            "score": 13,
            "replies": [
                {
                    "author": "beestockstuff",
                    "body": "I lol’d at this.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "DarthTempi",
                            "body": "You lol'd at basic logic?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "polish94",
            "body": "I've never once used clothing for another purpose. It gets tossed or donated. I'm not out here scrounging for fabric.",
            "score": 29,
            "replies": [
                {
                    "author": "beestockstuff",
                    "body": "Well then I win. I’m more frugal than you are.",
                    "score": -35,
                    "replies": [
                        {
                            "author": "sarabridge78",
                            "body": "It is not a contest.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "YugoB",
                                    "body": "It's clearly a contest for dumbest way to be frugal, and OP is clearly winning",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "beestockstuff",
                                    "body": "Is too.",
                                    "score": -12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Retirednypd",
            "body": "That's ridiculous.   You will wear Ill fitting clothes, so at some point in the future you can have more cleaning rags.",
            "score": 3,
            "replies": []
        },
        {
            "author": "steelcityrocker",
            "body": "OP, can you offer any oversized free tshirt fashion tips?\n\nRight now I only put a belt around mine, making it a skirt. I am a 5'7\" dude, so I get some decent length out of a 2XL.",
            "score": 3,
            "replies": [
                {
                    "author": "raptorgrin",
                    "body": "Do you think that a 4xl would be long enough a tunic for a 6’1” man? To be a decently covering garment?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "beestockstuff",
                            "body": "These are both great ideas. I prefer to bunch it up with a scrunchie 1990’s style; or just wear it as is with nothing under it. I call that one the bojangles",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sherahero",
            "body": "I wouldn't recommend that because then someone who needs a larger size won't be able to get something they can actually wear.\n\n\nSimilarly, I've seen people mention that it's somewhat bad etiquette to buy a bunch of plus sized clothing from thrift stores to alter smaller because bigger people can't magically make a medium for an extra large person.\n\n\nIt's a tricky ethical situation because yes, first come first serve but also it's a privilege to take something just because you want it, when someone else might need it.",
            "score": 11,
            "replies": [
                {
                    "author": "Charloxaphian",
                    "body": "OP is the reason I can never get a 2X when I need one.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Entire_Entrance_1608",
                            "body": "A frugal person shouldn’t need a 2X. \n\nQuit spending on calories your body doesn’t need.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "sherahero",
                                    "body": "That's super not helpful thanks",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Murky_Possibility_68",
                                    "body": "What a novel idea no one's  ever heard before!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OjoDeOro",
            "body": "Relax, folks. OP clearly said “after it’s been worn out” the tee can be used for other things. Calling his post “stupid” is completely unnecessary.",
            "score": 2,
            "replies": [
                {
                    "author": "sherahero",
                    "body": "The stupid part is getting a shirt multiple sizes too big and wearing it until it's worn out to have free rags.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gufurblebits",
            "body": "Frugal vs. cheap.",
            "score": 1,
            "replies": [
                {
                    "author": "beestockstuff",
                    "body": "It’s a “free” tshirt. Might as well\nMake the most of it???",
                    "score": -1,
                    "replies": []
                }
            ]
        }
    ]
}