{
    "title": "Where can I donate well-worn shoes?",
    "author": "InstanceInevitable86",
    "subreddit": "Frugal",
    "rank": 14,
    "score": 0,
    "upvote_ratio": 0.18,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Frugal/comments/1jejqif/where_can_i_donate_wellworn_shoes/",
    "id": "1jejqif",
    "selftext": "I'm having trouble finding a sort of donation center that will accept well-worn shoes. I have like a hundred pairs of decently well-worn shoes accumulated over like two decades. These shoes range from rarely worn (but like twenty years old), to kind of battered but still usable for those who really need it, to kind-of-worn but totally reusable second hand. So, none of them are \"like new\" or \"gently used\", which is what I've found all these donation centers require, like shoe recycling programs or local churches.\n\nI can't for the life of me find an \"in-between\" for these kinds of places that require \"like new\"/\"gently used\" shoes vs. just throwing it in the trash and these shoes ending up in a landfill. I think all of these shoes can either be used second handed or refurbished for a second life to someone who really needs them.\n\nAnd I really want to actually donate them, not just give them to someone else like Goodwill to sell for profit.\n\nDoes anyone have suggestions?",
    "comments": [
        {
            "author": "SooMuchTooMuch",
            "body": "I had a pair of nicer sandals that I basically didn't wear for 10 years. When I went to wear them again, the soles literally crumbled while I was at work.",
            "score": 1,
            "replies": [
                {
                    "author": "InstanceInevitable86",
                    "body": "I agree, some of these are crumbly, but there are also parts that can certainly be reused. My point is these are all shoes that can at least be in part reused and I really want to find a way to donate to someone who has use for them rather than sending them to a landfill. Just having trouble finding how to find that \"someone who has use for them\"...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "_LoudBigVonBeefoven_",
                            "body": "I don't think anyone wants crumbly parts of shoes either",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Winter_Owl6097",
            "body": "I understand being frugal and I understand wanting to donate, but some of the shoes you're describing are trash. If you want frugal then keep the ones that are decent and wear them yourself. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "themobiledeceased",
            "body": "The hard truth is that very few places will accept clothing or other items that aren't new or gently used.  My neighbor elected to donate a couch with a pullout bed.  Non smoking, cleanly home, no pets.  Think it was Catholic Charities that inspected it and declined to accept unless she purchase a \"sofa cover\" to donate with it.  Said their clientele would not accept as the couch wasn't stylish enough.  Apparently Baby items have little resale value. My neighborhood puts highchairs, strollers, and other used but in good shape baby items at the curb for trash pickup. If still there the days of trash pick up, do cleaning sanitizing, and take them to a charity shop. Clothing and shoes have very little resale value.  You could offer on Buy Nothing pages.  Free Facebook Marketplace.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HilVis",
            "body": "Offer them up on a free site. If someone wants them they will say so - if not either donate them to a thrift store or throw them away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GnomesStoleMyMeds",
            "body": "Why would you want to donate shoes that will not last? It is okay to just throw away things that have worn out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Border_Relevant",
            "body": "Would you wear them if someone donated them?",
            "score": 1,
            "replies": [
                {
                    "author": "InstanceInevitable86",
                    "body": "Me, no, since I'm not in need of them. But as the saying goes, \"one man's trash is another man's treasure.\" There's always *someone* who could find use in them somehow.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sandgroper1968",
                            "body": "Ffs, just throw them out, the world is overflowing with used clothing and shoes. If you’re having this much of a hard time finding someone who wants them there’s a reason",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lostintheclouds72",
            "body": "Find a textile recycling location. It’s free 99% of the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "athennna",
            "body": "There are online recyclers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Establishment8642",
            "body": "Hopefully no one wants well worn shoes! Who wants someone else's true trash? Hell, people don't really even want to wear their own trash shoes. \n\nGood lord, Christ on a bicycle, allow people their pride!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Empty_Occasion_963",
            "body": "Any second hand store, Facebook marketplace. Churches. Homeless shelter. Hell maybe even an old folks home.",
            "score": 1,
            "replies": [
                {
                    "author": "InstanceInevitable86",
                    "body": "I checked all of those except facebook marketplace may be a good idea. Unfortunately the churches, homeless shelters, old folks homes...I checked all of the ones within a 100 mile radius of me and they all require the shoes be in basically new condition.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "anananon3",
                            "body": "That’s because no one wants your 20yr old foot fungus.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VorpalBlade-",
            "body": "Any thrift store will accept them.  Bag them up and drop them off.",
            "score": 1,
            "replies": []
        }
    ]
}