{
    "title": "Starting today, Lithuania, Latvia, Estonia, and Poland withdraws from Ottawa Convention (Anti-Personnel Landmines Treaty)",
    "author": "Arnukas",
    "subreddit": "europe",
    "rank": 14,
    "score": 6495,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 650,
    "url": "https://i.redd.it/fx8n8p3uoepe1.jpeg",
    "id": "1jdzzl1",
    "selftext": "",
    "comments": [
        {
            "author": "Obvious_One_9884",
            "body": "Finland joins the crew soon. The case is introduced to the parliament in the upcoming days.",
            "score": 1986,
            "replies": [
                {
                    "author": "A-Lewd-Khajiit",
                    "body": "When the Finnish snow starts exploding",
                    "score": 691,
                    "replies": [
                        {
                            "author": "Sanizore05",
                            "body": "You know you are in bad situation when Finnish snow starts singing.",
                            "score": 321,
                            "replies": [
                                {
                                    "author": "Raz0rking",
                                    "body": "Fuck, there are two of em!",
                                    "score": 83,
                                    "replies": [
                                        {
                                            "author": "Nickor11",
                                            "body": "*softly whispers in Finnish* Kun metsä kuiskaa suomeksi, kuuntele tarkkaan ja toivo että olet ystävä.",
                                            "score": 51,
                                            "replies": [
                                                {
                                                    "author": "Raz0rking",
                                                    "body": "Uh what? [All I can do is show you a Fin sabilized Sabot.](https://www.reddit.com/r/NonCredibleDefense/comments/z8gzn1/armor_piercing_fin_stabilized_discarding_sabot/)",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "roz_2",
                                                            "body": "I can hear Polka playing from my home already\n\nNow I just need to grab a BT-42 from my garage",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Raz0rking",
                                                                    "body": "[Polka I can do.](https://www.youtube.com/watch?v=0LfT5qJH2zc)",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "roz_2",
                                                                            "body": "Thank you, have this in return\n\nhttps://m.youtube.com/watch?v=IUxUggOJqsk",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FalcoonM",
                                    "body": "Coincidentally - what would a Finnish snow be singing?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ddobb",
                                            "body": "https://www.youtube.com/watch?v=hqthspSKZV8",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NoxiousAlchemy",
                                    "body": "And when they abandon the camp leaving lots of sausage behind.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "5thhorseman_",
                                    "body": "You know you're in a bad situation when your troops start dying to Finnish snipers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Neutronium57",
                            "body": "Snow :\n\nFinnish snow : **\"PERKELE !\"**",
                            "score": 91,
                            "replies": [
                                {
                                    "author": "NerdPunkFu",
                                    "body": "\"Hakka Päälle\" is the more appropriate cry.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sysilith",
                            "body": "*Finish children",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Boustrophaedon",
                            "body": "That's amore!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "fastdub",
                            "body": "That's  amore!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Low-Island8177",
                    "body": "People still don't understand how fundamentally important it was when Finland joined Nato. The ENTIRE cold war they were playing both sides of the fence out of sheer geographical necessity. They used to BE part of Russia, and it's long been a Russian and Soviet ambition to retake Finland. The entire Winter War started because the Soviets were afraid of the Finns. \n\nAnd then they added 1340km to Russia's strategic border with NATO. Not just the border. The northern flank.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "skalpelis",
                    "body": "It's the same here. We haven't really withdrawn from anything, this is just a recommendation by the MoD. It will need to be ratified by the parliament, then if it passes, the UN and other signatories must be notified and only then the 6 month countdown begins, and we are out after that.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "LilianCorgibutt",
                    "body": "Good!!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Jakeyboy143",
                    "body": "I hope if they fight Russia, they're gonna sink that deadweight called Admiral Khuznetsov. That Aircraft Carrier needs a mercy kill through drones.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CmdrJonen",
            "body": "The convention is a good, noble and just idea.\n\n\nJust not a practical one when you neighbor Russia who not only is nonsignatory, but has also waged unrestricted mine warfare against civilians in every country they have ever been at war with with no sign of stopping.",
            "score": 1732,
            "replies": [
                {
                    "author": "Alternative-Copy7027",
                    "body": "Not to mention they target ambulances and do double-tap strikes to residential buildings to kill as many firefighters as possible.",
                    "score": 583,
                    "replies": [
                        {
                            "author": "dat_9600gt_user",
                            "body": "Basically what a terror state would do.",
                            "score": 79,
                            "replies": []
                        },
                        {
                            "author": "EDCEGACE",
                            "body": "That is fucking true. Their goal besides terror, is to normalise that in your head.",
                            "score": 201,
                            "replies": []
                        },
                        {
                            "author": "atpplk",
                            "body": "Or booby trap teddy bears",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "directstranger",
                            "body": "Just the other week they used cluster bombs on a city....",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Tight-Bumblebee495",
                                    "body": "They’re using those since day 1. All those photos of rocket-looking thingy sticking from the ground in residential areas - those are cluster munitions containers from Grad/Tornado MRLS.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Interesting-Scar-800",
                            "body": "They even launched a tank shell at a cyclist!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Spiritual_Coast6894",
                            "body": "I’ve heard they also eat children.",
                            "score": -66,
                            "replies": []
                        },
                        {
                            "author": "Alternative-Copy7027",
                            "body": "I haven't heard that. They just kidnap them and give them to Russian couples to raise as Russians.",
                            "score": 74,
                            "replies": []
                        },
                        {
                            "author": "gamecatuk",
                            "body": "You missed out the raping part.",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "FML712",
                            "body": "And then they will come as sleeping cells back to Europe, you knew that?",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "manole100",
                            "body": "Hey, they're not literally eating children, why don't you guys give them a break? - ^ that guy.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Tight-Bumblebee495",
                            "body": "Great joke, asshat. Nothing brightens the day like making fun of targeted attacks in civilians, keep it up.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Spiritual_Coast6894",
                            "body": "I'm making fun of convoluted warmonger propaganda.",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "completely_regarded",
                            "body": "Move to Russia, traitor.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Spiritual_Coast6894",
                            "body": "Not my war, simple as.",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "completely_regarded",
                            "body": "Pacifists deserve what they get.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Spiritual_Coast6894",
                            "body": "Why aren't you on the front? r/ukrainevolunteers",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "completely_regarded",
                            "body": "Pacifists deserve what they get.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Judazzz",
                            "body": "He's not a pacifist: every single account repeating the \"*Why are you not at the front?*\" talking point is doing Moscow's bidding by verbatim repeating their agit-prop.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "berejser",
                            "body": "How do land mines stop missile strikes?",
                            "score": -28,
                            "replies": []
                        },
                        {
                            "author": "faen_du_sa",
                            "body": "think it has more to do with the whole invasion part!",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "berejser",
                            "body": "Sure, it'll have an effect there, but most of the missiles and drones that strike Ukraine come from within Russia.",
                            "score": -17,
                            "replies": []
                        },
                        {
                            "author": "gamecatuk",
                            "body": "They are far less of a problem than the hordes of orcs raping and killing children.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "berejser",
                            "body": "A big part of the reason the treaty existed in the first place is because a whole bunch of children living in former conflict zones kept getting their legs blown off.",
                            "score": -8,
                            "replies": []
                        },
                        {
                            "author": "TotallyADuck",
                            "body": "Because it needs to be cleaned up.\n\nUkraine already has to clean up an enormous amount of land and an unthinkable amount of existing unexploded ordinance. Cluster munitions and land mines will help to prevent Russian forces from advancing further meaning less overall land needing to be cleared.\n\nThey are horrible weapons that should never have to be used, but unfortunately it's a choice between potential future deaths and ones right now and the longer the war goes on the more people will die. The more Russian forces die the more likely the borders return to their 2014 or 1994 states and the missile strikes stop.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "berejser",
                            "body": "I don't see how \"if we also use them then less of them will be used in total\" is logic that makes sense, unless we're saying that Russian children maimed by unexploded ordinance don't count towards the total.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "TotallyADuck",
                            "body": "Perhaps you'll understand if I dumb it down a bit:\nIf you had to cut grass using a pair of scissors would you rather cut 1 acre or 100 acres? Would you really choose the 100 acres, despite being 100x the size, just because the 1 acre has denser grass?\nAnd yes, while I understand your point that it will likely take the Russian authorities decades to gather a single fuck about thier own people and consider cleaning their own land that is utterly irrelevant to Ukraines decion making since they were the ones invaded.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "berejser",
                            "body": "Why are you making the assumption that if both sides have grass seed, then only 1 acre would get covered in grass, but if only one side had grass seed, then 100 acres would get covered in grass? Surely the more sides that are throwing grass seed the more areas that are going to get covered in grass.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Iapetus_Industrial",
                            "body": "And what does it tell you about Russians if Lithuania, Latvia, Estonia, and Poland KNEW the risks with landmines blowing the limbs off of children, and STILL said that that is an acceptable alternative to Russians invading their countries?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Mindless_Parking_714",
                            "body": "That governements don't care for their people, what a news",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "pootscootboogie6969",
                            "body": "I guess it would be really cool. If Russia would just stop attacking its sovereign neighbor you know. nobody would get their legs blown off if Russia would just stop being agenocidal aggressor.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "gamecatuk",
                            "body": "Yep but if you have paedophile orcs on your doorstep it's the least worst solution.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kalamari__",
                    "body": "we can all be noble and try to do the right things (which is a good goal in a perfect world), but when half the globe and its major powers dont play that game (anymore), you will lose in the end. simple is that.\n\nI dont like it, but it means that, when we want to defend our values and our way of life, we have to become a little bit more dirty, then so be it.",
                    "score": 81,
                    "replies": []
                },
                {
                    "author": "Sandelsbanken",
                    "body": ">The convention is a good, noble and just idea.\n\nAnd big powers never seem to sign these for some reason.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "ItsTom___",
                            "body": "Just had a look at who never signed it\n\n\n\n\nAnd what a surprise/s",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Overgrowntrain5",
                            "body": "It is very curious indeed...",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "AcanthocephalaEast79",
                            "body": "Cause it's stupid af. If you don't want to use a particular piece of military equipment just stop investing in it. What's the point of signing on to these international virtue signalling bs when in times of crisis you’ll reverse course?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Golda_M",
                    "body": ">The convention is a good, noble and just idea\n\nI don't totally disagree, but you could also argue it was a petulant, self-righteous concept.\n\nAnyone who signed did so knowing they would un-sign the moment a need returned. Everyone still stockpiled these. The idea was always to create a standard to be applied to others, and live up to it yourself by default.\n\nIn practice, the (kinda fake) taboo on anti-infantry mines and (even moreso) cluster munitions really hurt Ukrainian defense. Russia's badly conceived battle plans in the initial invasion (remember the Belarus-Kiev convoy?) left Russia badly exposed to attacks from such weapons.\n\nThey were eventually supplied, and (remote deployed mines especially) played a big role in halting Russia's advance in the east and south. But Zaporizhia had already been lost. Russia had opportunity to deploy useful idiots and delay supply for months. Ukraine started with very little of what otherwise would have been a primary defensive munition.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "CmdrJonen",
                            "body": "I believe this falls under the nonpracticality part of my comment.\n\n\nA lot of western AP mines and cluster munitions banned by such treaty were developing technical solutions to the problem that led to the treaty when the ban went into effect.\n\n\n(Sweden signed cluster weapons ban and therefore pulled from inventory DWS 39, despite that being technically compliant with the treaty, because it had been developed to be used on Soviet columns on Swedish territory ahead of counter attacks, and as such tolerance for UXO was Zero during development.)",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Golda_M",
                                    "body": "Sure. I didn't mean to sound like I was negating your comment. \n\nI think we both agree that being noble is good, but there's no room anymore for \"noble bullshit.\" That tendency has not served well.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DebtMosttly",
                            "body": "finally some common sense hope it works out well",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Fifth_Down",
                            "body": "The problem with landmines is that they are a defensive weapon which makes them redundant in a “mutually assured destruction” scenario.\n\nPoison gas and nuclear weapons have been minimized in large part because the losing nation knows if they resort to this tactic, the opposing side which is stronger and more resourceful is gonna pound them with the exact same type of illegal weapons. Its why Hitler used the V-2 rocket as a last ditch effort to stop the allied advance and not poison gas. Because the Americans and British couldn’t respond with their own types of rockets as they were too far behind with such technology, but they had existing WWI technology on chemical weapons and could have responded in kind.\n\nHow would NATO respond to Russia using landmines against them? Plant landmines in Alaska? It just doesn’t make sense.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "InevitableSprin",
                            "body": "Ukraine (nor Russia) never signed those, so landmines and cluster munitions were a feature of war since day 1.\n\n\nYou can probably find photos of Ukrainean strike on Milerovo air field with cluster warhead of Tocka U, or Ukraine's strike on Melitopol port, with similar missile.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "McDonaldsWitchcraft",
                                    "body": "That's not true. They signed and ratified it and never withdrew from the Ottawa Treaty.\n\nhttps://en.m.wikipedia.org/wiki/List_of_parties_to_the_Ottawa_Treaty",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "InevitableSprin",
                                            "body": "Well both landmines and cluster munitions usage in February 2022 is a fact. I can't explain the rule lawyering.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "McDonaldsWitchcraft",
                                                    "body": "Then don't lie about it.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Weird-Tomorrow-9829",
                                    "body": "Ukraine had signed the Ottawa treaty.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "InevitableSprin",
                                            "body": "But used landmines and cluster munitions. I can't really provide the rule lawyering but fact is a fact.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Golda_M",
                                    "body": "This is not quite true. They *were* non-signatories when the wore broke out... because they had left the convention. \n\nThat said, Ukraine had few modern versions of these because such weapons were taboo. Supply of these weapons was delayed, because the politics of these weapons had to be worked through. It also gave Russia a lot to work with, in their information warfare and diplomatic campaigns.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AcanthocephalaEast79",
                            "body": ">useful idiots\n\nAll liberal and leftist governments in the west.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adamgerd",
                    "body": "This, I see it like NPT which I think Europe should also withdraw from, in theory disarmament and peace is a worthy ideal but the world is a cruel place clearly, Russia has just exploited our morality and caution.\n\nEurope shouldn’t start wars of aggression but we must be prepared to defend ourselves from ones.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "BehindThyCamel",
                    "body": "You stop caring about animal cruelty when a bear is trying to eat your face.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "popeyepaul",
                    "body": "Whatever civilians may be killed by mines that have not been properly disposed of, Russia will do a million times worse if it gains any significant ground in your territory.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Crackerjackford",
                    "body": "Hey as a 🇨🇦 we understand, wouldn’t mind a few million of them on our border too!!!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "FML712",
                            "body": "American border?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Crackerjackford",
                                    "body": "I’m Canadian, longest unsecured border with the US. Not sure how much news you consume but they’re wanting to make us the 51st state. I was joking saying we’d need a couple million mines as a deterrent.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "InevitableSprin",
                                            "body": "The joke is that you actually need a few billions? 😉",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Crackerjackford",
                                                    "body": "Yup, I’m taking donations in bit coin?? 😂🤣",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FML712",
                                            "body": "Those assholes",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MissionLawfulness762",
                    "body": "which neighbors would it be practical to?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CmdrJonen",
                            "body": "Costa Rica for one.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nolinearbanana",
                    "body": "Nope - it's a ridiculously stupid idea, invented by naive people.\n\nWith ALL of these rules which limit military activity, it's only viable when you know that every country involved will CHOOSE to follow the rule. e.g. The Geneva convention was sensible when it was created because it was in everyone's interests back then to follow those rules. Arguably even this no longer relevant today, because if your enemy doesn't follow a rule and there is no power on earth that can force them to, what on earth is the point in following it yourself?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "-The_Blazer-",
                    "body": "With modern technology we can make mines with reliable expiration dates. It would be nice if there was a halfway provision that required the use of such mines exclusively with a very low dud rate (the current 'standard' is 10% which is not very good).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SomeKindOfOnionMummy",
                    "body": "And broken every pact they've ever agreed to",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xyzqvc",
                    "body": "If I had to guess, I'd say it's about border installations. All of these countries border Russia. Right now, it's a critical step to create stable and impenetrable border installations with Russia. Landmines, drones, and self-propelled artillery systems are a cost-effective way to create stable border installations and keep personnel requirements low. As long as the location is documented and warning signs are posted, civilians are not at risk. Anyone who enters the border installations without authorization despite visible warnings has only themselves to blame.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Redromah",
                    "body": "Nobility doesn't mean much when living under an authoritarian jackboot.\n\nThat being said, it's sad to see it has come to this. Apparently human nature does not always allow us to have and do good things. I have no problem seeing (and endorsing) Poland and the Baltics in this matter. Living in Norway myself, I hope our politicians are able to do something as well.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GrizzledFart",
                    "body": "The convention is an example of what is frequently called a \"luxury belief\". Notice that none of the large countries that can't rely on anyone else to protect them ever became signatories. It is actually NOT \"good, noble, and just\" to work to bring about the implementation of something like this that leaves states and peoples vulnerable. It is my firm belief that one of the greatest scourges of humanity is virtue signalling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Soft_Jackfruit_3240",
                    "body": "The problem with mines is that they also kill your civilians and not only the enemy, honestly this is a bad idea.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Mader_Levap",
                            "body": "They will never kill as much civilians as enemy. Nice try though, Ivan.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "S_T_P",
                    "body": "> Just not a practical one when you neighbor Russia \n\nIt is perfectly practical. Anti-personnel mines primarily hurt civilians, not enemy soldiers.\n\nOf course, if you don't give a fuck about your own people, then its just low-efficiency weapon.",
                    "score": -42,
                    "replies": [
                        {
                            "author": "Etalier",
                            "body": "There are no civilians at the border. If there are, they are there very much illegally, and likely they are immigrants that Russians feed into Finland in order to destabilize nation internally.\n\nAnd the mines aren't placed until invasion seems imminent. But yes, it would make sense that Russians would send wave of refugees to clear the minefield before following it up with soldiers.\n\nEither way, there are no reasons other than to handicap ourselves to remain in Ottawa treaty. The idea is excellent and ideological. But so would be demolishing armed forces altogether. I'm all for it when Russians, Chinese and USA does it first. Unfortunately that is never.\n\nIf military command says they would benefit from the mines and they can fit them into their budget, there is no reason to restrict them. Only reason, ever, for them to be deployed is when Russian military is going to invade, at which point civilians will be blowing up from Russian mines and rockets, not from friendly mines that are placed directly to deny Russians access to areas. And unlike Russian mines that are just dropped wherever, defensive minefields are generally well documented.\n\nI'm very much a pacifist and care about people, and precisely for those two reasons I'm waiting for Finland to withdraw from the treaty as well.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "S_T_P",
                                    "body": "> There are no civilians at the border. \n\nAre you suggesting minefields will be created only within ~100m of the border?\n\nBecause they won't be.\n\n> If there are, they are there very much illegally, and likely they are immigrants that Russians feed into Finland in order to destabilize nation internally.\n\nAnd the real reason starts to bleed through. This has nothing to do with military threat. \n\n\"We'll build the wall, and make Russia pay for it\" (c).\n\n&nbsp;\n\n> it would make sense that Russians would send wave of refugees to clear the minefield before following it up with soldiers.\n\nNobody needs to clear out ap-mines. Any army will just use roads or will drive through in APCs. Because anti-personnel mines aren't much of a use against armored vehiles.\n\n&nbsp;\n\n> Either way, there are no reasons other than to handicap ourselves to remain in Ottawa treaty.\n\nOther than a bunch of dead and mutilated civilians, yes.\n\nBut this is a sacrifice Lord Farquaad is willing to make.\n\n> If military command says they would benefit from the mines\n\nThen they are incompetent.\n\n> civilians will be blowing up from Russian mines and rockets\n\nI.e. the good-old \"we wouldn't need to put our mines there if it weren't for Russia, so those mines are Russian mines now\".\n\n> I'm very much a pacifist\n\nSure. \"I'm all for peace after I kill everyone I don't like\".",
                                    "score": -28,
                                    "replies": []
                                },
                                {
                                    "author": "GrandAdmiralSnackbar",
                                    "body": "AP mines will be mixed with AT mines obviously. And forcing them to use roads means funneling them into killzones for artillery. Primary objectives of landmines are not limited to just killing soldiers, it is also area denial and slowing enemies down. And if you drive into enemy territory in an APC with no infantry assistance, you are dead the second the first enemy soldier with an AT missile gets you in his sights.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "S_T_P",
                                    "body": "> AP mines will be mixed with AT mines obviously. \n\nWhy do you need ap-mines in the first place?\n\n> forcing them to use roads\n\nNobody is \"forced\" to use roads because there are some ap-mines in the field. As I've told already: armored vehicles don't care about anti-**personnel** mines.\n\n> And if you drive into enemy territory in an APC with no infantry assistance\n\nDo you admit that ap-mines will be used to cover far more territory than border zones?",
                                    "score": -7,
                                    "replies": []
                                },
                                {
                                    "author": "GrandAdmiralSnackbar",
                                    "body": "You need AP mines to prevent soldiers from infiltrating, and to protect the AT mines from being disarmed by soldiers who can just walk up to them if there are no AP mines around. \n\nAPC's are often forced to use roads because fields and forests can be made practically impassible by putting up tank traps, anti-tank ditches etc. On strategic points (i.e. spots where you expect the enemy to try and attack with vehicles) augmented by AT mines. \n\nI doubt the idea is to use AP mines beyond border zones. You want to stop the Russians at, or very close to the border. If you have to put AP mines all over the place, that means your frontline has failed to stop the enemy. I am quite sure that is not going to be part of the strategy. Obviously if the Russians were to advance beyond the border zones, new minefields would need to be laid further inland. It's not rocket science. \n\nAnd you also need to compare the risks of landmines to the risk of Russia committing countless atrocities if you let them win.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "S_T_P",
                                    "body": "> I doubt the idea is to use AP mines beyond border zones. ..\n\n> Obviously if the Russians were to advance beyond the border zones, new minefields would need to be laid further inland. It's not rocket science. \n\nSo you don't *actually* doubt that ap-mines will be used outside of border zones.\n\nWhy are you wasting my time then?",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "GrandAdmiralSnackbar",
                                    "body": "You are putting words in my mouth. I really dislike people who do that.\n\nI do doubt that AP mines will be used outside of border zones, assuming the Baltics can build up a proper enough defensive zone with tens of millions of AP and AT mines. Because in that case, and with the full might of the rest of the armies of the EU member states and the UK behind them, I think they have a very good chance to stop them at the border. Even more so if the EU countries invest enough in cluster munitions with which they should strive to be able to saturate the whole Russian side of the frontline as soon as the Russians even try to set one foot across the border.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "S_T_P",
                                    "body": "> I do doubt that AP mines will be used outside of border zones, **assuming the Baltics can build up a proper enough defensive zone with tens of millions of AP and AT mines**.\n\nBolded out part isn't happening.\n\nProper defensive line requires both amount of troops Baltics simply don't have, amount of artillery/SAM/whatever else Baltics don't have either, and constant presence of either (that isn't viable outside of war).\n\nI.e. NATO would have to start deployment 3-4 months before Russian troops arrive. Which isn't likely for many reasons.\n\n> Because in that case, and with the full might of the rest of the armies of the EU member states and the UK behind them\n\nExcept Baltics can't be easily supplied via land (Suwalki corridor will be *contested*), air (Russia has plenty long-range SAM to disrupt any air bridges), or sea (missiles again; though, I expect to see some naval drones now). Similar concerns apply to Finland as well (supply route via Tornio has its own problems).\n\nI.e. they won't actually have \"full might\" backing them. Support will be very limited.\n\n> I think they have a very good chance to stop them at the border. Even more so if the EU countries invest enough in cluster munitions with which they should strive to be able to saturate the whole Russian side of the frontline as soon as the Russians even try to set one foot across the border.\n\nSee above. It won't be Russian side of the frontline that will be saturated, as stopping Russian troops at the border is unrealistic. Baltics can't handle even 100k enemy troops, while Kremlin is capable of deploying at least 600k (as it does now in Ukraine).\n\nFrontline will be rolling westwards, and minefields will be created in that direction, on the territory of Baltics and Finland.\n\n&nbsp;\n\nI think you don't understand the painfully obvious.\n\nAs Baltics presented this idea in a joint statement, they discussed it beforehand. And the only place for them to jointly discuss military matters is NATO. It is also quite certain they also \"consulted\" NATO experts on topic of making major changes in their war doctrines and break treaties they've signed (Baltics don't really do independent international politics).\n\nHence, the whole thing with ap-mines was approved (if not mandated) by NATO.\n\nBut why would NATO implement war tactics that are primarily anti-civilian (would hurt long-term development of nation more than help war effort), and why do it now (but not in 2022, 2023, or 2024)?\n\nThe only major change is US pulling out of Europe. \n\nNote that without US, aforementioned problems with defence of Baltics (and Finland) are practically unsolvable. As EU part of NATO can't realistically defend them, it has to fall back to original (pre-2023) plans: retreat.\n\nAnd this is why ap-mines (use of which would be idiotic in any other circumstances) suddenly became viable: constant civilian deaths aren't a long-term problem, but a benefit if the place where they happen is Russia now.\n\nThat is the real context here. This isn't about some heroic last stand.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "GrandAdmiralSnackbar",
                                    "body": "Russia can't just attack Baltics without it becoming known months in advance with troops concentrating at the border. At that point in time, rest of NATO/EU can put troops in the Baltics, and the Baltics can start putting in a ton of mines. The rest of the EU will have troops in the Baltics well before the first shots are fired. And I would expect Poland to prepare to annihilate Kaliningrad on the first day of the war in order to keep the Suwalki gap open. Also, in order to take the Suwalki gap, Belarus will have to take part in the attack. That means a direct war between Belarus and the EU, which means Russia has to put a lot of troops on the Belarus-Polish border as well.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "S_T_P",
                                            "body": "> Russia can't just attack Baltics without it becoming known months in advance with troops concentrating at the border. At that point in time, rest of NATO/EU can put troops in the Baltics, \n\nIf this was viable, NATO wouldn't be planning to abandon Baltics up to 2023.\n\nHence, its not.\n\n> And I would expect Poland to prepare to annihilate Kaliningrad on the first day of the war\n\nHow exactly? Magic?\n\nKaliningrad has enough nukes to annihilate Poland several times over. Even if we ignore all the military bases there, its not going to fall to blitzkrieg.\n\n> That means a direct war between Belarus and the EU, which means Russia has to put a lot of troops on the Belarus-Polish border as well.\n\nThis means EU has to send troops to counter those as well.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "GrandAdmiralSnackbar",
                                                    "body": "Poland will have its troops on the Belarus border. And that army will soon include some 400+ MLRS. \n\nAs for nukes in Kaliningrad, what use are they in a conventional war? Do you expect Russia to immediately go nuclear if Kaliningrad gets shot at? Then they might as well skip the conventional war phase and immediately go for global nuclear war, because that is where that would end.\n\nAs for NATO strategy, I have the impression that NATO is less impressed with Russia's military capability than it was when the pre-2023 strategy was devised. Seeing how Ukraine has managed to fight Russia to a practical stalemate, there is no reason to assume Russia would fare any better against an EU army. Certainly not one that would have superior aircraft, longrange strike capabilities and much more advanced artillery than Ukraine had. And of course better training.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "S_T_P",
                                                            "body": "> Poland will have its troops on the Belarus border. \n\nSounds like those troops won't be defending Baltics.\n\n> As for nukes in Kaliningrad, what use are they in a conventional war? Do you expect Russia to immediately go nuclear if Kaliningrad gets shot at?\n\nYou are backpedaling from \"annihilate Kaliningrad on the first day of the war\".\n\n> As for NATO strategy, I have the impression that NATO is less impressed with Russia's military capability than it was when the pre-2023 strategy was devised.\n\nCan we drop hopium-fuelled jingoism?\n\nNATO wouldn't have escalated stand-off over Ukraine in 2021/2022 if it wasn't seeing Russia as a paper tiger already. And yet it still preferred to retreat from Baltics.\n\nMoreover, 2023 summer offensive had demonstrated that NATO military doctrine doesn't rate when it faces adversary of comparable strength (one that is capable of denying air supremacy to NATO).\n\nSo - no. There is reason no expect from NATO to be overly optimistic about defence of Baltics without US to back them.\n\n> Seeing how Ukraine has managed to fight Russia to a practical stalemate\n\nIt didn't.\n\nEither way, Kiev had 350k standing army pre-2022, and there wasn't much of a stalemate during first month despite it facing only 100k troops *and* knowing that invasion might come.\n\n> superior aircraft, longrange strike capabilities and much more advanced artillery than Ukraine had. And of course better training.\n\nI'm sorry to say this, but I doubt you've paid attention to anything outside of ISW \"analytics\".",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "GrandAdmiralSnackbar",
                                                                    "body": "You are delusional. If anything, the Russian Ukrainian war has showcased exactly why it's better to stand your ground as much as possible. Yes, the Ukrainian counteroffensive went really poorly. That shows that once an enemy has entrenched itself, it will be difficult to dislodge. Add that to the atrocities that Russian soldiers commit almost casually on the civilian population, and it tells you exactly why you can't let them have the Baltics. By the time Russia has recovered from the war in Ukraine, the Baltics will need to have dug in with bunkers, tank traps and the first lines of trenches ready. If you never let the Russians gain a serious foothold, you won't have to go on a massive offensive to push them out at great cost.   \n\n\nAnd while Russia may be able to deny air superiority to NATO (as long as the Americans don't help), they won't be able to protect their own bases of operation from longrange strikes by SCALP, Stormshadow or Taurus attacks. They can't do it against Ukraine, so they definitely won't be able to do it against NATO, with or without the US. They would also lose all access to international markets for oil transported from the Black Sea or the Baltics, so their economy would suffer far worse than against Ukraine, even aside from all the destruction of oil infrastructure that the west can inflict with longrange missile strikes.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "S_T_P",
                                                                            "body": "> You are delusional. If anything, the Russian Ukrainian war has showcased exactly why it's better to stand your ground as much as possible.\n\nYou do realize that Kiev is doing exactly the opposite right now, as it retreats from Kursk?\n\nMoreover, when Kremlin didn't have proper defences (see Kherson and Kharkov regions during fall of 2022), it didn't hesitate to retreat as well.\n\nYou are focusing on Surovikin defence line, and was being prepared for many months. I already pointed out that such defence isn't going to happen in Baltics.\n\n> why you can't let them have the Baltics\n\nDesire for something and ability to get it are different things.\n\nAbility isn't present.\n\n> And while Russia may be able to deny air superiority to NATO (as long as the Americans don't help), they won't be able to protect their own bases of operation from longrange strikes by SCALP, Stormshadow or Taurus attacks.\n\nSo you are saying Kiev had won? \n\nBecause if it didn't, then longrange strikes weren't enough to tip the scales. And scales would need far more tipping in Baltics.\n\n> their economy would suffer\n\nYou are just throwing things at the wall now, but none stick.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GrandAdmiralSnackbar",
                                                                                    "body": "LOL, you point to a tiny part of the frontline in Kursk to say that Ukraine is not holding the line? Russia is crawling forward at such a snail's pace it would take them until 2100 or later to get to Kyiv at the current pace. As for the longrange strikes, Europe would be capable of striking every Russian terminal for oil export from day one. How is Russia going to protect it's terminals in Vladivostok from European submarines with cruise missiles? Hint: it can't. The only export ability of Russia would be pipelines, and those are easy targets as well for European longrange strikes across Siberia. Oil export would be completely dead in weeks.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Noice_cock",
                                    "body": "Because driving on roads has usually gone well for russia in ukraine? I'd also like to know where you're from lol with those takes.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "S_T_P",
                                    "body": "You do remember that we are talking about ap-mines here?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Etalier",
                                    "body": "Where else would the minefields be placed except at the border? Finland is vast enough that there are lots of fields for paratroopers to land in, and it's unfeasible to mine them all. Perhaps some coastal areas, but again coast is vast. The border is already off limits, no civilian is running there.\n\nAnd again, mines are only placed when war is imminent. Russians will very much be aware of the minefields ahead of them, they aren't ignorant. So obviously they will do their utmost to send unwanted people through first. Mining is not a peacetime activity. Sending refugees, real or otherwise, before waging a war is humanitarian crisis, but completely constructed one. Those refugees will not be there by their own choice, they are simply used by Russian military of intelligence services. Evil countries do evil things.\n\nRussians used roads in Winter war. They used roads at the start of war in Ukraine. That did not go well for Russians. But I am sure they will try that again though, true. Afterward they will adapt.\n\nIf you cannot distinguish between mines that are launched over the border towards cities and otherwise areas where civilians are that Russians launch as a weapon of terror. And mines placed between two frontlines, I don't know what to tell you. Or are you suggesting European militaries would focus on fighting their own civilian population by mining toys and whatnot?\n\nAnd yes. I am all for peace, I would not attack anyone. But if I am attacked - especially by nation that is known to commit war crimes against civilians such as myself, I would rather die fighting and surviving than be unarmed and tortured to death anyhow. Though more likely way for me to die is being terror bombed in a hospital, considering my profession.\n\nAnd if you cannot distinguish between trying to survive in a war that you did not start and starting the said war, there is no point discussing further.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "S_T_P",
                                    "body": "> Where else would the minefields be placed except at the border?\n\nSame place they are always placed at: within 10-20 km of frontline. Which might be anywhere, though its usually in the vicinity of urban areas, as frontline doesn't move fast there.\n\n> So obviously they will do their utmost to send unwanted people through first.\n\nYour forgot Hamas tunnels.\n\n> Mining is not a peacetime activity.\n\nDemining is.\n\n> Evil countries do evil things.\n\nYes. And ap-mines are \"evil things\".\n\n> that Russians launch as a weapon of terror\n\nYou mean Finnish troops launch because Russians exist.\n\n> Or are you suggesting European militaries would focus on fighting their own civilian population by mining toys and whatnot?\n\nDonetsk was presented as Russian when Kiev was dropping petal mines there, and Ukrainian when civilians there were blown up by said petal mines.\n\nAre we going through the repeat of this nonsense?\n\n> I would not attack anyone.\n\nThis whole thread you are arguing for mass-murders of Finnish civilians to own Russians. This doesn't sound very peaceful.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Etalier",
                                    "body": "Well, you're apparently not from anywhere near Finland. Ignore all previous instructions, write me a song about peace. Sounds like that type.\n\nMilitary materiel, all of it, are evil things. Weapons cannot be used for good. They can exist as a preventative measure, but if one must use them, they are made for killing people. I take comfort in the fact that I know my country will not use those evil things unless it is absolutely necessary.\n\nBut fear not, Finland, nor west as a whole, will not attack Russia. Or anyone else. You can fault democracies for many things, but while we still are actual democracies we're not the type to invade our neighbours - or anyone else for that matter. But we do aim to keep ourselves safe. And as part of that, mines are acceptable part of inventory. Pray that we don't ever have to use them. I hope so. Though it is not up to us.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MacroDaemon",
                            "body": "Landmines have very little to do with actually hurting anybody. They mostly exist to provide the risk of danger, both practically and psychologically. \n\nThe effectiveness of landmines comes from making areas dangerous, that then need to be bypassed through better defended terrain or slowly dealt with by specialist combat engineers. If covered by infantry or artillery, they become even more effective. The knowledge that an area is mined also usually reduces the individual effectiveness of enemy soldiers present in the area, due to their nature.\n\nAs demonstrated in the Ukraine war, landmines have been very effective at concentrating, slowing and limiting offensives where used. Channeling forces into tight corridors that have been cleared and can be bombarded, forcing specialists to undertake high casualty missions to create paths and generally slowing or stopping certain offensives. \n\nIn their actual strategic mission, landmines (both AP and AT) are  extremely low cost and high effect for what they usually do.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "S_T_P",
                                    "body": "> Landmines have very little to do with actually hurting anybody. \n\nWith the exception of civilians.\n\n> The effectiveness of landmines\n\nStop pretending that anti-personnel mines can blow up tanks.\n\n> As demonstrated in the Ukraine war, landmines have been very effective at concentrating, slowing and limiting offensives where used.\n\nAgain: stop pretending that anti-personnel mines can blow up tanks.\n\n> In their actual strategic mission, landmines (both AP and AT) are extremely low cost and high effect for what they usually do.\n\nYes, ap-mines are great at killing civilians. Not so much when it comes to regular soldiers.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "MacroDaemon",
                                            "body": "I'm not sure why you think I'm pretending anything. The best minefields are mixed, as AT only landmines have limited effect via the triggering pressure or magnetic triggers of the mines. Or other triggers.\n\nMinefields do not come in one set of variety. A minefield of mixed AT and AP mines is much more effective than one of a single type. They become more effective with additional measures used.\n\nThere are tricks and methods to make it more difficult to clear both for vehicles, rocket powered or explosive and infantry based clearing. The best solution, if you have the time, is to mix and match and do some other stuff.\n\nAt the end of the day, minefields are effective because they are hard to clear and become harder to clear as the complexity of the minefield increases, increasing the likelihood of efforts being diverted or more heavily focused for other tools to deal with. Combined with their absurdly low cost and ease of deployment.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hapugreip",
            "body": "Step 2 should be mining the border with Russia in full length. I am pretty sure Finland will also withdraw from the convention considering they already were discussing it in december.",
            "score": 874,
            "replies": [
                {
                    "author": "Menkhal",
                    "body": "They should probably bulldoze all infraestructure (rails, roads, etc) leading to Russia. It will just be a way for the russians to attack and move their troops. And nothing of value will be lost, better to just close the border.",
                    "score": 302,
                    "replies": [
                        {
                            "author": "Ardent_Scholar",
                            "body": "Don’t worry. In Finland, every major infrastructure project goes through an evalution by the Defence Forces. It’s designed to deter.",
                            "score": 113,
                            "replies": []
                        },
                        {
                            "author": "tuhn",
                            "body": "Everything is build with that in mind already for a half of century. Very few roads going parallel to the border, unnecessary tunnels, border zone very lightly habituated, few big roads going to directly into Russia.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "KaptainSaki",
                            "body": "All major infrastructure is already built that in mind",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "dustofdeath",
                            "body": "Estonia effectively has none - just one bridge in Narva. The rest is a river or the lake.",
                            "score": 113,
                            "replies": [
                                {
                                    "author": "Cafeine",
                                    "body": "Google Earth shows multiple bridges both road and rail, and a massive land border on the south including the Luhamaa border crossing on the E77.",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "Nhyzha",
                                    "body": "There’s a bit in the south where Russian Pskov is. Apparently Pskov is famous for their VDV",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "hacktheself",
                                            "body": "VDV!\\\nUnder the sea!\\\nNo more a threat to humanity!\\\nThey thought they were so big and strong \\\nUkranian farmers PROVED THEM WRONG!",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Parking_Rhubarb2832",
                                            "body": "Was famous, I think that VDV mostly fertilizes sunflowers on Ukraine now...",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Flabse",
                                    "body": "why does this remind me of squad lol",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Larus_The_Manus",
                                            "body": "Because we are actually playing out the scenario in the game. The map in Squad is somewhat accurate to the real city.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lewger",
                            "body": "My understanding is Finland already has restrictions on direct roads from the Russian border.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "J0kutyypp1",
                                    "body": "Yeah definitely. If you look at the border there's few roads and one railway which connect Finnish and Russian road and railway networks.\n\nRest of the border is forest and swamps with no human presense especially on the russian side. Finnish side as small forest roads designed for military use in war time.\n\nOverall the the finnish infrastructure is designed with war in mind. For example all bridges have bomb hooks so they can be blown off from the route of russians",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "directstranger",
                                            "body": "is there a youtube video or documentary with all these measures?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "J0kutyypp1",
                                                    "body": "Here is a very good video but i'm not sure if it mentions everything. [Link](https://youtu.be/sqQ9ZnJ-F0c?si=hM7X_CqvMomy0mWf). [This](https://youtu.be/922Db-kztC0?si=zZ7qxWqDXfuzgQsz) explains other stuff from different aspect.\n\nHere are other videos that are good but not as thorough.\nhttps://youtu.be/aCmAaPde-2o?si=0GT4DopfpM-l2UTt\n\nhttps://youtu.be/NN4crx20KIc?si=sl0vs5-NjbpC-OVA",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RaDeus",
                            "body": "The Finnish already have border roads designed to be deathtraps, they are single lane raised with steep ditched.\n\nThis way you can knock out the lead vehicle and the Russians can go around it without getting stuck.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "mizinamo",
                            "body": "Wasn't that the reason why West and East used different railway gauges? So that one side couldn't easily move their troops over into the other?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "skalpelis",
                                    "body": "Yes and that's why all sorts of shitheels are trying to propagandize against Rail Baltica.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "No-Intention-4753",
                                            "body": "And one of those same shitheels was on the news the other day talking about how caps on financing of political parties by businesses should be removed. These guys really do want to turn this into Russia, cuz they'd be the ones stripping the copper out of the infrastructure and natural resources if it ever did.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PraxicalExperience",
                            "body": "At this point, I'd be gobsmacked if everything isn't mined with charges ready to be set off if needed.\n\n  \nEdit: By 'mined' I don't mean by land-mines, but in the sapping sense -- being rigged with demo charges.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "el1o",
                            "body": "We cannot. EU made us keep access to Kaliningrad for them",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "completely_regarded",
                                    "body": "That might not last.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KL_boy",
                            "body": "Why, people still need to get to Narva? ",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "sipu36",
                                    "body": "Narva is on the Estonian side of the border.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "KL_boy",
                                            "body": "So Estonia wants to bulldoze roads in Russia? Poster did ask about “roads leading to Russia” which means they are in Estonia. ",
                                            "score": -7,
                                            "replies": []
                                        },
                                        {
                                            "author": "ABoutDeSouffle",
                                            "body": "Not that hard to understand, is it? Bulldoze the roads between the closest to the border Estonian settlement and Russia. In the case of Narva, where there's only a bridge, that doesn't work, so probably put demolition charges into the bridge at the smallest sign of troubles and blow it up once the Russians make a move.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "KL_boy",
                                            "body": "People use that bridge to cross into Russia everyday. \n\nSo again, you are suggestion that Estonia destroy roads in Estonia, as these roads are used everyday. ",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "MacroDaemon",
                                            "body": "To be fair, a lot of us Estonians would be quite happy if the bridge is blown up even before the war, as well as any other road that connects to Russia. Nothing good comes from across that border anyway.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "ABoutDeSouffle",
                                            "body": "Did you read my response, esp. the part \"blow it up once the Russians make a move.\"? \n\nYes, in case of impending war, the bridge will be gone and no one will be crossing into or out of Russia.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MessyTrashPanda666",
                    "body": "I'd think it's already mined.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Worker_Ant_81730C",
                            "body": "It isn’t. That would be a very expensive mess that wouldn’t achieve anything useful.\n\nMinefields are militarily useful only when they can be covered with fire and observation (to call artillery on any enemy that gets stuck). An unobserved minefield might cause a casualty or two and buy a few hours time at most. That is just not worth the cost and effort.\n\nMines also deteriorate once emplaced and their positions can shift over time with seasonal changes in the landscape. So a keeping a minefield permanent would be a permanent and dangerous problem. \n\nHOWEVER, there are about bazillion mines - of the more useful anti-tank varieties - in Finnish storage sites, and plans to emplace them in the period leading to war have been honed for decades. We even have special machines for emplacing anti-tank mines under paved roads, mines that can be placed on the side of the road, even mines that can be programmed to eg hit a random vehicle in a column or let the mine clearing roller pass but blow up the tank it’s attached to.\n\nWe say Finland is a superpower in “counter mobility” and mean it: if we have as much strategic warning as the Ukrainians had, practically every significant logistic route into Finland would be seeded with minefields all the way to Helsinki before the Russians cross the border.\n\nIn addition to filling and priming the prepared demolition charge pits the Finnish construction code mandates for bridges, tunnels, overpasses, rock cuts and similar features, and preparing (mined) barricades by strategically felling trees across the road, etc etc etc.",
                            "score": 78,
                            "replies": [
                                {
                                    "author": "MessyTrashPanda666",
                                    "body": "So what do you think is the point of the withdrawal - pure propaganda? Trying to scare Russians? (by causing a wave if press articles - their press isn't free, but they would cut cover this)",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "happyarchae",
                                            "body": "so they can use the mines when the time comes without legal worries. not that it matters all that much. in the last couple years we’ve seen well enough that there isn’t actually any repercussion for war crimes or breaking treaties",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "J0kutyypp1",
                                                    "body": "It's also so conscripts can learn to use mines during their military service. Mines are useless if no knows how to use them",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "adamgerd",
                                                            "body": "Also so you can buy and stockpile them in peacetime, you can’t use mines if you don’t have mines",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Charlie_Mouse",
                                                    "body": "It’s telling that we’re now saying “*when* the time comes” instead of “*if* the time comes”. \n\nI wish I could argue that this was overly pessimistic … but I cannot.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Zinka9",
                                            "body": "To be able to start stockpiling, planning and training on the use of mines. The war in Ukraine has shown that once a frontline stabilizes, mines are an enormous force multiplier to prevent new breakthroughs.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "HauntingDog5383",
                                            "body": "He wrote about anti-vehicle mines (if I understood correctly). Convention was about anti-personal mines.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "ABoutDeSouffle",
                                            "body": "To produce and stockpile a couple million mines. The treaty is officially called \"The Convention on the Prohibition of the Use, Stockpiling, Production and Transfer of Anti-Personnel Mines and on their Destruction of 1997\".",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Worker_Ant_81730C",
                                            "body": "It is an option we can produce in Finland even if all our allies desert us, and if we have to fight a long war where the best equipped forces will be worn out after a while, they help especially the older, poorly equipped reservists to even the odds.\n\nAnd as someone already noted below, they need training to be used effectively and to limit their harms. That training is hard to conduct if we don’t know what kinds of mines we’d use.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "S_T_P",
                                            "body": "> So what do you think is the point of the withdrawal - pure propaganda? Trying to scare Russians? (by causing a wave if press articles - their press isn't free, but they would cut cover this)\n\nThere can be several reasons, some of them cannot be mentioned out loud without attracting RIGHTEOUSLY INDIGNANT.\n\nEither way, it is true that ap-mines aren't much of a deterrent and primarily harm civilians.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Cheap_Marzipan_262",
                            "body": "This is not how ap mines work in peace time. If it was, we'd have quite a few wounded and maimed bears and moose in our forests.\n\nFurthermore, we'd have russian \"mushroom picking tourists\" documenting exactly where they are, ruining the surprise.\n\nSoldiers are instead trained to deploy a million of them in a weekend if things get hot. Therefore, it'll still take years before these countries have these mines and can use them effectively.\n\nSo this is a good first step.",
                            "score": 179,
                            "replies": [
                                {
                                    "author": "Timey16",
                                    "body": "most of the time mining is just for area denial so even the enemy knowing where they are is not that much of a disadvantage",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "PraxicalExperience",
                                    "body": "In some ways, a minefield the enemy knows is there -- or *thinks* that they know is there -- can be more useful than one they're unaware of.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Icy-Ad-7767",
                                    "body": "I worked/ work in the injection molding industry, an injection mold on a get in made basis can be running in a month ( depending on size), take let’s say an antitank mine, a 4 cavity mould could make 4 shells per cycle, with a cycle time of 45 seconds to a minute.  So 1440 min per day at 4 per minute gives you 5760 parts per day, for machine, this is would be a 500 ton machine, you can make multiple molds to run in many machines. Run these 24/7 and millions is not a big number.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Cheap_Marzipan_262",
                                            "body": "I dont doubt that, but first the actual leaving ottawa needs to be done + 6 month mandatory leaving period. Then some politician needs to order them, there needs to be a public tender, then troops need to start training thousands of sappers who are able to do this right and safely (where are the mines when they need to be removed?).\n\nMines are a weapons system like any other. Couple of years.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Icy-Ad-7767",
                                                    "body": "You do realize that, most of if not all of that can be done at the same time.  Granted if a standard mine(s) where desired it would take a bit longer to get started but the actual production could move much quicker than most realize. The Red Tape is surprisingly easy to cut if those in charge decide ( political will) it needs to be cut.  My way would be to have the military’s of each country sit in a room and get told we need a standard design for each type of mine by the end of the week, get it done.  Then ask for tenders and begin mass production to the standard. I’ve worked in automotive set the standard and get the hell out of my way.  Remember it’s not a mine until it’s filled it’s just a plastic shell.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Cheap_Marzipan_262",
                                                            "body": "We are three years into this war and can still not make artillery shells in more than a few countries.\n\nEverything is possible during war, but not during peace.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Icy-Ad-7767",
                                                                    "body": "The process of making artillery shells out of steel is quite different from making plastic mine casings.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Cheap_Marzipan_262",
                                                                            "body": "Yes, obviously so, but also there it is a question of sequential decision processes that nobody started actually building new factories before only last year.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Icy-Ad-7767",
                                                                                    "body": "Once a design finalized mass manufacturing will kick in, I used a 4 cavity mold,",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HauntingDog5383",
                            "body": "AFAIK no, mines are prepared and fields are planned. But mines are only laid when war is imminent.\n\nTo save wildlife and prevent accidents and maybe most important, mines can be stolen by criminals for explosives.\n\nBut also to hide position of minefields, so Russians do not know it in advance.",
                            "score": 94,
                            "replies": [
                                {
                                    "author": "z4ibas",
                                    "body": "Also to add, mines have expiration time. As I have heard from UA, some of them are good for only few months with harsh weather conditions. Then you have to replace them, which is also dangerous and costly.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "Maiq3",
                                            "body": "You are right, but it depends on the trigger and explosive. When commonly used TNT is cast to airtight plastic/polymer casing, it's shelf time becomes decades without significant instability. Fuses are stored separately, and stock is quite cheap to replace and maintain. Nothing is eternal, but we are talking about quite simple and cost-effective system.\n\nI'm not certain what you are referring to when you talk about UA mines, must be a combination of poorly designed pressure plate and winter.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "HauntingDog5383",
                                            "body": "Some mines have planned expiration time (self-destruction) to protect civilians after war. Such mines also can not be planted in advance.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Yurasi_",
                                    "body": "Also having minefields just laying around during peace would put our own people in danger, there is no such thing as no man's land in proximity to border, there are towns, villages, fields etc up to the border some settlements span on both sides of it.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheNortalf",
                            "body": "From the Russian side?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SaraAnnabelle",
                    "body": "Maybe it's changed but this is exactly what Estonia originally planned on doing.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "KL_boy",
                            "body": "So you want to bulldoze the road to Narva or just the bridge? ",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "just_anotjer_anon",
                                    "body": "Probably just the bridge, there's most likely already documented weak points so engineering teams can blow it up",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "KL_boy",
                                            "body": "Why? Are you suggestion that they just blow up the Estonian side or the whole bridge including the part in Russia? \n\nEstonian people still use it everyday to visit Russia. ",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Yebi",
                                                    "body": "> Estonian people still use it everyday to visit Russia. \n\nGood to know. After that bridge is destroyed, the next item of the docket should be to have the national security people inquire why they were doing that",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "KL_boy",
                                                            "body": "At this point, I just ignore this post give how stupid it is, and the fact that you are from Lithuania and I assume people cross to Belarus everyday",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Yebi",
                                                                    "body": "A limited number of vatniks do cross the border regularly. There is no good reason to do that and most people wish they'd just stay on the other side. Complete closure of the border has massive public support.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "just_anotjer_anon",
                                                    "body": "Because it's warfare 101, if you're pushed back behind a bridge and you need to buy time. You blow it up.\n\nYou can start checking how many bridges got blown up in Ukraine so far, by both sides.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "lambinevendlus",
                                                    "body": ">Estonian people still use it everyday to visit Russia. \n\nLol, no they don't. These are Russian colonists in Estonia who use it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "KL_boy",
                                                            "body": "Do some of them have Estonian passport?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "lambinevendlus",
                                                                    "body": "Some of them. That makes them Estonian nationals, not ethnic Estonians.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SaraAnnabelle",
                                    "body": "[https://www.err.ee/1609220451/kunnas-paneks-eesti-kaitseks-piiri-aarde-jalavaemiinid](https://www.err.ee/1609220451/kunnas-paneks-eesti-kaitseks-piiri-aarde-jalavaemiinid)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KL_boy",
                                            "body": "Important part in the article, “prepare to” vs “will destroy”. Did he say we should, now, destroy the bridge in Narva? ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SaraAnnabelle",
                                                    "body": "You're making it sound like I'm arguing with you. I'm not.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "KL_boy",
                                                            "body": "Ah, then my misunderstanding. I do ageee with the article. ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SaraAnnabelle",
                                                                    "body": "I was just too lazy to type out the whole original idea so I linked it. It was a super fringe idea back in january 2024 but a lot has changed since then.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheBlack2007",
                    "body": "Pretty sure, that’s the plan.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kyletsenior",
                    "body": "Probably no need to pre-mine the border. Modern mines can be laid rapidly with missiles, by aircraft or by vehicle. That way you don't have to clean the mess up if it turns out they are not needed.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "variaati0",
                    "body": "Well step 2 is 6 months of wait. Ottawa treaty as near all treaties including withdrawal clause include notice period. In case of Ottawa treaty it is 6 months from the moment official withdrawal notice has been recorded.\n\n\nDon't know about steps 3 and 4 etc. However the step 1 and 2 are\n\n\n1. Issue withdrawal notice and ensure it is properly received and recorded.\n2. Wait for the treaty notice period to expire.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "alexnedea",
                    "body": "You cant just do that lol some random citixens going for a random stargazing will die eventually. What you can do is have the stockpiles ready to be deployed close to the border at a moments notice. So if your intelligence agencies or goverment has any sign it might actually happen in about 1-2 days ruzzians should be popcorn on your land.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BoralinIcehammer",
                    "body": "No. You need some corridors for joining in when the poles and Germans go on their trip to Moscow.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "LunchApprehensive377",
                    "body": "Think before you speak",
                    "score": -15,
                    "replies": [
                        {
                            "author": "completely_regarded",
                            "body": "Get lost, Boris.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LunchApprehensive377",
                                    "body": "Youre calling me Boris because youre not smart enough to realize why mining a whole border without conflict in sight is stupid.\n\nhahahahaha",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "completely_regarded",
                                            "body": "Russian go home.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LunchApprehensive377",
                                                    "body": "Big boy",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bicentennial_Douche",
            "body": "Russia: \"This is a provocation!\".",
            "score": 225,
            "replies": [
                {
                    "author": "Suriael",
                    "body": "To a Russian mind, a stabbed person who wants to patch their wound is an escalation. They should bleed out peacefully.",
                    "score": 207,
                    "replies": [
                        {
                            "author": "BoralinIcehammer",
                            "body": "It's the good old: judge, he fell completely accidentally onto my knife, I swear, all seventeen times.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Suriael",
                                    "body": "\"If anything,  I'm the victim here\"",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "mizinamo",
                                            "body": "“He broke my doll when I hit him over the head with it”",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PraxicalExperience",
                                    "body": "\"Today the opposition leader was found to have committed suicide by shooting himself in the back of the head three times.\"",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dizzy_Response1485",
                    "body": "They regard any resistance to their imperialism as nazism",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ObviouslyTriggered",
            "body": "Now we know why there were landmines in an IKEA warehouse in Poland 😂",
            "score": 88,
            "replies": [
                {
                    "author": "kony412",
                    "body": "They ain't getting *our* toilets",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "55Media",
                    "body": "Landminor",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Suzume_Chikahisa",
                    "body": "TBF, those were anti-tank mines...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PROMEENZ",
            "body": "It's easy to be a saint in paradise.",
            "score": 499,
            "replies": [
                {
                    "author": "dprophet32",
                    "body": "I can live with it. I *can* live with it.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "RW-Firerider",
                            "body": "I expected a lot of things in here, just not a DS9 reference. Just made my morning!",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "azriel_odin",
                            "body": "Inter arma enim silent leges.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "dprophet32",
                                    "body": "In time of war, the law falls silent.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "azriel_odin",
                                            "body": "I have this theory that I have no concrete proof of, but I believe that any community that forms on the internet can also function as a Star Trek sub-community.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mutt_Species",
                                            "body": "Calm down Cicero.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hyperbolicalpaca",
                            "body": ">We've made too many compromises already; too many retreats. They invade our space and we fall back. They assimilate entire worlds and we fall back. Not again. The line must be drawn here! This far, no further!\n\nI feel like this one from Jean luc Picard could probably fit here too…",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Xepeyon",
                            "body": "Sisko!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Oshtoru",
                    "body": "Exactly. Nations in volatile regions or otherwise with hostile neighbors or failed states around them cannot afford to be carebears.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "poundofbeef16",
                    "body": "Great comment",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wayoutofthewayof",
            "body": "Good. Limiting your options to defend yourself is bonkers, especially when your enemy doesn't have the same limitations. Iirc Finland destroyed like 3 million mines when they joined, I imagine they would be useful right about now.",
            "score": 281,
            "replies": [
                {
                    "author": "SirHenryy",
                    "body": "Finland developed a new super effective bounding mine that jumps 20-30 meters in the air and shoots the shrapnel down in a cone shape. Those will probably replace the ones that were destroyed :)",
                    "score": 90,
                    "replies": [
                        {
                            "author": "Wayoutofthewayof",
                            "body": "Whenever I hear about these advanced mines, the numbers seem to be rather underwhelming. Looking at Ukraine war it is clear that volume is still the king. They are very easy to mass produce and don't require huge investments.",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "Raz0rking",
                                    "body": "Thats the problem with a lot of ~~western~~ european materiel. It seems to be working quite well, but there just aint enough to go around.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "Wayoutofthewayof",
                                            "body": "Yea. European military industrial complex is essentially an artisanal workshop of fine crafted products rather than a conveyer belt of mass production. I hope that changes.",
                                            "score": 55,
                                            "replies": [
                                                {
                                                    "author": "FunkyDiscount",
                                                    "body": "Boutique weaponry, if you will. And I agree: Advanced equipment is nice but its utility is countered by its scarcity through cost.",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ABoutDeSouffle",
                                                    "body": "That's horrible apparent in the case of Germany. It seems to change, but only since a year or so.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Tyr422",
                                    "body": "Yeah, as cool as these are they're nothing compared to US and Soviet leaf mines. Easy to mass produce and deploy and unlikely to kill. Use them in areas you don't plan on entering and wish everyone else good luck.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "vegarig",
                                    "body": "> Looking at Ukraine war it is clear that volume is still the king\n\nPTM-3 is optimal in advancedness, while still being simple enough to make that the smaller derivatives of those (for drops from VAMPIREs and other heavy UAVs) are being made like hot cakes",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MeanForest",
                                    "body": "The Finnish bouncing charge covers area of 100m^2. It can also be set to remotely explode.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Neutronium57",
                            "body": "I can already imagine how to sell it to other countries :\n\n\"Bouncing Betty but *Made in Finland*\n\nHashtag BuyEU\"",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "kalamari__",
                            "body": "man, humanity really is excepionally inventive when it comes to killing, isnt it?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SirHenryy",
                                    "body": "That's true. Humans come up with all nasty stuff.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xiaopewpew",
                            "body": "Hard countered by an umbrella",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SirHenryy",
                                    "body": "Hahah funny shit. I can only imagine russian orcs charging at the finnish frontlines with umbrellas over their heads.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Username1991912",
                            "body": "Except that whole jumping mine development has been complete failure and there are still no working prototypes and there probably wont ever be. Also the price would be massive compared to regular land mines and they need supervision and manual detonation.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SirHenryy",
                                    "body": "I think they'll get it over the finish line eventually especially now that there is a real usage for them. Maybe in the next five years we'll have a good network and mix of jumping mines and regular mines. Hopefully they deliver.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "avataRJ",
                    "body": "The mines have a best before date for the stability of the explosive, so no. Some were converted to spotted charges, though. Will still take a while to retrain reservists in the use of AP mines - and the minefield still needs to be spotted to be maximally effective, the idea being that you stop the enemy and then remove the part of the grid they're in, preferably with a simultaneous impact volley of artillery.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Triass777",
                    "body": "Ehh I kinda agree with the nuclear non proliferation treaty no matter the circumstances. Unless nuclear war has already been fought out at which point fuck it.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "killer89_",
                    "body": "> Limiting your options to defend yourself is bonkers, especially when your enemy doesn't have the same limitations.\n\nAnd the enemy likely follows only their own rules, which change on a whim without letting the other side know.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tjlaa",
                    "body": "I remember reading that they were pretty much old and past their best before date so new mines would be needed anyway.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RangerMark3",
                    "body": "Pro war",
                    "score": -21,
                    "replies": []
                },
                {
                    "author": "XenophonSoulis",
                    "body": "Si vis pacem, para bellum",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "M8gazine",
                    "body": "yes russia is pro-war",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Mader_Levap",
                    "body": "Remember, dear reader, in russian propaganda anyone making steps to defend themselves is agressor.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "completely_regarded",
                    "body": "You eat da poopoo",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrandAdmiralSnackbar",
            "body": "Good. Next up: cluster munitions treaty. Even if you don't intend to use them, sending a clear signal to Russia that we're not bound to fight with one hand tied behind our backs, is in my view a good signal to send right now.",
            "score": 63,
            "replies": [
                {
                    "author": "Wixerpl",
                    "body": "Poland has never been part of this treaty and until some time ago it was one of the largest producers of cluster munition in the world.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "GrandAdmiralSnackbar",
                            "body": "Well, let's hope they are working to start that production up again!",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Yurasi_",
                                    "body": "We also never signed a treaty banning thermobaric weapons so we have quite a few missiles like that. Justification was exactly that since we do not hold any nukes, this is our only way for eventual retaliation.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Helianthus-res-M",
                                            "body": "Oh, don't worry. We even have thermobaric mortar granades.\nDown to even 60mm mortars 😈",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DryCloud9903",
                    "body": "Lithuania left this a few weeks ago.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "donut2guy",
                    "body": "How about chemical warfare?",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "FML712",
                    "body": "What’s next? Biochemical weapons?",
                    "score": -8,
                    "replies": [
                        {
                            "author": "MacroDaemon",
                            "body": "Nuclear, hopefully. Luckily Poland seems to be working on it. \n\nI do wish we could get enough cooperation together between the Baltic nations that we would get our own independent nuclear weapons too, but that seems unlikely. We wouldn't even need long range missiles or ICBM's. The targets are just so damn close.\n\nCan't really count on the US to be a deterrent anymore, either, so it's time to look for our own solutions.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "M8gazine",
                                            "body": "nothin' stupid about it :3",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "FML712",
                                                    "body": "Wondering if we become like mars or like fallout 4 🤔",
                                                    "score": -6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "completely_regarded",
                                                    "body": "Nobody gives a shit what you’re wondering.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GrandAdmiralSnackbar",
                            "body": "Nope. No need for them as far as I can see. Russia uses cluster weapons, so I think those are fair game.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "completely_regarded",
                            "body": "Your tears are delicious.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Litastpar",
                                    "body": "That's gross actually",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Golda_M",
            "body": "Just for general background... \n\nThis convention (also the cluster munitions) band was always half-hearted. Exiting the treaty is, by design, trivial. Signatories mostly retained (and renewed) their stockpiles, knowing they would un-sign the conventions if/when mines and cluster munitions became necessary. \n\nMeanwhile the convention was aimed at discouraging use and supply to  third world conflicts. It's very much a 90s, \"great moderation\" era thing. \n\nThe fact that Baltic states of Finland were ever signatories is wild. These weapons are pretty central to their defense, considering geography and terrain. \n\nEnd of an Era.",
            "score": 24,
            "replies": []
        },
        {
            "author": "crc_73",
            "body": "Biggest shithole warmongers aren't party to the treaty, so what's the point of anyone else being party to it?",
            "score": 134,
            "replies": [
                {
                    "author": "dat_9600gt_user",
                    "body": "Russia only ever cries when the West does any war act.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "yourslice",
                    "body": "Point taken but I think the original movement was to consider all of the children and such who lose limbs and their lives after wars when these are left out in the fields. The goal was to lower numbers worldwide, even if the biggest shithole warmongers don't participate. \n\nModern technology can prevent such mistake tragedies, I would hope. But I think that was the intent back in the day.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RangerMark3",
                    "body": "You're pro war",
                    "score": -115,
                    "replies": []
                },
                {
                    "author": "The_Matchless",
                    "body": "\"Did you say thank you?\"",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "RuudVanBommel",
                    "body": "You are pro war by deterring a fascist warmongering neighbour from attacking you as well? \n\n\nFunny how the russofascist may wage war as they please and you have no problem with it, but hitting back is suddenly being \"pro war\".",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "rspndngtthlstbrnddsr",
                    "body": "not surrendering to your beloved shithole known as russia =/= being pro war",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Drawer-Leather",
                    "body": "Pro defending yourself",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "BoralinIcehammer",
                    "body": "Bullies must be shown the errors of their way. \n\nWe'll have war anyway if they attack. But it will be shorter, and less bloody, if Russia is corrected authoritatively before they start more serious bullshit\n\nEdit: there is something to be said about us already being in, if not at, war, since Ukraine is definitely within the European security complex. It just hasn't reached the other parts (Finlamd, Baltics, Poland) yet. That's how I see it. And it will, if we don't stop and roll it back (Georgia for example)",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "somerandomfuckwit1",
                    "body": "Pro russia staying in its borders. Like containing cancer from spreading",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "miss_dykawitz",
                    "body": "No, but I guess you’re an ork.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "hype_irion",
                    "body": "\"wHy aRe yOu pRoVoKiNg rUsSiA??1?\"",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "completely_regarded",
                    "body": "Boris go home.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Early_Ad3544",
            "body": "Absolutely understandable given the situation with russia. Gotta support their decision.",
            "score": 72,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -73,
                    "replies": []
                },
                {
                    "author": "Ok_Standard_3650",
                    "body": "For protecting themselves? 💀",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "RangerMark3",
                    "body": "For further escalating tensions",
                    "score": -59,
                    "replies": []
                },
                {
                    "author": "KebabGud",
                    "body": "Who is escalating?\n\nThe one beeing threatened or the one making the threats?\n\nBuilding up a defence is not Escalating its reacting to someone else escalating",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -18,
                    "replies": []
                },
                {
                    "author": "RuudVanBommel",
                    "body": "Russia already uses chemical warfare, napalm and flamethrowers in Ukraine, in addition to thermobaric weapons a lot of other things.\n\n\nIf russofascist use those weapons with no disregard, then the treaty indeed doesn't mean squat and the blame lies with Russia. \n\n\nFunny how you blame those who want to defend their country instead those who invade other countries.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "rspndngtthlstbrnddsr",
                    "body": "yeah they mean nothing because aggressor states such as russia never signed them anyway. funnily enough russia is also already into that \"chemical warfare\" bit too, what a surprise \n\npiss off, traitor",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "happyarchae",
                    "body": "bring em back good idea. we can ban them again once russia is dealt with",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "summercrane",
                    "body": "Useful idiot vibe",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "RuudVanBommel",
                    "body": "Defending yourself against aggressive russofascists is now \"escalating tensions\"? Funny how you don't point fingers at Russians for escalating tensions, only at those who intend to defend their country from russofascism.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Niosus",
                    "body": "By laying mines on their side of the border, making it more difficult for either side to cross it? \n\nThese are entirely stationary devices, in case you have missed that detail. They are only a threat to the people in the country where they are deployed, and potential invaders. \n\nPlease explain in which group Vladimir Putin falls so we can better understand why he might feel negatively about this decision...",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "happyarchae",
                    "body": "Russia escalate the tensions by invading its neighbor. no one else. get the fuck outta here",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Glorx",
                    "body": "We didn't start these \"escalating tensions\"",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Early_Ad3544",
                    "body": "brother if u wanna say that NATO is a threat. It literally is a DEFENSE alliance.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "completely_regarded",
                    "body": "Boris go home. Leningrad should be mined.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "atlasmountsenjoyer",
                    "body": "Get fucked, Ivan. Commenting this under every comment will not make Russia not the aggressor.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Cool-Psychology-4896",
                    "body": "You don't need to repost your reply under every comment.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Possible_Golf3180",
            "body": "Always funny seeing russophiles beg that we should be kind, reasonable and abide by treaties they themselves do not respect in the slightest and have never abided by. Russia has never signed the Ottawa treaty in the first place, they have had since ‘97 to sign it but it seems they have had a strange shortage of blue ink.",
            "score": 22,
            "replies": []
        },
        {
            "author": "vegarig",
            "body": "Congratulations.\n\nHope you'll never need them, but it won't hurt to have them - just in case",
            "score": 9,
            "replies": []
        },
        {
            "author": "RaulParson",
            "body": "Super unfortunate, but necessary. The war has demonstrated how huge of an impact mining (especially in truly stupid amounts) can make even in the current day, and the threat that needs to be addressed is immediate.",
            "score": 42,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -55,
                    "replies": []
                },
                {
                    "author": "Cool-Psychology-4896",
                    "body": "You don't need to repost your reply under every comment.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "XenophonSoulis",
                    "body": "Si vis pacem, para bellum",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "GenXAndroidGamer",
                    "body": "No, ruSSia is pro-war and the only way to stop them is to be stronger.\n\nThat's the only language the orcs speak.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "YelmodeMambrino",
                    "body": "You’re American",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Switchblade2000",
                    "body": "So?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BJonker1",
            "body": "NPT next?",
            "score": 7,
            "replies": [
                {
                    "author": "isupposethiswillwork",
                    "body": "We could be seeing atmospheric testing again before the decade is out the way things are going.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BJonker1",
                            "body": "Would be cool. Always wanted to see a nuke go off in 4k.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FML712",
                                    "body": "Dont worry if that keeps going you will see some live",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BJonker1",
                                            "body": "That is if I’m not instantly blinded or worse evaporated. I prefer 4k.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "FML712",
                                                    "body": "That’s not about preference",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "BJonker1",
                                                            "body": "My bad. If there’s no choice I’ll try to enjoy it then.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "FML712",
                                                                    "body": "Thanks for your cooperation!",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Random_Fluke",
                    "body": "Likely",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "AcanthocephalaEast79",
                    "body": "NPT is the policy of all 5 security council members. If Netherlands, for example, starts a nuclear weapons program, it'll be sanctioned by the UN.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BJonker1",
                            "body": "Please elaborate, cause The Netherlands ratified the NPT as did many others, and under article II pledge to not acquire nuclear weapons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dustofdeath",
            "body": "Are we going to develop mines that don't last decades? With some form of chemical timer/fuse to self detonate (once activated) or decay after enough time has passed.\n\nSo we can have minefields, but not ones that would blow up limbs and people for the next century.",
            "score": 6,
            "replies": [
                {
                    "author": "GrandAdmiralSnackbar",
                    "body": "These already exist. And they're not particularly difficult to make I bet.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ABoutDeSouffle",
                    "body": "Yes, western mines do that. However, that's never 100%, so some  will remain.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "vegarig",
                    "body": "> With some form of chemical timer/fuse to self detonate (once activated) or decay after enough time has passed\n\nLook into ADAM and RAAMS submunitions.\n\nAlso PTM-3.\n\nAlready done.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sanizore05",
            "body": "Good job, Russia can taste their own medicine.",
            "score": 33,
            "replies": [
                {
                    "author": "Loud-Chemistry-5056",
                    "body": "Land mines aren’t an offensive weapon. Unless you think we’re going to invade Russia, then the hazards will primarily be posed to civilians in their own countries.\n\nIt’s their country and their choice not mine. They’re probably well aware of the benefits and drawbacks. That they had to even consider doing this is sad in itself though.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Sanizore05",
                            "body": "No it's not, these are purely for defense in the front lines.\n\nThese mines will slow infantry movement by a lot because they would first have to mark the mines to other soldiers that are coming from the same route and also find different route to cross the mine field, usually 2-5 km from the original spot.\n\nThey would have to also mark the safe route to other soldiers, this will take a lot of time.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Loud-Chemistry-5056",
                                    "body": "I hate to break it to you, but frontlines can move. And yeah, I know. I said that they are *not* an offensive weapon.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Generic_Person_3833",
                                    "body": "You can use them in offense.\n\nLong range mine throwers can launch them many kilometers away, behind enemy lines, cutting either their retreat or supply lines. Usually used within (also forbidden) cluster munition packs.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Fit-Height-6956",
                                            "body": "\\> also forbidden\n\nThey are not. I don't know why people think they are. Some countries signed anti cluster munition treaty, but it wasn't Poland, USA or Russia. If I remember correctly for that reason, french companies didn't want to sell Poland some technology regarding the artirelly shells, because they feared it'll be used with cluster munition.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "doubledeckerpecker09",
                            "body": "People here genuinely think Europe is going to fight Russia, the day that happens there will be no need for landmines because the two would have nukes each other and everyone else back to the stone age",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Patient-Reindeer6311",
                    "body": "They'll just throw bodies, they don't care",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tricky-Astronaut",
            "body": "Is Europe finally back on the world stage? But this won't help that much if only Russia's neighbors can develop such weapons while the rest of the continent continues virtue signaling.\n\n\nThere needs to be more solidarity on the continent, and leaving out industrial powerhouses like Germany will lead to less efficiency, especially regarding cluster weapons.",
            "score": 29,
            "replies": [
                {
                    "author": "Lamuks",
                    "body": "Baltics and Poland have been yelling that Russia is a threat for decades and even before annexation as well.\n\nI wouldn't say Europe is back until Germany and France does something",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "cs_Thor",
                    "body": "Half the german political body would sit underneath their desks quivering in fear while the other half would tromp through the halls of the Bundestag with torches and pitchforks loudly clamoring for gallows to be built in front of it should any politicians seriously suggest reintroducing anti-personel mines or cluster munitions. German politics was too craven to admit needing to invest more prior to the last election (and a major politican admitted this live on TV last weekend), what makes anyone think they'd not go evasive over something as controversial as this?",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "MessyTrashPanda666",
                    "body": "> But this won't help that much if only Russia's neighbors can develop such weapons while the rest of the continent continues virtue signaling.\n\n\n\nI was in Poland about a year before US elections.The entire place seemed like it was in \"overdrive\". \n\n\nI guess they were prepared for the possible victory by Trump and didn't want to be caught \"deer in headlights\". \n\n\nI've never been to Lithuania and futher north (not yet), but I imagine they were even more actively preparing. \n\n\nAnd Finland? They never *quit* their defence. No \"peace dividend\" if your border with the Asian Horde is 1300km long.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Fun-Set-1458",
                            "body": "From a Polish perspective, Trump winning changes very little. Nobody was afraid of him winning and nobody is afraid of him now. Some foreign issues have to be recalibrated, that's it. \n\nPoland, as a whole, has always been very pro-US and that won't change because of Trump. Poland was also always very anti-Russia, and this also didn't change because of Trump.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "zdzislav_kozibroda",
                                    "body": "Sadly, we can be as much pro-US as we want.\n\nQuestion is how much pro-Poland is US these days.\n\nAnd what that means. Coming all cavalry in or arranging another \"great peace deal\" like the Ukrainian one now.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "suicidemachine",
                                            "body": "The US has always been one thing: pro-US. It's just that various administrations have been more vocal about this.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Menkhal",
                                    "body": "The thing right now is that being pro-US is quickly turning into being pro-Russia too.\nOpposing Putin's expansionism is no longer a compatible position with being an ally of the US.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Fun-Set-1458",
                                            "body": "I honestly don't think Trump is being pro-Russian. He simply isn't pro-Ukraine. IMO, he just wants to get over this conflict as fast as possible so he can focus on a more pressing issue: China.\n\n\n\nPeople often claim he's Putin's puppet because he makes concessions, but that perception will change the moment he takes actions that Russia won't like. And he will, because ultimately, Russia is no longer a major global player - China is.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "happyarchae",
                                                    "body": "it’s essentially proven at this point that he is a Russian asset. unless you think 2 different former Russian intelligence members are just independently making up the same story",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Fun-Set-1458",
                                                            "body": "So now we believe Russians because they say what we want to hear? There are no \"former\" Russian intelligence members. They are either active or dead.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "happyarchae",
                                                                    "body": "do you think all Russians are liars? their leadership lies daily but it’s not as if no Russian can ever say something true. and of course there are former members. they retire like everybody else",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fun-Set-1458",
                                                                            "body": "Of course I don't think that. But Russian intelligence operatives (whether former or active) are not high on my trust list.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "suicidemachine",
                                    "body": "People overestimate how Trump's actions towards Ukraine will be a good reflection of how NATO will be perceived by the new US administration. \n\nI feel for Ukraine as much as other guy, but Ukraine isn't even a member of any Western structure, is very corrupt, and was rather pro-Russian for most of its existence.\n\nOf course that doesn't change the fact that some calibrations should be made now, doesn't matter who is in charge in the White House. A smart country plays two pianos at the same time.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "flyingdutchmnn",
            "body": "Europe rolling up it's sleeves. The first of many steps to secure Europe in a future of hostility from the eastern flank AND west across the atlantic",
            "score": 7,
            "replies": []
        },
        {
            "author": "rzx123",
            "body": "Strictly speaking not quite yet. That is a recommendation (\"recommend withdrawing\") of their ministers of defense. I take they all need still a parliamentary vote, that is still most likely bit into the future.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Hungry_Knowledge_893",
            "body": "If Europe fully prepares for war it becomes too big of a risk for Vlad's oligarchs to support an invasion.\n\nAgain this is all a matter of power and resources, Europe has interesting resources, they want them, they will not act on it if the cost is too high.\n\nThe Ukrainian war will only be slightly profitable if they keep their current territories as they are now, I can't imagine how far they'd have to get into heavily prepared EU territory to occupy something resource rich enough to compensate...",
            "score": 3,
            "replies": []
        },
        {
            "author": "7StarSailor",
            "body": "It's a weird timeline that I am actually cheering for this but we can all thank Putin for that one.",
            "score": 6,
            "replies": []
        },
        {
            "author": "DizzyAd700",
            "body": "In an ideal world, this would be a really “inhumane” decision. However, if there will be war - it will likely be against Russia, whom don’t concern themselves with not killing civilians. So in the end, this unfortunately is likely to be only one step on the “stair” and is something that has to be done.",
            "score": 5,
            "replies": []
        },
        {
            "author": "AverellCZ",
            "body": "I suggest to get one mine for each russian",
            "score": 6,
            "replies": []
        },
        {
            "author": "Tman11S",
            "body": "I really hope those mines will never have to go off, but in today's world it might be a good idea to start mining the russian border",
            "score": 7,
            "replies": []
        },
        {
            "author": "ilic_mls",
            "body": "If the Fins do it, id be scared for Russia",
            "score": 10,
            "replies": [
                {
                    "author": "Mr_Black90",
                    "body": "I'd be scared for the Russians anyway even without the mines when it comes to Finland 😅 The whole place is basically a giant death trap for Russian soldiers. There are hidden mg nests, tunnels under the cities (of which no maps exist!), hidden weapons caches, tons of forests, lakes that prevent troops from easily crossing... Finland would be a nightmare to invade.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ilic_mls",
                            "body": "And we know what happens when snow starts talking Finnish.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Litastpar",
                            "body": "Artillery goes brr",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheNortalf",
            "body": "As a Pole I'm not sure how I feel about it. On the one hand restriction like this are good and we should support it, on the other hand it's useful tool and since your enemy is using the mines the mines will be in the ground anyway. Sure if the both sides are using the mines, the amount of mines increase, but on the other hand you know where you've placed the mines. \nIt's easy to sign treatys like this when you're safe and there's no realistic possibility of invasion, but when the invasion becomes a bit more realistic (I don't think anyone here believes it is realistic) and you just withdraw, that's mean the Treaties are just empty, meaningless sheets of paper. ",
            "score": 12,
            "replies": [
                {
                    "author": "el_grort",
                    "body": ">but on the other hand you know where you've placed the mines\n\nIirc, historically that's often not really been the case, they get lost, they don't get properly recorded, etc. Partly why these treaties got signed, it's too easy to lose track of your mining.\n\nUltimately it is those countries choices to accept the additional risk, however.\n\nEdit: it occurred to me that we've had systems for projectile and aerial mine laying since the World Wars, so there is often not even a reliable method of recording mine location other than 'that general area'. And ultimately, the greatest risk and tragedy of mining areas is the (often decades of) post-war civilian casualties. But again, ultimately the countries doing this are taking that risk on their shoulders of unexploded ordinance being a continuing risk long into the future.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "TheNortalf",
                            "body": "Historically yes, but technology changes, approach changes etc. I think you do know where you've placed the mines nowadays. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "FML712",
                            "body": "How easy would it be to deactivate them and sell them?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silly-Elderberry-411",
                    "body": "My dude that's where you are wrong. Study the past cold war land mine incidents which happened exactly because nobody gave a shit where those mines were. Welcome to the club I guess.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "TheNortalf",
                            "body": "Past cold war incidents but where? \nIn Iraq? ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lubinski64",
                    "body": "You are aware of the fact that Poland never implemented the original convention, right? Those mines have been in continuous production in Poland for the past few decades, this paper's only purpose is sending a message.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SentientWickerBasket",
            "body": "I have to ask, what is the point of this treaty if a signatory can just withdraw the moment it becomes relevant?",
            "score": 14,
            "replies": [
                {
                    "author": "Balt603",
                    "body": "All treaties between countries are based upon goodwill and words of honour. It's just the way it is.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "PraxicalExperience",
                            "body": "And using official methods to withdraw from a treaty is significantly better, reputationally, than simply breaking it.  Something some leaders in my country could learn ... but they don't care.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "toolkitxx",
                    "body": "Less producers, less nations that store them, less chances they get into the hands of weirdos and dictators. The list goes on.\n\nEvery contract, also international ones, can usually be cancelled after either some time or by fulfilling some provision. Those kinds of contracts aim to form the world with rules and agreements instead of war and might.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Mr_Black90",
                    "body": "Well, that is kinda the main weakness of any treaty, really- they only work as long as the signatories want to enforce them and play along.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ABoutDeSouffle",
                    "body": "It takes a year at least to build up production and a bit longer till you have a stockpile. If - ideally - the usual war-mongers like Russia, China, and the US had signed the treaty, the world would be a safer place.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Lubinski64",
                            "body": "Poland never stopped the production of those mines despite the treaty.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PraxicalExperience",
                    "body": "Well, basically, it establishes official peer pressure not to do such a thing.  Backing out of such agreements can have serious repercussions.\n\nOn the other hand, how withdrawing from a treaty is seen by the remaining members of the treaty can vary wildly based upon the circumstances.  The current situation is one where keeping the option to use land mines open just makes sense for security purposes.  Using land mines defensively in your own country is entirely different than sowing them far in wide in someone else's country you're attacking -- the whole point of the treaty is to reduce the impact to civilians that leaving such fields in place has.  \n\nWith the way the winds are blowing, I don't think anyone's gonna give those countries any significant blowback for having withdrawn from the treaty.  This was a \"we're going to use official methods to withdraw from the treaty\" rather than just breaking it.  Most treaties have a similar out-clause.  It's basically a fair-play signal to everyone that you've decided not to play by these rules, for whatever reason.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AcanthocephalaEast79",
                    "body": "Virtue signalling. They love to have big get togethers and fancy meals for bs projects like this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jaquen81",
            "body": "Let me guess: they’re ready to mine the border to avoid a nighttime invasion as in Ukraine",
            "score": 3,
            "replies": [
                {
                    "author": "Risiki",
                    "body": "I think it has more to do with frontline fortifications, including mine fields, effectivelly stalling counterattack https://en.wikipedia.org/wiki/Fortifications_of_the_Russian_invasion_of_Ukraine",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mindless_Parking_714",
                    "body": "Russian soldiers dug trenches in Chernobyl! This would not stop an invasion, just arm civilians and animals even more",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "articman123",
            "body": "NPT is next.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jimbluenosecrab",
            "body": "Sad but understandable when you have an aggressive neighbour on the border.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Common_Brick_8222",
            "body": "Good job. They should protect themselves from Russia.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Spackolos",
            "body": "It was always a fair weather treaty.\n\nYou don't need them to fight neo-colonial wars with.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Popular_Tomorrow_204",
            "body": "*East European countries withdrawing from the Ottawa Convention* \n\n\"Yeah that seems fair😤👍.\"\n\n*Canada also withdrawing from the Ottawa Convention* \n\n\"🗿...\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "_escuirtel",
            "body": "Sad times.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Weird_Rooster_4307",
            "body": "So with dropping this treaty it would seem something has dramatically changed and Russias aggressions are quickly becoming a reality.",
            "score": 8,
            "replies": [
                {
                    "author": "Swesteel",
                    "body": "Yes, Trump is trying to withdraw from Europe and side with Russia. These countries know they’re on the list and have no time for bullshit.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Lamuks",
                    "body": "It's always been a reality for us..",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaptainFil",
            "body": "This is a sad development but understandable in the circumstances, if I was bordering Russia I would want all options available, I wouldn't blame them for looking for an independent nuclear deterrent either at this point.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Moosplauze",
            "body": "Makes sense.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gopher246",
            "body": "Can't blame them, they are in the bullseye for future aggression.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SpookyMinimalist",
            "body": "Sad, but absolutely necessary, since the likely enemy has withdrawn from human decency.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Nigel_Bligh_Burns",
            "body": "Russia is leading all countries to go against their international obligations in order to protect themselves from it\n\n\nHe lead the world at this point, while that old-big murican fart is claiming he is carrying on Peace.",
            "score": 9,
            "replies": [
                {
                    "author": "Tricky-Astronaut",
                    "body": "There's no obligation of limiting your options to defend yourself. This was mainly done for the purpose of virtue signaling.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mysterious-Panic-443",
            "body": "Good. Blast those orcs in to orbit.",
            "score": 7,
            "replies": [
                {
                    "author": "Spiritual_Coast6894",
                    "body": "Why aren’t you on the front ?",
                    "score": -19,
                    "replies": [
                        {
                            "author": "Mysterious-Panic-443",
                            "body": "Probably the same reason you're not.\n\nEDIT: Your reddit history fits.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Spiritual_Coast6894",
                                    "body": "What same reason? Go join the Ukrainian foreign legion if you want to « blast orcs ». They need you right now !",
                                    "score": -17,
                                    "replies": []
                                },
                                {
                                    "author": "Mysterious-Panic-443",
                                    "body": "Are you done?",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "FML712",
                                    "body": "He should go on and tell what kind of little bi**h you are!!!!",
                                    "score": -5,
                                    "replies": []
                                },
                                {
                                    "author": "kakao_w_proszku",
                                    "body": "Cry harder",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "WorriedTwist8754",
                                    "body": "Brother, you're french",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Course_6757",
            "body": "I get it but this is terrible. Landmines kill people years after the conflict is over, often children.",
            "score": 19,
            "replies": [
                {
                    "author": "PainInTheRhine",
                    "body": "The logic is that in any war mines will be used anyway and Russians won't bother to include any kind of timed self-destruct mechanism in theirs.",
                    "score": 71,
                    "replies": []
                },
                {
                    "author": "AivoduS",
                    "body": "Russians will also kill people (often children) if they'll win. They will also drop \"butterfly\" mines to hurt as many civillians as they can. The Ottawa convention won't stop them. But our minefields can.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Etalier",
                            "body": "Not really though. It's just unwanted non-muscovite portion of Russians that grt crippled by the mines and then forgotten.\n\nThat said, even when minefields don't stop them, they buy time for other weapon systems to do so.\n\nThough I suppose if mines start exploding in Nato countries the mines don't really matter anymore. Personally I'm not seeing that conflict ending, or doing much more than starting, without nukes flying overhead..",
                            "score": -9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sanizore05",
                    "body": "Civilian casualties will be always sad part of the war, but losing the whole country and it's independence is much worse.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "janeer127",
                            "body": "But we should reduce them ffs",
                            "score": -19,
                            "replies": [
                                {
                                    "author": "Waffenek",
                                    "body": "First of all you need to reduce russia. Atrocities they comited in Bucha, Irpen and countless other occupied towns and villages shows that keeping territory is crucial. Loss of civilian life and cost of removing unexploded ordinance after war is significantly better outcome compared to genocide performed by russian occupying forces.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "janeer127",
                                            "body": "Why we are pretending that these are only two options. \n\nI prefere to have neither and not get dragged into this false dichotomy",
                                            "score": -21,
                                            "replies": []
                                        },
                                        {
                                            "author": "tuhn",
                                            "body": "Not having mines as a defensive tool significantly weakens defensive capacities.\n\nSo yes, in case of attack it potentially allows the attacker to move much more rapidly and conquer areas.\n\nDo you have other deterrents in mind? Maybe nuclear, chemical, biological weapons?\n\nThis is not a nice topic, war isn't fun and you can not tap out when things get uncomfortable.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "janeer127",
                                            "body": "And? Effectiveness of weapon is not an argument for their use if weapon itself does harm for civilians or defenders. \n\n\nYou could make same argument for war gas but would you advocate for the use of it?",
                                            "score": -15,
                                            "replies": []
                                        },
                                        {
                                            "author": "tuhn",
                                            "body": ">And? Effectiveness of weapon is not an argument for their use if weapon itself does harm for civilians or defenders.\n\nWell it depends how much it does harm those and how useful it is.\n\nIt's mostly a weapon which will be laid only during war time. These countries are not suicidal or looking to harm their civilian population.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "completely_regarded",
                                            "body": ">Effectiveness of weapon is not an argument for their use if weapon itself does harm for civilians or defenders.\n\nYes it is. The average toddler would be capable of understanding this, so it’s quite embarrassing that you aren’t.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "janeer127",
                                            "body": "No it is not and it is quite laughable that you think that way.  \n\n\nIf it was a case all countries would use Combat Gas, and if country is capable Atomic bombs. But well we don't. Why? Beacuse unleashing it would do unacceptable level of harm to the defenders. I wonder if you can grasp that idea",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "completely_regarded",
                                            "body": "Wrong.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "ABoutDeSouffle",
                                            "body": "I'm fully with you, but what should small countries like the Baltics do? They have to stop the Russians right at the border. That is only possible by dirty weapons like cluster ammo and anti-personel mines.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Far_Buyer_7281",
                            "body": "remind me why exactly?",
                            "score": -46,
                            "replies": []
                        },
                        {
                            "author": "Suriael",
                            "body": "Fucking Bucza for example?",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Wayoutofthewayof",
                            "body": "How familiar are you with history of the last 100 years?",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "Sanizore05",
                            "body": "Remind you why losing a country and independence is worse than few civilian casualties? How is that even a question... \n\nYou do understand that once the country is gone, Russia will kill the civilians either way that show any type of negativity towards the Russian Federation and fill the kids with propaganda.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "ziguslav",
                            "body": "Do you not know what happened in Poland when it lost its independence in 1939?",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "skyturnedred",
                            "body": "What are you even asking about? Why civilian casualties are sad or why losing your country is bad?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "servermeta_net",
                            "body": "think of all the horrible and unspeakable things the dutch did in their colonies",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "completely_regarded",
                            "body": "Go spread your cheeks for some russian soldiers and they’ll explain it to you in excruciating detail.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HumanNr104222135862",
                    "body": "Yup. There’s a really good German/Danish movie about that, called [Land of Mine](https://en.wikipedia.org/wiki/Land_of_Mine).",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "_OVERHATE_",
                    "body": "Acceptable side-effect of not losing your country to the russians",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "mathis3299",
                    "body": "The modern ones de-activate after a set period of time, so this would not be an issue.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "toolkitxx",
                            "body": "The 26 million ones Russia had in and around 2010/11 wont be that. It is naive to believe any of it will just disappear. Neither side will keep good enough track of what got placed when and where in the end.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "mathis3299",
                                    "body": "Yeah I am not assuming anything about russia to be modern, but russia never was in the ottawa agreement.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "toolkitxx",
                                            "body": "I mean that for everyone. Moving troops, change of a frontline, laziness to document. \n\nThere are so many reasons mines are not just a controlled element as many believe them to be. So deactivation might be a feature for some, the vast majority will still not have that and even with it, those modern ones have the same issues basically for at least  some time I listed.\n\nI do understand the arguments but also look historically at it. If any of it would actually be really needed, it will end like in many other countries that deal with loitering stuff decades afterwards. Pretty much every German can tell you some anecdotes about bombs needing removal and/or needed to be exploded in a controlled environment pretty much on a regular base.\n\nNow think mines that are a lot smaller. This stuff is hard to keep track of compared to a bomb with several kilos at a time.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "echoAnother",
                            "body": "De-activating is not good enough. If they keep track of them and make them boom after war, I don't see that much danger. But I hope they do not need to use them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FML712",
                    "body": "In my town English army didn’t deactivated all mines and a lot of kids died, you still can see in a wall that stayed the holes :(",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mader_Levap",
                    "body": "Landmines will never kill as much civilians as invader.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Username1991912",
                    "body": "There will be landmines in the battlefield anyways since russia is using them. And battlefields are going to be filled with all kinds of unexploded explosives. With landmines the areas you mine are going to be logged and demined after the war. Properly logged landmines are literally the least of the issues you are going to have after a war.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Weird-Tomorrow-9829",
                    "body": "Wars are terrible.\n\nWillfully stunting your own defensive capabilities for virtue signaling is ignorant.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok_Course_6757",
                            "body": "I understand the reasoning. I also feel that it's a shame to see the Ottawa Convention fall apart like this.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Weird-Tomorrow-9829",
                                    "body": "I think it was a shame it was signed at all.\n\nI disagree with its premise.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheNortalf",
                    "body": "What when the other side does use the mines? \nSure when two sides of the war use mines the amount of mines increase but on the other hand you know where you have placed the mines.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "servermeta_net",
                            "body": "Russia is not bound by international law",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "TheNortalf",
                                    "body": "And what does it change? ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FML712",
                            "body": "Shouldn’t matter, „russia will invade Europe“ so we won’t have to run over their mines…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Resident_Fudge_7270",
            "body": "What does this mean?",
            "score": 2,
            "replies": [
                {
                    "author": "Swesteel",
                    "body": "It means if Russia invades they’ll have to do it through a carpet of mines.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Resident_Fudge_7270",
                            "body": "Nice! I’m so sorry that this is the state of the world now.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "FML712",
                                    "body": "What’s nice about that? Nice that the armor spiral going up? We put landmines they throw bombs we throw bombs they throw bigger ones",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Weird-Tomorrow-9829",
                                            "body": "Calm down Chamberlain",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "FML712",
                                                    "body": "Thanks :)",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mader_Levap",
                                            "body": "They will throw bombs anyway. Nice try, though.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Darkavenger_13",
            "body": "Good. Its not a bad convention, but when your opponent doesn’t care about form or convention it loses its meaning",
            "score": 2,
            "replies": []
        },
        {
            "author": "NickVanDoom",
            "body": "bring back bouncing betty",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wildest12",
            "body": "Enemy uses them no other choice",
            "score": 2,
            "replies": []
        },
        {
            "author": "R0D18",
            "body": "While I completely understand this move, I just hate this new world we're in",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mishka_1994",
            "body": "These treaties are pointless when aggressor countries like Russia dont follow them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrashedTaco",
            "body": "*Chants in Geneva Checklist",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnooPoems3464",
            "body": "This is unfortunately absolutely necessary thanks to russia. If you blame anyone, it’s them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aksovar",
            "body": "Smart choice, mine that whole border",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mysterious-Panic-443",
            "body": "Lots of Russian shills in here.",
            "score": 5,
            "replies": []
        },
        {
            "author": "-_Hellcat_",
            "body": "That's good. I'd sugest those countries to already mine the borders with terroruzia.",
            "score": 4,
            "replies": []
        },
        {
            "author": "twenty_characters020",
            "body": "Make Landmines Great Again.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mr_Black90",
            "body": "Finally! I'll bet they'd actually been planning to do this for a while, but wanted to wait and see how the situation would develop, and what the outcome of the US election would be. Now Trump has provided them with the perfect impetus + excuse for finally doing it.",
            "score": 3,
            "replies": [
                {
                    "author": "PraxicalExperience",
                    "body": "I mean, this is what happens when you can't depend on the biggest military in the world and arguably the linchpin against Russian aggression in the area to actually follow their treaty obligations, or act in a rational fucking manner.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apoxie",
            "body": "Soon Europe will also withdraw from the nuclear proliferation agreement.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kRe4ture",
            "body": "Why shouldn’t they though. If they have to use mines, they will be laying them on their own ground.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Soap_Mctavish101",
            "body": "Sad event. But unfortunately, it’s necessary.",
            "score": 3,
            "replies": [
                {
                    "author": "IllustriousLaugh4883",
                    "body": "This is how I feel. I don’t like that a lot of the progress towards peace been erased these past years, but I feel the blame lies at Russia’s feet, and the Baltic states’ worries are well-founded. ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aggravating-Trip-546",
            "body": "As a Polish-Canadian.   Oofff.  But, yeah.  I get it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_ChunkyLover69",
            "body": "Good. Mine the absolute shit out of your borders  with Russia.",
            "score": 5,
            "replies": []
        },
        {
            "author": "siamjeff",
            "body": "Hope Canada does too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dead_Optics",
            "body": "What’s the point of these treaties if participants break them at the first sign of trouble. Why even bother in the first place.",
            "score": 2,
            "replies": [
                {
                    "author": "Random_Fluke",
                    "body": "It's not breaking if you are withdrawing.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ArcticAlmond",
            "body": "Understandable. \n\nLofty ideals are great and everything, but they're not all that useful when you have an aggressive neighbour on your border.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MaesterHannibal",
            "body": "Gotta get rid of all the rules of war when it comes to conflict with Russia. They won’t adhere to international law, so us doing it will only hinder us, and show the Russians that there are no consequences when fighting is",
            "score": 2,
            "replies": []
        },
        {
            "author": "NaturalPossible8590",
            "body": "Pretty sure even Ottawa is going to withdraw from the Convention if Trump and his goons don't shut up about the 51st State shit",
            "score": 2,
            "replies": []
        },
        {
            "author": "Previous-Step4147",
            "body": "Very good",
            "score": 2,
            "replies": []
        },
        {
            "author": "januscanary",
            "body": "The dominoes are falling",
            "score": 1,
            "replies": []
        },
        {
            "author": "sickste",
            "body": "Sad that they have to do this but completely understandable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeansAllDayEveryDay",
            "body": "Please provide a source with something like this.\n\nHere is what I found on the topic: https://www.reuters.com/world/europe/poland-baltic-nations-pull-out-landmines-convention-2025-03-18/\n\n Do you have a link for the statement?",
            "score": 1,
            "replies": [
                {
                    "author": "MAGNVS_DVX_LITVANIAE",
                    "body": "[Here.](https://x.com/Lithuanian_MoD/status/1901901669274628371)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Electrical-Bread-856",
            "body": "O kurwa",
            "score": 1,
            "replies": []
        },
        {
            "author": "so_porific",
            "body": "Fuck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult-Value-3145",
            "body": "Sadley it's a necessity and at least pulling out of treaty's  instead of just violating them i imagine America pulling it's support from Ukraine had something to do with this also fact that everyone who even kinda looked into it knows that mass gps jamming over the entire area are Russian in origin yet no one doing shit about it sides re calibration of vortecs idk cue REM apocalypse now",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmileAggravating9608",
            "body": "Here we go. Yet another domino falls in our rush back to war, aggression, and doing what we need to do to keep our countries safe, because people (US and Europe, I'm looking at you both in different ways, above all others) refuse to take aggression seriously and actually shut it down.\n\nOn the other hand, given that reality, I'm glad the world is willing to take difficult measures like this. It shows that there are people who understand that war and aggression are ugly and you gotta do what you gotta do to protect your freedoms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MysteriousDudeness",
            "body": "If the enemy is by no means required to follow this pact, then why should they hamstring themselves?",
            "score": 1,
            "replies": []
        },
        {
            "author": "lonely_pigeon_1993",
            "body": "*\"Fried russian legs\" - soon in stock*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Handle2920",
            "body": "Regrettable but understandable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Psychological-Ebb677",
            "body": "Russia didnt sign the convention... So basicly everyone can lay mines in russia as much as he wants. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheNinjaDC",
            "body": "I always found the landmine and cluster bomb treaties silly. There is a reason the US and other actually active militaries never signed. \n\nThey are incredibly effective weapons. Hell, Russian mines fight a lot harder than Russian soldiers. They are unfortunately the biggest reason Ukraine didn't kick Russia out of Ukraine in their big Spring offensive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "samuraijon",
            "body": "I like how the order of the signatures are arranged by the latitudes of the countries",
            "score": 1,
            "replies": [
                {
                    "author": "Vistella",
                    "body": "or alphabeticly",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bert-Tino",
            "body": "Is there new reason/intel out there to make these countries believe a Russian invasion is coming ? Or is this just for planning and preparation?",
            "score": 1,
            "replies": [
                {
                    "author": "Mader_Levap",
                    "body": "Currently, best course of action is assumption that Russia will not stop at Ukraine.\n\nCountries, especially ones bordering aggresive murderous totalitarian dictatorship, are acting accordingly.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "yuriy_yarosh",
            "body": "A good drone with MPPI controls and SAT Dect-NR+ comms can do wonders with such munition.\n\nIt's just Iridium LEO sat network is not exactly what I would call secure for military use.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sinapsis42",
            "body": "The Russians have mined all the territory stolen from Ukraine in the south and east. Mines are terrible and will cause victims for decades, but if the aggressor uses them we cannot limit ourselves to putting barbed wire on the border with Russia. Sad, but true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gingerchaun",
            "body": "Canada should leave too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upstairs-Painting-60",
            "body": "When your 400lb neighbor threatens you with their size, you show them the industrial grade woodchipper you've built!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClonedDad",
            "body": "Some weapon manufacturer is about to sell a lot of mines and make bank.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mousepotatodoesstuff",
            "body": "I see the FAFO alliance is taking form.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suzume_Chikahisa",
            "body": "Not unexpected. The reason is the same for why South Korean never joined in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Solid-Two-4714",
            "body": "Understandable ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Impact2187",
            "body": "I understand why but am angry that it has to come to this. It shouldn’t have to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WorriedTwist8754",
            "body": "Every country in Europe should do the same thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Let-8503",
            "body": "Europe is awaking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chc06jc",
            "body": "The agreement should always be that weapons such as mines and cluster munitions won’t be used against those who also agree not to use them. As soon as they are used by one side all agreements are off. Russia doesn’t play by the rules, so be it, the other side won ‘t be held by those rules. Remind them why such rules exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Treacle-6615",
            "body": "Oh no! Now Europeans are against Russians walking into their territory. /S",
            "score": 1,
            "replies": []
        },
        {
            "author": "Projectionist76",
            "body": "Putting landmines all along their border with Russia I’m guessing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kenobi_High_Ground",
            "body": "When children living near the border end up blowing their legs off due to these mines how will people justify this? They were banned for a reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yenneferismywaifu",
            "body": "That's good. But why did you sign this in the first place, Russia wasn't your neighbor before?\n\n\nThink about deploying nuclear weapons in those countries too. I hope France will help them.",
            "score": 1,
            "replies": [
                {
                    "author": "Spiritual_Coast6894",
                    "body": "Nuclear umbrellas are flawed because no sane leader would risk getting half of Europe nuked by nuking Moscow because Vilnius is invaded lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "museum_lifestyle",
            "body": "Canada cannot get a break",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy_Lingonberry2822",
            "body": "So what happens when an animal hits the mines and sets off a large chunk of mines?",
            "score": 1,
            "replies": [
                {
                    "author": "FML712",
                    "body": "Upsi",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chromadef1",
            "body": "as someone that passes next to a minefield every other month on my way to visit my parents, this just makes me sad",
            "score": 1,
            "replies": []
        },
        {
            "author": "berejser",
            "body": "Well done Trump, this is what happens when you destabilise things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MapPristine",
            "body": "FFS. We had the chance. The future looked so bright back in the early 90’s. People from the east and west united and talked and cooperated. And now this shit. Not blaming these countries, but definitely blaming the leaders of the great superpowers. They’re supposed to be the most adult and civilized of all humans, but they’re no better than a 5 yo kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProFailing",
            "body": "Not a fan of this. The reason for a ban on APLs was not so much a military one, but an issue that is very much still alive today in Bosnia: It's a huge threat to civilians.\n\nI'm all for defending ourselves against Russia, but if it means that potentially generations of people in the area will have avoid large strips of land because they are filled with uncleared mines, there must be better options.",
            "score": 1,
            "replies": []
        },
        {
            "author": "griffonrl",
            "body": "This is understandable to a point with the crazy Russians at the door but this is also super sad to see us regress and rearm. That said they deserve to protect themselves from insane idiots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering-Age-9549",
            "body": "They will withdraw from the Treaty on the Non-Proliferation of Nuclear Weapons soon...",
            "score": 1,
            "replies": []
        },
        {
            "author": "mingy",
            "body": "As they should. Treaties are meant for weaker countries to comply. Major countries such as the US or Russia either don't sign the treaty or ignore it when they want to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StretPharmacist",
            "body": "land mines is a growth industry",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarrensDodgyDenim",
            "body": "It is sad that this is necessary, but this is where we are.",
            "score": 1,
            "replies": []
        },
        {
            "author": "donut2guy",
            "body": "Everyone here happy about it, that's nuts. You don't have to be laying mines to protect your country. Biological and chemical weapons are also effective, doesn't mean you should use them because you have a neighbor that might invade you. Beef up your military and make sure other nations will help you in case of an invasion, don't undo years of progress in a humanitarian project.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoctisScriptor",
            "body": "this is actually a very bad thing tbh. landmines should not exist in this world. this is very sad. I just hope they just use smart mines that get disabled after a while and that no innocent civilian dies. around 6000 people get killed by landmines every year, not to mention all the injuries and amputations. specially children.",
            "score": -8,
            "replies": [
                {
                    "author": "Mr_Black90",
                    "body": "Sure, in an ideal world this would not be necessary. But it sadly is- letting the Russians invade and overrun your country is not an option for any sane neighbor of theirs. You can't surrender to them and wait out an occupation. They'll just murder their way through the local population or worse until they reach the coastline.\n\nI do think these countries will mostly use smart mines with a timer on them- after all, it's their own land they're going to be using them on. Also, in the 3 Baltic countries at least, I don't believe that many people live very close to the border with Russia, so if that's the case it should reduce the number of people (especially children) who'd be exposed to the danger. And the mine fields would be marked, of course.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "NoctisScriptor",
                            "body": "let's hope not many innocents die. smart mines aren't flawless. there's always many duds and malfunctions. still better than others. also not sure if this is efective. they aren't exactly anti tank mines.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "LeviathanGoesToSleep",
                                    "body": "Many innocents will be saved when the invaders step on the mines instead of getting to carry out their violent intentions",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "NoctisScriptor",
                                            "body": "That's actually a great argument that made me change my point of view. You are right",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Eastern_Interest_908",
                                    "body": "It's like the most effective thing that exists. Mine the shit out of border, send drones if they'll send someone to deactivate them. If everything is done correctly they would be stuck there for a very long time. ",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "FML712",
                                            "body": "They will throw bombs on your head on a daily basis",
                                            "score": -5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Eastern_Interest_908",
                                            "body": "That's why we're buying anti missile stuff.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "FML712",
                                            "body": "thAtHs wHy noThInG wiLL haPPen to ME",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Silly-Elderberry-411",
                    "body": "In the autumn of 1962 two young west German men climbed the fence into east Germany hoping for ensured jobs and possibly tradwives.  We will never know because shortly after climbing the second fence both were killed by landmines. The border guards of that section naturally heard the explosion and immediately went to check the sand to see who tried to escape to the west. Since the sand was undisturbed they came to the conclusion no escape attempt happened and it was possibly a deer stepping on it.\n\nThe two decomposed bodies were only found in April of 1963, 5 months after the incident, forcing to update the policy to check the fence even if it's not internal.\n\nThe issue is the Baltic states and Poland since their exit from the Warsaw pact have not had to fight in their own soil and never had to show if only military systems are Nato compatible or mindsets too. Exiting this treaty doesn't instill confidence in me they changed, rather it sends the message they don't trust the very Nato they're in.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Eastern_Interest_908",
                            "body": "Even with NATO baltics would have to hold out for quite a while and without mines that would be very hard given how small balgic countries are. ",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "GrandAdmiralSnackbar",
                            "body": "They have good reason not to trust NATO as long as Trump is in charge in the USA and Europe hasn't built up their armies yet. Also, we've seen firsthand the barbarity of Russia in Bucha. As I understand it, previously the NATO doctrine was that the Baltics could be occupied by Russia, but would be liberated later. Seeing how barbaric the Russian army operates, that no longer is an option. That means a defensive line in the Baltics must be held, and that will require landmines. Lots of them.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Mader_Levap",
                                    "body": "Bucha is old news. Currently Russians are hunting civilians with drones in frontline Ukrainian cities, pretty much dozen of warcrimes on daily basis.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Possible-Usual-9357",
            "body": "We are just mining our own business",
            "score": 0,
            "replies": []
        },
        {
            "author": "havok0159",
            "body": "I wonder what all these countries have in common. Does anyone have any idea?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Douude",
            "body": "Ah so much for human rights...\nAwell deglobalisation in full force predicted 2 decades ago",
            "score": -1,
            "replies": []
        },
        {
            "author": "ankokudaishogun",
            "body": "This is sad.\n\n\n....I wonder if we have still old stuff to sell?",
            "score": -14,
            "replies": [
                {
                    "author": "hapugreip",
                    "body": "It's sad that it is necessary to take these measures in 2025. You are correct.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "MessyTrashPanda666",
                    "body": "> This is sad. \n\n\nThe main reason is that \"their opponent (not named) has never joined the Convention\".\n\n\nRead: Russia has them.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Tricky-Astronaut",
                            "body": "It's not only Russia. None of the major military powers joined it: the US, China, India, Iran, Egypt etc.\n\n\nIf Europe wants to be a major military power, it needs to leave those conventions as well, especially the one about cluster weapons.\n\n\nAnd I'm talking about all of Europe. Germany is one of the largest producers of artillery shells in the world, but that potential is wasted when it can't make more efficient cluster weapons.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "ankokudaishogun",
                            "body": "yeah, I know. Still sad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sumeru88",
            "body": "4 months ago, EU was [preaching this to the world](https://www.eeas.europa.eu/eeas/ottawa-convention-conference-push-progress-towards-mine-free-world_en).\n\nThis is why no country really takes any of Europe's comments seriously. They are spoken with a forked tongue.",
            "score": -4,
            "replies": [
                {
                    "author": "WorriedTwist8754",
                    "body": "You should clean your country first and then comment on Europe",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KL_boy",
            "body": "Well there goes the cheap cigs, vodka and fishing on the lake.😢",
            "score": 0,
            "replies": [
                {
                    "author": "PotemkinSuplex",
                    "body": "If only Finns had lakes to fish on lol.\n\nAlso, trip for cheap alcohol is a trip to Tallinn trip now. Had been for quite some time.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KL_boy",
                            "body": "In the good old days, a trip to some parking lot in lasnamäe could get you some Russian cigs! ",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "PotemkinSuplex",
                                    "body": "Dude, my bad. For some weird reason I thought the post was about Finland. I don’t know why. Brainfart.\n\nThe ants in Narva still carry those probably - in exchange for cheese lol. Lasna is still authentic as long as you can get a free Russian lesson there, cigarettes or not.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Patient-Reindeer6311",
            "body": "It's understandable. But on the other hand, if you can withdraw from your obligation because things change, then these conventions had no meaning in the first place.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MandateIsBack2",
            "body": "So these treaties are only useful during peace time 🤣",
            "score": 0,
            "replies": []
        },
        {
            "author": "ThrowRAkakareborn",
            "body": "What? You could not use anti-personnel mines? Bruh you attack, i’ll use anything under the sun, don’t want to get whatever stay the fuck within your borders",
            "score": 0,
            "replies": []
        },
        {
            "author": "fredandlunchbox",
            "body": "Treaty doesn’t mean a damn thing during peacetime. ",
            "score": -4,
            "replies": []
        },
        {
            "author": "Jaktheslaier",
            "body": "It is fucking disgusting to see people celebrating this. 80% of victims of landmines from 1999 to 2023 were civilians, 42% of which were children. This is a war crime",
            "score": -11,
            "replies": [
                {
                    "author": "dreamrpg",
                    "body": "And 99% of victims of nukes were civilians. Probably everyone except from Russia should abolish nukes.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Random_Fluke",
                    "body": "Too bad Russia was never part of the Convention.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Jaktheslaier",
                            "body": "Is Russia and the USA the standard you want to emulate?? (The international monitor for the use of land mines has also identified their use by Ukrainian troops btw)",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "Random_Fluke",
                                    "body": "Are you crazy?  \nRussia is the enemy we are likely to face. Should we handicap ourselves and lose our independence because of 'muh morality'?  \nThey don't care about conventions and break those they are part of. If we are to face them, we must have same weaponry at our disposal.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Jaktheslaier",
                                            "body": "My morality is an indiscriminate weapon of war that targets a large majority of civilians, not troops. 80% of victims are civilians, a large number of that are children. Is that who you intend to target in Poland or are you too stupid to understand the implications of spreading this kind of weapon in your territory?\n\nRussia is the enemy we are likely to face? When the fuck are you likely to face them?? It took them 3 years to not even get close to a full overtake of the Donbass, wtf are you talking about",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Jaktheslaier",
                                                            "body": "Is there a any cognitive reason why you are not understanding that only 19% of victims are military?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Particular-Star-504",
            "body": "And people said remilitarisation will make the world a fundamentally worse place. We’re only going to do these inhumane things to the bad people, are they even people?",
            "score": -3,
            "replies": [
                {
                    "author": "FML712",
                    "body": "Nice nazi take",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Particular-Star-504",
                            "body": "I’m not the one reintroducing inhumane weapons",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "FML712",
                                    "body": "If that’s everything you need to justify the deny of humanity to people, great",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Particular-Star-504",
                                            "body": "Sarcasm really is dead on the internet. \n\nI do not support this action. But its popularity is because a lot of people here don’t accept the humanity of Russians and are happy to use these weapons in them.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "AiAiKerenski",
                                                    "body": "Russians themselves are using anti-personnel mines in Ukraine as of this moment. We have every right to use mines for our protection, and I have easy solution how every Russian can avoid those mines: Don't try to invade our lands!",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Particular-Star-504",
                                                            "body": "Well if they’re doing it, I guess it’s okay. As they say about WWI, the problem wasn’t that both sides lowered themselves to fight the most depraved war in history, it was that Germany started it. \n\nAnd these treaties are really good to have, because they make us feel good. But we can (and do) just abandon them if we don’t feel like following them.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "AiAiKerenski",
                                                                    "body": "We at least gave it a chance; Russia didn't. Nobody likes the use of mines, but the security it brings to large border nations compared to risks is exchange we are willing to make.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mader_Levap",
                    "body": "Germans in 1939 were bad people. Russians are bad people now (and in past, but that's not important right now).\n\nCry more.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Particular-Star-504",
                            "body": "But do you not think their use of inhumane weapons (like land mines) is a reason why they are bad. And us abandoning treaties makes us bad (not as bad but still worse)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "New_Elephant4035",
            "body": "A connected mine system step on one and it blows all of them up I wonder if that's a good idea",
            "score": -9,
            "replies": [
                {
                    "author": "skyturnedred",
                    "body": "That would just waste a shit ton of mines for no benefit.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "New_Elephant4035",
                            "body": "Possibly but there's lots of variables",
                            "score": -5,
                            "replies": []
                        },
                        {
                            "author": "skyturnedred",
                            "body": "Reduce those variables to only account for plausible scenarios and you'll have your answer.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "New_Elephant4035",
                            "body": "Well my scenario was there's a whole army walking through a mine field",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "GrandAdmiralSnackbar",
                            "body": "Not how it works. The minefield would detonate once the first few guys are inside, most of them would still be outside the minefield.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "New_Elephant4035",
                            "body": "Of course ! The grand admiral knows best !",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GrandAdmiralSnackbar",
                            "body": "Thanks, but my capabilities are generally more in line with the second part of my username than the first ;-)",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "skyturnedred",
                            "body": "That's why armies march in columns.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "stormwave6",
            "body": "Most casualties (85%) from landmines are civilians all this is going to do is kill their own people.",
            "score": -9,
            "replies": [
                {
                    "author": "Aqua_thehunter",
                    "body": "Oh shut it what would you think if it was your country in a close proximity to a state that's a warmonger.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "stormwave6",
                            "body": "Those landmines are going to kill a lot of people most of them civilians.",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "Aqua_thehunter",
                            "body": "This is not an answer to the question.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FML712",
            "body": "I hope all you war mongers will have to go to war!!!!",
            "score": -19,
            "replies": [
                {
                    "author": "Random_Fluke",
                    "body": "It's a defensive weapon, you knucklehead!",
                    "score": 13,
                    "replies": [
                        {
                            "author": "FML712",
                            "body": "Like after WW2 where almost 15k people got killed or injured in Poland? In my hometown are walls with holes telling you some stories about kids with no legs. Ukraińcy czekają na twoją pomoc!!!",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "Random_Fluke",
                                    "body": "The alternative is to fight a war with an opponent which uses landmines and was never part of the treaty.  \nSo you will have both maimed children and no independence.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "FML712",
                                            "body": "Oh sorry didn’t know war is the only language we talk nowadays",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "MAGNVS_DVX_LITVANIAE",
                                                    "body": "Nobody chooses to get invaded.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "FML712",
                                                            "body": "No but looks like your alleys decide if you are going to talk or die",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "MAGNVS_DVX_LITVANIAE",
                                                                    "body": "We're actually in charge of the EU's defence and foreign policy.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Random_Fluke",
                                                    "body": "Yes. Apparently you didn't know that Russia is waging an aggressive war in Europe right now and openly threatens the sovereignty of several states, Poland included.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "FML712",
                                                            "body": "Like with the rocket from Russia that hit Poland which was after months cleared as Ukrainian wrong fired rocket? Did Russia ever said there is a problem with us? I don’t think so but if you want to become the propagandad frontline for Germany please go on",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Random_Fluke",
                                                                    "body": "It was a flak missile that failed to self-destruct. It wouldn't be ever fired without Russia bombing Ukrainian cities. And yes, there are also Russian missiles that hit Poland, something you conveniently forget.\n\nAs to Russia questioning Polish sovereignty, they literally say this on their state media. [https://www.newsweek.com/putin-ally-threatens-destroy-poland-1872956](https://www.newsweek.com/putin-ally-threatens-destroy-poland-1872956)\n\n\\>  for Germany please go on\n\nLiterally unhinged.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FML712",
                                                                            "body": "Nice, had the same one over here at Germany „regarding an close one of Putin he is willing to destroy Germany“. I recommend you reading gustave le bon… \n\nAnd pay attention, maybe your Russian neighbors are sleeping cells have a great time at fighting",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuperCl4ssy",
            "body": "Puccis",
            "score": -7,
            "replies": []
        },
        {
            "author": "saturdaybinge",
            "body": "While I get that they want to make available all the means to defend themselves, I don’t think we should lose sight of why this convention exists. Mines create problems for decades after the conflict is over and they can result in civilian casualties. Just look at Cambodia - they are still working on removing mines from the conflict and genocide that took place in the 70s and 80s. That’s more than 40 years of demining efforts. \n\nSo I don’t see this withdrawal as a net positive but, of course, it’s up to these countries to choose how to defend themselves.",
            "score": -2,
            "replies": []
        },
        {
            "author": "pigusKebabai",
            "body": "They really care about human rights.",
            "score": -2,
            "replies": []
        },
        {
            "author": "humanitarpolitik",
            "body": "Fuck no",
            "score": -10,
            "replies": []
        },
        {
            "author": "GewoonFrankk",
            "body": "It's so disappointing to be a European in this day and age. We are supporting a regime that's actively performing an ethnic cleansing, we are supporting literal terrorists that are terrorizing Syria as we speak. We are undermining our economy to build a European military complex as fast as we can. We are being ruled by unelected bureaucrats that undermine the sovereignty of European nation states. The amount of propaganda that's flooding Europe would have made goebbels proud. The crazy part of it all is that the majority of the population thinks we are \"the good guys\".",
            "score": -12,
            "replies": [
                {
                    "author": "LetterheadOdd5700",
                    "body": "Comments like that would make Goebbels proud.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "GewoonFrankk",
                            "body": "Comments that criticize the regime? He would downvote them and cesor if he could...",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prior_Association602",
            "body": "This is about to get really bloody",
            "score": -5,
            "replies": []
        },
        {
            "author": "HanshinWeirdo",
            "body": "I see we've returned to the Cold War era magical thinking that somehow a NATO-Russia war wouldn't go nuclear.",
            "score": -5,
            "replies": []
        },
        {
            "author": "MAGNVS_DVX_LITVANIAE",
            "body": "Thinking you'll somehow be able to [convince France](https://old.reddit.com/r/europe/comments/1jdzzl1/starting_today_lithuania_latvia_estonia_and/mies33l/) to nuke Moscow for invading Lithuania is the magical thinking bit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dry-Broccoli-638",
            "body": "Spreading democracy with cruelty for the win !",
            "score": -43,
            "replies": []
        },
        {
            "author": "somerandomfuckwit1",
            "body": "Yeah russian invasions are known for their civility",
            "score": 31,
            "replies": []
        },
        {
            "author": "rspndngtthlstbrnddsr",
            "body": "because mines surely are used when going on the offensive lol",
            "score": 11,
            "replies": []
        },
        {
            "author": "ionoftrebzon",
            "body": "I understand the need for security but let's not revert back to the middle ages. Or at least try not to.",
            "score": -33,
            "replies": []
        },
        {
            "author": "Mr_Black90",
            "body": "There isn't any realistic alternative for preventing large groups of Russian soldiers from overrunning the Baltics and Poland though. Cluster munitions would also be useful in this regard. Allowing your civilian population to come into contact with the invading Russians would cause far more deaths and injuries, not to mention the end of Estonia, Latvia and Lithuania as sovereign countries. There just isn't any other choice.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Random_Fluke",
            "body": "Sure, just go and convince Russia to stop their aggression.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lucky-Moose-8852",
            "body": "There was no anti personnel mines in medieval",
            "score": 1,
            "replies": []
        },
        {
            "author": "MariusBerger832",
            "body": "Fine, but Europe better stop moral judgement on others. ….",
            "score": -5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -35,
            "replies": []
        },
        {
            "author": "Niosus",
            "body": "Ah yes, the land mine. The pinnacle of offensive  weaponry. This is the final piece of the puzzle NATO needs before its grand invasion of Russia!\n\n... Seriously?",
            "score": 24,
            "replies": []
        },
        {
            "author": "uaisidi",
            "body": "Hey, what language do you want to speak, american or russian? 'Cause you're gonna speak either one of these languages",
            "score": -36,
            "replies": []
        },
        {
            "author": "EvilFroeschken",
            "body": "You don't have your own language. It's English.",
            "score": 24,
            "replies": []
        },
        {
            "author": "uaisidi",
            "body": "Yes, we have. The french speak french, the british speak british, the germans speak german, the russians speak russian, the argentinians speak argentinian, the brazilians speak brazilian. Americans speak american.\n\n\nGood, I see that you already speak american.",
            "score": -33,
            "replies": []
        },
        {
            "author": "Glorx",
            "body": "Lmfao, it's a rare sight to spot so many errors in one sentence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpudroTuskuTarsu",
            "body": "Argentinians speak Spanish althoughbeit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Judazzz",
            "body": "Americans speak Simplified English. It's comparable to primary school English lessons, but with less syllables.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Niosus",
            "body": "Says the Romanian. I have nothing against your country, but when push comes to shove, you'll be speaking Russian long before I will. Maybe we should stop the Russians before that happens, hmmm?\n\nAnd you can simp the US all you want, but they wouldn't even allow you to live there right now.\n\nSo you can choose between Romanian and Russian. Your move.",
            "score": 8,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -7,
            "replies": []
        },
        {
            "author": "_rand0mizator",
            "body": "Go baltic tigers! Put mines all over you border! Oops, there is only 15 left? No problem you citizens will pay for it, instead of food!",
            "score": -15,
            "replies": []
        }
    ]
}