{
    "title": "İstanbul University has revoked the diploma of Mayor Ekrem İmamoğlu, a move that could prevent him from running in Turkey’s next presidential election scheduled for 2028.",
    "author": "triple7freak1",
    "subreddit": "europe",
    "rank": 5,
    "score": 4003,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 265,
    "url": "https://i.redd.it/dz6ujozw1hpe1.jpeg",
    "id": "1je8iqj",
    "selftext": "",
    "comments": [
        {
            "author": "AccessModifier",
            "body": "Here is your full dictatorship! Idk what else has to happen for us to protest. Erdogan went crazy and now forbidding people’s right to vote for someone who is eligible for presidency. They really afraid of whats coming!\n\nFunny thing is: Erdogan doesnt have a diploma yet he questions others lol.",
            "score": 500,
            "replies": [
                {
                    "author": "Merochmer",
                    "body": "Dictatorships are outdate since the end of the cold war. Authoritarian regimes is what I would call Turkey. There are elections but the opposition is given disadvantages making it almost impossible to win.\n\n\nThis is what I think Trump/Vance is aiming at achieving in the US.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Only-Dimension-4424",
                    "body": "He has it from Marmara university",
                    "score": -181,
                    "replies": [
                        {
                            "author": "No_Holiday_5717",
                            "body": "You can also fake a diploma for yourself from Marmara University. It just takes a monthly subscription of Photoshop.",
                            "score": 101,
                            "replies": [
                                {
                                    "author": "Only-Dimension-4424",
                                    "body": "Sure🤣",
                                    "score": -111,
                                    "replies": [
                                        {
                                            "author": "Einzigezen",
                                            "body": "Everybody knows Erdoğan doesn't have a university education. He simply didn't take one. İmamoğlu himself mocked him saying that I can meet any one of my University friends right now but can Erdoğan do that lol.",
                                            "score": 80,
                                            "replies": [
                                                {
                                                    "author": "Only-Dimension-4424",
                                                    "body": "Doubt that , then why nobody cannot prove he has not ? Or his university?",
                                                    "score": -93,
                                                    "replies": [
                                                        {
                                                            "author": "No_Holiday_5717",
                                                            "body": "Non-existence of something is not proved. If you claim that something exists, you are obligated to prove it.",
                                                            "score": 37,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "AcadiaAccomplished14",
                                                            "body": "Ooh, this is a good one! I actually just proved he doesn’t have a degree. See? _________ that’s his lack of a degree right there. Now you prove he has one, or else he doesn’t have one.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Orshabaalle",
                                                                    "body": "Smartest turk",
                                                                    "score": -6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "magic_Mofy",
                                                            "body": "Prove to me that there is no tee cup cloating around the sun",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AccessModifier",
                            "body": "If you believe it I have a bridge to sell for you, are you interested?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Only-Dimension-4424",
                                    "body": "Nah, I don't have that much money",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "berkcokol",
                                            "body": "That is also because of erdogan hahahah",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Expensive_Use_5453",
            "body": "I hope Europeans take this seriously. I can see that due to the strength that Turkey brings to NATO, there is a significant imperative to appease the Turkish president at the moment. There are even talks about Turkey's EU ascension although there have been no progress made regarding the last remaining two chapters, and significant backsliding over the last decade. \n\nThis is the part where your governments can apply pressure. This is R. Erdo claiming himself dictator for life. If there is international pressure added he'll just rescind the decision by order to the higher court in the appeal process. If anyone thinks there is any actual legal basis for the current decision, I have a bridge to sell you.\n\nI understand the predicemant that western governments face. You can't openly protest this course since you don't want Turkey moving towards Russian influence. I just hope that a deft and effective course of action is thought of.",
            "score": 846,
            "replies": [
                {
                    "author": "ProtoplanetaryNebula",
                    "body": "Hopefully Turkey never joins the EU. It would be like Hungary on steroids and with 8.5X the population.",
                    "score": 436,
                    "replies": [
                        {
                            "author": "CastielTM",
                            "body": "Whether Turkey joins the EU or not, do you want a democratic country on your border or not, that's the whole point.",
                            "score": 170,
                            "replies": [
                                {
                                    "author": "ProtoplanetaryNebula",
                                    "body": "Yes, 100%.",
                                    "score": 71,
                                    "replies": []
                                },
                                {
                                    "author": "BeneficialClassic771",
                                    "body": "yes but what can the EU do anyway? Only the people of Turkey can make that change\n\nIf the EU had this magic power of turning rogue countries into democratic ones we wouldn't have these problems with Hungary and Slovakia\n\nRight now in all European countries there are wanna be dictators working overtime to seize power and destroy our democracies so Europeans already have a lot to deal with",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "CastielTM",
                                            "body": "Tell your friends, your mothers and fathers about us, tell them that there are people among the Turks who believe in democracy and that they should be supported.\n\nYes, maybe this will not happen in one day, but it will have an effect in the future. This is not a big deal, just awareness and a good start.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Hitchhikerdave",
                                            "body": "The EU needs to participate in the hybrid war. Dedicste funda and manpower into media warfare and trying to get the information and opinions to the people.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DependentEbb8814",
                                    "body": "I've always said this but not many people want to hear it. Whatever happens here in Turkey will influence things in Europe. We're positioned at the butt of it right now. Imagine how bad your life would be if your butt wasn't healthy. Well, it is sick and dying right now.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "edparadox",
                                    "body": "Understand now why the whole \"Turkey replacing the US for the EU\" sounds like?\n\nAs Europeans, we were already worrying about Turkey not being democratic, and it's not really that worse since the announcement of this post.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Expensive_Use_5453",
                            "body": "I just want Turkey to keep progressing toward the EU ideals. I don't care if we ever join the EU as a member state. That is not going to happen with the current regime. We've been regressing for two decades now.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "No-Advantage-579",
                                    "body": "I am old enough to remember when Turkey joining was seriously discussed and prepared for. :( And now... I just spoke to Turkish political refugees (who have asylum in another country).",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Athalos124",
                            "body": "A democratical Turkey is a good asset to the EU.So never say never.But it's definitely gonna take a while.",
                            "score": 80,
                            "replies": [
                                {
                                    "author": "Tricky_Big_8774",
                                    "body": "This post is starting to sound like a CIA planning meeting.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "SirDancealot84",
                                            "body": "*Perhaps*",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "janesmex",
                                    "body": "It definitely needs to make major reforms.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "thisisanewworld",
                                    "body": "Islam and democracy, good luck.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Hmk815",
                                            "body": "Then we just ditch islam.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mithrantir",
                                    "body": "Turkey will never be a member of the EU. Neither party really want that to happen. For a variety of reasons from each side. \n\nBoth parties would prefer the special relationship status that exists today, with changes of course (each side has different wants from this relationship).",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Over_Variation8700",
                            "body": "Turkey has 8,5 times more population than Hungary, not only 3,5",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ProtoplanetaryNebula",
                                    "body": "I went to the trouble of working it out on the calculator, then I hit the 3 instead of the 8 on the keypad :)",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "R_Morningstar",
                            "body": "It will not be under Erdogan. He thinks that he will force/blackmail the way into EU ... that is reason why is Turkey stuck like 20 years or more in assention phase. When they meet criteria for entry ... there wouldnt be a problem ... most things holding Erdogan in power are thing that Turkey need to get rid off to be enable to enter EU",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "TechnicalyNotRobot",
                            "body": "3.5x? Dude. 9x.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ProtoplanetaryNebula",
                                    "body": "It's 8.5X. I mis-typed the 3 instead of an 8 :)",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MasterBot98",
                            "body": "Heeeey \\*aggressively waves hand in the distance\\*.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Magdalan",
                            "body": "Nah, they won't. We've made a mistake with Hungary (really, we were warned beforehand but believed they would turn around) Turkey won't get in as long as Erdo and his ilk are at the helm.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ProtoplanetaryNebula",
                                    "body": "Really all EU member states need to be bound by EU law to three term maximum for any leader. Having term limits limits the ability of a state to have a dictator.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mowitz182",
                            "body": "It will never join the EC as it is today",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HammerTh_1701",
                            "body": "Turkey only is in NATO because it controls the Bosporus. If it wasn't for that, Erdogan would have been kicked out of any international cooperation long ago.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "turkish__cowboy",
                    "body": "On the contrary, I believe EU should declare its solidarity with the Turkish opposition. Closing the doors would only help Erdogan pave ways to autocracy and demotivate Turkish liberals/social democrats.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "27Rench27",
                            "body": "Of course, with the US expected to run away from NATO in the near future (or at least not be trustworthy), pissing off Turkey via EU actions could actually damage NATO indirectly. \n\nTurkey’s got a strong strategic position in that alliance, and they’re absolutely no friend of Russia (only NATO country since Korea to actually shoot down a Russian fighter instead of just scaring them off)",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "freudsdingdong",
                    "body": "If Europe does not take this seriously they will have to deal with Erdoğan for the next \\~2 decades, instead of a pro-eu democratic and secular leader. \n\nErdoğan knows the EU will overlook his authoritarian acts in return of support against Russia. This decision will bite them badly.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Consistent-Primary41",
                            "body": "91yo Erdogan sounds pretty bad.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mithrantir",
                    "body": "What exactly are you hoping that Europe (or Europeans) will do, for a subject that is clearly internal to Turkey?\n\nWhat does the \"international pressure\" means to a country and a political system and mindset, that prides itself on carving their own way despite what the rest of the world thinks or says?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Complex-Flight-3358",
                    "body": "Turkey can be a perfectly fine member of NATO or any other military alliance. But being a member of the EU is much more than that. And I m not sure the Turkish people even want that or are willing to make and uphold the reforms needed to achieve that.\n\nAlso, if you are disgruntled by Hungary lately, imagine the amount of trouble Turkey could cause in the parliament, which they d totally dominate due to their population...",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SeveralLadder",
                    "body": "See all the protests with millions of people in the streets around European countries backsliding on democracy? This is how you'll have a chance of getting into E.U. The people has to make a stand when politicians are destroying their dreams.\n\nYou won't get into E.U. until you are democratic and corruption free. That is the job the people of Turkiye has to do *before* membership is on the table, not hoping to fix it *after* you get access. E.U. don't need another corrupt wench-thrower, and should in fact be harsher on democratic backsliding than it has been so far. The \"nuclear\" option should be used sooner.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Nerubim",
                    "body": "Reminds me of Moclans tbh..",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Arthur-7",
                    "body": "USA should be EUs first priority",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Prince_of_DeaTh",
                    "body": "It's a game of politics, Europe can't really argue with Turkey the country is too important",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Visible-Rub7937",
                    "body": "Nah. They wont care as long as its Erdogan and not Bibi",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Aiti_mh",
                    "body": "It's a perfect dilemma, yeah. This could be a pivotal moment to save the democratic tradition in Turkey, but we need Turkey more than ever to lean towards us. We're not in a position to turn away friends, even shitty ones. Impossible to say which is the right call for the 'greater good' so I'm inclined to accept whatever path the EU embarks upon here.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "mowitz182",
                    "body": "We know! We don't need people from the us to tell us that!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "molym",
            "body": "This is a new low from Erdogan.\n\nHe is taking advantage of the recent democratical crisis in the world and trying to pick his own \"rival\".\n\nIf this is not overruled by the higher court, Turkey is cooked. You can paint it red on the democracy map.\n\nI am hopefull it will be overruled but who knows, the world is a shitshow nowaday.",
            "score": 98,
            "replies": [
                {
                    "author": "Armation",
                    "body": "turkey is already cooked.  \nThe question is of what \"doneness\" they want to be  \nAnd it's looking like it's \"well done\"",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Broqueboarder",
            "body": "Why do you need a diploma to run for office?",
            "score": 100,
            "replies": [
                {
                    "author": "the_law_potato2",
                    "body": "Presumably it was introduced in order to have candidates that have a certain level of academic qualifications. Admittedly requiring a degree in order to run for office is somewhat rare, exceptional, but this sort of requirements are not as uncommon as you might think - the most common requirement is age. Very few countries do not have a requirement of minimum age for the office of president, and more often than not senators as well. This is introduced on the presumption that having a certain minimum age also ensures a certain level of maturity, knowledge and experience from the candidates. Both requirements are made with a similar objective in mind, both are debatable in terms of being useful in achieving their purpose.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "Broqueboarder",
                            "body": "Goal is to have educated candidates but reality is this allows incumbent to remove a degree and thus remove a conpetitor. Law of unintended consequences.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "Notrx73",
                                    "body": "Sadly I think that even if this law did not exist, you'd still have infinitely many ways to prevent someone from running for president.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Born-Network-7582",
                                            "body": "So, what is wrong with a proper defenestration? /s",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Junglepass",
                            "body": "He should get an online degree by that time.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Einzigezen",
                    "body": "I don't know I'd say there shouldn't be because Erdoğan himself doesn't have a diploma (apart from a fake one, that is)",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Exizal",
                    "body": "According to the Constitution, the President must be a university graduate",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "RedstoneEnjoyer",
                    "body": "This was from time when Turkey was parliamentary republic - president was just symbolic position and the idea was that they should have some level to education as symbol of state.\n\nBut then 2016 happened, Turkey became presidential republic and this part of law is still in the books",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "glaucusb",
                    "body": "Well, this position, presidency, was a ceremonial role. Although the president has a lot of powers, they were not part of the government and the expectation was being a figurehead and act politically. They were elected by the parliament for a longer term (7 years) than the parliament (5 years). Prime minister in old Turkish political system was the head of the government. \n\nAfter the changes in constitution, the prime minister role has been removed and president become the head of the government and the state. President elections are also started to be done directly. While doing these changes, for some reason, they didn't touch this law.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MrAlagos",
                            "body": "> for some reason\n\nWe have now learned the reason.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "glaucusb",
                                    "body": "It was long time ago and I don't think they have capacity to plan something like this. The reason they might not touch this law is because there is a rumour/fact that Erdogan has never got a higher education degree. If they tried to change it, Erdogan might have been accused of lying etc by the opposition parties.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MusicAccomplished161",
                    "body": "to block working-class people to ever ascend to power and keep the status quo",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheoremaEgregium",
                    "body": "Probably so that a thing like this can be done.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Conversation_9325",
            "body": "He has enough time to speed graduate from another university",
            "score": 63,
            "replies": [
                {
                    "author": "kingofthecanyon",
                    "body": "Only for it to get revoked",
                    "score": 44,
                    "replies": [
                        {
                            "author": "No_Conversation_9325",
                            "body": "EU won’t get any closer like this",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "TatarAmerican",
                            "body": "They'd shut the whole university down, I'm not even kidding",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Agitated-Donkey1265",
                                    "body": "Does it have to be a degree from Türkiye, or would one from another country count under the law currently?\n\nOf course, that doesn’t preclude attempts to change the law in the meantime",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TatarAmerican",
                                            "body": "I believe the whole issue with his diploma was that he transferred to Istanbul University from a university in (ironically) Northern Cyprus and this particular university in Cyprus was not accredited by the Turkish authorities at the time of his transfer. \n\nSo long story short, yes a degree from a foreign country is acceptable so long as Turkey accredits that university's degrees.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "sp7ctre",
                                            "body": "Erdogan currently has to power to revoke someone’s birth certificate and make that said person has never existed,so anything is possible.\n\nthey would probably pass a law making that foreign university diplomas can’t be \ncounted\n\nwhich would also mean that the next likely Akp candidate after erdogan, Foreign Minister Hakan fidan (also ex intelligence chief) wouldn’t be able to enter the election since his diploma is from University Of Maryland.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "dozerman94",
                                            "body": "It doesn't need to be a Turkish degree, but you need to get a certificate of equivalence from YÖK (Council of Higher Education) to officially recognize a foreign degree in Turkey. YÖK is a government organization, it's president is appointed directly by Erdoğan himself, so good luck with getting that certificate.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TurkicWarrior",
                            "body": "Not if he gets his diploma from aboard.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ExAmerican",
                    "body": "Does his degree have to be from a Turkish university? Every university in Europe should grant this guy a degree if not.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Lifedealer999",
                            "body": "they'll just pass a law that dictates that the candidate has to have a diploma from turkey, boom. easy fix for them",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No_Conversation_9325",
                            "body": "No idea",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sertack",
                    "body": "There will be early elections at the end of this year or at the beginning of 2026. If there are no early elections, Erdoğan cannot be a candidate according to the law. So an early election seems almost certain.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "ShitassAintOverYet",
                    "body": "Not really.\n\nFor presidential bid, 4-year college education and bachelor's degree is needed. Next election is in 2028 with very likely early call around 2026 or 2027.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No_Conversation_9325",
                            "body": "Well, bye EU then, I guess",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trollercoaster101",
            "body": "It became clear Erdogan was a dictator after that failed coup in Turkey a few years ago. Although he claimed it was his opponents trying to overthrow him, no one will ever convince me that he didn't stage it himself to erase his political opponents and deepen his chokehold on Turkey.",
            "score": 34,
            "replies": [
                {
                    "author": "Jaded_Veterinarian15",
                    "body": "> after that failed coup\n\nBefore\\*\n\nHe has been purging the army and jurisdiction since late 2000s, he just didn't have that much power yet.\n\nAlso as much as I hate Erdo, Gulenists were a real threat to Turkey but it was he himself who made them that powerful.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Einzigezen",
                    "body": "It was another radical political islamist faction that infiltrated the army thanks to erdoğan. Although they were his boys once and he probably got the knowledge of the coup beforehand and let it play out with his measures in place, so you are probably right.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "CastielTM",
            "body": "The reason for all this is that the recent conjuncture events and the weakness of democratic countries in the world have paved the way for autocrats to turn into dictatorships. I think especially us's anti-democratic movements have a great impact on this. Because since Trump was elected, they started making incredible anti democratic decisions.",
            "score": 174,
            "replies": [
                {
                    "author": "Areilyn",
                    "body": "You could argue that it had an effect but let's be honest, Erdo would do this regardless if he felt threatened because:\n\n1-) He's fucking stupid and doesn't realize events like this helped pave the way for his presidency back in the day.\n\n2-) The system allows him to. Because there's hardly any system now. Thank you 2017 Referendum voters, be proud of your masterpiece.",
                    "score": 79,
                    "replies": [
                        {
                            "author": "TXDobber",
                            "body": "Is there really any recourse for İmamoğlu? It seems like Erdogan owns the courts, and there’s nothing anybody can do.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Areilyn",
                                    "body": "I'd normally expect him to backtrack out of fear if there's enough public backlash, but just the fact that it had come to this means he feels like he's backed into a corner. And when wild animals are backed into a corner...",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "AdonisK",
                                    "body": "If he were to give up, it’d be when he got sued for “swearing”/badmouthing at Erdogan. He is still in court because of it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fragile_Graces",
                    "body": "Yup, add that also the fact that Europeans can't and won't say shit now since they essentially need Erdogan for EU's security.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "AlcoholicCocoa",
                    "body": "Erdogan had his lackeys installed in many positions way earlier. Extra3 called him the least successful autocrat in history",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TatarAmerican",
                    "body": "Took only 30 minutes for someone to blame America lol",
                    "score": -3,
                    "replies": [
                        {
                            "author": "CastielTM",
                            "body": "When the one of most powerful country in the world completely changes ideology and sides in a few months, its impact is naturally felt everywhere.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "kazinski80",
                                    "body": "This has been going on since Erdo took office. We can’t distance ourselves from the US for moving towards dictatorship while embracing a country that is and has been a dictatorship for years. That’s just ethically inconsistent. Democracy and civil rights should be put before all else",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TatarAmerican",
                                    "body": "Appreciate the compliments, but Turkey has been an authoritarian state since its inception. It's just the ideology of those who are in power that changed in the past 20 years.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CastielTM",
                                            "body": "True, authoritarianism is common in our history, but it has never been a dictatorship. It looks like we're on this way..",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Einzigezen",
            "body": "He was already the official fucking presidential candidate. This is huge.",
            "score": 26,
            "replies": [
                {
                    "author": "AdonisK",
                    "body": "And yet nothing will happen",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hikashuri",
            "body": "Very simple, force Erdogan to undo his influence here, or permanently close talks for the EU ascension. We would like to have Turkey, but we don't really need them at all, they are more likely to need us for prop up their economy, their defense and all that.",
            "score": 67,
            "replies": [
                {
                    "author": "alkbch",
                    "body": "Turkiye knows EU membership is off the table, that ship has sailed.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Final_Part9508",
                            "body": "with erdogan we propably wont, without erdogan we would",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "swumpinator",
                                    "body": "No it wouldn't, and there is no use pretending that it is not the unequivocal sentiment on the ground. Whether conservative or not, most of the population does not feel the EU is an alliance of ideals, just an economical and cultural one. By extension, there are a lot of voices that believe Turkey would be admitted if they succeeded in 50 of the 35 chapters required.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "theRealestMeower",
                                    "body": "You’re always going to be outsiders to Europeans. Theres the religon thing which is one thing but the other is culture, economy and simply size. \n\nThere are always going to be many countries vetoing Turkey. And frankly the whole North Cyprus thing is already something that makes it a nonstarter.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "badbas",
                    "body": "EU just helped Erdogan's political agenda for years. Please leave it to Turkish people. Leave it to opposition to approach EU for help.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Final_Part9508",
                    "body": "i agree with economy but defense??",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Calm-Bell-3188",
                    "body": "Just Economy. Turkey has a huge army and it's battle trained.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ale_93113",
                    "body": "Punishing the whole country, who is already suffering enough for his acts is not the way, hurt him and his party in other ways, consider them a terrorist party for example and stuff like that",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AlcoholicCocoa",
                    "body": "Erdogan doesn't really care about entering the EU at all, he often uses it as a pawn to garner more votes",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ImpressiveDaikon6140",
                    "body": "\"we would like to have turkey\"\n\nSpeak for yourself thanks. Fuck that.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bar50cal",
            "body": "A Greek university should give him a degree to replace the one taken away just because it would be so damn funny",
            "score": 12,
            "replies": []
        },
        {
            "author": "Exizal",
            "body": "Erdogan ended his own reign with this, there will be more support for next candidate because of this",
            "score": 32,
            "replies": [
                {
                    "author": "AccessModifier",
                    "body": "Congratz for 30 years CHP regime",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Athalos124",
                    "body": "I feel like I have been hearing the sentence \"Erdogan ended his own reign with this\" for a long-long time",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Exizal",
                            "body": "Ekrem was already winning against him, CHP’s other potential candidate had even more support than Ekrem already, and this will boost the support even further, basically Erdogan had no chance left in a democratic elections",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Futile-Clothes867",
                                    "body": "Do you think Erdogan would give up power if he looses at elections? It's possible that he will simply declare the opposition was cheating and the result of election will be cancelled. I would be surprised if a proper revolution would be needed to remove Erdogan from power.\n\nI'm afraid it will be the same in Hungary if Tisza party wins next year, so our eyes are on you. Keep strong!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Exizal",
                                            "body": "Well it is a possibility, we’ll see I guess, y’all keep strong too, good luck to Hungary with next elections!",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "AdonisK",
                                            "body": "He will but they will have to reach the point of actually getting to vote, Erdogan always finds a way to win even before that.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "n1ente",
                                            "body": "[Already happened.](https://www.nytimes.com/2019/06/23/world/europe/istanbul-mayor-election-erdogan.html) We'll see how far he goes this time.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Athalos124",
                                    "body": "I agree,the problem is how possible are the democratic elections considering moves like this?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Only-Dimension-4424",
                                            "body": "They are just dreamers, the person like him usually dies in office or extreme health conditions etc, otherwise no power to take out him office, he seen as like a holy saint by at least quarter of population",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pietroetin",
                                    "body": "Can't he just revoke the other candidate's diploma aswell?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Exizal",
                                            "body": "He can, but more he does that more votes he will lose so he is in kind of in a dead end, also he would be risking actual revolt so I don’t think he would do that",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TatarAmerican",
                    "body": "Controlled opposition is a hallmark of authoritarian regimes.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "FistyFistWithFingers",
                    "body": "Haha I know I've read this before",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Pozitox",
                    "body": "Abi , sonrakinede bir kazık atar büyük ihtimalle",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AdonisK",
                    "body": "Won’t believe it until i see it, y'all keep saying that and yet he keeps getting reelected",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Exizal",
                            "body": "In the last elections he got elected against the worst candidate of the opposition and it was almost 50/50, against Ekrem or Mansur (Other potential candidate) he have no chance thats also why he is so aggressive against them because he knows",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AdonisK",
                                    "body": "I’ll believe it when I see it, until then I’ll won’t believe it no matter how much I want to.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Exizal",
                                            "body": "Yeah, Erdogan will do anything to win so thats the best approach I guess",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "_Xcutionn_",
                                            "body": "The main outliner difference here is the fact that Erdoğan is trying to blockade Ekrem from being a candidate. This never happened before.  It basically means Erdoğan knows he's gonna 100% lose if Ekrem antoganizes him in next elections. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sweaty-Wing_Is_Back",
            "body": "Can't EU just handle him an Honorary Degree? Brazil's President Lula was given one as honoris causa on French Political Sciences School on Paris.\n\nDon't ask me why though. But since a paper with a name on it is what impeding forwarding democracy in Türkiye, even Cambridge could reach out.",
            "score": 8,
            "replies": [
                {
                    "author": "AdonisK",
                    "body": "And you think they won’t find another way to prevent him from running? They are already dragging him to court for example",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "No_Holiday_5717",
                    "body": "They can, but YÖK (Council of Higher Education) wouldn’t recognize it.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "triple7freak1",
            "body": "[Source](https://bianet.org/haber/istanbul-mayor-imamoglus-university-diploma-revoked-blocking-potential-presidential-bid-305543)",
            "score": 8,
            "replies": []
        },
        {
            "author": "Pristine-Bed7851",
            "body": "Dictators being dictators....seriously Erdogan, it's time to leave, otherwise you are truly on the wrong side of history along with Khamaneyi, Putin, Xi Jiping, Stalin, Asad, Saddam Hitler and all the other lots that FUCKED humanity. Leave mofo....",
            "score": 6,
            "replies": [
                {
                    "author": "Hmk815",
                    "body": "He has been on the wrong side of history since like, 2014.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "zhup3r",
            "body": "It's sad when some people think about them self that they are above the nation.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Due_Newspaper4237",
            "body": "Honestly, the EU will support Erdoğan. Right now, they are trying to maintain good relations with him, and don’t forget that it was the U.S. and the EU that helped bring Erdoğan to power in his early years.",
            "score": 5,
            "replies": []
        },
        {
            "author": "darkmoose",
            "body": "This is effectively a coup",
            "score": 6,
            "replies": []
        },
        {
            "author": "UnapologeticMeatball",
            "body": "That's actually bullish 🤣 this happened last time 25 years ago and erdogan was the victim. We all know how that turned out! 🤣",
            "score": 7,
            "replies": []
        },
        {
            "author": "idgaf_aboutyou",
            "body": "The European Union will not care, they are happy to shake hands with Erdoğan right now",
            "score": 21,
            "replies": []
        },
        {
            "author": "mariuszmie",
            "body": "What a dick move.",
            "score": 4,
            "replies": []
        },
        {
            "author": "kalbinibirak",
            "body": "Erdoganception.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ComplexLeg7742",
            "body": "One of the shitty actions stopping Turkey from joining EU.",
            "score": 5,
            "replies": []
        },
        {
            "author": "adamkorhan123",
            "body": "We need the support from the rest of Europe now more than ever. EU values and integration is everything this opposition leader supported and advocated for. The people are behind him. Instead of being pushed away the EU must show empathy and support for the opposition who upholds EU values and rule of law and advocates for personal freedoms. \n\nIf the opposition win it will be best case for europe and stability with Turkey.  \n\nwe are experiencing blatant silencing.",
            "score": 6,
            "replies": [
                {
                    "author": "iwannabesmort",
                    "body": "and if the opposition will lose it after EU throws their support behind them, we may lose an invaluable ally against Russia",
                    "score": 1,
                    "replies": [
                        {
                            "author": "adamkorhan123",
                            "body": "Does that make the EU a hypocrite? Seeing people oppressed and a candidate/gov trying to align with the EU values it says it holds dear? All at the expense of the citizens for some weapons??",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "motusubaru",
            "body": "And Europe still supports Erdogan.",
            "score": 3,
            "replies": []
        },
        {
            "author": "L0st_MySocks",
            "body": "Did you guys really think he is a good leader cause of the action against Trump and putin? cause he supported Ukraine.. For what? I bet it was the part of his plan.. I mentioned in my previous comments.. Ekrem needs a good support outside of Turkey..... He needs some good allies.... He can't win this race on his own..",
            "score": 4,
            "replies": []
        },
        {
            "author": "AlexTada",
            "body": "Does it have to be from a Turkish institute? Otherwise wouldn't it be incredibly cool if a university stood up and gave him a diploma? Preferably in something related to law or human rights.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Wunddorn",
            "body": "Can an European University gift him a honour Dr. title?",
            "score": 5,
            "replies": []
        },
        {
            "author": "TurbulentEbb4674",
            "body": "This is what happens when you compromise your values for security. You admit thugs like Erdogan into your circle because you’re too cowardly to do the hard work yourself. This is exactly how the mafia took control in Sicily in the 1800s.",
            "score": 10,
            "replies": [
                {
                    "author": "SuggestionMedical736",
                    "body": "I mean I don't know what you expect the EU or Nato to do. Kick them from Nato? And then what? Kick out the US as well? Then what use is the nato anymore? Not trying to justify the actions of that snake, but it's pretty easy to just scream kick them out without giving a reasonable alternative.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TurbulentEbb4674",
                            "body": "There’s a reasonable alternative. It involves taking the necessary measures to be self sufficient. It involves ending entitlements and social programs in exchange for national defense spending. Otherwise Europe will have to rely on being extorted by thugs.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SuggestionMedical736",
                                    "body": "I mean I agree to a point. But with limits. I do not think the treat is big enough to end things like free education and universal healthcare. The two most expensive social spending my country has.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TurbulentEbb4674",
                                            "body": "You can have universal healthcare and free education or you can be dominated by global powers. I think that’s what the current climate is showing us.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SuggestionMedical736",
                                                    "body": "I mean this sounds horrible, but if I had to pick between working with that asshole who is slowly becoming a dictator or giving up free healthcare and education. Il pick option two.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TurbulentEbb4674",
                                                            "body": "I think that’s a wise choice and the choice that the US has been trying to force Europe to make.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "opinionate_rooster",
            "body": "Erasmus students should start packing... Just in case.",
            "score": 3,
            "replies": []
        },
        {
            "author": "pepotink",
            "body": "Ah yes, the so-called Turkish Democracy",
            "score": 3,
            "replies": []
        },
        {
            "author": "EzmegaziS",
            "body": "dictatorship. As he gets older, he will become more and more crazier.",
            "score": 3,
            "replies": []
        },
        {
            "author": "amanilmeke",
            "body": "Turkey is a shit country..",
            "score": 7,
            "replies": []
        },
        {
            "author": "AdCurrent3698",
            "body": "The decision is not final yet but it is a very bad step. I doubt that the current government has the power to do it. We will see.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cathal1954",
            "body": "The first question is, how can an academic establishment arbitrarily revoke a qualification without stating the grounds and giving the victim an opportunity to respond?\n\nBut that aside, it is too much of a coincidence to believe that Erdogan had no part in it. This is a sneaky, illegal way for a head of state to behave and will undermine any claims Türkiye has to be a democracy",
            "score": 2,
            "replies": [
                {
                    "author": "nonstoptilldawn",
                    "body": "Erdo doesn't have a hand in this, he is the hand who did this.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "fido9dido",
            "body": "Can't a european university give him an honorary diploma, then he can elect himself? or will it be an espionage??",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Scheme-3759",
            "body": "Aah Democracy...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bollerkotze",
            "body": "Thats why turkey never get into eu, even if they now,again, seem to do stuff to please eu...and then be hurt in their \"honor\" when it doesnt work again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Emergency_Wolf_5764",
            "body": "More blatant totalitarian corruption from Erdogan, as usual.\n\nNo surprise.\n\nNext.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Emergency_Wolf_5764",
            "body": "More blatant totalitarian corruption from Erdogan, as usual.\n\nNo surprise.\n\nNext.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigTonyEnergy",
            "body": "Lol they gave him just enough time to get a new degree",
            "score": 2,
            "replies": []
        },
        {
            "author": "hmmmtrudeau",
            "body": "TURKEY does not belong in EU. They are corruption and EVIL",
            "score": 2,
            "replies": []
        },
        {
            "author": "Whiskeyinateapot0214",
            "body": "Wtf",
            "score": 2,
            "replies": []
        },
        {
            "author": "chunkykongracing",
            "body": "Erdogan is holding Turkey back. Dictator POS",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unhappy_Camp_6438",
            "body": "Does a diploma from a foreign university count? Ad honorem? Because it would be funny if, for example a German university gives one ad honorem to him to make him running for the elections.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mazza77",
            "body": "I do hope the EU sees this and blocks the dictators demand to join the EU ! Corruption (EU didn’t learn their mistakes with Serbia and Hungrary)",
            "score": 2,
            "replies": []
        },
        {
            "author": "koulibali",
            "body": "This all shows that AKP simply cannot turn things around anymore, they are cornered. Kemal Kılıçdaroğlu -who was a weak candidate- handed them a lifeline last time, next time they would have to resort things like this to prevail. Otherwise they are bound to lose. They have been losing for a while now, nearly a decade but opposition was not winning, that was the problem until now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RazvanTheRomanian",
            "body": "A revolution will begin soon în Turcia ;)",
            "score": 3,
            "replies": [
                {
                    "author": "RipTraditional4012",
                    "body": "our people is on the edge bro believe me you can sense the stress level by just walking in the country, everyone is unhappy and angry . people are gonna blow the fuck up the pallace.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scary_Profile_3483",
            "body": "Not quite ready to be a western country, I see",
            "score": 2,
            "replies": [
                {
                    "author": "Due_Newspaper4237",
                    "body": "Rather, it's no longer a modern and secular regime. Turkey never claimed to be Western.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "AdonisK",
                    "body": "They haven’t been that in 1-2 decades now, what y’all on about",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Scary_Profile_3483",
                            "body": "This makes me feel like they should probably be Byzantine again: Make Istanbul Constantinople Again",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "AdonisK",
                                    "body": "I wouldn’t go that far, but I’d love to see Greece and Turkey fix their relations and rebuild the East Mediterranean area again.\n\nThe Aegean Sea is truly a powerfully location.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Scary_Profile_3483",
                                            "body": "Too late!! MICA, baby!",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "arinc9",
            "body": "Am I the only one that is bored seeing the continuous stream of shenanigans coming from Turkey? Will it ever end?",
            "score": 1,
            "replies": [
                {
                    "author": "Due_Newspaper4237",
                    "body": "No.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "SecurityCouncilGuy",
            "body": "This is rather funny - doesn’t the number self lack a proper degree? Many claims he does not possess higher education himself",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm-Bell-3188",
            "body": "Looks sort of like what is going on at Columbia University in the US. I",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bantorus",
            "body": "What if a university from another country gave him a honorary degree?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheKasimkage",
            "body": "Taking a leaf out of Columbia University in America’s book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ledewde__",
            "body": "Well - he should be given an honorary doctorate from ,say , Sciences Po. I'm sure Macron can fix that up",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlcoholicCocoa",
            "body": "Aaaand I am not surprised at all about this and yet again I have to be proven wrong about wrs9gan ever losing to someone who's more open minded and less hyperfixated on his very own power.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Dovahzul-",
            "body": "[History repeats itself.](https://en.wikipedia.org/wiki/Recep_Tayyip_Erdo%C4%9Fan#External_links:~:text=Following%20the%201994,openly%20Islamist%20policies)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Rip-184",
            "body": "Dictator Erdogan",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThePartyLeader",
            "body": "So some other EU university needs to accept those credits and issue him a diploma.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hairy_Effect_164",
            "body": "I believee he can obtain one in occupied North Cyprus, recognized in Turkey, with a phone call, and the  businesswill be  solved.",
            "score": 1,
            "replies": [
                {
                    "author": "Hairy_Effect_164",
                    "body": "Apparently not, my bad.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "andresrecuero",
            "body": "I think he have a diploma of an European university. If not, give him at least one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "luphen90",
            "body": "What's the pretend reasoning behind this? Indulge me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patralgan",
            "body": "Seems a bit dubious",
            "score": 1,
            "replies": []
        },
        {
            "author": "JKthePolishGhost",
            "body": "Honest question: what if another institution conferred a diploma? Like, could Yale give him an honorary diploma and that count?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thunder_Beam",
            "body": "Isn't this 101 Russian strategy to block the opposition?",
            "score": 1,
            "replies": []
        },
        {
            "author": "typtyphus",
            "body": "The Turkish dictatür",
            "score": 1,
            "replies": []
        },
        {
            "author": "MinuteMotor5601",
            "body": "Proof that we need independence tribunals back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrestigiousWheel8657",
            "body": "Do this to trump now please. I can't handle it anymore",
            "score": 1,
            "replies": []
        },
        {
            "author": "homeinthecity",
            "body": "Honorary degree from an international institution incoming…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kofu",
            "body": "See, this is why I have that funny feeling when Turkey does good things. This is a reminder as to that funny feeling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "myhamsterisajerk",
            "body": "What happens to be the \"official\" justification for nullifying the diploma?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShitassAintOverYet",
            "body": "Fun fact: The statement is basically lawless.\n\n1- The dean and his board of directors made the decision. Actual authority to approve and revoke diploma is not on the dean, it's on the faculty İmamoğlu has studied...and the faculty refused to remove the diploma according to many sources including CHP itself. Lawyers already treat this statement as inofficial and no-effect.\n\n2- The reason to remove the diploma is fault during İmamoğlu's transfer from a different college. There is a set example decision for this same issue as daughter of a former defence minister transfered from studying biology at a foreign university to study medicine at best college possible in Turkey. Although her criteria didn't match the court has decided this mistake doesn't bind her as she studied and completed a 6-year education. İmamoğlu had the same path and had his diploma removed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alarmed-Alarm1266",
            "body": "With these governmental practices and policies they deserve a chair in the EU..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aexegi",
            "body": "Is this even legal to revoke diplomas? In my country only the court can do this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Skeng_in_Suit",
            "body": "Shit country ngl",
            "score": 1,
            "replies": []
        },
        {
            "author": "BarristanTheB0ld",
            "body": "Why does this prevent Imamoglu from running?\n\nEdit: No idea why I'm being downvoted, I was genuinely asking 🤷‍♂️",
            "score": 0,
            "replies": [
                {
                    "author": "dushmanim",
                    "body": "Cause in Turkey you gotta at least have a bachelor's degree in order to run for office",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "X-Q-E",
            "body": "romania level democracy right here",
            "score": 0,
            "replies": [
                {
                    "author": "iwannabesmort",
                    "body": "romania defended their democracy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nolaboy214",
            "body": "Did he legitimately attend the school and earn his degree?",
            "score": -1,
            "replies": [
                {
                    "author": "turkish__cowboy",
                    "body": "He did attend a university in Northern Cyprus, which receives no international accreditation. Then transferred to Istanbul University, but authorities question the one in Cyprus in first place. Turkey would even declare TRNC illegitimate just to eliminate him from elections.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "nolaboy214",
                            "body": "Okay.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Inevitable-Push-8061",
                                    "body": "He transferred to one of the most prestigious schools in Istanbul btw. Without scoring it in Uni exam. From a private University to a state university.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Einzigezen",
                                            "body": "You are utterly blabbering bullshit. The transfer was legal. It was first in February 2020 there was a complaint about Imamoğlu's diploma to CIMER. Istanbul University Rectorate itself explained that İmamoğlu applied for the quota for transfer abroad announced by the university and that his application was evaluated and accepted according to the relevant articles. The guy above is right, the transfer's legality is questioned based on the argument that YÖK (Turkish University Education Instutiton) didn't recognize the TRNC university back then. Not because \"he transferred from private university to state university without exam\" bullshit, he transferred according to all of what's written. Even according to countless lawyers  the University Board of Directors approved İmamoğlu's transfer to the English Department of the Faculty of Business Administration on the grounds that he met the grade point average and timely application criteria. TNRC University might not be recognized at the time but there are written criteria around that legalizes his diploma. There are countless other legit diplomas like his that are official. Go fuckj yourself.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Inevitable-Push-8061",
                                                    "body": "Then why was his diploma canceled? You are very angry, but it did happen!",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "Einzigezen",
                                                            "body": "Because of political reasons what else? Even the dean that stated his diploma is legit not too long ago was removed and replaced.",
                                                            "score": 9,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "AdonisK",
                                                            "body": "First time in Turkey?",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Qaantum",
                                                            "body": "The case was opened a minute after his lawyer gave the presidency application to the party. The board that was supposed to analyze the case prepared 200+ page case assigned 3 people, first one in November 2024. \n\nPlease guess how many days before findings of 200+ were presented the other two people were assigned to it? I will give you a hint after the breakfast, same day. Stop being a dumb person.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nolaboy214",
                                            "body": "Okay.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TechnicalyNotRobot",
            "body": "Yavas would be a better nominee anyways.",
            "score": -5,
            "replies": [
                {
                    "author": "Einzigezen",
                    "body": "I think there are problems regarding his bid. I think that's because the government acted this radical, Yavaş doesn't seem willing. Otherwise Imamoğlu wouldn't step this much up this early.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inevitable-Push-8061",
            "body": "Erdogan didn’t ban anyone—he can’t, as this is not a dictatorship. Presidential candidates are required to have a university degree. The opposition candidate has some confusion regarding his diploma.\n\nKeep downvoting for stating facts. This sub is insane if they think Erdogan can randomly ban opposition. Nope, Turkey is not there yet.\n\nThe said opposition candidate applies from an unrecognized private university in Northern Cyprus to one of the best schools in Turkey, in Istanbul, without even qualifying through the university exam. And it’s a state university, by the way. Why can’t regular people do this then? Sounds like corruption from the opposition, but I don’t know.\n\nIt’s a complex judicial process, and I respect that without insulting anyone. However, we can see other redditors level from the insults they use. The fact is that the opposition candidate lacks a university diploma obtained through the standard university exam, which the vast majority of ordinary people take. Instead, his situation is complicated. I’m not even claiming that he has no degree—I am simply trying to explain what’s happening objectively.",
            "score": -113,
            "replies": [
                {
                    "author": "lagash-nergal",
                    "body": "Dean of İÜ: \"İmamoğlu's degree is legitmate\"  \nA week later he is forced by gov. to resign.  \nA week later the new dean cancelles his diploma.\n\n>I don’t know.\n\nIf you truly don't know, go and read what Imamoglu's lawyers have said, but since you do know, fuck off propagandist.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Inevitable-Push-8061",
                            "body": "Imamoglus lawyers are defending him, that’s what lawyers do.",
                            "score": -8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Key-Mission7287",
                    "body": "Hi, I'm Turkish, person above me is a shameless lying AKP supporter, first Erdogan lied about Imamoglu not having a diploma, then when there was overwhelming proof, used his influence to 'make it null and void' on a senseless technicality the university is too ashamed to properly explain. On top of that, current administration does not have the legal right to do this, but they will.",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "OffsideOracle",
                    "body": "I hope you get paid for this propaganda.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "PickledResistance",
                    "body": "Lmfao.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Stunning_Spinach7323",
                    "body": "yav bi siktir git",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "kraswotar",
                    "body": "You are forgetting the fact that the university literally advertised on the newspaper for people to apply. He wasn't even the only one who applied from his university, and it wasn't even that year only. The university had been doing that for multiple years. The papers were shared on TV. The university was having trouble filling quotas.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "weirdowerdo",
                    "body": "Tell me you're banning your opposition without telling me you're banning your opposition.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "AccessModifier",
                    "body": "Well maybe you would also like to explain Erdogan’s diploma?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Exizal",
                    "body": "Haha",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "FistyFistWithFingers",
                    "body": "Please tell me this isn't your actual attempt to explain this lol",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Fragile_Graces",
                    "body": "he yarrak he, kesin öyldir. sg burdan aq aktroll'ü",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "AdonisK",
                    "body": "He is not randomly banning opposition, he if finding whatever the fuck technicality he can to stay in power. Good luck my neighbor and friend, you are gonna need it while slowly transcending in the dark ages.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}