{
    "title": "Macron: Luxeuil will be the first base to host the next version of the Rafale and its hypersonic nuclear missile",
    "author": "TeaBagHunter",
    "subreddit": "europe",
    "rank": 17,
    "score": 698,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 45,
    "url": "https://i.redd.it/f3rp5l62jhpe1.png",
    "id": "1jeaw1y",
    "selftext": "",
    "comments": [
        {
            "author": "M0therN4ture",
            "body": "Macron is on a roll.",
            "score": 81,
            "replies": [
                {
                    "author": "SAMSystem_NAFO",
                    "body": "France / Rafale / Hypersonic Nukes\n\nName a more iconic trio.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Faltro8",
            "body": "Please sell us germans 35 Rafael with these hypersonic nukes on it, and we manage it the same way we are doing it with the US right now. French millitary in control of these nukes inside a french military base in Germany. We germans provide the pilots and the purchased Rafaels and if needed be the French soldiers provide the nukes to the fighter jets.",
            "score": 16,
            "replies": [
                {
                    "author": "Bagheera29200",
                    "body": "Dassault intends to increase its production from 2/3 per months up to 5. There is a solution to the backlog issue for people of good will.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Kunstfr",
                    "body": "We can't even produce enough Rafales for our own exports",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Spirited_Heat_9556",
                    "body": "Join the queue :x",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xys",
            "body": "Hypersonic nuclear missile ? Isn’t Russia the only country to have these currently ?",
            "score": 41,
            "replies": [
                {
                    "author": "LaraWho",
                    "body": "Apparently not.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "SraminiElMejorBeaver",
                    "body": "Russia does not have hypersonic air launched nuclear missile as far as i know, nor just air launched nuclear missile.\n\nIt's just another upgrade of the ASMP missile that started with the mirage 4 with the current missile being mach 3 with variable yield up to 300kt.\n\nAnd every big nations have hypersonic missile/glider that could bring potential nuclear yield, otherwise most nuclear nations have missiles that go way above hypersonic missiles (ex: mach 15 for the m51 used from submarine.)",
                    "score": 18,
                    "replies": [
                        {
                            "author": "RamTank",
                            "body": "Only Russia, China, the US (sort of), and NK have hypersonic gliders right now, with others just working on it. The Chinese and US ones are not nuclear.\n\nFrance, Russia, and the US have air launched nuclear missiles, but none of them are hypersonic.\n\nRussia is the only country that currently has an air-breathing hypersonic missile (supposedly anyways) and it’s allegedly nuclear capable, but that part doesn’t meant much.\n\nChina and the US have or will very soon have air launched hypersonic missiles, but they aren’t nuclear.\n\nAnd yeah, every nuclear power besides Pakistan (and Israel) has standard ballistic missiles that reach hypersonic speeds.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "SraminiElMejorBeaver",
                                    "body": "The last news i heard about US program was either a failure or just them being late, France hypersonic glider succeeded.\n\n  \nI think the person i was talking to was talking about air launched nuclear missiles because his comment would make no sense otherwise.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Okiro_Benihime",
                                            "body": "> The last news i heard about US program was either a failure or just them being late\n\nThey were having troubles initially but the test ended up succeeding if I remember correctly. The missile this is about is similar to Kinzhal though, so a glorified ballistic missile. The US has plenty of other legit programs and I have no doubt they will materialize. The issue is just that they took interest in such tech way later than Russia and China.\n\nFrance itself was ahead in the race in the 1990s and early 2000s (and was also unfortunately cooperating with..... erhm... Russia on the matter in the early 2000s) but did not go all in on actual armament programs for unknown reasons until Russia began testing its weapons in the second half of the 2010s.\n\nIt is actually crazy how far back France's [interest in this field goes](https://en.wikipedia.org/wiki/Hypersonic_weapon). A hypersonic glide vehicle program in 1965 is hilarious... and went as expected lmao. We used to be mad lads. Where are these crazy ambitions nowadays, man? We were throwing money at all kinds of crazy stuff back in the day to see what it sticks.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Okiro_Benihime",
                                    "body": "> Only Russia, China, the US (sort of), and NK have hypersonic gliders right now, with others just working on it. \n\nIn service, yes, though I am sceptical about NK even if the warhead did look like a HGV. But France successfully tested its [VMaX](https://old.reddit.com/r/europe/comments/14r6i5w/france_debuts_hypersonic_glide_weapon_in_first/) hypersonic glide vehicle in 2023. A second one, VMaX-2, is scheduled to be tested this year.\n\nAlso the upcoming ASN4G Macron is referencing in the post is a hypersonic cruise missile. The only hypersonic cruise missile allegedly in service right now is Russia's Zircon but it is not an air-launched (it arms ships and submarines only IIRC).",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Bayart",
                                    "body": "[France has a hypersonic glider in the testing phase](https://www.iiss.org/online-analysis/online-analysis/2023/06/france-conducts-its-first-hypersonic-glide-vehicle-test/), though probably not for nuclear purposes.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Money-Percentage-272",
                    "body": "Australians, Brazil, France, Germany, INdia, Iran, Japan, North Korea, South Korea, United Kingdom and the United States",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Okiro_Benihime",
                            "body": "Nope. Most of these countries do not have hypersonic weapons in service and only a few of them have full-fledged armament programs in that regard right now (by that I mean not merely in the \"studies\" or research stage).\n\nUnless you are taking into account ballistic missiles because they surpass Mach 5+ that is. But that's not really what we refer to as hypersonic weapons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "umotex12",
            "body": "What the fuck is happening. I feel like I'm watching a mid sci-fi movie.",
            "score": 19,
            "replies": [
                {
                    "author": "Docccc",
                    "body": "Instead of aliens we get to fight discount orcs",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "WDeranged",
                    "body": "The great reset.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Docccc",
                    "body": "Instead of aliens we get to fight discount orcs",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "__-C-__",
                    "body": "Learned nothing from the proliferation during the Cold War. We make bigger better nukes so the Russians make even bigger better nukes so we make bigger better nukes. It’s an inevitability at this rate that these will eventually fall into the hands of regime who will actually use them, be it Putin or a successor. Brainless, spineless selfish behaviour. We already have nukes to work as deterrence. This is the last thing any of us need, but it makes Macron look good to the idiots so he’ll continue doing it",
                    "score": -17,
                    "replies": [
                        {
                            "author": "Appropriate_Air_2671",
                            "body": "How has the non nuclear proliferation worked so far? Pakistan, North Korea and soon Iran having nukes. \n\nArms race is inevitable",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "paulridby",
                            "body": "Yeah so we shouldn't improve our nukes and their delivery systems while putin is doing so, right. Appeasement has been working so well",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "wgszpieg",
                            "body": "We don't need to make more nukes than russia, just enough to deter their use.\n\nI mean, putin is free to dismantle his nuclear arsenal, by all means.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "GremlinX_ll",
                            "body": "Speak for yourself.\n\nI honestly will prefer bigger better nukes or any nukes for my country  as deterrence,  to any other security guarantees, memorandum or whatever.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "NicoBator",
                            "body": "This is a new plane, carrying usual French nukes.\n\n\nFrance respect the TNP and doesn't build more nukes",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "oakpope",
                                    "body": "It’s the new nuclear cruise missiles.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "NicoBator",
                                            "body": "Oh right.\nIt will replace the old generation ones, not make more missiles out there",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Okiro_Benihime",
                                                    "body": "It likely will actually. Macron announced the creation of two additional fighter squadrons dedicated to nuclear deterrence during the same visit to this base. This air base will be the first to receive this new missile (with the new Rafale F5 and its associated systems). So, I doubt the number of air-based warheads are going to stay the same.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SraminiElMejorBeaver",
            "body": "Honestly, the missile being hypersonic is long overdue, i remember in reading a senate report that they could go to mach 8 without too much problems in 2011.\n\nOtherwise it most likely already follow the scalp/storm shadow about it having some kind of stealth by it's shape.",
            "score": 9,
            "replies": [
                {
                    "author": "oakpope",
                    "body": "ASMP-A\n\nhttps://en.m.wikipedia.org/wiki/Air-sol_moyenne_portée",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "G-Fox1990",
            "body": "From what i could find real quick, the Rafale is more maneuverable, better climb rate and carry much more weapons than the F-22 and F35.\n\nMakes me wonder, are American weapon systems as good as we think they are? Just throwing money at things doesn't always work. Getting a tooth pulled or just basic healthcare in general costs 10 thousands sometimes in the US. But i think you'd get better healthcare for cheaper in the EU. Maybe our weapons are actually better aswell.",
            "score": 6,
            "replies": [
                {
                    "author": "3esin",
                    "body": "Iirc a lot of money was wasted by trying to design the f35 according to the needs of all branches of the armed forces...didn't work.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "A_parisian",
                    "body": "- there's no better product than another since they are designed to fit the doctrine of the country that produced it. What matters is how that doctrine performs against an enemy force. The Sherman was obviously shitty compared to the Panther yet it won the war\n- Countries can lose know how over the span of generation. Canada did some pretty nice designs alone after WWII and now they're unable to make their own designs. It's a political matter: governments decide to either fund research or not (then the providing country repays itself through dependency etc). China was a backward country 40 years ago now they build so called 6th gen aircraft",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "joeweerpottoe",
                    "body": "The f16 is beter at al these things. But that is obsolete.\nimagine 2 boxers the rafale might be in better shape but he is wearing a blindfold against the f35.\nThe fight wil be over long before the rafale notice its a fight.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Squadhunta29",
                    "body": "If you wanna put it to the test if you doubt it just tell your government to attack us then you get your wish it won’t be based on what you feel it be straight hard facts",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Warm_Kick_7412",
                            "body": "Wow what a comment.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SeaweedMelodic8047",
                                    "body": "They fear us already when we haven't even started yet.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cartoone9",
                            "body": "r/iamverybadass",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unhappy_Surround_982",
            "body": "While I think \"hypersonic nuclear missile\" is a sad thing to be necessary, I am sure glad the French has them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wonderful-Variation",
            "body": "The Rafale might not be the most advanced fighter jet in the world, but it's definitely the prettiest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xys",
            "body": "Hypersonic nuclear missile ? Isn’t Russia the only country to have these currently ?",
            "score": -3,
            "replies": [
                {
                    "author": "3esin",
                    "body": "Russia _claims_ that they have them...but they also claim that there war in the Ukraine is going after plan. So make of that what you will...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "oakpope",
                    "body": "Currently, yes. Supposedly.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}