{
    "title": "Biggest protest in Greek history!",
    "author": "SPXQuantAlgo",
    "subreddit": "europe",
    "rank": 2,
    "score": 11192,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 296,
    "url": "https://i.redd.it/ecse0o0ekhpe1.jpeg",
    "id": "1jeb2g7",
    "selftext": "",
    "comments": [
        {
            "author": "Kaniel___Outis",
            "body": "Do not fear Greek brothers. Stand up, stay strong!\n\nLove from Serbia!❤️",
            "score": 211,
            "replies": [
                {
                    "author": "Loukoumakis",
                    "body": "I have to say that your protests have been really inspiring to us, they are very televised here and people bring it as an example of another small european country fighting corruption. I hope we all get our justice and this wave of war against corruption is the only war we are going to see in european land from now on.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Little-Course-4394",
                    "body": "These protests and the scale of them blows my mind.\n\nPeople gathering in hundreds of thousands in solidarity standing up against the corruption\n\nMeanwhile in America the country democratic institutions are getting demolished, the oligarchs and unelected super rich running the country, the president is unhinged and on a track to dismantle all the things which actually made America great.. to destroy it’s economy (cause his a moron who doesn’t know anything about how economy works in 21 century) .. allying USA with Russia and Putin..\n\nBut I don’t see hundreds of thousands of people protesting.. there should be millions on the streets but nah.. I guess eggs prices got a little cheaper and that was worth it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inevitable-Push-8061",
            "body": "Why are they protesting?",
            "score": 472,
            "replies": [
                {
                    "author": "SPXQuantAlgo",
                    "body": "The protests in Athens are primarily driven by public outrage over the government’s handling of the deadly Tempi train crash that occurred on February 28, 2023. In that tragedy, 57 people—mostly students—lost their lives, and demonstrators accuse the government of neglecting rail safety, covering up evidence, and failing to hold those responsible accountable. The current wave of protests, which has seen massive turnouts nationwide, is demanding justice for the victims, significant improvements to the country’s railway infrastructure, and overall political accountability.",
                    "score": 1312,
                    "replies": [
                        {
                            "author": "vucic94",
                            "body": "Pretty much similar to our situation here in Serbia. Awful. I even heard that the main prosecutor's son went missing. Is that correct?\n\nYou must bring those bastards to justice. Support from Serbia!",
                            "score": 370,
                            "replies": [
                                {
                                    "author": "WhiteReef",
                                    "body": "He was found dead approximately 2 weeks ago",
                                    "score": 146,
                                    "replies": [
                                        {
                                            "author": "vucic94",
                                            "body": "Yes, I actually read that, but was unsure whether it was correct. That's... Just... Disgusting. I thought Greece being in the EU would have much better government. But yet, they manage to find a way to be corrupt criminals and literal killers.\n\nNEVER STOP PROTESTING! THAT SHIT HAS GOTTA STOP!",
                                            "score": 106,
                                            "replies": [
                                                {
                                                    "author": "WhiteReef",
                                                    "body": "In any other case I would suggest waiting for the preliminary reports from the authorities, but the trust to the authorities, the judiciary system and the government is long gone. I honestly have no clue what is happening",
                                                    "score": 34,
                                                    "replies": [
                                                        {
                                                            "author": "vucic94",
                                                            "body": "Same here bro. Our authorities are \"investigating\" the usage of a forbidden sonic weapon on us, PEACEFUL protesters, during the 15min of silence, commemorating the deaths of 15 people.\n\nIf you've seen the videos, you fucking know they used something. People stampedoing out of nothing is impossible. They tried to cause havoc and quite literally murder people.",
                                                            "score": 56,
                                                            "replies": [
                                                                {
                                                                    "author": "Necessary-Yak-5433",
                                                                    "body": "They always attack memorials and funerals. I don't know why.\n\nIt never actually makes protesters want to stop. It makes them angrier and more willing to resort to extremes.",
                                                                    "score": 21,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Apneal",
                                                                    "body": "> People stampeding out of nothing is impossible\n\nChanging the subject and not talking about this context, but just know that this exact sentence is incorrect and this is a well studied phenomena in social psychology.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "vucic94",
                                                                            "body": "I understand what you're trying to say. But mate, we were standing in silence. Nobody moving a muscle. Happened in so many protests before. Suddenly, thousands of people are behaving as if they're possessed. Saying they heard a car speeding towards them. Infrasonic weapon was used. Many military experts say so.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "gormful-brightwit",
                                                    "body": "Corruption is a disease and everyone is sick. Some worse than others. Being a member of the EU doesn't magically make it go away unfortunately.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "vucic94",
                                                            "body": "Aw, man. I was literally hoping that it does. I'm basing this on visiting the Netherlands 5 times and seeing the best civil society ever. Probably unrealistic.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "gormful-brightwit",
                                                                    "body": "I'm sure the Dutch are sick of their government like anyone else. Just look at how they talk about Mark Rutte. Not a lot of praise. Good luck in your fight. It's not a one time thing tho. You have to constantly uproot the weeds of corruption. Hope people in my country protested more.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Demon-Cat",
                                                                            "body": "Rutte was a godsend compared to Wilders and his current administration.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "4kondore",
                                                    "body": "Check [this](https://www.reddit.com/r/europe/comments/1jbyw2u/comment/mhyjljf) shit out",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "iamamemeama",
                                            "body": "Completely unrelated incidents until proven otherwise.\n\nGuy was on medication, wasn't he?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "WhiteReef",
                                                    "body": "Yes, but do you have any trust that they wouldn't try to cover it up if they had the opportunity? I'm not that certain",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nidzaaaa-A-",
                                            "body": "Burn them to the ground. Greetings form Serbia.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FalconMirage",
                                    "body": "How are things going in Serbia ? I have heard that the police used sonic weapons against the crowd",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "vucic94",
                                            "body": "Well, I'm not even sure what to think anymore. We had the largest protest in the history of our country, with conservative estimates of 320k people, realistically even up to 500k. They're scared shitless, lying more than ever while also pushing their narratives. Threatening to imprison people who \"spread misinformation\" about that sonic weapon. Talking that NOTHING happened. Fucking liars and losers. I'm outraged, man. I'm sure you are too. Get out in the streets, let's make history my friend!",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "FalconMirage",
                                                    "body": "I’m french, I’ll be in the streets at the next opportunity (but for this past month our government did less stupid stuff than usual)\n\nYou have my whole support though, get thoses corrupt bastards behind bars",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Keanu990321",
                                    "body": ">even heard that the main prosecutor's son went missing. Is that correct?\n\nNot true. Whilst he was the son of a prosecutor, he wasn't the son of the prosecutor involved in the case.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Gixhar",
                                    "body": "Pretty similar to our situation here in Romania. Just a few years ago.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Loukoumakis",
                                    "body": "Brother thank you and I hope you get your justice too! Our small countries often overlooked in the global stage can only truly find their path on their own!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JC_Denton29",
                            "body": "So almost same as situation in Serbia",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "FirstTimeShitposter",
                            "body": "I'm sensing a theme here in the Balkans",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "KingYoloHD090504",
                                    "body": "Everyone has a breaking point",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ImgurScaramucci",
                            "body": "Failing to hold those responsible in Greece is something that happens a lot. The public sector is full of nepotism. I don't know if this applies to this case but there's a high likelihood that someone responsible is \"someone's\" son.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Ok_Pitch5865",
                            "body": "How can we get Americans to do this as our government dissolves into tyranny? I’m beside myself at the lack of boots on the streets.\n\nWhat a massive show of demand for justice—a people united. Well done, Greece.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "LinguoBuxo",
                            "body": "A summary: *they railing against the government.*",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Vulture-Bee-6174",
                            "body": "Sounds like the democracies falls all over the world",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Tailball",
                            "body": "These all seem like very fair and achievable demands",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Parfumee95",
                            "body": "It's crazy, I saw a tag here in Rotterdam (the Netherlands) on a random pedestrian bridge that said \"the Greek government murdered 57 people, justice for Tempi!\" These protests really spread out quickly through Europe.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DCChilling610",
                            "body": "I was so confused because this sounded exactly like the protest in Serbia ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rocketfan543",
                            "body": "isn't that for Serbia?",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "SPXQuantAlgo",
                                    "body": "No. But it is a similar situation…",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "rocketfan543",
                                            "body": "explain please",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "xxtoni",
                                                    "body": "Serbia trainstation canopy collapsed killing 15.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "magnustranberg",
                                                    "body": "In Serbia a canopy at a railway station fell on a bunch of people, in Greece a train crashed.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "khanto0",
                                    "body": "Serbia is a similar scenario but follows the collapse of a roof on a train station, as opposed to a train crash",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "rocketfan543",
                                            "body": "oooh, sorry",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Warm_Kick_7412",
                            "body": "But that was 2 years ago, why just now or is it happening for two years now?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Caju_47",
                                    "body": "Áudios came out showing the people were still alive after the crash, but died from the explosion.... So the government withheld information, didn't investigate what caused it etc",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Aegeansunset12",
                                            "body": "The whole process is a fucking circus. Tell me one case that all of this information leaks to the public (incidentally few days before the scheduled protests) and there’s a mob threatening those who are in the justice system and even spread conspiracies of assassination of one person’s son who worked as a prosecutor. It’s a media war and truth is blurred by all the voices. It’s insane how everything is leaked",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "2pacalypse1994",
                                    "body": "Because still nothing has happened. The people that should be in front of justice,they never faced anything. And they are sarcastic and offensive on live TV against the victims,their famillies and us,the rest of the people. They urge their people their fans to react with rage when they hear anything about a government cover up in this case. They say the whole world face changes and threats with USA,Russia,Ukraine etc and we are talking about the train crash. They were saying those people were a sacrifice in order for the train system to get better and safer. And many more. All of those things are being said from official goverment representatives and \"reporters\" on live tv. \n\nYears and years of negligence and money to waste and their pockets and they just blame everything on the man that made the mistake that night. The station manager. Train workers were saying an accident is going to happen. Nothing was done. The transport minister was on parliament saying its a shame that there are questions about safety. We ensure safety. Its a shame. 7 days later the trains crashed because there was no safety at all. He resigned,and then some months after,he got elected somewhere else. He should be in jail. Not having a job. \n\nThe whole thing is a circus. If you want more,try to find an English article about it but you WONT see the heinous things that happen on TV there. Just the lack of safety and the more serious things.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Aegeansunset12",
                                    "body": "Because op is kinda lying, protests are over the rage people have post economic crisis. They didn’t get as big 2 years ago or even last year because newsflash we had a pandemic with 17% unemployment and everyone shit their pants of things going south again with experiments. Now the reactionary mob that wanted Grexit has found their tempo again at least in societal level, parliament wise it’s a mess…second party is a branch of syriza that pushed for Grexit, she’s very pro trans anti police yet screams Germany bad and was against agreement with north Macedonia name dispute. It’s a perfect mix of left with far right and a total joke. Btw our unemployment today stands at 8,7% lower than Sweden and Finland.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "Open-Plankton1524",
                                            "body": "Greek government troll spotted.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Aegeansunset12",
                                                    "body": "Wow what a stunning response. Let’s misguide everyone believing a mob court is justified",
                                                    "score": -7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SPXQuantAlgo",
                                            "body": "Excuse me?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Aegeansunset12",
                                                    "body": "Well not lie lie but being dishonest. We have had military regime 50 years ago we had economic crisis and you tell me that all this crowd that wasn’t seen those times went out for two trains now ? It was much deeper than that as I explained [here](https://www.reddit.com/r/europe/s/NjSWKkKwyu)",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "SPXQuantAlgo",
                                                            "body": "Even though the Tempi train crash happened in 2023, people are still protesting in 2025 because the government hasn’t delivered justice or made the promised improvements to rail safety. The crash killed 57 people (mostly students), and many feel that the investigation was incomplete or even covered up. This lack of accountability and failure to fix systemic problems has kept the anger alive, fueling protests two years later.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Aegeansunset12",
                                                                    "body": "As I said we literally had much worse things happening that didn’t gather this crowd. Mob courts won’t fix anything. We saw how that went during the crisis",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "micazmaj",
                            "body": "Why now?",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "micazmaj",
                            "body": "Why now?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wangchungyoon",
                    "body": "As someone who doesn’t support fascism and neo-nazis here in America,…. I see you Greece.  Jealousy as I hope Americans rise up soon in equal numbers in here in WA DC. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "wangchungyoon",
                    "body": "As someone who doesn’t support fascism and neo-nazis here in America,…. I see you Greece.  Jealousy as I hope Americans rise up soon in equal numbers in here in WA DC. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kalez23",
            "body": "Love from serbia, we are fighting the same battle ✊",
            "score": 489,
            "replies": [
                {
                    "author": "Robboso",
                    "body": "Very similar indeed. Impressive",
                    "score": 103,
                    "replies": [
                        {
                            "author": "ILikePort",
                            "body": "Disheartening/ worrying maybe rather than impressive?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Every_Pattern_8673",
                                    "body": "Wake up, calls for less than working governments is more than welcome.\n\nIf people do not stand up against bad and/or corrupt leadership, they will continue doing as they please. Time to replace the politicians and ministers with fresh ones in next election cycle, but short term you need the current leadership to fix the shit or resign.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flashy-Diamond9613",
            "body": "Massive protests in Serbia, Hungary, Romania, Greece, and North Macedonia now. This really is the Balkan Spring",
            "score": 139,
            "replies": [
                {
                    "author": "kharathos",
                    "body": "Don't know about you guys, but nothing even close to spring in Greece",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Aegeansunset12",
                    "body": "Or the Russian hand. I don’t know about Hungary and Serbia but in Romania and Greece they were 100% stirring this up and in Greece they have completely distracted us from anything that happens abroad the last 2 months.",
                    "score": -53,
                    "replies": [
                        {
                            "author": "Silent_Quality_1972",
                            "body": "In Serbia, the Russian ambassador sent support for the president. He said that the president handled protests well.",
                            "score": 40,
                            "replies": []
                        },
                        {
                            "author": "Kevin_Finnerty011",
                            "body": "What is happening abroad? The mighty Greek army is distracted from fighting against Russia?",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "TheIcebeard",
                            "body": "Congrats!!! You are now eligible for the 0,14 cents that the government give you per comment 😂",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Loukoumakis",
                            "body": "Yes what a great idea to play world police and act like a global player when your own country is being consumed by corruption. Before I have a say on what Trump and Putin are doing I want to be able to take the train to my family without worrying its going to crush head on with another or the whole station doesn't fall on my head, thank you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aegeansunset12",
                                    "body": "Corruption is an umbrella term at this point. Well no shit you think I want people to die in trains or that I have never used it? One doesn’t cancel the other. My point is to protest for the trains not to abolish our democracy",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PotentialZzz",
            "body": "Kindly refrain from “what about americuhhh?” in all the protest posts on the European thread about EUROPEAN protests, thank you 🫶🏻",
            "score": 134,
            "replies": [
                {
                    "author": "TremendousVarmint",
                    "body": "Hell no.\n\nWhat about Americuhhh!?!?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Nazamroth",
                            "body": "*looks to the west*\n\nI see smoke on the horizon. They are either calling for aid, or rolling coal.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JesC",
                    "body": "What about the USA? Bridges collapsing could be a good reason for similar protests",
                    "score": -5,
                    "replies": [
                        {
                            "author": "attaboy000",
                            "body": "Which bridges collapsed? Did I miss something?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pinkfatcap",
            "body": "It troubles me that this happens twenty days ago and no one gave a shit, this is the biggest demonstration Greece has seen since the junta days. It was among the deadliest train crashes in EU and certainly in Greece, it is about corruption that used my money and YOUR money as EU citizens to fund systems and infrastructure that was never completed and was instead pocketed. And what bothers this sub is Americans and their fucking eggs and Teslas, this sub never fails to amaze me. \n\nAt least give proper attention to the Serbian people they are still out in the streets fighting the same thing, they need your support.",
            "score": 59,
            "replies": [
                {
                    "author": "KrebsCycle123",
                    "body": "If I see another political cartoon of Musk and Trump, or Jd Vance I swear 😭😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "justbecauseyoumademe",
            "body": "America: \"whats a protest?\"",
            "score": 329,
            "replies": [
                {
                    "author": "No-Inevitable7004",
                    "body": "\"We held signs and yelled at the sidewalk of a motorway. We did all we could, all hundred of us.\"",
                    "score": 217,
                    "replies": [
                        {
                            "author": "Annatastic6417",
                            "body": "\"I'm so sorry Europe for what our government is doing. I wish there was something I could do. If only there was ammendment in our constitution specifically designed to remove tyrants and foreign agents in government.\"",
                            "score": 108,
                            "replies": [
                                {
                                    "author": "DragonEngineer9",
                                    "body": "They justify all their automatic guns with \"being able to stand up to the government\".. well, maybe only the Orange supporters have them",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "author": "No-Inevitable7004",
                                            "body": "Trump even unknowingly gave a fighting call, during his last term when he tried to have teachers carry weapons inside schools to stop school shootings:  \n\"It only takes one good guy with a gun.\"",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "DragonEngineer9",
                                                    "body": "You know all those movies where they're the heroes, standing up to injustice, badass rogue, maverick, vigilantee - all those cool words - Americans taking on the system?\n\nGuess that didn't rub off",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Far-Cockroach9563",
                                            "body": "Automatic guns? lol \n\nI wish. It’s hilarious how little Europeans understand the US. \n\n\nLegal automatic weapons.. 😂",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "DoctorThomasJ",
                                                    "body": "You can absolutely own an automatic weapon legally in the us. There’s a big tax stamp and background checks and limited amount of pre 1986 guns available, but it’s not at all unusual, mostly just expensive.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Far-Cockroach9563",
                                                            "body": "Good luck getting that from the ATF and finding one. Might as well be none",
                                                            "score": -5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DragonEngineer9",
                                                    "body": "Then use your \"legal automatic weapons\" for something other than school shootings.. 😂",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Far-Cockroach9563",
                                                            "body": "What legal automatic weapons?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "DragonEngineer9",
                                                                    "body": "Call them whatever the fuck you want.. why are you discussing semantics?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Far-Cockroach9563",
                                                                            "body": "Because there’s a massive difference between automatic and semi automatic weapons. We can legally own semi automatic weapons just like most European countries.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DragonEngineer9",
                                                                                    "body": "Sure, I'll trust you on that, you're the expert!\n\nLaws - or lack thereof - are not at all comparable to European gun laws; even the countries that are more liberal on that front like Switzerland",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Far-Cockroach9563",
                                                                                            "body": "It was a simple search\n\nhttps://home-affairs.ec.europa.eu/policies/internal-security/organised-crime-and-human-trafficking/trafficking-firearms/eu-legislation-civilian-firearms_en",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DragonEngineer9",
                                                                                                    "body": "Yea no shit.. as I said it's actually regulated here.. what are you on about?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Far-Cockroach9563",
                                                                                                            "body": "The Lars are virtually identical",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DragonEngineer9",
                                                                                                                    "body": "Then you don't enforce them very well..",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Far-Cockroach9563",
                                                                                                                            "body": "Really? How do you know?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DragonEngineer9",
                                                                                                                                    "body": "I've been to places in USA where I could literally grab a rifle in a random supermarket aisle 😂 are you telling me that you believe the US has well-regulated weapon laws?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Far-Cockroach9563",
                                                                                                                                            "body": "Really? Where?  You can lie to other Europeans but that is completely untrue",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "DragonEngineer9",
                                                                                                                                                    "body": "Dude it's literally sold in Walmart\n\nhttps://thegunzone.com/what-firearms-does-walmart-sell/\n\nI literally lived with 18-year old high school students with so many guns at home their main hobby was to \"go shoot some shit\". Don't pretend like your gun culture isn't sick",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Far-Cockroach9563",
                                                                                                                                                            "body": "Correct. But you can’t just grab a gun and go to the counter with it. The same laws apply as a gun stores. So you know, same basic laws you have.\n\nWhys it sick? Just because you’re scared of it doesn’t make it so.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "DragonEngineer9",
                                                                                                                                                                    "body": "Yea, you have to pass a weak ass background check, unless you know the cashier..\n\nYou don't think it's sick glorifying guns and shooting? Well, that figures, I guess.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Far-Cockroach9563",
                                                                                                                                                                            "body": "Thats not how it works at all. You need to get a FOID which goes through the FBI & ATF. It’s not that easy. You really don’t know what you’re talking about at all. But I’m sure you’ll continue to spread lies because it makes you feel morally superior, which you’re not\n\nThe glorification of, yes, but not possession of.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "VVhaleBiologist",
                                                                                                                                    "body": "All those dead kids perhaps? That at least seems to be the only thing your 2nd amendment results in.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Far-Cockroach9563",
                                                                                                                                            "body": "That’s not related to enforcement. There was a serious rise in school shootings with rise of psychotropic drug prevalence. While those are tragic, they’re few and far between. What’s swedens excuse?\n\n\nhttps://apnews.com/article/sweden-school-shooting-orebro-828d3f50a4add0e658d7517d9eef6724",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Bastiat_sea",
                                                    "body": "double action fully semiautomatics",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Far-Cockroach9563",
                                                            "body": "😂",
                                                            "score": -4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "No-Inevitable7004",
                                    "body": "\"You don't know how hard it is to gather big crowds to protest here, our population density isn't as high as you guys have it. It takes an hour to get to the city!\"",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "arturoEE",
                                    "body": "You're advocating for suicide you know.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "procgen",
                                    "body": "\"Just murder your politicians when you don't agree with them.\"\n\nPlease.\n\nThe second amendment isn't for when you disagree with the policies of a fairly elected politician. It's for when the democratic systems completely break down. If Trump actually mvoes to cancel elections, then you'll see it used.\n\nBut I guarantee that's not going to happen.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Annatastic6417",
                                            "body": ">It's for when the democratic systems completely break down.\n\nSee current America.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "procgen",
                                                    "body": "Nah. If the next elections are called off, then we’ll talk. But people voted for this.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "encelado748",
                                                            "body": "Russia has elections. Having elections is required, but not enough for having a democracy. Trump is a multiple time impeached criminal leading the government actions against the constitution. The checks and balances are broken. He should be in prison, instead he is a de facto dictator.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "procgen",
                                                                    "body": "The checks and balances are not broken. There is no reason why an impeached felon can’t be elected President by the people.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "encelado748",
                                                                            "body": "There is no reason? Really. You cannot be president and have 34 years old but being a criminal that incited a coup is fine. And you think the US is an healthy democracy?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "procgen",
                                                                                    "body": "I do. Again, there are no laws against it. The system is operating as intended. Again, we can talk if the usual democratic process stops. But that is not currently the case.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "encelado748",
                                                                                            "body": "Trump is not respecting judges decisions so a flawed system is already broken",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "procgen",
                                                                                                    "body": "He can disrespect them all he wants. But the government hasn’t ignored any lawful orders.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "vroomfundel2",
                                            "body": "Ok, I'll sleep tight having your guarantee.\n\nFYI, Russia still has elections. Trump won't cancel yours. They just won't be fairly contested.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "procgen",
                                                    "body": "Democrats are very likely to win the next election.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Fickle-Ad1363",
                                                            "body": "Not if they keep rolling over",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "procgen",
                                                                    "body": "Even then. Tick, tock.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fickle-Ad1363",
                                                                            "body": "RemindMe! In 4 years",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MechKeyboardScrub",
                                                                                    "body": "The next federal election is 2026.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "lejonetfranMX",
                            "body": "“Look at these cute signs! Haha, trump is done now!”",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "throwaway_nrTWOOO",
                            "body": "Pssh, I'm pretty sure you have to be a senator to claim your tiny black round sign that says \"Well, this is hardly ideal\".",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "WalterWoodiaz",
                            "body": "Militarized police doesn’t help, also without Democrats having a spine, large organized protests won’t happen.\n\nThese massive movements aren’t grassroots, they have organization, planning, and leadership. The Democrats aren’t doing that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "No-Inevitable7004",
                                    "body": "Serbian protests are a grassroots movement. It started as a student protest. More people have joined every weekend since November. They didn't have \"leadership\" to organize it - the movement has forged leaders.\n\nMedia has tried to ignore them, to sweep their protest under the rug, and government has threatened the protestors. Last Saturday, they had over 800 000 people marching to their capitol - more than 12% of their whole population. Farmers arrived with their tractors to block traffic & safeguard the march.\n\nIt was live streamed to YouTube with drone shots & cameras on ground, to discourage their militaristic police forces to start violence, and to show the world how big the protests really are (Serbian government still refuses to acknowledge how many there were, downplaying the official count but the footage speaks for itself).\n\nGovernment *still* used illegal force on protestors, while they were having a 15 minutes silence to honor the victims of the bridge collapse. You think that'll stop them from gathering the next weekend? Or the next? Serbians overthrew a tyrant just 25 years ago. They still remember how it's done.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "WalterWoodiaz",
                                            "body": "Grassroots from the start, but the organization and goals are there.\n\nOpposition to Trump has no real “goal” or objectives yet, and grassroots in a country as spread out as the US is incredibly hard.\n\nOrganizing in Belgrade and Novi Sad is way easier than Los Angeles, New York, Washington D.C., and Chicago. With that many far away cities there needs to be a movement with leaders and objectives.\n\nThe Democrats are asleep at the wheel.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "Cluelessish",
                                                    "body": "Why do you expect ”the Democrats” to arrange your protest for you? Who exactly do you mean? And is it only a partisan issue? I don’t think it needs to be!\n\nYou are the people. You make your voices heard. The cities you mention - aren’t there millions of people living in and around them? \n\nYou average Americans are asleep at the wheel.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "WalterWoodiaz",
                                                            "body": "Democrats organizing allows for massive protests. Stop virtue signaling, a central opposition group allows for combined mass protests, and getting large amounts of people to follow the movement.\n\nA bunch of grassroots movements would devolve into infighting with no real direction other than “against Trump”and it would be easy for police to crack down.\n\nDemocrats could create a list of demands, organize countrywide protests every week, and unite all anti Trump Americans under a cohesive platform.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "KiwiThunda",
                                                                    "body": ">Democrats organizing allows for massive protests\n\nIt will also make it partisan and stop many poor/disenfranchised republican voters from joining.\n\nJust face facts, Americans are docile and servile. You just talk big and pretend you're not",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WalterWoodiaz",
                                                                            "body": "Being partisan is not an issue when one side is destroying the country. Any Republican voter now is too far gone.\n\nWinning the support of the majority of people who didn’t vote and rallying the 75 million Democrat voters would be huge.\n\nI love how much people move the goal posts, “why not big protests?” and then “what about it being partisan?” Such obvious bad faith arguments.",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KiwiThunda",
                                                                                    "body": "No it isn't. These protests in Europe are across the board. Serbia and Hungary include both students, farmers, and pensioners. No politicians organised them.\n\nYou just won't face the fact America's \"fight for freedom\" reputation is no longer true. You don't care as long as it doesn't affect you, and when it does, you complain online or at most hold a sign/send an email.\n\nJust a huge country of modern feudal peasants accepting their lot in life",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WalterWoodiaz",
                                                                                            "body": "Excellent job at moving the goalposts and virtue signaling. Instead of talking about protesting in general, now it has to be grassroots?\n\nThere is no conversing with people like you, constant purity testing instead of pragmatic solutions.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "KiwiThunda",
                                                                                                    "body": "vIrTuE sIgNaLlInG\n\nThink you've proven my point, cheers",
                                                                                                    "score": 7,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "WalterWoodiaz",
                                                                                                            "body": "Instead of being supportive of protests and encouraging more effort, you pull Americans down? And purity test possible solutions.\n\nYou are the person who would criticize anything any American does as it isn’t good enough, no matter what they do short of violently rioting and killing elected officials of course.",
                                                                                                            "score": -2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "QuoD-Art",
                                                    "body": "You can protest even against a party YOU elected. If I disliked what the people I got into parliament were doing, I'd go out and let them know I want them to change course. I would not, however, join a protest organised by an opposition party which I dislike more. What I mean to say is the protest should not be organised by the Democrats, it should be organised by _the people_. So that everyone who disagrees with what's going on can join.\n\nAlso, you don't have to find a singular goal to base your protest on. The protests in Greece started because of a covered up train crash, but they're much more than that now. The protests in Serbia started because of a collapsed train station, but they're much more than that now. People are now protesting against corruption and the government, and many of them would never have gone out on the streets had others not gone out for different reasons.\n\nI can give you an example I know more about, so you can see how vastly different reasons for participating in the same protest can be:\n\n[Bulgarian protests in 2020](https://en.m.wikipedia.org/wiki/2020%E2%80%932021_Bulgarian_protests) caused by:\n\n• Prosecutor's Office raiding the Presidency of Bulgaria\n\n• Government mishandling of the COVID-19 pandemic\n\n• Ahmed Dogan and Delyan Peevski being guarded by the National Service for Protection\n\n• Political corruption and misuse of EU funds\n\n• State capture\n\n• Lack of media freedom and transparency\n\n• Lack of adequate environmental protection\n\n• Systemic electoral fraud",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "WalterWoodiaz",
                                                            "body": "I am being pragmatic here, you can say “by the people” but the US has a shit ton more people than Serbia, Bulgaria, and Greece. The scale you are requesting would be in the **millions**, which requires higher organization.\n\nDemocrats helping organize protests would be a way to whip up left wing anti Trump protests on a large scale, BLM didn’t lead any protests in 2020 and the lack of organization led to a PR loss.\n\nDo I want things to be by the people? Yes but with cohesive leaders and objectives, an anti Trump movement would be bigger and have more power.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "QuoD-Art",
                                                                    "body": "I don't disagree that it'd be better to be organised. I do disagree, that you should just sit and wait for somebody to volunteer. Start protesting, and you'll find someone who will back you up, and eventually step up as a leader.\n\nThe US has been blessed with not needing large scale protests to keep its government in check thus far. So I fear you'll now have to learn how to protest the hard way. It's not something you can necessarily be blamed for, but it's unfortunate. I hope things will turn out well for you in the end",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WalterWoodiaz",
                                                                            "body": "I am attending protests, but please don’t purity test me when I am proposing solutions to get more people out on the streets.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HussarOfHummus",
                            "body": "Sounds like something somebody who didn't get off their ass to protest would say.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SaltyWiking",
                    "body": "Russia: “can you do that?”",
                    "score": 9,
                    "replies": [
                        {
                            "author": "DeGriz_",
                            "body": "In jail, yes you can but in jail.\n\nSad thing",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SvampebobFirkant",
                    "body": "And if you paint a Tesla dealership or burn a few cars, then everyone goes like \"oh no you can't do that, how dare you!!\"\n\nIf they had any idea how the French protests...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "buyutec",
                    "body": "Lack of gun restrictions would make protesting significantly harder in US.\n\nOne: you could get shot by a rando.\n\nTwo: Guns involved from someone on your side would render your cause invalid and justify violent silencing from state.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sarges_12gauge",
                    "body": "The Greeks are protesting train crashes and government infrastructure neglect and your response is to immediately think about America? What a great example of European unity and support for each other 🙄",
                    "score": -4,
                    "replies": [
                        {
                            "author": "justbecauseyoumademe",
                            "body": "I dont know the ins and outs of why greeks are protesting. I am just calling out that its good to see europeans standing up for what is right.\n\n\nPlease point out where my statement was against EU unity. Rather then a comparison of actions between continents",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "sarges_12gauge",
                                    "body": "And apparently you don’t care about why either, weird to see you actively making the US the center of everything that happens in the world instead of taking an opportunity to learn about somewhere else",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "justbecauseyoumademe",
                                            "body": "I don't need to ask why because somebody already answered it for me, not you btw:\n\n[https://www.reddit.com/r/europe/comments/1jeb2g7/comment/mih4dtu/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/europe/comments/1jeb2g7/comment/mih4dtu/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pookypoo",
                    "body": "EU side most likely will not see much protest news from the US because the news are being compromised more and more. Try visit r/50501  You will see the absolute BS the people are dealing with right now. There is movement to go to lemmy site because reddit is also cracking down on the protest related things, there been some mega threads and individual ones that have been deleted and such.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Hobbitfrau",
                            "body": "The US protests were mentioned in the German news and by German media several times (and the lack of protests, too).\n\nBut when there are way bigger protests in Germany itself or other European countries they understandably don't give much screentime to the American protests.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Pookypoo",
                                    "body": "Unfortunately I don't think we would ever get that much in a single place. The US is made up of 50 individual states so its hard to gather them all in one place. (ex. If EU protests had to come to Italy only) Though they are coordinating same day protests across all 50 states.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Spiritual_Coast6894",
                    "body": "Trump won the popular vote",
                    "score": -14,
                    "replies": [
                        {
                            "author": "DragonEngineer9",
                            "body": "So you can't protest against specific actions? Such as going against judge orders?",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Inevitable-Boot-6673",
                                    "body": "People don't care. That's what happens when your population is living well. Deal with it.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "DragonEngineer9",
                                            "body": "Well, I don't care what you do as long as long as you leave us alone. So dealing with it just fine",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "justbecauseyoumademe",
                            "body": "So did hitler. Whats your point?\n\n\nFar as i remember the french also protest against goverments that won the popular vote because of certain policies or changes they wanted to enact",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "procgen",
                                    "body": "And who is Trump murdering en masse?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "justbecauseyoumademe",
                                            "body": "Arguably the Ukrainians (Kursk)\n\ndo covid deaths caused by his ineptitude count? (hundreds of thousands)\n\n\n\nBut if you want to be pedantic, the time delay between Hitler being elected and mass murdering civilians took a few years, he has been in office for **3 months**",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "procgen",
                                                    "body": "If Ukraine and Covid are your best evidence, it’s safe to say the claim can be dismissed outright.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "No-Advantage-579",
                            "body": "That isn't *less* of a reason to protest!",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Spiritual_Coast6894",
                                    "body": "What would they be protesting? The fact they lost the election ?",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "No-Advantage-579",
                                            "body": "The fact that Nazis are in power! JESUS CHRIST! Faudra que tu retournes ton passeport français immédiatement! Bon dieu!",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "OVERDRlVE",
                                                    "body": "we know it's bad, but remember americans are getting everything they voted for.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "procgen",
                                                    "body": "Nazis? The hyperbole is so disrespectful to the victims of the Holocaust.\n\nWhich of their policies do you think is *most* Nazi-esque?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No-Advantage-579",
                                                            "body": "Not protesting is BEYOND disrepectful to (unfortunately mostly long dead - and I'm talking the survivors here) Holocaust victims.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "procgen",
                                                                    "body": "No, it really isn’t. And of course there are daily protests. But the best thing to do is to vote.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No-Advantage-579",
                                                                            "body": "The protests are minuscule. And voting isn't currently on the table.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Spiritual_Coast6894",
                                                    "body": "Les fameux nazis qui deepthroat Netanyahu à la moindre occasion",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No-Advantage-579",
                                                            "body": "Ah, t'as pas vu le film documentaire israeliën \"The Flat\", j'imagine? Tu vas être complètement choqué(e?) aparemment!\n\n[https://www.youtube.com/watch?v=Z94u\\_5qLxXU](https://www.youtube.com/watch?v=Z94u_5qLxXU)",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PassiveTheme",
                                            "body": "His actions. Besides, while Trump won the popular vote, it was still less than half of the eligible voters, and there will be some of his voters who aren't happy with the way he is doing things right now.\n\nAre you suggesting no one can protest if the government was fairly elected?",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "GameOverMans",
                                            "body": "That Trump and his cronies are corrupt scumbags that are trying to destroy the constitution.\n\nAlso, he barely won the popular vote. Almost 50% of people didn't vote for him.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Spiritual_Coast6894",
                                    "body": "What would they be protesting? The fact they lost the election ?",
                                    "score": -10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Blurghblagh",
                            "body": "He won the popular vote by a smaller margin than Hillary won the popular vote in 2016. So it's not that much of a defence.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Spiritual_Coast6894",
                                    "body": "You don't even need an ID to vote in blue states lmao",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LowTheme1155",
                    "body": "School year right now, so we are not protesting as much. Also, its still pretty cold in mid march in some areas, and i wont be able to protest until early June because i have about 80 premium days left in warthunder and i dont wanna waste them.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mudo_Labudo",
            "body": "P",
            "score": 14,
            "replies": [
                {
                    "author": "TomatilloOptimal3998",
                    "body": "U",
                    "score": 11,
                    "replies": [
                        {
                            "author": "-MarkoManchina-",
                            "body": "M",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "-MarkoManchina-",
                                    "body": "P",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "zoi_uzivalac",
                                            "body": "A",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Objective_Ship_553",
                                                    "body": "J",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "JxEq",
                                                            "body": "Goodbye",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "nistemevideli2puta",
                                                    "body": "J",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "-Dovahzul-",
            "body": "Stay strong Komşu. Pray for us too, for our people to awake.",
            "score": 18,
            "replies": []
        },
        {
            "author": "motusubaru",
            "body": "I respect the protest culture so much. You are really amazing. Fighting for your rights together is amazing. Sirkiye ( turkey 🦃) doesn't have anything like that.",
            "score": 19,
            "replies": [
                {
                    "author": "Adept-Standard8631gd",
                    "body": "> Sirkiye ( turkey 🦃) doesn't have anything like that.\n\n\nI'd be willing to guess that it's probably because that's how its people think...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BuddyDudeson",
            "body": "Biggest protest in the history of greeks protests, maybe ever",
            "score": 8,
            "replies": []
        },
        {
            "author": "Pharnox-32",
            "body": "#Balkan Spring lets goo",
            "score": 15,
            "replies": [
                {
                    "author": "oblizni",
                    "body": "Balkan need hard reset, corruption is deep",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "zliccc",
            "body": "Love from Serbia, and most importantly\n\n##ΑΝΤΛΊΑ!!!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Appropriate-Tuna",
            "body": "Can someone tell me briefly about this?",
            "score": 4,
            "replies": [
                {
                    "author": "Safinbu",
                    "body": "Deadly train crash is covered up > it broke the camel's back and everyone is protesting against corruption and everything else wrong with Greece.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "rizumzizum00",
            "body": "FIGHT ON GREEK BROTHERS AND SISTERS, MUCH LOVE FROM SERBIA ❤️❤️❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Professional_Ant4133",
            "body": "ΑΝΤΛΙΑ!!!",
            "score": 11,
            "replies": [
                {
                    "author": "chortogrower",
                    "body": "What? This doesn't make any sense 🤔",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Professional_Ant4133",
                            "body": "Is it not \"PUMP\" in Greek?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "galenite",
                                    "body": "Yeah and in Serbia we don't say \"Government is gonna fall/blow\", we say PUMPAAAJ and I think that is beautiful.\nJust some solidarity from Serbians",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "chortogrower",
                                    "body": "It's the word for the pump, the pump tool not to pump something up. I don't know how to translate to Greek what you want to say but I get your point",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Professional_Ant4133",
                                            "body": "In Serbia our current student-led protests use \"PUMPAJ\" which means \"TO PUMP\"/\"PUMP IT\" - it originated on Reddit, btw - just wanted to show my support for our Greek bros! :)",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tomj788",
            "body": "Inb4 this gets deleted AGAIN",
            "score": 3,
            "replies": []
        },
        {
            "author": "eriomys79",
            "body": "Unlike in majority of European countries where you see party coalitions, Greek voting system gives bonus seats to the first party, up to 50 out of 300 seats. Which means that a party needs 33 percent votes to govern with parliament majority, without any need for coalition. It basically enforces one party rule that is going in Greece for decades. And when there were coalitions in the 2010s, only with small satellite parties that disappeared. \nThis enforces corruption and disdain for legal procedures as the party gets all the ministries and without opposition it can get out of control.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kakafob",
            "body": "Spring 1848 and Spring 2025.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Hot_Distribution_131",
            "body": "Bulgaria could never",
            "score": 2,
            "replies": []
        },
        {
            "author": "micazmaj",
            "body": "How many people?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ashen_five",
            "body": "Send support and strenght from Hungary! ✊️🫂",
            "score": 2,
            "replies": []
        },
        {
            "author": "mr10683",
            "body": "It's very hard to make the claim biggest ever, but surely the biggest most people can remember.",
            "score": 2,
            "replies": []
        },
        {
            "author": "justbecauseyoumademe",
            "body": "America: \"whats a protest?\"",
            "score": 6,
            "replies": [
                {
                    "author": "North_Atlantic_Sea",
                    "body": "2017 - Women's March with 4-5 million protestors \n\n2020 - George Floyd protests with between 15-25 million protestors \n\n2021 - Jan 6th protests successfully seized and occupied the national capital building \n\nIt's not like Americans don't protest, it's just that not much results from them.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "justbecauseyoumademe",
                            "body": "Last protest was 4 years ago while democracy is being torn down in front of them. good to see priorities",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "procgen",
                                    "body": "> Last protest was 4 years ago\n\nThere are protests every day, lol.\n\n> while democracy is being torn down in front of them\n\nNo, you just disagree with the policies of the elected government. Big difference.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Significant_Pain_404",
                                            "body": "You recently had protest in which 20-25% of population participated?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "procgen",
                                                    "body": "Yeah, currently. It's not under a single banner in a single place, of course – that would be absurd in a country the size of a continent with a population of 340 million people. Instead it is distributed.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vsnfsn",
            "body": "This protest happened today?",
            "score": 1,
            "replies": [
                {
                    "author": "2pacalypse1994",
                    "body": "No. 28th of February",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "unknown-se",
            "body": "is this current?",
            "score": 1,
            "replies": [
                {
                    "author": "2pacalypse1994",
                    "body": "28th of February",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xxcn",
            "body": "Not a word about this in any Bulgarian news, WTF?",
            "score": 1,
            "replies": [
                {
                    "author": "2pacalypse1994",
                    "body": "That was on 28th of February. Not today",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Evil_SexyHamlet",
            "body": "It gives me great comfort that at least our lovely neighbors know how to defend their rights. Hurray for Greece!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Other_Class1906",
            "body": "Well, that's certainly more than 300. So I guess shit must have really hit the fan...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elyoslayer",
            "body": "I only see 100.000 people, though...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motor_Educator_2706",
            "body": "What have the Turks done now?",
            "score": 1,
            "replies": []
        },
        {
            "author": "eschmi",
            "body": "And there's not been a single mention on the news of any of these protests going on in the world state side.... shocker...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gorstag",
            "body": "Really wish the US would take a page (hell even a page header at this point) from Europe when it comes to protesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cyberdork",
            "body": "I always find this [video of the 2016 Seoul protests](https://www.youtube.com/watch?v=zYYuDFor5Ns) super inspiring. They resulted on the arrest and incarceration of the South Korean president.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogerRavvit88",
            "body": "I’m a simple man. I see a protest, I downvote.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Right_Seat_4000",
            "body": "αντλήστε το!!!!! From serbia 🇷🇸❤🇬🇷",
            "score": 1,
            "replies": []
        },
        {
            "author": "2024-2025",
            "body": "Romania, Serbia and now Greece, just a question of time until north Macedonia joins?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Superb_Toe170",
            "body": "I wonder what being a North koreans feels like.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible_Ease_262",
            "body": "I’m American and in 2004 I was in Athens. One day I walked out of the Metro right into an anti-American demonstration.",
            "score": 1,
            "replies": [
                {
                    "author": "Keanu990321",
                    "body": "A very justifiable demostration considering W's action in Middle East.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Responsible_Ease_262",
                            "body": "Yes…that was terrible.\n\nI learned quite a bit during that trip about democracy and western civilization. The ancient Greeks experienced demagoguery like the US is experiencing now. Our founding fathers knew about it and created a system that sort of works.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Safinbu",
                    "body": "Honestly lol, look at the state of USA today. Maybe they knew something lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Responsible_Ease_262",
                            "body": "Yes. \n\nIt’s a lot of trouble caused by about 20% of the population.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Safinbu",
                                    "body": "What are you talking about?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Responsible_Ease_262",
                                            "body": "MAGA is less than 20% of the US population. Many of them are currently unhappy with Trump.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Safinbu",
                                                    "body": "Really? Even if they are less 20% republicans still won so... There you go! Enjoy your newfound dictatorship y'all! (Sorry for the joke I actually feel for you guys)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Responsible_Ease_262",
                                                            "body": "It’s more complicated than that…basically Trump is a liar and grifter and too many people are gullible",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aegeansunset12",
            "body": "Additional context because I see a very one sided view on this all the time on social media and not : \n\nThey are driven by an anti system narrative (and some oligarchs who sponsor them) that doubts the prime minister, our justice system, and political class as a whole. Symbol of the protests is a mom whose child died yet so far she has talked against our prime minister for the train colliding, has attacked the head of our justice system, has made off court statement against our president of parliament after she demanded to see him alongside a lawyer, and has also criticized our head of state (president).  \n\nThe protests are driven by unsatisfied people who never saw their living standards rise post crisis, they don’t care about reforming the rail, the person who was probably placed there via client state manner is almost not blamed for putting two trains on the same line and the doctors who gave fake leave for the other stuff who should be there working are not blamed either! \n\nThere is a demand to dismantle laws that protect the parliament people and ministers. The mob has made a decision and don’t care about what the justice decides, it’s delegitimised to them along with all high ranking officials. People call the government assassins (to a less degree some of the opposition too). Situation is worrying but that very same people the immediate day after the protests went on posting pictures from the carnival!!! Essentially ridiculing the whole protests. There was already a bomb set in a government [politician’s](https://www.kathimerini.gr/society/563487844/varkiza-ekrixi-se-polykatoikia-topothetithike-aytoschedios-empristikos-michanismos/) house and there’s also [foreign interference](https://www.eureporter.co/world/greece/2025/02/26/greeces-worst-rail-disaster-hijacked-by-a-bot-army-on-its-2-yearanniversary/) via bots who polarise more the situation.",
            "score": -7,
            "replies": [
                {
                    "author": "razorator7",
                    "body": "All valid reasons to protest. Such a huge number people indicates deep rooted issues. Support for my Greek brothers fighting on the streets for a better country!",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "electronigrape",
                    "body": "Please do not take the person above as representing the sentiment in Greece. They some to be one of the like, 3 people in the country that think like this. What was remarkable about these protests was how universally they were supported in society. There was pretty much no social group that was against them, except for some lone individuals like the commenter.\n\nThis is unlike even Serbia, where there is a real fanatical pro-government camp that is against the protests. In Greece nothing of the like seems to exist, to the point that even the government itself gave up trying to speak against the protests and instead the PM ridiculously tried to imply that these were pro-government demonstrations.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "Not really, while unfortunately this opinion is indeed not even close to a majority, the people who think like that have deep concerns to the escalation of what seems to be a mob court with people asking blood. We try to see the events without a reactionary response.",
                            "score": -12,
                            "replies": []
                        },
                        {
                            "author": "S_T_P",
                            "body": "> Please do not take the person above as representing the sentiment in Greece. They some to be one of the like, 3 people in the country that think like this. What was remarkable about these protests was how universally they were supported in society. \n\nYep. Globalist cabal is really pulling all stops here.\n\nDoesn't mean it won't become a fascist coup in heartbeat.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "electronigrape",
                                    "body": "One of the positive things is that the Far-Right didn't dare visibly participate in these protests. Of course their voters were probably there, everybody was, but they didn't even attempt to coopt them (it was obvious they would have failed).",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "S_T_P",
                                            "body": "Doesn't mean much. As long as government falls, the most organized and determined movement takes over.\n\nRemember how Egypt fell to Muslim Brotherhood despite main force that deposed previous regime being secular.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheIcebeard",
                    "body": "Jesus, that must be the most desperate attempt to support that corrupted government and spreading all possible lies in order to justify their actions. \n\nFor example like the made up trial that the protests don't respect (the minister responsible not only took charges but he was even responding ironically when they were asking him questions) or that the protests want to overthrow the democratic values of that county by saying that the government took 41% voters. They do forget to mention though that it was out of the 40% of the population that actually went to vote.\n\nThe funny thing is also that a lot of voters of that government they went in that protest as well and it was the biggest protest in greek history in over 350 locations in the whole world.\n\n I guess that those \"oligarchs\" somehow managed to motivate and fund the greeks in all over the world to protest 😂",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "Protest to fix the trains ? Yes. Protest to destroy all our institutions and bring chaos ? No. The people out there are the same who voted no in our 2015 negotiations with the eu. The fact no one says it is because the deaths were tragic. But we must not allow a mob court as we do now. Those people have made a desicion and now hold the  pitchforks.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "electronigrape",
                                    "body": ">The people out there are the same who voted no in our 2015 negotiations with the eu\n\nMaybe if the \"no\" vote had passed with 90%. Pretty much everyone supported these protests. They were the largest in Greek history for a reason.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Aegeansunset12",
                                            "body": "No won with 60%, add to that the constant back and forth many did for how political or non political the protests were and there you have that number from additional people with empathy for the tragic event. I know plenty of new democracy voters who went there because of it. Theres always more nuance and variation to opinions but I write in a foreign sub with people not familiar with the situation. My text was already big if I made that parenthesis for everything I wrote I would make a book.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "electronigrape",
                                                    "body": "60% was barely the amount of people who went to the protests themselves, and you can bet the majority who didn't go supported them, I've yet to found one who didn't in real life.\n\n>I know plenty of new democracy voters who went there because of it\n\nExactly. No social group was against them. Even the government's former voters.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Aegeansunset12",
                                                            "body": "Christ you completely missed my point 😂😂😂",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "electronigrape",
                                                                    "body": "I know what you tried to say, but I responded to what you said, which, unlike what you tried to say, I think is true. We'll see.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thunder_Beam",
                    "body": "If like the other comments said that the protest is because of a train accident that killed 57 people and to improve the rail system it seems a very good reason to protest (reddit is shitting the bed, it deleted my post after a while)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "Tell me one revolution that had no justification (no matter how silly it sounds) supporting it. For Greece the deeper reason is economic collapse and the division the negotiations with the eu brought that persist till this day. The incident is the trains, and the [actor](https://www.eureporter.co/world/greece/2025/02/26/greeces-worst-rail-disaster-hijacked-by-a-bot-army-on-its-2-yearanniversary/) helping is there too. No one gives a shit about trains (well some definitely do it was a tragic event and there’s always nuance and mixed opinions), the motivation behind the protests is not what it looks like.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Thunder_Beam",
                                    "body": "It seems quite large, there is probably a very good reason to protest when they get this large, just look at Serbia, i don't think everyone there is there just because of internet bots, the economy and corruption probably just helped sparked it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Aegeansunset12",
                                            "body": "No offence but you guys like to think we’re in the same state of democracy which is not true and sometimes you  end up judging events with the same lense you do domestically but it’s a different world here. Economy during and post crisis is the main driver with corruption being too vague but it is included. We’re an actual democracy but many people think we’re in a regime. That’s what happens when unemployment reaches 28% 12 years ago and every choice you make is going to hurt some regardless. Things are much better but a scar takes a long time to heal",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "georgakop_athanas",
                    "body": "^ A fanatical government supporter's take.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "Quit the small talk, go and vote if you don’t like the government. That’s the only way to kick them out in our democracy. You cannot destroy all of our institutions. Wake up and look who’s benefitting from stirring things up throughout the whole EU. The protests had a revolutionary element before they got ridiculed the next day by those who begun posting pics of the annual carnival parade/“mardi grass”, bomb to an mp ? Really ??? You are a mob that would cause a civil war for two trains.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "georgakop_athanas",
                                    "body": "I can actually protest to the end and make your beloved government step down prematurely. And yes, I can also destroy the institutions your oligarchy has corrupted. Deal with it.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Aegeansunset12",
                                            "body": "Cringe!!!! You don’t even know what the fuck you talk. Destroy institutions?? Really ? When Russia invades Ukraine and there’s chaos in all European countries and you have already proof of a hybrid war with bots happening here you don’t even know what you sign for. I’m not surprised because you’re the same people that wanted hard Grexit and were out of Syntagma dancing 🤦🏻",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "georgakop_athanas",
                                                    "body": "The only cringe here is your attempts to coax europeans into supporting you against the protests, by portraying yourselves as the innocent victim of Russia's disinformation.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Baba_NO_Riley",
                    "body": "So.. what's military stance on things?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "purpleisreality",
                    "body": ">They are driven by an anti system narrative (and some oligarchs who sponsor them) that doubts the prime minister, our justice system, and political class as a whole.\n\n\nTowards whom should we protest if not the government? And why you call antisystemic a democratic expression such as a protest?\n\n\n>Symbol of the protests is a mom whose child died yet so far she has talked against our prime minister for the train colliding, has attacked the head of our justice system, has made off court statement against our president of parliament after she demanded to see him alongside a lawyer, and has also criticized our head of state (president).\n\n\nWe talk against the government and the \"justice\" system as well. More than half a million people cried against them. If they were the ones elected, they are responsible too. Also the head of the justice system (not ours, theirs) was 17 places from the first and is appointed by the ministry cabinet, the only one in the EU. So much for our independent justice. We stand beside Maria Karystianoy and all the victims' families!\n\n\n>The protests are driven by unsatisfied people who never saw their living standards rise post crisis, they don’t care about reforming the rail, the person who was probably placed there via client state manner is almost not blamed for putting two trains on the same line and the doctors who gave fake leave for the other stuff who should be there working are not blamed either!\n\n\nThe client state was the nd state, who didn't even obey their own laws and put him there, the trains were **understaffed** (1/4 of those who were needed according to the organisation chart and the official resolution - we have 1 worker per 2km, while in the EU they have 2 workers per km) and people must take a leave sometime. Don't repeat the government's propaganda about the bad lazy public sector, you saw the wonders of the privatised Hellenic trains!!\n\n\n>There is a demand to dismantle laws that protect the parliament people and ministers. The mob has made a decision and don’t care about what the justice decides, it’s delegitimised to them along with all high ranking officials. People call the government assassins (to a less degree some of the opposition too). Situation is worrying but that very same people the immediate day after the protests went on posting pictures from the carnival!!! Essentially ridiculing the whole protests. There was already a bomb set in a government politician’s house and there’s also foreign interference via bots who polarise more the situation.\n\n\nYes. The law about the Ministers' responsibility must change and they should be accountable more than any other. Also the highest judges must not be appointed by the government, it is a farce. The media freedom must be ensured (last in the EU!)\n\n\nIf you think that a person cannot go to a protest and the next day in a carnival then you don't exercise one of the basic democratic rights, the protest. They are a part of our lives, people are not hypocrites when they continue to live the next day. Were more than half a million people trying to destabilise our emperor? Rage against those who bury in cement the remains of our dead. But also for making the greek state the ridicule of the eu parliament, when one by one we get shamed for the state of our democracy and freedom. Even if they keep up the propaganda, as you saw almost a million people worldwide was outraged for their cover up.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "You won’t change anything for the better with mob courts and witch hunting. We have a liberal democracy and rule of law. You can’t make decisions for our justice system. I never saw anyone advocating for firing inefficient public sector workers like the one responsible for the tempi train crash who was most likely placed by nepotism. I mostly saw a crowd demanding a mob court. You are innocent until proven otherwise not the opposite. Only PASOK made an actual suggestion instead of a plead to abolish all of our institutions and become a jungle but that’s barely discussed given the toxic climate.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "purpleisreality",
                                    "body": "Look, democracy was borne in the streets through protests. All around the democratic world, the protests, strikes and syndicates (συνδικαλισμός) are fortified constitutional rights, that's why they cannot prohibit them here (they kind of try with the Hatzidakis laws about strikes).\n\nThe justice system is a puppet of the government like never before. Did you read that we are the only eu.country that the government appoints the highest judges, who will then check them? Don't you find anything even slightly funny in this sentence? That our highest judge is nr 18 in the list while the 75% of greeks don't support the justice or the media, is this our fault or the institutions' and the government's authoritative policy?\n\nThe judges and media are not beyond criticism and they should be fortified for our democracy. The crowd demanded justice in the sense of the Nemesis, they would be idiots (ιδιώτες) if they didn't care that our institutions have become puppets. Neither Novartis nor the Predator scandals, who never condemned the government, awoke the people as much as the cover up of the accident. Not the accident that much, but what they did was hybris.\n\nThere is no toxic climate, this was a celebration of democracy. If it weren't for the stupid teens who throw rocks (and were much encouraged by the police but that's a different story) there would be absolutely peaceful protests. I hope we made them really afraid and realised their arrogance, although I am not sure they touch ground.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Aegeansunset12",
                                            "body": "I don’t find it funny at all. I’m very concerned that PASOK’s proposition on it is dismissed on public discourse and the focus is on conspiracies and emotional manipulation by the tragic events. As for the rest I completely disagree. The climate wasn’t one of demanding reforms (firing inefficient workers who got a job through client state). You in fact completely skipped that part and tried to justify this mob court into something democratic. I don’t know if you do it consciously or not but know that North Korea also claims to be a democracy. The monster most of the times doesn’t come with a t shirt that writes on it “hey I’m the monster”. Btw that process you referred to predates the [current gov](https://www.documentonews.gr/article/ti-leei-to-syntagma-gia-thn-hgesia-twn-anwtatwn-dikasthriwn/) it’s not as simple as that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "purpleisreality",
                                                    "body": ">I don’t find it funny at all. I’m very concerned that PASOK’s proposition on it is dismissed on public discourse and the focus is on conspiracies and emotional manipulation by the tragic events. \n\nThere was no dismissal at least by me. The media as always tries to sensationalise it but, to be honest, as I said a Predator or a Novartis didn't wake up the people. They needed 57 dead to realise the level of corruption. On the contrary, maybe you didn't notice but our dear pm in his parliamentary speach a week after the protests, he promised to change the law in Constitution of both the Minister's responsibility and the appointment of the highest judges. I guess he was pressured by the EU as well, who repeatedly has warned us before.\n\n>The climate wasn’t one of demanding reforms (firing inefficient workers who got a job through client state).\n\nDo you understand that the ND, aka our government, who was voted with the promise of Άριστοι - επιτελικό κράτος was the one that put this man in the train station? And they dismissed the age and they changed the law afterwards, leaving him in an understaffed (1/4 you conveniently ignore my arguments...) station alone? Who are going to protest against, the workers? Didn't we vote them to bring clarity and the best, who is to blame for? Believe me, the education and health are underfunded and understaffed and they blame the few workers with evaluation (!!) and you believe them. So to whom should we protest of not our government?\n\n>You in fact completely skipped that part and tried to justify this mob court into something democratic. I don’t know if you do it consciously or not but know that North Korea also claims to be a democracy. The monster most of the times doesn’t come with a t shirt that writes it.\n\nReread what I wrote. The protests are encouraged by democracies around the world for the people to peacefully and democratically express their criticism to the government. What does North Korea has to do with this? Because I think this is the exact opposite, they cannot or don't want to protest.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Aegeansunset12",
                                                            "body": "Man you’re unreadable. The trains were completely understaffed that’s a fact. No one’s arguing that. What I said was that it contained unsuitable people that should be fired and that’s how our whole public sector is. You didn’t see how they dug towards the wrong side of the metro today ? I like how you skipped the unsettling part of the appointing of head of justice by the way. Shows how much of a hypocrite you are. Those protests contained among the peaceful people (which you so desperately try to mention every time because you have the prejudice I will talk about the far left mob who tried to have a beef with the police) many other angry people who want to take the courts on the streets and skip rule of law altogether. That’s unacceptable. We’re in a democracy with rule of law. You protest for the trains not to destroy our institutions. That’s fascism.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "purpleisreality",
                                                                    "body": "You mean that the same government who used 1/4 of the staff they ought to, should have accused their workers (I cannot do the work of 4 persons efficiently, could you?) and fired them? They same government that had promoted him without evaluation? Should we blame the worker as well for not hiring another station manager ti work with him, as at least two persons should be there?  Why didn't they pay attention to the train worker's syndicate warnings? Do we need to fire them too?\n\nWhat do you mean I skipped the unsettling part about justice? Which part? Wasn't I the one who brought it up? Do explain.\n\nThat's not fascism. Protests are democracy as all the constitutions and democracies prove it. Can you claim otherwise? Anyway, thankfully a million people amd even more are not like you and still defend our personal Thermopyles, you can stay being murdered as a sheep by the state. Not me.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ModeAble9185",
                    "body": "I agree. Yes, this was a tragic event and yes, the government should be held liable, but this is blown way out of proportion. The trains were bad for decades now, when 3 different parties governed. The accident just happened during the watch of the current government. The government party is still leading in polls and will definitely win in the next election because there is no real alternative other than leftist populists, religious fanatics, communists, and incompetent socialists that have lost their charm.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "weallhomos_sapiens",
                    "body": "Get off reddit Άδωνη",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aegeansunset12",
                            "body": "Christ if after all that you’re gonna dismiss all of this into an Adonis you’re low key making me less sorry for what would follow if your law of jungle wish succeeded.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Ant4133",
            "body": "ΑΝΤΛΙΑ!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Professional_Ant4133",
            "body": "ΑΝΤΛΙΑ!!!",
            "score": 0,
            "replies": [
                {
                    "author": "gsinapis",
                    "body": "I don't think it means what you think it means (in Greek)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "YouSureDid_",
            "body": "If this doesn't stop Trump and Elon....nothing will",
            "score": 0,
            "replies": [
                {
                    "author": "Life-Ad1409",
                    "body": "It's in Greece and about the Greek government. Trump doesn't care about people in Greek protesting over issues in Greece",
                    "score": 3,
                    "replies": [
                        {
                            "author": "YouSureDid_",
                            "body": "I thought this was a Tesla dealership",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Football-Real",
            "body": "Pretty sure there were bigger protests in history there lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tugasan",
            "body": "lots of protest in EU lately, the question is ... do they accomplish anything with them?",
            "score": -1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "North_Atlantic_Sea",
                    "body": "Between 15-25 million Americans attended a protest in summer 2020 after George Floyd...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "raharth",
                            "body": "According to Wikipedia even significantly more",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Which_Chef3011",
            "body": "Syntagma :) But you Greeks seem to protest everything and anything, year after year. When I lived in Athens like 10 years ago you were doing the same, at the same spot (plus the riots). \n\nTake it easy and drink your iced coffee, after all, you’ll soon be retirees!",
            "score": -9,
            "replies": [
                {
                    "author": "Safinbu",
                    "body": "Random riots with 1k people are nothing compared to half the population of athens out on the roads. What are you even comparing?\n\nAnd what does youll soon be retirees mean?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mediocre-Brain9051",
            "body": "Smells like Turkstream related.",
            "score": -11,
            "replies": [
                {
                    "author": "AllCunt",
                    "body": "What",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nickrw2022",
            "body": "Brianwashed russian-slaves",
            "score": -18,
            "replies": [
                {
                    "author": "DneSepoh",
                    "body": "Brainwashed russian slaves don't protest their governments. Every protest attempt has been met with jail in Russia... so you know, if they were willing there'd be too much people to put in jail.",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}