{
    "title": "30 days, and my life is drastically different.",
    "author": "Babby_Normal",
    "subreddit": "stopdrinking",
    "rank": 28,
    "score": 108,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inghb4/30_days_and_my_life_is_drastically_different/",
    "id": "1inghb4",
    "selftext": "Howdy folks! Today is a big milestone for me. I figured it's the best day to reflect on how things have changed since I decided to get sober. \n\nMy drinking stems from many things. Childhood trauma, genetics (alcoholics on all sides), but it really hit it's peak after moving across the country with my mom and toddler after ending an extremely abusive relationship that involved physical and emotional abuse and a lot of infidelity. It did a number on my self esteem and I immediately spiraled into super unhealthy behavior. \n\nDuring the last year it was an endless cycle of binge drinking (10-20+ drinks or until I blacked out), followed by the worst possible hangovers and anxiety I've ever experienced. Throw in some healthy guilt, because I was absolutely useless and a horrible parent during this time. Over the last year I lost a great job, face planted on my front porch and bashed my face so bad that I looked like I had been beaten within an inch of my life, fractured my patella (do not recommend), broke my foot, got a DUI, and destroyed several important relationships in my life. My mother has always been abusive, and that really escalated to an unhealthy place during my drinking. I felt trapped, and hopeless. \n\nI'm not sure when the shift happened, but it dawned on me that I needed to change my circumstances. The first 3 days were miserable, and I'm still looking for the right combination of support, therapy, and potentially medication. Regardless, in sobriety EVERYTHING has changed. \n\nI am back gainfully employed at a position I am extremely happy with, and is exactly in my wheelhouse. I found a small townhouse and signed the lease on Sunday. I wake up with energy, my brain is starting to function again. I set boundaries for people in my life, and respect myself. There's still so much work to do to heal relationships, address my daughter's mental health, and reach a place of genuine happiness and clarity, BUT I can see the light through the trees. I would not be capable of any of the things I'm doing now if I wasn't sober. I can't trust myself to live alone, or be a solid parent when I'm drinking. I want to be able to trust myself. There's only one way to do that. Alcohol has been my coping mechanism and best friend for far too long, and it was constantly stopping me from being myself. It dims your light, limits your potential, causes chaos, pain, suffering, anger, sadness. But we can heal.  \n\nThanks for listening. IWNDWYT. ",
    "comments": [
        {
            "author": "Dandilioness23",
            "body": "WELL DONE, you! That's so wonderful. Proud of you 👏🌻\n\nIWNDWYT 😎",
            "score": 8,
            "replies": []
        },
        {
            "author": "6995luv",
            "body": "This is super inspiring. I relate to a lot of what you said here. I did 30 days and then had some rough goes in February but ready to get back on the wagon and this post really did something motivational for me. Thanks, Iwndwyt",
            "score": 7,
            "replies": []
        },
        {
            "author": "Extension-Delay-3049",
            "body": "Congratulations! This has me excited to reach 30 days. Thanks for sharing.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Alkoholfrei22605",
            "body": " Bravo on 30 days!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Prestigious_Dig_6627",
            "body": "So proud of you OP!  It’s such hard work that your doing and you and your child will be better for it. Keep up the great work and hope your using every resource available/doable at this time <3",
            "score": 5,
            "replies": []
        },
        {
            "author": "lukeddm",
            "body": "A month is huge.  Great work.  \nIWNDWYT!",
            "score": 3,
            "replies": []
        },
        {
            "author": "albus_dumbledog",
            "body": "Wow! This is a tremendous post. You're really working on and I am so proud of you, Internet stranger! I'm at 30 days as well! Sending you best wishes and lots of good thoughts so that you continue on this amazing journey.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PandaKittyJeepDoodle",
            "body": "Proud of you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Prehistoricbeaver",
            "body": "Your progress is inspiring! Please keep us updated with future milestones. If you’ve accomplished this much already I’m confident there will be more improvements. All the best to you and your daughter! IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "50_by_50",
            "body": "Very proud of you!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "speltbread12",
            "body": "This is amazing, and so inspiring. Thank you for sharing this. so much good can be waiting for us when we put down the drink.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MysteriousJimm",
            "body": "Congrats!! That’s impressive!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tess_88",
            "body": "What a lovely post ♥️ Keep up the great work. IWNDWYT 🦋",
            "score": 1,
            "replies": []
        }
    ]
}