{
    "title": "Such a waste to go to an all inclusive when you’re AF",
    "author": "Sodahound",
    "subreddit": "stopdrinking",
    "rank": 5,
    "score": 157,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inrmkk/such_a_waste_to_go_to_an_all_inclusive_when_youre/",
    "id": "1inrmkk",
    "selftext": "I was pricing out some all inclusive vacations for my family, and the value proposition seems so bad when you don’t drink alcohol. I’ve gone on them in the past and have drunk sun up to sun down and “really got my money’s worth” lol. \n\nIt’s funny, I’d rather spend more on a self-directed trip than spend less at an all inclusive and “miss out” on the full offering of booze. In my case it shows how much the decision to go to a crappy resort you just get stuck on for a week without really experiencing much other than drinking in the sun is influenced by limitless alcohol. \n\nEvery day more reasons not to drink reveal themselves! \n\n",
    "comments": [
        {
            "author": "Alkoholfrei22605",
            "body": "I went to an all inclusive with my wife and kids in my ninth year of sobriety. Had a great time. Drank Heineken Zeros to my hearts content. Also, I think the resort lost money from all the food I ate. To each his own.",
            "score": 93,
            "replies": [
                {
                    "author": "FoggyBottomBreakdown",
                    "body": "Same here. Done two AI trips since I stopped drinking and I became friendly with the coffee shop people for all the coffee, tea, and pastries I consumed throughout the day. Plus, Heineken 0’s and virgin piña coladas while standing in a pool really hit the spot.",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "mkultrahigh",
                    "body": "Which resort did you go to that offered Heineken 0.0%? Was it included or did you have to pay extra for it?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Necessary-Emphasis85",
                            "body": "We go to Bahia Principe Mayan Riveria (4 hotels in one location, about 20 diff restaurant options). They have Heineken 0.0, you just need to ask. The Jamaica location is also great.\n\nI've done about 4 trips there and in a double room from Canada with flights and transfers have paid about 2000 a person.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "mkultrahigh",
                                    "body": "Thanks for the info!!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "throwfarfarawayy99",
            "body": "Some do lesser packages with the alcohol as an add on iirc",
            "score": 24,
            "replies": [
                {
                    "author": "WellThat5ucks",
                    "body": "Cruises often do this",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheAimlessPatronus",
            "body": "I went to one with my fam recently and it was still really fun. It was a kid friendly resort, so every bar had a NA menu for the kids. Exactly zero employees gave me a hard time, I made sure to tip even when there was no booze because they still made me a nice drink.\n\nIt was totally fun! I am happy I remember the trip, the kids won't be this young for long.\n\nEdit: I probably ate my weight in food every day. I do not feel that we took a L on cost haha.",
            "score": 18,
            "replies": []
        },
        {
            "author": "TinanasaurusRex",
            "body": "Depends on where you are, some places the alcohol is cheaper than the mix. So if you drink coke all day instead of Cuba libres you are getting your moneys worth.",
            "score": 9,
            "replies": []
        },
        {
            "author": "XQMi",
            "body": "I love to not do all inclusives just to immerse myself into the culture more and have more control over finding fun restaurants to eat at and walk the towns, do some fun activities. Did Costa Rica with a good girl friend of mine for a week at a volcanic spa resort and we were up at 6am doing birding tours, rappelling from waterfalls and then visiting local restaurants for some great cuisine. Best sober vacation ever that wasn’t surrounded by wasted people 24/7.",
            "score": 6,
            "replies": [
                {
                    "author": "OkMacaron493",
                    "body": "Where were you at? That’s exactly what I want to do.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "XQMi",
                            "body": "Check out Arenal and we stayed here: https://www.volcanolodge.com. They help you find any activities with shuttle also from airport!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sodahound",
                    "body": "Such a better itinerary than never leaving the resort and just gettin numb all day",
                    "score": 2,
                    "replies": [
                        {
                            "author": "XQMi",
                            "body": "Exactly like I just can’t do all inclusives. I did once and it was hell for me at least on ours with people just obliterated in a compound. I’d rather just be free to roam.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "VardaElentari86",
                                    "body": "I was all inclusive last year and didn't have that at all - maybe location dependent? There's no enforced trips or anything!\n\n(Although I can see the argument that if you kind of paid already then annoying paying for more meals etc)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "floppydo",
            "body": "I'm glad that this line of thinking is helpful to you, and I can certainly understand how it would be, but I find the sour grapes version of \"justifying\" my choice to be AF very unhelpful for me personally. All it does is make me feel guilt and shame for all the time I did spend drinking and the choices I made surrounding that habit. Focusing on how much happier and more energetic I am in every situation without alcohol and being grateful for that is way more helpful for me. It puts me in a frame of mine to look forward to the rest of my life rather than regretful of my past decisions.",
            "score": 10,
            "replies": [
                {
                    "author": "Sodahound",
                    "body": "Love that for you! Thanks for chiming in with what works for you. I look forward to the rest of my life, but also like to reflect on how I’ve changed since I stopped drinking, and how alcohol influenced my past decisions. That self examination reinforces my good decision to get AF even further.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dutch780",
            "body": "I agree 100%",
            "score": 4,
            "replies": []
        },
        {
            "author": "oneminutelady",
            "body": "I'm currently at an all inclusive and am AF. Doesn't feel like a waste. I am living every moment of this vacation.  No alcohol to dull the experience or let me forget anything. I paid for sun and sand to get away from snow and I'm am outside every waking minute. I'm getting my money's worth!!\n\nBonus, no hangover so I'm up early and can snag the best loungers!!",
            "score": 2,
            "replies": [
                {
                    "author": "SinoSoul",
                    "body": "Ha! Enjoy your snowbirding! The 7am fight for lounge chairs by the beach is real.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ruforscuba2",
            "body": "To add, It’s so annoying to be surrounded by drunk people who are there to drink their moneys worth. Even though I’m in no place to judge, I find myself observing and judging and that’s just not fun. It’s way better be surrounded with people who didn’t come for the alcohol. There’ll be drunks everywhere on vacation but they certainly seem to be very concentrated at all inclusives.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rowmyownboat",
            "body": "It was also a waste to go when I was drinking, but I did not see it that way then.",
            "score": 2,
            "replies": []
        },
        {
            "author": "abaci123",
            "body": "Waste or get wasted. I’ll waste any day!\nThat said, I’m self-directed in Buenos Aires right now.",
            "score": 4,
            "replies": []
        },
        {
            "author": "judijo621",
            "body": "Should be offered 2 vape pens, one indica & one sativa, at launch. Refills available. Happier guests, cheaper for the cruise lines.",
            "score": 3,
            "replies": [
                {
                    "author": "Sodahound",
                    "body": "Earlier nights so probably less staffing, but the food budget would be through the roof",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hmm_would_bang",
            "body": "It depends. Sandals for example includes 2 free scuba tanks per day as part of the all inclusive. If you go two or three days that pretty much makes it all worth it honestly. \n\nBut yeah, not interested in doing a Cabo booze vacation without the booze. There needs to be other exciting adventures included.",
            "score": 2,
            "replies": [
                {
                    "author": "Sodahound",
                    "body": "Totally agree. Of course many offer other things to do, but many can be very booze-centric places",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SinoSoul",
                    "body": "I rented a car (hence no drinking) and took the family to Todos Santos, Cerrito beach, deep sea fishing, local playa, in addition to top tiered restaurants (Flora farm, Tre Galline), visit old town, etc.’ for a week. There is absolutely no need to do a booze cruise in Cabo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SinoSoul",
            "body": "I mean, obviously? The ones I go to charge additional US$85-95 for child under 16, and even that’s a ripoff. You go to AI in Mexico/carribean for the brainless convenience and relaxation time, which is achievable with, or without, the booze. How much that is worth is dependent on your parenting “style” and personal needs. \n\nI really like Hyatt Ziva Puerto Vallarta for the swim-out rooms, and the proximity of the hot tub to the ocean waters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zignut66",
            "body": "That kind of travel is just such a waste of time and money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical-Fox431",
            "body": "I agree, I think back to all the years I just went to a cheap all inclusive rather than having actual adventures and it just feels like such a waste of what could have been such memorable experiences. Life truly begins when you put down the bottle.",
            "score": 1,
            "replies": []
        }
    ]
}