{
    "title": "Restart",
    "author": "Shakey_B",
    "subreddit": "stopdrinking",
    "rank": 31,
    "score": 11,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1inr940/restart/",
    "id": "1inr940",
    "selftext": "So here I am, back to day one (how can I reset my counter?). It’s taken me ages to come here, I knew I had to, I’ve not been honest with myself. \n\nI was completely sober for some four years and then over the last 18 months I’ve been ‘enjoying’ the odd glass of wine, the odd pint. I’ve been with my current partner for three years and he doesn’t drink much, so every now and then I tell myself that I can enjoy drink in that way. And I was for about a year. \n\nBut now my Mum is dying and some things in my relationship have been difficult and so I’ve started buying alcohol and drinking at home alone. I’m not at the level that I was, and I have been able to do things like ‘just have 3/4 of the bottle of wine’, or ‘buy two miniature bottles of wine for the evening’. I’m scared about the slippery slope, I’m scared about my liver, I feel terrible about myself. Really terrible. To succeed for so long and then fail, it’s really shit. I guess that’s why I haven’t come and asked for help until now, I feel lots of shame. \n\nSo here I am again, leaning on this community and asking not to drink with you today. Just today, first. And then tomorrow, and tomorrow and tomorrow.",
    "comments": [
        {
            "author": "RealityRelic87",
            "body": "You’re doing great! Many don’t get to this part of sobriety where it can be in and out. Someone life or death. Some it’s ways to do better and some just stay sober. I think we all are allowed to figure out those details with support.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Alkoholfrei22605",
            "body": "Welcome! IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tess_88",
            "body": "You’re here! I’m sorry you’re having struggles - life is fucking hard sometimes. I had so many day 1s and day 20s and days 50s. I even had almost 4 years of sobriety way back but then my son got lost in the world of opiate addiction for a few years and well, I broke. He made it through as did I. Please keep faith in yourself. Sobriety is a journey - with many zigs and zags. Glad you’re here ♥️IWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}