{
    "title": "Chronic Relapsers that Finally Stuck the Landing",
    "author": "HubbbbaBubbbba",
    "subreddit": "stopdrinking",
    "rank": 26,
    "score": 12,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1ins31v/chronic_relapsers_that_finally_stuck_the_landing/",
    "id": "1ins31v",
    "selftext": "Question for you sobertarians that were caught in the hamster wheel of relapse for years but then...something clicked and now you are a year + into the journey. Please share with us what it was that made the change...",
    "comments": [
        {
            "author": "corajade17",
            "body": "I'm new again but... I don't have a choice. I messed up for the final time on Sunday and if I get blacked out again, my wife is going to leave me.\n\nThis day 3 is the easiest it has ever been for me. Every time I say no to alcohol, I'm saying yes to my wife, and my hopes and dreams for a healthy body and a happy life.\n\nI've quit nicotine before and I hit a similar point on my last go around. You have to know and feel that you're done. I'm glad I am, I hope you are too. You have to want to stop and never look back. It'll always be a struggle but when you are purely and truly motivated, you'll know.",
            "score": 7,
            "replies": [
                {
                    "author": "TrixieLouis",
                    "body": "It’s the old give up one thing and get everything in return. Conversely, give up everything for one thing. May your journey be smooth. IWNDWYT!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "HubbbbaBubbbba",
                    "body": "Keep on, friend!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "McB56",
            "body": "Two big things:\n\n1) I recognized I have a voice in my brain.  That voice lies to me, saying things like \"You can have just one drink\" and \"You've definitely demonstrated that you have it all under control, you can moderate again\".\n\nI can't moderate and I won't moderate.  I know that now, I've done the experiment over and over.  I can't resist the second drink, but I can resist the first one.  That realization is a huge part of my success in my current run.  When that voice starts talking to me, I tell it to fuck off.\n\n2) Disgust at myself.  My last night drinking in 2019, my wife had been very sick with the flu.  High fever, sleeping all the time.  I used that opportunity to start drinking earlier in the evening and drink more.  I woke up one morning, hungover, and saw that I had watched multiple hours of HBO and had zero recollection of it.  I realized that had my wife's illness turned for the worse, I wouldn't have noticed.  I wouldn't have been able to take her to the ER.  I wouldn't have been able to take care of our 13 year old son.  I was disgusted at myself.  I resolved never to put my family in that position again.\n\nBest wishes, friend.  I will not drink with you today.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Alkoholfrei22605",
            "body": "Allen Carr’s “Easy way to stop drinking” reprogrammed how I think about alcohol. It is a poison. I don’t crave or drink poison.",
            "score": 7,
            "replies": [
                {
                    "author": "HubbbbaBubbbba",
                    "body": "Read it and read the rip off follow up This Naked Mind. It is good info but wasn't the magic pill for me that it was for others.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Roach802",
            "body": "a lot of the change happened before i actually stopped. I didn't think it was a problem, then i realized it was a problem but didn't want to stop, then i realized it was THE problem (or at least the one I had to fix first) but I couldn't stop, then I started to hate my life.  That was a 3-4 year process. One day I drank a quart of Gin and blacked out.  I was sick for 2 days, and something switched inside me. Haven't drank since.",
            "score": 5,
            "replies": []
        },
        {
            "author": "DriftingPyscho",
            "body": "90 days in county",
            "score": 3,
            "replies": [
                {
                    "author": "HubbbbaBubbbba",
                    "body": "lol that works too",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ruforscuba2",
                    "body": "Yup! That’ll do it. I spent a long weekend in cellblock after being arrested in a blackout and that was enough for me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "see-ptsd",
            "body": "I knew I had a problem for a decade, and tried to quit (with varying amounts of effort) for almost the entire time.  I got to the point that every morning I would have to walk to the gas station for a pint of vodka and bottle of gatorade, because I couldn't keep the gatorade down without the booze to quell the withdrawals.\n\nI was laying in my bed, blood pressure through the roof, waiting to die.\n\nAnd then, I saw Bill Burr being asked about how female comedians should respond to people saying that women aren't funny (I'm neither a woman or a comedian), and his response was \"Be undeniable\", and that hit me in just the right way.  \n\n\"What if I make \\*every\\* good decision?  What if I just have zero tolerance, no cheating, no trying to find ways around it, no failures or stumbles?\".\n\nIt was a very \"Do or do not, there is no try\" moment for me, and it all just clicked.  It was also bolstered by the fact that my withdrawals were hellish and almost killed me, and I know they would only be worse if I ever picked up drinking again even temporarily.\n\nSobriety is so simple and easy now.  Life is far from perfect (o how far), but I \\*have\\* a life.  No planning around my next drink, no running to different gas stations so they don't realize how much you drink, no juggling of loud trash bags full of empties that the neighbors \\*definitely\\* hear you putting out...",
            "score": 3,
            "replies": [
                {
                    "author": "HubbbbaBubbbba",
                    "body": "THIS. This resonates. Way to go, my man. Glad Bill Burr said that random ass comment that did it lmao",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AffectRunner",
            "body": "I decided to stop drinking for a year. At first it seemed like too big of a goal (one day at a time, as they say). But after 3 months, I didn't want to break my streak (it is easier to stay sober then get sober, for me) and just focused on that. \n\nAs I got closer to my goal I asked myself over and over whether I thought I kicked my bad habits and could return to alcohol without slipping into those patterns again. I never felt a confident yes. So, I continue to not drink. What I found is that after 6ish months of not drinking, the quietest peace took hold. It's something I would have never felt in the hamster wheel. \n\nGood work! I will not drink with you today.",
            "score": 3,
            "replies": [
                {
                    "author": "HubbbbaBubbbba",
                    "body": "\"The quietest peace took hold...\" Love that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NapalmMacbeth",
            "body": "I promise I'm not sponsored, but honestly the book This Naked Mind helped me the most. I'd always thought about liver damage, but I hadn't explored the other 5 hundred ways the stuff destroys your body. Like the brain damage incurred from even very moderate drinking. \n\nI guess I tend to look at things from a very scientific perspective, so it helped me where most stuff hadn't. Suddenly drinking seemed so overwhelmingly stupid, and not some fun reward.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Apart_Cucumber4315",
            "body": "My last drunk wasn't my lowest but I had been in the pit of misery for a while. I was sick and tired of being sick and tired AGAIN. I knew I had to make changes in order for this to work. Slowly I put one foot in front of the other and moved forward. \n\nAt first, my goal was just to make it through the first several hours. Then, my goal was to make it out of the withdrawal phase, which was usually around three weeks to a month for me. I felt better physically, but there was still a big mental challenge as I would ruminate about all the troubles that I had caused from the years of drinking. I went to support groups to help with this and was active in the meetings. My first 9 months I was really consistent with this as well; something that I did not do from previous streaks. \n\nAs day by day went by, I started to see little changes with things, however, there were still setbacks with life. I stayed the course and the motivation of not returning back to where I was kept me going. I'm still going right now, yet it's definitely scary that I've gone this far. My longest sobriety streak was probably around 6 months, and that probably even included me taking a drink and lying to myself that it didn't count, so maybe 4-5 months was the real date. It frightens me reading the stories of people that relapse after years, because all their stories is me in the past or could be me in the future. \n\nI feel like I am the definition of chronic relapser, yet the silver lining is that if I can make it here to post this, it means anyone reading this also can do it as well. \n\nIWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "HubbbbaBubbbba",
                    "body": "I feel this. Same boat. Same fears about 20 years sober then fall into the pit again. But there are those that never do. Let's be them. 👊",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "nochedetoro",
            "body": "I talked to my therapist about it for a while and made a plan. I recognized the voice saying “oh come on you can have a drink” isn’t me but the addiction. And I focused on saying no one day at a time instead of “forever”. Now when I think “one drink wouldn’t be so bad” I tell myself “then why did you have to quit?”",
            "score": 2,
            "replies": []
        },
        {
            "author": "Extra-Seesaw6345",
            "body": "Ending up in the ER after a withdrawal seizure. Not a recommended method, but it's the one that stuck for me!",
            "score": 2,
            "replies": [
                {
                    "author": "SoberWriter1024",
                    "body": "My second trip to the ER (over 6 months ago, but I had been quitting and relapsing with increased periods of time between relapses for about 2 years before this) did it for me, yup. Not a seizure, but withdrawal bad enough it was getting there! I'm kindled to shit.\n\nIt was the nurse who told me I'd stop breathing in my sleep if I mixed the librium they gave me with alcohol that stopped me in my tracks. She wasn't nice to me at all. They didn't even give me a room. I was in the hallway watching all the insanity of the ER around me. Now, I'm on anxiety medication that increases my chance of seizures if I drink, and I still repeat the not-nice-nurse's words of dying in my sleep to myself if I get a craving. Safe to say cravings don't come too often anymore.\n\nDramatic, but I was such a chronic relapser and 24/7 \"fall off the face of the earth\" bender drinker that it had to be to get me on the straight and narrow.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tess_88",
            "body": "I just got sick and tired of being sick and tired of myself. I was sooo weary of the self-loathing. I deserved better. I still get up my grill about stuff but I absolutely do not hate myself EVERY FUCKING DAY. IWNDWYT 🦋♥️💪🏼",
            "score": 1,
            "replies": []
        }
    ]
}