{
    "title": "What is THE biggest mistake you have made while trying to make a streaming career?",
    "author": "solarelix",
    "subreddit": "Twitch",
    "rank": 3,
    "score": 49,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 106,
    "url": "https://www.reddit.com/r/Twitch/comments/1je4jhs/what_is_the_biggest_mistake_you_have_made_while/",
    "id": "1je4jhs",
    "selftext": "I am interested in hearing the streaming experience from people so others can learn from it! :)",
    "comments": [
        {
            "author": "Brettinabox",
            "body": "Thinking I didn't have to be in shape physically. Takes a big toll to be present and have energy for others.",
            "score": 75,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "THIS!!!! Working out is super important after sitting down for a couple of hours",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "FerretBomb",
                    "body": "Not only for the physical stamina, but also because being in shape helps with general physical attractiveness.\n\nAnd as much as people say not to judge a book by its cover, the cover IS the first thing you see, and will significantly color many of your interactions with the interior... including if you even give the book a chance at all.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Square-Woodpecker-82",
            "body": "I'm creeping up on my 2 year mark. I'd say my best advice is to be as talkative as possible. I'm not saying just spew garbage the entire time, but it's better than me watching you saying nothing with a blank expression. Aldo, find your niche. Sometimes, it might be alluring to be playing the newest biggest baddest game on the market. Due to the amount of over saturation, it might be best to atsrt with smaller games until you pick up some steam to branch out. My own personal thoughts, so don't sweat the small stuff. Best of luck out there, my friends! Stay positive and take breaks",
            "score": 41,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "This is a golden comment right here! Tho It can be really difficult to talk when you have no chat, but milestones are called that for a reason :)",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Square-Woodpecker-82",
                            "body": "Thanks for the great question! I dropped you a follow as well",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "solarelix",
                                    "body": "Thank you sm! Keep spreading positivity :)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "melodyrayne",
                    "body": "How do you get people to come visit your stream and/or follow? Other than friends and family of course. I’m having a hard time figuring out how to “market” myself.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Square-Woodpecker-82",
                            "body": "The Twitch discoverability by it's self is horrible. I definitely recommend posting clips and shorts to tik tok and youtube, respectively. Also finding groups on Facebook, reddit, and Discord can be a big help.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "melodyrayne",
                                    "body": "Thank you for the suggestion 😊",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Key-Boat-7519",
                            "body": "Finding your niche and having quirky perks like catchy phrases worked for me. Also, I've tried Pulse for Reddit, TikTok shorts, and YouTube to connect. Pulse helps with knowing what's popular right now.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "melodyrayne",
                                    "body": "I will try those things, thank you 😊",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YknowNeb",
            "body": "The biggest mistake I made and that I’m sure various others make is expecting almost instant success. You are so statistically unlikely to stream once and blow up. It’s a very slow process that if you aren’t dedicated to it, and you let it get you down, you won’t make it.",
            "score": 37,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Yes! It takes some people years to make it.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Foggyskill_gaming",
                    "body": "This shit is so true",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "KilianMusicTTV",
            "body": "One of the biggest mistakes I made in my streaming career was running a 24/7 subathon for nearly two weeks. On paper, it was a huge success - growth was up, revenue was great, and viewership looked strong.\n\nBut it came at a cost:\n\n* Lurking killed engagement - Viewers got used to keeping my stream open without interacting. Even when I was live, chat was quiet despite high viewership.\n* Viewers checked out - Some checked in, saw I was sleeping or away, and eventually stopped coming back.\n* It became a grind - Streaming that much started feeling like an obligation, not a passion. And when your joy fades, so does your audience's.\n\nLesson learned: What looks like success at first can hurt long-term momentum. Numbers don't build communities - engagement does.",
            "score": 16,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "This is such an important point of view to consider! Thank you for sharing.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheSilentTragedy",
            "body": "I'm on hiatus and I don't really stream for a career, but a big mistake I made was letting a friend talk me into doing collab stuff with them. Don't feel forced to do group stuff, solo is great too. \n\nI'm not sure if it was my friend that was the issue - when they stream they never mute when they're talking to their chat and will basically read out every message like \"X says...\" which makes streaming with them hard, then will kinda yell if people talk over them - or just being in a collab itself, but I often found myself staying silent more and as a result wasn't having a good time...which meant I often deleted the stream VODs right after. Even though I don't stream for a career, it always felt like that time was being wasted.",
            "score": 8,
            "replies": [
                {
                    "author": "XxSpiderQweenxX",
                    "body": "I rarely mute when talking to my chat, but i will if i feel like im bothering others, but i have been with other streamers who talk non stop to their chat and that is definitely annoying! This is also just something a lot of my streamer friends do as well (talking to chat with collabs, but not talking nonstop to them xD) but i used to ask new collabs of that was okay with them...i think i need to remind myself to ask again because i often forget that not everyone likes that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "raw_genesis",
            "body": "Thinking I could make streaming a career.",
            "score": 23,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "I hope you found joy in something else :)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "raw_genesis",
                            "body": "Don’t get me wrong, I love steaming and I’ve been doing it for 13 years but it will never be a career for me and for 99.99% of streamers. To put it in perspective, during the huge Twitch data breach a few years ago it was reported that ”You’d need to be in the top 0.015% of all streamers to make the median US household income from direct Twitch streaming revenue.”",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "solarelix",
                                    "body": "Honestly I strive to be the best I can but not being from the US  make things easier and more difficult at the same time. There a lot more US viewers than Eu which makes the amount of people my stream can reach not that many, but on the other hand If I ever come close to making a living from twitch I will need much less than is needed in the US",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mightymiek",
            "body": "Not sticking to a schedule and engaging more on other platforms. IE, Twitter or not making content or shorts.",
            "score": 5,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Do people watch short videos on twitter? Never knew people used it to grow a lot!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mfkrwill",
            "body": "I've been streaming off and on for years\n\nAnd essentially the biggest issue with me is keeping a consistent schedule. \n\nHealth played a factor. Due to my mental health being pretty terrible I always have trouble breaking through the \"I'm too tired\" or \"I just don't feel like streaming today\" muck. Physically I'm a fat fuck that sits down all day anyway since I'm a video editor, so spending even more time on my computer is rough in general since I need to move around more.\n\nI'm back on a schedule for the most part now. I've been streaming jackbox quiplash on Thursdays and have only missed one stream out of 5 or 6. And I'm having fun doing it. I want to try to add a 2nd day soon to continue doing full playthroughs of games along with the quiplash days.",
            "score": 5,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "True! It’s so hard to get out of “I’ll stream tommorrow” (and then not streaming) habit.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "mfkrwill",
                            "body": "Yeaaah I had that with a bunch of stuff not even just streaming.\n\nHave music I need to work on, a podcast I need to work on, I wanna do comedic reviews for games and movies again. Life's just packed and I'm tired 😅",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "solarelix",
                                    "body": "Do a day at a time! Don’t try and fit it all in a small time frame or you’ll burn yourself out.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FerretBomb",
            "body": "The biggest mistake?  \nGoing into streaming and expecting it to have *any chance* to become a full-time career.  \n\nThe odds of it ever happening are so ridiculously low, it's pretty safe to say that it isn't going to happen if you're reading this. There might be exceptions, but the likelihood is ***overwhelmingly*** against on a level that's tough to fully convey.  \nLike reaching blindfolded into a 50lb bag of rice and picking out one specified grain on your first try. While it's inside a running concrete mixer.\n\n---\n\nPersonal mistakes? Bit of a toss-up.\n\nFocusing too much on trying to get perfect image quality and the technical aspects, instead of working on being more engaging and entertaining.  \nNobody gives the faintest shadow of a fuck if you are putting out crystal-clear 1080p60 video, if you're less interesting than watching grass grow. Just playing the game is not enough. You *need* to be an active entertainer, on-stage and mentally **present** for the entire stream.\n\nSecond, letting other things get in the way of stream consistency. I had to disappear for almost a year due to my day job at the time demanding ridiculous hours. I should have pushed back against that for *so* many reasons. But it is hands-down the #1 reason that I dropped from 600accv to 300accv to 100accv. People moved on. Can't blame them. Entirely my screwup.",
            "score": 21,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Just took a peek at your profile on twitch and I gotta say, props to you! I’m glad you did not give up and kept pushing for what you love doing. Thank you from sharing advice with all of us who need it. Keep on being great!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "melodyrayne",
                    "body": "What is accv?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "FerretBomb",
                            "body": "ACCV: **A**verage **C**on**c**urrent **V**iewership.  \nHow many people generally can be said to watch you; not the peak count, but the overall.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "melodyrayne",
                                    "body": "Oh thank you! Those are great numbers you have! But I’m no where near that lol so that may be why.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kyle_dntk",
            "body": "Not talking with no viewers, you have to treat it like your recording a yt video or people arnt going to pop in",
            "score": 5,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Agreed! It is also the hardest part for me!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "kyle_dntk",
                            "body": "Been doing it for like 3 years now and I still forget to go “yt mode” XD",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrewsFortress",
            "body": "Joined a stream team of a much larger streamer than I was. Myself and several others thought the streamer saw potential in us. Turned out that they just could see how fast our communities were growing and essentially wanted to absorb our communities into theirs. Made us stop promoting our own discord servers and we had to push a 'joint' discord server that the big streamer owned. Then said big streamer started spreading horrible rumours about the streamers on their team to turn viewers against them. I was hitting 400-500 average viewers at the time and when they started spreading rumours, I quickly went down to 100-150 after that. I was a full-time streamer for a couple of years, but had to quit in the end. They used their influence to make it so I couldn't financially afford to carry on. \n\nSafe to say they eventually showed their true colours to their own viewers and damaged their own reputation in the end. \n\nWhen a big streamer notices you, it seems surreal and you feel lucky, but they're not all good people trying to help you move up the ladder.",
            "score": 1,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "I’m so sorry that happend to you. People like that deserve a special place in hell. I hope you found a new community and have people that support you in what you like doing. I wish you a lot of success you deserve it :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "squeamish_cactus",
            "body": "Although I can see many flaws of mine both past and present, I think the biggest mistake i have done (and still regretting) is I didn't learn until many years later (like in my 9th year of streaming or so)  to **really deep dive into making shorts and other video for other streaming sites to funnel traffic to my twitch page.**  \n\n\n\n If i had learned this earlier how very important it is to actually do YT Thumbs, shorts and spend at least a day or so a week editing, I think i would be further along with ccv and my bigger goal of being able to put some profit back into the stream (more so then i already have) and doing give aways and stuff.  I think it's not that people lack the talent or gear on twitch  it's that twitch has a pretty low discovery and the smaller channels can be amazing but get over looked which is sad because i've watched , subbed , donated and followed many small streamers and to this day are amazing and some I consider good talented people. \n\nAs many note and have posted, this is why it is vital Now ah days to promote your content to other social media sites to help usher people to seeing your amazing content.  And that is my biggest \"Achilles' heel\". (i literally just spent $2,312 upgrading my gfx card, shure SM7dB mic, ram and CPU) and hoping the upgrades and creating more content helps.",
            "score": 3,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Yep it’s really important to branch out to other platforms!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrimMemento",
            "body": "I am very new, I’ve only been streaming just over 2 months but in the beginning I fell into f4f. Once I had done this with 4/5 people I quickly realised I had no interest in what they were playing. Nothing against them, I’m has not into the same games. Since then I will not f4f.",
            "score": 3,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "2 months and you already hit affiliate? Now that is impressive! Props to you for going after the games you like instead on staying on games bc of people :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LuminaChannel",
            "body": "Comparison is the thief of joy.\n\n\nLearn to enjoy what you're playing without trashing something else.\n\n\nWhen I was new i had the habit of doing that and multiple times i'd get a lurker who'd bring up that they liked the thing I didn't like. \n\n\nI truly understood this when I raided out to someone and their first reaction was to complain about issues in the game i raided them with. \n\n\nI never bothered coming back after that. I reflected on the feeling that gave me acknowledged that was how I made my viewers feel, and decided I won't make them feel that way.\n\n\nPeople watch streamers bc they want to share something in common with you, not because you're \"right\" about something.\n\n\nThis doesnt mean be a doormat. But you can hold back a little. You can have your own opinion without being a thief of joy. ",
            "score": 3,
            "replies": [
                {
                    "author": "jeriku",
                    "body": "This is amazing advice and I highly recommend OP reading it twice.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sifmist",
            "body": "Not making a YouTube vod channel earlier. All my past videos from Covid era is gone :(",
            "score": 3,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "That sucks :/ sp many good hours lost. But hey, there is alaways time for new streams :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "maeghs95",
            "body": "I think it would be getting my hopes up that more than a few viewers would be on my stream. I’m a smaller streamer and seeing low numbers discouraged me. I took a break from streaming for a bit because of this. Now I’m just streaming for fun or to show my friends certain games that I’ve been playing while talking to them in discord",
            "score": 3,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "It looks like that break paid off! (Judging by affiliate badge) Glad you found a way to stream and enjoy it. May many more viewers see your stream :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SlomoLowLow",
            "body": "Letting political discussion happen. Lost A LOT of followers when I had a load of trump supporters come in and start praising him and yelling TRUMP TRAIN and shit like that and promptly told them fuck trump and fuck off.\n\nStill haven’t really recovered. Went from 15-20 viewers average to 5-10 and from gaining 60+ followers a month to like 10. Definitely avoid politics in every way. Make rules about it. Be clear about them. If politics gets brought up shut that shit down immediately with time outs followed by bans. Don’t let people know your thoughts on world events. No one cares and they probably disagree with you.",
            "score": 6,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "People just find more and more ways to hate eachother. That’s really sad.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FerretBomb",
                    "body": "Yep. Nana's Thanksgiving house rules apply well to streams too.  \nNo politics, religion, or talking about illegal activity.  \nAll those do are divide people and cause friction.\n\nI'm fairly outspoken about those views on other platforms (FUCK TRUMP and his Nazi cronies and regime shit), but I keep it off the stream as we all have gaming in common, and that's the subject at hand during one.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "-NerdWytch-",
                    "body": "Hard disagree. I will always get loud about where I stand and what I stand *for* because I'd rather be on the right side of history than be silent about all the fuckery taking place since that moronic buffoon took office. And I want his supporters to know they're not welcome here, even if it means I stream to an audience of 1 for the rest of my life lol. \n\nBut that's me, you do you",
                    "score": -1,
                    "replies": [
                        {
                            "author": "SlomoLowLow",
                            "body": "Eh from a financial standpoint losing the whales wasn’t really worth it. I know my viewpoints are on the right side of history. No one’s views are going to change because some guy on the internet said so. They’ll just change the channel. This was all completely avoidable by just avoiding the subject entirely. I wouldn’t have known any different had the opinions not been brought up to begin with. \n\nIt went from streaming covering my internet bill and any new games to this month I actually lost money streaming lmao. Don’t shoot your whales. If someone is throwing you hundreds of dollars a month, keep them happy. Cause I’ll tell ya going from hundreds of dollars a month to $20/mo definitely hurt.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "-NerdWytch-",
                                    "body": "Idk, I feel like I picked up more followers just by getting loud about it lol. It's definitely not my central focus, but 🤷 I'm not really a quiet person overall lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "luka1050",
            "body": "Thinking YouTube doesn't matter. Youtube + TikTok is literally all that matters and it's kinda sad.",
            "score": 6,
            "replies": [
                {
                    "author": "melodyrayne",
                    "body": "I have been reading that across Reddit suggestions. I don’t have a presence on either and man all the research I’m doing try to to figure this all out, has become its own job 😂😅 I mean I’m willing to put in the work, but for someone who didn’t “grow up” in this, it’s tough",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "solarelix",
                    "body": "True and it’s not easy to grow on there either.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "shanep1991",
            "body": "Believing in the glass half full comments:\n\"just hit go live, it's that easy\"\n\"keep grinding, you've go this\" \n\"your time is right around the corner\". \nStreaming soon became a full time job for me, for almost 2 years before I had to give up. Sometimes these glass half full comments are quite shrouded as after all there's no guarantee of success no matter what you do. I do sometimes wish I had those 2 years back but at the same time I have made some lovely connections.",
            "score": 4,
            "replies": []
        },
        {
            "author": "CaptainSebT",
            "body": "Poor streaming/life balance and fixating on numbers without context was really bad for my mental health. My numbers dropped at one point and stayed low for a year I exhausted everything I could to fix it and only recently have been happy with numbers hopefully they stay that way or continue growning but a few months ago a friend was like.\n\n\"Oh that's when back to work was called in the US\" it was called at a different time here so I simply didn't have the context to understand the sudden and abrupt change.\n\nI made other mistakes but that one was bad because it causes me to push myself really hard thinking I had done something wrong.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dumbhelodoc",
            "body": "Biggest mistake I’ve made so far is mass buying all these extra things I THOUGHT I needed to be successful. I bought close to $2k worth of equipment and I found I didn’t know as much as I thought I did. Arrogance kills. Humbled I was, that’s for sure.",
            "score": 2,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Mistakes are there to be learned from. It happends to all of us :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joey_TheMoose",
            "body": "Don’t sleep on the collab streams! I had a chance to co-stream a massive playthrough with a “smaller” streamer but I passed cause it would have interfered with my schedule. Not only did that streamer blow up fast (she has a bigger following than me, not like a huge streamer or anything) but co-streaming with the combined chat and viewer count is sooo beneficial to a small streamer. Organically reaching an audience you normally wouldn’t is so beneficial!!",
            "score": 2,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "True! But still t has to be a streamer that aligns with your values",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JellyGhostVirus",
            "body": "Thinking I had to put up with my Twitch leader being a creep towards me because he helped me get to affiliate",
            "score": 2,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "Had my fare share of creeps. It’s always best to not give them any attention.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JellyGhostVirus",
                            "body": "Yeah I mostly didn't. I just ignored him calling me pet names and then just started avoiding being in voice chat with him when I noticed he only did it there to avoid having evidence of it. Then he kicked me from the team but I kept 95% of the followers he helped me get despite trying to get people in the team to ban me from their channels because I banned him and his drama mongerers for harassing another friend they banned from the team in someone else's channel who was unrelated lol\n\nIn general, I've just learned when someone \"pretends\" their team is a cult, it's not a joke and I avoid those groups heavily",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "I’m so sorry that is your experience. Everyone should be shown the same kindness",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DeckT_",
            "body": "\"trying\" to make it a career is the biggest mistake i see all the time on this sub. unless you already have hundreds of viewers i wouldnt even consisder starting to think about hoping to make it a career. it should be a hobby first, something you have fun doing and do because you are passionate about it. Nobody starts gaming \"hoping to make it a career\" , and streaming should be the same. You dont start playing a sport or something with the only goal to make it a career, at first you start because you enjoy it and its fun and you become passionate amd grow from there",
            "score": 3,
            "replies": []
        },
        {
            "author": "rootbear75",
            "body": "Taking years off from streaming. If I had stuck with it back when I started, I'm 90% sure I'd be a partner and would have seen the growth I wish I could get now. It's much harder to get that growth now than it used to be when I started.",
            "score": 4,
            "replies": []
        },
        {
            "author": "mikeytlive",
            "body": "I don’t stream anymore but my “mistake” was not signing up to be affiliate earlier. I got raided by TimTheTatman back in the day and missed out potential subs and bits. Funny enough as well, I lost power later on in that night while streaming.",
            "score": 5,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "What made you not sign up for affiliate right away if you don’t mind me asking.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Fluid-Condition-1597",
                            "body": "If I can add my point of view. I reached affiliate yesterday but I still do not have average viewer count above 10. And because of ads which are “the must” thing with affiliate I am afraid it will lower my viewer count even more",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "solarelix",
                                    "body": "You can always play ads before starting the stream (on the starting soon) so your viewers don’t really have to watch them",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "rootbear75",
                                            "body": "This is incorrect. You have to play 3 minutes of ads every hour to prevent preroll ads.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "DanTheDraconian",
                                                    "body": "And at the top of every hour is when I schedule my break in to go stretch my legs and rest my voice, so it still works to run ads on the starting soon screen, just throw in a \"be right back\" screen too",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "rootbear75",
                                                            "body": "I run ads about 6 minutes into my stream because right after that is when I go \"live,\" so I can get the full 30min/1hr before running them again.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "melodyrayne",
                    "body": "I love that streamer!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vanillak1tty",
            "body": "I've been streaming since 2016. Love everything about it! A while back, about two years in I was able to apply for Partner and got declined. I basically self-sabotaged and stopped streaming and even claimed really loudly that I quit on Twitter.\n\nA few months went by and I came back, rebranded to Veekaytv, and I never recovered. ![gif](emote|free_emotes_pack|facepalm) I have an amazing core community now but I am not reaching partner numbers anymore. I don't think I'd still be streaming if I got Partner back then though, cause the way I was thinking about status and streaming is so much different than now, and I'm so much happier now with what I have!\n\nConsistency is key, and your goal should be community, not the game you play. (From my experience)![gif](emote|free_emotes_pack|slightly_smiling)",
            "score": 2,
            "replies": [
                {
                    "author": "solarelix",
                    "body": "What did you use to build your community if you don’t mind me asking? I’ve tried discord but find it hard to get people to join.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "vanillak1tty",
                            "body": "Back then I built on a niche, talking about the retro games I played and some of its history and fun facts (I used wiki to prep and do some research to have something to talk about). I also based my community on positivity, supporting each other and avoiding harsh discussions like religion and politics. People have their views, but a lot of us are looking for an escape from that, but still very aware of the real world. Everyone runs their channel differently, and if you want the heated discussions, that's your choice. Consistency is key, people don't really like much change. That being said, i've switched to variety with a hard focus on Phasmo, the retro folks stuck around cause eventually people stay for the streamer, not the game.\n\nPeople don't join my discord as much anymore but a way to get people interested is to remind them it exists. Having your bot pop up a message saying \"join our community discord at \\*link\" and when you see that message in your chat you can mention it Live.\n\nI hope this helps ![gif](emote|free_emotes_pack|thumbs_up)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "solarelix",
                                    "body": "Thank you for the input! What bot do you use? Nightbot or?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "vanillak1tty",
                                            "body": "I used StreamLab bot so I can use my emotes for free and the easy sound effect commands. Nightbot is a great bot to use! StreamElement has a bot as well. Try a few and see which one works best for you.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "solarelix",
                                                    "body": "Will do! Thank you again for sharing advice :))",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MissingNumber000",
                    "body": "Oh wow they declined? I figured once a streamer fulfills the viewership requirements, they're all but guaranteed to become a Twitch Partner unless the streamer is toxic or broke TOS.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "vanillak1tty",
                            "body": "You can have all the stats and still get rejected. A lot of streamers get declined on their first try and sometimes have to reapply 3-4 times before becoming Partner.\nThey used to be a lot stricter back in 2018-19 with their choices too, or so it seemed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tnap725",
            "body": "whistleblew on a pedo everyone was more content to play dumb get and clout from.",
            "score": 2,
            "replies": [
                {
                    "author": "corinthsaborcrys",
                    "body": "Yep same here. Needless to say I don't associate with those circles anymore and everyone is banned in my channel who associates let alone entertains the guy. \n\nI'm sorry I'm not playing nice to a verified creep and his lackeys to get more views. People like that deserve to be outed and reported. You did nothing wrong dude it's their problem not yours. You build the community you deserve. That's what I had to do. I got rid of all my followers and rebranded and started over. At least now I won't get cyberstalked and the people sent to disrupt my streams have no idea what happened to me.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "tnap725",
                            "body": "well said",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "melodyrayne",
                            "body": "Who are we talking about? Sorry new to all to this",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "corinthsaborcrys",
                                    "body": "I'm not dropping names but they're a part of the karaoke community. I personally love karaoke but being a female with kids has made me a primary target for these degenerates. I'm one of those who doesn't mince words when I get pissed. You disrespect me or my community I'll let you know. \n\nI've been focused on building my own community with people who just wanna have fun gaming, singing and don't want to deal with drama other karaoke channels seem to thrive off of. \n\nMy biggest mistake was playing stream politics  and calling out a m.a.p in a community where they are protected. Yes, they exist and it's hiding in plain sight. If you attack them or call them out be prepared for the backlash. Yes that includes death threats and stalking and doxxing.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "melodyrayne",
                                            "body": "There are channels/communities dedicated to karaoke? Like the activity? Sorry I know people have different terms for things and I just want to make sure I’m not confusing anything. \n\nI didn’t know what a m.a.p. was, clearly I live under a rock. But the fact that people protect them  🤮 gosh the potential risk with calling someone out is terrifying. Dude, that all really sucks",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "corinthsaborcrys",
                                                    "body": "Yes there are channels dedicated to karaoke. Some people use streamyard while others use discord. I host streams every other Saturday and I know others who do once a week streams. I personally find it fun and a good stress reliever to just sing  with friends.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "melodyrayne",
                                                            "body": "That’s super cool!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trojan_TheGreatVirus",
            "body": "I dont know easy to give up when i saw no one will watch my stream and wasting alot of hours",
            "score": 1,
            "replies": []
        },
        {
            "author": "NillaCreates",
            "body": "Trying to make a career in streaming 🤣 all jokes obviously, the biggest mistake i made was burning myself out really quick. Streaming all the time, every day, rain or shine. It worked wonders on creating an audience but I just was so ready to give up so quick. So just remember to take mental health days and listen to your body and mind 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joey_TheMoose",
            "body": "Don’t sleep on the collab streams! I had a chance to co-stream a massive playthrough with a “smaller” streamer but I passed cause it would have interfered with my schedule. Not only did that streamer blow up fast (she has a bigger following than me, not like a huge streamer or anything) but co-streaming with the combined chat and viewer count is sooo beneficial to a small streamer. Organically reaching an audience you normally wouldn’t is so beneficial!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smoll_and_Anxious",
            "body": "Creating a discord off the bat. It’s far too overwhelming for me to keep up with and code. \nShouldnt have made one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mottis86",
            "body": "The biggest mistake would be trying to make streaming a career.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maelfic",
            "body": "Trying in the first place xD",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mixtopher",
            "body": "Assuming some people will always be there just to disappear one day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "solinesn3p",
            "body": "Probably stopping or taking breaks inbetween. If I just stuck to it Id probably be somewhere now. Oh well. I like my vtuber journey so far though!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bagon666",
            "body": "Getting drunk. Being Live for ten hours. A viewer that cares for me watched the whole thing I didn't do anything stupid or weird/gross. They said I was just playing games normally then I just started crying and fell asleep. I deleted the vid but yeah thats my biggest mistake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rennen44",
            "body": "I initially found success in one demographic of people. I streamed a lot of racing/flight/military simulator games but then stopped streaming when my dad passed. I started watching a lot more streamers during my hiatus specifically in the speedrun demographic where the people and sense of humor are a lot more tame. I made friends there and when I came back to streaming, those speedrun friends made my streams fun and “successful” for about a year until I started dipping back into the simulator games. Old friends got involved and the sense of humor and vibes weren’t what the speedrun friends were after and it basically killed my streams.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alister6128",
            "body": "Coming down with a nasty case of the flu on the same day I made affiliate. Pretty convinced that break switched me straight from “fast rise” to “endless grind” — two years later I do respectably well for a hobbyist, but nowhere remotely near the momentum I had in the first 90 days",
            "score": 1,
            "replies": []
        },
        {
            "author": "cjamm",
            "body": "trying to make it a career instead of doing it for the enjoyment",
            "score": 1,
            "replies": []
        }
    ]
}