{
    "title": "Charles Olivera is also not interested in fighting Topuria: \"I will only fight him if he wins the belt... this is my weight class, I hold a higher ranking, I've been a champion before. This guy is all talk. If he wants to fight me he needs to come up, put the belt on the line & I'll take him.\"",
    "author": "LonzoBBBall",
    "subreddit": "MMA",
    "rank": 19,
    "score": 1593,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 633,
    "url": "https://i.redd.it/jnrr1o0msape1.png",
    "id": "1jdksvw",
    "selftext": "",
    "comments": [
        {
            "author": "LatterTarget7",
            "body": "Lightweight is at a weird place. Dana won’t make Islam vs arman. Islam doesn’t think ilia deserves it. Charles won’t fight ilia. Ilia won’t fight arman. \n\nBit of a log jam going on",
            "score": 966,
            "replies": [
                {
                    "author": "Reachin4ThoseGrapes",
                    "body": "That sounds like Michael Chandler's music",
                    "score": 286,
                    "replies": []
                },
                {
                    "author": "SquidDrive",
                    "body": "I think the obvious solution is having Topuria face Poirier, immediately establish him as no.1 if he wins and have him face Makhachev.\n\nIf Ilia is this avalanche coming to 155, surely a 37 year old Poirier can easily be overcame?",
                    "score": 336,
                    "replies": [
                        {
                            "author": "MrMogz",
                            "body": "I'd love to see it, but I don't think Dustin wants Topuria for his retirement fight either, IIRC Max is who he wants. Who knows though, perhaps Dana can entice him with some dollar signs.",
                            "score": 232,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "Point is, I think Islam has a reasonable stance, he saw how his 1st Volk win gets criticized, and now hes asked to essentially do that again, its fair for him to ask Topuria to establish himself as a top LW.",
                                    "score": 232,
                                    "replies": [
                                        {
                                            "author": "MrMogz",
                                            "body": "I agree 100%",
                                            "score": 41,
                                            "replies": []
                                        },
                                        {
                                            "author": "R1kjames",
                                            "body": "Islam definitely has a point. People call him a weight bully, but he can't beat the allegations if all the 155ers they send him are 145ers with delusions of grandeur.",
                                            "score": 32,
                                            "replies": []
                                        },
                                        {
                                            "author": "jahsabi",
                                            "body": "okay so who does he fight. yes we all understand islams perspective we have for a while, but the only guy ilia can fight at this point is justin. and justin seems keen on a title shot before he retires. ilia obviously can’t fight max again, and dustin wants a legend. is dan hooker considered a top guy that’s worthy of being a “hey i should get a title shot after this” type of win? would dan even take that fight? would they just rebook dan vs justin? ultimately this is why i just think they should book ilia vs islam, it honestly puts the division in less of a log jam than it would be if anyone else were to get the shot",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "Castr8orr",
                                                    "body": "None of that matters with Dan, dude sadly ain't fighting in a looooooong time.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Great-Improvement257",
                                                    "body": "How about the winner of chandler vs pimblett? I feel that would be a bug fight either way and he should get a title shot after a win",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "jahsabi",
                                                            "body": "i hope i’m not mistaken but ru referring to ilia fighting the winner? yea yk if paddy wins which i think he does that’s long time beef that can finally be settled as a title eliminator. would be amazing. paddy vs ilia in a 5 rounder, but would ilia wait that long? it’ll make  half a year since ilia last fought when chandler and paddy step in the octagon together, not to mention the few months that paddy would take off. ilia is planning on retiring in his very early 30s, i doubt he’d wait almost a year if not a year on a fight that isn’t even involving a title in paddy pimblett. and jesus christ god forbid chandler wins, not only is that a fight i don’t wanna see who knows how much ducking and diving or how long chandler would wait.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ThrowawayOrphan2024",
                                                                    "body": "Dariush is still ranked number 9 and apparently hasn't fought since 2023. I think he should be the first for Ilia to fight. It would be a bit of throwing a sheep to a wolf for Dariush, but I don't see anyone else being willing to take the fight with Ilia. Oliveira and Gaethje are both trying to angle for getting a title shot. Dustin wants to retire but wants it to be on a win, and he also wants to fight an established name at Lightweight. I think Dustin will probably angle for either Gaethje or Oliveira, but I think Dana will probably want them to fight each other. I'm fairly certain Arman won't settle for anyone but Islam, and I think Islam wants the same. I think Dana will put Dustin with Holloway since it is sure to be a slug fest, and Dana loves those. That leaves Hooker, Chandler, and Gamrot in the top ten, so they may also be good candidates for Ilia.\n\nBut then again, I am a bit biased. I don't like it when someone moves up a weight class and gets an immediate title shot. Maybe if someone has cleared out their division, I can understand it, but I feel there are other guys who should get an opportunity ahead of Ilia. Assuming Islam beats Arman and assuming Gaethje wins his next fight (if he has one), then I think after Arman, you have to have Islam/Gaethje as they have not fought each other before. Then you can have Ilia fight for the title (assuming he wins 2 in lightweight).",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "therealfakenews17",
                                                    "body": "Justin vs Islam, and strong arm one of Arman or Charles to fight Ilia for the next contender",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "jahsabi",
                                                            "body": "yea so in a sense dana eventually has to override someone’s opinion in order to make things right, but if i may ask why justin? for what reason should justin get the shot? is it off merit? because if so you could argue that charles arman and hell even max holloway deserve the shot before justin. justin’s last 2 fights was a loss to someone ranked lower than him and a win over a double digit ranked guy and now he gets the shot? i’m tired of justin getting special treatment, guy had a fight scheduled for dan (a striker) then instead of moicano or gamrot or dariush they give him fiziev (a guy who hasn’t got a win since he lost to justin, and again, a striker) i feel as though he needs a matchup that shows he’s ready to atleast ATTEMPT at dealing with islams grappling instead of just having a punchers chance, which is why id say: ilia vs islam, justin vs arman for title eliminator, dustin wants a legend so either max rematch or charles rematch, and then whoever ISNT fighting dustin in that scenario you give to dan hooker.",
                                                            "score": 16,
                                                            "replies": [
                                                                {
                                                                    "author": "RudeAndInsensitive",
                                                                    "body": "Arman is off the table. Dana said so.\n\nIslam is very reluctant to take on another FW. If we are going to consider any fighter's opinions here then Islam should be the one so that means Ilia is not in immediate contention.\n\nThat leaves 2 defensible options in Gaethje and Olivera. Olivera already lost to Islam and already pulled out of a rematch. Gaethje an Islam have never faught and bother fighters want to do it. \n\nWhy Gaethje? Because if you remove Arman and Ilia from the equation then he is the best of what's left.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jahsabi",
                                                                            "body": "dana never said no to ilia though. \n\nIlia brings a new threat, a new feel for the lightweight division. \n\nagain, justin has a punchers chance\narman already faced islam\ncharles already faced islam\n\nYou say justin, I say max, and how can you disagree? people say that ilia must earn his keep at lightweight because his past fights was featherweight division, so then essentially max last fight was against justin gaethje right? where he dominated and koed him? EVEN IF arman and charles are off the table, max should deserve it more than justin no?\n\nBut back to ilia. Similar to how dana is setting a deadline to strip jon jones of the belt if he continues to duck tom, nobody is exempt of having there opinion overridden.  \n\n“What does this title represent? It means you’re the best in the world and if you’re the best in the world, it doesn’t matter\n1030\nwho’s going to be standing across from you.\nWhat do I say? No? NEVER. Let’s do this!” these are the words of islam makhachev. this means that even if islam THINKS ilia should prove hes worth first, Both islam AND dana know that if he was handed the contract to fight ilia, he would sign. He might not agree, but he sure would sign.\nLastly even if from all this you still think justin should get the shot, you have to remember that topuria vs islam is the biggest fight since mcgregor vs khabib (also essentially #2 vs #1 p4p) and they are both unstoppable forces that only have one threat, which is each other. Whoever would win this fight is undoubtedly being semented in the top 5 oat, hell you could even argue surpassing jones, and being the goat.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RudeAndInsensitive",
                                                                                    "body": "My personal opinion is that Arman and Islam should get made and then the rest of the top 5 can just accept that and set fights accordingly.\n\nDana is taking Arman off the table. And in that case I like Islam v. Ilia. Islam however seems to be very reluctant to accept another FW fight and from his perspective I understand why. He already doesn't get due credit for his wins over Volkanovski. As a matter of a personal opinion if we are going to tell a fighter in this scenario to fuck off and fight who they are told then I don't think it should be Islam. The man has always done right by the fans taking short notice challengers when his contenders pull out and he is the champ. If any fighter's opinions are to be taken into consideration here it should be Islam.\n\nThe same stretch of thought that would keep Ilia out of a title fight keeps Max out. Forcing Islam to defend against Holloway is forcing him to fight an even less deserving FW than Ilia (or at least that is how Islam will see it) so it's the same thing as with Ilia. I'm sure Dana could force Islam to do it but I don't know why he would since he could just set up Dustin and Holloway for Dustin's last fight and then do something better with Islam. \n\nThis takes us back to either Gaethje or Olivera for Islam and forcing the other to fight Ilia. Take your pick on that but I think Gaethje v. Islam makes the most sense of those options.\n\nIf Dana decides to force an Islam v. Ilia fight...fan-fucking-tastic. I will host a BBQ for that sort of fight. Although I doubt that is the direction he goes with this since it would just aggravate Islam for little gain to Dana.\n\nAnd to be clear, I don't think Justin deserves a title shot. But if Dana takes Arman off the table and Islam doesn't want another FW then Justin is the best option of the two men left.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Special-Accountant-5",
                                                    "body": "Why can’t Islam wait for a clear contender to emerge? \n\nIslams fought more recently than all of them, seems like all the contenders with the exception of Arman want to sit on their hands until it’s their turn to fight for the title.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HookahLungs",
                                            "body": "Both Volk wins get criticized, second one is “a fat Volk” or “a fat, alcoholic, depressed Volk” it’s actually hilarious how fans downplay their favorite fighters just to hate on the winner",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "TheClappyCappy",
                                                    "body": "Yea it’s unfortunate because the first fight is I would say probably Islam’s best or second best win on his resume rn behind Charles. \n\nSecond fight it would def say has a bit of an asterisk bc of the short notice, but Volk was imo top 3 p4p fighters in the UFC when Islam beat him. \n\nThat will always look good on his record in my eyes.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "a__v",
                                                    "body": "The first one rightfully so as he lost",
                                                    "score": -11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "HookahLungs",
                                                    "body": "Not according to the three people that mattered, in Australia",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EveningNo8643",
                                            "body": "there's a twitter account that recently said every one of Islams title fights were against former FWs",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RickySuezo",
                                                    "body": "That isn’t his fault, he’s just been fighting whoever they send him after his first opponent pulls out. Usually Volk lol.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "EveningNo8643",
                                                            "body": "lmao agreed",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Real-Human-Bean-",
                                            "body": ">Point is, I think Islam has a reasonable stance\n\nIt would be reasonable if he didn't have a belt. If he wants to pick and choose instead of fighting the next best guy, he should vacate. \n\n>its fair for him to ask Topuria to establish himself as a top LW.\n\nLet's call it what it really is, he's hoping Arman or Charles beats ilia so he doesn't have to fight him. This is like Jones hoping Curtis Blaydes beat Aspinall at 304.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SquidDrive",
                                                    "body": "He beat prime Volk, and that win gets used against him, why would he want to do that again, why should a long-reigning king of their division have less priority then a guy who just got coronated?\n\n\"Islam face another FW that did nothing at 155 to earn a shot, and if you win you'll get shit on and told you fought another FW and a weight bully.\"\n\nCan Topuria not beat a 37 year old Poirier? or a 36 year old Gaethje? can he not establish himself as a top LW? Why does Islam have to absorb all the risk again?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Shareholderactivist",
                                            "body": "Why does Islam care what some fans think? Some fans think it was a great win against the PFP #1 who was only one weight class below him. And Ilia did establish himself against a top LW— #5 ranked Max.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "maicii",
                                                    "body": "He fought at FW tho, it doesn’t mean much",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "TheClappyCappy",
                                                            "body": "Dog walked Gaethje",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "maicii",
                                                                    "body": "It doesn’t matter. Illia fought at FW in that fight. No one is disputing he can beat a LW at FW, people are disputing if he can’t beat beat a top 5 LW fighting at LW. If Charles were to somehow cut down weight and fight Illia at FW it still wouldn’t prove what Malkachev is asking. Whether or not he can beat a top 5 LW AT LW",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheClappyCappy",
                                                                            "body": "Yea ok that’s fair",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LaconicGirth",
                                    "body": "Ilia is a pretty decent star at this point no? And probably one of the more winnable matches for Dustin at the top",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "therealfakenews17",
                                            "body": "Problem is if Dustin beats Ilia, it puts him right back in the title mix. Does he want that? \n\nI think he’d prefer a legend, big draw fight, that doesn’t really have title implications win or lose",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "ItsMichaelScott25",
                                                    "body": "I also don't think the UFC would want that. It'd suck from a promotional standpoint to have a retiring DP knock off someone they want to get to a title fight. \n\nMax makes perfect sense because while Max is definitely in title conversations if he wins - if he loses he's still Max Holloway who is promotable no matter what. Max is one of those guys that doesn't need the belt to still be one of the most popular fighters on the roster. Plus if DP won the BMF belt and retired it just opens up the belt for them to use in another fight to market.",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Kurtcobangle",
                                            "body": "I mean obviously there is still a lot to be seen with how he translates to LW, but I don’t see why any Ilia would be a more winnable fight than others after what he just did to volk and max.\n\nMax moved up out of his natural class to fight Poirier and Poirier tee’d off on him all night without getting him out of there.\n\nIlia just toasted him at 145.\n\nGiven Dustins age and wear and tear I would still he hesitant to believe Ilia won’t get him out of there. A few years ago it might be different",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LaconicGirth",
                                                    "body": "Power is the last thing to go and Poirier is still a big LW with heavy hands. I think he’d have a better time in a boxing match with Ilia than he would a wrestling match with Arman, Islam, or Oliveira",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "HYDRAlives",
                                            "body": "Poirier's gonna fight Tim Sylvia?",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Nice_Dude",
                                            "body": "Dustin Porier vs Chuck Liddell",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "HYDRAlives",
                                            "body": "I thought Chuck was fighting Jones?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Shady_D_815",
                                            "body": "Chuck still has to get through his battle with addiction. I love Chuck and that hurt me to type lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "professorgaysex",
                                    "body": "You’d be wrong to think Dustin doesn’t want the Ilia fight. He actually has tweeted multiple times that he wants the smoke.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "ZWils23",
                                    "body": "Dana rarely gives up enough $$ to make things happen though, unless it's one of his butt buddies like Jon or (formerly) Conor or something. Otherwise he stays being a cheap prick",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "ClamSlamYourNan",
                                    "body": "That's weird to me. Dustin said \"legends only\" for his finale, but is beating max for a 3rd time really legendary?\n\nI would say that potentially stuffing Illia's double champ attempt would be more legendary. Defending your division from an invading hype train that already KO'd the featherweight elite is pretty sick.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "head_empty247",
                                            "body": "I think, Dustin mean he's fighting legends only, as in Max is a legends, and he's fighting him.\n\nNot that Dustin is claiming his final fight would be legendary.\n\nIt's the same reason why JJ choose to fight against Stipe for his 1st title defenses instead of facing Tom. Because Stipe is a legend and a household name at HW, even though Stipe is already past his prime when he fought against JJ.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Brilliant-Finger3683",
                                    "body": "A trilogy would completely pointless for Max who just moved from FW. All thise guys want a title shot, given they are all at the tail end of their careers. Within two years Islam, Do Bronx, Max, Gaethje, Poirier and maybe Hooker will be gone. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Emotional-Pirate-928",
                                    "body": "He has size over Max, I think it's a weak call out by Dustin",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EveningNo8643",
                            "body": "omfg if DP sleeps Illia as his final fight I'm going to cry",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "onyxcaspian",
                                    "body": "He's going to finish lllia with a jumping gilly, flip everyone off and then retire.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "captain_slutski",
                            "body": "Poirier doesn't want to retire off an Ilia fight",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "Pay him 3 million dollars and that man will travel by Raft to Spain from the Bayou if need be.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "EveningNo8643",
                                            "body": "If he won't do it for that money I will, hmu Dana",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "0zi1",
                            "body": "Ilia is only focused on fighting Islam for the belt or Charles. He’s confident he can beat Charles since he he leaves himself a bit open for Ilia to get a right hook on his chin. But he’s not about to challenge guys like Arman or DP. A lot of people underestimate DP, but once he gets his rhythm in the fight, he can be a real problem. Plus, DP hits way harder than anyone Ilia has faced so far. Max was already landing good shots on Ilia, so just imagine what DP could do.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "DP would be 37 by the time Topuria faces him. I am sorry but if he cant beat a 37 year old Poirier, he doesnt deserve Makhachev.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "maicii",
                            "body": "Either that or tell illia is either Arman or nothing dawg",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "therealfakenews17",
                            "body": "And what if Poirier beats Ilia? Does he still retire or does he give it one more go",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "Then just book Islam vs Tsaryukyan? Winner faces Topuria?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "piltonpfizerwallace",
                            "body": "Why would beating number 4 make him number 1? Shouldn't it just make him number 4?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DjangoDarkblade77",
                            "body": "Poirier only wants legends for his last fight, Topuria is not old enough to be a legend.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "head_empty247",
                            "body": "But why would/should Ilia fight Dustin anymore? Dustin isn't in the title run conversation anymore. If Ilia wants the title, he should fight someone who's also going for the title, like Charles, Justin, or Arman. And imo, Ilia should fight against Arman instead, since Arman's currently the *supposedly* \"Islam hardest challenge\".\n\nBut nothing wrong with a fight against either Charles or Justin either. I just feels like currently it's Islam champ, Arman 1, Charles 2. So if Ilia need 1 win before the title match, he should go for the 2nd best option here then, which is Arman. But he won't fight Arman, so...",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RudeAndInsensitive",
                            "body": "Dustin ain't taking Ilia as his retirement fight unless the bag is massive. Dana could set Porier v. Holloway for half the price Ilia v. Dustin would cost",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "okok890",
                            "body": " But if Dustin wins that just completely kills the division \n\nI’d just give the shot to Ilia if they aren’t booking Arman again",
                            "score": -3,
                            "replies": []
                        },
                        {
                            "author": "SquidDrive",
                            "body": "If 37 year old Dustin wins, then he didnt have a chance against Makhachev in the first place.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "okok890",
                            "body": "I love how this sub flip flops between best fighter and money fight depending on which side their favourite fighter is on.\n\n\nIf Ilia isn’t good enough to hang with lightweights having Islam beat him in a undefeated fw king vs p4p 1 is much better business wise than having Dustin beat him and gain nothing from it but destroying Ilia completely in the process.\n\n\nAnd honestly I’d say beating max and Volk back to back is deserving of a title shot more than beating bsd so it’s not like he’s completely without a claim.\n\nArman is most deserving but the ufc aren’t booking that fight again so booking the biggest fight they can between two guys that outclassed the best of their division seems like a logical decision money fight wise and contender wise tbh",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "SquidDrive",
                            "body": "So Islam should fight another FW, and get no credit because its a FW. The same shit that happened with Volk.\n\nIf Topuria really is who he says he is he should establish himself as a top LW, Islam is at the endgame of his career most of the top 5 at LW are, Topuria is still young. Islam has 2 years at most of prime left, he doesnt wanna spend his next defense on a FW.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "okok890",
                            "body": "Islam was called the best fighter in the world and one of the best all time after the beat Volk\n\nAlso beating Ilia does way more than beating Justin\n\nIslam should move up then.\n\n\nIslam only has 2 years you think so probably shouldn’t waste that on Gaethje instead of moving up or fighting an undefeated champions.\n\n\n\nAlso like how you completely ignore how terrible for business Ilia getting exposed by a as you say basically retired Dustin would be.\n\n\nIslam beating an undefeated champion that Koed max who Koed the guy most people are saying Islam should fight does more for him than any lightweight fight that isn’t Arman.\n\nNot sure what there is to argue here",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SquidDrive",
                            "body": "I am saying Topuria should be good enough to flatline a 37 year old Poirier, fight Islam and if Islam wins, he moves to WW. \n\nWhy are you so unconfident in Topuria vs a definitely past prime Poirier, were in the lighter weight classes ffs.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "okok890",
                            "body": "I feel like you just ignore whatever I say.\n\n\nBigger upsets than Dustin beating Ilia have happened\n\nPlus The fight makes no sense if I was a match maker All it does it potentially destroy Ilia’s reputation without anyone getting anything from it because the guy that beat him lost to the champion and 2 other contenders and is retiring. \n\n\nIf Islam beats him that just adds to his unbeatable image and puts him further up on the all time greats.\n\n\nI don’t think this should be hard to comprehend I apologise if it is.\n\nI’ll stop commenting now before I get overly repetitive",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CryptoCracko",
                    "body": "A love octagon",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "OlympianBattleFish",
                    "body": "Islam thinks he doesn’t deserve it but still said he would right him tho. I know he was saying what he wants but he’s willing to fight who they put in front of him.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "SquidDrive",
                            "body": "Bro saw how his Volk fights went and realize he wasnt gonna be given credit for beating a FW. He wants Topuria to beat another top LW.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "OlympianBattleFish",
                                    "body": "I know he wants that but I know he won’t turn it down.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Reez377",
                            "body": "Khabib and his manager already said he need to beat top LW and Dana himself isnt really interested while Islam said he don't want to give fw chance but if the fans want then let's do it, Islam is the one who called the shot",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MazeMagic",
                    "body": "Is the weird place not that these fighters have too much say in who they fight?\n\nShould just be contracted to fight and told what to do. It's their employment essentially at the end of the day?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fingerchopper",
                            "body": "UFC fighters are expressly *not* employed by the UFC. They're contractors, and contractors can turn down work. Also they're paid a pittance to take damage, are not unionized, make a tiny fraction of league revenue, etc.. They have little power in the relationship but are the assets.\n\nPersonally I don't think anyone should be forced to take life altering damage. Fighters are different, if they're really like \"nah I'm good,\" I feel I should respect that. Though -- I suspect these are often management decisions, probably to protect the money, rather than the fighters ducking.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Leetter",
                                    "body": "also isnt Ilias family already rich?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MazeMagic",
                                    "body": "Well it wouldn't be forced, they signed up to it.  \n  \nFeels like too many fighters are just like, \"nah I'm good, I won't fight HIM\" and it ruins the sport.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "fingerchopper",
                                    "body": "Both parties mutually come to terms, both parties sign on the line. Why should fighters give UFC freebies? It's not at all what they signed up for contractually.\n\nI understand, it's a drag when fun fights don't happen! Still, I wish people thought of these athletes like other workers. I don't do stuff outside of my job description - nor should they without due compensation. Just my 2 cents",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MazeMagic",
                                    "body": "How is it not what they signed up for though?  \n  \nImo, your job is, UFC fighter. Which means you fight for the UFC. \n\nSo when the UFC comes and say, here, you fight this person, you do it? It's your job. It's like an F1 driver saying, \"nah, I don't like this track so I'm not racing it\"\n\nHow the heck is fighting not in the UFC fighters job description? Lol 😂 I get what was said at first, UFC has a bad business if fighters have this much say. But you can't say their job isn't fighting",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "fingerchopper",
                                    "body": "They fight for the UFC, yes, *under certain agreed upon conditions.* Not any time, anywhere at the company's say so. You could also say their 'job' is to take punches but you can't just assault these guys.\n\nI think we agree how things are now, and the disagreement is on how things *should be*.  I dont think fighters should give up more protection to improve the product, it seems you do. I'm not sure we can change each other's minds.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "MazeMagic",
                                    "body": "Yeah I think that is what should change. Fighters have too much control over \"who\" they fight. They should fight who they are given, I can't see a reason they have a choice honestly.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LikeJambaJuice",
                    "body": "I reckon the fights to make are:\n\n- Charles Oliveira vs. Max Holloway 2\n\n- Ilia Topuria vs. Dustin Poirier\n\n- Arman Tsarukyan vs. Mateusz Gamrot 2\n\n- Justin Gaethje vs. Dan Hooker\n\nMake these fights by the summer and one of these 4 winners gets a title shot against Islam in Abu Dhabi in October",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Intention-Sad",
                            "body": "Disagree. Despite Arman’s shambles, on merit he should be next. Freezing the champ to wait for contenders doesn’t make sense when they are contenders available. If Arman fcked up again, put him way down the peck. In the meantime, Ilia definitely needs a win against the top echelons first",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "shenyougankplz",
                            "body": "How much longer we gonna delay Islam fighting again? You're taking all his potential opponents away, and then we're gonna have 4 people all saying they should be next\n\nGive Topuria the shot, if they won't do that then Gaethje is probably the most deserving. Tell Dustin look buddy we'll do the event in Lafayette or New Orleans like you wanted, and you can main event it. But you gotta fight Topuria/Gaethje, whichever doesn't get to fight Islam. I reckon Dustin loses either of those, but it keeps the other fighter busy with a quality win to solidify them fighting next\n\nIf Dustin does beat Topuria/Gaethje, ok they're out of title contention for a little bit, Arman gets the next shot and we move on",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "ItsMichaelScott25",
                                    "body": "> How much longer we gonna delay Islam fighting again? You're taking all his potential opponents away, and then we're gonna have 4 people all saying they should be next\n\nSeriously - everyone talks about all these potential contender matchups as if the champ should just sit back for the next year and wait it out. Someone has to fight Islam in the meantime.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "therealfakenews17",
                            "body": "I think Justin feels he paid his dues. Can’t see anyone getting the title shot but him or Topuria since both are fresh match ups for the champ",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "blussy1996",
                    "body": "No LW wants to fight Ilia, he’s too dangerous imo.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vernon-douglas",
                    "body": "ARMAN VS ISLAM LET'S GOOOOOOOOOOOOOOOOOOOOOOO",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NoDrama127",
                    "body": "Doesn't matter in what order, Topuria will knock them all out, including Islam. He represents the true new generation and is levels above everyone. Wait and see.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DjangoDarkblade77",
                    "body": "Dana made Islam vs Arman, it is not Dana's fault if Arman broke his back, now Dana sees him as unreliable for a title shot. Ilia should fight for the title, not because he deserves it more but because it is the fight we all want to see, Islam already beat Charles, Arman and can maul Gaethje in 1 round, Ilia is the only interesting fight.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "1998ChevyTaHoe",
                    "body": "Ilia going up to LW is the biggest disaster for the division rn LMAO",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "head_empty247",
                    "body": "Eh, I don't think so. If we remove Ilia from the equation, not so much log jam going isn't? But I agree with Charles though. Imagine going up a weight class and demanding a title match straight away, when there's legit no. 1 contender in the division. Who wouldn't be pissed? And I think Charles deserve respect here, because he's a former champ. And he also fought against Arman for the no. 1 contender spot. Not like this wannabe superstar who came up a weight class, refuse to fight any rank opponent, refuse to fight for the no. 1 contender spot, and demand a title match straight away.\n\nI'm like, if that doesn't scream entitlement, I don't know any better example than that. Perhaps, only second to JJ.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "berserker_1",
                    "body": "So Charles arman? ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jthememeking",
            "body": "Lightweight is so weird right now.",
            "score": 811,
            "replies": [
                {
                    "author": "frankster99",
                    "body": "It's getting kinda annoying. Feels like everyone's demanding shit but not wanting to compromise. The only person I think is fair to do it is islam. Also, the only person who seemingly isn't is arman despite his title shot falling through! I remember someone said the top 5 lightweights were only being divas a few years ago..... Still holds up apparently.",
                    "score": 468,
                    "replies": [
                        {
                            "author": "MoodApart4755",
                            "body": "The entire UFC is like this now, top 5 fight once a year cause they don’t feel like any opponents are worthy ",
                            "score": 118,
                            "replies": [
                                {
                                    "author": "frankster99",
                                    "body": "It's sad man",
                                    "score": 33,
                                    "replies": []
                                },
                                {
                                    "author": "R1kjames",
                                    "body": "It's because Dana doesn't punish the behavior. We wouldn't have this problem if he skipped down to #6 for a title fight, because #1-5 are inactive. Or he could just ~~jerrymander~~ gerrymander the rankings to favor fighters who've fought recently.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "nelsonbestcateu",
                                            "body": "Lmao now it's because Dana doesn't punish it. Make the guys millionaires and they'd fight anyone in the list. There's 2 sides to that coin.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "R1kjames",
                                                    "body": "Fighter pay increase would temporarily fix the issue for sure",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ManlyMeatMan",
                                            "body": "I'm sure he could make these fighters more active if he paid them more, but that's out of the question for obvious reasons. Ultimately, I see this as a UFC problem. They are in control of matchmaking, so they should be the ones criticized for this.\n\nAlso, not to be a dick, it's gerrymander",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "R1kjames",
                                                    "body": ">Also, not to be a dick, it's gerrymander\n\nLmao u right",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MoodApart4755",
                                            "body": "Oh for sure. Honestly these days I basically only tune in if I happen to be at home and remember there’s a card. UFC product is so boring now ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "B_da_man89",
                                    "body": "pay isnt enough.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Maybedontiguess",
                                    "body": "It's an appropriate risk assessment if you ask me",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TroyFerris13",
                            "body": "Dustin fought BSD",
                            "score": 90,
                            "replies": [
                                {
                                    "author": "EveningNo8643",
                                    "body": "so Dustin and Justin both fought down, but there was a time they were both doing the same and not fighting down in rankings despite losing title fights",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Any_Asparagus8267",
                                            "body": "Only reason they fought down specifically  dustin was he knew for a fact he could win that fight. He's on his way out and wants fights he knows he can win or a title. Don't really blame him",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "2heads1shaft",
                                            "body": "They fought down plenty, just because they were ranked 5 and below doesn’t mean they didn’t fight down.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "EveningNo8643",
                                                    "body": "At that point they had already had 2 title fights and were not wanting to fight down. Yes before that they did",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "turkeypants",
                                            "body": "When you lose a title fight, you don't fight down to #11 or 12 to get back on your horse. That's what people here were crying for them to do for Fiz, Gamrot, and Tsarukyan, the supposed next wave, all of whom went on to lose, and only Tsar has made it through. Gamrot got to mid table and is in yo-yo mode, and despite a couple of chances at beating a contender, Fiz is sliding and talking about cutting down. Anybody who wants to get to the top few spots can grind their way up like anyone else, taking the opportunities where they come. Unless the division sucks and has an unpopular champ, in which case maybe they can talk Shelby into putting them on the Sean O'Malley express train to the top for a sniper shot. This ain't that kind of division though.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "EveningNo8643",
                                                    "body": "and how are they supposed to grind there way up when no one at the top is fighting down? And yes you're right Fiz, Gamrot and Tsaryukyan did try with the first 2 losing. So what? Doesn't mean that Dustin and Justin shouldn't be fighting down despite losing there title shot opportunities TWICE. Three if you count Dustin losing most recently",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "turkeypants",
                                                    "body": "You're not hearing me - we're both talking about fighting down, you're talking about fighting down very low from very high. When you're 11 or 12, you fight 8 or 9 to move up, and then 5 or 6 next, you don't skip all the guys ahead of you and go straight to 1, 2, or 3. What are those other guys - chopped liver? Dustin fighting BSD was unusual and even that didn't stop the tears around here. Both of those guys fought down, and Charles too, don't pretend. Justin when he was at #3 coming off a loss fighting Fiz when he was at #6 coming off a win made usual sense so that's what happened and it went how it went, with no better proof than that needed of who belonged where. But it didn't make sense when Fiz was #9 and even lower, which is when people in here were filling their diapers about it, with the other two ranked even lower. It was a weird time in here with everybody getting amnesia about how guys climb the rankings.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RarefiedAir1",
                                            "body": "[Only justin fought down](https://www.reddit.com/r/MMA/s/JeLGG94pxf)",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "RarefiedAir1",
                                    "body": "but he ducked beneil to do it, he chose a more favorable matchup",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Neemoman",
                                    "body": "While yes, one time is not a pattern. It's an exception.",
                                    "score": -13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JuiceheadTurkey",
                            "body": "Gaethje should be recognized as well. He took a fight against Max and a short notice fight against Fiziev. And he was scheduled to fight Hooker.",
                            "score": 171,
                            "replies": [
                                {
                                    "author": "Due-Contribution6424",
                                    "body": "No less, he gave up waiting on a guaranteed title shot to take the max fight since it was UFC 300. I agree, he deserves credit.",
                                    "score": 134,
                                    "replies": [
                                        {
                                            "author": "frankster99",
                                            "body": "Yeah but recently he discounted that loss and called it an exhibition fight. Weird thing to say.",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "Batman-and-Hobbes",
                                                    "body": "Reading his whole statement I'm pretty sure he meant the fight wasn't supposed to be considered a title eliminator bout, just a special fight that wouldn't risk his ranking.  \n\nHe just chose the dumbest possible way to say it.",
                                                    "score": 69,
                                                    "replies": [
                                                        {
                                                            "author": "VinCatBlessed",
                                                            "body": "The irony is that he counts his BMF title loss as an exhibition match but he didn't discredit his BMF title win.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "frankster99",
                                                            "body": "True true",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "MatttheJ",
                                                            "body": "I get his sentiment but it would be really weird for him to get a shot over the person who just KO'd Max.",
                                                            "score": -6,
                                                            "replies": [
                                                                {
                                                                    "author": "basshead424",
                                                                    "body": "Yea but that’s a different weight class entirely",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MatttheJ",
                                                                            "body": "And? It's still weird for a guy to get a title shot over the opponent that just dominated him and knocked him out.",
                                                                            "score": -8,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "basshead424",
                                                                            "body": "If it was Justin was fighting for a title in that division then sure. But since it’s a different division, shouldn’t apply as heavily as you think. You should probably google what the word division means lol",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "MatttheJ",
                                                                            "body": "I know the difference but my point is regardless of weight class it's weird man. Max literally dominated Justin for about 23 minutes of a fight and KO'd him. Then Ilia became the first person to ever KO Max. \n\nThen to add to that, basically every single other champion that wanted to move up got an immediate title shot. So it's weird that Ilia apparently has to be held to a different standard when no other champion has to do that. Even champions with 0 defenses haven't had to fight a contender at the next weight class.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Top-Sympathy6841",
                                                                                    "body": "did you like it when \"other champs that wanted to move up got an immediate title shot\"? \n\nI didn't. And many others didn't either. it's about time we drop that weird standard. The only person topturo should fight is Paddy, end of story.  He's completely unproven at lightweight, knocking out volk and max in the twilight of their careers isn't going to age well.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MatttheJ",
                                                                                            "body": "Wait are people seriously so annoyed by Toporia that they're going along with someone using cheesy Colby style nicknames and saying he should fight Paddy (barely ranked) Pimblett? \n\nY'all aren't even trying to seem unbiased at this point. \n\nAnd yeah, I've been fine with a lot of champ champ fights. They usually feel bigger than normal tital fights and usually are between two bigger names than are available for either fighter in their own weight.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Top-Sympathy6841",
                                                                                                    "body": "champ champ fights are the reason so many divisions get fucked around and we lost out on so many good contender fights because of it.  It's a great way to kill the meritocracy of the sport and makes the rankings even more of a joke than they already are.\n\nits the most low hanging branch on the gimmick tree.\n\nalso you got a lot of nerve saying the word \"unbiased\" while drooling over topturo lmao.  He's obviously a great fighter, but its about time to put an end to shitty sport killing business practices.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "MatttheJ",
                                                                                                            "body": "Mate, I'm literally just laying out what makes sense or doesn't make sense pretty objectively. \n\nGaethje just got flat lined by Max, who got flat lined by Ilia afterwards. Gaethje since then has only beat an opponent who didn't even have a camp AND got taken down easily within seconds AND has already had multiple title opportunities (which doesn't exactly make an Islam fight and exciting \"what if\"). \n\nCharles lost to Arman, so it just makes no sense for him to get a title shot before Arman, especially if you want to maintain the \"meritocracy\" of the sport and since then his only win is over Chandler... Who should not be a title fight earning opponent. In his past 4 fights he's lost to both Islam and the #1 contender Arman. \n\nArman in my opinion deserves the fight the most, he deserves it more than Ilia because Arman is the actual #1 contender, he deserves it more than Charles because his last fight was beating Charles and he deserves it more than Gaethje based on what I just laid out for Gaethje a second ago\n\nHowever the UFC and the fans have gotten all up in their feelings about Arman pulling out so he's apparently not an option anymore. \n\nWhich literally only leaves Ilia. \n\nIlia isn't taking someone's spot, he's not messing up the order of the rankings, because there is no clear contender available. Well, except Arman... Who just isn't getting that shot a 2nd time without beating someone else first (which I don't agree with, but seems to be the reality of the situation). \n\nSo it means either Ilia gets it, even though he's not a lightweight, or a lightweight gets it even though they don't actually deserve it. \n\nFrom what I can gather, fans want Gaethje or Charles to get it... Simply just because they're fan favourites. I get it, I like them both, but neither deserve it under any sort of ranking or win streak perspective. The argument for them getting a shot is purely emotional.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Top-Sympathy6841",
                                                                                                                    "body": "is your definition of \"objective\" using mma math? because thats like 90% of your argument. \n\nalso, you are misrepresenting the arman situation.  Yea he pulled out short notice AND he didn't actually beat Olives in majority of people's eyes.  In that fight he almost got submitted twice and finished the 3rd round on the ground trying to survive with Olives giving him some tongue. That was a BS decision if you are a man of honor.\n\nJG and Charles both have more recent wins at lightweight than Topturo, that is about as objective as it gets. Stop trying to kill the topturo and paddy fight, they are 2 undefeated contenders with some actual beef, there is literally no better fight to make at lightweight.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "MatttheJ",
                                                                                                                            "body": "Decisionbot Oliveira vs. Tsarukyan",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DecisionBot",
                                                                                                                                    "body": "[**ARMAN TSARUKYAN defeats CHARLES OLIVEIRA** (*split decision*)](http://mmadecisions.com/decision/14676/fight)\n\n^(UFC 300: Pereira vs. Hill — April 13, 2024)\n\nROUND|Tsarukyan|Oliveira||Tsarukyan|Oliveira||Tsarukyan|Oliveira\n:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:\n1|9|10||9|10||9|10\n2|10|9||10|9||10|9\n3|9|10||10|9||10|9\n**TOTAL**|**28**|**29**||**29**|**28**||**29**|**28**\n\n*^(Judges, in order: Michael Bell, Adalaide Byrd, Ron McCarthy.)*\n*^(Summoned by MatttheJ.)*\n\n**MEDIA MEMBER SCORES**\n\n- **1/29** people scored it **30-27 Tsarukyan**.\n- **20/29** people scored it **29-28 Tsarukyan**.\n- **8/29** people scored it **28-29 Oliveira**.\n\nAvg. media score: **28.8-28.2 Tsarukyan** (*high certainty^[[1]](https://redd.it/9p4xc7)*).",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Due-Contribution6424",
                                                    "body": "He just wants one last shot at the title before he looks at retirement, you blame the guy? He didn’t mean it in a disrespectful way, just trying to hype himself up.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "frankster99",
                                                            "body": "Good point, his wording was just annoying",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Due-Contribution6424",
                                                                    "body": "I agree, his wording made me cringe a little live.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "NihilistocLycan",
                                                    "body": "It was probably ali saying that. Wasn't gaethje super cool after the fiziev fight, and saying that he wouldn't get in the way of those who were ahead of him?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BlumpkinEater",
                                    "body": "Wasn't fiziev the one who took short notice instead of Hooker VS Garth?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "frankster99",
                                    "body": "Yes",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IAmPandaRock",
                            "body": "What about Dustin and Justin?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Easy-Tangelo1023",
                            "body": "with all due respest, it's ilia duty to comprimise, he is new to the weight class, and moved up because of weight cut issues, he should beat a top10 then start making demands",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "frankster99",
                                    "body": "Agreed",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hallelalaluwah",
                            "body": "It’s become WelterWait",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "roald-aldo",
                                    "body": "Or just lightWAIT lol",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "WhoStoleMyBicycle",
                                            "body": "These lightweights can light wait brother",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "frankster99",
                                    "body": "It really did man 😔",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Firestyle092300",
                            "body": "Not our boy Max Holloway. It is what it is he will fight anyone, but they won’t book a Max v Ilia at 155lbs fight cause that makes no sense at all to help settle the picture since they both coming up from FW",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Desk_Draws",
                            "body": "It's probably not worth it to fight an unranked world beater for their usual pay. They're already in an extremely stacked division so taking a big risk for peanuts might not be the best move.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "evocater",
                            "body": "Tbf it's only Oliveira really. As far as I know, Arman is down to fight whoever. Gaethje is practically locked in for a title shot so I don't blame him for sitting out, Dustin is looking for a retirement fight so I don't blame him either, Max got KO'd by Topuria not that long ago and probably wants to bulk up properly for the new weight class so I don't blame him for sitting out either. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "frankster99",
                                    "body": "Go away with your common sense and logic",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Real-Human-Bean-",
                            "body": ">The only person I think is fair to do it is islam\n\nIt's fair for the champion to not defend and hope that someone else beats ilia while he waits it out? It's the least fair for him to do. If he doesn't want to defend the belt, he should vacate.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ThatCoolKid17",
                            "body": "Reminds me of the \"welterwait\" days when Usman was champ. None of the top contenders wanted to fight each other.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "spectreaqu",
                            "body": "Islam wans to fight Justin and according to him Justin is a better win for him than Ilia because Ilia hasn't done anything at 155, I'm sorry but Islam makes no sense at all, by his logic he should fight contender at WW because he hasn't done anything there.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SquidDrive",
                    "body": "Cant blame em, Olives is 36, realistically hes past his athletic peak, and hes tryna get back to the title, and Islam beat Prime Volk while dehydrated and he still gets shit on for that 1st Volk win, I can see why hes hesitant about facing another elite guy if hes gonna get no credit for beating \"another FW\"",
                    "score": 101,
                    "replies": [
                        {
                            "author": "jfsoaig345",
                            "body": "Dustin and Gaethje are 35-36 as well. The top of the division is filled with vets who don't really have the time to be that \"anytime, anywhere\" type of fighter anymore and need to be a lot more intentional with who they pick as opponents.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "frankster99",
                            "body": "True but does he have the time and years then to be waiting around?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "I mean with Gaethje being back in the title picture somehow, I can definitely see the UFC giving Islam 2 choices for his next fight: Gaethje or Charles.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "frankster99",
                                            "body": "I'm alright with those choices although this might sound harsh but i don't think Justin stands any chance in hell at beating Islam.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Sleazy_Speakeazy",
                                                    "body": "I'd be surprised if he lasted more than 2 rounds, tbh...",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DontBelieveMyLies88",
                                                    "body": "Same. In college Justin was a phenomenal wrestler but it’s like he completely forgot all of that and just put all his eggs into the striking basket. I’d say Arman is the only one who’s stylistically intriguing but he fucked up that shot already",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "frankster99",
                                                            "body": "Use it or lose man. Wrestling based fighters have the potential to be so versatile and complete..... Looks Justin fell in love with his striking too much.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "HEAVY_HITTTER",
                                                    "body": "Gaethje deserves the fight. It doesn't matter if you think he will win.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "turkeypants",
                                                            "body": "Yeah I think only Tsarukyan has a chance, but he's in the doghouse for now. And Top hasn't proved himself in the division yet. So it's Charles, Gaethje, or Max, take your pick, with arguments for and against each. I'd prefer Gaethje myself as a fresh matchup, just since it's hard to get hyped for Charles again and Max is coming off a loss with just one win in this division... though over Gaethje. Let's get it moving though.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "frankster99",
                                                            "body": "Yeah but he's getting his ass beat",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HEAVY_HITTTER",
                                                                    "body": "Ass beat? Doubt it. But choked out ? Probably.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "frankster99",
                                                                            "body": "Getting diddyed by Islam",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HEAVY_HITTTER",
                                                                                    "body": "I've never understood this hate for Gaethje. But w.e.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "frankster99",
                                                                                            "body": "Said some dumb things and is annoying at times but don't at all hate him",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "HEAVY_HITTTER",
                                                                                                    "body": "He has never said something so bad to where he deserves to be shit on , on literally every Gaethje related thread.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "frankster99",
                                                                                                            "body": "True, I just find him annoying but you're correct in the end",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Due-Contribution6424",
                                            "body": "If that’s the case, I think we see the Gaethje fight. Islam has said he wants to fight him.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mr_Shickadance110",
                                    "body": "No. He doesn’t have the streak to be acting this way right now either. Dude is coming off of a win over a rusty Chandler and acting like he deserves a title shot. The guy he just lost to is ahead of him for a title shot. Justin should be ahead of him for a title shot seeing as how he too is coming off of only one win at the moment. But he hasn’t already been whooped by Makachev. Olivera already got his chance at a one win streak rematch and got injured. Then beat. I love Charles but he needs to win at least have two wins in a row. Beating Chandler by decision and almost getting finished in the process doesn’t make him #1 contender. Fighting and beat Ilia would.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "frankster99",
                                            "body": "Exactly, I get these fighters want to protect their positions but you gotta turn up to win anything in the first place. Also inactivity doesn't help either.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Splatter1842",
                                                    "body": "It's why I respect Du Plessis response to the Strickland rematch; he would rather fight Khamzat, but the brass wanted him to fight Strickland so he did.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "frankster99",
                                                            "body": "Yeah he's not messing around and gets it done. Hope he beats khamzat or were gonna have a middleweight champ who fights once a year if we're lucky.",
                                                            "score": 11,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "idcman999",
                                            "body": "imagine earning a title shot by 49-46'ing a near 40 year old who might lose to Paddy bahahahaha",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "chucks-Teeth",
                                            "body": "This",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Shankson",
                                            "body": "To be fair, there have been numerous fights where Charles was almost finished and came back to win. I think that's part of who Charles is, right or wrong, and it's another reason why people like him so much. I don't think any of those guys beat Islam, but I'd rather give it to someone who deserves it vs some guy who just moved up in weight even if he is a title holder in a previous division.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Drive7hru",
                                    "body": "Who? Islam?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "frankster99",
                                            "body": "Charles",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GreatAdhesiveness345",
                            "body": "Beat volk while dehydrated🤣🤣 bro volk took that fight on short notice and back to back without giving himself or his brain and body a break, there's no doubt islam is a beast but \"dehydration\" is a sorry excuse, he got mopped by volk in his prime condition which is all that matters. \n\nBut you are correct in everything else you say",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "Yes he was dehydrated, Perth sliced everyone's rehydration window by a quarter which effects people who actually have to cut for the weight class. \n\nAs in, Islam couldn't come in as big as usual, nor with the same gas tank or strength, having less water in your system makes every aspect of performance worse.\n\nIts a legit hard thing to navigate and he did.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theyoloGod",
                    "body": "Arman isn’t getting the next shot\n\nCharles getting one off a chandler win is weird \n\nThere’s Justin but who knows\n\nSomeone needs to fight a contender at some point to figure it out. Can’t imagine a bigger name than ilia",
                    "score": 13,
                    "replies": [
                        {
                            "author": "skeletonpaul08",
                            "body": "Arman is in the same situation Charles was a year ago, earned the title shot, got injured and dropped out right before, now has to win a title eliminator to get it back. \n\nCharles is in a weird position though because his title eliminator was against Arman who barely squeaked out a split decision then proceeded to get injured like a day before his title fight. Then they gave him Chandler who honestly might not even be a top 10 lightweight at this point and he completely outclassed him as he should have. Then Ilia KOs the two best featherweights ever and moves up. So like has he earned a title shot? He already had earned one and has had 3 fights since then. The Ilia fight makes sense in a way but he’s 36 and definitely only has 1 more shot at the belt, it seems unfair to give him someone that has never fought at lightweight and only has 1 title defense.\n\nAlso none of this matters because no one is beating Islam lol.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "DellySupersonic",
                                    "body": "Great point on armans and charles situation",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ItsDrManhattan",
                    "body": "Probably because the belt has become a glorified stepping stone to whichever top featherweight feels like trying to make history\n\nIt sucks the UFC is treating their most dominant champion as the official double champ opportunity",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "Why would charles put his position at risk knowing he is already back in the title picture. \n\n  \nIlia was also offered Arman number 1 contender match but he declined, he doesn't get to chase charles now.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "jthememeking",
                            "body": "You're not wrong. That's what makes lightweight so weird. It's not just ducking, but all these fighters do have valid reasons for not fighting. And they're all fan favorites except for Arman, who's getting punished",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "afz8",
                                    "body": "It’s more fair for Justin or Charles to fight Ilia than to give Ilia a title shot right away. \n\nWant the shot, fight Ilia. Meanwhile, Arman gets the title shot on the condition that he has to leave the UFC if he backs out again. \n\nLol yes I’m serious.\n\nDon’t want Islam to wait for a clear contender. Arman deserves it most. Ilia deserves it least. But all four people I mentioned have a somewhat reasonable case for the shot.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "TheAngriestPoster",
                                    "body": "It’s why you have to sometimes ignore those valid reasons and just make the best fucking fight. Dana should get over it and let Arman fight Islam. If not Arman, then Ilia. Let the rest work themselves out, they’re not a champion or a #1 contender.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "SquidDrive",
                                    "body": "Everyone is at the stage of their career to where they should be getting concessions for their work.\n\nPoirier Olives Gaethje are all above 35, they have maybe 1 to 2 more years at max to still be able to fight at the elite level.\n\nMakhachev is about to be 34, all these men with exception of Ilia and Tsaryukyan are in the endgame of their career.\n\nIslam has maybe 2-3 more fights before he personally retires. Hes not trying to have his legacy be \"fighting FW's\" which is how his Volk duology is painted, he wants to be the LW GOAT and move to WW. So asking him to face another FW with no history at the elite levels of LW is not reasonable.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Twerksoncoffeetables",
                                            "body": "Yeah idk just give him Justin since he wants it, force olives or arman to fight ilia for the next shot, tell them they forfeit their title shot if they don’t. They cant all just wait around passively for a shot, beating chandler in a decision is meh, arman deserves it as he beat Charles and Dariush last but since he pulled out he’s in trouble so ilia vs Arman or ilia vs Charles would be good while we get Justin vs Islam.\n\nIf they do what Islam wants, it should be Islam vs Justin early this year and then Ilia or Arman vs Islam late next year. He wants his record full of LW wins, he wants to be the goat of LW and he is definitely more than capable. I wish Arman wasnt getting punished I know pulling out last second probably should be but it puts LW in such a weird spot.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "riped_plums123",
                                    "body": "Yeah losing knocks them out of being a contender. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "theyoloGod",
                            "body": "But is Charles really next in line with a win off chandler",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Well yeah, Justin is in the title picture off beating  Fiziev",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "theyoloGod",
                                            "body": "Justin was next in line before helping out ufc 300. While a loss is bad, it at least puts him in a better light to management than losing to the number one contender",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Asleep_Hurry_9033",
                                                    "body": "Justin got Ko'ed by the number 5 guy, losing a close fight to the number 1 contender is definitely better.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "theyoloGod",
                                                            "body": "To the person making the fights when Charles has a history of not helping out and pulling out? Don’t think so",
                                                            "score": -1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Asleep_Hurry_9033",
                                                            "body": "Nah given the chance UFC would definitely value Islam vs Charles 2 over Islam vs Justin.",
                                                            "score": -1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RecordOk6794",
                                                            "body": "Both of those are just not exciting, Arman and Ilia could be serious tests for Islam. Justin will not be, Charles didn't and he would lose again.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Real-Human-Bean-",
                                    "body": "Neither Charles nor Gaethje deserve it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Mr_Shickadance110",
                            "body": "Because Arman, Justin, and Ilia all have claims to a title shot over him. He was handed a rematch after scoring one win and he got injured. Then He got beat. Then he beat Michael Chandler by decision and almost got finished while doing it. Not to mention he got fucking whooped by Islam in their fight and Islam needs fresh opponents. Dude does not deserve a title shot. He needs to at least get two in a row and doing that against Ilia would make him undeniable and bring some much needed legitimacy to his rematch with Islam",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Arman definitely, not Justin or ilia. Losing a close fight to Arman isn't a bad look seeing as how Arman is the number 1 contender. \"Almost being finished\" plays no role in the title picture, it isn't a real metric.\n\n  \nAnd again Ilia was offered Arman and he declined, he can't complain about Charles declining him.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "afz8",
                                            "body": "I’ll copy paste my comment since it’s relevant.\n\nIt’s more fair for Justin or Charles to fight Ilia than to give Ilia a title shot right away.\n\nWant the shot, fight Ilia. Meanwhile, Arman gets the title shot on the condition that he has to leave the UFC if he backs out again.\n\nLol yes I’m serious.\n\nDon’t want Islam to wait for a clear contender. Arman deserves it most. Ilia deserves it least. But all four people I mentioned have a somewhat reasonable case for the shot.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Macktologist",
                            "body": "That’s a fair question. From the opposite side of things, why should Charles get to wait for the next champ to be crowned and then get to fight them?  That’s kind of what he’s saying by saying “unless he wins the belt.”  \n\nI can’t say I blame him, but not sure it should be respected because that would be a mess to keep letting challengers choose who they want to fight. You fight each other until someone earns a shot at the belt. The idea that they should get to hand pick their path to the title fight is bad for the sport, IMO.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Well yeah Charles was kind suppose to be next up after Arman vs Islam. Ilia was never in the picture. He doesn't just get to come in now and cut in line in Charles Pov. \n\n  \nEspecially after again Ilia was offered Arman and he declined and wanted to fight Charles instead, sadly this sport is filled with hand picking, ironically the only person who hasn't hand picked until now is Islam because his opponents keep dropping and being replaced.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zavehi",
                    "body": "Bunch of guys who have all fought each other at the top and none of them want to lose there spot besides Justin who is just a maniac.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "RazrRain",
                            "body": "Dustin fought a ranked #12 BSD",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "red-broom",
                                    "body": "I think a lot of people aren't counting DP because hes done. Hes on his last fight so hes not even on most people's minds",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Zavehi",
                                    "body": "BSD and Topuria aren’t really close to the same guy.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BellyCrawler",
                    "body": "It won't get talked about because the fighters are fan favourites, but that top 5 is kind of stale at this point. How many iterations of Olives-Gaethje-Poirier-Makachev-Chandler have we seen? Topuria is what the top of the division needs tbh, because he's a killer with a legitimate claim to immediately be at the top of the division.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "SquidDrive",
                            "body": "Islam beat Prime Volk while dehydrated and he still doesnt get credit for that win.\nIts not unreasonable to ask him to beat DP or Tsaryukyan(a guy Topuria is refusing to face) so this fight is established as a win against a LW.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Shankson",
                            "body": "Moving up in weight doesn't give him legitimate claim to immediately be at the top of the division.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "BellyCrawler",
                                    "body": "He's a fresh, undefeated finisher of a fighter, who knocked out many people's divisional GOATs not too far off their peak. Said GOATs happen to have given the champion his closest fight of this run, and also beat down and spectacularly knocked out a perennial 155 challenger. \n\nI'd say that makes him legit.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Shankson",
                                            "body": "Makes him a legit fighter and threat for sure. Doesn’t make him an auto legit fight for the belt bc he moves up a division. Not to me anyway.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Real-Human-Bean-",
                                    "body": "It actually does. DC, McGregor, Cejudo, Adesanya, Volk were not ranked in the division when they got their double champ shot.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Shankson",
                                            "body": "And I didn’t agree with any of that then either.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Crateapa",
                                                    "body": "Regardless of whether or not you agreed with it, the precedent was set.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "realjobstudios",
                    "body": "Everybody is so close to a title shot that they don’t want to risk fucking it up.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "creepoch",
                    "body": "Turning into 2021 welterweight",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DawgNaish",
                    "body": "Light wait",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "vernon-douglas",
                    "body": "It's really not just give Arman the title shot.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Archive_Intern",
                    "body": "Lightweight has always been weird, in fact there was not a time when light weight was not weird.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "idcman999",
                    "body": "they should match make it like this \n\nMakhachev vs Topuria\n\nTsarukyan vs Gaethje\n\nOliveira vs Pimblett (if he beats Chandler)\n\nPoirier vs Holloway 3\n\nHooker vs Moicano\n\nGamrot vs Klein\n\nDariush vs Bahamondes\n\nFiziev vs Kattar (145lbs)\n\nBSD vs Alvarez\n\nDawson vs Ziam\n\nNasrat vs Rebecki",
                    "score": -3,
                    "replies": [
                        {
                            "author": "throtic",
                            "body": "Topuria doesn't deserve a shot at the title. He needs a #1 contender fight with anyone in the top 5",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Odd_Ravyn",
            "body": "Lmao Ilia vacating the belt only to be treated like a nobody is absolutely hilarious.",
            "score": 780,
            "replies": [
                {
                    "author": "TroyFerris13",
                    "body": "should have held that belt hostage",
                    "score": 199,
                    "replies": [
                        {
                            "author": "nicklicious5150",
                            "body": "I appreciate him not doing that, I think we all should.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "gxb20",
                            "body": "Let’s face it though, they’ll all just do what UFC say. Maybe Ilia knows something",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "RunsInHexagons",
                                            "body": "They cant pay for a title shot",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "didyoutestityourself",
                    "body": "there is a 90% chance that Illia just gets the title shot at 155. UFC is entertainment first and there is no other more entertaining match up at 155 other than Illia vs Islam. The top of 155 is littered with old veterans who we've seen fight each other non stop.",
                    "score": 78,
                    "replies": [
                        {
                            "author": "Shareholderactivist",
                            "body": "Real, Ilia vs Islam is the most exciting fight rn.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "GoatPaco",
                            "body": "Yeah, and he knocked out the two best featherweights of all time back to back, and is still undefeated\n\nIlia is one of the few that deserves an immediate shot for moving up, especially in a weight class with no obvious contender, especially since he vacated the other belt to give UFC another PPV main this month\n\nIt’s got to be Ilia",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Steve_Cage",
                            "body": "bro spitting facts",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "pyroblastftw",
                            "body": "A part of me thinks this is also fighters angling for more money by declining certain matchups.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Frequent_Giraffe5040",
                            "body": "Yes. And most entertaining also means most competitive.   \nAnd every fan should be interested in looking for the most competitive fight, instead of imagining how they think it would be fair, or how things should be looking at the division as a whole.   \n  \nIslam established himself as the best fighter in the world, but he wont be for very long, he is already 33.  \nIlia is a young and hungry undefeated monster knockout artist with a well rounded game.  \n  \nShouldn't even be a debate about it we need this fight as soon as possible.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Homeskilletbiz",
                    "body": "Well yeah we all want him to defend once or twice more at 145 before he does. \n\nIllia is acting like he has Conor privilege in this modern UFC that let the lineal HW champ walk because of their greed.",
                    "score": 74,
                    "replies": [
                        {
                            "author": "Piython",
                            "body": "He knocked out Volk and Max, he might not have Connor privilege but he ain't a nobody. Remember Max was on a high too cos he nearly killed Ghaetje. Ilia is a tough fight and beats most LWs",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "RunsInHexagons",
                                    "body": "> Ilia is a tough fight and beats most LWs.\n\nAgreed, so he should just go and fight them.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "Crafty_Actuary5517",
                                            "body": "Right but now there's two top LW who say they won't fight him.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "analtelescope",
                                    "body": "\\>Ilia is a tough fight and beats most LWs\n\nWe won't know that for sure till he actually fights a damn lightweight",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TedBenekeGoneWild",
                            "body": "It's entirely different though BECAUSE he vacated. He's not holding the 145 belt hostage. All these lightweights ducking him (besides Islam) are annoying as hell.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "JTG___",
                                    "body": "Plus although it was at a different weight class, he’s just knocked out Volk who gave Islam his biggest test and took him 5 rounds on a full camp, and Max who flatlined Gaethje. If you want to say that he shouldn’t go straight into a title fight I won’t argue with that, but at the very least he deserves to fight Arman or Charles in a no.1 contender fight.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "Jerkb8n",
                                    "body": "Give him a low ranked guy and let him climb like everyone else, all issues solved",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "MMA_Data",
                                            "body": "Except for the fact that mostly \"everybody else\" never won a championship, never defended the belt, never beat two former champions in a row (both FW who fought for the LW with no prior win at LW, by the way), isn't unbeaten, and doesn't have an 87.5% finish rate in 16 fights. Conor fought for the LW title with 7 fights at FW and 0 title defenses. Ilia already has 8 fights and 1 defense. Max fought for the LW title with 3 losses in the UFC. It took Volk 12 wins at FW to get the chance at LW cause people hated Volk like he fucked their mothers. \n\nTopuria is simply not comparable to anyone else in the UFC right now (except maybe Aspinall) and he has a massive following. Charles can say whatever he wants but he's 3-2 in his last 5 so he's got no claim to a title fight whatsoever, and i can easily see the UFC offering him a #1 contender fight to accept fighting Topuria, cause they know Topuria is flatlining him in R1.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bobok88",
                                            "body": "What a waste of an athletes potential. We learn nothing by spending a year watching ilia flat line lower level guys. He should be fighting for the title or a top 5 guy full stop. We know he's world class, he's proven he's world class, match him up accordingly.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Top-Sympathy6841",
                                            "body": "seriously, everybody acting like just because he caught volk and max in the twilight of their careers that he suddenly deserves to jump the line in a weight class he is unproven in.\n\nimo, there's no better fight than topturo vs paddy",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Bobok88",
                            "body": "He vacated though, anyone can move up or down a weight division if they want, he has done it the right way. He's campaigning for the title shot now as anyone would in his situation, I'm sure he was aware it wasnt a guarantee but he's going to shoot his shot regardless.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FishtheJohnerman",
                    "body": "It'll be hilarious when Ilia wins that belt too!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Real-Human-Bean-",
                    "body": "We will see what the company does. This tantrum from Islams camp will not age well if they make the Topuria fight.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Nuzzleville",
                    "body": "Also this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "9inchjackhammer",
                    "body": "He will fight Islam",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "riped_plums123",
                    "body": "Idk bro, I think they are for sure making Islam fight Ilia. It’s not the right move, but the most likely",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Truak24",
            "body": "Islam doesn’t want to fight Ilia. Oliveira doesn’t want to fight Ilia either. So the only contender willing to fight Ilia is Arman and Ilia doesn’t want to fight him. Can the UFC just make the matchups at lightweight already? This is exhausting. (Just don’t book Gaethje for a title shot)",
            "score": 152,
            "replies": [
                {
                    "author": "saw-it",
                    "body": "Just make it a fatal four way",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Truak24",
                            "body": "This",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Steve_Cage",
                            "body": "good idea",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EveningNo8643",
                            "body": "pause",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrinR",
                    "body": "Dustin wants to fight Ilia and I think Ilia is down for it as well",
                    "score": 36,
                    "replies": [
                        {
                            "author": "UnlikelyAssassin",
                            "body": "Yeah. Khabib even said Islam would give Ilia a shot if Ilia beat Dustin Porier or Charles Oliveira.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "AliceBanana",
                            "body": "The problem is if Dustin wins his retirement fight against illa, it would derail all the hype.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "BrinR",
                                    "body": "That'd be a legendary send off honestly but also if Topuria can't beat Poirier on the verge of retirement then he has no business fighting for the title. This is one of his most favorable elite matchups in 155 rn",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "MP3PlayerBroke",
                                            "body": "from a legitimacy point of view, this is absolutely correct. but from a business perspective, the UFC would hate to risk it",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Itaney",
                                                    "body": "I don’t really see how. If Islam won’t fight Ilia, this is the least risky bet the UFC can make. If he can’t beat Dustin, his most favorable match up, he has no chance against the other contenders. All contender fights carry some risk, and Dustin is the lowest risk option out of those for the UFC.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "professorgaysex",
                                    "body": "I would probably bust seeing old crafty vet the diamond finally putting down that little garden gnome whose been knocking out all my heroes in featherweight",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "0zi1",
                    "body": "Ilia should fight Arman, somehow there's a wierd notion that Ilia holds as much say in LW as either Charles and Islam. He's FW who is yet to fight in LW",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Rhsubw",
                            "body": "Yeah if you come up a division you should have absolutely no say in who your first opponent is, I don't care if you're the FW champ.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Real-Human-Bean-",
                                    "body": "Jones and GSP didn't fight a contender. I'll bet Islam has no intention of fighting a contender at welterweight when he moves up either.",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "Itaney",
                                    "body": "Key difference — those guys cleared their divisions, and once Islam moves up, it’s only after he clears his division too. Ilia was very far from clearing his division, he jumped prematurely after only 1 title defence and should get no free handouts for it.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Real-Human-Bean-",
                                    "body": ">once Islam moves up, it’s only after he clears his division too.\n\nHe hasn't cleared the division yet. \n\n>he jumped prematurely after only 1 title defence and should get no free handouts for it.\n\nHe vacated that belt, he isn't trying to do the double champ thing. Volk and Lopes are fighting for the title in less than a month. He didn't hold the belt hostage.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Itaney",
                                    "body": "That’s why I said *once*…. he hasn’t moved up yet. He’s 1-2 fights from clearing a top 2 most stacked division in UFC history. \n\nDoesn’t matter because allowing Ilia to do a single title defence, vacate it, and move up to immediately fight for the title sets the wrong precedent. Soon enough every fighter will win the title, defend it once, vacate it and ask for a title fight in a different division. Nobody who loves the UFC wants that precedent, and it will be terrible for business because the UFC’s superstars will lose hype too early.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slywombat45",
                    "body": "Islam seems game to fight anyone. It’s not that he doesn’t want to fight Ilia, it’s that many agree Ilia needs to establish himself in this weight class instead of getting an immediate title shot. \n\nIlia wants the title fight. But doesn’t want to fight the other contenders. And the other contenders don’t believe he can skip past the line",
                    "score": 16,
                    "replies": [
                        {
                            "author": "mightjustbearobot",
                            "body": "It's an endless no-win situation for Islam. \n\n\nIf he beats Ilia, he'll continue to hear how he only fights featherweights.  Everyone will instantly forget how scary of a fighter Ilia seemed before their fight.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "KingKaiserW",
                                    "body": "People glaze the fuck out of Islams Volk win. They didn’t even care he KOed Volk on a weeks notice, now suddenly the Topuria fights comes up “Ohh people criticise Islam sooo much for fighting featherweights”",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "slywombat45",
                                    "body": "Hmm I see that but I don’t think Islam has any issues here. Hes champ and arguably #1 PFP. \n\nThis is more of a problem for Ilia. He’s the one seeking the opportunity for the LW belt after vacating his belt. The pressure is on Ilia imo. He has a situation to navigate here.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AnimateDuckling",
                    "body": "Why not book gaethje?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Truak24",
                            "body": "Because it will be a waste of a matchup when we could get any of the other fighters in there. Gaethje will simply just get subbed early and then he’ll congratulate Islam and leave. Just like he did with Khabib. In short, he’s got nothing for Islam.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sad-Cheek9285",
                    "body": "Oliviera should be forced to fight topuria",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rostemaxime",
                    "body": "Ilia does not want small names, beating Oliveira will get him more money/recognition than beating Arman",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rwn115",
            "body": "155 is blackballing Ilia",
            "score": 268,
            "replies": [
                {
                    "author": "SquidDrive",
                    "body": "Ilia refused to fight Arman.",
                    "score": 96,
                    "replies": [
                        {
                            "author": "spectreaqu",
                            "body": "Many people say this but i never seen source of him refusing or an even offer that happened, where is it?",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "heliumflower",
                                    "body": "It’s the same source that said Islam’s team turned down the fight with ilia.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "rslash_Extrafical",
                                            "body": "Both sources sound like BS, i dont think anybody turned down anybody",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThreeOlivesChihuahua",
                                    "body": "I think that fight is gonna happen if Islam isn’t down to defend against Ilia.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Reez377",
                                    "body": "Just look up on google his manager said that in interview few weeks ago",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Th3pwn3r",
                    "body": "I don't get it. Dude gave up a belt to come and take a chance at 155. None of these guys talking shit would ever do that.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "afz8",
                            "body": "But giving up your belt doesn’t mean you leapfrog legit contenders at a different weight class.\n\nFight a contender. Even just 1. If you win, you can claim a shot at the title and the Champ is no longer perceived as defending against a fighter from a lighter weight class. It establishes the challenger as a real contender at the weight.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "EveningNo8643",
                                    "body": "not to mention Arman was offered and he said no so....",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Real-Human-Bean-",
                                    "body": ">Even just 1. If you win, you can claim a shot at the title and the Champ is no longer perceived as defending against a fighter from a lighter weight class\n\nIslam is going to do the same at welterweight right? He's going to fight a contender first?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "afz8",
                                            "body": "Islam has the record number of title defenses in LW ever. Ilia has one title defense.\n\nDo you understand the difference right? Same way no one complained when Volk moved up to challenge Islam. Volk cleaned out the division. Ilia had two strong contenders lined up. He decided to skip them, gave up his belt and moved up.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Real-Human-Bean-",
                                                    "body": ">Volk cleaned out the division\n\nHe didn't. Emmet and Allen were on long win streaks. They literally made an interim title on the same card. \n\n>Islam has the record number of title defenses in LW ever. Ilia has one title defense.\n\nAnd what? He still hasn't done anything at welterweight. He's the smaller guy going up into that division. Online trolls are going to discredit the defending champion of he beats Islam saying that Islam was just a 155er. Hear how this sounds? \n\n>gave up his belt and moved up\n\nYes he didn't hold another division hostage like volk did and Islam intends to do.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "YesInquisitor",
                                                            "body": "There’s no point in trying to argue with them bro. This subreddit is full of Ilia haters trying to make a case for why he still needs to prove himself lmao",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CastorTroyMan",
                                    "body": "I don’t really understand why this is a narrative.\n\nIt’s not like there isn’t like 10 years of precedent of champs getting an immediate shot at the weight class above.\n\nI can think of 5 right off the top of my head, and none of them fought contenders first.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Caleb_Tenrou",
                            "body": "Which would mean more if he had been champ for a while and had a good series of defenses. He doesn't get to vacate straight into a fight with the top 3 contenders, all of whom are older and most likely only have one more run at the title. Why would they want to risk that to fight someone who isn't even a lightweight?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Th3pwn3r",
                                    "body": "I don't know the numbers and I agree if he defended multiple times it would make more sense but the UFC doesn't make sense a lot of the time. It's all about making the most money possible right NOW or so it seems.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "motherrfudgerr",
                            "body": "Charlie Olives gave up his belt a day before his own title fight. What a guy!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "so-cal_kid",
                    "body": "They're afraid he's gonna knock em out. Ilia's younger than most of these lightweights by a good amount.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "neo_1000",
                            "body": "Then why won’t he accept the fight with Arman?",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "Rebeldinho",
                                    "body": "Probably because Arman’s name isn’t worth the risk",
                                    "score": -31,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Arman is number 1 at lw. \n\n  \nIlia can't complain about charles if he won't fight Arman",
                                    "score": 40,
                                    "replies": []
                                },
                                {
                                    "author": "Rebeldinho",
                                    "body": "He is but guys like Dustin, Charles, and Gaethje are bigger names while posing the same or less risk",
                                    "score": -6,
                                    "replies": []
                                },
                                {
                                    "author": "neo_1000",
                                    "body": "Arman poses a WAY bigger risk than either of those names you just mentioned. Ilia moved up to become a double champ, not to fight big names. If he wants to fight for the title he needs to earn it. Beating the number one contender means fighting Arman",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Rebeldinho",
                                    "body": "I don’t know what I’m being downvoted for I’m not saying I agree with it that’s just what he’s doing\n\nArman is just as big a risk or bigger than the old guard.. the old guard however have bigger names… if he can beat one of the old guard he can get a title shot easier than fighting Arman\n\nAgain I’m not saying I agree with it and I don’t think the UFC does either considering they are at an impasse",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "neo_1000",
                                    "body": "Dustin’s retiring and he’d probably do power slap before fighting Ilia as his final opponent. Gaethje will probably end up fighting for the title next if they don’t give it to Arman. That leaves him with Arman as his only realistic fight if he wants a crack at Islam, IF he’s even still a lightweight at that point",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "SquidDrive",
                                    "body": "And Ilia aint worth the risk for Islam when it gets reported as him beating another FW.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Rebeldinho",
                                    "body": "That’s fight negotiation… everyone is looking for the fight that advances them the most while posing the least risk",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "SquidDrive",
                                    "body": "So\nWhy not just have Topuria win a fight, and then book Islam vs Topuria?",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Rebeldinho",
                                    "body": "It’s on the UFC to get Ilia to fight… obviously he wants the immediate title shot the UFC has to get him to fight who they want",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Asleep_Hurry_9033",
                            "body": "I guess that why Ilia declined to fight Arman than one dude thats the same age as him and the number 1 contender at lw",
                            "score": 76,
                            "replies": [
                                {
                                    "author": "UnderstandingThin40",
                                    "body": "Where are you getting that ilia refused to fight arman?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "YesInquisitor",
                                    "body": "Can you give a legit source for that?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "realHundsgemein",
                            "body": "What a bad take. You think someone like Oliveira who faced 155ers with KO power like Poirier, Garth etc is afraid of a smaller guy with KO power?",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "DtotheOUG",
                                    "body": "Why won't he fight him then? Money?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "HEAVY_HITTTER",
                                            "body": "He literally said why you clown.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "DtotheOUG",
                                                    "body": "So Charles is just gonna sit on his ass until he's given a title fight then? The dude's most recent win is a bum ass Chandler and now he's dictating that he only has to fight for the title next. We're LightWait now.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "HEAVY_HITTTER",
                                                            "body": "I don't think he said he refuses any fight but a title fight.",
                                                            "score": -1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "DtotheOUG",
                                                            "body": "MMAJunkie: [\"All Charles Olveira wants next is to fight for a UFC title belt 'either way'\"](https://mmajunkie.usatoday.com/2025/03/ufc-charles-oliveira-next-fight-title-bmf-makhachev-holloway)\n\nHe says he either wants the title, or to face Max for the BMF Belt.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "HEAVY_HITTTER",
                                                            "body": "In that very article:\n\n“Whoever I get told to fight, I’m going to fight,” Oliveira said. “I have nothing but respect for Ilia Topuria, but this is lightweight. It’s the most difficult division you have ever seen, and I have power in my hands. I believe in my jiu-jitsu, but I believe that I could knock Illa Topuria out.”",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "DtotheOUG",
                                                            "body": "Right. if that was the case, then why does this post - with charles saying he will only fight him if he's the champ- exist?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "HEAVY_HITTTER",
                                                            "body": "Mate, I'm not sure why OP titled it the way he did. He also probably didn't read the article and heard that one sentence and posted this.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "realHundsgemein",
                                            "body": "Charles only decisively lost to Islam, the current champ, where he lost the title after defending it twice. He had a proper reign as a champ, so an immediate rematch is common and they booked it, however he got injured. He then took a contender fight, which is again not necessary after his reign, he could’ve just waited, but beat Dariush in an impressive fashion. He more than earned his shot, when he lost a very close fight in a 3 rounder against Tsarukyan. So he went back to the contenders, beat Chandler, and is now the logical next contender after Tsarukyan. \nSo he fought contender fights twice without the need, and fought a contender a third time to earn his position again and should now fight another contender coming up a weight class to put his position in danger again? It’s pretty clear to me why he wouldn’t fight Topuria at this stage.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "UnderstandingThin40",
                                    "body": "Illia has better power and technique than both of those guys ",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Unerring_Grace",
                                            "body": "Ehhh.  No guarantee it carries over at 155.  Peak McGregor had the absolute touch of death at FW, but at LW his power was good but no longer freakish.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Brilliant-Ad7045",
                                                    "body": "He fought one time at 155 during his prime ufc run and he tko Eddie that was super hard to tko during that time. The other three were after coke so I'm not sure how much I count those",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Strong-Discussion564",
                                            "body": "Ilia fans are obnoxious af. Conor 2.0. The disrespect and delusion is nuts.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Altruistic_Ad_3224",
                                            "body": "Downvotes but i agree broski",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "throtic",
                    "body": "I'm so happy he's getting black balled. Dude thought he was a superstar and he very clearly is not.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dogesneakers",
            "body": "I like Olives but he needs to fight someone. So fight the most hyped fighter in the weight class and take his shine or sit and do nothing and have others take his momentum",
            "score": 16,
            "replies": []
        },
        {
            "author": "Barnabybusht",
            "body": "I'm really losing interest in the UFC these days. Too much talking and egos, not enough doing,",
            "score": 31,
            "replies": [
                {
                    "author": "Sad-Cheek9285",
                    "body": "Yep. The org should be making the best fights. Not fighters throwing fits about which ones they want. If you’re one of the best in the world, show it",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Barnabybusht",
                            "body": "Couldn't agree more mate.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "SnoopysRoof",
                            "body": "What you're saying would require that the fighters have less say in their fights and that their contracts were tightened up. Average redditor on /mma hates that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sad-Cheek9285",
                                    "body": "In a perfect world their contracts are tightened up, they have less say in their fights (less ducking) and they get paid substantially more.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kgb725",
                            "body": "Ah yes because Charles hasn't done that",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "9inchjackhammer",
                    "body": "Stop looking at socials and just watch fights then lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "B_da_man89",
                    "body": "they need to increase pay and benefits.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IfLeBronPlayedSoccer",
            "body": "All of 155 thinks he should fight Arman (along with most of the dedicated fanbase). Ilia willingly gave up all leverage by vacating the 145# title. Thus, if the powers that be insist on the Arman fight, Ilia is likely to do it imho, because the dude is nothing if not one who bets on himself.",
            "score": 144,
            "replies": [
                {
                    "author": "frankster99",
                    "body": "Agreed but unfortunately a lot of people are reslly hung up on arman failing to make weight and giving him tons of shit for it. They're acting like he definitely missed weight what not despite knowing nothing. Dana's acting like dude deeply offended him or something.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Heebmeister",
                            "body": "> They're acting like he definitely missed weight what not despite knowing nothing.\n\nHe admitted his back locked up badly during his weight-cut, preventing him from being able to workout and cut more weight.   Severe dehydration is known to cause back problems for a few reasons: it messes with the cushioning in your disks within your spine, forcing muscles to contract to create stability and dehydration in general just causes severe muscle cramping and spasms....the exact symptoms Arman was experiencing.  No one can know 100%, but the circumstantial evidence points to Arman botching his weight cut, and obviously the UFC feels the same way, and they have more inside information than anyone.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "EveningNo8643",
                                    "body": "> Severe dehydration is known to cause back problems for a few reasons: it messes with the cushioning in your disks within your spine, forcing muscles to contract to create stability and dehydration in general just causes severe muscle cramping and spasms....the exact symptoms Arman was experiencing\n\nDidn't even think of this, thanks for pointing that out",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Athroaway84",
                                    "body": "Khabib never got this much shit from the dagi stans for pulling out last min. ",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Heebmeister",
                                            "body": "He absolutely did, were you not around for the Tiramisu days? lol",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Impressive_Result295",
                                    "body": "But that's the thing, botching his cut of no fault of his own but with an injury. Cutting weight with an actual back injury, even a horrible cramp is not possible because it makes it so much worse. Kidney pain and as you said, just fucks up the muscles in his back. If there was no weight cutting, we weren't still pretending that we 155ers are 155 , there would be no logjam rn. Too much pain is a valid reason, I reckon you'd feel like you're going through back surgery without anesthesia while cutting weight with a locked up back. I definitely don't blame Arman.\n\n\n\nAgain, he's rich. He can hire a nutritionist, probably mamy. Like... What reason does he have to miss weight. Specially after he had such a stellar camp with many big names.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "onyxcaspian",
                                    "body": "Nina Drama blew out his back. Heard it in the Vegas group chat.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "frankster99",
                                    "body": "Fair enough but armans not been demanding an immediate title shot or anything. Granted it sounds like he's literally describing what happened and could even not realise that his weight cut was the reason for his back. He's game for another fight for a title shot and isn't farting about but no one wants to give him a fight, that isn't on him.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "isnotreal1948",
                            "body": "Idk maybe it was him posting videos of him eating pasta and shit a week before his fight, maybe that made people think he missed wait lmfao",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Smooth-Abrocoma-2825",
                                    "body": "Carb loading before your water cut is entirely normal. Arman's chef handles nutrition for a shitload of UFC guys and they don't miss weight.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "DontBelieveMyLies88",
                                    "body": "Shit I think the pasta was like 2-3 days before weigh ins if I’m not mistaken",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "dayynawhite",
                                            "body": "people are still repeating this pasta nonsense like the mythical wage gap. it's standard protocol from the nutritionist he has had for years.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "DontBelieveMyLies88",
                                                    "body": "I’m pretty sure we here on r/mma know more than his nutritionist",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "isnotreal1948",
                                            "body": "Goofy as shit. Pasta and rolling with Nina 🤣",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "frankster99",
                                    "body": "That's fair",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "isnotreal1948",
                                            "body": "I just wish we could have Arman Vs Ilia and Justin vs Charles (have they fought yet? I don’t remember) to get this all over with \n\nIslam probably only has a few years at most before he retires and I wanna see his earn that GOAT status. Figure your shit out, contenders!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "roald-aldo",
                                                    "body": "Yh do Bronx choked him out, lightweight really need to get the ball rolling in terms of matchmaking",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "isnotreal1948",
                                                            "body": "Of course he did lol. Justin really is a glorified gatekeeper sadly, as much as I love that man",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "roald-aldo",
                                                                    "body": "Yep, hate to say it but Islam vs Garth is a waste of a matchup.. we all know how that story ends",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sad-Cheek9285",
                                                                            "body": "Yep. Islam beats JG, DP, CO. CO beats DP and JG. DP and JG are 50/50. All of the above beat chandler. It’s time for new blood (topuria) and it’s ridiculous for them to throw fits and dodge him. \n\nAll of that said, I love gaetchje and poirier.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "frankster99",
                                                    "body": "Yeah they fought but charles destroyed Justin, he probably does so again tbh but I'm all for a 2nd fight.  I completely agree, need to get something booked.",
                                                    "score": -1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "isnotreal1948",
                                                    "body": "Round 1 of his last fight a few weeks ago makes me think he’ll just get finished again but fuck it do SOMETHING lmao",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "frankster99",
                                                    "body": "Justin just fought tbf",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "isnotreal1948",
                                                    "body": "I’m all for giving him time to rest, I’d never be against that. But if he wants to be considered a title challenger still, time is not on his side and he’s still a few fights short",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "frankster99",
                                                    "body": "Good point",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Due-Contribution6424",
                                                    "body": "He did not destroy him. It was them going back and forth like maniacs for less than a round. Justin dropped Charles also, they were just fucking cracking. Up there with my favorite 1 round fights.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "frankster99",
                                                    "body": "He got destroyed, on the ground",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Due-Contribution6424",
                                                    "body": "There wasn’t a single TD. He got dropped on the feet and Charles dove on the submission. He also dropped Charles. Did you even watch the fight? They landed over 50 significant strikes in like half a round, dropped each other. Charles dove on the sub.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Meeedick",
                                    "body": "Uh, no? That's not how that works. Do people even understand how weight cuts work??",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "isnotreal1948",
                                            "body": "If you eat a fuck ton of heavy foods all fight week you WILL have trouble cutting weight",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Meeedick",
                                                    "body": "Cutting weight is about cutting water, not food. Pasta is protein and fat heavy while placing less emphasis on carbs, which is what you want during a weight cut.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "Shade_Raven",
                                                            "body": ">Pasta is protein and fat heavy while placing less emphasis on carbs\n\nPasta is carbs carbs carbs lol.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "jbglol",
                                                                    "body": "Dudes never looked at the back of a pasta box or something i guess. Even protein pasta, made of chickpea or other plant based proteins, is mostly carbs, and that was definitely not what Arman was eating lol",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Steve_Cage",
                                    "body": "and the in-and-out burger fest he posted",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Blandinio",
                    "body": "How do you know the majority of the fanbase want him to fight Arman? Most would probably be more excited by Ilia fighting Islam than Charles or Gaethje fighting for the belt",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Macktologist",
                            "body": "Me too. Arman doesn’t do much for me.\n\nI think what most people mean is “want him to fight someone they don’t root for and hopefully loses to them before having a shot at beating the guy they root for.”",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UnlikelyAssassin",
                    "body": "Arman already had his chance to fight Islam. The UFC isn’t going to reward him after he pulled out on the day of, with no evidence of injury.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "okok890",
                    "body": "Who would Islam fight in the mean time?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "0zi1",
                    "body": "Airman beats Ilia imo.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Blandinio",
                    "body": "Paddy Pimblett said he wants to fight Topuria if he beats Chandler",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heebmeister",
            "body": "Who else does Charles even fight next? Other than Arman rematch, no one else besides Ilia makes sense.  LW is a fucking mess.",
            "score": 24,
            "replies": [
                {
                    "author": "TheWholeMole",
                    "body": "Holloway would be great",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Heebmeister",
                            "body": "That's a good idea actually, I would 100% rather watch Charles v Max 2 than Max v Dustin 3 which keeps getting rumoured.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Wadget",
                            "body": "Holloway v Charles no.1 contender fight. But also ilia v Arman no.1 contender fight. Winners fight Islam same time.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "Tbf with them fucking around and mentioning gaethje for a title shot, I wouldn't be surprised if Charles is in that convo",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Current_Sport_6628",
            "body": "Islam needs to move up to WW ASAP. He's too good for these LW divas",
            "score": 22,
            "replies": [
                {
                    "author": "Steve_Cage",
                    "body": "170 is crazy those dudes hit hard I feel like it's a different game. If Islam goes there he needs to improve his boxing.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "geodukemon",
                    "body": "what is this narrative that Islam can’t strike? he’s an elite striker, watch him vs Dustin, watch both Volk fights. you dont catch Volk with that head kick without good striking \n\ni know you said boxing but point still stands",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fairlysunnyday",
            "body": "Charles giving championship stipulations to fight him is weird to say the least",
            "score": 62,
            "replies": [
                {
                    "author": "Macktologist",
                    "body": "It’s super weird. These dudes that can’t beat the champ living like they are in some sort of VIP elite club of calling shots. I mean, maybe. I guess cred can get you some sway but as a fan it’s weird to watch play out.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Futaba-Channel",
                    "body": "Charles became weird after losing the belt. Called for a lot money fights and now he wants the belt back I don't really get it",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "Tbf Ilia vaccated his belt, that is charles's whole point. At least if Ilia still had his belt Charles would have a chance of being champ again, but seeing he is getting nothing out the ilia fight other than  the next title shot (which is already in the picture for him) and with Islam talking about WW i can see charles worrying that by the time he healed from the ilia fight Islam would be gone.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JimiMcHendrixson",
                            "body": "How would Ilia still having the featherweight belt give Charles a chance at the belt if they’re fighting at lightweight?",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Because ilia would be putting the belt on the line.",
                                    "score": -18,
                                    "replies": []
                                },
                                {
                                    "author": "darretoma",
                                    "body": "did you start watching the sport last week?",
                                    "score": 34,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Please read the quote, I know English comprehension skills are rare these days . But Charles word for word said, \"come up and put the belt on the line\".",
                                    "score": -20,
                                    "replies": []
                                },
                                {
                                    "author": "inasu_j",
                                    "body": "Confidently incorrect. You can only win a belt at the weight class where the fight is being fought. Ilia can’t put up a featherweight belt at a 155 title fight. Charles is talking about the lightweight belt. Oh the irony at the English comprehension dig",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "23north",
                                    "body": "no he would not be ….",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Charles word for word said \"come up, put the belt on the line\". Read the quote infront of your eyes.",
                                    "score": -11,
                                    "replies": []
                                },
                                {
                                    "author": "JimiMcHendrixson",
                                    "body": "That’s not how it works… volk fought Islam while he was featherweight champ does Islam have the featherweight belt now?",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Well no because Volk's belt wasn't on the line, Ilia vs Charles wouldn't be a champ-champ fight, Charles word for word said \"put your belt on the line\"",
                                    "score": -6,
                                    "replies": []
                                },
                                {
                                    "author": "JimiMcHendrixson",
                                    "body": "You misunderstood.. he’s saying win the lightweight belt first and then he’ll fight him\n\nIf you fight at 155, it’s for that belt only. You can’t win the 145 belt without making 145",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Wadget",
                                    "body": "lol he just keeps doubling down!\n\nCan’t be wrong once if you’re not wrong a thousand times",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "In the context he is talking about them fighting now, before Islam.",
                                    "score": -2,
                                    "replies": []
                                },
                                {
                                    "author": "xDeathbotx",
                                    "body": "If you fight at LW the featherweight belt is not on the line....",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Tell charles that",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Macktologist",
                            "body": "He should hope Islam is gone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JustifiedOstrich",
                    "body": "He’s one of the biggest names in the UFC. I think he has a decent amount of pull now. \n\nHe also probably only has 2-3 fights left (he’s 35)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smooth-Abrocoma-2825",
            "body": "Charles has been one of the worst offenders in the promotion when it comes to weird title politicking (blud was deadass saying Islam wouldn't deserve a title fight against him even if he won a title eliminator vs. Dariush, easy to see why in hindsight) and trying to slither his way back into title fights without actually working for them.\n\n\"I'll only fight you if it's the only way for me to win the title\" is just blatant cherry picking. What the fuck happened to anywhere, anytime.",
            "score": 75,
            "replies": [
                {
                    "author": "50-50ChanceImSerious",
                    "body": "Blatantly calling for a Conor money fight over the Islam fight",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "deathmouse",
                    "body": "Wdym “slither” his way back into title fights? Isn’t he ranked 2 right now after Arman? Wouldn’t that make him the most deserving of the fight? \n\nDustin was #4 when he got the title fight which he honestly didn’t deserve. Fucking #10 Moicano got a title fight. But the #2 guy has to “slither” his way in after clearing most of the top 10? \n\nwtf lol",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Sad-Cheek9285",
                            "body": "Bruh people are tired of the same old rematches that end the same. Topuria v Oliviera would be new and exciting. Oliviera is scared cause he knows he probably loses.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "deathmouse",
                                    "body": "Scared? He’s a professional mixed martial artist I don’t think he’s scared. But it’d be a bad business decision. If he loses he misses out on a title shot. Why should he risk that for someone that’s not even ranked in his weight class? It’s fucking stupid.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SnoopysRoof",
                    "body": "I mean, I don't disagree with you, but these guys are in it to make money... getting an immediate rematch is the best path for them. They're going to take someone that either gets them top $, or if they lose, that keeps them as a close and compelling rematch.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CrooksxCastles",
                    "body": "It’s a risk vs reward factor.. Charles is far into his career likely has one more shot at actually getting the belt, has amassed a huge following along the way and doesn’t want to risk a career ending fight with someone who doesn’t have the record to back it up. It removes all the work the top lightweight contenders put into their own division as well and it really doesn’t make sense to get an immediate fight in top 3 just because you were champ in another division you skip over a massive set of work with arguably much stronger competition at lightweight.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Macktologist",
                    "body": "Those dudes are aging or haven’t been promoted properly by the UFC if they are younger.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive_Result295",
            "body": "It will never not be hilarious to me that:\n\n\n1. Ilia Topuria is actually fucked lol, bro finished the two FW GOATS, vacated his belt to get absolutely shafted\n\n\n2. We're never gonna get Islam vs Ilia or Arman, but instead Justin Gaetjhe vs Islam in July and then he's gonna move up to WW\n\n\n3. And then the weird circle of everyone saying no to everyone. Charles and Islam decline Ilia, who declines Arman, who idk why isn't campaigning for a title shot and weirdly averting fighting Islam. Weird ass division.",
            "score": 7,
            "replies": [
                {
                    "author": "droze22",
                    "body": "Hilarious that Dana is claiming this is the exact thing he wants to stop by getting into boxing (we all know he just wants money, but still) while arguably his marquee division in the UFC is in this state you've described.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xombie53",
            "body": "Well someone has to fight this son of a bitch. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "adamalibi",
            "body": "I love Charles but he's ducking",
            "score": 17,
            "replies": [
                {
                    "author": "Beneficial_Iron3508",
                    "body": "I don’t like him, I just respect him and yes he’s ducking.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "darretoma",
            "body": "But he'll fight 2-15 Chandler and coke-head washed up Conor lol",
            "score": 21,
            "replies": []
        },
        {
            "author": "jeanborrero",
            "body": "Maybe we get a Tsarukayan va Topuria title eliminator",
            "score": 13,
            "replies": [
                {
                    "author": "TurbulentBed5362",
                    "body": "We need some new blood in the division, it wouldn't make sense to put the two youngest fighters against each other  who have the highest potential",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Nuzzleville",
                    "body": "This.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pantstickle",
            "body": "Dude had 1 defense and thought lightweight would treat him like he had their belt.",
            "score": 5,
            "replies": []
        },
        {
            "author": "idkidchaha",
            "body": "Knocks out two featherweight goats\n\nAll talk\n\nAlright Charles. Sure",
            "score": 39,
            "replies": [
                {
                    "author": "inasu_j",
                    "body": "Don’t forget that Charles is reckless on the feet and gets rocked every 2 minutes. Ilia is a bad matchup for him.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "bong-water",
                    "body": "Literally gave up the belt to move up. Sounds like he's just hesitant to fight him. Feel like arman is probably the worst matchup for ilia at lightweight outside of Islam and that's probably what he's going to end up getting for his first fight up a weight class",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Macktologist",
                            "body": "It’s a case of “I don’t want to risk getting knocked out by that maniac, so I think he should fight someone else first that has different skills than me that might match up better, so he hopefully loses and goes away.”",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "TMSXL",
                                    "body": "If Charles wasn’t such a favorite around here, this thread would be full of people calling him a duck. Instead the division “is weird”. \n\nQuack quack. 🦆",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tagillaslover",
            "body": "One night tournaments need to make a comeback, would solve all of Lw's problems.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Fallingmellon",
            "body": "Seems like lightweight is genuinely worried about getting their ass beat from someone coming up, we already saw volk give them a run for their money",
            "score": 11,
            "replies": []
        },
        {
            "author": "pepsiboycoke",
            "body": "Are we taking this as fact as in Chael is passing on a message Charles supposedly told him?",
            "score": 3,
            "replies": [
                {
                    "author": "sneakerguy40",
                    "body": "Question that needs an answer",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EnoughBackground",
            "body": "They did the same when Islam was coming up. With that mentality how do you expect to become champion again? They’re going to be a problem sooner or later so you might as well face them when they’re still growing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "frizzkills",
            "body": "And this is why Charlie will never be champ again",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anglo_Jackson",
            "body": "Volk fought Hollaway straight away after winning the belt, now that Hollaway has moved up (and with this logjam/cluster fuck that lightweight is in) have him fight Hollaway at lightweight before moving to the belt or have him fight Chandler then a title fight.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CrimsonThunder34",
            "body": "Lightweight has 7+ (Islam, Arman, Charles, Dustin, Justin, Ilia, Max) awesome amazing fighters that everyone is excited to see fight, and none of them want to fight each other lol. Only Arman is game but Dana is mad at him. Lol.",
            "score": 14,
            "replies": [
                {
                    "author": "ItsTheOldDays",
                    "body": "Islam fought Charles, Arman, DP\n\nMax fought DP2x, Charles, Justin\n\nCharles fought Max, DP, Islam, Gaethje\n\nArman fought Charles, Islam\n\nDP fought Gaethje2x, Max2x, Charles, Islam \n\n\nThey’ve already fought eachother",
                    "score": 31,
                    "replies": [
                        {
                            "author": "LngJhnSilversRaylee",
                            "body": "That Max/Charles fight counts in wikipedia entries only they definitely could run that back we learned nothing from it and it was almost a decade ago now",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "frankster99",
                    "body": "Not entirely true but there is validity to this. Islam and Justin just fought and max needs a break. That said the rest need to get on and sort something out. Weird that michael chandler has already had another fight sorted out for a few weeks now while everyone else is just sorting doing nothing 🤷‍♂️.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sir_lose_alot",
                    "body": "What a wild take on all this. They pretty much all fought each other. Some multiple times",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CrimsonThunder34",
                            "body": "Obviously I'm talking about right now. The current situation is this.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sir_lose_alot",
                                    "body": "Right now people want fresh match ups not another DP vs Charles fight",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Steve_Cage",
                    "body": "Dana needs to grow a pair and get over it. Make Arman vs Illa happen.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wouterv101",
            "body": "Islam - Arman, Oliveira - Topuria (title eliminator), gaethje - hooker",
            "score": 4,
            "replies": []
        },
        {
            "author": "Avataralbino",
            "body": "I know that no one asked for my opinion but I’ll give it anyway.\nFOR ME, Ilia hasn’t done enough to have a titleshot at 55. Period. But, it doesn’t make sense to be anyone else. Arman had his shot, blew it. Charles come from a win against a nobody( in the title picture) in Chandler, and lost to Arman. Gaethje come from a win against a probably now FW in short notice, and in his other match, lost to other FW by KO in a fight that he was dominated. That being said, Ilia should have the title shot. Gaethje will have it cause Islam and most importantly, Ali want it.",
            "score": 8,
            "replies": [
                {
                    "author": "dayynawhite",
                    "body": "That's fair, I just hope you have the same energy when it came to Volk getting a shot at Islam twice.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Avataralbino",
                            "body": "The first fight was legit. The second wasn’t supposed to be Volk. But they had to deliver something big for the PPV. And I do get why Islam is kinda avoiding, he doesn’t want his legacy at LW to be against FW coming up, that’s fair. But rn, Ilia deserves the most.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "reddditor714",
            "body": "It’s funny because all these fools have 0 shot against Islam. The hype behind this division is so manufactured it’s become annoying. Charles, sit down and shut up, you are 2-2 in your last 4, which includes wins over Dariush (washed) and Chandler (LOL)…",
            "score": 2,
            "replies": []
        },
        {
            "author": "okok890",
            "body": "Islam really just needs to move up its a shame he won’t fight at welterweight\n\nIlia and Arman are the only fights for him at 55 and Arman a screwed up his shot and the ufc probably aren’t giving him another one for a while\n\n\nJustin absolutely does not deserve a shot neither did Dustin tbf but Islam wanted to stay active and Arman just fought",
            "score": 2,
            "replies": []
        },
        {
            "author": "coffeefordessert",
            "body": "IMO only fight make sense is ilia and arman. Arman is still “punished” so this is his punishment before the belt. Ilia is coming up as a former champ who relinquished his belt, if he’s not fighting the current champ, he should be fighting the no1 contender, which in this case rn it is arman.\n\nSo the only fight to make that makes the most sense whether ilia, the fans, or Dana like it or not. It have to be ilia vs arman. Correction arman vs ilia, cause arman is red side",
            "score": 2,
            "replies": []
        },
        {
            "author": "Main-Championship822",
            "body": "I think Topuria could beat Charles, I dont know if he could beat Islam.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DYoungBlood10",
            "body": "Islam vs Gaethje\n\nCharles vs Max\n\nIlia vs Armen\n\nDustin vs Hooker\n\n\nWinner of Ilia/Armen get title shot\n\nWinner of Charles/Max can be up next\n\nDustin gets a winnable and fun send off\n\nFiziev winner of chandler/patty",
            "score": 2,
            "replies": []
        },
        {
            "author": "dknaack1",
            "body": "I feel Olivera wrong on this, he hasn’t done anything special in a while now …",
            "score": 2,
            "replies": []
        },
        {
            "author": "ssevcik",
            "body": "It’s already been said both Arman and Ilia need a win before they get a title shot. Make them fight each other. Everyone gets what they want. Islam fights Justin after Ramadan. Pretty easy. Only issue at LW is all the great fighters.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DomDangerous",
            "body": "the top of the division for 155 has been notorious for not fighting up and comers.  these boys stayed on top by just round robin fighting each other lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rslash_Extrafical",
            "body": "Can dana stop being stingy and just please book Arman vs Islam 2, then we go on from there. This deadlock is destroying the division.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theiceman219",
            "body": "If Ilia has to fight a top-5 fighter at lightweight to get a championship fight, then his best option is Gaethje. He is a high-profile fighter, ranked #3, and extremely susceptible to getting caught in the pocket. Gaethje likes to stand and bang. Arman is also a good option, as he is the #1 contender, but I guess Arman doesn’t want this fight. Arman also has poor boxing defense and has a similar height and reach to Ilia. The other options are Oliveira and Poirier, but these might be the worst matchups for Ilia, with Poirier being the most dangerous.\n\nOliveira is susceptible to getting hit, but his ground game is extremely dangerous. He’s always in your face with forward pressure, and there are three things that Ilia struggles against: 1) a fighter with more reach than him (Max has the same reach as Ilia despite being taller), 2) when he’s on his back foot, and 3) when he’s on the bottom. Oliveira’s submission game is also world-class, and unless you have the wrestling pedigree of Islam or Arman, you’re not escaping it.\n\nIf the fight goes to the championship rounds, I do favor Ilia, as Charles tends to get more hittable later in the fight and often leaves his guard down. However, I could see Charles being the slight favorite in this matchup, or it could be a 50-50 fight.\n\nPoirier is probably the worst matchup for Ilia because his boxing is elite. He’s really good at rolling with punches and countering. Ilia also overextends a lot, and with a reach disadvantage against a guy like Dustin, who is excellent at countering in such situations, it’s not an ideal matchup. However, the biggest disadvantage Poirier has is his grappling. If Ilia is more powerful and stronger at 155 lbs, he could dominate Dustin on the ground and possibly choke him out. But Dustin has recently shown how good he is defensively on the ground, especially against Islam. This could lead him to lose the fight on the judge’s scorecard. Regardless of all this I do think that Ilia is a future LW champ, since Islam might move up or retire in a few years and Ilia just turned 28. He has at least 8 solid years left in the game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deepersoulmeaning",
            "body": "It’s obvious nobody wants Topuria.  He’s a beast he can beat anybody and quite honestly I think he belonged in a higher weight class.\n\nIt’s not that he can’t be beaten by these guys but at this stage it’s just all risk no reward for these guys.  If they beat him, he moved up and not big enough.  If they lose, their super washed up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fullmetalxhunter",
            "body": "These guys are too picky nowadays, I understand the steaks, but come on you guys are fighters, so fight. Been watching UFC for the past 10 years, and I don’t remember fighters being this picky.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Young_Brisk",
            "body": "We beleiving chael sonnen?",
            "score": 2,
            "replies": []
        },
        {
            "author": "goddog420",
            "body": "“Via. Chael Sonnen” 😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "RunsInHexagons",
            "body": "Arman vs Ilia is literally the most obvious fight to make. Either establishes himself as top contender for lightweight belt. Dana already said that Arman got to earn his shot again, and Ilia vacated his belt to come to a division where he has 0 wins over a top 15 Opponent.\nBoth Arent really in a position to refuse a fight. Oliveira could fight him too considering his recent win is Michael chandler, *again*.",
            "score": 6,
            "replies": [
                {
                    "author": "TheZubaz",
                    "body": "Islam is ready to fight very soon, so imo they should just do ilia vs islam and then arman vs islam or the other way around. I don't think it's good for the division to let young contenders take eachother down. Like who would you even give the title shot if arman or ilia wins and then loses to islam. You have no good contenders at that point.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impressive_Result295",
                            "body": "Also, Islam is leaving to WW (or MW lmfao) soon. He's definitely gonna want to go there before he's 35+. We might only have one fight left for Islam at LW - it'd be a shame if it was Gaetjhe (which it probably is).\n\n\n\nBut i agree - I'm fine with either Arman or Ilia getting the next shot, simply because these two are significantly tougher matchups for Islam than anyone else.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MrFudgeKiller",
                    "body": "Islam should fight Ilia or Arman. Those are the best and hardest matchups and they are both available the excuses are just holding them up.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NewportStork",
            "body": "Ilia Topuria is a better fighter than Charles Oliveira",
            "score": 4,
            "replies": []
        },
        {
            "author": "Hank-griff",
            "body": "This, amongst other match refusals, is the reason the UFC has been a bit watered down the last 4/5 years. Fighters just straight up refuse to sign in the dotted line. Some for more compensation, which is justified imo, but the guys just saying that they won’t fight because someone isn’t up to their level is maddening. This is not a fucking bracket sport. The ranks don’t really mean shit. Just suck it up and fight. Jon, lookin at you.",
            "score": 4,
            "replies": [
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "I mean I kind of get charles. He has given everything to this company, he is already guaranteed a title shot, why would he take a hard match up when he is guaranteed a title shot.\n\n  \nIt's like how they offered ilia a fight against Arman for the number 1 contender spot. But ilia declined, why would ilia take a hard match up when he is guaranteed a title shot.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Sad-Cheek9285",
                    "body": "Bruh Charles is a chicken. He knows topuria probably beats him and so he’s ducking. No one wants to see him lose to Islam again.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MrFudgeKiller",
                    "body": "Why is he guaranteed a title shot. Ilia, Arman and even Gaethje are all ahead of him he can’t just sit around after beating Michael Chandler",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SydneyCarton89",
            "body": "Topuria moving up is the dumbest shit ever. He had a long line of contenders he hadn't fought at featherweight yet. Everyone wants to copy McGregor instead of Aldo now. Sad.",
            "score": 2,
            "replies": [
                {
                    "author": "Crateapa",
                    "body": "What is the value of beating up and coming contenders when he KO'd the two best FW's ever? It's all downhill from there.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "trudedonson",
            "body": "Illia needs to fight arman for a title match against islam",
            "score": 5,
            "replies": [
                {
                    "author": "darretoma",
                    "body": "Who does Islam fight?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "TheWholeMole",
                            "body": "moicano again",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "darretoma",
                                    "body": "Moises rematch",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "trudedonson",
                            "body": "Let him rest for a year and let the others fight each other",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "dayynawhite",
                            "body": "What's with people wanting champions in their prime be inactive for years for no good reason? I'll never understand",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "darretoma",
                            "body": "he fought a single short notice opponent this year and you want him to sit out lol?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "trudedonson",
                            "body": "Yes ! I do want him to sit out . Its not his fault armans back cant fucking handle Nina's ass . And we know arman aint gonna have that title match without a win . If theres a guy that deserved title match is justin but we know its gonna be one sided match",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "darretoma",
                            "body": ">If theres a guy that deserved title match is justin\n\noff a win over a short notice opponent he already beat coming off a 2 year layoff. Beyond parody.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DramaticConference44",
            "body": "Ilia in 155 : Lonely, I'm so lonely",
            "score": 2,
            "replies": [
                {
                    "author": "SquidDrive",
                    "body": "So why did he refuse to fight Arman.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hefty_Arm_6753",
            "body": "They all will do what dana tells them to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darryledw",
            "body": "I am only upvoting OP if he wins the belt but before he gets a shot at the belt I want him to thank me for my upvote",
            "score": 1,
            "replies": []
        },
        {
            "author": "dzone25",
            "body": "Honestly? Fair enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thom986",
            "body": "Ilia in, the top 10 is quite crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheyUsedToCallMeJack",
            "body": "Just get Islam to move up to 170 and make an interim belt, then both guys would agree to a fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maleficent-Cancel853",
            "body": " So many guys at lightweight are at a point where they have fought a good amount and are probably focused on minimizing taking damage for no good reason. \n\n Its a time, effort and cash investment to prepare for a fight and fighters like Charles have literally fought for and earned the opportunity to choose and negotiate the fights that are most in their interest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iHazf",
            "body": "Well someone's gonna be *ordered* by Dana to fight someone or forget about the title, regardless of these statements anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darthmaulsdisciple",
            "body": "Charles has never talked this way about any fighter",
            "score": 1,
            "replies": []
        },
        {
            "author": "background_action92",
            "body": "Chuck is endorsing for Ilia to get the title fight lol. \" look man  you wanna fight me? Go get the belt and then we do business, capishe?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Robinho311",
            "body": "Dude gave up his belt and instantly getting the \"wrestler from caucasus\" treatment from other fighters lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Inflation9169",
            "body": "I think everyone is afraid to lose their spot right now. Nobody wants to fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brybry1908",
            "body": "Everyone ducking everyone it seems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FordGT2017",
            "body": "Islam is the only fight to make. If they are not letting Arman fight there is no one else. Islam handled everyone with ease",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shingyshatfat",
            "body": "Charles should just fight him throwing caution to the wind, if he wants to prove he deserves the title shot this would help, and it would signify an attitude that he’s hungry for it. It would also be very entertaining ",
            "score": 1,
            "replies": []
        },
        {
            "author": "IHateMylife420000",
            "body": "Lightweight has turned into just a bunch of rematches between former opponents",
            "score": 1,
            "replies": []
        },
        {
            "author": "nicklicious5150",
            "body": "Champ won’t fight him until he beats a top contender, top contenders won’t fight him unless he has the belt. Somebody is gonna have to sack up because pretending an undefeated ex champ who just smoked Max Holloway has to earn a fight with you is ridiculous. It’s either Islam or Charles, unless they really want to send Poirier out like that.",
            "score": 1,
            "replies": [
                {
                    "author": "SquidDrive",
                    "body": "The obvious answer is book Poirier vs Topuria bit suprisingly alot of Topuria fans dont want that fight for some reason.\n\nIf he cant take out a 37 year old Poirier, he shouldnt be in the cage with Makhachev.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessorCaptain",
            "body": "fair tbh. its not any of the existing LW's problem that ilia dropped his belt to move up. its not their problem to turn around and fight him when theyve been trying to climb rank in their division this whole time. especially when hes probably not an easy fight. i dont see any of the title contenders going for it. they beat ilia and then what, their rank doesnt change. do they get a title fight off fighting a dude not ranked at lw? i know its ufc and the rules dont matter but i see their issue. i assume he'll fight justin, dustin, or i guess maybe arman since he seems game for it\n\non charles specifically, hes one of my fav fighters but he always gets caught haha, i wouldn't fight ilia either if i was him unless i had to XD",
            "score": 1,
            "replies": []
        },
        {
            "author": "coldsigma",
            "body": "lightweight is a new welterWait!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FakeEmailButton",
            "body": "Olives vs Tops confirmed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NorthRhino18",
            "body": "Bro these Lightweights are so picky💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "F3maleB0dy1nspector",
            "body": "I like Ilia a lot, but Charles is right here. The top lightweights in the division have earned their ranks in blood. You could argue Charles, Ilia or Justin getting a title shot right now. Even more movement on the way if Paddy chokes out Chandler. It’s an interesting time, but a bit of a jam at the top with a bunch of legends wanting one last shot at the belt before they lay em down",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kartem4x",
            "body": "Im tired of this already.  \nHopefully this wont last too long and we get some fights booked",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoMamesKING",
            "body": "Ilia Vs Dustin🤓…. Charlie vs Arman 5 rounds🤔… Islam vs Justin 🤮",
            "score": 1,
            "replies": []
        },
        {
            "author": "okgetwrekt",
            "body": "Give illa the title fight. Fans want it. Charles don't want the smoke. Arman wants to fight hooker/gaetjie/Charles and there is no one else putting their hands up. Why all this mental gymnastics. Islam won't move up because of Bilal. Illa vs Islam is the only fight that makes sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "surgeyou123",
            "body": "No one wants to fight at LW now. Its turning into how WW used to be lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial_Basis8705",
            "body": "Charles can do whatever the fuck he wants, he's brought me so much joy over the years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad_Manufacturer4813",
            "body": "Dustin Poirier should fight ilia for his last fight show that ilia can be outboxed",
            "score": 1,
            "replies": []
        },
        {
            "author": "sneakerguy40",
            "body": "Did Charles actually say this tho?",
            "score": 1,
            "replies": []
        },
        {
            "author": "royalroadweed",
            "body": "Armand vs Topuria for next title shot. Charles vs Justin for the one after that.\n\nThough I don't think Charles is in any position to big shot anyone. He's not the Champ and beating someone known for losing FOTYs doesn't make you the #1 contender.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial_Set5243",
            "body": "Ilia to fight Justin makes sense. But I want Justin to fight for the title next, this is going to be his last chance. My God I would love to see Ilia vs Paddy over everything else next.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnimateDuckling",
            "body": "Why has their not been an Islam vs oliveira 2 or islam vs Justin?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial_Swan6947",
            "body": "I said it on a previous thread, that lightweight is just a gaggle of dudes not wanting to fight each other",
            "score": 1,
            "replies": []
        },
        {
            "author": "DangerPretzel",
            "body": "Nobody wants to fight anybody at lightweight it feels like.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigMack6911",
            "body": "Put..what belt on the line? Um..is anyone going to tell him",
            "score": 1,
            "replies": []
        },
        {
            "author": "dragoswastaken",
            "body": "Neither Charles, Gaethje or Dustin deserve a title fight right now. It should be Armen, but if Dana can't handle that give it to Ilia. Have Armen fight Dustin or Gaethje, and have Olivera fight Holloway since he's already beaten the other two.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueSquigga",
            "body": "Is it weird my first thought was, \"Why does one of them have a milk moustache?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "99MilesOfBadRoad",
            "body": "Smart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poompachompa",
            "body": "Isn’t oliveira like one of the nicest guys in the ufc too hahaha",
            "score": 1,
            "replies": []
        },
        {
            "author": "Relevant_Mail8285",
            "body": "Shameless ducking. You aint champ buddy you are a contender just like him",
            "score": 1,
            "replies": []
        },
        {
            "author": "VonNichts13",
            "body": "you will fight whatever daddy dana tells ya to bud.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redpandav",
            "body": "Now this I wanna see",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_am_darkness",
            "body": "I don't believe chael. he always talks shit about charles and he always makes stuff up. He claimed he talked to charles but charles doesn't speak english.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silverback1992",
            "body": "Eh, tbh Charles has no right to make that call, he doesn’t want to lose a title contender fight again so he’s demanding a title fight. Not how it works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnoopysRoof",
            "body": "Battle of the shit chest tattoos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drphilbangedmydad",
            "body": "Arman deserves it. Unless something happened that nobody is saying, pulling out with back spasms is a super valid reason, if you've ever had them. You can't even move let alone fucking fight Islam lol\n\nIf not arman, it's gotta be ilia. He smoked two high pound for pound guys in a row and besides arman, lw has no clear contender.\n\nAlso I think Charles dies against ilia and I'm a fan of his. Terrible stylistic matchup for him.",
            "score": 1,
            "replies": [
                {
                    "author": "kgsovobd",
                    "body": "It should’ve been Ilia Vs Islam from the start. Biggest fight you can make. I think those two are my picks for best p4p in the world. If Ilia wins, especially by KO, he becomes the next Conor. If Islam wins, he can move up to 170.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tha_based_god",
            "body": "I want Olivera vs Holloway BMF fight!",
            "score": 1,
            "replies": []
        },
        {
            "author": "thiscantbe2",
            "body": "Topuria should fight Holloway at this point 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "1998ChevyTaHoe",
            "body": "Makes sense ngl",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntolerantModerate",
            "body": "If Topuria isn't a threat the why don't any of these guys tell DW, I'll fight him, but if I win I am guaranteed a title shot.\nIf you are the champ, like Islam, your attitude should be that you can be anyone at that weight class any time. Well, now he'll be fighting a smaller guy and he's ducking.\nOlivera is just straight up ducking him. He basically says the guy is a ca,.so he's not going to stoop to can crushing.\nDP I think should get who he wants. It's a retirement fight and he should get to choose anyone not in immediate title contention who is willing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cutslikeakris",
            "body": "Olives shouldn’t duck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "baker2212",
            "body": "Damn do bronx… that’s weak from you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Frame-5973",
            "body": "Ilia by ko round 1 sorry charles",
            "score": 1,
            "replies": []
        },
        {
            "author": "BKR93",
            "body": "Why is ANYONE but Islam having a say in anything? Ok, dont fight, and move along to a different organization. Holy shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "CompetitiveShower872",
            "body": "Put that fight on..",
            "score": 1,
            "replies": []
        },
        {
            "author": "head_empty247",
            "body": "LW situation rn:\n\nPros: it's so stacked with Islam, Arman, Charles, Justin, Max, and Dustin in the mix.\n\nCons: but since it's so stacked, no one is fighting anyone. Islam doesn't want Ilia, Ilia doesn't want Arman, Charles doesn't want Ilia, and Arman doesn't want... Idk. Haven't heard Arman isn't willing to fight anyone else yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Successful-Fold-9554",
            "body": "Real test for topuria, but that response makes it sound like its going to be one of those if only it happened sooner fights.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GastlyWitYaNan",
            "body": "He told this to Chael of all people",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pennypacker-HE",
            "body": "He’s already assuming topouria gets a title shot before him. Also seems like he thinks he has a much better chance against Ilia versus Islam. And I would have to agree with him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Economy-Grape-3467",
            "body": "These are 2 of my favorite fighters. They are so well rounded. I wouldn't want either of them to lose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VentureDoBronxs",
            "body": "Come ooon charles. Literally the only fighter on the Roster I'd actively cheer for against Topuria",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anxious_cuddler",
            "body": "Honestly I really don’t care that Arman missed weight or broke his back or whatever, I want to see that fight. He’s realistically the only one who should be next in line. Under any other circumstance I’d understand the UFC wanting to punish him, but let’s just set the fight up already please!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiddiesjackson",
            "body": "Let’s be honest, despite whatever reasons Arman dropped out of the fight for, we all still really want to see that fight. Absolute highest level of MMA. Ilia is running away from defending his belt. I find it hard to believe a guy as big as Diego Lopes can make 145 but somehow Ilia’s short 5’7 ass can’t make the weight anymore. The hardest thing to do in this sport is to defend your belt a handful of times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackhippy92",
            "body": "I love Charles... But \"this is my weight class\"....?\n\nCome the fuck on",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arthurmrmusic",
            "body": "Fact",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comprabledivision",
            "body": "Thats fair",
            "score": 1,
            "replies": []
        },
        {
            "author": "jep004",
            "body": "Love that topuria’s gamble isn’t paying off. Dude should have cleared FW division out first.",
            "score": 1,
            "replies": [
                {
                    "author": "kgsovobd",
                    "body": "Ilia is the fight that would make the most sense. Everyone knows Islam will smoke Gaethje easily and although Arman has a shot, I don’t think he has the danger to threaten Islam. In other words, I think Arman is a worse version of Islam. It’s actually better for FW that Ilia vacated. I’d heavily favor Topuria against anyone in that division. Now, there’s more compelling matchups that are 50/50. Volk vs Lopes, Volk Vs Evloev, Lopes and Evloev rematch, etc",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jep004",
                            "body": "I disagree. Ilia needed to at least take out the heavy hitters of FW before vacating trying to copy the original Conor method. Islam cant just build his LW legacy taking out FW fighters that move up.\n\nIlla should have defended against Lopez and Evloev before leaving. If he doesn't get the islam fight he fumbles the bag. \n\nAll of these champs wanting to be double champs asap gets extremely tiring for the fans. It holds up the division, it throws a wrench in the rankings, its annoying as well. \n\nClean out your division, then chase it. Volk and Izzy did it correctly.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MyNamesTambo",
            "body": "They should just give Arman the title fight and have Ilia get winner. Not like lightweight has any other clear contender",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChromaticM",
            "body": "They're all afraid of Topuria.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AffectionateFace5858",
            "body": "Welcome to the UFC, where the best fight the best. Unless the best is Ilia Topuria in which case they shit themselves. So sick of the old lightweight guard now, they've been using their star power and rankings to duck contenders for way too long (just look at Islam and Armans resume's pre any title fights, none of the old guard wanted to fight them. Heck no one wanted Gamrot either, the best we got was gaethje and Poirier fighting 2 number 11 ranked guys who were good stylistic match ups for them, the second a wrestling contender appeared suddenly it's \"legends only\" )\n\n\"there will never be a lightweight division like these guys again\" yeah thank God I hope not",
            "score": -6,
            "replies": [
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "Why would charles put his position at risk knowing he is already back in the title picture. \n\n  \nIlia was also offered Arman number 1 contender match but he declined, he doesn't get to chase charles now.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "AffectionateFace5858",
                            "body": "You guys believe anything you see on the Internet, tell me what outlet broke the story about Ilia refusing to fight Arman? A Russian tabloid called TASS said they spoke to \"a source\" who confirmed Ilia turned down the fight aka meaningless garbage. Why do you guys fall for the stupidest headlines all the time?\n\nTo be fair I'm no better, the source for this is chael so I shouldn't have believed this either. I didn't read the Via chael sonnen part. Still my point about Arman, Islam and Gamrot being ducked in favour of a \"BMF belt rematch\" still very much stands",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SquidDrive",
                    "body": "My guy, Ilia refused to face Arman.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "AffectionateFace5858",
                            "body": "According to some random Russian publication that no one has ever heard of, why on earth would they want to tarnish Ilias name? Couldn't even begin to theorise",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SquidDrive",
                                    "body": "Has Topuria debunked the statement, because the whole division is saying fight Tsaryukyan, and Topuria vs Tsaryukyan isnt being made. \n\nSafe to say he doesnt wanna fight a big elite wrestler not named Makhachev.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smooth_Bend_4436",
            "body": "As much as I don't want to see Topuria win, I can't help but admire the way he scares everyone",
            "score": 1,
            "replies": [
                {
                    "author": "awadhan",
                    "body": "he is scared of Arman! Refuses to fight him!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Responsible_Emu3601",
            "body": "Topuria vs chandler then if he beats paddy lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ill_Source_6908",
            "body": "Ilia is gonna have to nut up and just fight arman. Arman vs ilia as a #1 contender fight",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cynoid",
            "body": "Olivera who is 3-2 in his most recent fights and is not the next belt challenger in his own division talking down to an 8-0 Ilia that has never lost in the UFC and has a belt is wild.\n\nIlia should be able to skip Olivera and Arman and fight for the title if history is any indication/",
            "score": 1,
            "replies": []
        },
        {
            "author": "kirko_durko",
            "body": "Charles vs Islam\n\nArman vs Ilia -> winner gets the next title shot\n\nIt’s really that simple",
            "score": 0,
            "replies": [
                {
                    "author": "hallinondrywall",
                    "body": "Charles does not deserve title fight",
                    "score": 5,
                    "replies": [
                        {
                            "author": "kirko_durko",
                            "body": "It should be Arman but he’s not gonna get the shot per Dana, so then what? Islam already said no to ilia and ilia doesn’t deserve a title shot anyways. So give it to the #2 ranked and let #1 battle it with ilia.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LunchBoxKid",
            "body": "Wow Illia kinda pulled a Cejudo didn't he. Walked away from the table with nothing and believed his name would carry him enough but now nobody wants to fight him and it's looking more and more like he's going to have to fight his way up. Should've defended the belt a few times and built something behind his name. But now here we are.",
            "score": 0,
            "replies": [
                {
                    "author": "TMSXL",
                    "body": "Nothing like Cejudo lol. Cejudo did it to strong arm the UFC, Illia is willing to fight a contender…it’s not his fault the division is ducking him.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ChooseUsername9293",
                            "body": "Cejudo also \"retired\", not simply move up",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DonkStonx",
            "body": "Topuria causing the best to dodge, duck, dip, dive, and dodge.",
            "score": -14,
            "replies": [
                {
                    "author": "Asleep_Hurry_9033",
                    "body": "I think it's more that it's all risk for them with little to no reward. Charles is Already back in the title Picture if he beats Ilia he maybe out of commission for some time and with Islam talking about WW, i can see olives worrying that by the time he is ready  to fight Islam  would be at WW.\n\n  \nPlus Ilia was offered an Arman number 1 contender fight and he declined it. Ilia doesn't get to dictate what happens at lw.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "frankster99",
                            "body": "I remember the days when champs had to fight number 1 or 2 guys and there was a lot less farting around. When light heavyweight division was at its peak about 10+ years ago and at least half of those bad mofos were in pride people weren't scared to lose. Put it all on the line to be a real fighter and fight the best and prove themselves or short notice or whatever. We've lost a lot of that attitude these days unfortunately.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Leirac1",
                                    "body": "But Arman and Charles are the number one and two guys",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Asleep_Hurry_9033",
                                    "body": "Tbf most of these pride dudes now have cte and can barley walk their lifestyle was neither good or sustainable, some of them even ended up worse.\n\n  \nLike you can't blame modern fighters at the end of the day nobody is going to give a fuck about them 10 years after they stop fighting except for hardcore fans. Charles has every right to value his money and health over some pats on the back for being a \"savage\".",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "frankster99",
                                            "body": "That's true but they should still be more active, don't need Connor levels of inactivity around. Bad enough that Islam only fought once last year.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tagillaslover",
                    "body": "Fighter would rather fight for belt than not, more at 11",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "SquidDrive",
                    "body": "Topuria refused to face Arman, this is own words.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ihavenodecorum",
                    "body": "Too many motions for lightweight. They only speak in terms of zig or zag",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "patronum-s",
                    "body": "He ducked Arman lol",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FishtheJohnerman",
                    "body": "Don't blame them he is in his absolute prime and probably chins all of them",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "x0ManOfCulture0x",
            "body": "At this point we really will get Islam Vs Justin 💀",
            "score": 0,
            "replies": []
        },
        {
            "author": "tangledupinluke",
            "body": "Sounds like everyone’s shit scared of fighting Ilia",
            "score": 0,
            "replies": [
                {
                    "author": "SquidDrive",
                    "body": "Ilia refused to face Arman",
                    "score": 4,
                    "replies": [
                        {
                            "author": "tangledupinluke",
                            "body": "Oh shit yeah, missed that headline!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SquidDrive",
            "body": "It sounds like were at a deadlock\n\nIslam says Topuria needs a win\n\nTopuria says he refuses to fight Tsaryukyan\n\nAnd now Olives is saying he wont fight Topuria.\n\nThese are realistically the 3 biggest dogs at 155 rn in terms of star power.\n\nSo lets do Topuria vs the winner of DP's retirement fight\n\nWinner fights Makhachev\n\nOlives is next man up.",
            "score": -5,
            "replies": []
        },
        {
            "author": "ertybotts",
            "body": "Islam is the only one who has a reasonable position. He doesn't deny anyone a fight if they are a legit contender. He has already given 2 chances to a FW so you can't keep asking him to fight FWs who haven't earned it.",
            "score": 8,
            "replies": []
        },
        {
            "author": "darretoma",
            "body": "Stop acting like the 2nd Volk fight was a \"chance\" lol.\n\nThey served up a win over P4P #1 on a silver platter for him and you people act like he was doing charity work for make a wish kids.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "My guy Islam doesnt get credit for beating Volk period. Bro had his hydration phase cut, he came in physically smaller and weaker than normal(Volk and Islam weighed the same in the cage)\n\nIslam beat Volk, and that win gets used against him, if he can beat Prime Volk while dehydrated and he gets no credit because its a FW, why wouldnt he ask Topuria to win one fight beforehand so hes established as a LW?",
            "score": 2,
            "replies": []
        },
        {
            "author": "darretoma",
            "body": "I'm not really disagreeing with anything you've said here but the 2nd Volk fight should be completely irrelevant in this discussion. That was a gift for Islam - it wasn't him giving anybody a chance. He will always have a violent KO over P4P #1 on his highlight reel.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "Fair enough.\n\nIon know people keep talking about a LW logjam, but I dint see it, Makhachev is the reigning king, Topuria should win a fight and the fight gets made. These are respective kings of their division, but not all kings are equal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darretoma",
            "body": "But who does Islam fight?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "Shelve him for fall",
            "score": 1,
            "replies": []
        },
        {
            "author": "ertybotts",
            "body": "It was. Volk was getting a second shot at the LW title without putting any risk on the line. He lost but he was still the FW champion. Islam took all the risk only to get shit on by people like you. \n\nSo in what world does it make sense for him to give Ilia an undeserved shot? I know for a fact he will get shit on regardless of the result of that fight.",
            "score": 2,
            "replies": []
        },
        {
            "author": "darretoma",
            "body": "Islam got a layup over P4P #1 on short notice. You can't spin that as anything but a gift - sorry.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ertybotts",
            "body": "P4P #1 is a layup in your mind?",
            "score": 2,
            "replies": []
        },
        {
            "author": "darretoma",
            "body": "On 10 days notice, up a weight class, after already losing the first fight?\n\nYeah I'd say so. Volk was never going to be competitive in that fight.",
            "score": 0,
            "replies": []
        },
        {
            "author": "tagillaslover",
            "body": "Except Ilia is a better defense than Justin and he already beat Charles and Arman just fucked a card",
            "score": -3,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "Is he?\nLets imagine a hypothetical for a second.\nWhat if Ilia bulks to 155, and nothing translates, hes weak as shit, he has no pop, we dont know how guys translate up a division, some guys get even stronger, some guys get neutered.\n\nIf LW Ilia does not translate his attributes, would he really be a better defense than a actual top tier LW established for years in Gaethje?",
            "score": 3,
            "replies": []
        },
        {
            "author": "tagillaslover",
            "body": "Except we know he has power at 155, we've seen him ko people there before. There's zero reason to believe he wont translate well, theres an extremely high rate of 145 fighters translating well to 155",
            "score": -1,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "We have no idea if his strength translates to elite LW.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tagillaslover",
            "body": "Stop moving goal posts holy shit. It will, elite power at fw isnt going to dissapear at lw. He flatlined Herbert at 155, that isnt just going to go away. islam was knocked down by volk",
            "score": 0,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "A Islam off a bad hydration phase, in the 5th round, completely exhausted. \n\nWhy do you ignore that little bit?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ertybotts",
            "body": "Then let's put it to the test against a top LW contender. That way, if he wins, the Makhachev fight makes all the sense in the world and the hype will be off the charts. Ilia has exactly one FW defense so even I'm not on board with giving him an immediate TS a weight class above.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darth_DeLorean",
            "body": "But what if DP wins his retirement fight?\n\nHe unretires for one more run at the belt?",
            "score": 3,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "Well assuming he retires, we just do Makhachev vs Topuria, and Olives fights the winner.\n\nAssuming he fights, we do Topuria vs Poirier, a 37 year old Poirier(as great as DP is) at this point should be favored as the underdog against Topuria. He should beat a 37 year old Poirier, and then face Islam.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PrinceDX",
            "body": "Thank you Charles",
            "score": 0,
            "replies": []
        },
        {
            "author": "UnlikelyAssassin",
            "body": "Based on this, I feel like these fights would make sense:\n\nIlia Topuria vs Dustin Poirier\n\nIslam Makhachev vs Justin Gaethje\n\nCharles Oliveira vs Max Holloway\n\nArman Tsarukyan vs Dan Hooker",
            "score": 0,
            "replies": []
        },
        {
            "author": "ChipmunkGeneral",
            "body": "165 lbs division. Something something ",
            "score": 0,
            "replies": []
        },
        {
            "author": "giant-tits",
            "body": "I hate lightweight now",
            "score": 0,
            "replies": []
        },
        {
            "author": "Crateapa",
            "body": "Undefeated vs 10 losses. 0 weight misses vs most weight misses in UFC history. Vacated belt to move up vs lost it to hang around and botch his next shot. \n\nWhy is anyone taking Charles seriously?",
            "score": 0,
            "replies": []
        },
        {
            "author": "MtFranklinson",
            "body": "He’s scared, topturo would knock him out for sure",
            "score": 0,
            "replies": []
        },
        {
            "author": "Stanley_OBidney",
            "body": "Since when did “I hold a higher ranking” mean someone doesn’t deserve to fight me? The champion has the right to claim someone hasn’t earned their shot, everyone else is competing for their title shot.",
            "score": 0,
            "replies": []
        },
        {
            "author": "tinywienergang",
            "body": "Not sure why Islam won’t accept him. He’s cleared out the division minus Arman, and they won’t remake the Arman fight because of his fuckery. Ilia has wins at 55, and he finished the two greatest champions in his division. Give him the shot.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "Islam fought Prime Volk, while dehydrated, and that win gets used against him because Volk was a FW, why would he face another FW?",
            "score": 3,
            "replies": []
        },
        {
            "author": "EndrydHaar",
            "body": "Islam should stop ducking Ilia",
            "score": -1,
            "replies": []
        },
        {
            "author": "CounterUpper9834",
            "body": "It's like Jon Jones asking Tom Aspinall to beat a champion first before they can fight.",
            "score": -2,
            "replies": []
        },
        {
            "author": "ImJustColin",
            "body": "No one will fight anyone…only one guy is game Topuria.\n\nSorry but if the champ won’t fight Arman, Oliviera or Topuria he isn’t really the champ anymore.",
            "score": -3,
            "replies": []
        },
        {
            "author": "SquidDrive",
            "body": "You realize the champ beat 2 of the guys.\n\nCan Topuria not take a detour and KO a 37 year old Poirier before facing Islam.",
            "score": 1,
            "replies": []
        }
    ]
}