{
    "title": "[Damon Martin] Tom Aspinall shocked anybody scored Alex Pereira beating Magomed Ankalaev: ‘Wild to me how many uneducated fans are out there’",
    "author": "SoloChords",
    "subreddit": "MMA",
    "rank": 16,
    "score": 696,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 194,
    "url": "https://www.mmafighting.com/2025/3/17/24387240/tom-aspinall-anybody-scored-alex-pereira-magomed-ankalaev-wild-how-many-uneducated-fans-out-there",
    "id": "1jdrxg3",
    "selftext": "",
    "comments": [
        {
            "author": "Melissa9898",
            "body": "Crazy so many people write this off as a Ankalaev win by cage stalling when most of the fight is him winning the striking\n\nIt’s Pereira who’s largely to blame for the fight being boring, Ank was able to shut down pretty much all of his offense with his counter striking, pressure, and hand fighting, and Pereira was content to stay on the back foot unable to get his offense going the whole fight without adapting or even just going forward and exchanging trusting in having the greater power.",
            "score": 453,
            "replies": [
                {
                    "author": "ksubijeans",
                    "body": "Doesn’t fit the narrative. MMA fans will create a head canon that becomes damn near fact for anyone looking for a reason to complain or over exaggerate. It’s the same reason people think Cruz/Garbrandt was a blowout.",
                    "score": 170,
                    "replies": [
                        {
                            "author": "Aggressive-Produce54",
                            "body": "Finally! I've felt like I've been living in bizarro world for nearly a decade after that fight. It was a clear Garbrandt win, but damn he had to work for it. The Tik Tok/YouTube Shorts knockdown and taunting narrative does not tell the whole story.  ",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "Adept-Eggplant-8673",
                                    "body": "Same thing for the umar merab fight",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "Melissa9898",
                                            "body": "Yeah that’s an incredibly close one, Merab basically took it by one punch in the last round, would love to see that one rematched eventually",
                                            "score": 25,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ksubijeans",
                                    "body": "Why watch an entire fight when there’s edits and highlights?",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "New-Bookkeeper-8486",
                            "body": "But bro... he did push ups and was dancing",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "TemporaryOwl69",
                            "body": "Cause it was... people who only look at judging or fight stats instead of watching the fight always expose themselves with this take lmao. Cody spent pretty much the entirety of r5 celebrating cause everyone knew he won. Dude beat the shit outta cruz",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alternative_Plan_823",
                    "body": "I don't pay too much attention to the media narrative, but I didn't know there was any other way to see this one. I don't particularly like Ank, and I was rooting for Pereira, but he didn't do shit the whole fight. What do I know?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Joe3million",
                            "body": "agreed it seemed like a clear ankalaev win, but so many of the media outlets or content creators in the space i watch scored it for Alex live and continue to say it was a close fight (id argue it was competitive, but not all that close to score.)",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "ItsMichaelScott25",
                                    "body": "I think it was close in terms of scoring but I also thought Ank won the fight. Personally thought 1, 2, & 4. Were extremely easy rounds to score. I leaned Alex for the 5th so then it's 2-2. The 3rd round, which was the deciding factor was extremely close. Again I leaned Ank but it's not like it was a clear and decisive round.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "EveningNo8643",
                                            "body": "I personally had rd 2-5 for Ankalaev. He got outstruck and controlled in rd 5 too",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "slutwhipper",
                            "body": "I was rooting for Ank and I had it 1, 3, 5 Pereira. Round 3 was the swing round and I thought Alex edged it live.\n\nEdit: Just rewatched and have Ankalaev winning the round pretty comfortably. No idea what I was thinking before. I honestly think the significant strike stats they put on the screen might have swayed me when watching live. I was shocked to see Alex was significantly ahead on the numbers",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "mutantpanda68",
                                    "body": "Commentary skews perception so much. There are a lot of fights that you will have completely different scoring of if you just mute it and aren't hearing Rogan and DC talking about how who is winning (all commentators can be guilty of it, but those two are on another level of just wildly misrepresenting what is happening in the cage). Rinat/Leal from a few months back is a classic example as it is a pretty close fight throughout, but DC is talking like Leal is just destroying Rinat the whole fight so when the decision comes down for Rinat people were stunned.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "professorgaysex",
                    "body": "Ngl I have kind of ironically become of a fan of Dagestanis pushing fan favorite fighters against the fence and kneeing their thigh just cause it’s now Classic RageBait™️ against the most annoying MMA Fans \n\nEvery instance it happens I go on Twitter just to see everyone crashing out over like 2 minutes of control time",
                    "score": 55,
                    "replies": [
                        {
                            "author": "99MilesOfBadRoad",
                            "body": "I mean their entire fanbase.is basically composed of \"ironic\" fans and Muslims.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "funghi2",
                    "body": "Alex threw 11 punches",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "DiceRollerGreg",
                    "body": "He wasn’t content. He was turtling up. He protected himself from takedowns but was over cognizant of wrestling.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Any-Connection-1813",
                    "body": "100 percent. Ank for sure did some bitch fence fucking. But in a 5 r fight there were plenty of striking opportunities for alex which he just didn't capitalize. And in many instances ank was looking like the better striker that night.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "EveningNo8643",
                            "body": "He didn’t capitalize because Ank shut him down and Alex didn’t adjust his approach",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ergoegthatis",
            "body": "> ‘Wild to me how many uneducated fans are out there’\n\nThis sub: Tom Aspinall was never my friend.",
            "score": 143,
            "replies": [
                {
                    "author": "MarlonShakespeare2AD",
                    "body": "lol\n\nTom is not some thug though\n\nSure he’s a fucking terrifying guy to fight in the cage. No doubt. \n\nBut outside it he’s an absolute “student of the game”. Raised by a man who gets martial arts at a deep fundamental level. \n\nWatch some of his training videos - not just the new ones. Very very technical stuff. \n\nIt’s like some master chef tasting some food and casually nonchalantly picking up every single ingredient.",
                    "score": 45,
                    "replies": [
                        {
                            "author": "Capoe1ra",
                            "body": "He should pick up on how to keep his chin tucked.\n\nNice guy though and a great fighter.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "EveningNo8643",
                                    "body": "Never meddum",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Due-Contribution6424",
                            "body": "I know this.",
                            "score": -9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thotd2",
                    "body": "Serious? This sub has been 90% As-lickers for the past year and half or so",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ObiJuanKinobo",
                    "body": "This sub is honestly far better than r/ufc in terms of knowledge and I frequent both",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "juniorpapes",
            "body": "Joe Rogan being bias on the commentary the whole fight probably didn’t help",
            "score": 21,
            "replies": [
                {
                    "author": "kuntau",
                    "body": "The commentary team was paid by the UFC to push certain narrative and shouldn't be used as indicators how the fight is going",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Duinuogwuin14",
            "body": "You can land 100 leg kicks, but if it doesn't slow your opponent down and he continues to rock you every round, your 11 head shots don't win you the fight.",
            "score": 224,
            "replies": [
                {
                    "author": "Melissa9898",
                    "body": "Ankalaev was pressuring him the whole fight which worked pretty well to like crowd out the leg kicks from being too damaging, remember max vs gaethje being pretty similar in terms of a lot of leg kicks landing without the damage seeming to matter",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "CowsRetro",
                    "body": "Rocked every round?",
                    "score": 76,
                    "replies": [
                        {
                            "author": "Aliensinmypants",
                            "body": "I scored the fight for Ank, but his fans are making the fight more and more lopsided every time they talk about it. By the time he fights again they'll be calling it the most one sided beating since texeira/smith",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "Terrible_Matador",
                                    "body": "I also scored the fight for Ank. I felt the rounds he won were much clearer than the ones I felt Pereira won. Even so, it was very close.\n\nHalf of the media scored the fight for Pereira. It really wouldn’t have been that insane if he had gotten the decision.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "EveningNo8643",
                                            "body": "Ok now it would’ve been insane if Alex got the decision",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CowsRetro",
                                                    "body": "It really wouldn’t have.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EveningNo8643",
                                                            "body": "Yes it would have Ankalaev clearly won 3 rounds and arguably even rd 5 where the only argument for Alex was he landed one nice jab",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "CowsRetro",
                                                                    "body": "If it was so clear we wouldn’t be discussing it right now.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EveningNo8643",
                                                                            "body": "Just because people can’t score fights doesn’t mean it wasn’t a clear decision",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "CowsRetro",
                                                                                    "body": "Except it wasn’t cause half of the media gave it to Alex and other pro fighters have also given it to Alex. You can feel it was a clear match, and im glad you have your own opinion.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "EveningNo8643",
                                                                                            "body": "Pretty sure majority of pro fighters gave it to Ankalaev. Alex did nothing except non damaging kicks. Ankalaev outstruck and out clinched him basically the entire fight",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "CowsRetro",
                                                                                                    "body": "I’d disagree ive seen an equal amount of pro fighters give it both ways. Clinching is a two man tango 💀 Alex flipped him on the cage multiple times and even dumped him once.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "EveningNo8643",
                                                                                                            "body": "It’s a two man tango if the other guy does anything which he didn’t. And yeah he flipped him and it was end of the round so it was rightfully not really even scored\n\nAnd btw Alex landed fewer strikes than Carla did in her title fight. Sorry you can’t in any universe argue that he could’ve won",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "CowsRetro",
                                                                                                                    "body": "lol the dump happened before the bell 💀 the cope is insane",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "EveningNo8643",
                                                                                                                            "body": "I know it happened before the bell but go ahead and look up how much takedowns with no control time, no submission attempt, no advancing position and no ground and pound is scored. \nIt’s also telling you didn’t respond to any of my other points. \n\nAnd I’m not coping I predicted and wanted Alex to win. Sorry buddy, he lost, got dominated everywhere and shut down completely by a brilliant gameplan. Landing 11 strikes and a cool judo flip 1 sec before a round ends doesn’t win you a fight",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "CowsRetro",
                                                                                                                                    "body": "“Any of the other points” id respond to if they were at all relevant 💀 I don’t care about Carla we are talking about Alex v Ankalaev. \n\nAlso a dump isn’t a takedown, don’t talk to me about rules and scoring when you don’t even know that. Now he’s only scored 11 strikes, where do the lies end for Ankalaev fans.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "EveningNo8643",
                                                                                                                                            "body": "Again not an Ankalaev fan wanted Alex to win. \n\nIf Alex had more time and stayed on top guess what, it would’ve 100% been scored a takedown. You can call it a dump or a trip when it comes to scoring it’s scored as takedowns if he consolidates it\n\nYou can go ahead and look up the stats yourself 11 head strikes. The rest were leg or body kicks. Cry harder",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "CowsRetro",
                                                                                                                                                    "body": "So it wasn’t a takedown… got it. \n\nAhh ok so 11 head strikes, not just 11 strikes. News flash you can hit other parts of the body and still get scored 🤯🤯\n\nOnly person crying is you over not having all your points engaged with. I already told you you can have your own opinion, I really couldn’t give less of a fuck. They are gonna rematch anyways.",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "EveningNo8643",
                                                                                                                                                            "body": "Newsflash he got outstruck to the body too. You don’t want to engage with the points because you know you’re wrong. Hopefully next time Alex comes out to more than just leg kicks and an insignificant takedown at the end of the round.\n\nAnd you 100% give a fuck or you wouldn’t be coming back with brain dead responses",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "CowsRetro",
                                                                                                                                                                    "body": "I never claimed Alex outstruck Ankalaev. You tried to make it out like Alex only hit 11 shots which is just false, that was my point.\n\nYou say as I’ve engaged with all the relevant points you’ve brought up. It’s funny you cry about this when you continue to strawman me.",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "EveningNo8643",
                                                                                                                                                                            "body": "What do you call it when someone was standing and then they’re on the ground because of someone else? And don’t be pedantic",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "CowsRetro",
                                                                                                                                                                                    "body": "“Pedantic” when it could be a variety of things. You could’ve KOd someone, you could’ve dropped someone, you could’ve dumped them those are three examples of what someone standing over another because ‘someone’ put them there. \n\nAlso me responding to you doesn’t necessitate I care about your own personal opinion. I already told you many comments ago I’m glad you have your own opinion. But it’s just that. Your own. Doesn’t matter or affect mine. You are the one who kept on chirping after I told you we had a difference of opinion.",
                                                                                                                                                                                    "score": -1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "EveningNo8643",
                                                                                                                                                                                            "body": "That’s fine, some opinions are just based on something wrong and that’s ok 🙂\n\nAnd you know it wasn’t a knockdown or KO. Also the rules don’t state “dump” anywhere",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "CowsRetro",
                                                                                                                                                                                                    "body": "And you can feel that way. I certainly feel that way about you aswell 😊\n\nExactly the word dump isn’t in the rules, that’s a Thai move and isn’t considered a take down in the UFC 💀 thank you for continuing to prove the point.",
                                                                                                                                                                                                    "score": -1,
                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "CowsRetro",
                                    "body": "Doesn’t even stop at his fans, now Ankalaev coach is trying to accuse Alex of greasing even though in the same video he says Alex was sticky? Just makes no sense, Ankalaev won I don’t know why the guys on his side feel compelled to make shit up (not saying you are btw, speaking generally).",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "kevinhill92",
                                    "body": "What fans?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Aliensinmypants",
                                            "body": "There's a decent amount of people pushing for him because he's Dagestani and associated with them.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aceknighthigh",
                            "body": "A bit of an exaggeration but Ankalaev clearly landed the harder shots and certainly stumbled Pereira in 3 of the 5 rounds (and obviously rocked him in round 2).",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "CowsRetro",
                                    "body": "Obviously round 2 he was rocked but I don’t remember any other point he was rocked especially not at that level.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Reachin4ThoseGrapes",
                    "body": "Don't tell Rogan this",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "naughtboi",
                    "body": "Tell that to Usman Nurmagamedov",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lartbok",
                    "body": "Worst take here which explains why it has the most upvotes. It was a close fight and I score it to Ank because of the aggression in the close rounds.\n\nBut the reality is, in rounds 1,3,5 Ank only landed **1** more significant shot to the head than Alex (and 2 of those rounds Alex landed more significant shots in total). It was a very low volume fight in general. And if Alex got the nod it wouldn't have been robbery.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "Silver_Song3692",
                            "body": ">”Worst take here which explains why it has the most upvotes”\n\nHow counterculture of you",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Capoe1ra",
                                    "body": "Is he wrong though? \n\nThe comments made in this sub before the fight probably prove his point.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "After6Comes7and8",
            "body": "As a fight, Ank clearly won. Round by round it's tight. \n\nRD1: Close but leaning Pereira\n\nRD2: Clear Ank\n\nRD3: Too close for me to call\n\nRD4: Clear Ank\n\nRD5: Close leaning Pereira",
            "score": 57,
            "replies": [
                {
                    "author": "Funny_Debate_1805",
                    "body": "This is what people don’t understand. Sometimes somebody can barely win certain rounds but it’s very obvious they lost the fight. Whittaker Romero is a clear example.\n\nI personally scored 1,3, and 5 for Pereira but it’s clear as day he lost even though Ank didn’t have any 10-8s.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "After6Comes7and8",
                            "body": "Whittaker Romero 2 is almost the reverse of this fight, where it feels like Romero won the \"fight\" but definitely lost 3 of 5 rounds. That fight makes me wish we still had Pride scoring",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "NeitherAlexNorAlice",
                            "body": ">I personally scored 1,3, and 5 for Pereira but it’s clear as day he lost \n\nBro …??",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "0xyidiot",
                                    "body": "I think he is saying if you view the fight as a whole. Which I get isn't how it's scored but...\n\nIf you see it as\n\nRd 1 55 45 Pereira.\nRd2 30 70 Ank\nRd 3 55 45\nRd 4 25 75 Ank\nRd 5 45 55 Pereira.\n\nId it's scored like that you could say Ank won the whole \"fight\".\n\nThis isnt how I scored the fight. I thought Ank won 4 rounds personally.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kswan2012",
                            "body": "wait this doesnt make much sense... thats not how things are judged... if it goes to decisions its rounds.. its not looked at an overall thing. by your logic Alex won. They dont score the rounds then decide based on overall who they think won or lost. \n\nedit. i see everyone now saying the same thing",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "idcman999",
                            "body": "huh? that's not how you score fights then lmfao, it doesn't matter if they win their rounds more definitively if you outpoint them you win",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NickZardiashvili",
                    "body": "Phil McKenzie often makes a point on Heavy Hands that having close rounds simply always puts you in a better position to win, just statistically, if nothing else. Having two clear rounds and three toss-ups gives you very good odds in a title fight, all it takes if for you to take 33% of those toss-up rounds, whereas other party needs 100%.\n\nDC vs Gus all those years back is a good example. The first and fifth are clear DC rounds and one might make an argument for the middle three rounds going to Gus, but they were very close, all it takes is for one of them to be scored for DC and he's got in the bag.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "_Sagacious_",
                    "body": "> Too close for me to call\n\nWe call that a 10-10. Or at least we should, a lot more often.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IshiharasBitch",
            "body": "The thing about Ankalaev/Pereira is that there really were 3 close rounds that arguably could have gone to either fighter imo, based on my reading of the scoring criteria. OTOH the two clearest rounds both definitely go to Ankalaev. Even the 1st round, which every judge scored for Pereira, was very close (and I think the judges got that round right too).\n\nAll of this is to say that I think Ankalaev/Pereira is another example where scoring the fight as a whole would yield a much more obvious winner than the round-by-round 10-point must system.",
            "score": 88,
            "replies": [
                {
                    "author": "SquareService5808",
                    "body": "This fight is won and lost in rnd 3",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Bauiesox",
                            "body": "Yep 100%",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Any-Connection-1813",
                    "body": "Round by round 10 point system is very very bad and outdated",
                    "score": 34,
                    "replies": [
                        {
                            "author": "CableToBeam",
                            "body": "I disagree. I think adding more nuance to the scoring would just be worse considering how terrible judges currently are. We need to start with competent judges first.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Capoe1ra",
                            "body": "What scoring system would you propose?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Short_Bus_",
                                    "body": "easiest fix:\n\nscore a few more 10-10 rounds, but only when neither fighter really does anything impactful (like r1 in Alex/Ank would be a fine 10-10)\n\n10-9 is for close rounds where you think one fighter edged it (like r3 for ank or r5 for alex), but if someone told you they had it 9-10 you wouldn't call them insane \n\n10-8 is for rounds where there is a very clear winner that no reasonable person would dispute (like r2 or r4 for ank (r4 could be a 10-9 still, but r2 def 10-8)\n\n10-7s would still be rare and basically be the current 10-8 which is more or less \"damn if I was the ref I might have stopped it\", or \"damn these two should not have been put in the same octogon\"",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Due-Contribution6424",
                                    "body": "Whole fight? PRIDE certainly made it work.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Capoe1ra",
                                            "body": "Doesn't work well with fights that are competitive throughout, especially over 3 rds.\n\nThe 10 point system would work a lot better If judges weren't incompetent or corrupt.\n\nUnfortunately though, they are and changing the system won't change anything about that imo.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Due-Contribution6424",
                                                    "body": "I was just answering your question. If I had to choose, I enjoy the 10 point must but I think extremely close rounds should be scored a 10-10, leading to draws.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Capoe1ra",
                                                            "body": "I agree. \n\nObviously draws aren't great with the current pay model, but that should've been changed up a long time ago anyway. \n\nAs long as judges don't have to answer for their scorecards, nothing will change for the better though.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Due-Contribution6424",
                                                                    "body": "Not good financially for the company, I agree. Realistically, for fighters, it could have changed entire careers for some of them.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Capoe1ra",
                                                                            "body": "I was talking about no one getting their win money in draws, but yes.\n\nI definitely would put \"the integrity of the sport\" above the interests of the company, but I'm not sure myself what a increase in draws would do for the viewership.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Due-Contribution6424",
                                                                                    "body": "I don’t care about the viewership, honestly. A end of fight Draw should be 1/2 win bonus each between the fighters. I’m not saying they should score them every close fight, but the fact they’re basically not allowed to score 10-10 rounds is kind of silly. It’s a very common occurrence that there are even rounds and instead it goes to a coin flip.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Capoe1ra",
                                                                                            "body": "\n\n>I don’t care about the viewership\n\nDon't get me wrong, neither do I; but at the end of the day I want the UFC, and, by extension, the sport to do well. \n\nMight sound stupid to equate those, but I feel like at least at the moment, the stability of the sport is connected to the financial success of the UFC. \n\n>Draw should be 1/2 win bonus\n\nThat's a pretty good idea, but I'm sure the UFC would jump at the chance of only having to pay show money in draws. \n\nCompletely agree with everything you said.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Due-Contribution6424",
                                                                                                    "body": "I remember thinking that 10 years ago, and 20 years ago… I think the UFC is entrenched enough at this point where they’re not going anywhere. More money would definitely bring in way better talent at HW and LHW, but the sport is not going to go away at this juncture. Lighter weight classes, specifically, this is the best option already for some guys.\n\nOtherwise, I think we agree.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Any-Connection-1813",
                                    "body": "There's been a few goos suggestions I've seen on this forum over the years i cant remember exactly what they were. One is to score the fight as a whole not by round. Not all 10-9 rounds are the same. If the fighter did more damage but got outpointed or controlled without any damage or submissions he should win 9/10 times, right now that's not the case",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "idcman999",
                            "body": "it'd be much better if they utilised ALL numbers from 1-10, you've never seen a 10-6 before, and you've only seen 10-7's like, maybe four times in history",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EveningNo8643",
                            "body": "Even without looking at the fight as whole Ankalaev wins. By an even wider margin",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Any-Connection-1813",
                                    "body": "You're right. This approach is more for a bunch of other fights where fighters were robbed.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ElectricalTune4145",
                    "body": "Very fair take",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ok_Phase_5183",
                    "body": "They should copy One fc's scoring system",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "NickZardiashvili",
                    "body": "That's true, there are three close rounds in that fight, but scoring all 3 for Pereira is a statistical stretch. Can be done, but the odds are very low. I wouldn't wanna be in Pereira's corner and tell him, \"as long as we win three coin tosses in a row, we've got this in the bag.\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "liberate71",
                    "body": "Finally an actual based take. I could see either fighter winning it, but I was less surprised it was Ank than I would have been if it was Poatan, due to the rounds Ank secured rather than the closeness of the other 3.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SergDerpz",
                    "body": "You can't say it was close or you're a casual!!!\n\nSome of the Pereira hate on this sub lol. \n\nI think 3-2 either way works. I honestly felt like Pereira edged it 3-2, but Ank winning 4-1 didn't feel right to me.\n\nJust my opinion. Like you said some rounds were really really close, I haven't rewatched the fight yet but it didn't feel like Ank beat him in a way we all think alright he won 100% (Garbrandt vs Cruz style?)",
                    "score": -19,
                    "replies": [
                        {
                            "author": "WabbiTEater0453",
                            "body": "Yah no. You’re refusing to factor in Octagon Control which Alex had absolutey zero of. ",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "NickAssassins",
                                    "body": "I scored 3-2 Ankalaev, but octagon control is irrelevant, unless the round is even on effective striking, grappling, then we go to aggression and then octagon control.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "WabbiTEater0453",
                                            "body": "No, it isn’t. Judges do not have AI stats to pick from. So it really is relevant. \n\nThe rounds were extremely close and Octagon Control was most certainly a factor. ",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "slutwhipper",
                                                    "body": "Octagon control is literally not scored unless the other criteria are even. AI stats? What are you yapping about? Point is you can be backing up the whole round and win.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SergDerpz",
                                    "body": "I was scoring it round by round myself as I watched the fight.\n\nI can't remember each round with detail though. That's just my opinion. \n\nA rewatch may give me a different result, but I still won't see an Ank 4-1. Maybe a clearer 3-2 for him.",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "WabbiTEater0453",
                                            "body": "Not a single round did Alex control the octagon. You cannot give up octagon control in a fight that close. It’s why Shogun beat Machida the first time",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "malk500",
                                                    "body": "Scoring rules have changed since Machida was around. Octagon control only factors in if the round can't be decided on higher priorities like effective striking and grappling.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "WabbiTEater0453",
                                                            "body": "Yah, which exactly happened in the Ank vs Alex fight. \n\n\nDid I not say you cannot give up Octagon Control in a fight that close? ",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "malk500",
                                                                    "body": "I didn't realise you meant that the rounds 100% *couldn't* be decided based on striking and grappling.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Any-Connection-1813",
                            "body": "The right fighter won so that's all that matters",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hukkit",
            "body": "Commentary doesn't help. Instead of calling the fight objectively, Rogan and DC are dickriding Pereira for being \"scary\" while Anik is calling out blocked 3 punch combos like they are clean shots.",
            "score": 17,
            "replies": []
        },
        {
            "author": "lartbok",
            "body": "The fight was definitely close on the score cards. It's one of those ones where you can tell who won the fight overall but when it comes down to scoring there were some rounds that Alex could have edged.",
            "score": 8,
            "replies": [
                {
                    "author": "BogotaLineman",
                    "body": "100% agree and I hate how people in this sub pick and choose when winning the fight matters and winning the rounds matters basically depending on how much they like the fighter (see Max vs Volk II and Wonderboy vs Till)\n\nAlex MAAAAYBE won 3 rounds. I didn't see it that way but it's not crazy, but Ank 100% won the FIGHT",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BugO_OEyes",
            "body": "Yall act like ank destroyed Alex\n\nIt was a close fight",
            "score": 33,
            "replies": [
                {
                    "author": "EveningNo8643",
                    "body": "I mean he basically shut him down. He didn’t destroy him any round even rd 2 isn’t even close to 10-8. But Alex was frustrated and had nothing for him the entire fight",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cole3003",
                    "body": "Yeah, 95% of the fight was low risk low damage shots, cage humping, or failed takedown attempts. Ank looked better for much of it because he had a lot of the forward pressure, but neither of them looked like they wanted to engage.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "TerminatorReborn",
                            "body": "Well Ank was cautious because Alex is one of the most powerful punches in the whole UFC, and Alex was too because Ankalaev is a good grappler and he isn't. Whats funny is that Big Ank said the plan was to sit back and counter, but Alex wasn't pushing foward then Ank started setting up the pace of the fight.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pzzadudsgt30scds",
            "body": "Quite a few media members scored it for Pereira. Makes me question their credentials...",
            "score": 36,
            "replies": [
                {
                    "author": "anyonerememberdigg",
                    "body": "I agree that Ank clearly won but can we stop pretending fighters are any better arbiters of MMA information than media members? Didn't like 12 big name fighters pick Pereria to beat Ank? It shows they're not immune to biases or oversights either.\n\nEDIT: The video I was referring to https://www.youtube.com/shorts/9YpxSmg-mN0",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Soltaengboi",
                    "body": "Most scored it for Ank, including judges that didn’t work that night",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "John_EldenRing51",
                    "body": "Why is everyone so militant about “if they disagree with me they don’t understand anything?” It’s not that deep, it’s okay to say you just seen it different ways.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Terrible_Matador",
                            "body": "Absolutely true BUT one guy scored it a draw which *is* actually insane.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Cole3003",
                                    "body": "Not if one of the rounds was scored as a 10-10.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Terrible_Matador",
                                            "body": "If he had scored one round a 10-10 it would have been a 48-48 draw but he scored it a 47-47. Meaning one round was a 10-8.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Cole3003",
                                                    "body": "I take it back, that’s insane 💀",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EveningNo8643",
                                            "body": "Has there ever been more then like one or two fights that have been a 10-10 officially scored",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Garfalo",
                    "body": "Decisionbot Pereira Ankalaev\n\nYeah, I'm surprised that many gave it to Poatan.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DecisionBot",
                            "body": "[**MAGOMED ANKALAEV defeats ALEX PEREIRA** (*unanimous decision*)](http://mmadecisions.com/decision/15283/fight)\n\n^(UFC 313: Pereira vs. Ankalaev — March 08, 2025)\n\nROUND|Ankalaev|Pereira||Ankalaev|Pereira||Ankalaev|Pereira\n:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:|:-:\n1|9|10||9|10||9|10\n2|10|9||10|9||10|9\n3|10|9||10|9||10|9\n4|10|9||10|9||10|9\n5|9|10||9|10||10|9\n**TOTAL**|**48**|**47**||**48**|**47**||**49**|**46**\n\n*^(Judges, in order: Michael Bell, Derek Cleary, Sal D'Amato.)*\n*^(Summoned by Garfalo.)*\n\n**MEDIA MEMBER SCORES**\n\n- **11/21** people scored it **48-47 Ankalaev**.\n- **1/21** people scored it **47-47 DRAW**.\n- **9/21** people scored it **47-48 Pereira**.\n\nAvg. media score: **47.5-47.4 DRAW** (*high certainty^[[1]](https://redd.it/9p4xc7)*).",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "commander_wong",
                    "body": "Honestly I think the media scorers just go by what the commentary says instead of judging the fight for themselves. \n\nOff the top of my head Ige vs Bryce and Gamrot vs Turner are examples of such. I feel both fights would be easy to score if you turned the volume off, but because the commentary were biased towards one guy the media scorers end up giving it to them",
                    "score": -7,
                    "replies": [
                        {
                            "author": "ShitSlits86",
                            "body": "They're also 100% influenced in their opinions by the gambling odds.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Heebmeister",
                            "body": "Aren't the media members who score it there in person? If so, they ain't hearing the broadcast",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "TheGreekSandwich",
                                    "body": "Indeed, most of them are. This guy must think they score it then drive to the venue to do post fight press conferences.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "commander_wong",
                                    "body": "Maybe I'm wrong but I doubt the UFC would give free travel fees and tickets to 12-25 guys every event\n\nNot to mention there's a few scorers that are also pro wrestling writers and probably couldn't be in person like that even if they were offered to be",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Heebmeister",
                                            "body": "The media orgs, or the members themselves if they are self employed, pay their own way, just like any other sport.  It's a business expense.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "RobinHood1Star",
                                            "body": "Travel fees no but afaik tickets are comped for credentialed media members as they sit in the media area. \n\nHad a friend who did photography for mmajunkie and her entry was always just show your media badge at media entrance and you’re good.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Blue-Summers",
                                            "body": "For the media that does travel with the UFC, I'm pretty sure that whatever publication/website/blog spam they work for pays for their travel. It's an expense that they make for having \"boots on the ground.\"\n\nI'm sure the UFC does foot the bill for influencers like Nina Drama and the like, however.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YourAnBitxh",
            "body": "well the fight is round based scoring not overall fight. You can say Ankalaev won the fight if it was based on pure 25 mins. But clearly everyone thought Pereira won 1 & 5 and Ankalaev won 2 & 4, round 3 is the one where you can make your own argument for who you wanted to win. I wouldn't say fans are uneducated if they scored it for Pereira cuz the argument is there, idk how Ankalaev got a 4-1 score card tho",
            "score": 13,
            "replies": [
                {
                    "author": "interia1099",
                    "body": "Ankalaev got a 4-1 because round 5 wasnt „clearly“ Pereiras Round. Alex partially landed a Head Kick that made Ankalaev Take a step back and a Good jab while Ankalaev entered, Rest of the round played out like the 3 rounds before, with Ankalaev putting on the pressure, outstriking a retreating Pereira and getting Control time in to end the round. Not the worst scorecard in the world",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Cole3003",
                            "body": "But fights are scored on damage, not control time. Control time (under dominance in the rules) isn’t even supposed to be considered unless effective striking/grappling is the same.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "sluggerrr",
                                    "body": "I dunno why you got downvoted, you're just stating what the rules say iirc",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "EveningNo8643",
                                    "body": "And he didn’t out damage Ankalaev either",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "interia1099",
                                    "body": "Fights are Scored on impact not damage and what impact did the 2 good connections from AP have when Ankalaev just ate them and continued to put on the pressure while outstriking him? Don’t act like I said Anakalev won due to Control time, the Control time at the end of the Round just adds to the visuals",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Melissa9898",
                            "body": "Yeah I think it’s easier to find 4 for Ank than 3 for Alex",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "EveningNo8643",
                                    "body": "Best way to put it in my opinion",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EveningNo8643",
                    "body": "Alex didn’t clearly win rd 5",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Matatan_Tactical",
            "body": "He was frozen like Elsa",
            "score": 5,
            "replies": []
        },
        {
            "author": "MEROVlNGlAN",
            "body": "I felt like Ank won but I also anticipated Pereria having done enough to sway the judges. I was shocked the judges got it right for once.",
            "score": 4,
            "replies": []
        },
        {
            "author": "mrpopenfresh",
            "body": "The actual fighting part of the fight is completely lost on the fans and irrelevant to the UFC experience. All that matters is the beef and highlight reels.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pnut_brian",
            "body": "it actually is wild how stupid the average ufc fan is",
            "score": 2,
            "replies": []
        },
        {
            "author": "Grand_Entertainer_83",
            "body": "Love aspinall, but this was a close fight. Alot of MMA fighters tend to consider a fight “domination” when a guy dominates 2 rounds and then 3 are close- and he wins 1/2 of the 3 close ones. All you need to do is win 3/5 rounds. Fact is that 1,3,5 were close. that makes this a close fight, regardless of 2 rounds being dominant. This isnt basketball where the outcome of the first quarter determines the start of the second quarter. in a fight every round is scored individually.",
            "score": 4,
            "replies": [
                {
                    "author": "daquist",
                    "body": "Yeah I dunno what he's saying with this one lol. He was very very particular about explaining that the outside foot position is like some super high level tactic when talking about the Jamahal vs Alex fight when that's one of the more basic striking fundamentals when it's an orthodox vs southpaw matchup too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "chigychigybowbow",
            "body": "I like Pereira but man he was asleep in that fight, Ank was on the front pedal and landed more strikes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "UsedSalt",
            "body": "I can see giving him Rd 3 if you don’t assign any value to wall and stall. Wouldn’t be the biggest crime to give him 1 3 and 5",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bauiesox",
            "body": "Uneducated fans? The fight was really close… Alex clearly won 1 and 5. Ank clearly won 2 and 4, it all came down to the 3rd round. I personally scored the 3rd for Alex. 49-46 is the truely uneducated score.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prize-Childhood3631",
            "body": "Of course, I scored it for Pereira. He was a part of my parlay.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remote_Beyond744",
            "body": "I was hoping for crooked judging lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "coffeefordessert",
            "body": "Nah just too many die hard fans, biases. I would get laughed when I said ank had a good chance. However I will say I’m surprised he won mostly striking, when I said ank had a good chance prior to the fight, my bet was wrestling. He did use it to win time though, even if Alex did a good job stopping them",
            "score": 1,
            "replies": []
        },
        {
            "author": "PutinBiggestFan",
            "body": "Ankalaev wins easily. How are you can possibly score that for poatan? ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lars6",
            "body": "Facts from Tom, Ank clearly won",
            "score": 1,
            "replies": []
        },
        {
            "author": "hanselpremium",
            "body": "this only tells me tom doesn’t visit mma subs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rayn0r86",
            "body": "Damn it, Tom! Now the Poatan fans are going to flock over Jon’s nutsack. Stop speaking facts sir.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fajitaman69",
            "body": "This is just indicative of the garbled and inconsistent judging that have produced \"robberies\" time and time again. It's impossible to know what the judges are really looking at on any given night. Many fighters have expressed a similar sentiment.\n\nIt's really not surprising there is controversy in any \"close\" fight, especially when wrestling or control time play a factor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SlamKrank",
            "body": "I think Ank won, but im still surprised any time a champ loses by decision when people argue its close-ish. Ive seen plenty of real questionable decisions in championship fights and it always seems to go champs way",
            "score": 1,
            "replies": []
        },
        {
            "author": "RequirementCurrent21",
            "body": "yeah they also vote too",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaTunaTime",
            "body": "https://mmadecisions.com/decision/15283/Magomed-Ankalaev-vs-Alex-Pereira",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrtn17",
            "body": "Problem is, the 'uneducated fans' don't know the meaning of that word so they agree",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due-Contribution6424",
            "body": "I scored it a Draw with the current system. If judged as a whole fight, Ank clearly won.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cptn__",
            "body": "Ank did this to himself when he decided to hold Pereira up against the fence for 3 minutes, then got reset by the ref, just to immediately put Pereira back up against the fence for the remainder of the round. People pay to see a FIGHT, not this bullshit. If he was so confident in his striking why wasn't his instinct to up the pressure and attempt to get a KO? Or put him on the ground and gnp him? Why do they always choose to stall entire rounds to chase a decision win, then go on to act oblivious why fans are critiquing them",
            "score": -7,
            "replies": [
                {
                    "author": "Melissa9898",
                    "body": "Didn’t get him down cause Ank doesn’t actually have good takedowns it’s just light heavyweight so most other fighters are even worse.\n\nI’m no fan of cage stalling but this isn’t even a particularly egregious example, it was just that one round, Ank was outstriking him most of the fight. \n\nI’d blame Pereira largely for this being boring, he was content to get pressured the whole fight and that along with Ank’s counterstriking and hand fighting shut down most of Pereira’s offense and he didn’t adapt to that or go for broke and exchange going for the knockout with his greater power despite Ank’s counter striking",
                    "score": 8,
                    "replies": [
                        {
                            "author": "GravelPepper",
                            "body": "Exactly, your last paragraph nails it. Alex got stung in round 2 bad and didn’t want to get KOd. We can acknowledge this without hating on either fighter. \n\nCan’t say I blame Alex, it’s not fun going for broke and getting KOd either, but being safe also cost him the win. Easy to criticize someone else after the fact",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UsedSalt",
                    "body": "Yeah I hate to see a close 5 rounder including a wall and stall round. Same with body triangle back control. As soon as you see the guy go there you just know what’s going on, and if it’s a close fight it takes a lot of excitement out of it. “Oh it was 2-2 going into the 5th, now one guy is wall and stalling the last round so he wins”\n\nVolk Islam 1 without the backpack round is much more interesting ",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "JokerzWild937",
                    "body": "Ank is boring and didnt deserve to win that fight. I'm glad to see other people feel that way too. Nothing worse than seeing a guy just held against the fence all round except getting laid in with no attempt to progess forward with damage",
                    "score": -11,
                    "replies": [
                        {
                            "author": "SergDerpz",
                            "body": "Not only that but then claiming Alex is boring.\n\nAlex has had nothing but entertaining fights and it definitely takes two to tango. \n\nAnk seemed sharper than Alex that is for sure, but it's not like he was actually trying to get a finish.\n\nAlex looked slow though and I'm not sure if that's father time catching up to him (he didnt look super fast against Rountree either until Rountree was completely exhausted) or it was just him focusing too much on takedowns + Ank being a great striker.\n\nI hope they have an instant rematch and we can get a clearer result.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "JokerzWild937",
                                    "body": "I do hope for an instant rematch. If Ank beats him again he might change my opinion but it's a lot of lengthy looping left hooks into grappling against the cage. I just hope Alex is aggressive and if not him Jiri would be a exciting match.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "samoyed_white",
            "body": "48 - 47 Pereira and 50 - 45 Ankalaev are both defensible scorecards. It’s the uneducated fans who will refuse to acknowledge that.",
            "score": -6,
            "replies": [
                {
                    "author": "Bauiesox",
                    "body": "That’s a wild take to make… you’re who he’s talking about..",
                    "score": 5,
                    "replies": [
                        {
                            "author": "samoyed_white",
                            "body": "Giving Ank all 5 rounds only requires that the judge over values head strikes a little bit, which is defensible compared to the bad scores we see at every single event. 48 - 47 Pereira requires that you value body and leg kicks a little more than average. They are both fair scores.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bauiesox",
                                    "body": "No. Giving all 5 to Ank is not a fair score. You are the only person I have even seen who thinks it’s a potential outcome.. even the wild judge gave Alex one round.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "samoyed_white",
                                            "body": "Pereira definitely didn’t have 2 clear rounds.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Bauiesox",
                                                    "body": "I disagree. I think he clearly had 1-5. Ank clearly had 2-4, the only debatable round was 3.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrummondGreen",
            "body": "The fight wasn’t close clearly Pereira was outmatched but round by round based some rounds favored him & just because someone can make an argument for a certain round to have it 3-2 doesn’t make them stupid for having a difference of opinion or not wanting to score if you just waste time and call it ‘ control ‘",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mistercorey1976",
            "body": "When he says uneducated. He means all the people who think he can beat Jon Jones.",
            "score": -5,
            "replies": [
                {
                    "author": "PermYoWeaveTina",
                    "body": "the salt lol",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Barrytroubletown",
            "body": "Honestly sounds like a guy who doesn't understand how the scoring system works.\n\nNot saying Ankalaev shouldn't have won or anything, but it was close\n\nEdit: Got love r/mma being stupid per usual",
            "score": -14,
            "replies": [
                {
                    "author": "commander_wong",
                    "body": "It really wasn't at all\n\nThe only round you can give Alex without question is R1. R3 is a coin flip, and R2,4 & 5 were all clearly Ankalaev's. If you score this objectively and unbiasedly there's no avenue for Alex to win",
                    "score": 6,
                    "replies": [
                        {
                            "author": "bleed958",
                            "body": "In no world was Round 5 clearly Ankalaev",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "commander_wong",
                                    "body": "Strikes for Alex R5 - One good jab, two blocked headkicks, a few leg kicks\n\nStrikes for Ank R5 - 5 crosses to the head, two big knees to the body, about as much leg kicks\n\nIt's really not close. Even without the clinch at the end Ank comfortably wins this",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leon_alistair",
                    "body": "Its 4-1 or 3-2 Ankalaev if u want to be generous but its pretty clear win. 3-2 might suggest its close but its not. Alex barely land anything other than leg kick and hes getting pushed back all night. \n\nTom literally compete in this rule and u suggest he dont understand the rule? Damage and control time plus ring mastery were Ankalaev all night. It wasnt close at all.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "CowsRetro",
                            "body": "Tom literally admitted in his initial reaction to the card that he doesn’t know the scoring criteria. He’s a fighter, not a judge.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theyoloGod",
            "body": "Is that really shocking or a surprise? People will have different opinions/thoughts on decisions until the end of time",
            "score": 0,
            "replies": []
        },
        {
            "author": "steakjuice",
            "body": "We watch men deliver and receive brain injuries for our enjoyment. Is it really so wild?",
            "score": -1,
            "replies": []
        },
        {
            "author": "doubledoubletwotimes",
            "body": "Same kind of people think Tom has a chance against jones lol",
            "score": -1,
            "replies": []
        },
        {
            "author": "Pretend_Pension_8585",
            "body": "I guess we know what Tom's gameplan is against Jones",
            "score": -2,
            "replies": []
        }
    ]
}