{
    "title": "Dricus Du Plessis says Alex Pereira 'aura gone,' rules out future fight",
    "author": "MasterRoshy",
    "subreddit": "MMA",
    "rank": 3,
    "score": 338,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 227,
    "url": "https://ca.sports.yahoo.com/news/dricus-du-plessis-says-alex-184033475.html",
    "id": "1jedars",
    "selftext": "",
    "comments": [
        {
            "author": "Brybry1908",
            "body": "That fight wasn’t gonna happen anyways.",
            "score": 293,
            "replies": [
                {
                    "author": "TrueMMachess",
                    "body": "Chama would have chamad his pants harder than he did against ank. Diaper style chama!",
                    "score": -33,
                    "replies": []
                }
            ]
        },
        {
            "author": "noahpoah",
            "body": "Counterpoint: Chama.",
            "score": 351,
            "replies": [
                {
                    "author": "Tricky-Platform-9173",
                    "body": "NO CHAMA 👺",
                    "score": 59,
                    "replies": [
                        {
                            "author": "sAmMySpEkToR",
                            "body": "BUT, but…and bear with me here.\n\nHave you considered…Chama?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Tricky-Platform-9173",
                                    "body": "ANKALAEV TIME 👹",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TrueMMachess",
                    "body": "Chama chamad his pants. Diaper style",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Wumbology-Doctor",
                            "body": "It wasn’t funny under this comment or the other comment you made this joke under",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TickleMyFungus",
                                    "body": "Weird seeing YouTube bot behavior here. Must be a bug in the script.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Wumbology-Doctor",
                                            "body": "Assuming he’s the bot. Yeah man it’s weird as fuck lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TrueMMachess",
                                    "body": "Everyone is using chama to mean poop now. it's hilarious. ank started it",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Wumbology-Doctor",
                                            "body": "Humor is subjective I suppose",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "christopherpaulfries",
            "body": "So let me get this right: Poatan’s aura didn’t suffer after getting knocked out cold by Izzy, but it’s gone now after getting decisioned by Ankalaev at light heavyweight?",
            "score": 385,
            "replies": [
                {
                    "author": "joethecrow23",
                    "body": "Izzy is one of the best UFC fighters ever, and Poatan was doing fine in that fight until he got gadooshed\n\nIzzy got him, happens to a lot of people \n\nThe Ankalaev fight he just didn’t look good",
                    "score": 303,
                    "replies": [
                        {
                            "author": "Fakename6968",
                            "body": "Ankalaev is 12-1-1-1 in the UFC. That also makes him one of the best UFC fighters ever. He is not some can. Very few UFC fighters have ever had a string of wins that good.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "joethecrow23",
                                    "body": "There are 6 men who have won more UFC title fights than Israel Adesanya. \n\nAnd it was a very competitive fight, Alex lost but he looked very good and dangerous in doing so.\n\nAlex did not look good at all against Ankalaev, and he’s now very old. This is why the aura is gone.\n\nYou know this, but you’re just being obtuse for the sake of being annoying.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Fakename6968",
                                            "body": "You are overestimating Izzy and underestimating Ank. You don't know this, you aren't being obtuse just for the sake of being annoying.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "bluesshark",
                                            "body": "I don't think they're being obtuse, or trying to be annoying. You're right about the optics of the fight not being good for Alex, but Izzy is a kickboxer who can dance with him. It's very different when you're being shut down by skills that you don't have the means or experience to deal with. \n\nThey were just pointing out that you weren't giving credit to Ank for being a very good fighter/wrestler, which is always gonna make someone like Alex look way shittier than normal",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BetBig696969",
                                    "body": "He’s not a can but not one of the best ever. Craig subbed him and he struggled with Jan.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tomach82",
                            "body": "And Volk was doing fine until he got gadooshed by Ilia",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BoxingProvesNothing",
                                    "body": "For a whole 1 round running backwards with chin up? He didn’t look fine in there lol ",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "author": "defzx",
                                            "body": "You mean the round all 3 judges scored for Volk",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Silver_Song3692",
                                                    "body": "Anytime I bring up scorecards people say shit like “Oh so you think judges have valid takes on a fight”, shit’s weird",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "SuckOnDeezNOOTZ",
                                                            "body": "Ah yes all the famously correct decisions that Adelaide Byrd has made over the years... \n\n\n\nNo she absolutely understands the sport better than the regular enthusiast level fan.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Silver_Song3692",
                                                                    "body": "I’d say she does when the regular enthusiasts can never decide on what they actually think should be scored and what shouldn’t be. Control time means nothing if you’re not demolishing your opponent, if it’s a close fight then the guy who looks the most beat up should be the loser even though fights are scored by round, Merab shouldn’t be champ because of how often he has someone against the cage but for some reason it’s his fault that his opponents still don’t know how to stop that when spamming takedowns is 90% of what he’s known for, I could go on and on",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "defzx",
                                                            "body": "Judges are flawed but he definitely won the first and wasn't looking as terrible as the guy I responded to would have people believe.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "BoxingProvesNothing",
                                                                    "body": "He looked shaky as hell in there just trying to edge a round out and was never gonna work for 3 or 5 rounds. You could see he was gonna get caught whole time ",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Short_Bus_",
                                                                            "body": "yup\n\n100%",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BoxingProvesNothing",
                                                                                    "body": "Volk was fighting to win a decision like he does tend to do. Ilia was fighting to KO him and you have to set shots up. Volk didn’t look comfortable and he didn’t sit down on any punches. There was no spite behind anything really, cause he felt something in there coming for him ",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Realistic-Lie-1507",
                                                                                            "body": "Well, you're wrong actually. The reason Volk got KO'ed that night was because he tried to plant his feet and counter Ilia when Volk was backed up to the fence\n\nEdit: To clarify, i agree with your assesment of it was clear from the beginning Volk was gonna get caught, however in my mind it was because u could see Ilia getting closer and closer, not Volk being shaky",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Short_Bus_",
                                                                                            "body": "he looked soooo uncomfortable/timid \n\nmax did *much* better before getting knocked out even tho he was down 2-0, 2-0, 1-1",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "defzx",
                                                                            "body": "I just rewatched it and we must have different definitions of 'shaky as hell'. Volk starts off R1 looking for angles, feints and using ranged kicks to feel out ilia, ilia patient as hell starts to catch Volk during the mid half of the round before Volk starts working kicks again and gets a nice clinch.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Urbasebelong2meh",
                                                    "body": "tbf there's complexity to these things. it was def a dominant round for volk as far as scoring points but watching it back, you can absolutely see how Ilia was setting up the knockout shot. that doesn't necessarily win him the round, but it is kind of a testament both to ilias skill and patience + volks defensive negligence there, esp when you compare his movement to other fights",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ItsMichaelScott25",
                                                    "body": "Volk definitely won the first round but OP does bring up a good point. Volk won on points but Ilia looked very calm and composed in there and Volk was backing straight up with his chin up. He wasn't circling out at all while Ilia was doing a good job stalking him.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BoxingProvesNothing",
                                                    "body": "I don’t care about judges he barely winnning a round. Ilia was setting him up to win the actual fight. Nowdays these fans talking about who won 50-50 boring rounds like it means anything. Ian Garry talking about 1 takedown from winning a decision cause he can’t finish nobody. Ilia was setting up the exact finishing shot whole time and pressured him slowly into it ",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "misterKicanovic",
                                                    "body": "Because he was running and scoring points with his weak ass kicks",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "West_Technology7573",
                                            "body": "You mean that thing that Volk has done his entire UFC career?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "BoxingProvesNothing",
                                                    "body": "Well you can do that vs Max who ain’t a puncher at all. Can’t do that vs a real puncher. Styles ting",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "West_Technology7573",
                                                            "body": "So you’re implying that Ilia took advantage of something that Volk has always been “fine” doing lol",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "abetsg",
                                    "body": "No sir",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "leon_alistair",
                                    "body": "And lots of ppl call him washed now so what's the difference? 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Murmido",
                    "body": "I mean since then Alex has finished Jiri x2, Hill, and Roundtree. \n\nAnd it wasn’t like Izzy walked him down, it was just an excellent counter.",
                    "score": 110,
                    "replies": [
                        {
                            "author": "CableToBeam",
                            "body": "There still was the first fight with Izzy in the UFC which Izzy was dominating and the Jan fight which was close. I don’t think it makes sense still",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "BigCass",
                                    "body": "> first fight with Izzy in the UFC which Izzy was dominating\n\nThat only happened in your head",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "Panvich",
                                            "body": "He was literally going to win a\ndecision and almost KO’d Alex in the 1st round. Dominating might be a strong word considering how round 5 went but Izzy was handily winning the fight.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fightbackcbd",
                    "body": "yes. because in one he \"went out on his shield\" in a war and in the other he looked \"gun shy\" and backed up the entire time.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "BoxingProvesNothing",
                            "body": "All kickboxers gotta fight same way cause scared to death to be in their back. It’s why I’ve never fought them to be most entertaining. They can’t fight freely in there. Alex is entertaining though but it’s cause who he was fighting. I said the second he got a wrestler or all rounder in there there he’ll do what every kickboxer does. They can train ground 24 7, they don’t got it in a real live fight ",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "EmanAugust",
                                    "body": "Shit reads like it's from 2007 lmfao",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jfsoaig345",
                    "body": "Pereira was slowly taking over that fight, chopping down that leg and starting to find his timing on Izzy, and just got caught by an insane counter from Izzy. So this was more of an aura gained moment from Izzy than aura loss from Poatan.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "ksubijeans",
                            "body": "How do you get caught by a counter lmao why do yall always attribute luck to that finish",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "MomboDM",
                                    "body": "...what? Getting caught by something in no way implies that its luck, the fuck are you talking about.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "ksubijeans",
                                            "body": "My bad, I must have misunderstood that",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jfsoaig345",
                                    "body": "It's not luck, just a beautifully placed shot that probably doesn't get replicated in 9 out of 10 rematches. There are just certain finishes that revolve more around how well the winner did rather than how poorly the loser did. Similarly, I don't think Usman suffered any aura loss after the Leon KO.\n\nAnd for the record I am a huge Izzy fan and lost my voice screaming that night after the finish lol",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "1104L",
                                            "body": "He’s hurt him bad in 3/4 fights lol. Alex got a standing count in their second kickboxing fight, was saved by the bell in their first mma fight, and knocked out in the second mma fight.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "femio",
                                            "body": "Izzy rocked Poatan in very similar fashion in their first MMA fight, not sure why you think it doesn’t get replicated 9 times out of 10",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Tankshock",
                                    "body": "Luck isn't the right word, but the truth is he got overconfident, started pushing for a finish, and fell for a really nicely set up trap by Izzy. It was a testament to Izzy's skills, creativity, and craftiness, not an indictment of Alex's skills.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Wagagastiz",
                    "body": "The worst thing you can be isn't a loser, the worst you can be is boring.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Recoil93",
                    "body": "Different because Pereira was 3-0 against Izzy.\n\nBig Ank loss is different because he was already borderline ducking, and when he finally got to fighting him he looked nervous and gun shy. Then pretended that Ank was the one who didn’t want to fight. \n\nI think he’ll bounce back but for now it’s not a great look",
                    "score": 30,
                    "replies": [
                        {
                            "author": "ironhide999x",
                            "body": "When was Pereira ducking? Pereira just took whatever the UFC gave him",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Recoil93",
                                    "body": "I do think it’s a little sus that he fought Rountree at 307 because Ank “wasn’t ready in time,” just for Ank to fight like three weeks later than him on 308. I feel like Alex could’ve sat an additional few weeks for a much bigger fight if he really wanted to. I don’t think Alex would ever truly duck anyone and refuse to fight, but I just don’t think he was excited for Ank and would avoid it for as long as he reasonably could",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "CowsRetro",
                                            "body": "Ankalaev was already booked when Alex v Rountree was announced. It wasn’t about Ankalaev not being ready or not",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Smooth-Abrocoma-2825",
                                                    "body": "Surely they could have just booked Ankalaev, the actual number one contender, against Pereira at either date? Instead of, y'know, blatantly giving Pereira an undeserving contender?\n\nThere's no fucking defending it dude, at least do the usual cope of arguing that Pereira had nothing to do with lmao",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CowsRetro",
                                                            "body": "I don’t think I ever defended it because I would agree with you, it was clear what the UFC was trying to do. But putting that on Alex who has zero say on who he fights is unfair. He was calling out Ankalaev and said yes to fighting him in the past, call it cope if you’d like. You are free to do as you please",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Real-Human-Bean-",
                                                                    "body": "https://x.com/Home_of_Fight/status/1869541298371444936",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Smooth-Abrocoma-2825",
                                                                    "body": "He was calling out Ankalaev but just so happened to not fight him until he had the opportunity to make him depleted.\n\nAlex had a choice. He ducked him.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CowsRetro",
                                                                            "body": "“Make him depleted” ya man that’s totally what happened. If saying yes to every opportunity to fight the guy when the other guy says no to those (until 313) is ducking, I guess that’s what Alex did.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Smooth-Abrocoma-2825",
                                                                                    "body": "What opportunity? 303? Ankalaev was never in consideration. 307? Ya, Alex stepped up after Ank already got booked in a pointless title eliminator.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CowsRetro",
                                                                                            "body": "300, the one I’ve been talking about this whole time 💀",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "commander_wong",
                                    "body": "Probably when he took on Khalil when Ankalaev was fighting two weeks away, or when he offered to step up for 310 only to go radio silent after Ankalaev also says he's available, or when he is only willing to fight Ankalaev during Ramadan while being open to fight anyone else anytime anywhere",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "CowsRetro",
                                            "body": "Alex has always said yes on short notice and said yes to Ankalaev for 300, which also was not during Ramadan. Both of these lines of reasoning are not true. Ramadan was also not  factor for two reasons. Ankalaev broke his fast to drink water, and Ankalaev was already beginning to cut weight when Ramadan started this year. Only person who’s ever confirmed to say no was Ankalaev.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "commander_wong",
                                                    "body": "> Ankalaev for 300, which also was not during Ramadan\n\nNo, just 3 days after Ramadan...\n\nI don't believe you actually think a guy is going to be ready for a title fight after a month of fasting \n\n> Ankalaev broke his fast to drink water\n\nYes, something Alex was publicly very salty about when he found out. He did all he could to try to make him fight depleted",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CowsRetro",
                                                            "body": "The fight was short notice for both of them. Either way Alex wasn’t lining up to fight him around or during Ramadan like you said he was. Link for Alex being salty about it please? Unless you mean when he called him out for making a big deal about it being on Ramadan and breaking his fast anyways. I’ve seen that, and that’s calling out BS not being “salty”",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "commander_wong",
                                                                    "body": "I don't even know which fight you're referring to anymore but either way, I never faulted him for not fighting Ank on 300\n\n> making a big deal about it being on Ramadan\n\nYes, turns out for religious people making career/life altering choices during a religious holiday is a big deal\n\n> I’ve seen that, and that’s calling out BS not being “salty”\n\nBS of your opponent adequately preparing for a fight? \n\nIf he wasn't salty he wouldn't have said anything publicly because it's none of his business. He should be prepared to fight his opponent at his best anyways",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CowsRetro",
                                                                            "body": "I’m referring to 300 which I’ve been talking about since my first comment, which was a short notice fight for both of them. And so no source of him being salty. That’s also not what I said. I said he was calling out Ankalaev and his fans for making such a big deal about how Ramadan was gonna affect Ankalaev, but he broke his fast anyways. He was calling out the excuse that was already being laid out when it was not a real excuse to begin with.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "commander_wong",
                                                                                    "body": "Again, I don't fault Alex for 300...\n\n> And so no source of him being salty\n\nIf trying to get your fans to harass and shame the other guy for not going 100% fasting isn't salt then I don't know what is",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CowsRetro",
                                                                                            "body": "“Trying to get your fans to harass and shame” 💀💀 alright bro. Surely that’s what happened",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Smooth-Abrocoma-2825",
                                                                                                    "body": "Pereira straight up said Anakalaev was only talking about Ramadan to have an excuse in case he lost.\n\nAnkalaev did not make Ramadan a big deal until Alex decided to be a cunt and make it a big deal. Probably because he was indeed salty that his little scheme had failed.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CowsRetro",
                                                                                                            "body": "Oh man the rewriting of history now is hysterical 💀 Ankalaev and his fans have been bitching since 300 about Ramadan.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Smooth-Abrocoma-2825",
                                                                                                                    "body": "LMAO no we haven't.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "CowsRetro",
                                                                                                                            "body": "The guy in this comment thread literally did 💀💀",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "commander_wong",
                                                                                    "body": "By the way, any [followups on this?](https://www.reddit.com/r/MMA/comments/1j47c0p/comment/mg6a5au/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button)",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PissWhistlin",
                                                                                            "body": "Damn, it's on sight with you guys.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "CowsRetro",
                                                                                            "body": "lol this still stands. It’s exactly like how Umar fans tried to say Merab only wanted to fight Umar with a broken hand and when Umar revealed his hand was fine Merab was allegedly “fuming”. Thanks for further highlighting the point man, and glad I’m living rent free in your head.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "commander_wong",
                                                                                                    "body": "Only one of us is coping and it's not me lol",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "CowsRetro",
                                                                                                            "body": "Only one of us is still thinking about messages from a rando on reddit 2 weeks ago. Much rather be “coping” than doing that 💀",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "commander_wong",
                                                                                                                    "body": "I chanced upon it because it's the exact topic of what we're currently discussing and thought that it's funny that you're the same guy lmao\n\nAt least you admit to coping",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "CowsRetro",
                                                                                                                            "body": "I’m sure you chanced on it buddy. Chanced on it so hard even though you were thinking about the “exact same convo” we were having 2 weeks ago. Glad I’m rent free",
                                                                                                                            "score": 0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "patronum-s",
                                                            "body": "Alex was salty about the possibility of a false excuse, which he was right feeling that way considering Ank's team is making excuses even after winning with baseless greasing accusation only because their guy's takedown attempts suck.",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ben_Thar",
                            "body": "I don't know about nervous, but something did look off.  Maybe he was.  He looked uninspired at the least.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "oh_three_dum_dum",
                            "body": "Ank didn’t want to fight. That can be true even if Alex was gun shy. \n\nNeither one of them was committing to anything and they both fought like they were scared.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "longtanboner",
                                    "body": "Ank was walking him down and tryna trade with him for most the fight lol, how did he not want to fight?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Crispy_Sock_99",
                                            "body": "Ank was definitely not tryn trade with Pereira. He did what he usually does: point fights from a distance and never over-extends so he can’t be countered. Anytime Pereira gained any momentum Ank would shoot and fail a takedown or clinch against the fence. Pereira should’ve been more aggressive but Ankalaev is also absolutely at fault for not bringing the fight to him and stalling against the fence",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "commander_wong",
                                                    "body": "Who's the one that almost knocked the other out again?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Crispy_Sock_99",
                                                            "body": "Not Ankalaev lmao. He hit Pereira while he was off balanced and Pereira bounced off the fence and then immediately clinched him before the bell went off. If you genuinely believe he was close to being finished you should rewatch that segment and pay close attention to Pereira",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "commander_wong",
                                                                    "body": "Holy cope lol",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Crispy_Sock_99",
                                                                            "body": "Genuine question: Why even reply if you have nothing valuable or useful to add? Are you just trolling?",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "commander_wong",
                                                                                    "body": "Are you? Because you're describing the fight in a way that does not at all reflect reality lmao \n\nAnkalaev barely clinched or tried to takedown the first 3 rounds, he was constantly pressuring, and no, Alex did not stumble because he just happened to lose his balance, he stumbled because got hit in the face really hard twice\n\nI don't know if you're deliberately lying or genuinely don't remember what you watched",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "patronum-s",
                                                                    "body": "It definitely wasn't a Izzy 1 situation, Alex's facial expression was very lucid.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "oh_three_dum_dum",
                                                            "body": "Neither of them?",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "oh_three_dum_dum",
                                            "body": "He was walking him down and trying to trade sometimes sure. He wasn’t doing anything incredible though and he quite clearly was not as aggressive as he has been in almost any of his previous fights.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Big_Stereotype",
                                    "body": "Poatan is my dude, i own multiple pieces of clothing that say chama. But ankalaev walked him down and beaned him with punches repeatedly. He got alex playing that deadly patty cake game w the lead hand and then just chucked fastball left hands down the middle. It worked really well he did that at least six or seven times. That's not something you do if you're scared of the other guy. Fuck ankalaev btw this comment leaves a dirty taste in my mouth. But it's kinda preposterous to say he fought scared.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "knyelvr",
                                    "body": "I love Alex but they didn’t BOTH fight scared that was only Alex..",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "oh_three_dum_dum",
                                            "body": "If you want to see it that way, I guess. \n\nI saw two people that were being entirely too cautious the whole time and Ankalaev simply showed a little bit more aggression to get the decision.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pretend_Pension_8585",
                    "body": "aura isnt about logic, it's about feelings",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TheWupper",
                    "body": "His aura absolutely did suffer from the Izzy KO lmao",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Juxtaposn",
                    "body": "Fucking yes? Do you watch the sport at all?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JuandisimoMagnifico",
                    "body": "Sadly, everyone from fighters to fans of Alex have absolutley tried to bury him since he lost. Everyone's clawing for that top star spot now. However, DDP certainly won't achieve that status with the way he fights or carries himself. Even with a finish over Adesanya, he still manages to have no star power.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bjorklazer",
            "body": "Pereira will win one back and everyone will switch up",
            "score": 70,
            "replies": [
                {
                    "author": "abittenapple",
                    "body": "Who the fuck is he gonna fight ",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Drive7hru",
                            "body": "…Ankalaev, silly! But honestly that’d probably just end in a trilogy if Alex wins considering the state of the division",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "thelittleman101",
                                    "body": "Depends how fun the rematch fight is. If it's boring and Alex wins, you can bet your sweet ass Ank isn't getting another title shot",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ZEEZUSCHRIST",
                                            "body": "Rematches usually go completely different (copium)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "abittenapple",
                                    "body": "Hill X 3",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Drive7hru",
                                            "body": "Why would he fight Hill rn when we already have the Ank rematch lined up and why’d you say x3?",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "evocater",
                            "body": "Rakic",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MartialArtsHyena",
                    "body": "He definitely lost a lot of momentum off this loss, but there’s no way he isn’t the top draw in the UFC the nano second he knocks someone out again.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "whipfixed",
                            "body": "He'll still be top draw in his next fight. Everyone will want to see if that performance was a fluke or a fall off.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Real-Human-Bean-",
                            "body": "There's no proof he was ever a top draw.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Johnny_Deppthcharge",
                    "body": "We thought that about Izzy though - there's no guarantee that Pereira gets back to winning.\n\nHe could just keep on losing like Izzy has.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Legitimate_Reward913",
                            "body": "I mean he is quite old with a whole kickboxing career behind him. Even if he wins the rematch, Alex doesn't have too long before he's either falling off a cliff or at the very least just not as quick anymore.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nolimitnolimits",
                    "body": "Has to be Ank",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HJtheKangaroo",
            "body": "I guess dude doesn’t want to get paid? Alex is the biggest money fight of the heavier 3 divisions.",
            "score": 134,
            "replies": [
                {
                    "author": "Wadget",
                    "body": "Plus he’s now shown to be beatable. Obviously Adesanya already showed that but this shows you can actually outpoint him and not get KOed",
                    "score": 10,
                    "replies": [
                        {
                            "author": "BoxingProvesNothing",
                            "body": "He’s always been beatable. Man got taken down by Izzy and Jiri who have 0 wrestling and by the 1st can he fought at 185. And was dropped by a 155er in kickboxing. UFC hype just a funny thing. And he was Koed literally Cold for minutes like 2 years ago on top of it. He can be beat Tons of different ways. Cage humping. Cage dirty box. Seen him get dropped by a leg kick bad in kickboxing. Been dropped. Can be wrestled. Can be controlled or submitted. You can beat him and most kickboxers 100 diff ways in MMA. I’ve been preaching this for years about Izzy and him and any life long Kickboxer. They are terrified of being on back too which opens up lucky overhand punches too. ",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JuiceheadTurkey",
                    "body": "I don't think he cares about the money. He risked a Strickland rematch instead of sitting around and waiting for Khamzat.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Smooth-Abrocoma-2825",
                            "body": "He risked nothing, the UFC wanted to make the Strickland rematch before Khamzat got the title shot so that's what they did. DDP didn't really have a choice in the matter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LittyForev",
                                    "body": "Champions have a lot more leverage in choosing who they fight. That's how Bisping was able to fight Dan Hendo instead of Yoel Romero. Nobody wanted to see Bisping fight 50 yr old Hendo.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Drive7hru",
                                            "body": "Or, the best example– Jones v. Stipe. Absolutely appalling.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "OrcsDoSudoku",
                                                    "body": "Tbh that match was fine at first, but was delayed.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OrcsDoSudoku",
                                            "body": "Champs have less leverage on who they fight than the rest as they have to meet some actual expectations.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Drive7hru",
                                    "body": "Do you have proof of that? Problem is that Khamzat can only rarely fight cause of his health issues and probable travel restrictions.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pukeinmyanus",
                            "body": "Ehhhh he could beat alex though. \n\nHe will not beat khamzat. I also wouldn’t necessarily say khamzat is a money fight just cuz it’s every fight fan’s most hyped fight. I still doubt most casuals know who he is. Ppl here say that’s not true, but this is an echo chamber of fight fans. \n\nThen again, it would be a saudi fight…does that mean ddp would get a red panty night?  Idk how the payouts work with those. ",
                            "score": -24,
                            "replies": [
                                {
                                    "author": "_Cyclops",
                                    "body": "I don’t know man. I’d bet on Khamzat if that fight happens but by no means would I say it’s a lock. Khamzat had very close fights with Burns and Usman. DDP’s a weight class up has good grappling and better cardio. That would be as close of a matchup as it gets.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "LittyForev",
                                            "body": "Khamzats only road to victory is submission. He has no chance standing with him and he's not strong enough to hold him down. Burns exposed Khamzats striking.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Pukeinmyanus",
                                            "body": "The bigger weight is honestly only going to help khamzat, especially after being up in mw this long. DDP is a more natural (cut) mw, sure, but khamzat was killing himself being in ww.\n\nIDK, it's not a lock I guess, I just can't see it going any other way than....khamzat shoots a few times, DDP stuffs it, gets in a few in close strikes/elbows.  R2 Khamzat gets him down and we're all just like yup....this dude is different...as he absolutely mauls him, gets the sub late r2.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "ironhide999x",
                                                    "body": "DDP has been doubted in almost every fight and he continues to win",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "ChrisusaurusRex",
                                                            "body": "This is true but that doesn’t mean it’s a 100% lock that DDP will win against Khamzat. It’s always obvious when the fight is over. Hardly anyone gave Max a shot against Gaethje and look what happened there.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Pukeinmyanus",
                                                            "body": "Is that better than a guy that isn’t doubted and also still always wins? Khamzat also had many, many more absolute domination wins for that matter.  ",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "LittyForev",
                                                                    "body": "He has only fought two top guys and struggled against both of them, one of which was a last minute replacement. Khamzat hasn't dominated one notable fighter.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fakename6968",
                                                                            "body": "How is Robert Whittaker not a notable fighter.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LittyForev",
                                                                                    "body": "Okay yeah I forgot what he did to Robbie. But Rob has next to no wrestling tbf.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "LittyForev",
                                                    "body": ">R2 Khamzat gets him down and we're all just like yup....this dude is different...as he absolutely mauls him, gets the sub late r2.\n\nFantasy world",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Big_Stereotype",
                                    "body": "Conor said \"red panty night\" because he assumed everyone was renegotiating their deal after every win like he was. He was genuinely flabbergasted and offended when he found out Eddie Alvarez didn't. They just get paid according to their contract. Champions get ppv points per that contract. But the idea that fighters generally get exorbitant purses to fight stars is misguided.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Pukeinmyanus",
                                            "body": "well...a Khamzat fight would be a Saudi card....aka the free ppv's that they pay a ton of money for so they can sit in silence in their traditional garbs with a select few of their harem.  \n\nI was only wondering in this case because it is actually possible they're paying the fighters directly, no?  I'm not sure how the Saudi cards work.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Big_Stereotype",
                                                    "body": "Why would they do that? They pay the ufc a bunch to come to town and then corporate just keeps it lol.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TrashbinEnthusiast69",
                                    "body": "Its not like he can choose his opponent. He has to fight kahzmat next whether he likes it or not. And he’ll beat kazhmat.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Soltaengboi",
                                    "body": "Eh…i dunno about that",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Pukeinmyanus",
                                            "body": "!remindme 5 months",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Internetolocutor",
                    "body": "Outside of Jones yes",
                    "score": 4,
                    "replies": [
                        {
                            "author": "HJtheKangaroo",
                            "body": "You right. I’m thinking it’s Aspinal and he’s gone so he isn’t really in the convo anymore",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dry_Beach_705",
                    "body": "Not without the belt he isn’t",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Soltaengboi",
                    "body": "He’s insanely rich already even before fighting business\n\nHe’s in it for legacy",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pixel8knuckle",
            "body": "I wonder what everyone will say if alex beats ank in the rematch. Absolutely wild how everyone flipped a 180.",
            "score": 19,
            "replies": [
                {
                    "author": "TickleMyFungus",
                    "body": "I didn't switch up but I didn't like what I saw in that fight.\n\nI have a feeling age is really catching up to him. People forget he's 37.\nIt's most likely why he was so persistent on being active. \n\n35 is usually when we see even the best, start to fall off or fall off completely. He's definitely fighting against time.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Real-Human-Bean-",
                            "body": ">35 is usually when we see even the best, start to fall off or fall off completely. He's definitely fighting against time\n\nHe's a lhw. Jan won a title at 38 and glover won one at 42.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DeadFuckStick59",
                    "body": "always happens w meatheads. alex is still a killer. some people have off nights for fucks sake lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AndrewWhite97",
            "body": "Not like he got knocked out or dominated. Dude lost a fair fight, worth the payday in my eyes.",
            "score": 16,
            "replies": [
                {
                    "author": "whipfixed",
                    "body": "Its the way that he lost though. He's known for deadly hands and didn't let them go at all. \n\nIn a typical Poatan fight, I have this fear for the other person's life. There's always the feeling that his opponent is in grave danger. \n\nAfter about a round and a half, I didn't feel like Ank was in danger at all.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Volvase",
            "body": "No it isn't I still wanna see him fight regardless",
            "score": 5,
            "replies": []
        },
        {
            "author": "TomCruisintheUSA",
            "body": "Pereira would still put DDP out cold",
            "score": 3,
            "replies": []
        },
        {
            "author": "NotSoGreatMacaroni",
            "body": "Now for people to act like DDP is somehow scared of Alex despite being  very open to the fight previously.",
            "score": 13,
            "replies": [
                {
                    "author": "CJtheZEN123",
                    "body": "Bro literally called him out to his face",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MojoPinSin",
                    "body": "One loss at a higher weight division does make DDP look scared. Whether he is or not, it makes DDP look a little bitch made. ",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "DoutorSenador",
            "body": "It surely took a hit, but if he comes back strong in the rematch he'd still be a star for the company. GSP had losses to Matt Hughes and Matt Serra but was able to avenge them and become the GOAT for a lot of fans.",
            "score": 4,
            "replies": []
        },
        {
            "author": "munchingpixels",
            "body": "DDP has the aura of a metrosexual fish",
            "score": 4,
            "replies": [
                {
                    "author": "TickleMyFungus",
                    "body": "I'm NOT a GAY FISH!!!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hipnotyq",
            "body": "I sincerely hope DDP gets similar treatment once he gets a single loss.",
            "score": 11,
            "replies": [
                {
                    "author": "TickleMyFungus",
                    "body": "The UFC will discard him like the \"i don't wanna play with you anymore\" toy story meme.\n\nDry personality and has to resort to extremely personal digs to be \"funny\"\n\nWhich some are but most just make him look like an out of touch (with society) bozo trying to be edgey. Meanwhile kissing his coach more passionately than he's ever kissed a woman",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fair-Lab-4334",
            "body": "Is the hype train back on if Pereira KO Ank in the rematch? Or will it sizzle out if we end up getting a 3rd fight?",
            "score": 2,
            "replies": [
                {
                    "author": "whipfixed",
                    "body": "If Ank gets slept in the rematch, 0% chance there's a third fight. Dana will say \"come on, who wants to see that again? I think that was pretty decisive. We'll get together on Tuesday and figure out whats next for Pereira\"",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Fair-Lab-4334",
                            "body": "Sounds spot on",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "interia1099",
                    "body": "Back on",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnTTr0n",
            "body": "If Alex wins in a rematch it will be right back on lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "EffektieweEffie",
            "body": "This is just DDP shitting on someone who started things. Alex called him a dogs arsehole and said he wants to come down to 185 to beat DDP. And according to SS, Alex hates DDP for whatever reason. So Dricus is getting his digs in while he's down, he does this with every fighter who throws shade at him and loses - most recently Erceg and Brendan Allen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lars6",
            "body": "Pereira didn’t do anything in the fight after avoiding Ankalaev for so long.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thebrah329",
            "body": "Lmfao that was a good laugh. Yeah go fight worse fighters with less name value, that will get you far.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BuzzNoche",
            "body": "Good cuz DDP would have got slept easy",
            "score": 11,
            "replies": [
                {
                    "author": "Ihateporn2020",
                    "body": "100%. Too hittable.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "JimJonesdrinkkoolaid",
                    "body": "I doubt it.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "_Cyclops",
                            "body": "I would’ve said that before but after he stuffed 11 of Ank’s takedowns I think that’s probably how it would go",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "JimJonesdrinkkoolaid",
                                    "body": "I think DDP has better offensive wrestling than Ank though to be honest. \n\nLook at how often DDP averages a takedown and his TD accuracy and then look at Ank's\n\nDDP -\n\nhttp://ufcstats.com/fighter-details/0d7b51c9d2649a6e\n\nAnk - \n\nhttp://ufcstats.com/fighter-details/d802174b0c0c1f4e",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Drive7hru",
                                            "body": "TLDR: \n\nDDP TD Avg.:  2.55 per 15 mins \n\nAnk TD Avg.:  0.80 per 15 mins\n\nFor those who struggle with math– DDP averages over 3x more TDs than Ank",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "JimJonesdrinkkoolaid",
                                                    "body": "Cheers for doing that!",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Big_Stereotype",
                                            "body": "He has more effective wrestling because i think he's stronger for his weight class. He's not an especially technical wrestler or grappler. Moreso than striking but he's still mostly a physical specimen with a lionheart...idt he's just gonna bully Alex with his big muscles.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "_Cyclops",
                                            "body": "It’s not a great comparison though because outside of Brunson Dricus hasn’t fought anyone with good takedown defense.\n\nEdit: and Rob",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "CheakyTeak",
                                                    "body": "and strickland",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "EffektieweEffie",
                                                    "body": "Izzy is also known for his great TDD, Brunson couldn't get/keep him down.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Glad-Researcher-9938",
                    "body": "Lol no",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "oh_three_dum_dum",
            "body": "People are acting like he got dogwalked by Ankalaev. I didn’t think recency bias infected the actual UFC too.",
            "score": 5,
            "replies": [
                {
                    "author": "Constantine_f100",
                    "body": "He kinda did",
                    "score": -8,
                    "replies": [
                        {
                            "author": "oh_three_dum_dum",
                            "body": "Not even close. He beat him by decision in a boring fight where neither of them did anything special. It looked like they both didn’t want to be there.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "interia1099",
                                    "body": "Yeah Thats just not true. Ankalaev looked confident and sharp, don’t know what would suggest that he didnt want to be there",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "wetfarts2",
            "body": "Driscus has no aura..",
            "score": 2,
            "replies": [
                {
                    "author": "interia1099",
                    "body": "Making two Champs cry before beating them is Kinda cold tho ngl",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "whipfixed",
                    "body": "ehhh I disagree. His fight style doesn't do much for his aura, but his resume and his media appearances do.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "DrummondGreen",
            "body": "It’s ok DDP, Chimaev aura still at a high ☺️",
            "score": 2,
            "replies": []
        },
        {
            "author": "Due-Contribution6424",
            "body": "Confirmed, DDP is a Redditor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Belsnickel213",
            "body": "I don’t think it’s gone. He lost a close fight and looked off during it. In another timeline he sparkles him in 2 rounds.",
            "score": 1,
            "replies": [
                {
                    "author": "Dry_Beach_705",
                    "body": "In another timeline my grandmother is a bike",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Belsnickel213",
                            "body": "Haha. Keep them coming. Love it!",
                            "score": -3,
                            "replies": []
                        },
                        {
                            "author": "oh_three_dum_dum",
                            "body": "The difference is that the comment you replied to is 100% right. That fight wasn’t a good example of what either he or Magomed can do.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Smooth-Abrocoma-2825",
                                    "body": "Yeah it's a good example, because it fucking happened lmao",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "oh_three_dum_dum",
                                            "body": "I’m sorry you don’t have the capacity to think critically then. Because they both put up a fight that’s not indicative of what either of them would normally do.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hallelalaluwah",
                    "body": "In another timeline he gets sparked at the end of the second",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrtn17",
            "body": "that photo of Pereira 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "VonNichts13",
            "body": "no one is even close to alex pereira level in a draw in MW/LHW/HW. trying to pretend like a loss in mma matters is whack. DDP would be on his knees thanking daddy dana if he got a fight with alex. wasn't going to happen in the first place but still",
            "score": 1,
            "replies": [
                {
                    "author": "Real-Human-Bean-",
                    "body": ">level in a draw in MW/LHW/HW\n\nJones and Khamzat. There's no proof that Pereira is a draw.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DontBelieveMyLies88",
            "body": "We’re still not considering Alex coming in and being more aggressive in the rematch and sending him to meet Allah. People win rematches all the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "MorganPinx",
            "body": "I like DDP but he had slow slug matches with people who Alex already beat and still has horrible defense. That being said can’t wait for the next Alex fight or DDP.",
            "score": 1,
            "replies": [
                {
                    "author": "Real-Human-Bean-",
                    "body": "Sama got slept by Izzy who DDP finished.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chocolatebuddahbutte",
            "body": "Yeah after watching silva gsp and jones I never thought poatan had an invinility aura around him, i mean he got slept first of all and don't think his chin is all that. And no ground game",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeadFuckStick59",
            "body": "Alex would knock DDP's head clean off lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "peeperswhistle",
            "body": "Dricus would still get KOd by alex. Him having an off night doesnt mean he cant beat a middleweight with 0 technique. DDP is hittable, the only recent fight where he didnt take ALOT of damage was his last fight. he is always eating big shots and leaving looking worse than whoever he just beat. Ankalaev is NOT hittable, and has very good defense, someone whos easy to hit like DDP is a dream matchup for alex",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rgmisll",
            "body": "Hope Pereira wins the rematch against Ank and turns down the fight vs DDP",
            "score": 1,
            "replies": []
        },
        {
            "author": "SlipstreamDrive",
            "body": "Funny from a guy with 0 aura even with a belt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YangGain",
            "body": "He can say whatever he want, I don’t see people imitating his walk out or saying his catch phrase. So CHAMA remains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rude-Celebration2241",
            "body": "We’ll see what of his aura is lost if Khamzat blows the doors off of him, tbd…",
            "score": 1,
            "replies": []
        },
        {
            "author": "turkeypants",
            "body": "My man doesn't want to face that!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tantle18",
            "body": "The word aura has really lost its aura",
            "score": 1,
            "replies": []
        },
        {
            "author": "National_Singer_3122",
            "body": "And DDP has no aura anyways so who's he to talk? lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "N0cha",
            "body": "Did Ja Rule chime in too by any chance?",
            "score": 2,
            "replies": []
        },
        {
            "author": "johnnycashewwz",
            "body": "fighter removed: dricus du plessis",
            "score": 1,
            "replies": []
        },
        {
            "author": "theyoloGod",
            "body": "Maybe the aura comes back if he starts punching again",
            "score": 1,
            "replies": []
        }
    ]
}