{
    "title": "How to not be a colonizer?",
    "author": "throwaway_7226",
    "subreddit": "Anarchism",
    "rank": 455,
    "score": 69,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/Anarchism/comments/1i9ts4x/how_to_not_be_a_colonizer/",
    "id": "1i9ts4x",
    "selftext": "Sorry this might sound like a weird post but I am being genuine and I need advice.\n\nAlso I am sorry if any of this is confusing, I am just struggling to really explain myself.\n\nSo I am a white person born in australia and with australia day happening the topic of australian colonialism is brought up more (as it should be of course) and well its left me questioning how I should feel about things.\n\nGrowing up I used to like this country.\n\nBut knowing all the crimes australia has committed I just feel sort of lost.\n\nI don't want to be a colonizer, I don't want to be in this system and I feel shame for being a white person living here.\n\nI feel hopeless in my situation especially struggling financially and always worried I am gonna get hatecrimed for being queer. I wish I wasn't living in a colony but it's not like I can just leave.\n\nI want to do the right thing but a. I barely have the energy to take care of myself. b. I don't know what I should be doing anyway.\n\nI feel like an outsider in the place I was born and I don't know what to do about it.\n\nWhat's something that I can do that is within my means?\n\nJeeze I'm sorry if this is a bit of a ramble\n\nTLDR: How can I call some place home when it shouldn't be my home in the first place and was stolen from someone else.\n\nUpdate: I'm sorry if I caused any arguments, I have a tendency to internalize things more than I should.\n\nAlso I was probably a bit too emotional when I posted this, I apologize",
    "comments": [
        {
            "author": "AKFRU",
            "body": "I'm in Australia too, fuck Invasion Day. \n\nTurn up to Indigenous shit. Turn up to the Invasion Day rally in your capital city, or local event. Turn up to protests. Turn up to the cultural days. Turn up. Listen. Learn. Promote Aboriginal voices.\n\nWhen you have walked with your local People you will shake the feeling of being a coloniser, at least to some extent. It's up to us to learn and respect their culture and their land. \n\n[Listen to Barkaa.](https://www.youtube.com/watch?v=EdU34AxgPF0&ab_channel=BarkaaVEVO)",
            "score": 105,
            "replies": [
                {
                    "author": "allthatbackfat",
                    "body": "As a white-queer first gen settler in Canada I can’t agree with this more! \n\nStop focusing on your guilt because there’s literally fuck all to do about atrocities that have *already* happened. Our collective obligation, and I say that with strong emphasis and encouragement to understand why it’s incredibly important to see this as not only things which happen in our own colonized states, but in the world at large, (re: the very parallel Palestinian Genocide) Start focusing on moving forward with the knowledge of trauma, and keeping indigenous communities autonomous, dignified, and protected with the colonial privilege you have. Don’t speak for them, but advocate with them in solidarity. \n\nSeek out groups which aim to break down systemic barriers indigenous populations face. Promote initiatives that fight for their voices to be heard and know every day where you’ve had an upper hand. I think this is one of the aspects to privilege that people often overlook. \n\nKnowing your social geography and how it benefits you and not others is an exercise in reconciliation. \n\nApplying this to indigenous pops and learning about their generational trauma and being compassionate to those who’ve experienced institutionalized barriers like the carceral system, police, healthcare (ei: birth alerts, a beyond horrifying history with reproductive sterilization, forced medical trials), criminal justice, and very importantly -childcare- (residential schools, the 60s scoop, the list is endless, and while the two former are known Canadian based atrocities, we’re both a crown corp and likely have shared trends due to that fucking family may THEY ALL REST IN PISS). \n\nDemanding justice for the hundreds of thousands of modern missing or murdered indigenous women and girls is something that is still rampantly ignored here in Canada. \n\nSupporting radical actions like Landback in ways you’re comfortable and still recognizing your role here is important. Again, speak with, not for. \n\nOur countries are different geographically—they’re not even comparable, but our governments and many of the people around us share culpability in actions taken against this community. Do what you can to promote and uphold the dignity and preservation of what colonization and oppression have taken from this rich culture. Hoping that’s helpful. ❤️",
                    "score": 14,
                    "replies": [
                        {
                            "author": "throwaway_7226",
                            "body": "While we are very far apart geographically, sadly the type of shit our countries did are very similar.\n\nAlso thanks it is helpful",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "throwaway_7226",
                    "body": "That is helpful advice, and yes that is something I should do more.\n\nI should have a look at what stuff/events/groups etc. is up in my town",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DreamDue7801",
                    "body": "The part of the song about making fun of someone being addicted to drugs was unfortunate",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AryanFire",
            "body": "Center indigenous de-colonization, not your guilt. Keep the focus on them and what decolonization needs, and you will be okay. You were born into the privilege of being in a colonized Western nation, but you can use that privilege to recognize how neo-colonialism still works today and how you are positioned to dismantle it by centering indigenous voices and community efforts.",
            "score": 85,
            "replies": []
        },
        {
            "author": "OwlHeart108",
            "body": "Have you read Tyson Yunkaporta, the aboriginal writer? His books offer pointers towards another way of being.",
            "score": 22,
            "replies": []
        },
        {
            "author": "-Dopleganger-",
            "body": "I think it’s important not to succumb to guilt and nihilism. Lots of bad business has happened in the past pretty much everywhere, history cannot be changed. So what are we to do? Feel bad about ourselves for happening to be born in a colony country? You had no choice in the matter, had no say in the colonizing. We must focus on the present and future, history is for analysis and applying said analysis to craft a better future. How can we correct the wrongs of the present day? How can we prepare for future horrors and avoid repeated history? These are far more useful and progressive contemplations to have on the matter. Beating yourself up over it won’t help, and actually sometimes it can come off as a bit racist if you are too overflowing with guilt about these things. Unite people, form strong bonds with all of your countrymen, and focus on fixing and creating a new Australia instead",
            "score": 11,
            "replies": []
        },
        {
            "author": "Jfishdog",
            "body": "Oppose exploitative land-use, and stand on the side of indigenous rights, and you have nothing to be ashamed of",
            "score": 8,
            "replies": []
        },
        {
            "author": "Hopeful_Vervain",
            "body": "Being born there wasn't something that you chose, you're not personally guilty of anything. It's okay to take care of yourself too, I think one of the best tip I got from a first aid class was that, if you don't prioritise your own survival and you put yourself in reckless situations, you can't save others either, we just get more people hurt and potentially dead. I think that goes for everyday life as well, by helping yourself first, you can help others better, don't put yourself in a situation where your wellbeing is endangered.",
            "score": 26,
            "replies": []
        },
        {
            "author": "eli4s20",
            "body": "you did not colonize anyone, you did not kill natives and you didn’t steal their land. this situation is not your fault and i bet most natives would agree with that. i guess theres not much else you can do other than being a decent human being and supporting the issues of the native population.",
            "score": 34,
            "replies": [
                {
                    "author": "oskif809",
                    "body": "Learning about these issues is step #1 to stop living in a bubble. You're in luck that you can listen to someone speaking in a fine Australian English accent on issues of settler colonialism:\n\nhttps://youtu.be/xwj5bcLG8ic\n\nhttp://www.kooriweb.org/foley/resources/pdfs/89.pdf",
                    "score": 14,
                    "replies": [
                        {
                            "author": "throwaway_7226",
                            "body": "Thanks I am gonna check that out",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DreamDue7801",
                    "body": "yes absolutely agree. this is some weird original sin bullshit. I mean you might feel bad for being racist one time or in school or something but the vast majority of anarchists are totally opposed to colonialism the genocidal states and racism. You're already doing a lot by examining your positions, maybe try to educate others?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "arbmunepp",
            "body": "Why would you feel shame? You haven't done anything. But you do have a moral imperative to work to dismantle the Australian state.",
            "score": 7,
            "replies": [
                {
                    "author": "rockinwithkropotkin",
                    "body": "I feel like there’s a sense of grandiose in OPs attitude. Like no typical one person is as important as this or some kind of “colonizer” that has any meaningful effect on someone else’s life by just existing.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "throwaway_7226",
                            "body": "I just don't want to be a bad person. Its not me trying to be grandiose, I just feel bad when I hear people from outside australia say 'fuck australia' and 'fuck australians'\n\nIm sorry, I internalize things a lot, autism probably doesnt help",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "arbmunepp",
                                    "body": "\"Fuck Australia\" and \"fuck Australians\" are two very different statements. As anarchists we all want to destroy the \"countries\" we happen to find ourselves in.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "rockinwithkropotkin",
                                    "body": "Sorry, I wasn’t implying you were trying to be grandiose like on purpose, what I mean is that I think you’re placing too much importance on you as a single individual in society. Like you’re not a bad person for existing, that’s just silly.  \n\nUsing any privilege you have isn’t going to matter, and some people are going to consider it foolish to not use the privileges you have. You can use privileges to help as well. If there’s anything you can do to be positive or make positive change, try to focus on what you can do with that instead, if that makes sense.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sapphicmoonwitch",
            "body": "Guilt does nothing. Embrace rage. Tear down your ancestors bullshit.\n\nThat's my conclusion from my similar situation as yours in the socalled usa.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Okay this is going to sound wild and most people here will probably hate me for it but man you cannot blame yourself for all of the crimes of your ancestors. Not to mention, everything has a double standard. You are not a coloniser just because your ancestors were, and even then you don’t know that as a lot of Australians were forced to be in Australia as criminal punishment.",
            "score": 3,
            "replies": []
        },
        {
            "author": "General-Gyrosous",
            "body": "Dunno man, my ancestors came to the Carpathian Basin a thousand years ago, but i feel myself a colonizer sometimes",
            "score": 6,
            "replies": [
                {
                    "author": "throwaway_7226",
                    "body": "I know that is probably a joke but saying that weirdly made me feel a little bit... validated? is that the right word?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lizrd_demon",
            "body": "You are a colonizer. That’s not a personal failure. And seeking freedom from this idea should not be your goal.\n\nInstead you should figure how to be an agent of decolonization. You should see through the grift of whiteness and colonial citizenship, then work to undermine the system through solidarity and direct action with indigenous resistance groups. \n\nI recommend looking into new-abolitionist theory.\n\nhttps://www.aljazeera.com/amp/opinions/2019/11/17/abolishing-whiteness-has-never-been-more-urgent\n\nAnd afropessamist theory.\n\nhttps://monoskop.org/images/f/f2/Wilderson_III_Frank_B_et_al_Afropessimism_2017.pdf\n\nCombined, it provides the white or colonizer individual, a cohesive framework - which properly frames colonialism, race oppression, their place within these systems, and how these systems operate in their every day life with historic context. Grounding them in a practical and actionable everyday solidarity.\n\nTo further develop this decolonial approach with anarchisim, I recommend reading the EZLN critique of anarchisim.\n\n https://theanarchistlibrary.org/library/ejercito-zapatista-de-liberacion-nacional-a-zapatista-response-to-the-ezln-is-not-anarchist",
            "score": 22,
            "replies": [
                {
                    "author": "johnyroyal",
                    "body": "No, they're not a colonizer and it's wild that you would say that lmao. They most accurate term would be a settler to define their relationship to the lands they live on in relation to the Indigenous peoples of the land.  Trying to reinforce someone's white guilt like that is an asinine endeavor and doesn't help anyone. Learning class and race solidarity as a collective to abolish the systems we were handed down but never created is the way, not reinforcing personal feelings of guilt lol.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Lizrd_demon",
                            "body": "Fair enough, settler may be a better description.\n\nThe rest of your critique is in line with what I said. \n\nActually new abolition thinking takes a step beyond your approach, seeing whiteness itself as a shackle specifically designed to align you with the colonial machine, no matter how much you try to resist it.\n\nInstead you should seek to fully understand the nature of whiteness and its history.\n\nIn seeing its true nature, you throw off its shackles, throw off the white identity - thus fully aligning yourself against the colonial machine. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Susurrating",
                                    "body": "I am no kind of expert and certainly do not have the full story, but I recall reading that part of the origin of whiteness as a concept is as a tool used by plantation owners to drive a wedge between enslaved Africans and indentured Europeans, who had been feeling and practicing solidarity with one another. This was of course threatening to the plantation owners. Thus, the concept of “whiteness” emerged as a way to divide them. \n\nAgain, if I’m missing information here, please do let me know. This is just to the best of my recollection as I type on my phone whilst sitting on the toilet.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Lizrd_demon",
                                            "body": "It’s a little more complicated but yes that’s the gist of things. You can also trace it back to the Haitian slave revolt as a particular incident which caused the colonial ruling class to start searching for deeper more decentralized means of control. The first mention of a “white person” did not appear organically, but rather in a commissioned play. It’s an artificial construction to both divide the slave class, and to get them to enforce colonial hierarchies in every day life.\n\nThis is why daily decolonization is not only important, but an essential component of hierarchical power that needs to be addressed and dismantled. ",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CalmEstablishment346",
            "body": "I really do not mean to be overly reductionistic about this but I think you need the confidence of someone saying you will not get a satisfying answer and that should liberate you to some degree. It is, after all, your responsibility to do what you think is best, and that will require some implicit amount of self-assuredness. Whether you accept or reject any particular label or theory is irrelevant. What are you going to do to make things good? Do you want to watch strangers debate subjective identities and their material consequences on the internet or do you want to make something good for you and everyone around you? That attitude is 1 million times more useful and germane to the issues than whether or not you are a colonizer, how that makes you feel, and what you can theoretically do about it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Forackol",
            "body": "You dont have to be shamed of because you live in australia as a white person. Your ancestors were birch, not you. You dont have any other option except living there. Be happy, and try to change to world by starting you and your surroundings. Peace out ❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 6,
            "replies": [
                {
                    "author": "Legitimate-Ask5987",
                    "body": "1. Being indigenous is not a race, it is a political identity. This misunderstanding is why conservatives try and fail to overturn Indian rights in the USA because the language of federal Indian  law is clear on it. \n\n\n2. Native people act as land stewards. Especially in the USA, land ownership was forced upon people so they could trick Indians into selling land to heat their homes and feed their children. Land ownership today is about preserving biodiversity. 80% of the protected land on this planet is under the stewardship of native peoples. \n\n\nYou insult us and our sovereignty and beliefs and know nothing. ",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ExpeditePhilanthropy",
                            "body": "Their argument doesn't seem all that distant from Nandita Sharma's position that \"indigenous\" is an imperialist categorization which has itself been validation for oppression \"alien\" peoples. The term isn't an unalloyed good, and carries its own baggage.\n\n  \nNative people \\*sometimes\\* act as land stewards; there is no shortage of indigenous peoples who practiced what could not be described as anything other than ecocide.\n\n  \nWe should also be careful about saying 'land ownership was forced' on indigenous people; plenty of people's practiced exclusive ownership norms that would be more or less indistinguishable from our own existing order. It is indisputable that these norms were pushed to extinction by the advancement of settler-colonial interests, but to suggest that there weren't close approximations beforehand benefits no one.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Legitimate-Ask5987",
                                    "body": "This post is about settlers and indigenous people. You use right wing talking points about race to dismiss native sovereignty because you are ignorant about it. Decolonization is a critical part of anarchist work. If you don't even know any thing about how native land rights work or treaties, why even speak?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "sadlywhack",
                                                    "body": "[lemme get that for ya😂😂😂😂](https://giphy.com/gifs/spongebob-squarepants-mr-krabs-worlds-smallest-violin-13A7YlLvYVDnmU)",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Legitimate-Ask5987",
                                                    "body": "Keep responding yt 😂",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TheOGDumbass2",
                                    "body": "It has everything to do with what you're saying, you are essentially like those people who think saying \"white power\" is equivalent to saying \"black power\"",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "TheOGDumbass2",
                                                    "body": "It's clear you have no idea what you're talking about and speak in the language of buzzwords",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheOGDumbass2",
                    "body": "Indigeneity, is not just some bullshit created out of nowhere, it is a concept in response to colonialism, like real material oppression. You have a poor understanding of this shit which is why you say \"colonial past\" as if colonialism isn't still ongoing and being resisted.\n\n\"Indigeneity is almost always a reactionary construct that should be regarded with suspicion. We are all from somewhere else and we should all have the right to live wherever we want.\"\n\nThat's literally the point. Indigenous is a label created by an oppressed group who are denied the right to live on their land, usually on an ethnic basis. Indigenous movements are about deconstructing the colonial framework that inevitably forms these ethnic hierarchies.\n\nWhite people using anarchism as a crutch to ignore any systems of domination they might benefit from. It's not enlightened. You cannot frame everything as a \"state versus everyone\" situation, while undermining other power dynamics and claiming you offer the purest form of anarchism.\n\nThis is why people get tired of white anarchists because they love, love, love, to act like they are so high and above everything because they are \"enlightened anarchists who have dismantled all hierarchy, unlike those ignorant MLs\" and then go unto ignore genuine material oppression, just like this.\n\n\"Being born in a country with a colonial past doesn't make you a 'colonizer'. It doesn't mean anything. It's \\[REDACTED WORD INDICATING LOW INTELLIGENCE\\] and divisive and you aren't doing anything productive by doing a 'land declaration' before you speak at an activist meeting. It's the most pointless performative shit imaginable.\"\n\nJust want to focus on the \"it doesn't mean anything\" point. \"Yeah bro there are NO material implications to the conditions that created you bro, just trust me.\" You shouldn't think about history and why the things the way they are and how it may be related to any contemporary modes of oppression? Seriously?\n\nAnd colonial entities do not see land in the same as the indigenous not because of some blood and soil bs, but that by nature colonial entities view the land in an explicitly extractive sense, as something to be conquered. The colonial identity is one which largely asserts a hegemonic notion of land ownership, which indigenous people are many times forced to abide by. Colonialism creates or largely exaggerates the frameworks you say you are against. \n\nThis is the white anarchist version of \"not white power, not black power, but worker power\" bs",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheOGDumbass2",
                                    "body": "Identities are not born out of thin air, they are immersed in context and in many times constructed in explicitly hierarchal frameworks. \n\nThis tendency to reject identity politics to the extent that we cannot acknowledge this is to our detriment. I am not at all encouraging white guilt, I'm just encouraging that we are not blind to these things.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hi u/TheOGDumbass2 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Anarcho_Humanist",
            "body": "Another white Australian here.\n\nBy no means am I an expert, but almost no indigenous person here actually wants all the white people to pack up and leave, nor do they want people to feel ashamed for being white or to start seizing white people’s homes. You can relax on that front.\n\nPeople want indigenous people to not be treated like crap. I assume you live in a major urban area (since something like 95% of Aussies do) but it was shocking for me to learn that hundreds of thousands of people in this country don’t even have safe drinking water, with the majority being indigenous. Not to mention areas of heritage being destroyed and disrespected (climbing on Uluru for example). Australia also being one of the only places in the world to celebrate the date of its colonisation as its national day is also weird as fuck and as many have pointed out very offensive to indigenous people.\n\nThere’s also a much more contentious argument about who this land should actually belong to and how it should be given to them, but I have no real ability to weigh in on it because I’ve never actually had it comprehensively explained to me.\n\nYou do get a few people who use decolonisation to be bullies. I’ve learned to just ignore them.",
            "score": 5,
            "replies": [
                {
                    "author": "Anarcho_Humanist",
                    "body": "Also, check out Gary Foley.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DreamDue7801",
                            "body": "Is Gary an anarchist? All i remember about them is they did the tent embassy and ontologically hate animals.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Anarcho_Humanist",
                                    "body": "I have no idea about the ontologically hating animals thing, but I think Gary is an anarchist. He’s described himself as such and wore an anarchist hoodie to a recent thing.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cybin333",
            "body": "You can't choose where you were born and what your race is. idk what to tell you, man.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Strawb3rryJam111",
            "body": "Burn a Book of Mormon.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/-UndercoverTaco- - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/golgothagrad - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MOTHERF-CKED",
            "body": "Just saw this in r/zines and thought of this post!\n\nhttps://www.reddit.com/r/zines/s/4jqvKhrFiW",
            "score": 1,
            "replies": []
        },
        {
            "author": "Downtown_Diver7915",
            "body": "https://www.indigenousaction.org/accomplices-not-allies-abolishing-the-ally-industrial-complex/",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Be a good human. Help those around you. Workout. It will help you relieve stress and improve your mental health. Find a new hobbie that you enjoy.",
            "score": 1,
            "replies": []
        }
    ]
}