{
    "title": "Finding Kropotkin comforting right now",
    "author": "o0oo00o0o",
    "subreddit": "Anarchism",
    "rank": 358,
    "score": 117,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 10,
    "url": "https://i.redd.it/e1voveajfnge1.jpeg",
    "id": "1ifom55",
    "selftext": "T",
    "comments": [
        {
            "author": "Lizrd_demon",
            "body": "I'm sitting pretty. It seems like trump is destabilizing the empire. Creating the perfect conditions for mass organizing.",
            "score": 11,
            "replies": [
                {
                    "author": "Jimmeh1337",
                    "body": "That's keeping me optimistic too. There will soon be a need for people to replace all of the government provided resources that will soon no longer be provided if the current regime gets its way. It's an opportunity for leftist to reshape them into something better.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "o0oo00o0o",
                            "body": "Couldn’t agree more with you both",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Red_Spruce",
            "body": "Which book or article is that from? Please share if you're going to post quotes!",
            "score": 4,
            "replies": [
                {
                    "author": "o0oo00o0o",
                    "body": "My bad, homie! It’s from Conquest of Bread",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Lizrd_demon - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "am_az_on",
            "body": "I recall a social justice oriented musical artist posting that they don't leave their house if they're not going to get paid. And because they're a well respected artists, their post was well respected and fawned over.",
            "score": 1,
            "replies": [
                {
                    "author": "o0oo00o0o",
                    "body": "A lot of musicians are classic narcissists who wax poetic about social justice without engaging at all with what that means. And the cult of personality that dominates our culture continuously admires them for it",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "icarusrising9",
                    "body": "I get what you're implying, but surely context is important? I'm pretty introverted, without any additional context that sounds like they might be talking about having boundaries with employers/execs, which, ya, not letting your employer take advantage of you is definitely a good thing.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}