{
    "title": "We need more Left-wing Propaganda",
    "author": "MysticMind89",
    "subreddit": "Anarchism",
    "rank": 319,
    "score": 420,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/Anarchism/comments/1igt50s/we_need_more_leftwing_propaganda/",
    "id": "1igt50s",
    "selftext": "This is something I've been mulling over since the 2024 US Election. For years, the far-right has been backed by massive think-tanks like Prager University and the Daily Wire, spewing propaganda and fear that has shaped the narratives of the political right, often putting trans people square in the crosshairs alongside \"Illegals\" as an easy outgroup to represent the \"degeneration\" of society.\n\n  \nThe Right has formed a cult of personality around Trump, swallowing wholesale the red scare propaganda over the \"Communist\" Democrats, all while the Democrats gleefully skip behind them, trying to imitate them and pleasing absolutely no one. I only advocate for participating in Capitalist Democracy to keep the worst reactionaries out of power, as it's foolish to think the Democrats will stand up for anyone but the Capitalist class.\n\n\n\nBut as we've seen, when the Democrats fail to commit to standing up for human rights, giving wishy-washy none-answers like \"I'll follow the law\", people stay home. And when people stay home, the MAGA cult flocks out in droves to make their [idolatrine](https://genius.com/Ghost-idolatrine-lyrics) the law of the land, further erasing human rights and enforcing Christian Nationalist brand Fascism.\n\n  \nThis brings me to my point about Anarchism. The simple truth of the matter is that we need more propaganda, more art, more literature, to drag this world kicking and screaming toward a better future. Already, mega entertainment corps like Disney are erasing overt trans representation in media to please their bigoted shareholders, walking back on the bare minimum token representation they already had.\n\n  \nWe cannot let the far-right [control the conversation](https://www.youtube.com/watch?v=CaPgDQkmqqM) any more than they already have. We've seen what happens when our so-called leaders refuse to offer any sufficient counter to these narratives, stuck in an endless loop of [we go low, you go high.](https://www.youtube.com/watch?v=MAbab8aP4_A) We are watching in real time as the right uses culture war narratives to justify human rights atrocities, and since the Democrats are too preocupied with \"Playing by the rules\" (no matter how much the other side stacks the deck), we need to cut through the bullshit with our own propaganda, in conjunction with direct community-based action, to protect the lives of LGBTQ+ people and other targeted minorities.\n\n  \nEvery piece of art we make helps to further cement our place in culture, even when the state tries to censor us. Society is nothing without the individual actions of people collectively working to protect the persecuted. So even if all you can do is pick up a pencil or type in a word document, we need you to do it, and we need to bolster those who do just as much as those directly acting to protect the most vulnerable amongst us.\n\n  \nTicking a box once every four years won't save us. It's not useless, but it's just one small part of a much grander effort to fight back against the far-right's culture war. Make your voice loud and clear to rise above the loud bigots: If you are threatened by Fasicsts, you are safe with us!",
    "comments": [
        {
            "author": "Sargon-of-ACAB",
            "body": "I'm all for more art and propaganda but this is like the tenth post in the past few weeks that seems to miss something I'd have assumed is fairly obvious:\n\n*\t*No-one will ever give us a platform like the far-right gets.** \n\nAt least not in good faith. There's no ecocidal billionaires that'll ever give us money or airtime. Our art will always have limited appeal to those defending the status quo. \n\nI'm not interested in anyone's opinion on voting but it's not our job to make sure democrats (or anyone else) gets elected. The dems didn't lose because a relatively low number of left-wing folks stayed home. They lost all on their own. A campaign without a message filled with unforced errors.\n\nIf we want to convince people of our ideals we need to do so on the power of those ideals. The strength of anarchism lies in that we practice what we preach. One of best tools of propaganda is that we organize by the principles we believe in *and this works.* \n\nIf you want to reach people you need to be visibly doing tangible things. This *can* absolutely be art and propaganda. It *can* include joining protests that are too liberal for your tastes. It can be direct action, distributing food, teaching people about op-sec.\n\nThe anarchist group I'm most involved with has (if we're optimistic) 7 people. Our reach and organizational capability is larger than that number would imply because *we get shit done*. We grow. It's slower than we'd want but we grow because people trust us to get shit done. And when you're seen getting shit done people remember.\n\n(This in no way devalues actions that are for whatver reason less visible)",
            "score": 113,
            "replies": [
                {
                    "author": "4chanime",
                    "body": "start spraying the streets. capitalists hate it when we mess with \"private property\" and street art is for everyone to view.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "dobrolo",
                            "body": "Street art nice, but people rarely even notice",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "jbdany123",
                                    "body": "As someone who lives in Baltimore, you’re right. It’s unfortunate but it’s also so common that I don’t even give it a second thought anymore.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Foronerd",
                                    "body": "And sometimes gentrifiers actually like it because it adds ‘character’",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lovealways-har",
                    "body": "Can i join your anarchist group",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Sargon-of-ACAB",
                            "body": "I think it's a bit outside of your area",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jimmeh1337",
            "body": "I couldn't agree more. We need real physical works more than digital ones as well I believe. Stickers, posters, zines, literature. It's one thing to see an anonymous work of art online and another to see it distributed in your actual community.\n\nI also think it's best to keep it to the basics for now. We need to convince people, especially Democrat leaning liberals imo, that a better future is possible and the government isn't going to save us from this mess. I see a lot of Democrats wanting to protest and organize but not knowing how. I think a lot of people would be willing to take even more direct action but they don't know how and don't have a push to do so. We need to counteract the doomerism that liberals and leftists are wallowing in right now and let them know what we can all do instead.",
            "score": 31,
            "replies": [
                {
                    "author": "MysticMind89",
                    "body": "Are you familiar with the youtube channel called \"The Line\"? It's owned by youtube Atheist Jimmy Snow, and has several different shows, mostly focusing on secularism and Atheist activism. They were really pushing for people to vote for Harris in the last US Elections, not because Harris was good (far from it), but because the alternative was *infinitely worse.*\n\nI bring this up because they are the crowd who can be pushed left, if they are not already Anarchists/Libertarian Socialists. Aron Ra, renown youtube anti-creationist, has repeatedly expressed extreme dissatisfaction with the Democrats, rightly acknowledging that they are centre-right at best. This is especially true for the hosts of the Trans Atlantic show, which is focused on trans rights and advocacy. \n\nThese are the baby leftists who can be swayed to join us in fighting back against Christian Nationalism.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Jimmeh1337",
                            "body": "I agree, I think this election season has disenfranchised a lot of people from the Democrats. They're going to go somewhere, and if we don't convince them otherwise it's going to be to the right for a lot of them. Either to the Republicans directly or to an even more conservative Democratic party.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "its_skunx",
                    "body": ">especially Democrat leaning liberals\n\nAt this point, abandon the blue team. Focus on the 20,000,000 people that sat the election out, not liberal Democrats who will never ever be convinced to vote for anything other than genocidal capitalists like Holocaust Harris or Genocide Joe.\n\nLeftists and anarchists have been saying *for years* to reach out to Dems, and they only ever follow their bloodstained party line in the end.\n\n**STOP** trying to collaborate with people you’ll never convince if you haven’t by now.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MysticMind89",
                            "body": "The problem is that those who didn't vote allowed Trump to win, and look where that's gotten us. Electoral politics twists our arm and forces us to participate in the Trolly problem, whether we like it or not. Voting will not solve our problems, but it will stop the worst reactionaries getting power. We just need to realise that it's one action amongst a plethora of other more direct actions in the long term.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "its_skunx",
                                    "body": "So we’re back to this: blaming nonvoters instead of the party for not having a better platform. Why not blame Democrats (like half the people in these leftist subs) for not pushing their party left like they said they would?\n\nWhatever. Good luck with your revolution before climate change becomes irreversible in a few more years. After that, nothing matters.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MysticMind89",
                                            "body": "Ah yes, good old Doomerism. Whoever said we can't blame both the Democrats for putting up a none existent defence \\*and\\* acknowledge that not voting for them got us Trump, who is without question worse in ever conceivable way?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Politics-Allowed3",
            "body": "I'm currently writing a sci fi novel that is, basically a more violent and ideologically diverse version of Ursula K. Le Guin's The Dispossessed. The book basically is \"The Anarchist planet is good, the Fascist planet and the Capitalist planet are bad.\"\n\nI'm not surprised that no amount of queer representation and leftist themes will prevent a growing right-wing audience that will Orwell me, if you catch my drift.\n\nBut anyway, with all this said I'm extremely sorry to black pill you but I'm totally aware that best case scenario if this book gets big I am: spreading awareness so my fans can spread awareness so their fans can spread awareness, so their fans can spread awareness so their fans can spread awareness so their fans can-\n\nYou get the picture.\n\nMoney and/or doing violent shit is the only way literally any political ideology works and any disagreement to this obvious fact, is a level of cope that would make a Law of Attraction new ager say \"Dude I think you're being a little too optimistic.\"",
            "score": 13,
            "replies": []
        },
        {
            "author": "Disastrous_Visit_778",
            "body": "be the change you want to see",
            "score": 19,
            "replies": [
                {
                    "author": "MysticMind89",
                    "body": "\\^This",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Instruction-3653",
            "body": "It's really about creating hardcore left-wing propaganda. That shouldn't really be the goal.\n\nThe goal is to simply educate people on Anticapitalist and Antistatist ideas and communicate to them what Socialism, Communism and Anarchism is without, explicitly naming them by name. \n\nIt doesn't have to explicitly be left-wing propaganda. Simply educating people on the collective owners and free association of the means of production is effective enough.  Educating them about mutual aid, etc. \n\nSimply saying that we need to create dogmatized left-wing propaganda isn't really too attractive to normal everyday liberals, because most people that aren't revolutionary or radical are liberals, populist and centrist. And It's even harder with conservatives.\n\nWe shouldn't be focused on competition with right-wing Libertarians on who has the best propaganda. But rather just teaching Revolutionary and Radical ideas without giving it a name.",
            "score": 8,
            "replies": [
                {
                    "author": "MysticMind89",
                    "body": "Well, at its core, propaganda is just media that's made to try and convince the viewer to follow a particular POV. Consider how feelings towards the KKK changed when they were the antagonists of Superman radio shows. I'm not saying propaganda is the point of what we do, rather it's a necessary tool in combating information.\n\nPeople like Matt Walsh are now in charge of the state and present an immediate, direct threat to trans people. Considering how much of his own propaganda he pushes, even when his arguments are objectively terrible, it feeds into the cycle of conformation bias for those already prone to bigotry.\n\nThe Democrats refused to commit to protecting human rights, and so they lost the election since people didn't think there was any point in voting. Anarchists on similar subs to this have already fallen into that trap, and we are paying the price.\n\nI'm not trying to pin the blame on anyone besides the fascists for being fascists. But the longer we let them control the narrative, the longer trans people are going to be easy scapegoats for broader culture wars that maintain social hierarchies.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ok-Instruction-3653",
                            "body": "Yea I agree we do need propaganda, I just feel like we shouldn't dogmatize our propaganda and force it down people's throats. And we shouldn't get caught up in competition with the right on who can dogmatize their propaganda the most. The goal of our propaganda should be to educate people, and not scare them off with Revolutionary/Radical vernacular they won't understand.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SapphicPirate7",
            "body": "Yups. I'm thinking back to all the months where there were fucking endless Trump signs and so few Democrat ones. And the consensus I saw was that people were scared of what would happen if they showed support publically. That doing anything other than quietly voting and occasionally arguing was dangerous and Trump would lose anyway. So why risk being the target of sore loser fascists? \n\nWe need to be vocally pushing back all the time. Stickers, flyers, book clubs, graffiti, EVERYTHING possible to shut down the fascists and make sure people are seeing what's actually going on.",
            "score": 8,
            "replies": []
        },
        {
            "author": "GenericPCUser",
            "body": "Left wing ideology does not serve the interests of capital, and so capitalist interests will never allow leftists to have a platform on spaces they control unless it can be defanged and sold back to the masses in a harmless form.\n\nThis is why fascists can openly call for the torture of immigrants and execution of queer people and receive the full protection of \"freedom of speech\" but leftists who suggest that rich people shouldn't exist and that violent overthrow of capitalism is justified get put on an FBI list.",
            "score": 4,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "propaganda of the deed\nsharpie-ing/tagging\nadbusting\nflyering/wheatpasting\nzine distro\n\nSpeaking of wheatpasting, has anyone had any luck with putting wheatpaste in a smaller and more portable container?",
            "score": 4,
            "replies": [
                {
                    "author": "lovealways-har",
                    "body": "Yeah im trying to figure out a good wheatpaste system lol. And i have been making and distributing zines",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Capital_Flatworm_170",
            "body": "Cyberpunk sci-fi seems to have perfectly predicted the character of our techno-oligarchy but the classics often lack an economic focus. Anyone working on correcting that?",
            "score": 4,
            "replies": []
        },
        {
            "author": "StrawbraryLiberry",
            "body": "I agree. And we are way cooler than them, so we have that going for us.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Healter-Skelter",
            "body": "I just watched The End of St. Petersberg, a Soviet propaganda film commissioned to celebrate the 10th anniversary of the Bolshevik revolution. And after the movie ended, all I could think was *if this came out today, it would be a paradigm shift for the way the American public thinks*.\n\nThe opening scene is a man forced to work the fields while his wife dies of labor. His family, his neighbors can’t afford bread. The factory workers eventually go on strike, and the protagonist rats out the strike leaders in order to get a voucher for work. He later regrets his decision and has an amazing standoff with his boss and the company’s major shareholder, before joining the Red Army.\n\nViolence breaks out when the Bourgois police try to suppress the workers, escalating into a full-on civil war. Brutal scenes of warfare are intercut with images of stock prices soaring in the Russian stock exchange. Text on the screen reads something like \n\n**“The workers of these cities die are bought and sold by the stock market … The people DIE for the stock market.”**\n\nThe movie ends with the Bolshevik victory over the White Army and the starving woman at the beginning handing out bread—of which she now has a sirplus—to tired soldiers and strikers who have siezed the means of production and taken the power into their hands.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RadonJournal",
            "body": "We created an entire [anarcho-sci-fi prose/poetry journal](https://www.radonjournal.com/) to help get the message out. Because humans learn the most through powerful stories that both entertain and make you think deeply. \n\nThe last four years we've been putting expressly leftist work out into the public consciousness. But it's hard to compete against billionaires when you have a $0 marketing budget. But we keep doing it because it's important, like you said.",
            "score": 3,
            "replies": [
                {
                    "author": "lovealways-har",
                    "body": "Excited to find that radon. Cool. Browsing. Looks awesome",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Intanetwaifuu",
            "body": "Graffiti, stickers, wheatpaste \nI absolutely agree, \nCover your faces and ID features and let’s get creative!!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "I also feel prompted to add that certain activities might now carry heavier sentences if you get caught, and to mention that prison is an increasingly dangerous place to be for disabled and LGBTQIA+. I was incarcerated for 6 months before over something impulsive and my life was ruined afterward. Sometimes this knowledge is not even enough for me to stop ideating about doing some lone ranger shit.\n\nMy stepdad told me never to do things alone no matter what. That chaps my ass to this day because I want to satisfy my destructive rage. I'm fucking mental and he was correct.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Intelligent_Bike_642",
            "body": "One area the left struggles with is presenting issues in our own words. Liberal circles spend their effort enforcing vocabulary amongst themselves, but the general public is familiar with most far left ideas through right wing outrange.   \nRight wing groups are very good at [mainstreaming](https://youtu.be/Gq0ZHgKT2tctheir) their own terms which effectively mainstreams the ideas that inform the terms. They are also good at co-opting leftist terms which makes it harder for lefty groups to communicate.  \nPropaganda to spread the ideas is important *and* we need to improve our defense.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WizWorldLive",
            "body": "Make it. Support those already making it—like Democracy Now!, & Democracy@Work",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/opfornorth - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DamnHippiePNW",
            "body": " We need more Independent and Left Wing media. Right Wing has a strong hold on talk radio, tv news and podcasts. Support your local and national independent and left wing media:\nhttps://en.m.wikipedia.org/wiki/Alternative_media_(U.S._political_left)",
            "score": 1,
            "replies": []
        },
        {
            "author": "sqeptyk",
            "body": "Last I checked, anarchy was against all government.  Voting is indeed useless.  Art won't change anything.  What Luigi did barely made an impact.",
            "score": -1,
            "replies": [
                {
                    "author": "MysticMind89",
                    "body": "Well ignoring material reality in front of us won't help us in the slightest either, so here we are.\n\nI'd love to know what you think we should do besides the nothing you've suggested so far.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "author": "its_skunx",
                    "body": "Nothing wrong with refusing to vote. Those anarchists don’t make other anarchists look bad. Many influential figures have preached against voting, especially for capitalist parties.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "watcher45",
            "body": "Leftists have propaganda its called corporate media.",
            "score": -4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Actively asking for propaganda? I don’t think I have words to describe this level of delusion.",
            "score": -2,
            "replies": []
        }
    ]
}