{
    "title": "Luigi will be using fundraiser money for his defence",
    "author": "spongebob_quarepants",
    "subreddit": "Anarchism",
    "rank": 235,
    "score": 1615,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 101,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ilk18t/luigi_will_be_using_fundraiser_money_for_his/",
    "id": "1ilk18t",
    "selftext": "\"Luigi is aware of the fund and very much appreciates the outpouring of support. My client plans on utilizing it to fight all three of the unprecedented cases against him,\" Karen Friedman Agnifilo, an attorney for Mangione, told Newsweek in a statement on Tuesday.\n\nThis quote can be found here: \n\nhttps://www.newsweek.com/luigi-mangione-suspect-unitedhealth-ceo-murder-donations-jail-2025909\n\nThe fundraiser can be found here:\n\nhttps://www.givesendgo.com/legalfund-ceo-shooting-suspect",
    "comments": [
        {
            "author": "comic_moving-36",
            "body": "His current address is \n\n\nLuigi Nicholas Mangione 52503-511\n\nMDC Brooklyn\n\nMetropolitan Detention Center\n\nP.O. Box 329002\n\nBrooklyn, NY 11232 \n\n\nIf you've never written a letter to a prisoner, this site has a bunch of useful information and the addresses of people locked up from the George Floyd Uprising.\n\n\nhttps://uprisingsupport.org/further-resources/",
            "score": 449,
            "replies": [
                {
                    "author": "Salmon_Of_Iniquity",
                    "body": "Gonna take time to read up on how to do this. No need to get anyone in trouble.",
                    "score": 70,
                    "replies": []
                },
                {
                    "author": "Salmon_Of_Iniquity",
                    "body": "Sweet!!!! Thanks!!!",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "exneo002",
                    "body": "Thank god he’s not in Rikers.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "StorySeldomTold",
                            "body": "Rikers is either closed now or closing this month.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "EmotionalCHEESE",
                                    "body": "Delayed until 2027",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "StorySeldomTold",
                                            "body": "God damn",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "scattermoose",
                            "body": "State prison vs federal, I suppose",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "exneo002",
                                    "body": "Wouldn’t he just be in jail?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "scattermoose",
                                            "body": "That’d be rikers, but since he’s got that terrorism charge, he’s in the big federal jail they moved to after Epstein….died",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cjbrannigan",
                    "body": "👍👍",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WashedSylvi",
            "body": "Luigi gives me hope that maybe I can see old age",
            "score": 85,
            "replies": []
        },
        {
            "author": "Bolinas99",
            "body": "watch the higher ups kill this post... \n\nalready donated!",
            "score": 186,
            "replies": [
                {
                    "author": "spongebob_quarepants",
                    "body": "I hope they let it be. \nThanks for supporting him!! ",
                    "score": 90,
                    "replies": []
                },
                {
                    "author": "Reddit-Username-Here",
                    "body": "That’s an interesting interpretation of pacifism",
                    "score": -142,
                    "replies": [
                        {
                            "author": "Bolinas99",
                            "body": "not sure you have your glasses on; there's a prefix to that flair... pacifism is the goal, getting there OTOH may require non-peaceful measures.\n\nu ever heard of oligarchs backing down b/c a bunch of people staged a peaceful sit-in? Nope; the oligarchs just had these 'peaceniks' arrested while corporate media labeled them \"un-American, terrorists, etc\"",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Reddit-Username-Here",
                                    "body": "If pacifism is defined by the end and not the means, all anarchists are pacifists so your label is pointless. Historically, the reason why some anarchists adopted the pacifist label was to signal that they were opposed to violent means of change.\n\nAs to the second part of your comment, I’m not trying to argue about whether or not nonviolent means are effective. I’m just saying it’s quite silly to justify murder while calling yourself a pacifist.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "Bolinas99",
                                            "body": ">  calling yourself a pacifist\n\nfor the n-th time that's not what \"I'm calling myself\" -  pls read the entire phrase. Thx.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Reddit-Username-Here",
                                                    "body": "Anarcho-pacifism is an actual historical school of anarchism with pacifist beliefs. You didn’t engage with my point that the people with that specific label were and are opposed to violence as a means of change.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dr_bitchcraft666",
                                            "body": "jUsTiFy MuRdEr",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Worried-Rough-338",
                            "body": "Who said anything about pacifism?",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "TheDarkestBoredom",
                                    "body": "The first commenters user flair",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Worried-Rough-338",
                                            "body": "Ahhhh, gotcha.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mammoth-Result5555",
                            "body": "Technically harm reduction so it falls under some schools of pacifism",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "Bolinas99",
                                    "body": "he assumes every pacifist supports drum circles, sit-ins and waiving flowers to gently nudge oligarchs to \"do the right thing\" 🤣\n\npacifism/peace is the *end goal*; fascism has arrived meanwhile and you don't bring carnations & indica to *this* particular fight 😉",
                                    "score": 41,
                                    "replies": []
                                },
                                {
                                    "author": "Reddit-Username-Here",
                                    "body": "Could you point me to a school of pacifism that allows for the killing of non-combatants for harm-reduction purposes?",
                                    "score": -27,
                                    "replies": [
                                        {
                                            "author": "dr_bitchcraft666",
                                            "body": "fucking LMAO at describing the CEO of United healthcare as a “non combatant”. You must be… *very* confused.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Reddit-Username-Here",
                                                    "body": "He’s not a combatant in a war, which is generally the only exception the more permissive forms of pacifism are willing to make. Note that this doesn’t mean he was a good person, or not culpable for the deaths of thousands of people.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Ditherkins2",
                                                            "body": "Class War is War. Health Care CEOs take actions/make decisions that lead to the deaths of (almost exclusively) working class people in exchange for profit. In the context of class War, that is a lethal assault as surely as firing a gun or calling in an artillery strike. Since the working class lacks the means to reply with a counter assault using the same type of force (which isn't a requirement anyway), replying with asymmetrical force is completely acceptable. This is War.",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "dr_bitchcraft666",
                                                            "body": "how pointlessly and ridiculously pedantic you are. I can only assume you don’t have a crumb of understanding about the situation. what are you even doing here? what is it you think you are accomplishing? \n\nhe’s responsible for and has profited off of the deaths of many, many people. do you not know who the guy is or what?",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Chill-The-Mooch",
                                            "body": "Non-combatant?  Where exactly do you see this war being waged?  Who are the combatants in the war against the health of the American people?",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Reddit-Username-Here",
                                                    "body": "Forms of pacifism which allow for some violence are very clear about the conditions for justifying it, which would usually be that you’re a soldier in a just war (see just war pacifism). There isn’t a literal war being waged on the American people.\n\nI agree that healthcare CEOs are not good people and may even be justifiably killed. All I’m saying is that words have meanings and a self-described pacifist holding a pro-violence stance is ironic.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "awsompossum",
                                                            "body": "No war but class war bb",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AutoModerator",
                                                    "body": "Hi u/dr_bitchcraft666 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mammoth-Result5555",
                                            "body": "I wouldn't say pacifism is only applicable to a battle or war context. In this case he was a commander, rather than just a combatant.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wild_ty",
                            "body": "r/lostredditors",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "redeyesetgo",
            "body": "Question. Is Luigi permitted to communicate with the media. Is him not appearing in audio interviews a defense decision?",
            "score": 33,
            "replies": [
                {
                    "author": "spongebob_quarepants",
                    "body": "That seems very likely, and would be a normal instruction for the legal team to give the defendant in a case like this. \nBut that is something we cannot know for certain without confirmation from him or his legal team. ",
                    "score": 37,
                    "replies": [
                        {
                            "author": "redeyesetgo",
                            "body": "I can understand that to a degree but I would also think that a good legal strategy in this situation would involve staying top of mind in the public consciousness.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "spongebob_quarepants",
                                    "body": "People are still talking about him over the world, this is somewhat clear even if you don't use social media a lot, in spite of well documented suppression by the media related to this.\nTaking a scroll through the messages left on his fundraiser many people state which countries they are donating from. \nThat aside, I trust that among the vast experience of his legal team is astute judgement on matters concerning public consciousness in relation to Luigi. \nWe can all do our part to keep this top of mind for people too, we just need to think; who can we reach, and how, and let's get to it! :)  ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RadishPlus666",
                    "body": "He has very limited communications. Most of the letters aren't getting to him either.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "redeyesetgo",
                            "body": "Is that a normal thing for a prisoner pre trial?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "RadishPlus666",
                                    "body": "I don't actually know. It may depend on the charges. From what I've read, thousands of people have written him yet I haven't heard of anyone getting responses, and the people doing the fundraiser are having a hard time contacting him and have only been able to talk to his lawyers.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "redeyesetgo",
                                            "body": "Seems a bit weird. You would think a good legal strategy would include staying top of mind in the public consciousness.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "WingValuable6750",
                                            "body": "Some people actually got a response from him ,some even posted it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StoopSign",
            "body": "Yeah his givesendgo has $292k in it out of a $500k goal. Please use givesendgo for your fundraising because GoFundMe can and will seize your funds if given the order to. It happened to The Grayzone",
            "score": 18,
            "replies": []
        },
        {
            "author": "FactCheckYou",
            "body": "so many things are off about this whole story\n\nfirst of all, he didn't do it, the shooter was a different person, Luigi is clearly a Patsy\n\nthen there's the fact that he is from a rich family from Pharma money\n\nthen there's the fake 'manifesto' etc and the push to label him as a 'terrorist' \n\n**do not be surprised if they end up charging anyone who supports his defence fund with 'financing terrorism'**",
            "score": 5,
            "replies": [
                {
                    "author": "sensualist",
                    "body": "Yeah I was surprised people are attaching their names to their donations. Anonymous or bust, imo",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "EKsaorsire",
            "body": "His lawyers took his case pro bono. One of them represented Ramzi Yusef. They have money. He shouldn’t have to use fundraiser money to finance them. I hate “movement” or “high powered” lawyers. \nSource: had both, got treated like shit by both, got halfway robbed by both",
            "score": 29,
            "replies": [
                {
                    "author": "spongebob_quarepants",
                    "body": "His lawyers did not take his case pro bono. \nThis is an old rumour without foundation that serves to undermine financial support for him, whether that's the intent or not.",
                    "score": 103,
                    "replies": [
                        {
                            "author": "EKsaorsire",
                            "body": "Dude she is an ex DA with a MEGA private practice. I’ve been in the legal game long enough to not need “unfounded rumors”. She would’ve cost over a million to retain and they don’t take payment plans. This is a status case for her. He needs support endlessly cause he may be fighting these cases for 3-5 years. His LAWYERS don’t need shit.\n\nGetting downvoted for suggesting that our money should go to the actual prisoner instead of his exceedingly wealthy media starved lawyer. Got it!",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "Das_Mime",
                                    "body": "> I’ve been in the legal game long enough to not need “unfounded rumors”\n\nIf you've been in the legal game at all you should know the difference between supposition and actual evidence. You have the former, not the latter.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "ridetherhombus",
                                    "body": "his family is wealthy and connected\n\n> His LAWYERS don’t need shit.\n\nyou might not know this, but a lot of rich people still want more money. even the people with hundreds of billions.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "EKsaorsire",
                                            "body": "Yes, this is my point. They don’t need more to fight this case, they WANT more. Thats why I want money to go to the PRISONER. Not the ultra wealthy lawyer",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "tysaslut",
                                                    "body": "As fucked up as it is,  my understanding is that there is a strong correlation between amount of money spent on the defense and it's success. The lawyers shouldn't need more money,  but increased funding absolutely CAN be to Luigi's benefit. The more resources available to his defense team, the more likely they are to do their job well.",
                                                    "score": 17,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "onion_flowers",
                                                    "body": "It's going to him by means of his defence??? I think you can donate directly to his commissary account if you'd prefer that lol",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "on_doveswings",
                                    "body": "I feel like this quote suggests it's not pro bono:\n\n\"Luigi is aware of the fund and very much appreciates the outpouring of support. My client plans on utilizing it to fight all three of the unprecedented cases against him,\" Karen Friedman Agnifilo, an attorney for Mangione, told Newsweek in a statement on Tuesday.\n\nhttps://www.newsweek.com/luigi-mangione-suspect-unitedhealth-ceo-murder-donations-jail-2025909",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "EKsaorsire",
                                            "body": "This convo is kinda dead..but what I was saying was there is nothing suggesting there was a fiscal retainer. \n\nWe know that she was is MEGA lawyer. That other lawyers on his case include those that defended Ramzi Yousef. These are lawyers with million dollar retainers, huge HUGE fees. \n\nWe also know lawyers will often take on high profile cases to boost their profile and resume. Her husband represented the head of the IMF. \n\nI’ve had lawyers who took me on and then did fund raisers to supplement the work they agreed to already do. Of course Luigi would say he wants the fundraiser to go to her, cause she has told him that’s what he needs to do to benefit his case the most. \n\nPeople on this sub who have never had a lawyer, never faced serious time, never done anything and then all of a sudden being experts is frustrating as hell. \n\nFunds should go to Luigi. He should get to make decisions without the fear of losing his legal representation. He is experiencing hell, not her. He is facing life or death, not her. He will do DECADES in ADX. \n\nBeing a lawyer isn’t expensive, having one is. Filing forms cost a couple hundred dollars. An expert will cost a couple thousand. Several experts would cost 10-20k \n\nThe state covers all forensic testing. The state covers all STATE experts. All the expensive parts of paying for this case will just be her charges. Her hourly is about $1200. \n\nThat is all I meant.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "PMmePowerRangerMemes",
                                            "body": "The point is they have enough. Are you an anarchist or not?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PMmePowerRangerMemes",
                                    "body": "This is a good point and I think you're just getting downvoted for yucking people's yum",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SixGunZen",
                    "body": "Staying out of prison can be pretty expensive.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Ill_Froyo8000",
                    "body": "Nobody took his case pro bono🙄",
                    "score": 20,
                    "replies": [
                        {
                            "author": "EKsaorsire",
                            "body": "Yes..they did. These are huge time lawyers.\nThey want status by being attached to huge name cases. They already have it and want more of it. If she had an actual fiscal retainer then there wouldn’t be a need for a fundraiser. She’s an ex mega cop turned private lawyer",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "Ill_Froyo8000",
                                    "body": "That’s false. Luigi’s family is more than likely paying for his legal team. Luigi probably told his lawyer that he wants to utilize the funds to help pay for some of it to help his parents out. His legal expenses will be in the MILLIONS when all is said and done",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "EKsaorsire",
                                            "body": "You’re saying things like “more than likely” “probably”…if that’s what you want to base your opinion on then great. I’ll use lived experience and still being in the legal business to base my understanding on. \nShe is a high paid lawyer. She took his case without a fiscal retainer. She and her husband are MEGA lawyers who have a MEGA law firm. We both agree the defense will cost millions but that is because of her charges, not the actual defense.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "RadishPlus666",
                                                    "body": "What source do you have? From what I have read, his lawyers are being paid and of course, we would assume his parents paid the fiscal retainer since his family has money. His family is not talking to the media and want to stay out of the spotlight. His first lawyer in Penn. refused to say who was paying Mangione's legal fees. I read about this when they first took the case, so I am not sure where I read it, and I don't think anyone knows for sure how his fees are being paid, except for you (according to you), so please share your source.",
                                                    "score": 14,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Ill_Froyo8000",
                                                    "body": "You don’t become a high profile lawyer by working for free. You don’t have access to ANY contract these lawyers have with Luigi. I dont care about your “lived experience”",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "PMmePowerRangerMemes",
                                                            "body": "> You don’t become a high profile lawyer by working for free.\n\nbro what sub am I even on\n\nwho cares about how she became a lawyer? how is that relevant at all? we're in the present, not the past. and in the present, she a) doesn't need the money, and b) this case is literally an *investment* in future earnings for her. \n\nsrsly, how the fuck are we defending Mrs Mega Lawyer on r/anarchism like \"uh even rich people need to make a buck!\"\n\nno, they literally do not. they're already rich.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "EKsaorsire",
                                                            "body": "Well I think maybe that it may perhaps be something other than what you maybe think I believe.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "comityoferrors",
                                                                    "body": "imagine being snarky at someone for using appropriate qualifiers for something that is likely but not certain, while insisting you know the answer with no source at all",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "wasn't there already a thing about him NOT using any of the fundraising stuff? i wouldn't trust this",
            "score": 4,
            "replies": [
                {
                    "author": "Ill_Froyo8000",
                    "body": "His lawyer made a statement that he is utilizing the funds",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Cerberus_RE",
                            "body": "Where?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Ill_Froyo8000",
                                    "body": "https://www.newsweek.com/luigi-mangione-suspect-unitedhealth-ceo-murder-donations-jail-2025909",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RadishPlus666",
                    "body": "His first lawyer in Pennsylvania said he was not utilizing the funds from the fundraiser. Now he has different lawyers in NY.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "poeiradasestrelas",
            "body": "Why does he have three cases against him? Wasn't all that because of a single event?",
            "score": 1,
            "replies": [
                {
                    "author": "cumminginsurrection",
                    "body": "He's being prosecuted by the state of New York and by the feds for the killing. Which are two separate trials. And also by the state of Pennsylvania for illegal firearm possession/transport and using a false identity.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mood-park",
            "body": "Thank you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Onefoot13",
            "body": "He is a patsy",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Lord_ofHate",
            "body": "Luigi we need you, the CEO's have taken over the world. We need you to talk to them nicely.",
            "score": 1,
            "replies": [
                {
                    "author": "spongebob_quarepants",
                    "body": "😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Salty_Oil4130",
            "body": "LM should represent himself at this point.",
            "score": -17,
            "replies": [
                {
                    "author": "Das_Mime",
                    "body": "Representing yourself is a terrible idea in general, but *especially* for someone who is not at all an expert in the law and who is going to get the book thrown at them by both state and federal prosecutors.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Salty_Oil4130",
                            "body": "Thanks ♥️",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brilliant-Rise-1525",
            "body": "Disgusting. Another fucking griffter.",
            "score": -48,
            "replies": [
                {
                    "author": "MrScandanavia",
                    "body": "If you were facing the death penalty, and people willingly donated to your defense fund, would you not use the money?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Brilliant-Rise-1525",
                            "body": "I find it hard to put my self in the boots of a spoilt technoliberal lone wolf tbh.",
                            "score": -41,
                            "replies": [
                                {
                                    "author": "Das_Mime",
                                    "body": "in 1870s Russia you woulda been arguing against trying to break Kropotkin out of jail because he was born into an aristocratic family",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Brilliant-Rise-1525",
                                            "body": "No, because he was an anarchist. This brat was not acting for others. I admire the deed in itself but not him.\n\nOnly on reddit could somebody have the lack of knowledge to compare the two.",
                                            "score": -14,
                                            "replies": [
                                                {
                                                    "author": "Das_Mime",
                                                    "body": "idk what to tell you other than that your relationships of solidarity shouldn't exclusively be with professed anarchists",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AutoModerator",
                                                                    "body": "Hi u/Brilliant-Rise-1525 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Diligent_Bag4597",
                                                    "body": "Have you heard of anarcho-primitivism? Ted K? The man was partly inspired by his book. ",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "PuffGetsSideB",
                                                            "body": "Kaczynski was not an anarchist. He may not have been a fan of civilization, but he was definitely a fan of hierarchy and had deep disagreements with anprims:\n\n>In the first place, part of the GA Movements energy is deflected away from the real revolutionary objective — to eliminate modern technology and civilization in general — in favor of the pseudo-revolutionary issues of racism, sexism, animal rights, homosexual rights, and so forth.\n\n>In the second place, because of its commitment to these pseudo-revolutionary issues, the GA Movement may attract too many leftists — people who are less interested in getting rid of modern civilization than they are in the leftist issues of racism, sexism, etc. This would cause a further deflection of the movements energy away from the issues of technology and civilization.\n\n>In the third place, the objective of securing the rights of women, homosexuals, animals, and so forth, is incompatible with the objective of eliminating civilization, because women and homosexuals in primitive societies often do not have equality, and such societies are usually cruel to animals. If one’s goal is to secure the rights of these groups, then ones best policy is to stick with modern civilization.\n\n>In the fourth place, the GA Movements adoption of many of the soft values of modern civilization, as well as its myth of a soft primitive utopia, attracts too many soft, dreamy, lazy, impractical people who are more inclined to retreat into utopian fantasies than to take effective, realistic action to get rid of the technoindustrial system.\n\n[https://theanarchistlibrary.org/library/ted-kaczynski-letter-to-a-turkish-anarchist#toc16](https://theanarchistlibrary.org/library/ted-kaczynski-letter-to-a-turkish-anarchist#toc16)",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Diligent_Bag4597",
                                                                    "body": "Thanks for the link, I read some of it. But so far I do not see it pointing to him not being an anarchist, no?\n\nIn fact, these quotes are anarcho-primitivist, are they not? \n\n*“I myself was completely dissatisfied with such a life. I knew what I wanted: to go and live in some wild place. But I didn't know how to do so. In those days there were no primitivist movements, […]”*\n\n*“Thus, the problem of civilization can be equated with the problem of technology. The farther back we can push technology, the father back we will push civilization. If we could push technology all the way back to the stone age, there would be no more civilization.”*\n\n*“The problem of civilization is identical with the problem of technology.”*\n\nI’ll read more and edit this comment if anything. ",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Brilliant-Rise-1525",
                                                                            "body": "These people are desperate people who are, if anything, symptoms of a sick society.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "unirorm",
                    "body": "That's Kik girlfriend, who you thought she actually liked you after you sent her $30. Don't let past traumas blur your judge Brillant-Rise-1525.\n\nNow RISEE! 🙌",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Brilliant-Rise-1525",
                            "body": "LOLS",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}