{
    "title": "Eight Things You Can Do to Stop ICE",
    "author": "CrimethInc-Ex-Worker",
    "subreddit": "Anarchism",
    "rank": 212,
    "score": 217,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 5,
    "url": "/r/CrimethInc/comments/1incpw7/eight_things_you_can_do_to_stop_ice/",
    "id": "1incq5t",
    "selftext": "",
    "comments": [
        {
            "author": "J4ck13_",
            "body": "Also here's an [ICE reporting site](https://juntosseguros.com/) that we should all bookmark and share imo.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ComradeRaptor420",
            "body": "M - Mutual aid organization \n\nE - Education \n\nL - Learning new tactics as needed\n\nT - Training for self and community defence",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -6,
            "replies": [
                {
                    "author": "CrimethInc-Ex-Worker",
                    "body": "Some of the people you are talking about have been in the United States for decades, since they were small children. You are calling for incredible violence to be directed against them and those who depend upon them, for them to be sent to places they've never lived, where they may not even speak the language. We're talking about millions and millions of people in that situation, people who are a part of your community.  \n  \nYou talk about a \"slap in the face\" as a metaphor, but you are calling for much more violent and destructive things to happen to people who are hurting no one. This either reflects your complete ignorance of the reality of the issue or a desire to see suffering inflicted on others that can only be described as evil if the word evil has any meaning at all.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "SubterFugeSpooge",
                    "body": "Citizenship is a made up label and one that takes literal decades to attain legitimately (for US immigrants) when it should reasonably take no longer than a tenth of that. \n\nThere are two types of people: those who say \"I did it the hard way so everyone else should too\" and those who say \"I did it the hard way and I hope nobody else has to go through what I went through.\"\n\nBreaking the laws and abetting the law-breakers in this instance is the moral and ethical course.",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}