{
    "title": "I’m very done with reddit and social media how can I keep up with this type of community?",
    "author": "None",
    "subreddit": "Anarchism",
    "rank": 173,
    "score": 78,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iq8k2p/im_very_done_with_reddit_and_social_media_how_can/",
    "id": "1iq8k2p",
    "selftext": "Exhausted watching white supremacy continue to keep folks divided and I need a break. Is there a way to keep learning about this vibrant content without utilizing Reddit or similar?",
    "comments": [
        {
            "author": "Hotbones24",
            "body": "Search for your real life anarchist communities and link up. If you just want to read, Anarchist Library is vast and growing and itsgoingdown.org has great articles, events, and podcast links",
            "score": 37,
            "replies": [
                {
                    "author": "None",
                    "body": "Thank you!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "FrontRow4TheShitShow",
                    "body": "Love itsgoingdown!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thatjoachim",
            "body": "Check out the Fediverse. Kolektiva.social. Good people, good content, less toxic than Reddit.",
            "score": 39,
            "replies": [
                {
                    "author": "major_calgar",
                    "body": "I got mastodon a few days ago and was looking for a leftist/anarchist instance. I can’t find this one - there’s a page on Google that links to the mastodon homepage, but I can’t find it on the mastodon app.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "thatjoachim",
                            "body": "Ok, you should be able to create an account on Kolektiva, then enter manually the domain (kolektiva.social) in the Mastodon app, that should do it. There’s a LOT of servers for Mastodon, and they’re not all on the app\n\nhttps://kolektiva.social/auth/sign_up",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "DearAnnabelleLecter",
                                    "body": "just saw this [https://fossforce.com/2023/07/why-kolektiva-social-is-a-cautionary-tale-for-activists-using-mastodon/](https://fossforce.com/2023/07/why-kolektiva-social-is-a-cautionary-tale-for-activists-using-mastodon/)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Subversing",
                                            "body": "Don't do things on the web that compromise your opsec",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "angrybats",
                            "body": "I've been searching on a few pages and I found there's a total of 0 LGTB+ mastodon instances in Spanish (or vegan, or anarchist, or...). And very few spaces in general where I would be comfortable. So uh, no mastodon for me I guess.\n\nThere used to be more good places a few years ago, I feel. Where did everyone go? I thought everyone would be migrating to the fediverse after seeing how dead are the popular social networks nowadays???",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Thanks!!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Head_Bad6766",
                    "body": "I've had an account for a few years and I have no clue how to find anything in the Fediverse. Bluesky is tolerable and is getting linked to the Fediverse. They seem to boot out trolls pretty quickly and left leaning voices are predominant though not too many anarchists yet.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrimethInc-Ex-Worker",
            "body": "Consider getting a Mastodon account. Consult [crimethinc.com](http://crimethinc.com) for updates.",
            "score": 13,
            "replies": [
                {
                    "author": "None",
                    "body": "Thank you!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "comic_moving-36",
            "body": "sub.media\n\n\nIt's going down (dot) org \n\n\nanarchistfederation.net/\n\n\nlibcom.org/\n\n\nYou can also dig around my post history to find many more links.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Federal_Ad_5898",
            "body": "Thanks all… found loads of good content on mastodon.x",
            "score": 1,
            "replies": []
        },
        {
            "author": "zenmasterdredd",
            "body": "I mean Bluesky might be obvious, but its what a lot of us(anarchists) use to stay up to date, especially with some of our international comrades. Still toxic at times, but it has a MUCH larger \"leftist\" presence than other places online.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FoxOnTheRocks",
            "body": "I have an RSS feed reader that shows me posts from this reddit. Only come on when I feel it is needed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Square_Radiant",
            "body": "Calling Reddit a community feels a bit like calling McDonalds food",
            "score": -11,
            "replies": [
                {
                    "author": "None",
                    "body": "Not only did I not say that, you did not make any recommendations. Did you just want to vent?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Square_Radiant",
                            "body": "Recommendations for what? Books? Reddit isn't a place of learning",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I wish you peace. I’m sorry for whatever is going on in your world.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Hi u/Recent_Caterpillar10 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}