{
    "title": "Errico Malatesta",
    "author": "_VeganSailor_",
    "subreddit": "Anarchism",
    "rank": 97,
    "score": 1244,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 13,
    "url": "https://i.redd.it/t3gm6ekrzrke1.jpeg",
    "id": "1ivw9kx",
    "selftext": "Last year I went to Rome on a trip, so I decided to go to Verano Monumental Graveyard to visit Errico Malatesta grave.\n\"We anarchists do not want to emancipate the people; we want the people to emancipate themselves.\" 🔥",
    "comments": [
        {
            "author": "commitme",
            "body": "was a real one. Mad respect.",
            "score": 66,
            "replies": []
        },
        {
            "author": "falafelville",
            "body": "More graves of historic anarchists, please.",
            "score": 54,
            "replies": [
                {
                    "author": "SyanceSyl",
                    "body": "I recommend listening to the podcast \"Cool People Who Did Cool Stuff.\" Every week the host Margret Killjoy goes a different historical usually anarchist. I have learned the names of many awesome historical anarchists through it",
                    "score": 39,
                    "replies": [
                        {
                            "author": "_shyhulud",
                            "body": "Agreed!! I listen to this podcast almost every week- if I'm not checking out the current episode, I'm going through the backlog. I loved the episodes on Judi Berry, Food Not Bombs, ACT UP, and the Young Lords. So stoked to listen to the Crass episodes from this month too. I've learned so much about historical & modern anarchists, events, and movements and owe nearly all of it to Margaret's awesome storytelling.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "WestwoodSounds",
                            "body": "Whoa, this podcast is distributed by iHeart Media, what a trip. I’ll still check it out though!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Anarcho_Humanist",
                    "body": "I don't have any pictures and I won't be going there anytime soon but Chicago has one: [https://en.wikipedia.org/wiki/Haymarket\\_Martyrs%27\\_Monument](https://en.wikipedia.org/wiki/Haymarket_Martyrs%27_Monument)",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heavy_Metal_Kid",
            "body": "Sick, I had no idea he was buried in Rome! I'll definitely go there next time I'm in town.",
            "score": 15,
            "replies": [
                {
                    "author": "_VeganSailor_",
                    "body": "The Graveyard is HUGE, I recommend using a map or Google Maps to find it. Also I suggest bringing a mosquito repellent. It's a beautiful Monumental cemetery, so I definitely recommend to pay a visit if you are in town. 👍🏻",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "baxwellll",
            "body": "His passing was not in vain, as we that are left carry on the struggle for our ideals, the revolution cannot be killed",
            "score": 11,
            "replies": []
        },
        {
            "author": "Catvispresley",
            "body": "Y'know what I am gonna request 👑ed Anarcho-A with a 🔨 and 〽️ on my grave too (along with certain sentences, a chaos star and a pentagram of course) because that looks badass\n\nR.I.P.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Charming-Score7015",
            "body": "Long time remembered.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Milla_Luth",
            "body": "Speaking of Malatesta, are there any anarchists here who live in Santa Maria Capua Vetere?",
            "score": 1,
            "replies": [
                {
                    "author": "_VeganSailor_",
                    "body": "Nope, I currently live in Tuscany.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}