{
    "title": "Anarchists at the 3-Year Ukraine War Protest in Stockholm yesterday",
    "author": "Eisenblume",
    "subreddit": "Anarchism",
    "rank": 75,
    "score": 1040,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 75,
    "url": "https://i.redd.it/yuhfeyqwc9le1.jpeg",
    "id": "1ixrh0r",
    "selftext": "The flag to the right is the flag of the Free Territories, the anarchist area that was liberated in Ukraine during the Russian civil war.",
    "comments": [
        {
            "author": "tob69",
            "body": "Everyone who hasn‘t yet, should read about Nestor Machno! ✌🏻",
            "score": 54,
            "replies": [
                {
                    "author": "Previous_Scene5117",
                    "body": "Yeah, that's the Ukraine that should be.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cumminginsurrection",
            "body": "A cool as the \"Death to all who stand in the way of freedom for the working people\" flag is, its sadly not an actual anarchist flag but flag of the cossack Svyryd Kotsur. Makhno himself denied the flag was from the anarchists of Ukraine. The anarchists of Ukraine primarily used plain black flags.\n\nI personally have no issue with people still using it (I still have one up on my wall), but seems important people at least know the history of this flag, in spite of it popular pseudohistory.\n\nAlso in general, I feel like many anarchists need to [unlearn a lot of myths and assumptions they have about the \"Free Territory\".](https://www.thecommoner.org.uk/we-carry-a-free-territory-in-our-hearts/)",
            "score": 62,
            "replies": [
                {
                    "author": "Eisenblume",
                    "body": "Thank you for this, it’s really interesting! What a pity such a great term as “Free Territory” is a neologism, though the flag has been used so much by anarchists I feel it is now anarchist whether Makhno considered it such or not.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "SkyBLiZz",
                    "body": "well its an actual anarchist flag now. the movement has long since adopted it",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "LibertyLizard",
                    "body": "Interesting story but the name itself doesn’t seem to be of much importance.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive-Door3726",
            "body": "Based.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shamoorti",
            "body": "The only winners in this war are the arms manufacturers who get to use Ukrainian and Russian people as test subjects for new weapons and to consume the stockpiles of military gear they've produced so they can get new contracts.",
            "score": 8,
            "replies": [
                {
                    "author": "Eisenblume",
                    "body": "I agree, the war must end as soon as possible by making the Russian state pull out of Ukraine and stopping to oppress the Ukrainian people.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Shamoorti",
                            "body": "Russia is undeniably the aggressor here and needs to leave Ukraine, but the contributions of the US and other NATO states to inflaming the conflict are quite significant. The Ukrainian people are paying the price for geopolitical games that they don't control or benefit from regardless of which global powers win this war. It's looking like a fate similar to the US-installed Afghan state is on the horizon for Ukraine with the current trajectory.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Eisenblume",
                                    "body": "I think it is very good when we can get the capitalists to lend their resources to fighting the aggressors. Better that their resources go to Ukraine than to Israel, you know? I don’t trust the US at all - and now Trump has abandoned them, so that is what happened - but all the resources that went to Ukraine did much good in preventing more Buchas and Irpids and Mariupols.\n\nThe Ukrainian government is 1. A government and thus by definition pretty bad and 2. A liberal government which does not serve the worker even a little. But! It is far better than the brutal oligarchic regime that was there before the Orange Revolution and I only wish we anarchists had been even more involved than we were.\n\nI am not an evangelical Christian, I believe there are degrees in hell. And the people of Ukraine rightly struggles against the Russian oppression. If some capitalist governments want to use their resources on that instead of on police and military in their own nations, I say let them.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "_valpi",
                                            "body": "Totally agree. It feels like people often miss that even tho there is no good outcome for people of Ukraine in this war, the bad outcome is still much better than the worst. If other countries help Ukraine, Ukraine would be able to keep most of it's land, rebuild it's infrastructure, cross their fingers and hope that Russia won't attack again.\n\nBut without foreign aid Ukraine would collapse, Europe would get millions of refugees and Russia would get millions of potential soldiers who they could then send to fight on Russian behalf in their next imperialistic expansionist wars (like they did to indigenous people of Siberia/northern Russia/Caucasus or to Ukrainians from Donbass/Crimea).\n\nFirst scenario is still bad, but obviously much better for literally everyone except Russian elites.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Eisenblume",
                                                    "body": "Indeed, I agree. I guess my most selfish opinion for supporting Ukraine is that my country is one that he has threatened to invade next.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bullshitfreebrowsing",
                                            "body": "They prevent people from leaving the country to safety, they kidnap people from safe areas and send them to die to protect corporate interests. The state in Ukraine is not \"better\", there is nothing \"better\" in being kidnapped and thrown to cannon fire. \n\nThis cannot be supported on the false dichotomy of \"Putin or Zelensky\". If you believe the only possibility is a State then you're not an anarchist by definition, but you're actually the opposite and supporting the opposite, as it is on this kind of false choice that Statism stands on.",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Shamoorti",
                                            "body": "Why would capitalists provide all these resources if they don't believe those resources would give them leverage for directly controlling and benefiting from the outcome of the war? \n\nHow does joining a side in a capitalist state vs. capitalist state war help further the anti-capitalist and anti-state struggle?",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "Eisenblume",
                                                    "body": "Capitalists have opinions and beliefs too, they’re not just evil automatons always doing the most evil thing possible. They see an obvious aggressor murdering people in opposition to what they consider “rules-based society”.\n\nAnd the reason for opposing the Russian war of aggression is because they have invaded a nation and are killing its people. Anarchy, to me, is a system of compassion struggling against tyranny at its essence, a political ideology radically in solidarity with the oppressed. In Ukraine, the most urgent oppressor is the tyrant Putin. We know this because that is what the Ukrainian people are telling us. That remains true whatever the US thinks.\n\nIn general, I care very little about what the US government thinks. They oppose most of what I’m in favour of and are in favour of a few things I support. But that doesn’t matter to me.",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "Shamoorti",
                                                            "body": "Capitalists pursue profits and monopolies, and don't do things out of the kindness of their hearts or some kind attachment to a \"rules-based social order.\" Just look up the political contributions of military contractors that are directly funding politicians that do everything in their power to undermine any kind of international rules and accountability.\n\nAll the companies supplying arms for this war benefit from it continuing and escalating. They have a fiduciary duty towards their shareholders to maximize profits and show growth which is directly at odds with working to end the war. Every time a NATO supplied piece of military gear is blown up by Russians, a cha-ching sound plays at the HQs of these companies.\n\nHow do these incentives actually translate to ending the war?",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "Eisenblume",
                                                                    "body": "You make the mistake of believing people think they’re evil. Most capitalists are convinced they are good people. They do things that align with their beliefs about what makes the world better. They’re just wrong. Often in harmful ways that need to be stopped, but if you believe all people except those that think like you are evil and knowingly so, then you will not be a very effective anarchist.\n\nBut let me ask you then, do you think there is no war at all that is worth fighting? Is there no battles that are worthy to take, because there might be capitalists benefitting? Surely there must be, right? The Nazis for example? Or should the US have surrendered to them? Should Poland have? How about the American civil war? Should the North have surrendered to the Confederacy because arms manufacturers benefited from the war? I can’t believe that you do. And then you understand why I support Ukraine.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Shamoorti",
                                                                            "body": "I've never used the word \"evil\" in this thread. I'm pointing out how the incentives that are inescapable and inherent to capitalism influence the actions of those capitalists. Individual feelings and attitudes are meaningless in this context when everything is secondary to creating shareholder value. Capitalists overwhelmingly benefit from the continuation of this war, and will have their profits dramatically cut when the war ends. Given that these companies largely control the states of countries like the US, it's not hard to see why things have gone in the direction they have. \n\nI'm just simply saying that in a war between capitalist states maybe the best option for anarchists isn't aligning with one of the states in the war. This doesn't mean giving up or not fighting back against Russia, but it does mean we should be skeptical of joining forces with and bolstering states. \n\nIt's bizarre to think of the state as one of the primary oppressors and obstacles towards a less exploitative and more free world, but then turn around and risk one's life for the protection of that same state in a way that ultimately lines the pockets of the capitalists. We should be getting organized and building power outside the state.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Previous_Scene5117",
                                    "body": "You get down voted and I don't really get why. I agree with your view. The history is proof to that. Oliver's Stone \"Ukraine on Fire\" shows the trajectory. The movie ends just post maidan, but it is very eye opening from the perspective of today. I know a bit of history of Ukraine and Eastern Europe pretty good last 30 years by just live experience and now it is clear to me that the US used their old stooges of Ukrainian nationalists to take control of the Ukrainian state and pull it out from the Russian influence. This wouldn't happen without consequences. If not for their plan of taking over Ukraine this war wouldn't happen. \nI often hear argument about independent right to self-determination of Ukraine... but please... what kind of self-determination is puch by neo-nazi sponsored by imperialist capitalist state? \nOrdinary Ukrainian people has been caught in that game and in ordinary way have been used to be grinded by the machine of war and that's apply to both sides. \nRead history of OUN, how they were harboured by US, UK, Canada... What were they ideology? Do you know that they still operate and have influence on government of UA. Do you know what connections they have internationally? This is serious scary. The surface of the media reported international politics doesn't show any of that. As the subject of Russian propaganda has removed the subject from discussions with accusations of being under influence of Russian propaganda. They didn't disappear they got stronger and embedded in the structures of the state politics and institutions. This is really dangerous and once the dust of war sets this people will be at lead of strongly militarised and garrisoned state. That's not going to have no influence of EU. Particularly neighbor countries. On the other side is antagonized state with also structures and ideology strongly based in fascism in its own flavor. Dugin etc.... Visions of this guys are beyond any nonsense western nazis are coming up with on pair with only the US now... Mixture of  religious fanaticism and extreme capitalism.\nHave to see beyond whatever dramatic narrative of fight for freedom and democracy we have been sold. This is more debt, more enslavement and despair. Not prosperity. One thing Zelenskyy said which must have frozen Trumpolini I agree with... \"You will feel it\" ... No one is immune to it and it will affect everyone. I see people in the west being so remote from it like... It is going to solve itself, it will not. The long tension is now in full confrontation and the spiral is unwinding after long time of pressurising. \nThinking in category of free westen world authoritarian east is over. There is no more good and bad guys. Looking at the right wing leaning of countries in EU it is evident that this is irreversible now. It has to end in catastrophe this is the only way for people to sober up. No amount of talk and explanation will do. And finally for Russia being aggressor..It doesn't really matter. And what? What force in the world will do anything about it? They can stop them somewhere in Ukraine for now. But what would convince them to stop there? What Russia has to loose right now? Reputation? Money? Do they really care? EU and the west will be under constant threat and on verge of dramatic confrontation. This is not good prospects for the EU unless someone will get sacrificed for temporary appeasement of Russia. And power in Russia will consolidate even more. People naively think that without Putin RU will collapse. They have a long tradition of collective management under dictatorial leadership. They will get another character in his place. Someone the west doesn't even know is there. This is a right mess in the moment of the history of make it or break it and anarchists have foretold this situation long time ago. This is what capitalism is leading to. War and more war.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheWandererofReddit",
            "body": "The word placement on that banner is weird.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMostBrightStar",
            "body": "Fuck Putin and Zelenskyy",
            "score": -1,
            "replies": []
        },
        {
            "author": "StoopSign",
            "body": "Yeah they should negotiate the end of the war. People should listen to Mearshimer. The US did a right wing coup in Ukraine in 2014.\n\nEdit: A US-Backed, Far Right–Led Revolution in Ukraine Helped Bring Us to the Brink of War\n\nhttps://jacobin.com/2022/02/maidan-protests-neo-nazis-russia-nato-crimea",
            "score": -16,
            "replies": [
                {
                    "author": "da_persiflator",
                    "body": "I can't with westerners talking about us eastern europeans like we're some cattle who don't take a step unless the mighty US government pulls the string. There was influence in those protests , sure, but there were actual grievances too. And that influence doesn't justify annexing crimea, then starting a second invasion where two more territories are targeted  while perpetrating a conflict that has killed hundreds of thousands, maimed probably the same, displaced millions and traumatized who knows how many . Please stop making it a both sides situation where somehow the fascist oligarch has no blame or is to be expected to act that way. Sit in your comfortable countries that have no regional bully with expansionist ideals on your doorstep .",
                    "score": 27,
                    "replies": [
                        {
                            "author": "lizardweenie",
                            "body": "Thanks for saying this. I have Ukrainian family (including in the occupied territories), and it's been an absolutely mind bending experience to be told by people in the west about how Ukraine is secretly a Nazi country and deserves to be colonized.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "da_persiflator",
                                    "body": "Hope they all make it out ok out of this whole shit situation.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Divine_Chaos100",
                            "body": "I can't with fellow eastern europans who talk as if even its a fact that the US has been meddling with the sovereignty of more than half the planet somehow ukraine is totally an exception.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "_valpi",
                                    "body": "Dismissing the struggles and perspectives of your comrades is a great way to build international solidarity.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Divine_Chaos100",
                                            "body": "Dismissing the struggles and perspectives of the millions who gave their lives fighting against US imperialism by acting like they are some minor actor in what's happening in Ukraine isn't either.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "_valpi",
                                                    "body": "It's you who came here and started downplaying Russian aggression and taking agency away from the Ukrainian people by implying that this war was started solely because of the US. You understand that your position is 100% aligned with the position of the current US State Department, right? You and them both repeat Russian talking points word for word. Doesn't that make you think about reconsidering your views?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Divine_Chaos100",
                                                            "body": "I'm not downplaying Russian aggression, i am completely aware about Russian aggression. That's a given. I am pointing out that the United States is also doing anything they can that Ukraine becomes a crippled state they can loot. That was always the plan and that happened to all their allies. You know what takes away agency from Ukrainians? Millions dying and getting their limbs torn off by bombs. Forced conscription. Closing the borders so no one can leave. Random comments on the internet dont take away the agency of anyone. I have literally zero power.\n\nThe US being the biggest global enforcer of capitalism is not a \"russian talking point\", it's the sober analysis that any leftist has been well aware of for decades.\n\nIf you actually gave a fuck about ukrainian anarchists you would read what they write about forced conscription: https://www.anarchistcommunism.org/2025/01/20/the-turn-of-2024-and-2025-for-ukraine-desertion-has-become-mainstream-nationwide/",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "_valpi",
                                                                    "body": ">If you actually gave a fuck about ukrainian anarchists you would read what they write about forced conscription\n\nI literally live in Ukraine right now. I have a lot of friends and relatives who either fight in the frontlines or live under Russian occupation. I despise Ukrainian and US governments (both current and past) and understand draft dodgers and, to some extent, deserters, because I don't know what I would do in their situation. But the conclusion of this article is pure bullshit.\n\n>Too many working people no longer see any fundamental difference in who will rob them.\n\nNo one I know wants to live under Russian occupation. Most people do not want to be conscripted mainly because of fear of dying and/or because they see the imperfections in the system and are not sure that they will get necessary equipment and training. Not because they don't care who will win in this war. Absolute majority of Ukrainians would rather choose to live under flawed liberal democracy than under imperialistic expansionist dictatorship. They would rather get robbed than robbed AND genocided. People saw how Russia gave Ukrainians from occupied Donbass WWII helmets, WWI rifles and sent them to die in a meat waves in bulk. They saw how Donetsk turned from a flourishing city that held Euro 2012 into a shithole. We understand that if we get occupied we will face the same fate in the next Russian expansionist war in Moldova, Kazakhstan, Georgia, Baltic States or some other country Russia views as part of it's empire.\n\nAs to Ukrainian anarchist and their perspective on this war, you should rather read about such organisations as [Solidarity Collectives](https://www.solidaritycollectives.org/en/), [Resistance Committee](http://linktr.ee/Theblackheadquarter) and leftist magazine [Commons](https://commons.com.ua/en/).",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "StoopSign",
                            "body": "I am in the regional/global bully country with expansionist ideas about Panama, Canada and Greenland. It is not comfortable here. I know my Soviet history and I see America now as like the Soviets in the 80s. I am very worried about blowback from such an aggressive foreign policy. Biden was a very aggressive expansionist leader but now we've got the biggest bully wildcard and who knows what he'll do.\n\n-------\n\nEdit: Also Russia didn’t invade Crimea. Their Black Sea Naval Fleet was in Crimea and the soldiers didn’t leave.  Russia did steal Crimea through a strong armed phony referendum.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "da_persiflator",
                                    "body": "Yes, i know you are. 80% of this site is from the global north.\n\nAs for the article you posted : i am not contesting it. A lot of countries from the eastern block, if not all,  have issues with the far right who get power due to rabid anti-communism and anti-russian sentiment .But the bombs falling don't know leftist theory. The bullet doesn't stop 3 cms from a head and asks the future victim what's their opinion on the distribution of wealth. Especially those fired at the behest of a fascist oligarch.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "StoopSign",
                                            "body": "Okay that makes sense. Most of the world population is from the global north. Doesn't the Eastern Bloc and Russia count as global north? I think ot global south as South America and Africa.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DarthRandel",
                    "body": "Its more nuanced than 'they did a coup' certain leftists will take this and deny any and all agency over the Ukrainian people or the repression that led to Maiden.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "StoopSign",
                            "body": "Maidan was a broad spectrum movement. The overthrow was very violent though.  It was like if Occupy was going on and then all these Nazis showed up with ultraviolence and snipers on rooftops sniping both the police and protesters. Lotta molotovs rained on cops.  Only time I felt bad for cops. I watched on livestresm back in 2014.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "lizardweenie",
                                    "body": "You feel bad for the Berkut and Titushky? If so, then you're definitely not an anarchist. These guys take state state sponsored violence and oppression to the next level.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "StoopSign",
                                            "body": ">You feel bad for the Berkut and Titushky? \n\nWho are they? I said I felt bad for some half dozen cops being burned to death",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "lizardweenie",
                                                    "body": "They're the people that the Yanokovich regime brought out to beat and murder protesters. \n\n[Berkut](https://en.wikipedia.org/wiki/Berkut_\\(special_police_force\\)#:~:text=The%20Berkut%20\\(Ukrainian%3A%20%D0%91%D0%B5%D1%80%D0%BA%D1%83%D1%82%3B,the%20Ukrainian%20SSR's%20OMON.)\n\n[Titushky](https://en.wikipedia.org/wiki/Titushky)\n\nProtesters defended themselves against these murderous cops, and then Kremlin TV stations created deceptive footage to imply that the poor cops were being attacked by horrible mean protesters. Sounds like you fell for it.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "StoopSign",
                                                            "body": "I was looking at more than one stream. I tend to be critical of my govts foreign interventions here...that's my bias. You seem to know better than me on specifics. I did not like John McCain doing speeches and photo ops with Azov.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "lizardweenie",
                                                                    "body": "Yeah, I think that attitude is pretty common amongst westerners (understandably). They tend to overemphasize the role and important of the west in everything, because in their experience, the west is the center of the world.\n\nIn reality, russia (like the US), is an imperialist power, and it's been doing imperialism in Ukraine and neighboring areas for a long time. And I think that, on a very deep level, the idea that russia can also be imperialist is really difficult for some westerners to comprehend.\n\n\nThe net result is that you'll have blatant imperialism and state violence by russia or russian backed regimes, which then gets completely ignored by some people on the western left, because russian imperialism doesn't fit into their cosmology of the world.\n\n Case in point: you, an anarchist, feeling bad for murderous cops, who were beating and murdering protesters.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StoopSign",
                                                                            "body": "I missed that part. I was watching when the violent demonstrators had em on the run and that's a timing thing and not a deceptive editing thing. I tuned in at a different time. \n\nCheck this out though\n\nhttps://www.researchgate.net/publication/266855828_The_Snipers'_Massacre_on_the_Maidan_in_Ukraine\n\nI also saw video of this that didn't look good. Pro-Russian Ukrainians and possibly pro Kyiv Ukrainians also on fire. I think people on fire is especially disturbing .\n\nhttps://www.theguardian.com/world/2014/may/02/ukraine-dead-odessa-building-fire\n\n\nEdit: I also saw a lot of Bandera flags throughout\n\nEdit: I think I look at it as both Ukraine and Russia are way too far right and they should fight it out or have peace but probably will keep fighting it out because they're far right.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lizardweenie",
                                                                                    "body": "> I think I look at it as both Ukraine and Russia are way too far right and they should fight it out or have peace but probably will keep fighting it out because they're far right.\n\nThat's basically what the Kremlin wants people in the west to think. \"It's complicated\", let's just let them fight it out. Basically the same tactic israel uses to alienate support for Palestine in the west. \n\nIn reality, Ukraine isn't far right by any stretch of the imagination: in the 2019 election, the far right got 2% of the vote, and achieved zero seats in the Rada. It's a multicultural society, in which the far right is significantly smaller than in most western countries.\n\nBut by constantly hammering on miniscule factions in Ukrainian society (like Azov and Right Sector), the Kremlin can get westerners to equivocate between the sides. Meanwhile, russia is literally run by a far right dictator, who is in the process of carrying out an imperialist invasion for \"blood and soil\".\n\nI think it's particularly telling that some western leftists endlessly talk about Azov (a marginal group of around 800 shitheads), but has nothing to say about Rusich or Wagner, which are mainstream in the russian military (over 20X larger, founded by explicit neo Nazis, and are currently engaging in a massive campaign of rape and torture in the occupied territories.)",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "StoopSign",
                                                                                            "body": "Well that definitely makes sense because left right and center they were fighting a civil war with the rebels in the east. There's been human rights atrocities on both sides of the civil war before the Russian invasion. I reported on it. Zelensky ran as a peace candidate and did not deliver.  Instead he listened to the wrong people in Brussels, in DC, in Langley. I wanna get off the right/left and onto more practical matters of this war. The US and NATO squashed a peace process in April 2022 and maybe it made a bit of sense because Russia struggled at the beginning of the war. Since Russia regrouped using Wagner (then spectacularly shot Pregozhin out of the sky after his weak kneed mutiny attempt) and getting a feel for a longer drawn out war, Ukraine has had no chance of winning this war. They cannot win. It's very simple. Look at a map and say which country will win a long drawn out war and anyone would pick the largest country on earth by landmass. Putin doesn't care how many of his citizens he sacrifices for the cause. I believe Putin believes this war is existential for Russian survival due to NATO encroachment.  There's no point in me putting a value judgment on that because it is the way he thinks. This is not an existential threat to  NATO or Ukraine as Putin wants 4 conquered terroritories in the east.\n\n--------\n\n\nI want peace in Ukraine for the same reason I was happy about the Gaza ceasefire so fewer people die, so that tne killing stops. People need to stop watching movies and playing COD. The good guys don't always win the wars. That's WW2 propaganda. The bad guys often win wars. Ask any native anywhere.  Ask the Armenians. Sometimes you have to cut your losses because you lost and not because your side is less freedom loving or less noble. I am not worried about Putin touching a NATO country because they are a NATO country.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Divine_Chaos100",
                                                                                            "body": "anarchists stop assuming a power of a group by their election results (impossible).  \n  \nthe far right mightve gotten only 2% on the elections but before the war ukraine was a regular meeting place for the european far right, there were REGULAR pogroms against Roma people and can do these with impunity. Dismissing this because there was one election where the far right fucked up is ridiculous.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lizardweenie",
                                                                                                    "body": "1. Since 1991, the far right has [absolutely not](https://www.tandfonline.com/doi/abs/10.2753/RUP1061-1940510502) been mainstream in Ukrainian politics and is actually much more marginal than other European countries. This has been borne out in **many** elections, not just the most recent one\n\n2. Studies consistently show that rates of participation in [hate groups](https://doi.org/10.1093/oxfordhb/9780190274559.013.30), as well as hate crimes, are lower in Ukraine than other Eastern European countries, and FAR lower than in russia. \n\n3. Additionally, Ukrainians are significantly [less likely](https://www.pewresearch.org/fact-tank/2018/03/28/most-poles-accept-jews-as-fellow-citizens-and-neighbors-but-a-minority-do-not/) to hold antisemitic attitudes than Poles, russians, or Greeks. \n\n______\n\n\nSo I have to ask, if the overwhelming majority of Ukrainians aren't voting for far right parties, aren't participating in hate groups, aren't committing hate crimes, and aren't holding antisemitic attitudes: **what makes you so sure of your feeling that Ukraine is some far right country.** Have you ever been there? Do you consume Ukrainian media? Do you know anything about the culture or society?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Divine_Chaos100",
                                                                                                            "body": "> what makes you so sure of your feeling that Ukraine is some far right country.\n\nFar right paramilitaries committing regular pogroms with impunity.\n\nLiterally your own fucking \"evidence\" agrees with me: \"Thus, the political impact of the far right in Ukraine extends beyond electoral performance and to the activities of extra-parliamentary groups that are beginning to penetrate political life and state institutions.\"",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "lizardweenie",
                                                                                                                    "body": "So based on your comment, you're not engaging with this in good faith, but on the off chance you are, i'll respond. \n\nI claimed that Ukraine is not a far right hellhole. To support this, I made 3 points, each of which was supported by credible evidence/and/or studies. \n\n> 1. Since 1991, the far right has absolutely not been mainstream in Ukrainian politics and is actually much more marginal than other European countries. This has been borne out in many elections, not just the most recent one\n\n> 1. Studies consistently show that rates of participation in hate groups, as well as hate crimes, are lower in Ukraine than other Eastern European countries, and FAR lower than in russia.\n> 1. Additionally, Ukrainians are significantly less likely to hold antisemitic attitudes than Poles, russians, or Greeks.\n\nYou then browsed the abstract (and obviously didn't read) the second source. If you'd actually read the source, you would have seen this information:\n>  2007 was the most violent year in terms of racially motivated crimes with 88 registered assaults with 6 fatalities[In Ukraine]. By comparison, in Russia during the same year there were a reported 625 casualties with 94 deaths attributed to far-right violence.\n\nwhich absolutely supports my point, because based on this data, russia has a much larger (per capita) number of casualties and deaths from the far right. This is completely consistent with the abstract. You see, it's totally possible for the far right to have an outsized impact (relative to its tiny numbers), and also be objectively very small. Do you recognize that the abstract isn't saying that Ukraine is a far right hell hole? and it's certainly not saying that \"Far right paramilitaries committing regular pogroms with impunity.\" I feel like the only way you could come to that conclusion is if you didn't read the study, and already had a preconceived notion that you were looking to confirm. \n\n______\nSo far I've provided well supported claims backed by academic work and studies. And your argument has been to misread a single study, use that misreading to dismiss all of the points, and then bluster (without any evidence) about how how \"Far right paramilitaries committing regular pogroms with impunity\". If this is true, then surely you'll have no trouble finding studies quantifying this and showing that is more common than in other European countries? \n_______\n\nI'll say again: if the overwhelming majority of Ukrainians aren't voting for far right parties, aren't participating in hate groups, aren't committing hate crimes, and aren't holding antisemitic attitudes: what makes you so sure of your feeling that Ukraine is some far right country.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Divine_Chaos100",
                                                                                                                            "body": "You claimed that Ukraine is not a far-right hellhole SOLELY because they do bad on elections, which is absolutely faulty logic, especially if you think of yourself as an anarchist. That was the only thing i was calling out: that the influence of the far right was way beyond electoral means. There's countless other way to build power for a movement and the Ukrainian far-right is a perfect example of that (and also it was very well documented in mainstream media before the war, since then it's russian propaganda even to talk about it).\n\nAnd to counter that you linked a PAYWALLED study, which even in its abstract (and probably the full study as well, or its a shitty study that contradicts its abstract) says exactly what i said, that the influence of the far-right in Ukraine goes way beyond elections. [Here's the ex-leader of the army openly rocking the t-shirt of a nazi rock band.](https://www.facebook.com/photo.php?fbid=5857785570966261&set=pb.100002046281310.-2207520000&type=3) This is HIS OFFICIAL facebook page and the post is open and can be seen by anyone.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "lizardweenie",
                                                                                                                                    "body": "So it really seems like you're purposefully not responding to my posts or not reading them.\n\n> You claimed that Ukraine is not a far-right hellhole SOLELY because they do bad on elections\n\nNo, I claimed that Ukraine is not a far right hellhole on the basis of 3 different points:\n\n> 1. Since 1991, the far right has absolutely not been mainstream in Ukrainian politics and is actually much more marginal than other European countries. This has been borne out in many elections, not just the most recent one\n> \n> 1. Studies consistently show that rates of participation in hate groups, as well as hate crimes, are lower in Ukraine than other Eastern European countries, and FAR lower than in russia.\n> \n> 1. Additionally, Ukrainians are significantly less likely to hold antisemitic attitudes than Poles, russians, or Greeks.\n\nFor all of these points, I brought up strong evidence/studies. And you haven't given any evidence to seriously contest any of these points. And thus far, the only thing you've done is misread a study, baselessly bluster about the far right in Ukraine, and then link to a facebook post by Залужний. Not the sweet argument you seem to think it is?\n\n\nAs I said before, If Ukraine is really a far right hell hole, then surely you'll have no trouble finding studies quantifying this and showing that is more common than in other European countries.\n\n**So yeah, either you respond with a credible study quantifying far right pogroms/and/or/violence in Ukraine and showing that they are more common than in other European countries  or I think that we're done here.**",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Divine_Chaos100",
                                                                                                                                            "body": "> That's basically what the Kremlin wants people in the west to think. \"It's complicated\", let's just let them fight it out. Basically the same tactic israel uses to alienate support for Palestine in the west.\n> \n> \n> \n> In reality, Ukraine isn't far right by any stretch of the imagination: in the 2019 election, the far right got 2% of the vote, and achieved zero seats in the Rada. It's a multicultural society, in which the far right is significantly smaller than in most western countries.\n> \n> \n> \n> But by constantly hammering on miniscule factions in Ukrainian society (like Azov and Right Sector), the Kremlin can get westerners to equivocate between the sides. Meanwhile, russia is literally run by a far right dictator, who is in the process of carrying out an imperialist invasion for \"blood and soil\".\n> \n> \n> \n> I think it's particularly telling that some western leftists endlessly talk about Azov (a marginal group of around 800 shitheads), but has nothing to say about Rusich or Wagner, which are mainstream in the russian military (over 20X larger, founded by explicit neo Nazis, and are currently engaging in a massive campaign of rape and torture in the occupied territories.)\n\nYour original comment which i replied to and which nowhere mentions any of the three things you say you claimed, who's acting in bad faith now?\n\nYou can go hurrdurr and block me that doesn't change the fact (which is here for everyone to see) that what i called out is that the argument \"nazis are not a factor in Ukraine cause theyre doing bad at elections\" is bad because there are other ways to influence to society. To this you responded with a PAYWALLED study that even in its abstract strengthens my point and now are throwing tantrums and acting like you didn't say what you very clearly said.I mean, we can stop, you embarrassed yourself enough.\n\nPredictably, after being shown that their reasoning is bullshit, u/lizardweenie blocked me and as a reason citing something he \"said in his original comment\" which is, as anyone reading this can see above twice, isn't there.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "lizardweenie",
                                                                                                                                                    "body": "My original comment claimed that the far right in Ukraine \"is significantly smaller than in most western countries.\" In a subsequent comment, I then provided 3 bits of evidence to support this. You then ignored 2 of the links, and misread one. \n\nAnd now your sweet argument is that I'm somehow acting in bad faith by...asking you to read the links I posted subsequently to support my point? A point which you somehow interpret as \"bad faith\"?\n\nOn my side, I've posted multiple academic studies. And on your side, you've posted a facebook post of Залужний wearing a t-shirt. \n\nSo yeah, either you respond with a credible study quantifying far right pogroms/and/or/violence in Ukraine and showing that they are more common than in other European countries or I think that we're done here.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Divine_Chaos100",
                                                                            "body": "> They tend to overemphasize the role and important of the west in everything, because in their experience, the west is the center of the world.\n\nNo, actually, they emphasize the role of the US completely correctly, as its role is documentedly is by far the biggest and most powerful enforcer of global capitalism. The ones who dont see the US' role correctly are the ones who look at US senators parading on Maidan (when has a us senator visited ANY other eastern european country recently?) and think the us doesnt have any skin in the game.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lizardweenie",
                                                                                    "body": "OP's worldview caused them to \"feel bad\" for the murderous police and hired thugs, not the protesters who were simply demanding rule of law and less corruption. So yeah, that's a pretty good indication that something is wrong in their worldview.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "StoopSign",
                                                            "body": "Also there are not Ukranian or Russian riot cops rougher than American riot cops. I've seen the Kossacks whip and drag people but it's not like the old fashioned American beatdown and tazing, and sometimes shooting, we get from our boys in blue.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "lizardweenie",
                                                                    "body": "Again, it sound like you may be suffering from a case of \"west is the center of the world.\"  russian police are absolutely worse than american police, and it's not even close. Just in occupied [Kherson](https://www.theguardian.com/world/2023/mar/02/kherson-torture-centres-were-planned-by-russian-state-say-lawyers), they set up over [20](https://www.hrw.org/news/2023/04/13/ukraine-russian-torture-center-kherson) torture chambers, in which they systematically raped, tortured, and murdered [civilians](https://globalrightscompliance.com/2023/03/02/new-torture-chamber-evidence-uncovered-from-liberated-kherson/). And that's just one region that was partially occupied.  \n\n\nUS police are horrible and despicable. But it's not even close.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StoopSign",
                                                                            "body": "Well that's war and against foreign nationals. The US has had numerous torture scandals with POWa and at Gitmo. I was speaking about the US domestic police force. Jail guards use riot control devices to extract one agitated guy from a cell.  So much video evidence of clearly excessive violence during the 2020 Floyd unrest\n\n-----\n\nThe way i look at it is that the US, Ukraine and Russia are all backwards.\n\nhttps://www.bbc.com/news/world-europe-26468720\n\nEdit:*Floyd unrest",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lizardweenie",
                                                                                    "body": "Behavior by the US is absolutely abhorrent. And that doesn't mean that we should lose our ability distinguish between degrees of badness.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "None",
                                                                                            "body": "[removed]",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AutoModerator",
                                                                                                    "body": "Hi u/StoopSign - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "StoopSign",
                                                                                            "body": "Going back not too far the US has done 50ish coups in Latin America, the most recent being a successful coup in Bolivia in 2019 and an attempted coup in Venezuela also in 2019. I reported on these. A million dead Iraqis led to the most barbaric terrorist groups ISIS that ran Iraq and Syria for a bit until The US and Russia took them out. ISIS has open slave markets in Libya..Everywhere in the middle east we flip turns to ISIS and everything we flip in Latin America flips back to socialist. Just this century we've failed 2 coups in Venezuela. We did Bolivia like I mentioned but before that we did Haiti in 2004. We did Honduras in 2009. We pushed for a political coup Operation Carwash to flip Brazil in 2015. We're involved in another Haitian disaster right now too.\n\nRussia doesn't like lgbt people very much but it's tolerated behind closed doors. Russia invaded one other country and commuted the P*ssy Riot sentence. They've got Wagner doing anti terror ops in Africa because the US wants Africans to submit to Africom and The Sahel has has enough with the traditional Colonialists and neocolonialists like France and the US.\n\nSo which country looks more evil?\n\nAlso Russia is not the Soviet Union. The USSR crumbled and the west looted Russia it under Yeltsin. If you went back to 1945 under Soviet rule Russia may be worse.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lizardweenie",
                                                                                                    "body": "So just to make it absolutely clear: I completely agree that the US has done terrible atrocities (including some of the stuff you mentioned) and I condemn them without reservation. \n\nWhat I was talking about was this statement:\n> Also there are not Ukranian or Russian riot cops rougher than American riot cops\n\nIn response, I mentioned systematic rape and torture by russian occupiers in Ukraine, which is indisputably worse then what the US police do. \n\nYou then made a reasonable point: \n> Well that's war and against foreign nationals. The US has had numerous torture scandals with POWa and at Gitmo. I was speaking about the US domestic police force.\n\nHowever, I don't feel completely swayed by this argument for 2 reasons:\n\n1. Much of the rape and torture in the occupied territories is actually being done by russian security services, GRU, FSB, etc, in addition to russian soldiers, so it really is being done by people we would fairly call \"cops\". \n2. Even counting Gitmo (which I agree should be counted): russia is basically setting up multiple Gitmos on steroids in every single occupied area. The degree and scale is just completely on another level. It would be like if the US set up 20 Gitmos in every single city in Iraq, and supplemented the Gitmo torture with mass executions. \n\nLike, we can acknowledge that the US has done terrible atrocities without whitewashing russian atrocities.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "lizardweenie",
                                                                                                            "body": "Also, upon re-reading your comment, I noticed this and I just needed to comment:\n\n> They've got Wagner doing anti terror ops in Africa because the US wants Africans to submit to Africom and The Sahel has has enough with the traditional Colonialists and neocolonialists like France and the US.\n\nWagner is a fascist paramilitary group, founded by Dimitry Utkin (an avowed Neo Nazi with multiple [SS Tattoos](https://www.ft.com/__origami/service/image/v2/images/raw/ftcms%3A56e89903-46c8-4e32-b79f-1a1a02240a89?source=next-article&fit=scale-down&quality=highest&width=700&dpr=2)) who used to greet his men with a Sieg Heil. The group is named after Utkin's call sign, which was chosen because it was Hitler's [favorite composer](https://www.bellingcat.com/news/uk-and-europe/2020/08/14/pmc-structure-exposed/). \n\nThey aren't doing \"anti terror\" operations. They are looting the 3rd world for resources, in the the process are raping and murdering civilians [\\(example in Mali\\).](https://www.theguardian.com/world/2023/may/20/russian-mercenaries-behind-slaughter-in-mali-village-un-report-finds)\n\nThey are terrorist Neo Nazis who routinely release telegram videos of themselves bashing people's heads in with sledge hammers in [Syria](https://www.newarab.com/opinion/syrian-man-bludgeoned-hammer-russian-mercenaries) and [Ukraine](https://www.bbc.com/news/world-europe-63820437).\n\n\nAnd it's really odd to hear you sitting here defending Nazis who are going to the 3rd world to steal resources, and rape/murder/torture civilians. Wagner is like Azov, x10, on steroids. Azov is a shitty marginal group of around 800 people who spend most of their time fighting against russian invaders and flying edgy flags. Wagner is a much larger, much more powerful, much more mainstream organization, who go around raping, pillaging, and torturing civilians.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "StoopSign",
                                                                                                            "body": "Yeah I get that empires suck in general and this cold war reemergence is awful but throwing Russia a bone by ceding territory isn't appeasement. They earned that territory through bloodshed. It's wholly unfair but that's war.\n\n---------\n\nAs for the US torture, it's not just Gitmo and Abu Ghraib, it's also the CIA blacksites spread throughout the former eastern bloc.\n\n---------\n\nAs for police use of rape as a method of torture, the cops do that. There was a black site facility not more than ten miles from me where cops were violating all civil rights and also credibly accused of 13 rapes:\n\nhttps://www.theguardian.com/us-news/2015/may/14/homan-square-detainee-police-abuse\n\nThis was an underreported story. The CPD is bad but the NYPD also raped a guy with a plunger some years back. Confessions are beaten out of people. The illegal seizure of cash is a practice that was so common that it was aired on the TV show Cops. There is less asset forfeitfure now, but a bond is supposed to be a cash deposit returned to you. I've never gotten a bond back.\n\n--------\n\nFinal point is that if you look at the Maidan revolution as a western backed coup utilizing the Right Sektor and Sveboda VS looking at it as a popular revolution that included the far-right, it will deeply change the way you view the entire war. I can say the same about views on NATO expansion. I think that's the root of the issue.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "lizardweenie",
                                                                                                                    "body": "> As for police use of rape as a method of torture, the cops do that\n\nI acknowledge this and I agree that this is awful. And it's also nothing approach the scale of what's happening in Ukraine. Again, Just in 1 occupied city, they found more than 20 torture sites. \n\n> Final point is that if you look at the Maidan revolution as a western backed coup utilizing the Right Sektor and Sveboda VS looking at it as a popular revolution that included the far-right, it will deeply change the way you view the entire war. I can say the same about views on NATO expansion. I think that's the root of the issue.\n\nAgain, I think that this is a deeply ingrained western bias: to view everything through the lens of the cold war. And it's basically a direct copy paste of russia's position: They can't fathom that Ukrainians genuinely don't want to be a colony of russia. So instead, it must be the case that Maidan was a CIA orchestrated plot to empower extremists in Ukraine (similar to the very real US coups in South America). \n\nBut ultimately, if you apply this lens to everything you wind up with an incredibly distorted picture. You miss the fact that, russia is genuinely imperialist. And that Ukraine, despite its flaws, isn't some Nazi dominated hell hole. It's an imperfect, multicultural country, in which the far right is less mainstream than virtually any western European country.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "lizardweenie",
                                                                                                                            "body": ">  throwing Russia a bone by coding territory isn't appeasement. They earned that territory through bloodshed. It's wholly unfair but that's war.\n\nAlso, just wanted to clarify: russia's demands are not just for the territory they captured. They are currently demanding massive portions of territory that they don't control, as well as measures that would make it even easier for them to invade next time.  Also, the 3.5 million Ukrainians who live under occupation will be subject to cultural genocide, so signing off on that genocide isn't really \"throwing russia a bone\"\n\n---------\nBut if this war could be ended by giving up some land and stomaching rape/torture/ cultural genocide of 3.5 million people, I think many Ukrainians might be able to stomach it. But unfortunately, we all know that just giving up some land will basically guarantee that russia will invade again. \n\nIn early 2014, russia invaded Crimea and the world told Ukraine not to fight back. \"Just give up Crimea for peace\". \n\nSo then russia invaded Donetsk and Luhansk. And Ukraine negotiated. \"Just give a bit of the Donbas for peace\". \n\nThen in 2022, russia invaded again. \"Give up more land for peace\" said the comfortable people in America from their couches. \n\nYou really think that this time, russia will stop? Unfortunately this fight is existential for Ukrainians. There is no option in which russia stops trying to invade/colonize the country. A \"land for peace\" appeasement deal didn't work in 2008 (Georgia), it didn't work in 2014 (Crimea, Donetsk, Luhansk), it didn't work in 2022. And you'd be a fool to think it would work now.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "author": "StoopSign",
                                                                                                                            "body": "Honestly I could pretty much see all that as true and still want peace. The US widely looks at Ukraine as a proxy war because they are using to US weapons to try to fight off the Russians.  I do know Putin wants to remake the Soviet Union but it's hard not to apply a cold war lens with so much cold war rhetoric and NATO actions. I was very young but I remember Putins first move was to ask to be part of NATO and play nice.  Probably a cheap ploy but Russia in the 90s was awful. Putin doesn't only have a high approval rating through ruling with an iron fist. He's genuinely risen his country to prominence since then to the point of directly challenging US global dominance.\n\n--------\n\nYou can apply both a cold war lens and a lens where Ukraine is an independent country with a unique identity and goals at the same time. These aren't contradictory ideas.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "lizardweenie",
                                                                                                                                    "body": "So right now, \"peace\" that's being proposed is basically as follows:\n\n1. russia keeps the territory it currently holds. This guarantees cultural genocide + widespread rape/torture of the 3.5 million Ukrainians currently living in the occupied territories. \n\n2. russia does not return any of the 700,000 children that it [claims](https://www.reuters.com/world/europe/moscow-says-700000-children-ukraine-conflict-zones-now-russia-2023-07-03/) to have deported. \n\n3. No NATO for Ukraine, and no foreign troops to deter russia. This basically guarantees that russia will invade again as soon as it can. After all, russian pundits talk almost weekly about how Kharkiv, Odesa, and Kyiv are all russian cities as well and must be brought back into russia. \n\n4. Weapons restrictions for Ukraine. To make it easier for the next time russia invades. \n\n\nDoes this sound like \"peace\" to you? Right now, the options for Ukraine are to continue fighting and hold out hope, or submit to this \"peace\" and ensure their own destruction.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "StoopSign",
                                                                                                                                            "body": "Just add a clause where if Russia invades again Ukraine is no longer completely neutral but also not part of NATO.  Basically the status they have now. No more deaths in the immediate future. Those Eastern territories have both Ukrainians and Russo-Ukranians.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "lizardweenie",
                                                                                                                                                    "body": "> Just add a clause where if Russia invades again Ukraine is no longer completely neutral but also not part of NATO. Basically the status they have now\n\nThe status quo obviously wasn't effective in deterring russia, because they have already invaded multiple times.\nBasically what you're saying is that, when russia invades again, nothing will happen and russia will be free to takeover the rest of the country as well.\n\nAnd that is precisely why Ukrainians have to fight: because no peace deal with russia will protect them. The only shot they have at survival is inflicting sufficient pain on russia so that russia think twice when they are planning their next invasion.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_valpi",
                    "body": "Maybe we should listen to Kissinger too? You understand that anarchism and realpolitik are fundamentally incompatible, right?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}