{
    "title": "Given Zhou is Ferrari's reserved driver now, Chinese F1 fans bring new 'Ferrari Strategy Supervisor' suit to Shanghai Grid",
    "author": "MarcoGWR",
    "subreddit": "formula1",
    "rank": 3,
    "score": 5157,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 85,
    "url": "https://i.redd.it/xnxl0zb5ffpe1.jpeg",
    "id": "1je1ysc",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[The **Photo** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_photo) is for submissions sharing photos from the world of F1. Photos should be interesting and relevant - random photos not notable enough to warrant a standalone post will be subject to removal. This flair should not be used for images which are not photos, such as screenshots, statistical graphics, or artworks.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "fish_baguette",
            "body": "Last year there was a “horners d—k supervisor” which was extremely hilarious",
            "score": 1,
            "replies": [
                {
                    "author": "dedrake131",
                    "body": "Horned duck supervisor",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pipichua",
            "body": "https://preview.redd.it/6vyfqn2qkfpe1.png?width=1836&format=png&auto=webp&s=22cf341c81d9da0be983dcade6497a3ce4c6d6bf\n\ncan’t decide which is better",
            "score": 1,
            "replies": [
                {
                    "author": "jnahmel",
                    "body": "Just a team of the 5/6 drivers before Lawson cheering him on",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "onionkimm",
                    "body": "These are so tastefully fucking savage, years of online repression have really honed the Chinese sense of humor to a fine point.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "trj820",
                            "body": "If the CCP ever falls and China liberalizes, their online culture is gonna run through the internet like smallpox through the Americas.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mateo03",
                                    "body": "It's already happening, to be fair.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "spongemongler",
                    "body": "This one is better imo lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bitter_Aurum44",
            "body": "These guys are hella creative! With Ferrari's history of wonderful strategies, letting Zhou take care of it instead might actually give better results :P",
            "score": 1,
            "replies": [
                {
                    "author": "SkyJohn",
                    "body": "Simply remembering not to run slicks on a cold wet track would get them better results.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bitter_Aurum44",
                            "body": "Ferrari see red, Ferrari use red. Red mean fast. All other colour slow. /s.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "J_Raskal",
                    "body": "Casting a die would yield better results. Randomness is statistically more likely to be right than Ferrari.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FormulaGymBro",
                    "body": "I would rather he drove the car this weekend, it would be such a great gesture for one of the drivers to let him.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fungchilong",
                    "body": "It’s selling on the online market",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Satan_su",
            "body": "Chinese folks are some of the most creative people I've seen when it comes to banter haha. Even in the eSports world, they're very well known for consistently dropping bangers, especially when a Chinese team takes an embarrassing loss. They save the best for their own teams XD",
            "score": 1,
            "replies": [
                {
                    "author": "CroSSGunS",
                    "body": "Chinese Dota Meme Translations are something we wait for after every single TI",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Anuxinamoon",
                            "body": "Their memes truly are top tier. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "VoluptaBox",
                            "body": "Too bad they don't get many teams nowadays ((",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dulcedoll",
                    "body": "The great firewall isn't to protect CN netizens from us, it's to protect us from the netizens.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "m1a2c2kali",
                    "body": "*even* in the esports world? I think you mean especially in that world lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rtb001",
                    "body": "Their NBA nicknames and memes are top notch, going back years all the way back to \"Hibbert Coin\" days.\n\nSome are easy to understand: Giannis Antetokounmpo's nicknames is \"alphabet bro\" for obvious reasons.\n\nSome are made from very convoluted cultural/translation processes, but are nonetheless memorable and hilarious: Steph Curry's nickname is \"sky fucker\".\n\nMy personal favorite is that there is a Chinese town called \"Jingdezhen\", famous for making beautiful, but fragile, porcelain. Chinese NBA fans have taken to naming NBA players who like to flop/dive as a \"citizen of Jingdezhen\". So who then is the \"mayor\" of Jingdezhen? James Harden naturally! Although these days I suppose Jojo Embiid will certainly have replaced Harden as mayor. Much for fitting since not only is Embiid one of the GOAT floppers, but unlike Harden he is also simultaneously literally fragile like actual procelain.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Radicatte",
                    "body": "LPL fans drop such iconic oneliners when they get knocked out in Worlds",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PoetryWooden614",
                            "body": "man you should see them covering songs on bilibili rn roasting TES, the top one has over 1.7 million views (in 2 days) and the rest can form a whole album",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheDJZ",
                    "body": "It’s partly due to the strict Internet censorship that forces people to be creative to get around censors. It’s like an arms race between shit posters and censors. You gotta have a sharp wit to beat the censors",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dobagela",
                            "body": "Do you think Americans will get more creative after they just passed the bill to include anything criticizing Israel as antisemitic?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Leek5",
                    "body": "Yea, remember when Zhou posted himself as a tire after a bunch of sim work",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MyUshanka",
                    "body": "Brother Doublelift is an all-timer",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "linnamulla",
            "body": "I'd love one that says \"Water Leakage Supervisor\"",
            "score": 1,
            "replies": [
                {
                    "author": "53bvo",
                    "body": "Give them a day to print those",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Spare_Duck3119",
                            "body": "must be the ink",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "insomniaccapricorn",
                                    "body": "Let's add that to the words of wisdom.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cc88291008",
                            "body": "it's China, only takes a second.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "53bvo",
                                    "body": "The rest of the day is the images making their way to Reddit",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brynhildrpls",
            "body": "Chinese fans are on a different level of creativity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrimalJay",
            "body": "Games back lads. Quality banter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bwoahful___",
            "body": "They could really use it lol. That’s always a fun thing about a new (or at least uncommon) country having an F1 driver: getting to see the passion and creativity of their fans!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lobsters4",
            "body": "The Red Bull one is so fucking good.  The right amount of so funny and so totally right on the mark.  😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "VolevoEssereUnDuro",
            "body": "Chinese banter is always great",
            "score": 1,
            "replies": []
        },
        {
            "author": "PigsAlsoCanFly",
            "body": "Make one for Racing Bulls too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Secret_Divide_3030",
            "body": "Every race should have its local Ferrari strategy supervisors.",
            "score": 1,
            "replies": [
                {
                    "author": "labdweller",
                    "body": "I don't think I'd want to be associated with Ferrari strategy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shutinlear53",
            "body": "The Sauber pit crew ones from last year were hilarious as well, Chinese fans have great humor",
            "score": 1,
            "replies": []
        },
        {
            "author": "Takis12",
            "body": "Carlos back to Ferrari?",
            "score": 1,
            "replies": [
                {
                    "author": "nikl_odeon",
                    "body": "Start inventing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_-Hex",
            "body": "This made me genuinely chuckle. Great job Chinese F1 fans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "siders6891",
            "body": "Cant wait for more crazy fan outfits",
            "score": 1,
            "replies": []
        },
        {
            "author": "XsStreamMonsterX",
            "body": "This suddenly gives me the image of an old Asian uncle berating Ferrari for their strat calls.\n\n\"Haiyaa! Why you not pit for inters when rain come?\"\n\n\"My nephew do better strategy than you and he nine! He already graduate from Harvard and started a business while working for Apple.\"",
            "score": 1,
            "replies": [
                {
                    "author": "aka_liam",
                    "body": "Dude…",
                    "score": 1,
                    "replies": [
                        {
                            "author": "XsStreamMonsterX",
                            "body": "I'm Asian, it's fine",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MatniMinis",
                                    "body": "Channeling your inner Uncle Roger I see.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "My_Password_Is_____",
                            "body": "Have you never seen an Uncle Roger video? This is very clearly mimicking his style.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "aka_liam",
                                    "body": "I don’t think so",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "My_Password_Is_____",
                                            "body": "Gotcha, he's a comedic content creator online. He does a lot of content revolving around the stereotype of Asian parents always pressuring their children, and that comment was pretty much exactly his style. So that seems like what they were referencing, not just being racist.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Technical-Pack7504",
            "body": "Chinese fans are the best, this is great lmfao",
            "score": 1,
            "replies": []
        },
        {
            "author": "giYRW18voCJ0dYPfz21V",
            "body": "Have Chinese fans always been so fun? Last year they were honestly hilarious, and this year seems we are on track for something similar.",
            "score": 1,
            "replies": [
                {
                    "author": "MuskegsAndMeadows",
                    "body": "They've gotten funnier over time but yeah its basically always been like this. Losing the race for a few years really highlighted their creativity because the only other fans that got talked about in their absence were the guys who wear the full model F1 cars as hats.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Disastrous_Animal_34",
            "body": "Was it just a random fan wearing it last year? This is so well done (much needed oversight!)",
            "score": 1,
            "replies": []
        },
        {
            "author": "-CaptainFormula-",
            "body": "Is paying to be a reserve driver a thing?\n\n\nI can't understand how Zhou is still here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xMattewx4",
            "body": "The turn around time on getting things made must be insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RudeBwoiMaster",
            "body": "Reserve or reserved?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wardog_Razgriz30",
            "body": "Gotta love Chinese Fans. They bring their A game to every year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bitter-Rattata",
            "body": "remember to add button K1",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hamsternoir",
            "body": "Is it waterproof? Asking for a ~~friend~~driver",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental_Loss94",
            "body": "Chinese F1 fans are the gift that keeps on giving 😂 Still not over the Sauber ones from last year too",
            "score": 1,
            "replies": []
        },
        {
            "author": "ryokevry",
            "body": "There are so many nice Chinese fans yet one of the broadcasters were wishing Charles, Lewis and Giovannazi get sick in china and cannot race, even took a photo of where Ferrari kept their food in the paddock….",
            "score": 1,
            "replies": []
        },
        {
            "author": "UniQue1992",
            "body": "This is awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "thisisqiqi",
            "body": "We are checkinf",
            "score": 1,
            "replies": []
        },
        {
            "author": "Killroywasthere1981",
            "body": "Can anyone answer this question for me: How else can points be scored in F1? Other than top ten finishes, do you get points for gaining positions?",
            "score": 1,
            "replies": [
                {
                    "author": "Artoo_Detoo",
                    "body": "No, the only other way to score points currently is to finish top 8 in the sprints.  For a few years up to last year, you could also get 1 point if you had the fastest lap during the race, but you still had to finish in the top 10.  That was eliminated this year.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "labdweller",
                    "body": "In sprint races, top 8 also get points.\n\nNo points for anything else. There's no more extra point for fastest lap this year.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FormulaGymBro",
            "body": "I wish Leclerc or Hamilton would have the grace to let him race this weekend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Palsable_Celery",
            "body": "That's dumb.",
            "score": 1,
            "replies": []
        }
    ]
}