{
    "title": "Listening to different teams radios during chaotic situations like lap 44 AUS25, is very telling and here's my take away...",
    "author": "Ok-Control6379",
    "subreddit": "formula1",
    "rank": 10,
    "score": 597,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 93,
    "url": "https://www.reddit.com/r/formula1/comments/1je7b6q/listening_to_different_teams_radios_during/",
    "id": "1je7b6q",
    "selftext": "It was interesting listening to the new pairings  like Hamilton/Adami, Bono/Kimi, Hulk/HisEngineer etc., and the already established pairings like Russell/HisEngineer, GP/Verstappen, Lando/Will etc., and I must say, WOW, the difference was telling.\n\nFerrari need to change their approach because all they seem to care about is race position, rather than what track conditions are like. This goes for the drivers too because in such situations, the drivers are the ones battling the conditions and can tell what they can handle or not. \n\nThey need to be more firm just as Russell and Verstappen were about what needed to happen, else they won't ever change cause it's been happening for years. I'm surprised Hamilton wasn't more decisive but I suppose new team new relationship so he was still learning how the atmosphere would be like.\n\nBono took charge with Kimi and was understandably so. Same with Stoll, his engineer mostly made the calls and he never seemed like the type to care that much. Hulk put his experience hat on.\n\nAs for Norris and McLaren, they clearly learned from previous situations because both Lando and Will could tell that the type of rain that fell, will obviously not dry for the remainder of the race. Or they both just panicked and Lando boxed out of fear😅 because Lando was quite inquisitive and tried to anticipate which is no no in F1. \n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "As a general rule ([see full rules](https://www.reddit.com/r/formula1/wiki/userguide#wiki_sticky.2Fdaily_discussion)), a standalone Discussion post should:\n\n- be of interest to the sub in general, and not a specific userbase (e.g. new users, GP attendees, just yourself)\n- be able to generate discussion (e.g. no yes/no or easily answerable questions)\n- show reasonable input and effort from the OP\n\nIf not, be sure to [look for the Daily Discussion](https://www.reddit.com/r/formula1/search/?q=daily+discussion&include_over_18=on&restrict_sr=on&t=all&sort=new), /r/formula1's daily open question thread which is perfect for asking any and all questions about this sport.\n\nThank you for your cooperation and enjoy the discussion!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuzzy_Breadfruit59",
            "body": "Hamilton after the race in Melbourne 😂\n\nhttps://preview.redd.it/fwfv5sivygpe1.jpeg?width=806&format=pjpg&auto=webp&s=e272825cce966c20943130422d9b4e0613f04aea",
            "score": 1,
            "replies": [
                {
                    "author": "Own_Welder_2821",
                    "body": "Unfortunately for Lewis, Bono has a new boy to take care of. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "S14Nerd",
                            "body": "This can go so many ways 😅",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Own_Welder_2821",
                                    "body": "His new child is named Kimi.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "S14Nerd",
                                            "body": "I understood exactly what you meant, don't you worry",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Virtual-Chris",
                    "body": "I don’t think Mercedes was much better at strategy calls than Ferrari. There were numerous times where Lewis questioned strategy under Bono and Lewis rarely called a strategy in the last few years that I know of.  George has been a big factor in any Mercedes strategy success.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Cauliflower7877",
            "body": "Leclerc and Hamilton are both drivers who trust that their teams have more information than them. This isn't new for Hamilton, he's been like this for years.\n\nAnd they're correct in that they *should* be able to trust the pit wall for this kind of information. I don't think it's the driver's responsibility to make sure the race engineers ask for the right info. They're already driving in treacherous conditions at high speeds, they shouldn't need to think about these things.\n\nThe key difference between Ferrari and McLaren is that at McLaren they know exactly what questions to ask the drivers to get the information needed to make strategic decisions. At Ferrari they often don't do this.",
            "score": 1,
            "replies": [
                {
                    "author": "keylime503",
                    "body": "The problem with this is you now have the two drivers who want to trust their team the most on the team you should trust the least. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ewankenobi",
                    "body": "Hamilton definitely pushes back sometimes. But him and Bono were able to have good conversations and if Bono was super firm Hamilton would tow the line. Definitely remember him strongly disagreeing sometimes, and sometimes even getting the team to change strategy\n\nAlso McLaren in the past have given the driver too much responsibility in these decisions and had it backfire on them, though think they've learned their lesson.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sea_Plan_7776",
                            "body": "McLaren have fucked up with Norris in the past in that sense, but also Norris at the time simply wasn't confident enough and mature in his thinking to make these types of decisions. Norris from last year would most likely not have won this race.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "odinsyrup",
                    "body": "> The key difference between Ferrari and McLaren is that at McLaren they know exactly what questions to ask the drivers to get the information needed to make strategic decisions. At Ferrari they often don't do this.\n\nI don't think McLaren has have been quite as bad as Ferrari at this but I feel like this is also a new improvement for McLaren.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "srmybb",
                            "body": "Is it a new improvement for McLaren, or is it \"the best car allows you to make strategy mistakes and noone cares\"?\n\nLook at Mercedes when they were suddenly not in the front. Suddenly their strategy was flawed, while in seasons before it did not matter, cause the car was able to make up for it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Danominator",
                    "body": "Ferrari should get a guy like sainz that knows what he's doing and is willing to tell them \"no\" when their strategy is bad",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dadmantalking",
                            "body": "\"Please, stop inventing\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "bottomoftotempole",
                            "body": "Ferrari should hire sainz as their head of strategy. I heard thats what he is doing at his new team anyway.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "somepleb008",
                            "body": "f1 Gods pls give me seb as lewis' engineer",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Mercy_4_Potatoes",
                    "body": ">Leclerc and Hamilton are both drivers who trust that their teams have more information than them.\n\nGuess they haven't learnt anything from seeing Ferrari strategy masterclasses over the years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GunstarGreen",
                    "body": "As fans i think we forget how lonely it is as an F1 drivers. They don't see the rest of the track. They can't see where other teams are struggling, where the rain is forecast, all the data etc. A driver should absolutely be able to think that their pit wall is in a better position to decide strategy. But that faith will be eroded pretty quickly if they keep fudging it up",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FSUfan35",
            "body": ">I'm surprised Hamilton wasn't more decisive but I suppose new team new relationship so he was still learning how the atmosphere would be like.\n\nI've only been watching F1 for the last 6 years or so, but I feel like Lewis let Bono make call like this, no?  I took it as he understands that the pitwall has more data than him.\n\n>As for Norris and McLaren, they clearly learned from previous situations because both Lando and Will could tell that the type of rain that fell, will obviously not dry for the remainder of the race. Or they both just panicked and Lando boxed out of fear😅 because Lando was quite inquisitive and tried to anticipate which is no no in F1.\n\nLando's radio was the only one i went back and listened to.  I don't think they panicked at all.  Lando was using prior experience to tell Will that he didn't want to be on the track on slicks at all if there was going to be class 3 rain.  Will was just going back and saying that it wasn't guaranteed to hit the track, just it was a possibility.  They both agreed if it hit the track he would want to box immediately.",
            "score": 1,
            "replies": [
                {
                    "author": "jules3001",
                    "body": "I think the race engineers should always be making the calls. They have more data. They should only ask drivers for input, consider the input, but ultimately make the calls.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FSUfan35",
                            "body": "EDIT: I do feel like wet to dry the drivers should be the one's making that call.  But dry to wet the teams have way more data than the drivers do.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FirmContest9965",
                            "body": "You'd think so, but sometimes they make some absolutely weird calls that even armchair experts would say was the wrong thing to do. \n\nLike Ferrari in Aus, it was an absolute no brainer in the moment, not in hindsight, to pit when Max or Lando did, yet Ferrari left them out. What data were they reading that gave them confidence to leave them out? \n\nAlso with Ferrari anytime the drivers push back, they just never act like they've listened or taken onboard what the drivers have said, they just keep making these weird choices. They could have quite easily had two top 5 finishes in Aus with better strategy, yet they are now behind Stake in the championship.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Surfercatgotnolegs",
                                    "body": "I actually think that it was the right call by Ferrari. What if it rained for 1 min on one section of the track? They’d look like geniuses. It was risky but it had a high pay off and the risk taking mindset should be rewarded, not criticized, since that was a big problem in past!\n\nThe issue IMO w Ferrari is they should have SPLIT the strategy. Two cars double stacked on same strategy was idiotic. Take a risk with one, and try something else on the other by pitting one car. \n\nThey didn’t tho, probably because they didn’t have the guts to choose which driver got which.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Unfair_Fact_8258",
                                            "body": "They didn’t have much to gain and everything to lose. If they had boxed Lewis with Max, they could have got P3-P4 easily. Every other car had gone to inters. The risk-reward was too skewed. The chance they would get it right was high risk because of the surety of rain however small, with best case being P1\n\nIMO Ferrari are not a back marker team to take gambles. On a weekend where they were slower than expected, they got handed a potentially good result and absolutely threw it away",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "English_Misfit",
                                                    "body": ">everything to lose\n\nAnd it's just 5 points.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HaveABleedinGuess84",
                            "body": "Regarding changing conditions, the driver's feeling is crucial. It's why Jenson Button excelled in them, because he both had a feel for what the right move was, and was quick in the conditions. Two drivers will have different limits in ability on a damp track and the team can't make that call.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jules3001",
                                    "body": "That's why I said to consider driver input.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fussel2107",
                            "body": "Unless Ferrari",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jluc8",
                            "body": "Of course. The engineers have the data. The drivers can give their input and that might change the decision some times, but the it comes down to data and, sometimes, luck. Look at Lewis and Lando in Sochi. Both wanted to stay out but Lewis followed the team’s decision and that eas the right call.\n\nIt’s easy to say they should have do A or B after the fact. The one thing I think Ferrari missed was not following Red Bull’s call to switch to inters. There was not a great chance the track would dry quickly enough for the slicks to be an option and only a res flag would be a  good outcome. But, again, hindsight is 20/20…",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheOxime",
                            "body": "Ferrari have shown they are not able to make those sort of calls though and their drivers have historically always pushed back against them when they do.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NotTheComicHare",
                            "body": "You would think so but take one look at the strategy calls made by AT/RB or Ferrari.  I mean Carlos was quite literally his own strategist at times",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "makumuka",
                    "body": "Kimi's staying out, man?\n\nIN IN IN IN IN\n\n *lewis drives over grass, to avoid pitting\n\nStay out, stay out\n\n(Idk I only heard on the sim dane's song)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cod_rules",
                    "body": "Lewis definitely has a habit of not questioning the pit wall during races. He trusts em too much\n\nHell, even during Netherlands '22 (or 23, I'm not sure) , George decides for himself and goes into the pits after the safety car restart. Lewis needs to do it more, he's got enough race IQ to know what to do in terms of strategy.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bennet24_LFC",
            "body": "What I found baffling is that their respective race engineers told Leclerc and Hamilton different forecasts when it was time to box for inters",
            "score": 1,
            "replies": []
        },
        {
            "author": "MM556",
            "body": "\"I'm surprised Hamilton wasn't more decisive\" \n\n\nI don't think this is anything new to be honest, if I had to find one weakness with Lewis (and it would be a very minor one) it would be that he's not always as proactive or assertive as other top drivers are from time to time with strategy.\n\n\nCouple that with a new working relationship and it is more the expectation to me rather than a surprise ",
            "score": 1,
            "replies": [
                {
                    "author": "KennyMcKeee",
                    "body": "To your point, I think it's just conditioning from Mercedes. I forgot where I saw it but he said at one point he decided to trust the team on their judgements. I think if Ferrari keeps being Ferrari, he'll likely step up. But it's hard to come in race 1, and be defiant to a brand new team you're racing with for a few years. Would set a bad first impression if it didn't work out.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dasher2442",
                            "body": "I don't necessarily agree that it is just Mercedes culture, because you can go listen to Russell's radios and he certainly is much more proactive. Now maybe it's years of trust with Bono... I would have to listen to early Lewis/Bono or even Lewis at McLaren radios to know if he was ever more assertive.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "circe1818",
                                    "body": "I think the past few years with Mercedes have been rough for Lewis, and he's become less assertive because of that.  \n\nI forgot which race it was that Lewis was told not to pit despite asking for it multiple times because they didn't want to lose track position. He was basically told that if he came in, they wouldn't change his tires. Russell ignored them and came in and got new tires. Of course, he lost track position when everyone else had new tires. This has happened a few times. \n\nThere were a couple of times that Lewis didn't agree with the strategy before or during the race, and he was shot down or talked into doing what the team wanted.  Toto and Shovlin admitted more than once last year that Lewis wanted a different  strategy, spec, or setup, and they didn't give it to him. \n\nI think Spa is the clearest example of this. Lewis asked the night before, the morning of, and during the race for the 1 stop. He was told no. Toto was asked why Lewis wasn't allowed to do a 1 stop. He said they don't let drivers change the strategy during the race because they don't have all the information the team does. Which, in previous years before 2022, is true. But in the same interview, he said George calling his own race strategy was genius.\n Lewis was expected to toe the line, and he's done that to the detriment of his own race. \n\nI think the relationship with the team in this era of regulations had been really strained. He didn't think they were going in the right direction with the car, told them that, was shut out. Toto eventually came around and said the car wasn't working out and they were changing the car for 2023. Changed his mine and kept the car the same. It wasn't until mid-season, 2023, that the rest of the team finally accepted that the zero side pod design wasn't going to work.  Add in the contract issues,  Toto only offered him a 1 year contract, and had to be pushed by the board to give Lewis a multi year contract, but it was just a 1+1. It was a difficult time for him. \n\nLewis hopefully gets out of that mindset and starts being more assertive again.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "dasher2442",
                                            "body": "Yeah, unfortunately you are conspiracy pilled. I promise you Mercedes did not hear Lewis say the car was not good in 2022 and say \"fine! we are never listening to you about anything again!\" In fact, I disagree with how you have retold pretty much every one of your anecdotes as you have twisted them to be as one-sided as possible.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "circe1818",
                                                    "body": "Lol, I'm not sure how you got that from what I said, but ok.\n\nAnd I don't care if you agree or disagree. I'm going off interviews directly from Toto, Shovlin, and Allison and the team radio between Bono and Lewis. That trumps your takes. If you don't want to believe them, go ahead. I'm not going to disregard what the Mercedes team has said just because it doesn't support the narrative you want to push.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gobsmacked1",
                    "body": "I recall at least twice where Russel decided on his own to pit and it seemed to work out well for him. I wonder if Lewis and Charles should start doing this. That being said, they shouldn't have to do the race engineer's job for them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Trick_Math42069",
                            "body": "There was also a race where Russel insisted on stretching for a one stopper and got disqualified because of it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "gobsmacked1",
                                    "body": "I don't quite remember that one. Was he underweight at the end? And which race was it?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Trick_Math42069",
                                            "body": "Belgium last year, he ended up under weight because the extra tire wear wasnt planned for.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ciderhead",
                    "body": "I agree with this, was an edge Vettel in particular used to have over him",
                    "score": 1,
                    "replies": [
                        {
                            "author": "zacharymc1991",
                            "body": "But Lewis has on plenty of occasions made his own strategy calls, in Silverstone last season they thought it was time for inters but he said no and stayed out, leclerc then put and it was a disaster.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TopStar200",
            "body": "George and Marcus are a great pairing. Even in Brazil last year it felt like he agreed with George but was overruled by the strategy team.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IdiosyncraticBond",
            "body": "Funny how Bono and GP are mentioned first in the team pairing ;-)    \n\nMust say how Lando/Will handled the transition looked way better than last year.",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Control6379",
                    "body": "I knew someone was going to mention that😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tuba_dude07",
            "body": "Ferrari need english-first speakers as engineers.",
            "score": 1,
            "replies": [
                {
                    "author": "Altruistic_Sun_1663",
                    "body": "Exactly. It’s one thing to have small delays in translation or minor misunderstandings in a room standing next to each other in conversation. \n\nIt’s entirely different when those fractions of a second (or multiple seconds where things need to be repeated) are at high speed in life threatening circumstances.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TSMKFail",
                    "body": "BRING BACK ROB SMEDLEY",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ElPatioColonial",
                    "body": "This, I get the feeling Charles' engineer meant to say \"drink\" and not water but yeah lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nn2597713",
            "body": "I loved the Max/GP interactions. Of all the driver/engineer pairings right now, I feel they are most \"together\", as in they both understand in what situation and mindstate the other is right now, and what info/decision/question they need.",
            "score": 1,
            "replies": [
                {
                    "author": "ghastlychild",
                    "body": "I agree with you. They are so glued together, that it is currently extremely hard to imagine one without the other *(ironic because Lambiase was Perez's engineer at one point in time)*. It is perfectly understandable as to why Verstappen would be reluctant to proceed with a season, without Lambiase by his side\n\nOn an unrelated tangent; perhaps I will be wrong in the near future and we have yet to see it considering it is very new, but I have a positive feeling about Antonelli and Bono's partnership. I am unable to view onboard but from the bits I saw, Bono calmly notifying Antonelli on what to do, given that spin as well and the treacherous condition, provides some hope to a very formidable partnership that leads them to rewards in the future.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yosoygroot123",
            "body": "Btw is there any way we can hear/read the conversation between the all drivers and pitwall live on some app or website. On the main broadcast they don't show all the drivers conversation.",
            "score": 1,
            "replies": [
                {
                    "author": "FSUfan35",
                    "body": "If you have F1 tv you can watch the onboard camera which has the radio",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nalyu",
                    "body": "If you want to listen live onboard on F1 TV is where you should look. On youtube afterwards you can listen back. There has been a few channels some stop unannounced but last year I found Inside the Cockpit and he has continued this season.\n\n[https://www.youtube.com/@InsideTheCockpit1/videos](https://www.youtube.com/@InsideTheCockpit1/videos)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sufficient-Cow-698",
                            "body": "Thank you for the link .much appreciated",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IMMoond",
                    "body": "I think there is a live ai transcript somewhere. Either it was on f1 multiviewer or on an f1 subreddit discord. It just uses AI to transcribe the calls so its not great at attributing between driver and pitwall but its pretty solid",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SpaceNinja37",
                    "body": "There's a good transcript of Hamilton and Adami's race radio [here](https://www.racefans.net/2025/03/17/im-learning-the-car-as-we-go-full-radio-from-hamiltons-difficult-ferrari-debut/) that's a really nice insight into all the stuff that goes on between driver and pitwall.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TSMKFail",
                    "body": "F1TV has the radio transmissions via the onboard feeds.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheCrudMan",
            "body": "They even basically immediately got their best case scenario which was a safety car when everyone else pitted under green flag and they still lost positions. Disastrous strategy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StevenMC19",
            "body": "Couple things before I read too much more into your post.\n\n1. Drivers and teams have certain preferences when it comes to radio calls. Sometimes, drivers don't want radio in certain sections of the track or at all as it can be distracting. Some want only certain information. It's typically established between them how much and what is communicated over radio.\n\n2. The pairings, like you say in the first line, factor into it too, how long they've worked together, what works between them, etc.\n\nThat said, Ferrari gon' Rari. They have situations in which they like to give the drivers more autonomy in the strategy, which Leclerc has repeatedly shown frustration with over the years, and Hamilton is more of the type to voice his opinion after the plan has been executed.\n\nAnd the \"drivers can tell what they can handle or not\" reminds me of Stroll and Lando in Sochi. Sometimes you have to as a team take the safer option.\n\nAnd in regards to Lando pitting early, I again point to experience with Sochi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuzzy_Breadfruit59",
            "body": "So I have the impression that at McLaren they work much more closely with the driver and take their assessment seriously, whereas at Red Bull and Ferrari the teams clearly decide what to do.",
            "score": 1,
            "replies": [
                {
                    "author": "FirmContest9965",
                    "body": "McLaren often seem to ask the driver too much, they often come across as clueless and want the driver to make the call. It's left them with indecisions and poor calls",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "montanhas18",
            "body": "I was wondering if there was any McLaren plan before Oscar went off. Because Lando pitted that lap and Oscar was right behind. Seemed too close for a double stack but also too punishing to do another lap.\n\nHad Oscar recovered as well as Lando, would he also pitted or tried another lap?",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Control6379",
                    "body": "Before he went off, his engineer was just giving updates about the conditions and then he went off. And yes they would have double stacked, his engineer told him to box but by then he was in the green. Oscar remained silent the whole time, I suppose he was too focused on keeping it on track and then escaping the grass.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MaximumAsparagus",
            "body": "Tragic that Albon's radios seem to be missing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaoshero5567",
            "body": "i loved the convo between Max and GP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "L3g3ndary-08",
            "body": "I think Hamilton is too used to Bono and Merc that he never had to rely on them for a decision. \n\nI suspect he's going to be more active and vocal for the next set of upcoming races. At least that's my hope. \n\nAlso, water is water.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Larrytheman777",
            "body": "I would like to know how Albon communicates with the team please.",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Control6379",
                    "body": "It's fairly good since they have years in...as for what happend in AUS25 lap 44, the radio communications weren't audible on F1TV driver cam but he boxed same time as Lando and Russell so I imagine the Albon made the call",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Legitimate-Tadpole95",
                            "body": "According to James Vowles, supported by Alex, Carlos on the pitwall advised them the exact lap to box on. Alex publically thanked Carlos on Instagram as well.  To me that illustrates how switched on drivers are in changing conditions.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HungryBashar",
            "body": "And then theres Piastri, who has nerves of steel and ice water for blood",
            "score": 1,
            "replies": [
                {
                    "author": "Distinct_Ad_6023",
                    "body": "if you listen to when he goes off and reversed back on he doesn't actually say anything the whole time 💀",
                    "score": 1,
                    "replies": [
                        {
                            "author": "275MPHFordGT40",
                            "body": "Piastri is the epitome of *locked in*.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MaximumAsparagus",
            "body": "Tragic that Albon's radios seem to be missing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheCrudMan",
            "body": "I always feel like Ferrari as an organization seems to approach things like its the 1950s and we will build car and driver will drive it and everything else who cares.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SadSilentSuffering",
            "body": "Are you new to this sport?",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Control6379",
                    "body": "Yes why?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SadSilentSuffering",
                            "body": "Nothing. It’s just very obvious. We all have to start somewhere though, enjoy the ride.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok-Control6379",
                                    "body": "Anything you can teach me? For instance, what were your thoughts when you saw my points, and why they're off?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jogaboi19",
            "body": "The pit lane should 100% be responsible for bringing the drivers in, end of. They have the data and the sector times of all the other drivers on track. \n\nThis post is completely missing the plot.",
            "score": 1,
            "replies": [
                {
                    "author": "PrestigiousWave5176",
                    "body": "Not true. Max was feeding his team live info corner to corner on where it was raining and where it wasn't. That info is crucial, because the sector times only show the real picture with a 30+ second delay. If the team bases their decision making on that, they're gonna be late.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "montanhas18",
            "body": "I was wondering if there was any McLaren plan before Oscar went off. Because Lando pitted that lap and Oscar was right behind. Seemed too close for a double stack but also too punishing to do another lap.\n\nHad Oscar recovered as well as Lando, would he also pitted or tried another lap?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Splatter1842",
            "body": "Ferrari do NOT need to change their approach. The thing that most people fail to acknowledge is the Ferrari team is simply an anomaly in Formula 1. They have a different mentality entirely to the rest of the grid. Ferrari as a racing team race to sell their cars so that they can keep racing. Their aim is to WIN the race, everything else is just a bonus. When they are not clear in the lead, they take massive gambles to do so. This doesn't succeed often, but when it does it's a Monza 24 style epic.",
            "score": 1,
            "replies": []
        }
    ]
}