{
    "title": "[Lap 34] GP: Most cars fitting slick tyres | Max: Oh, okay? Fucking hell... Yeah, ok, we can do it, fuck it.",
    "author": "OutlandishnessPure2",
    "subreddit": "formula1",
    "rank": 2,
    "score": 2916,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 175,
    "url": "https://imgur.com/a/KWD2lTJ",
    "id": "1je84c8",
    "selftext": "",
    "comments": [
        {
            "author": "EnglishLitMajor",
            "body": "I really enjoyed this because less than a minute before this, he was saying that he needed to fit new inters because it was still too slippery. And then he heard this and was like \"okay? okay, fine then.\"   \n  \nI'm still curious how it would have worked out if he had pitted for inters like he initially wanted.",
            "score": 1,
            "replies": [
                {
                    "author": "fire202",
                    "body": "Running inter on a dry track destroys them quite quickly",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "Yeah, Lando talked about how his tires were pretty bad after doing two more laps in the relative dry on inters compared to Max and how he knew how that would affect his pace at the end.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hunguu",
                            "body": "It rained a few laps later",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ferna182",
                                    "body": "yeah but it's pointless if you already ruined your tyres by running them on the dry for a few laps prior to that... The whole situation is extremely tricky. You just need to be lucky enough for hte rain to come when you're close to the pits.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FlipReset4Fun",
                                            "body": "Exactly. You’d run the risk of being 2-3 secs a lap slower and melting the tread off your inters, effectively having slicks when the rain comes again. Got to be on the right tire at the right time. \n\nVery rarely does being on the wrong tire for a short period to save the pit delta, work out.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ferna182",
                                                    "body": "> Very rarely does being on the wrong tire for a short period to save the pit delta, work out.\n\nYup... But the luck factor plays a major role here too... If you stay out and the rain comes 2 corners after the pits, you're basically screwed and run the risk of binning it on your way around the whole track. If you stop and the rain doesn't come for a lap or two, you're screwed too because you'll need to stop again. You need to be extremely lucky for the rain to also come at the right time, hopefuly 1 or 2 corners before the pit entry.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AncefAbuser",
                                                            "body": "So much luck. Interslicks is a gamble",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DlSSATISFIEDGAMER",
                                                    "body": "> Exactly. You’d run the risk of being 2-3 secs a lap slower and melting the tread off your inters, effectively having slicks when the rain comes again. Got to be on the right tire at the right time.\n\nBasically what happened to Leclerc at Silverstone last year, they switched him to inters for rain that wasn't really that severe, he had a pace advantage for like 2 laps then it dried out and they kept him on inters until the next shower, by that time he was at the rear of the grid and had to switch to new inters anyways. When the 2nd rain shower hit and everyone had switched to inters he was over half a lap behind _Bottas!_\n\n[Timestamped in this F1 visualized video showing just how badly the inters did in the dry there](https://youtu.be/I7306tiYeZk?si=TGVtq3k6sb40p6k9&t=26)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "KeytarVillain",
                                            "body": "I mean, if you lose 15 seconds of pace while on the old inters and then pit for new inters, that's still faster than pitting twice for slicks and then inters again.\n\nBut you're right, it's an extremely tricky situation.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LucAltaiR",
                                    "body": "The amount of pace you lose if you pick the wrong tyres in this situation, almost always more than offset the time loss for the pit stop.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "StockAL3Xj",
                                    "body": "A few laps with inters on a dry track is all that's needed to ruin them for when the rain comes.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "EnglishLitMajor",
                                    "body": "Yeah, but his tires were already bad from going through two laps of a dry Sector 1 and Sector 2 at full speed while trying to regain the lead after pitting. Max's tires weren't as bad because he switched to inters when the track was already wet, so he didn't ruin them with dry running so much.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dac2199",
                    "body": "I think if he would have pitted one lap earlier than he did it for inter tyres he could be ahead of Lando.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "That was what he wanted. He said on the radio during the Bortoleto/Lawson safety car that they should have pitted him a lap earlier if it was obvious that the rain was heading towards the whole track.   \n  \n(But, to be clear, that was regarding the second time he pitted. This video is from before the first time.)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Krawumpl",
                            "body": "It didnt matter because he already lost too much time to be ahead after the pitstop. That what analysts and RB itself stated.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarlonShakespeare2AD",
                    "body": "Agree\n\nI hear it like “those other guys are going to live with it? Well if they can I definitely can”\n\nConfidence",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BADMANvegeta_",
                    "body": "“If these baddies can do I have nothing to worry about after all”",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PaymentPrestigious56",
                    "body": "He would've won",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Blothorn",
                            "body": "He would have taken the lead when everyone else put on inters, but the safety car would have let Norris close any gap and forced Verstappen to defend in the wet on significantly worn tires. There’s at least a good possibility that Norris would have got back past him.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EnglishLitMajor",
                            "body": "That's one potential scenario. But considering Haas ditched their inters before the restart and considering Lando's pace on the slicks during those three dry laps, I think Max would have been unhappy on the inters in the dry. Given that it's Max though, I feel like he could have made it work, but he may have had to pit for a new set of inters anyway once the rain fell if the inters were destroyed by the dry track.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hennelly14",
                                    "body": "He could have run off line somewhat to cool them until the rain came again",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PaymentPrestigious56",
                                            "body": "That's what I was thinking. He's able to save tires and if he had to defend, we know he'd be aggressive (down right dirty) to block or inhibit a pass attempt by Norris. \nMaybe I am wrong and Russell has one fall into his lap when Max and Lando wreck. \nIt's all speculation and it was the spirit of the OG comment. \nBut fuck me, right? Lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "EnglishLitMajor",
                                                    "body": "Are you being downvoted? You shouldn't be. I honestly don't think anyone can count Max out in the rain, even if you put him on the wrong tire for three laps. A small chance is still a chance.\n\nIt's fun to speculate anyway, even though as a McLaren fan, I like the way it actually ended up.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PaymentPrestigious56",
                                                            "body": "At -19 as of this comment lol\n\n\nWe share a like view. Don't count out the best and speculation is always fun. I'm a racing fan, so I just want a good race over anything else. McLaren have earned their success.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BrokeSomm",
                            "body": "Doubtful.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mtojay",
                            "body": "or he wouldnt have won. might have finished second. might have made a mistake with the wrong tire for the track and crashed. who knows.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EnglishLitMajor",
            "body": "Max and GP's communication here vs. Leclerc and Bryan's were so different. Charles and his engineer were debating hards vs. mediums until right before he pitted, and Charles was complaining that he should have been told or asked earlier than he was.\n\nLando and Will also decided on hards pretty clearly while Oscar and Tom never talked about it (only said slicks).",
            "score": 1,
            "replies": [
                {
                    "author": "dog-yy",
                    "body": "Oscar and Tom are great.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "They're interesting because they communicate really differently from the way Lando and Will communicate, and I can't decide which I prefer. They're certainly more concise than Lando and Will are.   \n  \nLando and Will spent almost the entire Alonso safety car period analyzing and reiterating the game plan for what to do when the rain hit. I thought that was really clear and helped them move and decide quickly the moment Lando went off right before the pit entry.   \n  \nOn the flipside, Oscar never said or asked a thing about the rain, didn't ask if the plan was to pit or not, and didn't indicate a course of action that he preferred. That's why Tom's wording after he went off was, \"consider boxing.\" They never talked about boxing in the first place or about what tires to go on. So I do wonder if it's enough information.\n\nMax and GP are probably the balance to go for. GP said something like, \"Tell me what tire you want by Turn 13.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hugglesthemerciless",
                                    "body": "I always feel like Will is too timid. It was a huge problem in Sochi, if he'd been more firm about telling Lando to pit he'd have won that race.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RMCaird",
                                            "body": "Yep, everyone was blaming Lando for telling Will no to slicks, but also forget that Will was basically asking Lando to make the decision with zero information about what the weather was about to do.  It's not like he was told to box and told Will no.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Mcnucks",
                                                            "body": "If he had told Lando to box for inters Lando would’ve boxed. He asked him in a way that strongly implied staying on slicks was the better option. Of course Lando was against boxing.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RMCaird",
                                                            "body": "No, Lando had almost zero information. He doesn’t have the information the pit wall have. It was insane to even ask the question and not just tell him to box. \n\nEveryone jumped on Lando because he shouted ‘no’ after being asked repeatedly if he wants to go to inters, despite Lando not being in a position to make that call. ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "knbang",
                                                                    "body": "I defended Lando and will continue to defend Lando.\n\nThey have an entire team dedicated to gathering and interpreting data in real time and they're asking the guy who is trying to drive a race car with dry tyres on a wet track in a racing situation, and pouring stress on him.\n\nMake the goddamn decision and tell him what to do.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EnglishLitMajor",
                                            "body": "I agree with you. The thing is that Lando probably would never have yelled \"no!\" on the radio if the instructions were to pit directly instead of it being a question like \"What do you think of pitting?\"  \n  \nIn McLaren's defense, there were other things going on in the big picture, too. The thing about Sochi 2021 was that it was the race after Monza 2021, the race in which they asked Lando to hold position in 2nd place to bring the 1-2 home.   \n  \nIf you watch the celebrations after Monza, you could tell that the team (esp. the mechanics) felt a level of sympathy for Lando, even in the midst of their celebrations. In 2021, he was still very much everyone's little brother figure in the team (Monaco 2021 was the race in which he was being teased by his mechanics - \"Mommy, I did a thing!\"). Lando had been in McLaren since 2017 and seemed to be their future in the way Charles was for Ferrari, and it would have been a great narrative if he had been the one to bring McLaren their first win in ages, and he didn't get to have that.\n\nMcLaren very obviously did not want to be the ones to deprive Lando of his maiden win, especially after Danny Ric had won for them just the race before and after they didn't let Lando have a shot at it.\n\nWill and Lando's dynamic is quite different from GP and Max. I can't imagine Will saying \"I'm getting very bored of this\" like GP does when Max doesn't follow what he wants. But if Will had said, \"It's going to rain a lot. We have to pit, Lando. I'm sorry.\" I totally think Lando would have done it. Will probably knows it, too. He's talked about Sochi 2021 haunting him.\n\nSo yeah, their constant communication about the rain partially stems from all this. Call it institutional knowledge. Or maybe a trauma response. 😅",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Bigbaby22",
                                                    "body": ">\"I'm getting very bored of this\" like GP does when Max doesn't follow what he wants\n\nThis is a thing that happened??",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "EnglishLitMajor",
                                                            "body": "Something along those lines! I think it was closer to \"I'll get bored of this soon, so just do it, please.\" after repeating himself several times.\n\nThat's far from the worst of it though. GP and Max can get quite snippy with each other on the radio. There was one time when GP snapped at him and told him that he could come up with the run plan himself (because Max was complaining so much). There was another time Max said sorry for being \"so on the rant\" at the end of the race. Aaaand there was another time that GP disappeared from the radio at the end of the race, and Max was like, \"Where did GP go?\" (Max had been a bit mad that race.) There was also the time that GP got annoyed with Max, and Max realized it and got him an ice cream as an apology.\n\nIt's all very domestic, really.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Bigbaby22",
                                                                    "body": "Domestic sounds very appropriate lol\n\nI'm new here and I was watching one of Charles's first races for Ferrari and Vettel refused to let him by or something and Charles was like, \"we'll have words about this later.\" \n\nYou only got one person in your ear and all your frustrations get put on them. Understandable",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EnglishLitMajor",
                                                                            "body": "Oh, welcome to the show!! Was Australia your first race?   \n  \nEnjoy the radios - they're lots of fun. There are a lot of other GP and Max examples: \n\nOff the top of my head, GP once said, \"DON'T answer me. I know what you're going to say\" after he gave Max a bit of bad news and Max starts to reply.\n\nThere's also Silverstone 2020: \n\nMax: Can we win this?  \nGP: If you get on with it, maybe. \n\nIn 2022 and 2023, Max was so dominant that a lot of the entertainment came from their radios, especially when Max wanted to go fast and GP wanted him to slow down and bring the car home.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Bigbaby22",
                                                                                    "body": "Thanks! Man, everyone here is super nice. It makes a nice change of pace from other sports. Australia was my first live race! I was afraid it was going to get cancelled. \n\nDo you know of anywhere I can watch past races. \n\n\n>Off the top of my head, GP once said, \"DON'T answer me. I know what you're going to say\" after he gave Max a bit of bad news and Max starts to reply.\n\n\n>\nMax: Can we win this?  \nGP: If you get on with it, maybe.\n\nThese are pure gold haha",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "EnglishLitMajor",
                                                                                            "body": "Heh, we have our moments on here for sure. But it's always nice to see the sport grow!\n\nAustralia was a good one for your first! \n\nF1TV has all the old races. Pretty good bang for your buck, esp. compared to other sports. You can watch the International stream (Sky F1) or the F1TV stream (used to be called the Pitlane Channel for older seasons), and you can go on the drivers' onboards and see the data channel. They'll have the qualifying and practice sessions, as well as a lot of other things, too.\n\nIf you're looking for something free, you can google 'full races f1\" and something should pop up. The official F1 account on Youtube uploaded the full Las Vegas 2023 race, too. There were also a few more races they uploaded in 2020, but I think they've hidden them now.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Bigbaby22",
                                                                                                    "body": "A lot of great resources. Thank you!",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "fknm1111",
                                                                    "body": ">There was one time when GP snapped at him and told him that he could come up with the run plan himself (because Max was complaining so much). \n\nThat one got even funnier after Q3 (where Max took pole), when Max radio'd in and apologized to GP, and GP responded with something like \"it's OK, I've gotten used to it\".",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "catbert359",
                                                            "body": "Their dynamic is so funny, their bickering is wonderful - [here's](https://www.youtube.com/watch?v=REPCLR0utMA) a compilation of it, enjoy :D",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TheEmpireOfSun",
                                            "body": "Nine of them were at fault. Only way for Norris to win at Sochi was to risk it. His engineer wanted to box and that would mean not winning, but at least getting good result. Norris wanted to risk it and it didn't pay off.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SirLoremIpsum",
                                                    "body": "People don't appreciate how much harder it is to make that strategy call when you're P1 vs P2.\n\nLando had *everything* to risk. He pits and Lewis doesn't - he loses.\n\nP2 has the option to take the 'safer' strat of pitting for wet tyres with the negative outcome being \"you were exactly where you were\".\n\nSimply following the leader in pitting / not pitting is a very easy call to make\n\nI don't blame Lando for risking it at all, it was a very hard call to make.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TheEmpireOfSun",
                                                            "body": "Definitely.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "hugglesthemerciless",
                                                    "body": "Norris had been holding Hamilton at bay for a couple laps before that, it was plausible he'd be able to continue to do so til race end",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TheEmpireOfSun",
                                                            "body": "Not really since Mercedes was way faster.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "LadendiebMafioso",
                                                                    "body": "Dude please have a look at the race trace. Lando was able to hold Hamilton behind in the dry just fine. Dirty air works wonders.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hugglesthemerciless",
                                                                            "body": "Especially since that was before ground effect cars.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Rivendel93",
                                                                            "body": "Yeah, and people forget the McLaren was super quick in Monza and Russia.\n\nLike genuinely quicker than the Mercedes and RedBull.\n\nLewis and Max didn't lose Monza because of their crash, they lost because the Mclaren's were flying.\n\nNot sure why, but the McLaren was very quick on those two tracks, but Russia was right after Monza.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "hugglesthemerciless",
                                                                    "body": "What's the point of lying about something so easily verifiable. \n\nHamilton closed in on Norris fairly quickly, he's around 4 secs behind around lap 35 and 2 seconds behind in lap 38. But once he's in dirty air he slows down dramatically. He's tickling DRS range around lap 44 and makes no meaningful progress beyond that point. At lap 49 he's down to 2s gap again and lap 50 is when he pits. \n\nConsidering that Norris was able to hold Hamilton off for 6 laps while in DRS range it is completely reasonable to expect he'd be able to handle another 3 to end the race ahead of Hamilton if they had pitted at the same time.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SirLoremIpsum",
                                    "body": "It is very interesting the way they talk to each other. \n\nI have to think that the various pairings have had a chit chat and decided what works for them best. \n\nCharles and Xavi had a big switch up one season, with the all \"question?\" after questions and I liked that, shouldn't be meme'd on. \n\nMax GP hard to replicate, they've been together SO long.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "EnglishLitMajor",
                                            "body": "Yup, I agree! I feel like different things work for different drivers.\n\nFor example, Max and GP are great, but GP's demeanor with Max likely wouldn't work with other drivers. When Max doesn't follow instructions, GP gets all sardonic and says things like, \"I'm getting rather bored of this, Max.\"\n\nI feel like that wouldn't work well with Charles (too nice for that level of sarcasm - he is the sassy one on the radio) or George (who is amusingly somewhat business-like/corporate on the radio). It might actually work for Lando, but I feel like what works best for him is just straightforward truth.\n\n(I feel like Lando hates being patronized to on the radio. Usually, his most emotive radios come from being told something that's meant to be encouraging but is maybe not 100% accurate. Some examples include Jose straight-up lying to him about him being faster on slicks in Zaandvort 2023 and Abu Dhabi 2019 when Will tries to comfort him about being slow on the hard tire.)\n\nThe \"question?\" is fine and is a common way of indicating questions on the radio. It's also sensible given that Xavi's naturally drawling and sing-songy voice makes it difficult to differentiate between questions and statements anyway.\n\nTom Stallard would make for an interesting case study. The way he communicated with Carlos was a bit different from the way he communicated with Daniel and Oscar. Carlos doesn't mind having a chat on the radio, and he likes to have a hand in the strategy calls. Daniel barely talked on the radio - complete opposite personality from outside the car. Oscar is more similar to Daniel, except he might actually give more information than Daniel did.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Apyan",
                    "body": "And then you have Lewis missing Bono.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hopenoonefindsthis",
                    "body": "Because there is very little trust/confidence on the pit wall",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CanSum1SuggestAName",
                    "body": "Hards were the wrong call however, not enough laps were left to make it worthwhile",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "Yeah, the safety car did take a significant amount of time though. They were probably thinking it would be about 20 racing laps and two or three more under the safety car.   \n  \nThey also didn't realize how much rain was incoming. Prior to pitting, the news about the rain was: \"Class 1 for a lap or two.\" Immediately after pitting, it became \"Class 2 to 3 for 1 lap.\" (At which point, Lando asked, \"Are you confident about the one lap?\" The answer was no because Melbourne lol.) And then it became \"Class 2 to 3 for a couple of laps.\"\n\nMediums for even 20 laps with no rain would probably be enough, but they likely wanted to play it safe. I also think most people stuck with the hards because that was likely the original strategy planned before the race. Leclerc hinted as much on the radio.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HkF1WEC",
            "body": "Max with the fuck it we ball attitude",
            "score": 1,
            "replies": [
                {
                    "author": "Rosieu",
                    "body": "He said something similar in Brazil last year when deciding to stay out on old inters while the rain was increasing. Seems that attitude works well for him lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Rivendel93",
                            "body": "He said same thing when he followed Hamilton into the pits in Silverstone for dry tyres.\n\nSeems the fk it strategy is effective.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Rosieu",
                                    "body": "Fuck it I should apply this strategy in my life",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AmNotTheSun",
                                            "body": "You should, I said the same thing while pulling into Wendy's the other day",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Linw3",
                                            "body": "Following Hamilton? IDK, dude is fast",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "cwtjps",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "master_scale_tipper",
                                    "body": "Do you think he said the same in Hockenheim 2019 when Stroll went to slicks?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Squeakyduckquack",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Exciting-Ebb8392",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SignalSatisfaction90",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomcat848484",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomcat848484",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomcat848484",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Im_Balto",
                                    "body": "That is how red bull wins when they don't have the fastest car. When they just say fuckit and send a strategy they can come out on top on a day when they were not the fastest in pace. \n\nThey also sometimes bottle it. I think it was Hungary last year that RB messed the strategy up when they were trying to send it and max got PISSED",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Necessary-Fee-3246",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomcat848484",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomcat848484",
                                    "body": "Think he said the same in Hockenheim 2019 when Stroll went to slicks.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "wolverineFan64",
                            "body": "When you’re as good as Max you can get away with gambles like this without completely wrecking your race if you’re wrong.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Deynai",
                                    "body": "It was a hedge, not a gamble.\n\nDoing this was a decision to *reduce* risk by matching what everyone else was doing and covering the chance that they got it right.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CanSum1SuggestAName",
                            "body": "Confidence does wonders, his mentality is if they can do it then I know I can do it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AsleepAtWheel83",
                    "body": "I’m surprised he didn’t get the penalty for cussing. Then again, the current regime can definitely give him a grid penalty in China!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShoelessVonErich",
            "body": "oh no MBS children's ears just exploded off! why max why??",
            "score": 1,
            "replies": [
                {
                    "author": "ghastlychild",
                    "body": "You too?! I just saw a bunch of kids' ears exploding as well. What have you done to the children, Verstappen? 💔😢",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OutlandishnessPure2",
                            "body": "https://i.redd.it/qvggnefi2hpe1.gif",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Homelandr",
                                    "body": "Fucking hell there's a Verstappen gif for everything",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "fake_hester",
                                            "body": "I've never seen this Max gif honestly",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Several_Morning4552",
                    "body": "yeah he cussed and nothing happened, move on.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CanSum1SuggestAName",
                    "body": "Yawn.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EnglishLitMajor",
            "body": "I've been on Max's, Lando's, Oscar's, and Charles's radios so far, and it's interesting to see the differences in opinions about whether to go to slicks or not. \n\nOscar was the most certain that he wanted slicks. Lando thought it was close, and then eventually decided that \"you can get away with a slick. Yeah, slicks.\" Both McLarens talked about this just prior to the safety car.   \n  \nCharles asked if anyone was on slicks yet right before the safety car, and his engineer was the one who said \"dry tires.\" Charles wanted the mediums but they went for the hards because that was the initial plan.   \n  \nCharles: \"I'm thinking of mediums for now. What are you planning?\"  \nEngineer: Everyone except Verstappen is on hards. Last call now! You have to tell me!  \nCharles: Okay okay, stay on hards, stay on hards, stay on hards. But freaking hell, you have to tell me first for which tires we pit, so that I can tell you.  \nEngineer: Okay, hard, hard.  \n  \nMax was the only one of the four who was saying that he wanted inters which may also be part of the reason why they went with mediums for him. Did any of the other drivers say they wanted inters?",
            "score": 1,
            "replies": [
                {
                    "author": "jbeck24",
                    "body": "Mediums seemed like the right choice either way w 17 laps of running once the safety car went in. Even without the rain they would've been good to the end",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "I agree. The safety car did take a significant amount of time though. They were probably thinking it would be about 20 laps. They also didn't realize how much rain was incoming. Prior to pitting, the news about the rain was: \"Class 1 for a lap or two.\" Immediately after pitting, it became \"Class 2 to 3 for 1 lap.\" (At which point, Lando asked, \"Are you confident about the one lap?\" The answer was no because Melbourne lol.) And then it became \"Class 2 to 3 for a couple of laps.\"\n\nMediums for even 20 laps with no rain would probably be enough, but they likely wanted to play it safe. I also think most people stuck with the hards because that was likely the original strategy planned before the race. Leclerc hinted as much on the radio.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sa_ra_h86",
                            "body": "Yeah, I didn't really understand why most of them went with hards...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Humus_",
                    "body": "Charles really wanted 4 tires on the pitstop and didn't want to make the call to mediums and risk getting just 3.\n\nThe poor guy has been with ferrari long enough to know it's not worth it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "Yeah, that was the vibe I got.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dasher2442",
                    "body": "What about Russell’s?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EnglishLitMajor",
                            "body": "George didn't volunteer his opinion. Prior to the safety car, his engineer simply told him that his safety car window was open and that it would be for slicks. George said \"affirm\" and he also reported that his fronts were going, so his engineer told him to try to find wet patches. Then, after the safety car was called, George asked \"What compound are you going for?\" and his engineer told him hards.\n\nLater, he was asked to give updates on the rain. Merc was very clear about sharing their (changing) expectations about how heavy it would be, for how long, and where on track. He was told by his engineer that they've forecasted that they would have to pit for inters.\n\nHe then said the rain was getting heavier, then the McLarens went off, and he called to box, which his engineer immediately (and calmly) confirmed.\n\nHis engineer is REALLY calm.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "orus_heretic",
                    "body": "Ferrari engineer comms are truly baffling.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blaydesofchaos",
            "body": "I turned on Max's feed as soon as the Mclaren's went off and those laps with GP giving him minimal but valuable input was the perfect cohesive relationship. Max was driving the whole lap on rails except for the final bit as it was really wet, and GP called him in when they understood that staying out wasn't going to matter anymore.\n\nNow if Ferrari did the same, with their engineers giving the right kind of info after the gamble(which was the right call at the time) and pulling them in, they would have easily finished higher up.",
            "score": 1,
            "replies": [
                {
                    "author": "punsanguns",
                    "body": "Ferrari engineers sound like they weren't paying any attention to the race at all and when a driver asks something they are like, \"Let me pause my Friends re-run I was watching and get back to you\"\n\nDriver: \"...\"\n\nEngineer: \"Oh it's nothing. Push harder. Question?\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "blaydesofchaos",
                            "body": "It sounded more like a translation issue coupled with them probably not discussing things beforehand. Which for Lewis may still be okay, but for Charles is a bit weird now that he has been in the team awhile.\n\nFreddy boi needs to understand that the engineer for each driver is a key cog in the machine, I hope they can work something out.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Im_Balto",
                    "body": "everytime I hear ferrari team radio it makes the other team radios feel so much more cool, collected, and prepared.\n\nThose clowns make everyone else sound like fighter pilots in top gun on the radio",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OutlandishnessPure2",
            "body": "Jail for Max for swearing 🥲",
            "score": 1,
            "replies": [
                {
                    "author": "RoseWould",
                    "body": "Lewis broke to rule too. They both have to sit in the corner and miss snack time.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "StuBeck",
                            "body": "It’s not a rule during the race. The rule is only for interviews out of the car.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "raur0s",
                                    "body": "Max will do all the interviews strapped into his seat to work around the problem.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MM556",
                            "body": "What did Lewis say? ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RoseWould",
                                    "body": "After he left the pits, he asked where he was (position), and when they told him 9th, he said fuck, fuck, fuck, fuck, fuck. They used the beep censors, but you still could tell what it was",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "pies1123",
                                            "body": "It was a humourously long beep too. So good.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JustLikeZhat",
                                                    "body": "The beep was long, but Lewis didn't actually curse like that. He only used one word once (shit). I guess FOM just wanted to go for a certain effect. \n\n\n@RoseWould must have just assumed it had to be all cursing due to the beep and filled in the blanks with other words. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Minimum_Airline3657",
                                    "body": "He said ah shit or something like that and then said sorry he forgot he had the radio on, it’s definitely on his mind the swearing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "asininesoul",
                    "body": "Lando for the cool down room",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ianjm",
                    "body": "PUT THAT MAN IN JAIL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hangry-millennial",
            "body": "Mediums looked like the right tyre choice given how few laps were left in the end (with Safety Car taking a good chunk out of the race distance), in addition to having better warmup than the Hards.",
            "score": 1,
            "replies": [
                {
                    "author": "RM_Dune",
                    "body": "And the track still being a bit damp.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "persepolisrising79",
            "body": "thats the fucking spirit",
            "score": 1,
            "replies": [
                {
                    "author": "drstm",
                    "body": "You sir have a race ban now congrats",
                    "score": 1,
                    "replies": [
                        {
                            "author": "persepolisrising79",
                            "body": "Simply lovely",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GeneralUranuz",
                                    "body": "I'll talk to you in my private press conference.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RosebudWhip",
            "body": "That's the spirit, Max!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mtojay",
            "body": "thats two race bans. said the f word twice in a single radiomessage. appaling. can somethign think of the kids please. hopefully mohammed is on it already.",
            "score": 1,
            "replies": [
                {
                    "author": "Syrinx_Hobbit",
                    "body": "Even Hamilton cursed at his engineer--I consider it a sign of solidarity since he is usually relatively polite.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "djwillis1121",
            "body": "When are people going to realise that the swearing rule never applied to swearing on the radio?",
            "score": 1,
            "replies": [
                {
                    "author": "Blandine_Lyon",
                    "body": "God forbid people make a few jokes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "djwillis1121",
                            "body": "A few? There have been about a million and it got pretty old a while ago",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SirLoremIpsum",
                                    "body": "> A few? There have been about a million and it got pretty old a while ago\n\nThat's how we do it on reddit!! I'd be disappointed if it was 100% original content.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "CanSum1SuggestAName",
                                    "body": "it's almost as tired as the 5 seconds for Ocon. People here are a lot less funny than they think they are lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "B_Roland",
                                            "body": "[insert name] WDC confirmed",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "InternalAd3921",
                    "body": "i'm just realizing now i guess? when does it apply?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "djwillis1121",
                            "body": "Only for FIA media sessions like press conferences, TV interviews etc",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zaviex",
                                    "body": "Which swearing was never allowed in as well. The new change just added formal punishment. Before that it was entirely up to discretion",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MinimumIcy1678",
                            "body": "When they're on Songs Of Praise",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RM_Dune",
                            "body": "FIA events like their press conferences, interviews on the grid, etc. Essentially if you're explicitly speaking to the audience in an FIA ran event. While we do get access to the race drivers' radio, it's primarily for team communication so it gets a pass.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cekeste",
                    "body": "When Stroll becomes decently rated or Hakkinens retirement becomes a well known fact.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "djwillis1121",
                            "body": "Or Ocon stops getting 5 second penalties for everything",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mlo_66",
            "body": "You can hear the cogs turning in his head",
            "score": 1,
            "replies": [
                {
                    "author": "djoubb",
                    "body": "A quick thought if the previous 8 corners would be doable on slicks, and then, “yeah fuck it”\n \nI would love to have his level of confidence 😆",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RIP_GerlonTwoFingers",
            "body": "Pit wall: “Max we only have square tires left. We will have to fit them on”\n\nMax: “fuck it. We’ll make em work”",
            "score": 1,
            "replies": []
        },
        {
            "author": "josephrehall",
            "body": "\"fuck it, let's send it\" - Max Verstappen",
            "score": 1,
            "replies": []
        },
        {
            "author": "meowthesnail",
            "body": "Peer pressure works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ship0f",
            "body": "That was so funny. He was not liking the idea but had to change the tyres anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnProcrastinator",
            "body": "Legendary competitor",
            "score": 1,
            "replies": []
        },
        {
            "author": "caotic",
            "body": "On another note, How are you supposed to tell who's driver is from this angle.   \n  \nThis specific one is obvious because of Max's helmet, but I wouldn't call that a consisten way to tell drivers apart.   \n\n\nAre we suppose deduct what driver is ?  \nWhy there is not a space dedicated to the pilot number from this camera ?",
            "score": 1,
            "replies": [
                {
                    "author": "crubeens",
                    "body": "Tbf if you’re watching this on tv it’ll come up with the name of the driver on the screen or their name will be highlighted on the timing tower. I think teams before used to have their drivers @ on the halo but not sure if anyone does this anymore",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "creatorop",
                    "body": "learn the helmets if you are an nerd like me",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zakinfenwa",
                    "body": "Well this RB isn’t driving around the Haas’ so it’s Max",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PhoenixUNI",
            "body": "Silly ? - is there a way for me to re-watch the race and get comms like this? And/or where are people pulling stuff like this from?",
            "score": 1,
            "replies": [
                {
                    "author": "gerson250991",
                    "body": "You can see all onboards with radio and all in F1TV",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PhoenixUNI",
                            "body": "Are those live, or delayed til after the fact?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JustLikeZhat",
                                    "body": "Live, but there's a small delay in the radio exchange itself, like 5s or something. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PhoenixUNI",
                                            "body": "Ok cool. I'm gonna have to check that out then. Thanks!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "blckhead423",
                    "body": "F1TV. They have feeds for every driver.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bad__username__",
            "body": "Has anyone been able to do a costs calculation on this usage of the English language in F1?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Urban-Junglist",
            "body": "Champion 🏆",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gypsy_Queen23",
            "body": "He must have pressed K1",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinkie5839",
            "body": "Will this lead to Super Sayain MBS?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neflite_Art",
            "body": "How much will Lewis and Max be paying for these adult words? :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "Testcase_",
            "body": "He is doing it on purpose, \"the ball is now in MBS corner\"",
            "score": 1,
            "replies": [
                {
                    "author": "CanSum1SuggestAName",
                    "body": "there's no swearing ban for the radio",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zaviex",
                    "body": "Every single driver swore on the radio.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "drt786",
                    "body": "As one of my former managers used to say “I leave it to you to decide”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zephron29",
            "body": "My read on this was more of a \"oh ok, I don't give a fuck what they're doing, I need inters\". GP clearly had his mind made up, and Max was done trying.\n\nHamilton had similar conversations with his engineers.\n\nIn the end, the engineers were wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "toodog",
            "body": "there was no fucking swearing,\nwe don’t want the championship won on swear word penalties.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ham-Ha",
            "body": "How's that swearing policy working out ??? 🤣",
            "score": 1,
            "replies": [
                {
                    "author": "Jorrie90",
                    "body": "That isn't for board radios",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}