{
    "title": "Ferrari's points after the opening race since 2010 - their first time under 10 points",
    "author": "Schlapfel9",
    "subreddit": "formula1",
    "rank": 5,
    "score": 1206,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 91,
    "url": "https://i.redd.it/qplrr0puahpe1.png",
    "id": "1je9qet",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[The **Statistics** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_statistics) is reserved for posts highlighting interesting statistics. As a rule of thumb, Statistics posts need to inform readers through visualizations and insights that cannot be obtained from raw data alone. For example, a post containing a qualifying gap between two drivers expressed in tenths of a second is an easily obtainable raw piece of data and constitutes a bad Statistics post. A visualization of what that translates to on-track, or visualization of how that gap came to be would constitute a good Statistics post.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JKJay2005",
            "body": "That chart seems bullish for next year.\n\nSo NEXT YEAR IS OUR YEAR!!",
            "score": 1,
            "replies": [
                {
                    "author": "Arglefarb",
                    "body": "We are checking",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lobsters4",
                    "body": "Only if Lewis remembers to press K1.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Different_Earth6310",
                            "body": "And Charles doesn't drown!!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DiddlyDumb",
                    "body": "Buy low, sell high on copium",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "K_K_Rokossovsky",
                    "body": "FORZA FERRARI!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheSalmonRoll",
                    "body": "Dallas Cowboys 🤝 Ferrari\n\n\"Next year is our year\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Melon_Mann",
                    "body": "https://preview.redd.it/8p9fkzzywhpe1.jpeg?width=960&format=pjpg&auto=webp&s=6d18100758b9dbe1187e89e7809374418ad1e0f1\n\nFML then, one year too early",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bigpoppa611",
                    "body": "FOR REAL THIS TIME",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FewCollar227",
                    "body": "They'll get lower",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EconomistIll4796",
                    "body": "Or NEXT NEXT YEAR IS OUR YEAR.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FewCollar227",
                    "body": "They'll get lower",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OonseOonseGuy",
            "body": "Team made a risky call to switch to slick tires during a late-race downpour. It is what it is, onto Shanghai.",
            "score": 1,
            "replies": [
                {
                    "author": "NeutronBeam04",
                    "body": "Even though I was really done with Ferrari bs last Sunday, I do think the panic around Ferrari's performance is a bit over the top and unwarranted. Tricky race, bad qualifying from both drivers and a risky strategy call. Shit happens, Ferrari aren't the best at executing risky races anyway. If even after 6 races they haven't improved, we have good reason to worry.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Schlapfel9",
                            "body": "Ngl i think the biggest problem was the communication, it was horribld to watch. Ferrari always has like these races in the seasom and it just happened to be the first race. If they are Top 5 in China i am sure there's no reason to worry",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "grandtheftzeppelin",
                                    "body": "it's like... did Lewis and Ricci even exchange any words before the race? like, ever?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Appropriate-Leek-919",
                                            "body": "\"leave me to it please\" \"LEAVE ME THE FUCK TO IT BONO, I MEAN RICKY\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Vasst13",
                            "body": "Anything less than a championship is a failure for Ferrari this year, especially because they were extremely close to winning it last year. It's inexcusable to go backwards in development, when they managed to build and upgrade a very competitive car last year, just to throw it all away for a new concept *in the last year of the current regulations*. They're wasting a generational talent who's stated he wants to win a championship with Ferrari and they're about to send into retirement yet another great champion. It's sad what this once great team has turned into.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Denominator0101",
                            "body": "Was the quali really that bad from the drivers? Leclerc didn't go out for his second Q3 lap presumably because he felt he had got what he could out of the car. I agree it's not doom and gloom for the season but equally looking just at this weekend they were somewhat off the pace in both quali and race and have work to do if this isn't an outlier.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Qyx7",
                                    "body": "Leclerc did go for a second Q3 lap, he just aborted because he wasn't improving",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Arado_Blitz",
                                    "body": "He did, didn't he? I thought he just made a mistake on his 2nd run and it was mentioned he was also on used tyres but I don't know if it's true. Obviously he couldn't fight for pole but he could definitely end up somewhere around P4 if he did better. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "420fanman",
                    "body": "They need to study game theory. They should have done split strategies; one on slicks and one on inters. At least hedge your bets so if one goes to shit you’re still in the positives. Instead they ruined both drivers by flip-flopping.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SemIdeiaProNick",
                            "body": "This is the real issue. Sure, Hamilton couldnt get pass Albon but the track in itself was awful for overtakes and the Williams were always pretty strong on straights. \n\nHad the track dried sooner (or rained less than it did) people would be praising Ferrari for a stroke of genius strategy. But they should never be in that position because they had both cars in the perfect spot for a split strategy. Instead of betting on both cars having a lucky moment, they should have split so on of them would have lost a lot of positions for sure but the other would be guaranteed in a good spot",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lobsters4",
                            "body": "Charles did suggest that and they ignored him.  Bah.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "420fanman",
                                    "body": "Ferrari doing Ferrari things 🙃🙃",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lobsters4",
                                            "body": "Maybe they thought he was water drunk or something.  Wheee...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ubelmann",
                            "body": "I don't know, I don't often love splitting strategies.  Sure it's a hedge, but you're also guaranteeing that you put one of your drivers on the wrong strategy.  And that can mess with team chemistry, too, because whoever gets on the wrong side starts to wonder if you are favoring the other driver.\n\nI think it's more a matter of correctly assessing the situation at the time and getting both your drivers on the right strategy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SemIdeiaProNick",
                            "body": "This is the real issue. Sure, Hamilton couldnt get pass Albon but the track in itself was awful for overtakes and the Williams were always pretty strong on straights. \n\nHad the track dried sooner (or rained less than it did) people would be praising Ferrari for a stroke of genius strategy. But they should never be in that position because they had both cars in the perfect spot for a split strategy. Instead of betting on both cars having a lucky moment, they should have split so on of them would have lost a lot of positions for sure but the other would be guaranteed in a good spot",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "420fanman",
                                    "body": "Exactly. \n\nTheir drivers would have been top 5 had they stuck with slicks when safety car was called. Then depending on race pace, a real good shot for top 3. If they went inters right away, they would have kept their spot in top 5. Even if one driver’s strategy failed, they would have easily gotten way more points. My figures might be a bit off as I’m going off memory, but they did the worst call out of all possibilities. 🤦‍♂️ \n\nI’m curious now, I may do an indepth analysis.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheDeamonMeteor",
                    "body": "NextRace™",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "wouldz",
                    "body": "Thank you. So much overly dramatic discourse from a clearly wild card round.\n\nReminded me a bit of Brazil last year.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ryokevry",
                    "body": "It may not even make into top 20 Ferrari fuckup, or top 10 since Charles joined the team. What they did in Silverstone last year easily worse already…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RoGeR-Roger2382",
                    "body": "I’m no strategist but they should’ve told Lewis and Charles to pit when Max did for inters",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ravenfromthetown",
            "body": "I’m moving up and down, side to side like a roller coaster",
            "score": 1,
            "replies": []
        },
        {
            "author": "iSimp4Aerith",
            "body": "2008 opener Ferrari scored 1 point; went on to win the Constructors'",
            "score": 1,
            "replies": [
                {
                    "author": "Zealousideal_Honey80",
                    "body": "That was with the old point scoring system, and only 6 drivers finished the race. Kimi who scored that one point (or 4 with the current system) retired on lap 53.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FurioGiunta2000",
            "body": "I just want to remind you that the longest period without a championship title for Ferrari was 16 years from 1983 to 1999. This season Ferrari is trying to break this record even further.",
            "score": 1,
            "replies": [
                {
                    "author": "F1Fan2004",
                    "body": "They already broke it didn't they? From 2008 to 2024 there are 16 years, and they didn't win it last year",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ExternalSquash1300",
                            "body": "Holy shit that’s sad.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "_mrshreyas_",
                                    "body": "Also iirc, last year's constructor championship was the closest ever by points percentage.\n\nFerrari were so close there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "banned20",
            "body": "Based on this chart, there's no hope for this year or its a massive outlier",
            "score": 1,
            "replies": [
                {
                    "author": "K_K_Rokossovsky",
                    "body": "Everything is an outlier. Have enough and you can find the aggregate",
                    "score": 1,
                    "replies": [
                        {
                            "author": "banned20",
                            "body": "No, I meant that their better years 2017, 2018, 2022, 2024 have high peaks. \n\nIf we want to hope for a good year, prey this is massive outlier",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Psych_Crisis",
                            "body": "This is absolutely the way to look at these stats. Sure, it's fun to make observations that say, Alex Albon has twice as many points as Charles and Lewis combined, but you can't use that to predict much. At least not if you like being right.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sadicarnot",
            "body": "There is this video of all of the radio between Hamilton and the pit wall. I think it would behoove Ferrari to get the race engineer to become more proficient in english. The other takeaway I have is that he does not really do anything to calm Lewis. Former race engineers such as Steve Nichols has spoken about how part of his role was to reassure Prost that things were going well to keep his confidence up. You can tell at times Lewis is panicked because he is second guessing the decisions Ferrari is making. Bono spoke in such a way to keep Lewis focused as much as he could. GP does the same with max. This combination of Lewis and engineer needs to improve trust and communication wise if they have any hope of success. \n\n[https://youtu.be/02CU2nE9cUY?si=9jnQHG2WdC17ikw9](https://youtu.be/02CU2nE9cUY?si=9jnQHG2WdC17ikw9)",
            "score": 1,
            "replies": []
        },
        {
            "author": "gonzo5622",
            "body": "My god, 2022… that year looked great for them! They had the sexiest car ever made and it was super fast!",
            "score": 1,
            "replies": [
                {
                    "author": "_Shritej18",
                    "body": "Here comes the sim racer blasting Du du du",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CowFinancial7000",
            "body": "I want to get off Mr bones wild ride",
            "score": 1,
            "replies": [
                {
                    "author": "shutinlear53",
                    "body": "https://i.redd.it/aab4eid7chpe1.gif",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CowFinancial7000",
                            "body": "Words of wisdom",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lobsters4",
                            "body": "Wait...are we not allowed to get out?????????????\n\n![gif](giphy|h58E0JsuK3h3d8B1do)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "justk4y",
            "body": "“Why are we on so few points?”\n\n“Must be the low points total”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Perfusion",
            "body": "The night is darkest just before the dawn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Full_Fold_8732",
            "body": "The race was messy all around and strategies impossible to predict. They got unlucky in a couple instances and made a couple bad calls in others. I wouldn’t say this will be indicative of their season.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old_Relationship_587",
            "body": "Pointless graphic. Every race is different. Could be affected by wether, driver errors or stupid strategy calls. And of course, luck. Ok they got less points, so? We know they have better pace than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soggy_Bid_6607",
            "body": "*One of the most expensive driver’s contracts in history*",
            "score": 1,
            "replies": [
                {
                    "author": "FloatingCrowbar",
                    "body": "But strategy team looks like they all work for food.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Father_Chipmunk_486",
                            "body": "Food coupons",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Soggy_Bid_6607",
                            "body": "Ricky gets paid in a-meat-a-balls.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suhass_619",
            "body": "I'm more surprised to see that they managed to get 19 points in the opening race in 2020, considering how the season ended. It's probably their worst in a few decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ignorantwat99",
            "body": "Why is anyone trying to draw conclusions from a) the first race of the year and b) the first wet australian grand prix in how many years?",
            "score": 1,
            "replies": []
        },
        {
            "author": "newby202006",
            "body": "Ah that 2022 season",
            "score": 1,
            "replies": []
        },
        {
            "author": "ocddoc",
            "body": "Believe it or not, calls",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignoreOscur0",
            "body": "We had to show Lewis rock bottom. Now he will know the full spectrum of Ferrari from day 1",
            "score": 1,
            "replies": [
                {
                    "author": "Kolec507",
                    "body": "I mean tbh they can't really disppoint him now anymore, right?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lobsters4",
            "body": "FUCK 2022.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super_Scientist_1",
            "body": "All I see is 2012.  Hopium MAXXXXXXXXXXXXXXX",
            "score": 1,
            "replies": []
        },
        {
            "author": "akismegumi",
            "body": "Ferrari just need to be consistent and even that..seems to be asking for a lot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fitzriy",
            "body": "Tbf they never won the title with 10 or more points in the first race since 2010.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BenjaminJArsenault",
            "body": "Welcome to the 1980 Formula 1 World Championship",
            "score": 1,
            "replies": []
        },
        {
            "author": "hubertwombat",
            "body": "Lamentable",
            "score": 1,
            "replies": []
        },
        {
            "author": "littlepurpleplopper",
            "body": "worth saying that in 2012 they missed the drivers title by about 3 points....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yerriff",
            "body": "Can't believe they got a podium in 2020",
            "score": 1,
            "replies": []
        },
        {
            "author": "Averagebaddad",
            "body": "Wow they are not very consistent",
            "score": 1,
            "replies": []
        },
        {
            "author": "Morello210",
            "body": "Seb really tried his best to bring bsch WCC back to maranello",
            "score": 1,
            "replies": []
        },
        {
            "author": "HaveABleedinGuess84",
            "body": "$100 Million salary.",
            "score": 1,
            "replies": [
                {
                    "author": "FrostyTill",
                    "body": "$62m heritage bonus for just existing on the grid and showing next to no sustained improvement season by season for the last 16 years.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HaveABleedinGuess84",
                            "body": "Just endless shambles. How many serious contenders have they produced since 2008? 4? IN SEVENTEEN YEARS? What a wasted life this has been!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FrostyTill",
                                    "body": "Genuinely thought they’d win a title *looooong* before McLaren so imagine my shock when they didn’t. McLaren spent a decade yo-yoing between upper midfield, lower midfield and back of the grid yet somehow *McLaren* sorted their shit out to win a title before Ferrari??",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kzzzzzzzzzz28",
                                            "body": "Zac absolutely deserves top credit for basically turning around Mclaren from McHonda horror all the way to the current WCCs in a span of 7 years(his tenure as CEO). Hiring the right people(especially Stella who seemed to be one of the final keys), all the sponsorships and deals, etc.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "wokwok__",
                                    "body": "Careful, or they might threaten to leave the sport again lmao",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wijn82",
            "body": "Should’ve kept sainz",
            "score": 1,
            "replies": [
                {
                    "author": "XtremePhotoDesign",
                    "body": "The guy who crashed?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_Shritej18",
            "body": " That's the sacrifice they are okay with because they are miles ahead in Aura points",
            "score": 1,
            "replies": []
        }
    ]
}