{
    "title": "In a video from F1 around a month ago, a piece of lost media was shared: Vettel's onboard pole lap in Italy 2008 (look at 13:21)",
    "author": "F1Fan2004",
    "subreddit": "formula1",
    "rank": 18,
    "score": 107,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 27,
    "url": "https://youtu.be/858VJ9mOvE8?si=-USEO_r6-3nwMcuS",
    "id": "1jea06i",
    "selftext": "For those who don't know (from Wikipedia): Lost media are any media that are believed to no longer exist in any format, or for which no copies can be located.\n\n  \nThere wasn't any onboards of Vettel's lap before this (although watching the video quality of it I understand why it wasn't posted anywhere)",
    "comments": [
        {
            "author": "EmergencyCelery3262",
            "body": "This video also features never seen before t-cam onboard of Kimi's 2005 monaco pole. It's such a shame that we can't access FOM's onboard archive, it would be an F1 enthusiast's dream.",
            "score": 1,
            "replies": [
                {
                    "author": "JayDaGod1206",
                    "body": "I don’t know why they don’t have a subscription service for this. Historical F1 film and content for an extra price. Just look at NFL Films. Imagine that for F1",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EmergencyCelery3262",
                            "body": "FOM's only job is to copyright strike old f1 onboards on youtube.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fantastic-Trick6707",
            "body": "Vettel is a top 15 driver of all time in my opinion",
            "score": 1,
            "replies": [
                {
                    "author": "F1_Skittle",
                    "body": "Why not top 10?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "User-K549125",
                            "body": "Because there are at least 10 drivers that are better than him.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "charlierc",
                                    "body": "Kovalainen and Trulli as two of them if you believe the AWS stats bot in 2020",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Fantastic-Trick6707",
                                            "body": "this was only about qualifying pace.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "User-K549125",
                                            "body": "It was an opinion, not based on statistics. \n\nNot *my* opinion; I was merely answering a question with a logically-obvious answer.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "artistsandaliens",
                                    "body": "Will Buxton alert",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PapaSheev7",
                    "body": "I agree, he's a top 15 driver of all time. He's also a top 10 and top 5 driver too, for that matter.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "aneiq_1",
                            "body": "Top 10 most likely - curious who your top 5 are if Vettels in that",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PapaSheev7",
                                    "body": "Sure, as of now I've got Clark, Schumi, Prost, Lewis and Seb in that order. Although at the rate Verstappen's going, especially if he somehow wins the title this year, I'm gonna have to knock Seb a spot down.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spongemongler",
                                            "body": "On the top of my head, I’d probably also put Senna, Verstappen and Alonso (yes, bias) above Vettel. Top 10 at his peak could be fair imo. Vettel was just never amazing again after he left Red Bull, and he got showed up a bit by Ric and Leclerc. But it’s all subjective.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "dirtyjoo",
                                            "body": "Vettel never won after starting lower than 3rd on the grid, which maybe could say he was the greatest qualifier of all time, but it could also be pointed out that he is also lacking in having those types of drives that you've seen the others in that list have. After Brazil 24, Verstappen has won from P1, P2, P3, P4, P6, P7, P9, P10, P14 and P17.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SebsFavoriteRedditor",
                    "body": "ok go back in your cage now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NorthKoreanMissile7",
            "body": "That lap was blurrier than a Japanese 🐈",
            "score": 1,
            "replies": []
        },
        {
            "author": "SebsFavoriteRedditor",
            "body": "Track Conditions: Lake",
            "score": 1,
            "replies": []
        },
        {
            "author": "mur-diddly-urderer",
            "body": "That looks like something im half remembering from a dream lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "deathray1611",
            "body": "WHAT THE HELL HAPPENED WHY ALL THE COMMENTERS GOT NUKED!?\n\nEdit: all's well, Reddit things again",
            "score": 1,
            "replies": []
        },
        {
            "author": "User-K549125",
            "body": "I mean, I totally understand why this was never released. Only the most hardcore fans would even bother watching that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cosmic_Starlight",
            "body": "after seeing that i now wonder if montoya's spa 2001 onboard pole lap wasnt posted for the same reason, but then again it wasnt near as wet as vettel's",
            "score": 1,
            "replies": [
                {
                    "author": "EmergencyCelery3262",
                    "body": "Spa 2001, perhaps montoya's best pole lap alongside monaco 2002 and silverstone 2002.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProDrug",
            "body": "Hahaha I clicked into it thinking maybe it would be worth A upscaling or something. Did not realize it was just a Vaseline smear on a lens with a guy going vrrom vroom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lieutenant_0bvious",
            "body": "I remember when Vettel won that race- Flavio Briatore was talking trash because the wing settings were so aggressive.  Turns out all that wing was just what the doctor ordered.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eproxeri",
            "body": "Verstappens Monaco S3 always gives me the goosebumps. Monaco quali just hits different.",
            "score": 1,
            "replies": []
        }
    ]
}