{
    "title": "Ok c'mon guys, who of you was this? Don't troll Gamers like that...",
    "author": "lyriktom",
    "subreddit": "Gamingcirclejerk",
    "rank": 9,
    "score": 499,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 149,
    "url": "https://i.redd.it/4rs2gh64bfpe1.png",
    "id": "1je1m5v",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "REMINDER: CENSOR ALL SUBREDDIT NAMES AND REDDIT USERNAMES IN SCREENSHOTS OR YOU WILL BE BANNED!!\n\nPlease report any posts not following this rule!!    \n\nLooking for serious or sincere discussion? Check out our new subreddit r/Gamingunjerk\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAmGroik",
            "body": "\"Digital war crime\"  \n\"I'm booting up GTA San Andreas\"\n\nEven in this guy's wildest fantasies there's nothing he can do about it.",
            "score": 396,
            "replies": [
                {
                    "author": "JenniLightrunner",
                    "body": "clearly playing GTA San Andreas is a major war crime",
                    "score": 95,
                    "replies": [
                        {
                            "author": "RABB_11",
                            "body": "He's playing the touch screen version you get on Netflix",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "279S",
                            "body": "According to Elon Musk, yes.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RickySuezo",
                    "body": "There’s an inherent laziness about all their complaining. This is the most important thing they have to worry about in their lives but they’ll only mildly inconvenience themselves to do anything about it.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "disenchantor",
                    "body": "Digital war crime— lol he can't go outside.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "mudkiptoucher93",
                    "body": "But gta sa has a dei protagonist /s",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Adjective_Noun_4DIGI",
                            "body": "And it takes place in the 90s, in California, when absolutely nothing \"woke\" happened at all. Especially for Black people!",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "voom3",
                                    "body": "And definitely there's not any \"girl boss\" characters!",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Animefox92",
                                            "body": "It's amazing these people are so worked up about Lucia when Catalina predates her by over 20 years... like powerful Latina woman who is completely psycho and the literal bug bad of GTAIII... like she did everything first except be the Protagonist lol ",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Shire12",
                                                    "body": "something tells me the anti-woke crowd would hate Kendl with their entire being if San Andreas came out today let alone Catalina lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "PhantomMuse05",
                                                            "body": "It's because reactionaries feel only nostalgia. It's not woke because it's from The Good Times(tm), and they probably have a thousand contradictory excuses for why it's different, but that is all, 100 percent, cope.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Illustrious_Song7555",
                    "body": "Broke: The commodity has subsumed any hope for gamer radicalization\n\n\nWoke: Gamer is working on the Basilisk, which they consider a moral imperative, thus the digital warcrime commited was simply dedicating time to anything but the inception if our machine god, willingly condemning oneself to an eternity of simulated hellfire just for the oppourtunity to run around looking for a low poly bigfoot.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "chapadodo",
                    "body": "an ex friend refused to play San Andreas because CJ is black before anyone online knew what woke ment",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "TechnicalPotat",
                    "body": "They also said they’d make the execs play it. Then after they’ll talk about who they think is cute.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "IAmGroik",
                            "body": "I think Big Smoke is cute 😳",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "moansby",
                    "body": "Reminds me of this YouTuber who got his account hacked, what did he do? He challenged the hacker to a game of Halo reach",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ZeGuru101",
                    "body": "Don't forget \"refunding so fast that my bank account will get whiplash\".\n\nWhoah, there! Slow down!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BuffaloSuspicious530",
            "body": "Please god give the male MC a boyfriend because it would be fucking funny.",
            "score": 203,
            "replies": [
                {
                    "author": "kimesik",
                    "body": "The male MC is confirmed to be in relationship with the female MC :pensive:",
                    "score": 60,
                    "replies": [
                        {
                            "author": "RealityMalady",
                            "body": "But what if... pegging?",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "Adjective_Noun_4DIGI",
                                    "body": "GTA6 confirmed less edgy than Deadpool.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "mr-kvideogameguy",
                                    "body": "Pegging mini game\n\n\nPress X for soft slam, square for heavy slam, left joystick to aim, bonus points if you find the prostate \n\n\nThis is required to beat the game and it's the second to last misson\n\n\n\nAlso option 2 player mode, with online, leaderboards, best way to make money in GTA6 online, and you have POV options\n\n\n\n\n\n\nTo piss off the anti-woke crowd as most of them would play as guys in GTA online and so they'll have to replay the pegging minigame over and over to get that $10000000 flying bike, heck they might start to enjoy watching their \"ultra chad\" OC getting pegged",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "egoserpentis",
                            "body": "Aren't they siblings? Or was it outdated info?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Upstairs_Ad_2622",
                                    "body": "It looked like she was sitting on top of him in the trailer, most siblings don’t do that I think",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "BuffaloSuspicious530",
                                            "body": "Except Mihoyo games according to their fandom.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "cute-enby-femboy",
                                                    "body": "?????\n\nAs someone who used to play hoyo games... WHO ARE THE SIBLINGS THAT DO THIS? IT NEVER FREAKING HAPPENS NOR IS IMPLIED ONSCREEN AFAIK LOL",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "BuffaloSuspicious530",
                                                            "body": "ZZZ unofficial sub for examp\n\nI meant the fandom not the game.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Particular-Place-635",
                                            "body": "speak for yourself buddy",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "mr-kvideogameguy",
                                            "body": "I heard goth cannibals do that sometimes",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ryebread666Juan",
                            "body": "Yeah I thought one of the first things we learned about this game was they were doing a Bonnie and Clyde type story of a couple doing robberies",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rockglen",
                    "body": "No one tell him about Trevor's relations with Wade.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "improvedalpaca",
                    "body": "They said they wanted it to be offensive. Monkey paw curls",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "NikiBubbles",
            "body": "\"It's supposed to be offensive\" b\\*tch, nothing is more offensive to you than the illusory woke.",
            "score": 177,
            "replies": [
                {
                    "author": "Blue_Space_Cow",
                    "body": "Has to be Offensive to anyone but them, duh",
                    "score": 87,
                    "replies": []
                },
                {
                    "author": "Ramuel_944",
                    "body": "Imagine the scene! \"How can we offend our customer base?\" \"Let's make the game as woke as possible!\" The irony...",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Prestigious_Net_6473",
                            "body": "when adding gay characters offends more people than making the whole game homophobic",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "Pro_Rookie_Gamer",
                                    "body": "now I low-key want to see a developer say this in an interview. I'd be hilarious.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CattyOhio74",
            "body": "If there isn't a quest where you deal with g@mers I will actually be shocked. Not to mention if GTA makes fun of everyone that would include them....",
            "score": 81,
            "replies": [
                {
                    "author": "Mrazish",
                    "body": "I mean, they already made enough fun of g*mers in GTAV.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "slayerhk47",
                            "body": "Enough? There can always be more.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aphosphor",
                    "body": "I remember Weasel News featuring some mf like this in the interviews. I hope GTA VI has something like this as well, making fun of the insecure guys like this terrified of seeing women in videogame.",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cjmate22",
            "body": "“If GTA 6 has some forced cringy ass message” well I hate to tell you the news pal… they pretty much always had one…",
            "score": 77,
            "replies": [
                {
                    "author": "Animefox92",
                    "body": "Hell GTA IV literally revolves around an ILLEGAL IMMIGRANT and commentary of how the American Dream is bullshit ",
                    "score": 61,
                    "replies": [
                        {
                            "author": "Shoddy_Morning_2827",
                            "body": "Nuh UH woke wasn't invented until late 2015 when disney put women and minorities in star wars 😡😡🤬",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "Animefox92",
                                    "body": "Despite Leia neing a woman, a nain character and depicted as the most competent person in the main trio who Lead her own rescue *twice* right wingers are weird lol",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "LovecraftInDC",
                                            "body": "They would absolutely hate SW if it came out today.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Animefox92",
                                                    "body": "Oh absolutely how is Leia not a girl boss character? XD she doesn't take anyone's shit",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "AHugeHildaFan",
                                                            "body": "Because they only remember the scene of her in a slave outfit and stopped paying attention.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MerelyEccentric",
            "body": "\"Twitter approved\"?\n\nUh... last I checked, Twitter was the domain of Phony Stark and his Nazincel minions. I very much doubt that poster would disapprove of anything Twitter endorsed.",
            "score": 59,
            "replies": [
                {
                    "author": "SandaruLJ",
                    "body": "Phony Stark lmfao",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "legendairenic5432",
                    "body": "Basically anyone who still think Twitter is a leftist echochamber is both nazi and stupid",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Andrew_Waples",
            "body": "I ain't reading all that. What the hell is a digital war crime? Well then, get prepared. GTA has always been \"woke.\" Or at the very least making fun of America.",
            "score": 37,
            "replies": [
                {
                    "author": "Zaiburo",
                    "body": ">What the hell is a digital war crime?\n\nAccording to the very confused OOP, refunding GTA6 and playing San Andreas.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "mwaaah",
                            "body": "Won't anybody stop this madman from doing - *checks notes* - something that was always allowed..?",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Animefox92",
                            "body": "The game where the entire main cast is black? The one where the police are literally the big bads and completely corrupt?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NuxyrWasTaken",
            "body": ">it's supposed to be offensive\n\nidk bro you sound very offended to me",
            "score": 26,
            "replies": [
                {
                    "author": "Critical_Liz",
                    "body": "Underrated comment.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "F1lth7_C4su4L",
            "body": "The irony behind the offensive, reckless and unapologetic line.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Carmifele",
            "body": "\"*IF* GTA6 goes woke...\"\n\nI'm Sorry, we talking about the same GTA6? \"latina girl lead\" GTA6? \n\nI thought the game was woke already? So why Is this guy still talking hypotheticals?\n\nI swear these people have more eyeballs than braincells",
            "score": 22,
            "replies": []
        },
        {
            "author": "Rawlott1620",
            "body": "It’s so weird that they love “offensive humour” but hate when anyone gets offended. If no one was offended, it wouldn’t be offensive now, would it?\n\nThey’re constantly offended and they don’t like it. I’m starting to think “offensive” in this case really just means punching down in some way?",
            "score": 21,
            "replies": [
                {
                    "author": "faen_du_sa",
                    "body": "its only funny if other people get offended. If they themselves are offended it means something un-American must have happend!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Rawlott1620",
                            "body": "But they’re not even happy when other people get offended either, they seem mad about it??",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ftzpltc",
            "body": "So... based on what \"woke\" means now, it's kind of a given that GTA VI will be \"woke\", unless they go back through x years of development and remove anything that makes fun of Republicans, Elon Musk, or Donald Trump.\n\nAnd they set the game in Florida, remember.\n\nGTA V is woke by these standards.",
            "score": 19,
            "replies": [
                {
                    "author": "Ryebread666Juan",
                    "body": "The first mission with Franklin and Michael in V when you chase down the yacht literally has Michael say something along the lines of “give up the gang shit, go to college get a degree, and then you can rip people off legally, it’s called capitalism” like rockstar is so not subtle with their writing it’s amazing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AkumaValentine",
            "body": "“Twitter approve nonsense” my guy, it’s run and own by a Nazi and is full of more Nazis and Nazi content than you can even fathom. GTA IV had an expansion called Ballad of Gay Tony that surprise, had a gay guy who earned that nickname in the 80s. Like, when everyone was fruity doing cocaine and shit. WDYM OLD ROCKSTAR LOL",
            "score": 16,
            "replies": [
                {
                    "author": "Animefox92",
                    "body": "Also Niko is an illegal immigrant one of his closest friends and allies is an out and proud gay man. The entire story revolves around how BS the American Dream is and there is literally a subplot where an ultra conservative homophobe politician is actually deeply closeted.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "-KRVAR",
            "body": "Wasn't GTA San Andreas woke?",
            "score": 14,
            "replies": [
                {
                    "author": "Coneman_Joe",
                    "body": "Why did no one have a problem with black MC in that?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "frederickmeow",
                            "body": "Because it came out when they were kids. And before they had youtubers telling them to hate black people.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Animefox92",
                            "body": "Or the fact the cops are the outright main antagonist... its probably the most anti-cop game in the series",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Coneman_Joe",
                                    "body": "Funny enough, i think cops as enemies in games appeals to pretty much everyone lol",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Shire12",
                                            "body": "except Elon LOL he made a tweet about not being able to play GTA 5 cause you shot cops in it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Vorpeseda",
                            "body": "A bunch of people *did* lose their shit over it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Coneman_Joe",
                                    "body": "Really? I remeber it being one of the most popular ps2 games",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Vorpeseda",
                                            "body": "It was, but there were people getting stroppy on the message boards about how they didn't want to play as a black man.\n\nAlthough none of them had the kind of influence they have now.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Pro_Rookie_Gamer",
                                                    "body": "culture war never changes... smh",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Turbulent_Tax2126",
                    "body": "You bet",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "alter_ryden",
            "body": "I like that at no point do they actually specify what they do or don't want. Just not \"woke\", which they definitely cannot define in any meaningful way. \n\nOddly they sound very offended by it not being offensive in the way they want.",
            "score": 13,
            "replies": []
        },
        {
            "author": "StrongStyleMuscle",
            "body": "These foos are already panning a game where regardless of gender you’re playing as a criminal as “woke”. Didn’t Uncle Elon already tell them they’re not allowed to play GTA because theirs violence against police?   I swear the anti woke squad don’t be knowing what they want.",
            "score": 7,
            "replies": []
        },
        {
            "author": "SKZ9000",
            "body": "Talks about cringe and then proceeds to write the most cringe thing I've ever read.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Nero_2001",
            "body": "\"it's supposed to be offensiv\"\nDoes that guy wants it to be woke or not? Because making it woke would be the best way to offend him.",
            "score": 6,
            "replies": []
        },
        {
            "author": "BiAroBi",
            "body": "Me when I write an English essay but my word count is too short",
            "score": 6,
            "replies": []
        },
        {
            "author": "aranea_salix_",
            "body": "> digital war crime\n> gta san andreas\n\nfucking dumbass",
            "score": 6,
            "replies": []
        },
        {
            "author": "AlienHooker",
            "body": "So he's offended that the game might not be offensive enough? Kinda seems like that *should* be exactly what he wants",
            "score": 5,
            "replies": []
        },
        {
            "author": "UndeniablyMyself",
            "body": "\"I want offense.\"\n\nRead: I want someone else to be offended.",
            "score": 5,
            "replies": []
        },
        {
            "author": "supercat117",
            "body": "Wouldn't San Andreas be considered woke since you play as a black dude? I guess the classic \"good not woke, bad woke\" deal.",
            "score": 5,
            "replies": [
                {
                    "author": "Animefox92",
                    "body": "Also the cop is the game isbt exactly nice about the police... ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JackTheSecondComing",
            "body": "Isn't San Andreas also woke considering CJ is black?",
            "score": 3,
            "replies": [
                {
                    "author": "Pro_Rookie_Gamer",
                    "body": "rj/ \\*sniff\\* I-I was so sad when th-they replaced Mute-boy from the 3 a-and brought in this dei hire. 🤧\n\nG@merz just-just can't catch a break",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MaliceTheMagician",
            "body": "Ah yes antiwoke Rockstar creators of ballad of gay Tony and THIS GAY KISS in bully.\nI loved when they antiwoked so hard they made a black protag and depicted cops as evil, the very game your going to play when they inevitably fuck up gta6 with something woke like a Hispanic woman as a protag or something CRAZY",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Rockstar has never been anti-woke, and their stories have always been anti-woke as it has always made fun of American life, San Andres portrayed an impoverished minority neighborhoods and the struggles of gang life from a society that has largely abandoned them. Even the radio stations are satire. Now everything has to be serious and reflect their absolute ideals such as targeting and removing people and stories from their games completely to not offend them. Insufferable.",
            "score": 3,
            "replies": [
                {
                    "author": "Animefox92",
                    "body": "Hell they've pretty consistently taken the piss out of republicans constantly the game where they arguably Make fun of the left equally is GTA V... which is more making fun of Cali and everything to do with Hollywood... ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "The self projection is actually insane, i never use to correlate self projection with right wingism, but oh my god it's too hard to ignore today. I have way too many stories of IRL people i know who are right wing and self project onto everyone else, nearly all of them, and i wish i were joking. Either self projection or serious commitment to hate, these people are hypocrites to the fullest degree and they don't care how open and loud they are with it, by the time they spew their second sentence they have either contradicted themselves, or show how hopeless the entire situation is. I don't even know the words to use today, i've given up all hope, and they are cheering that they are destroying america for large swaths of the country as if that's going to make america healthy. 100% defeated, and there are climate issues going forward. America is officially, won't be able to stand 4 years of this, and i bet after they are done destroying the country right wingism will grow because thats how fucking stupid americans are. Either that or remain right in the middle, never able to do anything, indept.\n\nEither America goes more right, or just remains stagnant/the same under democrats. Jesus christ.\n\n  \nDemocrats no longer have any excuses, but they know which is why they are talking about abandoning the left completely. If they ever touch power again, they have ZERO EXCUSES TO NOT DO WHAT WE WANT! PERIOD! And how much you wanna bet they will disappoint? The country is gonna take more than democrats to fix, way more.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "seazonprime",
            "body": "Police is on their way to arrest this criminal for booting up san Andreas.\nThere are boundaries dude, one does not simply boot up san Andreas and gets away with it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sea-Internet7645",
            "body": "Cyberwarfare is a real thing, but this guy clearly doesn’t know what that is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "improvedalpaca",
            "body": "People told me fascism would be cruel. They never told me it would be so cringe\n\nHow can a significant part of our contemporary political discourse amount to \"no girls allowed in our treehouse\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "44-Worms",
            "body": "How do they lack so much self awareness.. \n\nSaying GTA is supposed to be offensive and then shitting and crying this hard in the same breath (because you’re *offended*) is nasty work. \n\nThis mindset is getting old quick, when will these guys grow the fuck up?",
            "score": 3,
            "replies": []
        },
        {
            "author": "dizzle229",
            "body": "These morons don't understand satire and think GTAs humor is just \"offensive = funny\"\n\nThe writing in these games, even the earlier ones, is more clever than they often get credit for, and they're certainly not on the side of mouth-breathers screaming slurs in matchmaking.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GarrettheGreen",
            "body": "I'll touch grass! I swear! I am doing it!",
            "score": 2,
            "replies": []
        },
        {
            "author": "sickbane",
            "body": "This game needs to release already so the anti-wokers can tell us why we shouldn't buy it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThisCombination1958",
            "body": "No matter what happens in GTA 6 this dude will find the one tiniest slight and shit his pants over. They are mentally unwell and programmed to see the \"enemy\" in everything.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Possible-Potato-4103",
            "body": "Gta has always been \"woke\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Waifuless_Laifuless",
            "body": "What do you want to bet that if it does make fun of everyone equally, he throws a shit fit because everyone includes him, and it doesn't exclusively make fun of people he hates",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chaledy",
            "body": "If it was \"Twitter approved\" it would cater a far different audience than what they think",
            "score": 2,
            "replies": []
        },
        {
            "author": "WildConstruction8381",
            "body": "I feel like I’ve wanted a latina Girlboss since at least San Andreas in 2004\n\nbut it’s hilarious this poster got offended that GTA6 isn’t offensive enough. Gotta be fake right?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kind_Composer_4197",
            "body": "Remember when Asmondiot said he hopes they dont make the Metal Gear Solid 3 remake political?",
            "score": 2,
            "replies": []
        },
        {
            "author": "A_Blood_Red_Fox",
            "body": "They want \"offense\" until it's them that's offended.",
            "score": 2,
            "replies": []
        },
        {
            "author": "I_am_The_Teapot",
            "body": "Being \"safe\" would be to capitulate to the insanity of conservative bigotry and threats of boycott and violence. Sanitized of anything that might be offensive to them. Like two guys holding hands. Or a woman who isn't a prostitute.",
            "score": 2,
            "replies": []
        },
        {
            "author": "artistpanda5",
            "body": "\"I want offense\" \n\nWell, you and your gamer friends seem pretty offended about the protagonist being a woman, so it looks like you're getting your wish…",
            "score": 2,
            "replies": []
        },
        {
            "author": "Substantial_Cat4540",
            "body": "Why does each paragraph say the exact same thing?",
            "score": 2,
            "replies": []
        },
        {
            "author": "poopscoop_4",
            "body": "I mean how come this guy hasn't already bailed over the female PC? Bro doesn't want girlboss, buddy you're literally playing a woman who steals people's cars",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vogelsucht",
            "body": "I mean looks like woke in videogames IS the new offensive. Think about it",
            "score": 2,
            "replies": [
                {
                    "author": "Pro_Rookie_Gamer",
                    "body": "R\\*: you wanted an offensive game? well here you go, now you're offended.\n\nidiot g@mer: 😡",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kerfuffle_dood",
            "body": ">I don't want a safe GTA. I want mayhem. I want offense\n\nDude is literally offended by a game that isn't even out yet lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mathi12",
            "body": "Rockstar declared BANKRUPT after reddit user decided to not buy new game!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Supreme_Salt_Lord",
            "body": "Wasnt there an expansion called “ballad of gay tony” in gta or something along those lines? \n\nThese people are unsalvageable. I wish i can unvaccinate them so they can get small pox and measles",
            "score": 2,
            "replies": [
                {
                    "author": "AHugeHildaFan",
                    "body": "Yes, it was a expansion of GTA IV where you play as the hired hand for a nightclub owner called Gay Tony.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jagerbombastic99",
            "body": "Genuinely how long till this neo gamergate reactionary crowd ends up as the enemy in a AAA crowd. The meltdown is going to be hilarious.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fragrant-Potential87",
            "body": "I just replayed 4 and I think this guy would be foaming at the fucking mouth if he actually listened to the radio or dialog of that game. Imagine his shock when he comes to find out that Rockstar has been making fun of Republicans in ways that still apply to this day since 2008. He'd be calling the game woke once he heard all of the Weazel news radio segments and how they're absolutely clowning on right wingers and their politics. The Angels of Death have a website and they basically say something like \"We're not racist but we do just make the tests to get in harder if you're black\".  You ever notice how GTA makes fun of both sides but when it makes fun of the right, it doesn't just make fun of Republicans but also what they believe and when they do the left, it's only a cartoon character of a person they're making fun of? I don't think OOP did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GryphonGallis",
            "body": "So a \"digital war crime\" is...playing an older game?",
            "score": 2,
            "replies": []
        },
        {
            "author": "PooPartySoraka",
            "body": "Bruh, I swear to god",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheGreatJRC",
            "body": "\"GTA is supposed to be offensive.\"\n\nThe game's not even out and it's got this guy crying like an absolute toddler, so idk why they're so worried.",
            "score": 2,
            "replies": []
        },
        {
            "author": "spootlers",
            "body": ">the one that didn't give a shit, the one that mocked everyone\n\nFunny how that wasn't problematic when they weren't part of the \"everyone\" being mocked.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SignificantAd7603",
            "body": "A girlboss, a message and a toned down humor seems to be offensive to this guy, maybe they should put those things in the game to make an offensive game like this dude requests.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ExiaFan453",
            "body": "I’ve really grown to hate the whole overreactive, melodramatic nonsense surrounding the stupidest shit imaginable",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Party5870",
            "body": "can't wait to see the the new gta mock this guy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jmarquiso",
            "body": "GTA San Andreas is pretty woke for its time",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "This post may contain triggering content for some users, therefore a spoiler has been automatically applied. Please remember to spoiler any offensive content. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Desperate-Ad7777",
            "body": "I don't think rockstar will make GTA VI woke, cuz if they did it will definitely fail",
            "score": 1,
            "replies": [
                {
                    "author": "Pro_Rookie_Gamer",
                    "body": "I don't think R\\* will make gta 6 woke because, EVERYTHING is woke. And if everything is woke...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ordskangaroorat",
            "body": "When \"man commits crime\" is the most offensive and transgressive thing you can imagine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VannyRulez",
            "body": "I don't particularly remember anything in San Andreas that could be construed as offensive? Unless you count its criticism of the police and San Fierro having gay flags everywhere and the government hoarding tech that could improve everyone's lives. \n\nBut I'm open to being proven wrong tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lady_bro_ac",
            "body": "Well I hope they get offended so they can be happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "BankTypical",
            "body": "After reading the post in the picture... Sheesh, where's that 'Ah shit, here we go again' GTA meme when you need it? 🤣 I mean, I never played any GTA game for myself, but I sure didn't hear these little anti-woke bitches complaining online about the presence of a black protagonist back in the days that San Andreas released.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bienadicto16",
            "body": "GTA is always offensive for stupid ass conservative dipshits.\n\nSo the more girlbossing and trans stuff we got, the more trasgresive Gta6 will be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperMouthyDave",
            "body": "Usually we just walk by and ignore the guys yelling on the corner",
            "score": 1,
            "replies": []
        },
        {
            "author": "MemeArchivariusGodi",
            "body": "You know this is bait because he called Twitter Twitter and not X",
            "score": 1,
            "replies": []
        },
        {
            "author": "TechnicalPotat",
            "body": "This game used to offend pretentious assholes and it made it great. But what if they fill it with content that offends pretentious assholes? that would be awful!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RetroTheGameBro",
            "body": "This post must've been made by an 11 year old.\n\n\n\nNo one wanting to play something \"offensive\" is playing GTA. They're playing Postal 2 or those racist DOOM 2 wads low IQ neets shat out in the early 2000's",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arbyssandwich1014",
            "body": "Have they forgotten that GTA 5 made fun of conservatives being obsessed with the border? \n\nLike I think they think offensive, reckless, crass humor only means making fun of trans people and minorities. But it so clearly means everyone. I don't think they will like the \"everyone\" part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pro_Rookie_Gamer",
            "body": "\"I WANT OFFENCE!!111\"\n\n\\*gets offended\\*\n\n\"NOT LIKE THAAAAT REEEE1!!1!!11\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pro_Rookie_Gamer",
            "body": "\"I want an offensive game as long as it doesn't offend ME!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnSyrPrize",
            "body": "These types of people stake way too much personal identity in games being offensive for the sake of being offensive. I do wonder why that could be…",
            "score": 1,
            "replies": []
        },
        {
            "author": "WebsterHamster66",
            "body": "Honestly these guys overrate how offensive Rockstar really is. Most of their jokes are political or about fads or just other parts of the period. Yeah, there’s a few gay and trans jokes, but I don’t think I’d really care if they got rid of em.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChipsTheKiwi",
            "body": "Yeah man Rockstar wouldn't pull some woke bullshit like making a game that stars an illegal immigrant who regularly shit-talks america and is friends with a gay guy.",
            "score": 1,
            "replies": []
        }
    ]
}