{
    "title": "G*mers™️ once again whining about boobei a 2 cm covered",
    "author": "PlanetArbuz",
    "subreddit": "Gamingcirclejerk",
    "rank": 10,
    "score": 331,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 52,
    "url": "https://i.redd.it/03ctthmpffpe1.jpeg",
    "id": "1je1zaq",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "REMINDER: CENSOR ALL SUBREDDIT NAMES AND REDDIT USERNAMES IN SCREENSHOTS OR YOU WILL BE BANNED!!\n\nPlease report any posts not following this rule!!    \n\nLooking for serious or sincere discussion? Check out our new subreddit r/Gamingunjerk\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheoryNew1736",
            "body": "God, I am so tired of people crying about this. They'll say it's woke doing this instead of the company trying to lower the game's rating or widen the appeal to try and make more money. If they had any brains at all they'd be mad at capitalism for only ever caring about maximizing profit, or America for being so conservative.\n\nOr, they'd realize that making games less gooner coded will bring a more diverse player base and make the game viable longer with a larger community.",
            "score": 197,
            "replies": [
                {
                    "author": "Thoru",
                    "body": "> They'll say it's woke doing this\n\nHi there, as an actual fan of Yu-Gi-Oh: no they aren't lmao\n\nEveryone who plays Yu-Gi-Oh knows Konami censored the art for kids, and it's joked about. No one in that community blames Woke",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ravenqueer077",
            "body": "The \"censored\" version is honestly hotter",
            "score": 121,
            "replies": [
                {
                    "author": "Breeeeeaaaadddd_1780",
                    "body": "Right? The uncensored looks so uncomfortable.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Binerexis",
                            "body": "I get the whole \"arf arf massive bazongas mommy milkers awooga\" thing but they must absolutely destroy her back",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "jagerbombastic99",
                                    "body": "A lot of the poses and costumes they want these mommy milkers in are truly the most devious and uncomfortable garnets ever. Like jfc holding my boobs in place like the uncensored version would literally require using adhesive.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UnlimitedPostWorks",
                    "body": "The OG art is actually better. Goth Rogue girl raiding tombs is cooler than hot goth mage. \n\nFor a person who followed the lore, I'm happy she is not forced to be a hobo anymore, but still...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Celestial_Hart",
                            "body": "Why not have both? And then they can go dungeon delving together.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Oktavia-the-witch",
            "body": "She is still hot and I think censorship is yugiohs smallest problem these days",
            "score": 60,
            "replies": [
                {
                    "author": "pikomdl",
                    "body": "Also they have done it from the start.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "SegavsCapcom",
                    "body": "Yugioh maintaining its 1996 mentality of \"gotta censor for the kiddos\" pales in comparison to the frankly absurd card design of the last few years.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Animefox92",
            "body": "Konami has ALWAYS censored Yu-gi-oh cards why they whining now?",
            "score": 25,
            "replies": [
                {
                    "author": "PlanetArbuz",
                    "body": "Boobei",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Animefox92",
                            "body": "This seems pretty tame look at the difference with the Harpy Lady cards lol",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "PlanetArbuz",
                                    "body": "I'm still mad that they censor religious items or words because of some snowflake christians that when they see something christian that isn't made by them or absolutely don't worship them then they go ape mode",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Animefox92",
                                            "body": "Tbf a lot of Japanese things that use Christian imagery do it because the (admittedly cool) aesthetics lol ",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Wismuth_Salix",
                                                    "body": "In the original *Legend of Zelda*, Link straight up uses the Holy Bible as an item.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "unclezaveid",
            "body": "the anti-boob incident",
            "score": 9,
            "replies": []
        },
        {
            "author": "dlrax",
            "body": "it's funny cause the \"censored\" designs usually look better. Like in Azur Lane, the designs are so insane they just look ridiculous, while the \"censored\" ones are just more realistic/grounded or whatever",
            "score": 12,
            "replies": []
        },
        {
            "author": "Mernerner",
            "body": "Make something Appealing to wider audience = Woke",
            "score": 4,
            "replies": []
        },
        {
            "author": "Pellikka",
            "body": "Something tells me you got worse problems in your life to worry about if you're jerking off to yu gi oh cards 😭",
            "score": 6,
            "replies": []
        },
        {
            "author": "Totally_Not_A_Fed474",
            "body": "F*males (🤮) can’t have boobs anymore, because of woke 😞",
            "score": 4,
            "replies": [
                {
                    "author": "Bray_of_cats",
                    "body": "The wokes are harvesting the bewbers to make their mind virus!!!!!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SR_Hopeful",
            "body": "The undershirt looks more believable/natural for the outfit. Women would likely wear that or layered tops like that and at most they would show just top cleavage rather than walking around in gothic bikini tops. Believability is hotter to me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "This post may contain triggering content for some users, therefore a spoiler has been automatically applied. Please remember to spoiler any offensive content. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheAlmightyShadowDJ",
            "body": "I honestly like the second image more",
            "score": 2,
            "replies": []
        },
        {
            "author": "lookitsajojo",
            "body": "I just wanna make this clear, Konami has always been censoring boobs, since day one, because turns out in alot of the world children shouldn't be playing with shamans in BDSM gear (Seriously look up Mist Valley Shaman or whatever)",
            "score": 2,
            "replies": []
        },
        {
            "author": "JustAnOrdinaryGrl",
            "body": "This card literally ruined the game and not cause of her tits... Because everything surrounding her broke the damn game. It's funny how after her and her archetypes got done fucking up the game and making cards that cost 300+ USD. They send her off with a GQ magazine alternative art and a want to be middle finger sticking up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GryphonGallis",
            "body": "I'm not sure I would have even noticed unless they pointed it out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mkklrd",
            "body": "Yu-Gi-Oh players are a special kind of gooners that Konami openly markets to. There's a literal \"waifu tax\" in YGO and players are just okay with it.",
            "score": 1,
            "replies": [
                {
                    "author": "UnlimitedPostWorks",
                    "body": "I mean, it's more an \"it is what it is\" situation. Most of the fanbase is bored by waifu.dek, even if some have cool designs and gameplay (Centurion, Sky Striker, and so on). But is, indeed, a Japanese game company",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mkklrd",
                            "body": "it really only started with Sky Strikers, so like late 2018/early 2019, which in the history of the game is pretty recent. like what archetypes were even fully dedicated to being waifus before that? i can't think of any except maybe Magician Girls, because Dark Magician Girl is THE original waifu",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "starbuildstrike999",
            "body": "There are literally hundreds of millions of images of fully naked women on the internet to look at for free at any time. But this is the fight they decide to take up",
            "score": 1,
            "replies": []
        },
        {
            "author": "Celestial_Hart",
            "body": "Konami been doing this for two decades now, they only just now noticed?",
            "score": 1,
            "replies": []
        },
        {
            "author": "sarcasticdevo",
            "body": "Yugioh cards have been censored from the beginning of time. The fact people still give a fuck because of covered up boobies 25+ years in is both sad and hilarious.\n\nMeanwhile, Master Duel is entering ANOTHER tier 0 format and the main game only has like three viable competitive decks that are expensive. There's a lot more to worry about these days than titty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kinoplexer",
            "body": "why censor it though? And genuinely. Are you guys really pro art censorship?",
            "score": -63,
            "replies": [
                {
                    "author": "PlanetArbuz",
                    "body": "Bro, they whine that boobei got covered by 2 cm. Also Yu-Gi-Oh is 6+ on west.",
                    "score": 51,
                    "replies": [
                        {
                            "author": "kinoplexer",
                            "body": "yeah but are you pro art censorship?",
                            "score": -69,
                            "replies": [
                                {
                                    "author": "Beatful_chaos",
                                    "body": "Only if it makes gamers cry and piss themselves.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "kinoplexer",
                                            "body": "that's fair. They are pretty funny when they whine about it",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PlanetArbuz",
                                    "body": "No, censoring is bad especially that religious censorship in yugioh but really, boobei that get a little cover is so big problem?",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "kinoplexer",
                                            "body": "i suppose i do see your point with the age rating thing. Still, I'd prefer it to not be censored",
                                            "score": -45,
                                            "replies": [
                                                {
                                                    "author": "Painted-BIack-Roses",
                                                    "body": "Porn is free",
                                                    "score": 37,
                                                    "replies": [
                                                        {
                                                            "author": "kinoplexer",
                                                            "body": "is cleavage porn now? I mean i am not the one whining about this sort of thing, i don't care enough about yugioh boobies. But still art censorship is still generally not a good thing unless its done for a good reason.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "pikomdl",
                                                                    "body": ">is cleavage porn now?\n\nConsevative Christian Parents. That's the viewpoit you need to have for most censorship in Yugioh.",
                                                                    "score": 19,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OverlordMMM",
                                                                            "body": "Soooo many people forget that most censorship and censorship-adjacent actions generally come from conservative uproar.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "PlanetArbuz",
                                                    "body": "Your opinion.",
                                                    "score": 14,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RevHighwind",
                    "body": "Why is the cleavage of her boobs facing the camera when she is sideways? We shouldn't be able to see the cleavage in the center of her chest looking at her from the side. It's not even censorship. It's literally just correcting a very common mistake that artists make with perspective.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "kinoplexer",
                            "body": "now that's the real questions everyone should be asking",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Various_Opinion_900",
                    "body": "Yes! I love censorship, my biggest passion! Whenever twitter incels spill tears over sports bras, my life span expands exponentially. I am on my way to attaining lichhood as I type this!",
                    "score": 15,
                    "replies": []
                }
            ]
        }
    ]
}