{
    "title": "Every gaming shitpost sub after 25k",
    "author": "SnausageLinx",
    "subreddit": "Gamingcirclejerk",
    "rank": 8,
    "score": 339,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 51,
    "url": "https://i.redd.it/41a24uxn3gpe1.png",
    "id": "1je48wn",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "REMINDER: CENSOR ALL SUBREDDIT NAMES AND REDDIT USERNAMES IN SCREENSHOTS OR YOU WILL BE BANNED!!\n\nPlease report any posts not following this rule!!    \n\nLooking for serious or sincere discussion? Check out our new subreddit r/Gamingunjerk\n   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Correct-Horse-Battry",
            "body": "Conservatives whenever someone commits a minor crime: **“Kill them, kill them now!! They aren’t human anymore, die!!”**",
            "score": 164,
            "replies": [
                {
                    "author": "No_Beautiful_8464",
                    "body": "Conservatives in the same situation, but it's a white (straight) (not poor) guy: \"\\*You see, while the criminal acts of this individual are to be condemned, we must understand the conditions that led him to committing such acts. As a society...\\*\"",
                    "score": 87,
                    "replies": [
                        {
                            "author": "Wismuth_Salix",
                            "body": "Conservatives when a white man admits to being a pedophile, defrauds a children’s charity, steals an entire room worth of classified government documents, is convicted on 37 counts of fraud, and leads a violent assault on Congress that results in the death of five cops:\n\n“This man should be king.”",
                            "score": 60,
                            "replies": []
                        },
                        {
                            "author": "SnausageLinx",
                            "body": "RIP UHC CEO, you did nothing wrong, ever.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "TheBigToast72",
                            "body": "Conservatives during a real crime: “ok but have you seen his swim times?”",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Captain-Shmeat",
                    "body": "Holding a pregnant lady at gunpoint isn't a minor crime.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "throwawayandused",
                            "body": "Okay... but he wasn't doing that. He was paying for something at a register. Weirdo",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Captain-Shmeat",
                                    "body": "Before that, dummy.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "throwawayandused",
                                            "body": "You do realize you're the joke here right?\n\nBefore that he walked into the store and looked around. Didn't realize that was illegal. What is it with maga and loving government overreach?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Captain-Shmeat",
                                                    "body": "Before that whoooole situation homie. The dude was a seasoned criminal with a criminal past. Not that situation.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "FB_Rufio",
                                                            "body": "Not sure what past crimes that he served his time for have to do with the situation where he died.\n\n\nYa know the point you keep missing. Y'all love to bring up past crimes as if it justifies them dying for something unrelated.\n\n\nRemember that cop that broke into a guys apartment and killed him? Remember how people were bending over backwards to bring up him having weed in his house as if that made him some sort of bad person...",
                                                            "score": 14,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "throwawayandused",
                                                            "body": "Before that he would have been driving to the store. Last I checked not illegal. Also cops aren't judge, juries, or executioners. Weird how Republicans want to make a group that started as slave catchers against poc, Irish and Italian into all powerful groups.",
                                                            "score": 11,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "SnausageLinx",
                                                            "body": "By this logic, if you have a DUI on you file, a police officer has the right to ~~shoot~~ Mario's brother you on sight.",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ameer18",
            "body": "Racists obsession with George Floyd needs to be studied",
            "score": 105,
            "replies": [
                {
                    "author": "SnausageLinx",
                    "body": "The man's been dead five years and they still won't give him a break",
                    "score": 64,
                    "replies": [
                        {
                            "author": "DankSlamsher",
                            "body": "They probably make posts about him every time they see his statue.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Evanpik64",
                    "body": "I think they’re applying their own batshit view of the world onto us, so they think we worship George Floyd like some sort of cult of personality/messianic figure or something?\n\nBut nope, we just don’t like it when innocent people get extrajudicially murdered by the state, an alien concept to fascists I’m sure.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "BuffaloSuspicious530",
            "body": "Uh oh another subreddit is about to go.",
            "score": 26,
            "replies": [
                {
                    "author": "TheBigToast72",
                    "body": "Inb4 this place is blamed for them breaking TOS",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnausageLinx",
            "body": "Bros! The fucking ~~MODS~~ of that sub are DMing for dunking on racists! Holy shit!!!!! 🤣🤣🤣\n\nEdit: Automod, but still, holy fuck I never thought I'd see a racist MGS sub",
            "score": 18,
            "replies": [
                {
                    "author": "bektas06",
                    "body": "Pathetic losers, i bet that a lot of people are reporting it and then they got upset 😭",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WildConstruction8381",
            "body": "Anything to avoid talking about real problems with these guys",
            "score": 13,
            "replies": []
        },
        {
            "author": "StrongStyleMuscle",
            "body": "I’ve always been liberal overall but early on I was kinda against BLM because I thought it was too decisive. I’m black myself but thought “Black Lives Matter” kinda negated the importance of all other lives. Then after George Floyd & Ahmaud Arbery I understood. Black men were killed for no reason by law enforcement & a retired police officer & suddenly to justify the shit people started making up lies about them to prove they deserved to die. Making me fully understand the meaning of Black Lives Matter.  People wanted to ruin the reputation of black men who were minding their own business then was killed for no reason by claiming they were “thugs” up to no good.  As if their lives didn’t matter after they got murdered.",
            "score": 14,
            "replies": [
                {
                    "author": "DukeBaset",
                    "body": "I’m not American but my understanding is that Black leaders like MLK and Malcolm X were saying this and doubtless people before them. Perhaps the biggest sin of mass media is that every third or fourth generation is having to fight the same battles over and over again. Look at the fucking fascists creeping out of the woodworks.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "vsyca",
                    "body": "The movement is good but the organization not so much like any charity it will go corrupt",
                    "score": 2,
                    "replies": [
                        {
                            "author": "StrongStyleMuscle",
                            "body": "I’m more so into the idea over the organization. Maybe the other 2 are good but at least one of the 3 founders did go nuts with some of the fundraiser money I can’t even pretend I don’t know about that. But as the people we  need to let the community know that when something bad happens to an innocent black person & people wanna start calling them a criminal or blaming them for what happened that black lives matter as much as everyone else’s. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Key-Mission7287",
            "body": "Westerners are so weird, the amount of dehumanization towards black people that has been normalized is insane. I remember my family watching the news while eating breakfast, we're Turkish, they showed the George Floyd murder on the news, my mom and sister started crying, me and my father couldn't eat. How do you even get to the point of still mocking him after all these fucking years, it's actually beyond me.\n\nWe have more then enough dumb unhinged racists here too, but I've never seen this level of hatred (towards Kurds, Armenians, Alevites,...) allowed in such mainstream contexts here as I have in the US.",
            "score": 40,
            "replies": [
                {
                    "author": "ThreeDawgs",
                    "body": "The U.S. population is still wrestling with the fact that slavery is wrong.\n\nIt’s really because they didn’t crack down hard on the southern states after they lost the civil war.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Ameer18",
                            "body": "It wasn't till recently we finally got rid of Confederate flags",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "TheBigToast72",
                            "body": "Robert e Lee spent the rest of his days after losing the war spreading pro slavery propaganda. It’s crazy to me that we just him go after he tried overthrowing the country, but I guess that’s what we are known for now eh?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ameer18",
                    "body": "That's why I don't interact with police period. I don't want to die and racists parading my dead body around like my death is a joke, that I deserve death for interacting with the police.\n\nIt definitely messes with your mental health though.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Hitei00",
                    "body": "Its not unique to the west. In lots of places in Europe they have the exact kinds of sentiments toward Romani, and the far east is well known for the intense racial conflicts between the Japanese, Chinese, Koreans, and Vietnamese. America is just the place where its the most...open.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrongStyleMuscle",
            "body": "A lot of these are easy to clown but somebody needs they ass whooped for this shit.",
            "score": 10,
            "replies": [
                {
                    "author": "Ameer18",
                    "body": "These cowards wouldn't even fight you, they'd pull out a gun like they always do",
                    "score": 7,
                    "replies": [
                        {
                            "author": "StrongStyleMuscle",
                            "body": "I know the type. I grew up with a lot of em. Years back when they first went rightwing in the last years of Obama they’d be on FB bragging about their guns. They’d talk that good shit online like they were a man. Then see me in person have a worried look on their face for a few seconds remembering the shit they said to me then smile shaking my hand pulling me in for a hug on some “It’s really good to see you man.”",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DukeBaset",
            "body": "I hate gamers but love games. We should have some word to refer to people like this.",
            "score": 6,
            "replies": [
                {
                    "author": "Nirast25",
                    "body": "Ludophile? \"Ludus\" means \"play\" in Latin.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SlurryBender",
                            "body": "I'd rather avoid anything with the suffix \"phile,\" just to avoid people who don't know how words work.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Shoddy_Morning_2827",
                                    "body": "\"I didn't know being an audiophile was a crime\"\n\n\"AN AUDI-WHAT-OPHILE???\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Paprika_W",
            "body": "this is so fucking vile and degenerate.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Land0Bassist",
            "body": " Idk when people will get that his alleged crime was using a counterfit dollar. Like does he deserve death for that? FUCK NO",
            "score": 2,
            "replies": []
        },
        {
            "author": "catmanplays",
            "body": "Anyone got that meme of the diverging paths with the anthro femboy and 'I am Adolf Hitler image'.\n\nAs that pretty accurately sums up what happens to the large gaming shitpost subs.",
            "score": 2,
            "replies": [
                {
                    "author": "SnausageLinx",
                    "body": "Femboy twink worship, or Klan shit?\n\nWhich way, western man?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FuckReddit822",
            "body": "that sub fell off so hard. false kojimoid spotted also",
            "score": 2,
            "replies": [
                {
                    "author": "SnausageLinx",
                    "body": "The Boss didn't die for *this*!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "This post may contain triggering content for some users, therefore a spoiler has been automatically applied. Please remember to spoiler any offensive content. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gamingcirclejerk) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hitei00",
            "body": "Is this the one MGS sub that spams the Invisible meme?",
            "score": 1,
            "replies": []
        }
    ]
}