{
    "title": "Trump says tariffs on Canada will increase if Canada imposes retaliatory tariffs.",
    "author": "NoFocus4742",
    "subreddit": "Conservative",
    "rank": 87,
    "score": 1115,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 921,
    "url": "https://x.com/libsoftiktok/status/1896980775956045946",
    "id": "1j3iql5",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been so heavily reported that I, Automoderator, decided to promote our other socials.  [Follow us on X.com](https://x.com/rcondiscord) and [join us on Discord](https://discord.com/invite/conservative).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky-Prize",
            "body": "I posted this in a thread but I wanted to outline why at least with Canada, focusing on the trade deficit is missing the point.\n\nTrade balance is only physical goods. It does not include services or IP royalties/licenses through foreign subsidiaries. In other words, in this case, we are trading Netflix and Disney+ subs and Microsoft software licenses and Google ad purchases and getting oil and maple syrup and so forth in return. If we sell a million bucks profit worth of Netflix via the Netflix Canada entity (wholly owned by Netflix) and bring in a million bucks of maple syrup, that shows up as a million dollar deficit even though it’s really zero, and tbh Netflix is overpriced and maple syrup is underpriced. \n\nIt would be like your wife saying that your marriage is messed up because you have a 10 hour a week housework imbalance with her (but fail to mention you work full time and do the taxes and do the yard work and fix the cars). All the contributions need to be seen to assess the relationship. In that example maybe you aren’t doing enough or maybe she isn’t but fixating on one lane only isn’t fair. \n\nIn the case of China which doesn’t allow a lot of pie strongest industries to compete, the trade surplus is a lot more descriptive of the problem. In the case of Canada, we probably have a net surplus when it is all added together.",
            "score": 114,
            "replies": []
        },
        {
            "author": "ajmeko",
            "body": "So the US tariffs are for drugs and trade imbalance, Canada's tariffs are a reaction to those, and then the US puts another 25% as a reaction to the reaction - so if these tariffs are triggered by one another, do we just see 1000% tariffs each way by the weekend?",
            "score": 194,
            "replies": [
                {
                    "author": "ultrainstict",
                    "body": "No because canada will fold. Even as they stand now they are risking total economic collapse, and while price will go up here a bit, not nearly as much. And the tax bill will more than offset the dip in our buying power.\n\nCanada knows this. Justin castro is just putting on a big show to make it look like hes standing up for his country, despite them wiping their asses with both our previous free trade agreements. There is no free trade unless every party commits, its been far too long that weve allowed the rest of the world to take advantage of us. \n\nEdit, man the bots arent even hiding anymore. Within seconds of posting im already getting downvotes.",
                    "score": -31,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dutchtdk",
            "body": "What does trump want?",
            "score": 247,
            "replies": [
                {
                    "author": "StillWatersRunWild",
                    "body": "Revenge?",
                    "score": 72,
                    "replies": []
                },
                {
                    "author": "Swagastan",
                    "body": "increase tariffs and lower income tax is a proxy for changing from a federal income tax structure to a consumption tax structure.  It's similar to obamacare being a stepping stone to universal healthcare, this whole tariff everything approach is a steppingstone to elimination of income tax.",
                    "score": -48,
                    "replies": []
                },
                {
                    "author": "Germy_1114",
                    "body": "Eliminating the income tax in favor of tariffs is a pipe dream that would only hurt the middle class",
                    "score": 163,
                    "replies": []
                },
                {
                    "author": "Swagastan",
                    "body": "I’m not saying it would be good, but that does seem to be Trump’s goal, otherwise tariffs on allies like Canada and the EU make little sense.  ",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Normal_Use_879",
                    "body": "Can you explain how it hurts the middle class? The top 1% are the biggest spenders. The more you spend the more you’re taxed. The middle class can keep more of their income. Or am I missing something here?",
                    "score": -12,
                    "replies": []
                },
                {
                    "author": "Germy_1114",
                    "body": "The top 1% also pay the most taxes and stand to benefit the most from the elimination of the income tax.\n\nAny money you and I would get back would be offset by the massively increased costs of almost everything being sold in the US. The rich could eat increased costs and survive, while the middle class would struggle.",
                    "score": 90,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unlucky-Prize",
            "body": "Physical goods are one part of our relationship. But they buy services and license IP from us and those numbers are larger in the other direction. This is really dumb.",
            "score": 105,
            "replies": []
        },
        {
            "author": "EliteJassassin101",
            "body": "I’ve yet to hear anyone articulate what exactly Trump wants out of it that’s feasible. If the only justification is this pipe dream that it will “increase American domestic production and manufacturing” then republicans will be voted out. \n\nI promise you republicans won’t win shit ever again if this continues. Free trade is a good thing. Trump won because of inflation and a weak economy. And now we’re just supposed to pay more for the next 3-5 years for domestic production to catch up. Assuming it even can in certain industries.",
            "score": 194,
            "replies": []
        },
        {
            "author": "midnightrambler108",
            "body": "Some of the comments on here make me question if this is really Americans on here, or Russian bots trying to sew discord with Canada-US relations.",
            "score": 214,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "MetallicaRules5",
            "body": "This is just not something I can ever agree with Trump on. Tariffs as a means of punishing nations for bad practices, absolutely. But tariffs against our neighbors and allies, even ones as annoying as Canada, are just bad policy. Especially when he has no reason for doing so. Trump hasn't put forward a list of demands or wants to get them removed.\n\nYou won on the back of the poor economy and inflation caused by Biden, how is any of this supposed to help? There is stuff we do need to actually trade with other nations for, we cannot have an absolute advantage in everything. And if you want more production domestically and more companies to do business here, let's look at ways to make it friendlier and easier for them to do.\n\nAnd doing this when conservatives were poised to make gains, and giving liberals a reason to rally around a message of sticking it to Trump, is a massive blunder.\n\nEDIT: To the person who gave me the award, I reject it. I still support Trump largely and he was absolutely the better choice over Biden and Kamala. But nice job spending money on it, you're making a huge difference. /s",
            "score": 492,
            "replies": [
                {
                    "author": "dunkeater",
                    "body": "Trumps doing it because it will grow the U.S. economy in the long run. This isn’t a secret, he campaigned on it.\n\nAnyone who says tariffs hurt a domestic economy thinks they know better than every major country in the world, all of whom have strategic tariffs.",
                    "score": -80,
                    "replies": []
                },
                {
                    "author": "MetallicaRules5",
                    "body": "Yes and I disagreed with him back then as well regarding it, but agreed with him with his overall message. The key part to your comment is \"strategic,\" but there is no strategy here. Mexico and China you can make a reasonable argument. Canada, what strategy is there to hurting the chances of the party that would be better aligned with you in the upcoming election? What strategy is there if you haven't discussed the reason for doing so and what you aim to gain from it? What strategy is there to combat the negative effects that will be caused because of it, and yes, there will be negative effects. Even if we aren't as reliant on Canada as they are on us, we still do need them as a trade partner for purchasing and selling.",
                    "score": 100,
                    "replies": []
                },
                {
                    "author": "GiediOne",
                    "body": ">Canada, what strategy is there to hurting the chances of the party that would be better aligned with you in the upcoming election? What strategy is there if you haven't discussed the reason for doing so and what you aim to gain from it? What strategy is there to combat the negative effects that will be caused because of it, and yes, there will be negative effects.\n\nHere are some (I think) some of the many legit disputes.  What America will get from the tariffs is a recovery of some of the butden that Canada is saddling on the US. There should be a fairer method to recover that resource, but Tariffs serve as carrot and stick if done right.  More FDI into America from Canada can only help, not hurt. \n\n>[Wikipedia]The heart of the dispute is the claim that the Canadian lumber industry is unfairly subsidized by the federal and provincial governments. Specifically, most timber in Canada is owned by provincial governments. The price charged to harvest the timber (the \"stumpage fee\") is set administratively rather than through a competitive auction, as is often the practice in the United States. The United States claims that the provision of government timber at below market prices constitutes an unfair subsidy. \n\n>[Wikipedia]Another source of tension has been Canada's protection of their dairy farmers. Canada is the only industrialized country in the world to still use a \"supply management system\" for regulating the supply of dairy products.[12] The US sees the system as protectionist\n\n>[ Wikipedia]Canada isn’t a small country, nor is it a poor one. It’s perfectly capable of meeting its treaty obligations. Yet it spends a mere 1.37 percent of its GDP on defense, or roughly $30.5 billion a year. Despite having the sixth largest GDP among NATO countries, Canada ranks twenty-seventh in defense spending as a proportion of GDP. For comparison, the United States is the third-highest NATO member ranked in percentage of GDP (3.38 percent), ",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "MetallicaRules5",
                    "body": "These are interesting and can very well be addressed, but I've never really heard Trump publicly discuss this as one of his end goals. The tariffs are largely a response to drug trafficking and illegal immigration, not so much economics and trade. And even with these concerns, the current agreement with Canada and Mexico is set to expire and go up for renewal in 2026. The Trump admin could have held off and brought this to the table, and had a conservative government who would be more open minded to it.\n\nI'm not disagreeing that these are issues that I would want fixed. My concern is the execution and method on doing so.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "GiediOne",
                    "body": ">The tariffs are largely a response to drug trafficking and illegal immigration, not so much economics and trade.\n\nDisagree - numerous countries uses tariffs to protect their industrial sectors.  Look at China as an example, why can't the US use the same methods to protect our own citizens?  Having said that, the overriding trump economic goal is  free and *fair* trade.  Trade will not last between countries if it's not fair.  \n\n2026 is too far away, he needs the economy to be going like gangbusters going into midterms.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "dunkeater",
                    "body": "The strategy is to increase American manufacturing by either increasing exports or replacing imports with domestic product. Canada will need to increase their imports of U.S. products to negotiate away the tariffs.\n\nThe Canadian election is  irrelevant to the strategy. ",
                    "score": -30,
                    "replies": []
                },
                {
                    "author": "MetallicaRules5",
                    "body": "How do you increase exports by reducing the amount purchased by a trade partner? Canada responds with retaliatory tariffs on American goods, so now, current exports are being sold at a higher cost in Canada. Any new exports would take months or years to materialize in most cases because companies would need to shift production and labor. And what's to stop Canada from just buying from someone else? You go to Walmart for something, see the price has gone up, so now, you go to Kroger or another grocery store that's selling that same, or a similar, item for cheaper. Kroger may not have changed their price, but the new Walmart price went up so high, that it became the cheaper alternative.\n\nThe Canadian election is entirely relevant, as you would now have a party that may be more supportive of your initiatives and goals. Now all you've done is rejuvenate liberals to win and search for alternatives as a means to spite Trump. You want Canada to increase US based imports, don't piss them off and get a party directly opposed to you a massive electoral win. I generally like the FAFO philosophy, but you cannot apply it to everything. This is a horrible application of it.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "dunkeater",
                    "body": "The only way Canada will remove the tariffs is to commit to buy more American exports. Exports don’t increase while tariffs are active, they increase as an incentive to remove them. Trump did the same thing with China selling US soybeans last term.\n\nThe emotions of Canadian leadership don’t matter. This is simple economics, not favors between friends.",
                    "score": -8,
                    "replies": []
                },
                {
                    "author": "MetallicaRules5",
                    "body": "Name the import. Name the goal. Saying \"buy more American exports\" is not a goal, it's a want. Trump has not vocalized what the overarching end goal is. What exactly does he want? What does he want Canada to buy more of? What is victory to him? By what metric is that measured? Do the potential gains outweigh short and long term costs? You're just offering blanket and vague desires, not an actual need. And if this is so important to Trump, why didn't he make it a part of the USMCA, which he negotiated during his first term? If there was something he wanted, he could have brought that to the table when the deal was up for renewal in 2026. WITH a favorable conservative government in Canada to negotiate with.\n\nAnd by the way, Trump's main reason for implementing these tariffs has been illegal immigration and drug trafficking. Not economics and domestic production. Even the White House fact sheet released yesterday states drugs and immigration as the primary reasons.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "dunkeater",
                    "body": "Trump has repeatedly mentioned the trade deficit with Canada. Your understanding of his priorities doesn’t align with his actions.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rancesj1988",
            "body": "The real shame of all this was that conservatives were poised to assume power in the upcoming election in Canada but looks like we will be stuck with liberal leadership up north for another cycle.",
            "score": 146,
            "replies": [
                {
                    "author": "LebLeb321",
                    "body": "Yep. It's a disaster of Trump's design. The markets are getting hit hard.",
                    "score": 138,
                    "replies": [
                        {
                            "author": "dunkeater",
                            "body": "SPY is down 0.25% on the day. Do you actually own stocks?",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "LebLeb321",
                                    "body": "How's your portfolio doing? Are you happy with Trump's tariffs?",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "r2k398",
                                            "body": "DCAing like a boss",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "dam4076",
                                            "body": "Market doesn’t always move up. Look past the stock market and look at what’s best for the people.\n\nNot saying tariffs are that, but using the market as a barometer is not correct.\n\nYou can also grow your portfolio if the market is falling, going long isn’t the only option, short is a valid play.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "dunkeater",
                                            "body": "Doing quite well, thank you for asking. I’m extremely happy with Trumps tariffs and will keep buying more every paycheck. ",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "StrikeEagle784",
                                    "body": "My guess is, probably not lol",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GiediOne",
                    "body": ">Canada but looks like we will be stuck with liberal leadership up north for another cycle.\n\nAmerica can't be worried about what other countries will do in the future.  They have to (and so does Canada) do what is in their best interests regardless of what America or Canada does.  Canadians have chosen to put trade barriers that Trump and Ameican people have an issue with so Tariff Man will Tariff.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HuntForRedOctober2",
            "body": "This is not smart right now",
            "score": 428,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 7,
                    "replies": [
                        {
                            "author": "HuntForRedOctober2",
                            "body": "For Trump. Tariffs WILL objectively cause prices to go up. He got concessions from both countries last month. I do not understand why we are still going forward with this. The LAST thing Trump needs is prices going up.\n\nIf the goal is to make like Canada lower lumber tariffs, then fine, at least expressively state that.",
                            "score": 181,
                            "replies": [
                                {
                                    "author": "slipperysnail",
                                    "body": "I never believed for a second that the reasons cited by Trump were the true reason for imposing tariffs\n\nIt has everything to do with economics - in particular, bringing back manufacturing by becoming a net exporter again",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "HuntForRedOctober2",
                                            "body": "At the cost of making goods for everyone more expensive. Which will drive inflation. Trump can NOT be dealing with inflation past like July. It HAS to die.",
                                            "score": 88,
                                            "replies": [
                                                {
                                                    "author": "slipperysnail",
                                                    "body": "Everyone talks about prices rising, but no one talks about wage depression reversing\n\nIf manufacturing is able to return to the US, I think the overall buying power of the American dollar domestically will be strengthened - as opposed to the past half-century of making the American dollar the world reserve currency, which has only led to rapid wage depression",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "jamiejagaimo",
                                                    "body": "Name the goods that will rise in price because we can't get them cheaper from another country",
                                                    "score": -15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RadiantWhole2119",
                                    "body": "Trump isn’t making decisions for reelection. He’s making decisions based on what’s best for the country. Will it make things higher now? Yes, but we all voted him in expecting that. Things have to get worse before they can get better.",
                                    "score": -8,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -10,
                                    "replies": []
                                },
                                {
                                    "author": "HuntForRedOctober2",
                                    "body": "Cool, you know what I care more about? Prices of goods in the us.",
                                    "score": 74,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "likeabuddha",
            "body": "At what point is this just personal beef with Trudeau lol. I’m going to have to assume this move is to get him to finally balance the scales on what the US provides for Canada. Also, how long is Trudeau going to be making these decisions for Canada, he’s been out the door for months now…",
            "score": 114,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 78,
                    "replies": [
                        {
                            "author": "likeabuddha",
                            "body": "Yeesh. Yeah I’m going to guess that as soon as he’s out there’s going to be an entirely new relationship between the US and Canada and the tariffs go away once some new negotiations are made.",
                            "score": -23,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 144,
                            "replies": []
                        },
                        {
                            "author": "likeabuddha",
                            "body": "Couldn’t tell ya. Of all the things I’ve been on board with this isn’t anywhere near the top of the list.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "jamiejagaimo",
                            "body": "Yeah true I'm sure they'll all stop using Youtube, Google, Facebook, Instagram, Reddit, Amazon......",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "TodaysSJW",
                            "body": "What makes you think that 80% of the country has vowed to never visit or buy American made products?",
                            "score": -11,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "TodaysSJW",
                            "body": "Roughly how many people? Ballpark?",
                            "score": -7,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "TodaysSJW",
                            "body": "No, that’s not at all what I am saying. I was genuinely curious to hear what the Canadians on that side of the border are actually saying. Who better to hear from than an actual Canadian. I live in Florida and as I am sure you know we have a very large population of seasonal Canadian residents. In my industry, we see at least a few a day and it is normal to have conversations about news and politics specifically. Many of the conversations that I’ve had were of the opposite experience and I was wondering why you would have such an inverse opinion. \n\nI suppose much of it is that all politics are local. Even when you’re traveling. If you’re in a conservative area, like I am, you are more likely to encounter conservatives. And you, being where you are, encounter those with other opinions. \n\nI champion Canada buying local and investing in local manufacturing. That’s truly a win-win for everyone.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "StrikeEagle784",
                            "body": "Fella is forgetting how fickle people are, their attitudes will change soon enough. That’s assuming that “80 percent” number is even accurate",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hondaprobs",
                    "body": "Not only that but it looks like this has caused the Canadian Conservative party to tank in the polls so Trudeau's party will be re elected",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "rasputin777",
            "body": "People either don't know or pretend z but Canada's had tariffs on us for decades. We're not striking first here. Everyone's acting like it's an action war when Canada started this in what the 70s?",
            "score": 81,
            "replies": [
                {
                    "author": "r2k398",
                    "body": "270% or more in some cases",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "VastusAnimus",
                    "body": "Shhhh… don’t bring history and facts into this!",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "The_Mighty_Rex",
                    "body": "That's exactly what I bring up when anyone tries to talk tariffs. If tariffs are so evil and bad then why the fuck has everyone been OK with Canada imposing massive ones on us for decades? Oh right because this is all virtue signaling bullshit",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Far-prophet",
            "body": "We buy 70% of Canadian exports. High tariffs will devastate their economy. If they want to fuck around they will find out.",
            "score": 189,
            "replies": [
                {
                    "author": "LebLeb321",
                    "body": "Trump is the one fucking around and anyone in the market is finding out.",
                    "score": 497,
                    "replies": [
                        {
                            "author": "spezeditedcomments",
                            "body": "Bro, it's a sale. We hardly export dick to Canada  \n\nWho the hell looks at a single day snapshot of the market and says dumb stuff like this",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "dunkeater",
                                    "body": "People like that are the ones who sell everything when the news panics, then buy high after the bounce back.\n\nJust keep buying and enjoy the dips.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "LebLeb321",
                                            "body": "You're assuming tariffs won't cause a bear market. Considering how overvalued the market is, that is likely to be wrong.",
                                            "score": 51,
                                            "replies": [
                                                {
                                                    "author": "dunkeater",
                                                    "body": "Tariffs on Canada specifically are not nearly important enough to determine whether there is a bear or bull market.\n\nIf there is a bear market, dollar cost average and be patient. I’ve been hearing how overvalued the market is for decades and effectively no one has been able to time the market well enough to beat just buying and holding.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "LebLeb321",
                                                            "body": "Not sure if you noticed but the tariffs are on Mexico, Canada and China. That is a very large portion of your imports and exports. ",
                                                            "score": 46,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "cubs223425",
                                                    "body": "1. You're calling him out for an assumption while pushing your own.\n\n2. I know it'll spook people to say this, but I think we need the stock market to take one in the chin. We need a MASSIVE reset to the economic expectations of megacorps. They made out like bandits during COVID. They couldn't take the win and move in. They've doesn't the last few years trying to make those margins their new baseline.\n\nIt's choked out a lot of buyers. From cars to media and entertainment to tech and elsewhere, consumers have been asked to bend over for the sake of the stock market. This path isn't sustainable. Until the corporations are reigned in by lazy consumers, it's going to keep getting worse.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "No-Werewolf541",
                            "body": "What are we finding out? Market is nearly flat from the start of the year.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "LebLeb321",
                                    "body": "SPY is down 3.3% over the last month.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "No-Werewolf541",
                                            "body": "Okay and ?\n\nLiterally nothing lol\n\nEither you don’t invest or you are new to this. Enjoy the minor sale.\n\nTake a step back and hit YTD or longer.",
                                            "score": -4,
                                            "replies": []
                                        },
                                        {
                                            "author": "LebLeb321",
                                            "body": "So you mean look back to gains I made during the Biden Admin. Interesting argument.",
                                            "score": 53,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Far-prophet",
                            "body": "Well, buy shorts.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "TodaysSJW",
                            "body": "Are you in the market?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "LebLeb321",
                                    "body": "Most of my wealth is in US equities.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "BenchSpyder",
                                            "body": "Telling you don’t value the strength of Canada that much to invest there.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "LebLeb321",
                                                    "body": "A decade of Liberal leadership will do that.",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TodaysSJW",
                                            "body": "How has that wealth been affected by the Stock Market in the last 4 years?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "LebLeb321",
                                            "body": "It's been fantastic mostly under Biden. Trump hasn't been very good for my portfolio so far.",
                                            "score": 103,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "r2k398",
                            "body": "DCA",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Texas103",
                            "body": "Nah, I'm ok with the the market dipping a bit while Canada finds out.",
                            "score": -67,
                            "replies": []
                        },
                        {
                            "author": "LebLeb321",
                            "body": "We'll see how the midterms go for the Republicans when people's portfolios are all in the red.",
                            "score": 208,
                            "replies": []
                        },
                        {
                            "author": "cplusequals",
                            "body": "This isn't an even fight. We are 3/4ths of your exports but you're only 1/10th of our imports. Even if it was even, we can absorb much more economic shock than Canada. Thankfully, I expect this will end with a photo op within a month before any real damage is done. I'm not sure if it's a fight worth picking, but that depends on whether the resulting agreement is performative or useful and I'm not going to guess what the state department is looking for.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "Texas103",
                            "body": "My portfolio will be red and Canada will be bankrupt.  Lmao.  \n\nListening to \"Canadian Conservatives\" talk on this sub is all I need to hear.  Let's let this ride for a couple years and see who blinks first.",
                            "score": -49,
                            "replies": []
                        },
                        {
                            "author": "letmeinfornow",
                            "body": "Months.  Canada will blink first.  They don't have a choice.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -40,
                            "replies": []
                        },
                        {
                            "author": "LebLeb321",
                            "body": "How is that?",
                            "score": 77,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jcr2022",
                    "body": "If these tariffs remain on Canada for 1 year, they ere going to experience a recession the likes of which nobody alive in the western world can imagine.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "StrikeEagle784",
                            "body": "Their economy was already cooked before this started, this trade war could very well cripple them.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Opposite_Cress_3906",
                            "body": "Hopefully Canada figures out how to lower the goods they have 200%+ tariffs on us so we can all drop our economic weapons and trade freely then.",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the445566x",
                    "body": "Glad to see more companies making the move to open more operations within the US.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Academic-Tell4215",
            "body": "![gif](giphy|3o84sw9CmwYpAnRRni)",
            "score": 41,
            "replies": []
        },
        {
            "author": "AFishNamedFreddie",
            "body": "Canada relies on us much more than we rely on them. This trade war is incredibly one sided and will end with us winning.",
            "score": 150,
            "replies": [
                {
                    "author": "midnightrambler108",
                    "body": "Just curious, what would winning this trade war look like?  What defines a win here?",
                    "score": 313,
                    "replies": [
                        {
                            "author": "AFishNamedFreddie",
                            "body": "They get rid of their tarriffs on american goods and we establish free trade.\n\n  \nThey also stop the flow of fent across the boarder.",
                            "score": -76,
                            "replies": []
                        },
                        {
                            "author": "midnightrambler108",
                            "body": "Lol, you really think that is the truth?",
                            "score": 190,
                            "replies": []
                        },
                        {
                            "author": "AFishNamedFreddie",
                            "body": "Ok. What do you think is the truth then?",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "midnightrambler108",
                            "body": "The actual truth is that I have imported about 10 million worth of US products in the last 10 years and only 1 product has ever had a tariff on it.  And it was an anti-dumping duty and I am still fighting our government on it and have not paid the tax.\n\nIf you want to find examples of Canada being hit with anti-dumping duties in the US, look up the C-series jet while the Boeing debacle with the Max was going on.\n\nAs for fentanyl, I think we've intercepted more coming up from the south than going down ... \n\nCanadians think the only reason Trump listed Fentanyl as the reason is because he can do it with EO that way.  Otherwise you need Congress for this type of Trade Policy.",
                            "score": 182,
                            "replies": []
                        },
                        {
                            "author": "AFishNamedFreddie",
                            "body": "so.... Because you personally havent interacted with the tariffs, they dont exist? Are you seriously saying cananda doesnt have massive tariffs on american goods?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "midnightrambler108",
                            "body": "We have a free trade agreement that Trump signed.\n\nI am saying that if there is tariffs on something it’s likely an anti-dumping issue.  Of which Canada has been penalized for in the past as well.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "AFishNamedFreddie",
                            "body": "\\> if there is tariffs on something, its likely an anti-dumping issue\n\n  \nOk so youre just ignorant on the entire situation then. Got it.",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "day25",
                            "body": "I used to think Trump wanted to encourage more free trade. Now I doubt it. He has been oddly unspecific in his list of demands. He vaguely mentions things like dairy but gives no specifics. If he wanted more free trade I'd expect he'd comminicate that we'll lift the tariffs Canada just has to do x, y, z. Instead it's just generic stuff like improve border security, and if Canada takes the (internally difficult) step of rebuking its dairy lobby there's not even any guarantee the tariffs would be lifted, so why would Canada do that? The whole thing seems more designed for protectionism this time around though I hope I'm wrong. If this is a new era of protectionism things are going to get worse for everyone except China. China will gladly replace the products and services the rest of the world gets from the US if people no longer want to do business with us (or more accurately we no longer want to do business with them). So I really hope this is not the end goal.",
                            "score": 90,
                            "replies": []
                        },
                        {
                            "author": "No-To-Newspeak",
                            "body": "Here is a solution - stop using illicit drugs.  No demand  no supply.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TooMuchButtHair",
                    "body": "Or with Canada finding a new permanent trading partner. That's how business works.",
                    "score": 828,
                    "replies": [
                        {
                            "author": "Sugarcoatedgumdrop",
                            "body": "Canada already struggles exporting to the US. What makes you think they won’t suffer even worse issues trying to export overseas?.. that being said.. could they even afford to?",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "TooMuchButtHair",
                                    "body": "If it's cheaper than doing business with the U.S., yes. Or if an American adversary, say the BRICS, want to cause an implosion in American diplomacy and strip us of allies, they'll just eat the cost.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GiediOne",
                            "body": "China will eat Canada's lunch, while EU will Tariff them the same way EU Tariffs America.",
                            "score": 60,
                            "replies": []
                        },
                        {
                            "author": "Nectarine-Fast",
                            "body": "I wish them the best of luck finding a partner that enjoys getting submissively screwed and meets all of Canada’s demands",
                            "score": -87,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Peacock-Shah-III",
                    "body": "What is the war over, though? I’m not aware of many US jobs being relocated to Canada.",
                    "score": 245,
                    "replies": [
                        {
                            "author": "AFishNamedFreddie",
                            "body": "The tariff structure between the two countries was incredibly one sided. Canada had massive tariffs on us, we had hardly any on them.",
                            "score": -66,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-To-Newspeak",
                    "body": "Energy and potash are Canada’s ace in the hole.  Cut off oil, gas, electricity and fertilizer.  The average US homeowner and farmers will love paying more and sourcing elsewhere.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "r2k398",
                    "body": "Don’t tell that to your average lib on Reddit. They think we need them more than they need us.",
                    "score": 91,
                    "replies": [
                        {
                            "author": "Ballin095",
                            "body": "The brigading has been nuts on the sub reddit lol. I haven't been here in a while and all the posts breaking this situation down as been downvoted to the abyss. ",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Just_top_it_off",
                            "body": "The big motor city automotive industry is just so extremely inefficient they have to ship pieces of cars back and forth through Canada for assembly since it never cost them anything. They have the means to do it here but they just don’t want to.  \n  \nThankfully that’s coming to an abrupt end and on top of that there will be more competition from other brands to lower prices.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wide_Fig3130",
                    "body": "I still had maple syrup today 🙃",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "____IIIII___ll__I",
                    "body": "It's honestly insane that Canada's Governor thought that this was a good idea. 😂",
                    "score": -84,
                    "replies": [
                        {
                            "author": "abruty",
                            "body": "Good ole classic case of FAFO",
                            "score": 29,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YDKJack69",
            "body": "Just match Canada’s tariffs on the U.S. and let’s talk in a day. This is the right way to deal with these Canadian “leaders”.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NowIKnowMyAgencyABCs",
            "body": "Canadas economy will be destroyed from this, especially if they retaliate.",
            "score": -27,
            "replies": [
                {
                    "author": "StrikeEagle784",
                    "body": "Their economy was already cooked before this, it’s gotten worse for them now.",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrikeEagle784",
            "body": "Sounds good!",
            "score": -60,
            "replies": [
                {
                    "author": "CorneredSponge",
                    "body": "Very libertarian of you",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Leftrighturn",
                    "body": "The first step in purchasing Canada: \n\n\n\nMake it cheaper",
                    "score": -18,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GiediOne",
                    "body": "Long term it will be even better if Canada does this.  There will be so many Canadian firms opening up shop in the US.",
                    "score": -34,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkYogurtcloset2661",
            "body": "When the USA comes out better from this I sincerely hope all you fake conservatives eat your words\n\nSo many fake conservatives in here",
            "score": -19,
            "replies": []
        },
        {
            "author": "StrikeEagle784",
            "body": "Literally, absolutely insane how so many of these so-called “Conservatives” are choosing to side with Canada before their own country.\n\nI understand Canadian Conservatives being upset, and for siding with their country before the US, but American Conservatives should side with their country right now.",
            "score": -8,
            "replies": []
        },
        {
            "author": "EverySingleMinute",
            "body": "Canada already has tariffs on the US.  We add tariffs and we are the bad guys.  I guess they get a free pass because we imposed tariffs? How is that supposed to work ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimmyg899",
            "body": "Trade war is lit 🔥. At least if he crashes the market interest rates will go down and I can afford a new dream house.\n\nEdit: this was /S to everyone who has no sense of humor",
            "score": -16,
            "replies": []
        },
        {
            "author": "jamcones2gamcones",
            "body": "Damnit Trump, this was a missed opportunity to say \"...Governor Trudeau, of the great state of Canada...\"\n\n🤣",
            "score": -82,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -39,
            "replies": []
        },
        {
            "author": "jamcones2gamcones",
            "body": "🤣\n\nThe great state line would just be a wonderful topping\n\nEspecially knowing how much it pisses off the liberals from here canada and yuropee",
            "score": -35,
            "replies": []
        },
        {
            "author": "Crisgocentipede",
            "body": "Once again TDS will cause the other side to do anything even if it hurts themselves",
            "score": -4,
            "replies": []
        },
        {
            "author": "kaytin911",
            "body": "Leftists are mad because they want the US to fail.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Crisgocentipede",
            "body": "As my downvotes show.",
            "score": 4,
            "replies": []
        },
        {
            "author": "kaytin911",
            "body": "Good news.",
            "score": -9,
            "replies": []
        },
        {
            "author": "Magehunter_Skassi",
            "body": "This is good for Canadians too. The future of our countries is tied together, and Canadian patriots need assistance in throwing off the shackles of their globalist uniparty. Their politicians have been selling off their homeland for decades and it has to stop.",
            "score": -73,
            "replies": []
        },
        {
            "author": "Germy_1114",
            "body": "I’m pretty sure both left and right Canadians hate us right now",
            "score": 114,
            "replies": []
        },
        {
            "author": "Magehunter_Skassi",
            "body": "Canada's Conservative Party isn't right-wing, they're to the left of even Romney. It's young Canadian right-wingers who are increasingly warm to the rise of the global right (including Trump).",
            "score": -9,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 172,
            "replies": []
        },
        {
            "author": "NiceSeaworthiness909",
            "body": "I was wondering about this. Definitely puts Pierre Poilievre in an awkward position. I know he has come out hard against Trump on this, but it seems to me that the perception would (somewhat justifiably) be that Poilievre was too cozy with Trump and his right wing pundits, and it would be hard to undo that in this environment.",
            "score": 61,
            "replies": []
        },
        {
            "author": "fayynne",
            "body": "He’s absolutely fumbled this entire thing so far, he had a free majority win but shit the bed and we likely have to deal with more liberal government",
            "score": 48,
            "replies": []
        },
        {
            "author": "hondaprobs",
            "body": "Aren't the conservatives tanking in the polls though recently? And the liberals increasing since Castro announced his resignation",
            "score": 3,
            "replies": []
        },
        {
            "author": "Celebril63",
            "body": "The part of this that I don't understand is there is only one thing Trump is wanting.  *REAL* action regarding fentanyl smuggling; not the typical token lip-service.  The studies are out there that the Canadian border is a part of the problem.  Not as bad as Mexico, but a very real part of the problem.",
            "score": -20,
            "replies": []
        },
        {
            "author": "mikemaca",
            "body": "Yes. Canada has been so hostile do doing anything at all about the drug and other problems that it is impossible not to conclude that their leadership is personally receiving some benefit from the traffic - just as we have seen how the Mexican politicians benefit greatly from the narcotics gangs. Trump's requests here are beyond reasonable. They are common sense. Canada has shown its true colors. We knew they were not an ally because of how often they vote against us at the UN, but they are a bad neighbor as well. We need to reevaluate the relatively unrestricted visa free travel across the border and we are going to have to use our military to secure the border until a wall can be built.",
            "score": -3,
            "replies": []
        }
    ]
}