{
    "title": "Zelensky just bent the knee, that did not take long at all",
    "author": "-Istvan-5-",
    "subreddit": "Conservative",
    "rank": 85,
    "score": 917,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 434,
    "url": "https://x.com/ZelenskyyUa/status/1896948147085049916",
    "id": "1j3khw9",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been so heavily reported that I, Automoderator, decided to promote our other socials.  [Follow us on X.com](https://x.com/rcondiscord) and [join us on Discord](https://discord.com/invite/conservative).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Coastie456",
            "body": "He is willing to swallow his pride and suffer the antics of the current administration if it means that Ukraine has a fighting chance at peace at the end of the day. How can one not respect that?",
            "score": 129,
            "replies": []
        },
        {
            "author": "LazyBatSoup",
            "body": "That's almost verbatim what one of Trump's people said on air. Glad he did it so we can move on from this silly moment. No way, for all our bluster, would the USA stop supporting an ally over a spat in the oval. No way, was Ukraine NOT going to do or say whatever it took to keep our support. Let's get to the peace part.",
            "score": 47,
            "replies": []
        },
        {
            "author": "edgyteen03911",
            "body": "He needs to look at what we have just secured with Taiwan. We now have a direct tie with Taiwan sovereignty and prosperity. If Taiwan goes under our economy takes a hit and that in itself is a security guarantee for Taiwan. Thats why they invested 100bn and will continue to because the more economically intertwined Taiwan is with the US the more likely the US will come to Taiwans aid. This is why the MINERAL RIGHTS deal is critical for those SECURITY GUARANTEES Zelensky wants. However, he wants that open cash flow from the US that he can launder to his friends instead and thats why he’s stone walling and demanding money.",
            "score": 37,
            "replies": []
        },
        {
            "author": "hondaprobs",
            "body": "He said all that but then mentioned Security Guarantees at the end which kind of brings him (and Trump) back to square one. Trump doesn't want to provide security guarantees.",
            "score": 6,
            "replies": []
        },
        {
            "author": "komatsu-D355a",
            "body": "False. He repeated three times in the last paragraph that he still wants a security guarantee which means US troops in Ukraine, defending against Russia. He has learned absolutely nothing and changed absolutely nothing. This is more of the same garbage that has caused negotiations to fail three times already. \n\nJust block his number at this point. He’s done.",
            "score": 432,
            "replies": [
                {
                    "author": "InAingeWeTrust",
                    "body": "The security guarantee is USA having a lot invested in the land. It’s one thing to attack a non-NATO government without any powerful allies.\n\nIt’d be another thing, in the future, to attack a government that the United States has a lot of money to gain from; also with EU increased defense spending.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "Probate_Judge",
                            "body": "> The security guarantee is USA having a lot invested in the land. It’s one thing to attack a non-NATO government without any powerful allies.\n\nI think this is a point that's getting miscommunicated between Trump / Zelensky.  They're talking past eachother because Zelensky doesn't quite get the implication, and Trump doesn't want to look like he's putting military in Ukraine.\n\nThat's why I had to laugh at the AI parody video of Zelensky 'we're no playing cards, we're not playing checkers, there is no board\" and so on.  \n\nFor reference(I had to dig up the tik tok because I saw it on reddit):\n\nhttps://www.tiktok.com/@mrreaganusa/video/7478053761311657262?lang=en",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "-Shank-",
                    "body": "Security is implicit with the mineral rights deal, as it ties the US and Ukraine at the hip, places Americans on the ground there, and puts US skin in the game in order to recoup its investment.",
                    "score": 82,
                    "replies": [
                        {
                            "author": "komatsu-D355a",
                            "body": "Exactly. That’s what he keeps trying to do. That’s why negotiations keep failing. It’s a terrible deal. \n\nWe should be willing to buy any minerals he wants to mine and ship, but if we marry ourselves to a crap situation where we have to fight Russia to protect a mining operation that WE have to pay for, it’s just a lose lose situation. And here he is again gluing the idea of us entering a conflict to get permission to mine minerals. We don’t need it.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "-Shank-",
                                    "body": "That's what I'm saying. I don't think it's even biased to say that the deal seems pretty good for Ukraine on paper and really not that great for the US since it's significant risk for marginal return down the timeline. It's a head scratcher that Zelensky wouldn't stop pushing in front of the media other than to be performative.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Just_Confused1",
                    "body": "He says “We see this agreement as a step toward greater security and solid security guarantees”\n\nThat implies that the mineral agreement in itself is a step towards security which is already was has has been this whole time\n\nNo where in that tweet did he say he needed additional security guarantees to sign the deal",
                    "score": 38,
                    "replies": [
                        {
                            "author": "komatsu-D355a",
                            "body": "The phrase “security guarantees” was in both early mineral contracts that failed and was brought up like 5 or 6 times in the 50 minute discussion that broke down on live TV. It’s the only thing Zelensky wants and what he keeps saying is that he needs America to pledge complete protection from Russia. He wants us to be obligated to fight Russia directly. He wants US troops in Ukraine guarding the border. He knows that no amount of money will help him and he refuses to give up the land he’s lost to end the war. He wants us to fight for him forever and for us to pay for it. \n\nHe also has only offered RIGHTS to the minerals but we have to spend billions building the mining operations and shipping them to ourselves. \n\nSo when he constantly brings up “security” he’s always talking about the same thing. He wants an open ended guarantee that America will risk WW3 with Russia in exchange for permission to spend billions of dollars mining minerals. \nIt’s a really terrible deal. \n\nWatch the entire meeting from the other day. He won’t stop bringing up the security and he gets shut down every time.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Kaireis",
                                    "body": "We'll make more than we spend. It also secures us a supply of rare earth minerals that aren't already choked up by China or Russia.\n\nWe need to be circumspect about the boots on the ground thing. Most of us don't want boots there, but we need the threat to be credible (to protect our mineral rights).",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Just_Confused1",
                                    "body": "I guess we'll have to wait and see but personally, I don't think that's what's happening\n\nYes in the prior meeting with Trump, it seems that the Dem senators had prepped him to ask for boots on the ground security guarantee, which was never gonna happen and, as you said, would risk WWIII\n\nHowever, the minerals deal was always, in a way, a kind of security guarantee as it would have US non-military personnel on the ground there and, therefore, any military aggression by Russia nearby would be seen as endangering US lives and prompt the US to respond. It is an indirect security guarantee that would protect Ukraine while also be reasonable for Russia to sign off on. \n\nZ probably met with some other advisors and now see's this as the case as he says in the tweet, [\"Regarding the agreement on minerals and security, Ukraine is ready to sign it in any time and in any convenient format. We see this agreement as a step toward greater security and solid security guarantees, and I truly hope it will work effectively.\"](https://x.com/ZelenskyyUa/status/1896948147085049916). He is saying that he is willing to sign the deal as is and that it is a step towards the greater security of Ukraine.\n\nSure you can make the argument that it's all gonna go up in smoke the way it did Friday but I doubt it and anything more is purely speculative",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "komatsu-D355a",
                                            "body": "I’m saying I HOPE it all goes up is smoke for all the reasons you mentioned. We agree on all of that. \n\nHe wants to have his cake and eat it too. \n\nWe send money, weapons, troops, and resources to protect a mine that WE pay to build and operate. So we can pay to ship minerals to ourselves, in exchange, we have to risk troop lives, and risk war with Russia, because he wants us to promise to defend his border. . .forever.  \n\nWe don’t even need the minerals. We can buy them anywhere for a hell of a lot less hassle. \n\nBasically Zelensky has very little to offer and is demanding the world in exchange for it. \n\nTrump doesn’t even want the mineral deal, he’s said repeatedly he wants peace talks instead. The mineral deal is a fallback because Zelensky is so obsessed with continuing the war that we offered a way for him to keep funding his bad idea. But he doesn’t want that deal. He wants that deal and also a fully US funded war with Russia. \n\nHe’s just not functioning in reality.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UConnSimpleJack",
                    "body": "Security guarantees come in many forms. American interests abroad are essentially a security guarantee. Russia cannot touch land that is occupied by American companies with American workers. That’s the security guarantee.\n\nThere’s almost no chance we will be able to build military bases in Ukraine without escalation",
                    "score": 54,
                    "replies": [
                        {
                            "author": "lolycc1911",
                            "body": "I mean to be fair we had business there before and probably still do in western Ukraine.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "komatsu-D355a",
                                    "body": "Well we know we’ve got gain of function research going there. . .apparently a lot of it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "r2k398",
                            "body": "Except he wants a force of 1.5 million troops in Ukraine or admission into NATO. https://kyivindependent.com/we-need-a-1-5-million-army-if-we-are-not-going-to-be-in-nato-zelensky-on-ukraines-membership-in-alliance/",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "dottedoctet",
                                    "body": "Want in one hand and shit in the other. See which one fills up first.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "i_dont_do_hashtags",
                    "body": "DJT has alluded and Rubio has pretty much stated that there will be boots on the ground once the deal is signed. All Z needs to do is apologize and sign the effing deal.",
                    "score": 94,
                    "replies": [
                        {
                            "author": "MoistCookie9171",
                            "body": "I fucking hope not. Ridiculous to send our troops there.",
                            "score": 269,
                            "replies": [
                                {
                                    "author": "hiricinee",
                                    "body": "The two suggestions were European troops and American workers on the rare earth, so that if Russia attacked the US would have an interest in defending its assets there.  The second part is the entire point of the mineral deal, to get some US skin in the game.",
                                    "score": 84,
                                    "replies": [
                                        {
                                            "author": "KohliTendulkar",
                                            "body": "What if it looks like that Russian attacked? Remember NS-2?",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "edeflumeri",
                                            "body": "Like we don't have skin in the game already? How about the tens of billions of dollars?",
                                            "score": -19,
                                            "replies": [
                                                {
                                                    "author": "hiricinee",
                                                    "body": "The billions are gone.  If Ukraine drove Russia out completely tomorrow, we'd have the same amount of money as if Russia invaded and completely conquered Ukraine.",
                                                    "score": 42,
                                                    "replies": [
                                                        {
                                                            "author": "Vektor0",
                                                            "body": "Yep. What he's saying is called a sunk cost fallacy.",
                                                            "score": 21,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Silly-Safe959",
                                                    "body": "Because we can walk away from that.   It's a sunk cost unlike a mineral deal with hundreds of billions more.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "icemichael-",
                                    "body": "They would be there to protecc our minerals tho, not ukraine",
                                    "score": 115,
                                    "replies": [
                                        {
                                            "author": "Acheron98",
                                            "body": "Yeah, that I’m fine with. \n\nIt’s relatively standard practice to send troops to protect our various projects and mining operations; *especially* in an active war zone.\n\nFor what it’s worth, I don’t think we should have anything to do with Eastern Europe *period*, but assuming the deal gets signed, yeah, I have no issue with sending (a reasonable amount of) soldiers to go watch over our shit.\n\nEdit: Given the choice between “Get shot at and blown up by terrorists in the desert” and “Just go and make sure no idiots try to steal our molybdenum” I’d wager most would prefer the latter.",
                                            "score": 50,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Slalom44",
                                    "body": "Trump called them Peace troops. He has no intention of sending troops to address a conflict.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Consistent-Chicken-5",
                                    "body": "We have boots on the ground in 55 countries, quite a few are to prevent Russian aggression.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jimmyg899",
                                    "body": "Whatever ends up happening will be negotiated to and agreed with Russia so even if we get troops on the ground over there Russia would be okay with it. It would be a huge escalation to do that and Trump is trying to create peace.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "tangy_nachos",
                                    "body": "Not really. We’d have financial gains to see to. Plus, Zelenskyy wants security. This seems like a win win. Nothing in the real world is perfect. You have to make concessions",
                                    "score": -22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WatchLover26",
                            "body": "We better not freaking put boots on the ground. F that mess.",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "soupdawg",
                                    "body": "If we have a vested interest in the minerals we will have troops there to protect them.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "WatchLover26",
                                            "body": "Well, I am ok with using military to protect America’s interests.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nybadfish",
                                    "body": "Work boots not army boots. Poor choice of words",
                                    "score": 40,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "r2k398",
                            "body": "Not US troops. A reassurance force of EU troops.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "i_dont_do_hashtags",
                                    "body": "Correct me if I’m wrong, but why would Z need to sign a deal with the US to have EU troops in Ukraine? Unless signing it ensures American military presence/involvement of some sort, the EU doesn’t need this to  send their troops.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mojo276",
            "body": "IMO he was going to do it when he was here the other day, but then it devolved into an absolute shit show.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Bevrykul",
            "body": "I mean, it's not like he had a choice.",
            "score": 26,
            "replies": []
        },
        {
            "author": "TheOnlyEliteOne",
            "body": "Get your life jackets men (and women). There’s going to be a flash flood of Redditor tears.",
            "score": 16,
            "replies": []
        },
        {
            "author": "According-Activity87",
            "body": "Peace through strength! May the winning never end! America is back!",
            "score": 151,
            "replies": [
                {
                    "author": "v3rninater",
                    "body": "I hope we don't spend another dime over there, Europe and all the rest of the countries can help and do their fair share...",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "GiediOne",
                    "body": ">Peace through strength! \n\nI love that concept❗️",
                    "score": 22,
                    "replies": [
                        {
                            "author": "CAJ_2277",
                            "body": "You oppose the 8% annual defense cuts Trump plans on, then?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bw2082",
            "body": "I don't see any apology.",
            "score": 92,
            "replies": [
                {
                    "author": "Just_Confused1",
                    "body": "Being real here, this is the closest you're gonna get to an apology from any politician who isn't about to step down from their position",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "_Diggus_Bickus_",
                    "body": "He said he was grateful for Trump providing him with weapons, specifically javelins, and he said the meeting was not supposed to go that way.\n\nIt's not an apology per se, it's more \"you were right\"\n\nI'm not about to be petty about pride when we're talking about the end of a war and someone doing the right thing",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "According-Activity87",
                    "body": "It's a prelude to what will likely be a very public apology.",
                    "score": -30,
                    "replies": []
                },
                {
                    "author": "-Istvan-5-",
                    "body": "He's gonna come back to the oval office in a suit to kiss the ring",
                    "score": -73,
                    "replies": [
                        {
                            "author": "Sniper1154",
                            "body": "It would be awesome if it was the suit Vinny wears in the courtroom scene in *My Cousin Vinny*",
                            "score": 33,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ReaganWon",
            "body": "We will know the details tonight.  After the blowup, Trump will have no reservations to tell us exactly what transpired over the weekend through literally the moment he takes the podium. \n\nTo me, the statement is fine.  The leader of a country won't grovel to another.  Frankly though, that is the closest I have ever seen.  Zelenskyy said exactly what Rubio and Vance asked of him.  I would be surprised if he didn't call Trump or one of them.\n\nI am glad he realized he fucked this up and wants to move on to the next phase: preparing a ceasefire. \n\nTo me, the hard part will be to get Putin to agree to a reasonable settlement after the ceasefire.  I could seriously see a Korean War sort of end here: multiple small ceasefire agreements that don't end in peace until finally one side or the other says \"uncle\" and they make a very ugly deal.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Single-Stop6768",
            "body": "Tbh I'm not sure staying involved is good for us. He only started to change his tune once the aid was cut off. What's to force him from negotiating in bad faith after the deal is done?\n\n\n80% of Americans want the war to be over. The vast majority of those that voted for Trump want us to stop spending all this money on a war that has nothing to do with us. I think regardless of if he actually signs the bill this time (unlike all the other times he said he would but then backtracked) that the aid should remain frozen until he agrees to s ceasefire and then peace talks. The obvious caveat there is if it's Putin that refuses the ceasefire then that can't be held against Ukraine ",
            "score": 42,
            "replies": [
                {
                    "author": "eatajerk-pal",
                    "body": "A big chunk of that 80% has wildly unrealistic expectations about the terms of a ceasefire. They think if Russia doesn’t just hand over the territory they’ve conquered in the last 3 years then Trump is a Russian asset. They love making fun of the failed negotiations last week, but they have no idea how to end this either. They would happily let Ukrainians keep being cannon fodder if it makes Trump look bad in their eyes. They don’t understand that making Ukraine whole again would only happen with US and NATO boots on the ground, which would be the start of WWIII.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "budabai",
                    "body": "I admittedly don’t have a solid understanding of the current deterrent solution.\n\nTrump said that having an American presence in Ukraine will work to keep Putin from attacking.\n\nDoes this mean that we plan on having American mining rare earth mining operations in Ukraine?\n\nWill these mines be staffed by Ukrainian citizens? Or are we going to have American miners in Ukraine?\n\nAmericans in Ukraine just opens the door to the possibility of Americans dying… shit only gets worse in this hypothetical scenario.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Unreasonably-Clutch",
                            "body": "It's like the American controlled oil fields in Syria. Russia stayed the heck away from them because they didn't want to pick a fight with the US. Check out the time the US obliterated Wagner mercenaries after Russia disavowed them.   \n[https://www.youtube.com/watch?v=viuUzGGac5M&t=9s](https://www.youtube.com/watch?v=viuUzGGac5M&t=9s)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ThrowawayMonster9384",
                            "body": "If they put US civilians to work there, It would be a deterrent for putin because he knows if Americans die, the US will retaliate. \n\nIt's a way of putting some security without putting a base or our military there. \n\nYes putin could attack and suffer the consequences but that seems unlikely. \n\nI'm not sure what there is to gain for Putin besides the land he's taken. Is that all he wants as of now?\n\nHe doesn't want US military that close to him, he's probably worried about getting shafted by the US.\n\nSo maybe this is a win for everyone. No US military on Ukraines borders to threaten putin, and a guarantee that Russia won't attack US civilians without major reprecussions. \n\nThat's what I'm inferring, they may have different reasoning in mind.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "chillthrowaways",
                                    "body": "Not a win for everyone.  There’s a lot of people making a lot of money from this war and ending it cuts off that gravy train.  Their wettest of wet dreams is ww3 because their Raytheon stock will go up.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Opposite_Cress_3906",
            "body": "He never had a knee to bend. He just needed to figure that part out the hard way.",
            "score": 58,
            "replies": []
        },
        {
            "author": "ThozAlan",
            "body": "I have a friend who is very democrat. Maybe not extreme left, but would never vote non-D. He told me, he's okay with Republicans and especially MAGA because he knows exactly where they stand, and doesn't need to guess. Some of his fellow cohorts, not so much, and he doesn't really have much good to say in regard to a lot of the woke bs they push.\n\nIn the same regard, President Zsky probably realized after talking to his EU friends they would be more likely to talk a good game, and then slow walk the talk.",
            "score": 28,
            "replies": [
                {
                    "author": "whippingboy4eva",
                    "body": "That's how it starts. Once upon a time, he was me. \n\nThe beginning of the end was realizing republicans were way more fun to have some beers with lol.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "kaytin911",
            "body": "[https://avalon.law.yale.edu/18th\\_century/washing.asp](https://avalon.law.yale.edu/18th_century/washing.asp)\n\nRead what George Washington said about Europe. He warned about all of this American submission and to not get tied up in Europe's arrogance.",
            "score": 8,
            "replies": [
                {
                    "author": "jeon2595",
                    "body": "While he says more about it, this is probably the most applicable portion: \n\n“The great rule of conduct for us in regard to foreign nations is in extending our commercial relations, to have with them as little political connection as possible. So far as we have already formed engagements, let them be fulfilled with perfect good faith. Here let us stop. Europe has a set of primary interests which to us have none; or a very remote relation. Hence she must be engaged in frequent controversies, the causes of which are essentially foreign to our concerns. Hence, therefore, it must be unwise in us to implicate ourselves by artificial ties in the ordinary vicissitudes of her politics, or the ordinary combinations and collisions of her friendships or enmities.”",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "ergzay",
            "body": "This is the same thing he's been saying all along. In fact he said the same thing the same day when he expressed a want to come back and Trump didn't want him to come back.\n\nThis is just theater folks.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hillmon",
            "body": "After they cooled off they saw Trump was right. Takes a big man to admit he was wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "T0XxXiXiTy",
            "body": "Kiss the ring biatch!",
            "score": -185,
            "replies": [
                {
                    "author": "Just_top_it_off",
                    "body": "Suka on deez nuts!  \n  \n[[context]](https://www.dailymail.co.uk/news/article-14452553/amp/Zelensky-JD-Vance-Oval-Office-attack-Trump-VP.html)",
                    "score": -49,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slainlion",
            "body": "I'm sure he bends down to piss too",
            "score": -33,
            "replies": []
        },
        {
            "author": "Sugar-Active",
            "body": "As I predicted the very moment he was thrown out.",
            "score": -8,
            "replies": []
        },
        {
            "author": "Scamandrius",
            "body": "The only possible way it could have ended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "krystalgeyserGRAND",
            "body": "This war will never end then! Who gives a shit about the minerals, Russia will never give that territory. DjT can't be This dumb.\n\n\nUnless the defense contractors gave him a call",
            "score": -13,
            "replies": []
        },
        {
            "author": "roaming_art",
            "body": "\"Regarding the agreement on minerals and security, Ukraine is ready to sign it in any time and in any convenient format. We see this agreement as a step toward greater security and solid security guarantees\"\n\nThat's an interesting take, we see it as repayment for the HUNDREDS OF BILLIONS of dollars we sent to save your ass.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Funk__Doc",
            "body": "Couple this with a refusal to join NATO along with ceding Donbas. \n\nRussia will never give up if it shares a border with NATO (akin to having multiple Russian bases along our northern border - we would never stand for it).",
            "score": -7,
            "replies": [
                {
                    "author": "CAJ_2277",
                    "body": "Several NATO members border Russia already. Finland, Norway, Estonia, Latvia, Lithuania, Poland, etc. etc.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "krazyellinas23",
            "body": "We will NOT make a security guarantee as that could lead to WW3! This maniac doesn't care, he wants to stay in power so as long as the war is going, martial law is in effect. The dictator is enjoying the power.",
            "score": -8,
            "replies": [
                {
                    "author": "ThrowawayMonster9384",
                    "body": "Could it be that merely having US civilians working with the mines a security guarantee itself?\n\nIt would deter Putin from attacking due to retaliation from the US. It will mean there no US military as well that close to Putins territory which hed be happy about.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "krazyellinas23",
                            "body": "I think so. That's as far it goes. The economic factor is the guarantee but Zelensky wants boots on the ground. It won't happen and he will use that as a rallying cry to keep the war going",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ThrowawayMonster9384",
                                    "body": "He's said that, but maybe he's changed his perspective and is accepting of the mineral deal as security itself. \n\nI don't think he wants the war to continue. I think he wants sovereignty of Ukraine, which is understandable. He wants a guarantee they won't be invaded again. He wants Russia to stop  progressing into their territory. \n\nThere is more than one way to guarantee security though. This is the best way without getting the US completely involved. I know he originally would have liked to have a US base like the one in S Korea or Japan or Germany, but he isn't going to get that. \n\nJust signing a treaty is not enough though. Look at the Budapest Memorandum, one party failed to keep their end of the bargain, Russia. \n\nhttps://en.m.wikipedia.org/wiki/Budapest_Memorandum",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TehBootybandit",
            "body": "![gif](giphy|KjJFSB1SjfRAoCSmYT|downsized)",
            "score": -12,
            "replies": []
        }
    ]
}