{
    "title": "This is why Europe is so upset about being made to pick up the bill for Ukraine.",
    "author": "Jibrish",
    "subreddit": "Conservative",
    "rank": 3,
    "score": 896,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 213,
    "url": "https://i.redd.it/nbn5czffhwme1.jpeg",
    "id": "1j47j77",
    "selftext": "",
    "comments": [
        {
            "author": "reddog093",
            "body": "It's been Canada's M.O. for decades, too.  Their response is \"Well, our citizens just don't feel like spending since the U.S. has us covered\"\n\n>[https://www.bbc.com/news/articles/cl4ygzlz4mzo](https://www.bbc.com/news/articles/cl4ygzlz4mzo)  \\- July 2024 under Biden\n\n>Canadian public does not see defence spending as a priority when measured against other needs, like healthcare and other social services.\n\n>“Both major parties in Canada recognise that it is in their political interest to spend at a certain level that shows you are taking care of the armed forces, but not necessarily at a level where it begins to impact your other priorities,",
            "score": 28,
            "replies": []
        },
        {
            "author": "DareElektra",
            "body": "It’s just another form of nimby",
            "score": 11,
            "replies": []
        },
        {
            "author": "RandolphE6",
            "body": "That's how liberals think. They want things as long as someone else is paying for it.",
            "score": 100,
            "replies": [
                {
                    "author": "bozoconnors",
                    "body": "YUP.  Zero hesitation spending *other* peoples money.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "HedonisticUser",
                    "body": "Let’s just steal everyone else’s money because they worked harder than me! /s",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "j3remy2007",
            "body": "Now do this for how each of these countries feels about the United States, and whether the US should be paying more.\n\nThis sounds like every leftist ever.  \"We should pay more.  Not me, of course, but we should totally pay more.\"",
            "score": 54,
            "replies": []
        },
        {
            "author": "According-Activity87",
            "body": "I'm so sick of us picking up the bill for Europe, and now, through the power of democracy, so is my President!\n\n![gif](giphy|lNBpbo8txjs4vdBvVy)",
            "score": 79,
            "replies": [
                {
                    "author": "Emilia963",
                    "body": "Hot deal of the century:\n\nThey get a security guarantee for the next 10 years and no more NATO\n\nWe get 1000 billion dollars worth of natural resources from all over Europe \n\nThis deal can be extended after its expiration",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "JimmyReagan",
            "body": "Classic liberal mindset- I want to help, as long as it's with someone else's money.",
            "score": 19,
            "replies": []
        },
        {
            "author": "slippery_55jack",
            "body": "I hate the fact that the countries are not in the same order for both sets of data… r/dataisugly",
            "score": 34,
            "replies": [
                {
                    "author": "Skesiss",
                    "body": "I also don't trust random surveys lol\n\n![gif](giphy|xT9IgEx8SbQ0teblUQ|downsized)",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "dog_in_the_vent",
            "body": "This is not America's fight. What happened to Ukraine is wrong, but we're not just going to keep sending billions of dollars over there especially if Zelensky doesn't want peace and doesn't even pretend to be grateful for it.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Newacc2FukurMomwith",
            "body": "Passing responsibility. The European way.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Flarisu",
            "body": "It's always about OPM, other people's money.\n\nYou know this because when you ask a leftoid who believes the rich should pay more, they adamantly believe that they should pay nothing.",
            "score": 14,
            "replies": [
                {
                    "author": "Thats_Dr_Anthrope_2U",
                    "body": "This is fact, that cutoff is always somehow right above where they are.  It's very convenient.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "boundpleasure",
            "body": "This should be posted to r/interestingasfuck. 😂",
            "score": 8,
            "replies": []
        },
        {
            "author": "KissMyRichard",
            "body": "It's almost like everyone wants things that don't require their time, work, sacrifice, etc. \n\nThat's why they hate Donald so much, because then you can put a face to hate on all the consequences of your own irresponsibility. That way you can preserve your fragile ego when you realize in the end there's not always going to be some government entity or otherwise who is going to baby you forever.\n\nYour big brother America isn't going to beat up the bullies in the school yard for you, forever.",
            "score": 18,
            "replies": []
        },
        {
            "author": "____IIIII___ll__I",
            "body": "Lazy Bum Union",
            "score": 18,
            "replies": []
        },
        {
            "author": "curlbaumann",
            "body": "This is a misleading interpretation, and I think we’d all answer the same way.\n\nUkraine isn’t getting enough western support to win the war, that’s a pretty reasonable take. Additionally, just because I think they’re not getting enough support doesn’t mean I want to pay for it or that they should automatically get it. Two things can be true here",
            "score": 133,
            "replies": [
                {
                    "author": "HKatzOnline",
                    "body": "Basically they are saying they want SOMEONE ELSE to pay for it.   Either they support and are putting their money where their mouth is, or they are not.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "Gunsofglory",
                    "body": "Ukraine could get all of the possible support up the point of a potential WW3 breakout, and it still would not be enough. They are quite simply going to run out of manpower far before that point.\n\nIf people want a repeat of 1945 Germany where everyone from ages 8 to 80 is picking up a gun, well, you can try but it's not going to be a winning strategy.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "Character-Bed-641",
                    "body": "These two questions individually aren't the full picture though, most of the countries listed here have not been spending sufficiently on defense for decades. Even after Russia invaded Ukraine they didn't really increase spending either. Their military aid has been honestly bad. \n\nThen you take that and combine it with this very loud yelling that we should be bankrolling Ukraine and it starts to look like the Euros don't feel obligated to actually pay for anything.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "r777m",
                    "body": "But the important part is that while most people want someone else to pay more, they don’t want to spend their own money on it. So it’s going to be politically unpopular for them to spend more of their own tax dollars.\n\nAnd the funny thing is, that is Trump’s biggest goal in this whole debacle. The left makes it out as the EU “owning” Trump by supporting Ukraine more instead. Yet, that’s a lot of what Trump actually wanted in the first place.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Sacsay_Salkhov",
                    "body": "No amount of western support would win the war without it escalating into WW3. If NATO countries send in troops, China and Iran would likely get involved and someone would be dumb enough to use a nuke. Billions of lives are at stake if the war isn't de-escalated.",
                    "score": 57,
                    "replies": []
                },
                {
                    "author": "HedonisticUser",
                    "body": "Buddy, what? I know what you are trying to say but it just doesn’t work like that. It’s an immediate implication that the WESTERN should be paying more, we already know Europeans don’t want to pay 😂",
                    "score": 63,
                    "replies": [
                        {
                            "author": "curlbaumann",
                            "body": "I mean I see it your way too, but the questions isn’t should they, it’s are they. I’d say no to both too, and I can’t stress enough how little I care about the Ukraine anymore.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OP_GothicSerpent",
                    "body": ">>Ukraine isn’t getting enough Western support to win the war, that’s a pretty reasonable take\n\nNot if one considers the sober military facts on the ground. The victory condition for Ukraine is kicking out Russians from all seized territories, including Crimea. Without thousands of boots on the ground, this is not going to happen. Ukraine does not have enough bodies to conquer and garrison those areas. Further, we should remember every frontline troop needs multiple soldiers behind the lines to resupply and guard the rear. So the manpower imbalance is even worse than the metrics indicate.\n\nA military rescue of Ukraine now would require a Normandy landing sized force of troops and logistics support. Naturally, any western state that does this would be committing an act of war against Russia and certainly trigger nuclear escalation.  I realize the left doesn’t want to acknowledge the truth, but it can be hidden about as well as the sun.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "EC_TWD",
                    "body": "These graphs are pretty clear:\n\nGraph #1:  Is Ukraine getting enough support to win?  A: NO\n\nGraph #2: Should we give them more support? A: NO",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Merax75",
            "body": "French and Germans have been actively working to reduce US influence in Europe since WW2 while expecting the US continue paying for everything.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Hobbyist5305",
            "body": "Sure is a lot easier to scream and cry and bully about having convictions than it is actually following through with them. Europeans deserve to be American territories.",
            "score": 69,
            "replies": [
                {
                    "author": "Ricoisnotmyuncle",
                    "body": "If we somehow have to keep funding this travesty of a continent, we should make it contingent on mass deportations",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "dezblues",
            "body": "The OTAN itself is the greatest deal the US has ever made. The american military industry has been selling every single system, plane, missile and tech to the Europeans reducing the capabilities of the European militaty industry. The americans are sending peanuts to Ukraine. There's no real money sent, only aid packages of millions of dollars of equipment that was about to be renewed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "supernormalnorm",
            "body": "They think Ukraine is not getting enough support, but they also don't want to pay to support Ukraine more \n\nTypical Stop Oil crowd",
            "score": 8,
            "replies": []
        },
        {
            "author": "thedivinemonkey298",
            "body": "Who the hell made this chart.  It’s absolutely terrible and hard to read.  It’s just so incredibly easy to misinterpret the data.",
            "score": 3,
            "replies": []
        },
        {
            "author": "readerjoe",
            "body": "How is wiping out billions of dollars in 401k savings any good for the American people?",
            "score": 14,
            "replies": []
        },
        {
            "author": "OP_GothicSerpent",
            "body": "What’s telling is in five countries surveyed,  more people want to decrease support instead of increase. Seems they’re not as scared of Moscow as the lamestream media claims.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Baptism-Of-Fire",
            "body": "Yeah I posted this yesterday.  lol",
            "score": 5,
            "replies": []
        },
        {
            "author": "whatsgoingonjeez",
            "body": "Damn, once again I see how little people in this sub actually know and understand european politics. \n\nSorry but most here are always so upset when some cherrypicked european liberal says something, but oh boy as soon as the opportunity is there to bash the EU or any european country with nearly zero knowledge of them, this sub is on fire. Pretty hypocritical.",
            "score": -119,
            "replies": [
                {
                    "author": "Lord_Sicarius",
                    "body": "Except Europe barely contributes to NATO at all, so Europeans wanting the West to pay more towards a war *in Europe* is pretty insane.",
                    "score": 117,
                    "replies": [
                        {
                            "author": "whatsgoingonjeez",
                            "body": "That’s not the point. Most european are disappointed what happened the last 10 years and nearly nobody, well except maybe for some crazy leftists that demanded demilitarization and russian asskissing for 20 years now, would argue that it’s not a good idea to increase the military budget. \n\nWhat I mean that in this sub, the european bashing in general has dramatically increased. You can absolutely criticize the points you mentioned, that’s a fair point, but the level of unnecessary bashing has become ridiculous. Under every post where europe is mentioned. It has become the equivalent of a crazy liberal purple haired woman doing some bashing against Trump.\n\nAnd then there is zero knowledge about what’s happening here. The points you mentioned are correct and obvious, it are fair points, but for the rest it’s mostly cherrypicking. \n\nImmigration is the perfect example, people love here to bash europe for it, say we are weak on immigration, eventough we have bigger border walls than you have. And the percentage of our populations of illegal immigrations is lower than in the US. People then argue and post a french banlieu, some brussel outskirt or francfort. That’s cherrypicking, I could too keep posting videos of LA and say that the US will collapse.\n\nAnd that’s the problem, the unnecessary bashing and sometimes even hate becomes a problem, because there is no reason for it.",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "MarcVipsaniAgrippa",
                                    "body": "Us \"Europeans\" started this whole thing by shitting on Americans at every given opportunity, despite not doing well ourselves.\n\nWe have no right to complain about anything right now.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "whatsgoingonjeez",
                                            "body": "Well then tell me who exactly shitted on you except some leftists who think they have the moral superiority?\n\nWhich country in general ever didn’t treat the US with much respect? \n\nWhich normal European every shitted on you?\n\nGo ahead and tell me. Give me one example that isn’t some leftist.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "MarcVipsaniAgrippa",
                                                    "body": "Well for one, Europe has had tariffs on American products for a long time, way before Trump entered politics, btw.\n\nAnd now that the U.S. reciprocates, it's suddenly unfair.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hobbyist5305",
                    "body": "Maybe you should pull your own weight if you want your opinion to matter as much as you think it should.",
                    "score": 136,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -33,
                            "replies": [
                                {
                                    "author": "RedditThrowaway-1984",
                                    "body": "You are free to send your own money to Ukraine.  You can also volunteer for their army.  Put your money where your mouth is.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "whatsgoingonjeez",
                                            "body": "As explained below I didn’t understand what the other redditor below meant with his comment.\n\nI support that europe alone should support ukraine and since my tax money was already sent there, I already sent money.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Hobbyist5305",
                                    "body": "It's not that I think the USA is the greatest nation on the earth, it's an objective fact.\n\nOur founding fathers took a look at europe, everything the europeans got wrong, everything that made regular people powerless serfs, everything that made it a shithole, and built a new system to avoid us becoming like you are. In the past 250 years the only advancement europeans have made in their culture is importing rapists and terrorists from the middle east and africa. In the past 250 years the advancements europeans have made to their politics are basically non-existant. To this day you have a subservient people that are largely disarmed, not allowed to defend themselves in their own homes, not allowed to speak out against injustices, not allowed to pray silently near an abortion center, and now not even allowed to pray in their own homes with the curtains open. It is an objective fact that europe is a shithole.\n\nEuropeans like to sit around comforted by the fact that America has the money and military to make all your problems go away. And now that daddy has said it is time for you to start paying your own way in life, like a spoiled teenager you lash out. Just like a petulant child. I told you to pull your own weight. Your response? \"Why should I?\" You ungrateful piece of trash, you should rightfully be either a russian oblast or a territory of the 3rd reich.\n\nYou are nothing without us. We don't need you. And we don't want your attitude.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "whatsgoingonjeez",
                                            "body": "What exactly do you mean? I am not sure what you meant with „pull your own weight“. I don’t understand english perfectly, but what I understood you meant is pull more weight into my arguments. And I meant why should I put more weight into my own arguments.\n\nYet you insulted my for no reason, that already says enough about you as a person.\n\nAnd you can write a bible, and repeat often enough that it’s an objective fact that your nation is the greatest on earth, you still won’t convince me that our nations are not the greatest on earth. And we can continue to write bibles why european culture is the greatest and what not, neither of us will be convinced.\n\nBut the difference between you and me is, I can stay civilized in a conversation and you obviously can’t, otherwise you would not had insulted me personally.\n\nAlso very funny to make such a statement, because you think that an individual european - me - insulted you or your country. Well that exactly proves my point.",
                                            "score": -13,
                                            "replies": [
                                                {
                                                    "author": "Hobbyist5305",
                                                    "body": "Pull your own weight means you need to use your own money and your own resources to support yourself through life without relying on the people around you, much less the people on a completely different continent. You are a burden. Europeans love not spending money on defense and expecting America to carry the weight of the expense and bloodshed.\n\n  \nYour \"Why should I\" was an absolutely terrible and childish response to someone telling you to pull your own weight.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "whatsgoingonjeez",
                                                            "body": "Yeah dude, I didn’t understand what you mean. And regarding my comment, it also didn’t make a lot of sense then, didn’t it? Why would I answer with „why should I“ and not „why should we“ then?\n\nI said it countless times, even in this thread that this is a legit criticism. And I have been criticizing this for years. Also, it’s not that every country spends less, some even spend more compared to their GDP. \n\nAnd again, I‘m sorry but you had no right to insult and call me a piece of trash. Reading my answer it should had been clear that I at least not fully understood what you mean.\n\nAnd even if I was an asshole, you had no right to insult other Europeans aswell.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Hobbyist5305",
                                                                    "body": "I understand English is not your language, that is why I explained the phrase to you. The rest of my post revolved around your accidental implication that europeans shouldn't be spending more money.\n\nSo I will concede that it was a bad translation, But I won't concede to not insulting other europeans. The problems I described and that are clearly laid out in the picture above are a prevalent way of thinking in europe, if it was not then you would not admit that you yourself are frustrated by the lack of military spending in europe.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "whatsgoingonjeez",
                                                                            "body": "No the problem is that primarily Germany, Spain and Italy neglected their military. Especially Germany, because leftists rose to power there.\n\nIt’s not a prelevant thinking in Europe because it completely depends on where you live in Europe. But since Germany is the by far biggest and most populous country, you will also meet a lot of germans online and think it’s a prelevant thinking.\n\nHow is it Frances fault, a country that kept their military spending high enough over the years, except during the economic crisis, which has built a military industrial complex completely independent from the US, with a nuclear program that is independent aswell, when germany decides to get soft?\n\nCharles de Gaulle even de facto pulled France out of NATO (and they only fully rejoined in 2009), because he wanted to make sure that France stays independent from any other nation. And you will say now, why don’t they put boots on the ground. \n\nWell because France‘s nuclear doctrine says that *any* attack will be answered with a nuclear strike, which is quite different to other countries. Macron announced only today that the nuclear shield will cover from now on all of europe.\n\nAnd you talk about childish, you can criticize Europeans for whatever you want, but insulting is just childish.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Hobbyist5305",
                                                                                    "body": "It is prevalent. All those % of GDP should be 2% MINIMUM. More like 5% now with billions owed to us in back pay for covering the difference, and the fact that Europeans have largely allowed their personal military expenditures fall off as well as their NATO obligations.\n\n[https://campus.sdh.gba.gov.ar/assets/img/infographics-nato-defence-expenditures-by-country-gallery-social.jpeg](https://campus.sdh.gba.gov.ar/assets/img/infographics-nato-defence-expenditures-by-country-gallery-social.jpeg)",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "whatsgoingonjeez",
                                                                                            "body": "Dude again, you can criticize this and say this, my point is not this. It’s about how you say it.\n\nYou can criticize it over and over again, I‘m fine with it, but you have absolutely no right to insult anyone over it.\n\nBack when the US called for article 5 not a single nation even tought a second about saying no. No other country every activated article 5.\n\nFurthermore, it seems that you and I both think thaf NATO should be dissolved and Europe should protect itself and every foreign base should be closed moving forward. That’s something that De Gaulle already demanded and I grew up believing it.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Hobbyist5305",
                                                                                                    "body": ">You can criticize it over and over again, I‘m fine with it, but you have absolutely no right to insult anyone over it.\n\nAgree to Disagree. I will continue shitting on europeans that don't pull their own weight.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "whatsgoingonjeez",
                                                                                                            "body": "I can live with that, I shit on those weak liberals too. \n\nWe have wasted enough energy discussing this on the internet, anyway have a nice rest of the week.",
                                                                                                            "score": 4,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Hobbyist5305",
                                                                                                                    "body": "Have a nice week.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fighter-of-Reindeer",
            "body": "Europe has put more aid into Ukraine than the USA has. The amount of misinformation in this sub is either ignorance or Russian misinformation, because I refuse to believe conservatives around me are this dumb.",
            "score": -148,
            "replies": [
                {
                    "author": "Jibrish",
                    "body": "Hear me out.\n\nThe war is *in* Europe.",
                    "score": 213,
                    "replies": []
                },
                {
                    "author": "I-am-not-gay-",
                    "body": "It's bout even",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}