{
    "title": "[B&A] Azelaic acid saved my skin from recurring breakouts/inflammation!",
    "author": "Aggressive-Seaweed24",
    "subreddit": "SkincareAddiction",
    "rank": 2,
    "score": 193,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/gallery/1je56bl",
    "id": "1je56bl",
    "selftext": "First 3 pics = November 2024\nLast 4 pics = March 2025\n\nLast year, I was constantly getting breakouts - especially around my nose (including under my glasses, even though I sanitized and cleaned them daily). I have an oily t-zone but products like salicylic acid, exfoliators, etc., for oily skin just dried it out/caused dry patches and didn’t help much with the pimples. \n\nNot sure what triggered the breakouts (didn’t change my diet or products or anything) so couldn’t figure out how to stop them. I used to only get hormonal breakouts but I had these pimples for at least 3 months straight with no respite. One would go, another would appear. \n\nI started using The Ordinary’s 10% Azelaic Acid suspension in October last year (2x a day) and my skin is so smooth and is way less inflamed/irritated! I get maybe one random pimple a month (definitely hormonal in that case) but it’s much less common. \n\nDefinitely still an underrated product, and I’ll sing its praises all day lol. \n\nCurrent routine:\n- Avene Gentle Foaming Cleanser \n- TO 10% Azelaic Acid\n- Clinique All About Eyes gel \n- Clinique Dramatically Different Moisturising Lotion\n- Beauty of Joseon SPF",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n\nAre you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guide [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and we might remove your post if it is).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "hebilly",
            "body": "Your skin looks beautiful!",
            "score": 30,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "Thank you!! It’s not perfect, but I definitely appreciate the current condition after last year’s skin struggles!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "nadademais",
            "body": "You look incredible!  I used azelaic acid 20%, but it made my skin worse, unfortunately. I’m wondering if I should try a lower concentration.",
            "score": 16,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "Thanks very much!! Might be worth trying a 10% and working up if necessary, but I did find that my skin purged more the first month or so after starting to use it, it didn’t start looking better until about December!",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "lobertrandis",
            "body": "I used TO AA for awhile, and while it definitely works (you're proof of that!), I just could \\_not\\_ get over the texture after it dries! I haven't had as much luck with other AAs, though, so it's looking like I'll have to come back to TO and get over the texture if I want to use AA in my routine 😂",
            "score": 8,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "It IS a bit silicony and pills a bit sometimes, I agree! I haven’t had too much issue with that though, I just put a nice amount of moisturiser and SPF on and makeup sits fine over it usually. I haven’t ventured into trying other AAs since I can forgive the texture, not worth risking another brand (especially since you can never tell how your skin will react either!) lol",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lobertrandis",
                            "body": "Honestly, I never dealt with pilling either (at least from that product) -- just that weird smoothing of your skin that you could only feel, not see. I actually just ordered the Inkey List's AA a few days ago, so if that fails me, I think I'm back to TO!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Camp_7",
            "body": "I don’t understand how people are using AA, it’s so incredibly itchy for me! \n\nSkin looks beautiful!",
            "score": 9,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "When I first started using AA, it was very stingy and itchy after applying it! Especially for the first 10-15 minutes and then it died down, apparently that’s quite common though, and my skin got used to it after a few weeks - BUT it could also be an adverse reaction if it didn’t eventually calm down a while after applying. Thank you btw!!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "rather_be_gaming",
                    "body": "It was like that for me too but I tried Regimen lab's AA and I didnt feel that much irritation. Still felt it a little but def not as much. I cant use AA twice a day yet but I use it every other day and hoping to build up to twice a day.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mucinexmonster",
            "body": "I've also found Azelaic Acid to really improve all kinds of my skin ailments. Whenever I start wondering what my skin needs I just remind myself to break out the Azelaic Acid (if I got out of the habit and was using other products).\n\nThe reality is I don't need to buy so many things, just use my Azelaic Acid regularly!",
            "score": 5,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "Absolutely, agree!! Whilst it obviously won’t work for every single person, it’s gentle, can help with breakouts, redness, texture, pigmentation, inflammation, etc etc. Such a versatile gem of a product!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "thebookthief007",
            "body": "Hi, could you please tell me how do you apply it? After cleansing, before moisturiser?",
            "score": 3,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "After cleansing and letting my skin fully dry, yes! I use a pea size amount, smooth it over evenly (I avoid my eye area and only apply it on my upper lip occasionally, otherwise it can dry it out a bit) and let it sink in for a minute before putting my eye cream and moisturiser on!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Relation5965",
            "body": "Your skin looks flawless! It was great seeing such dramatic results. Thank you for sharing, I’m going to try this for my rosacea.",
            "score": 3,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "Thanks!! It took about 6-8 weeks for my skin to fully clear up (apparently AA can cause a bit of purging too), but it did help with overall redness on and around my nose (which is maybe also Rosacea) and redness/flushing/texture on my lower cheeks from my Keratosis Pilaris too. Definitely worth a shot to see if it helps within a few months!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hefty-Television6687",
            "body": "Beautiful skin",
            "score": 2,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "Thank you!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reddishlikereddit",
            "body": "Which one do you use?",
            "score": 1,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "The Ordinary Azelaic Acid Suspension 10% ☺️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cuntymuthafucka",
            "body": "how do you use it in your routine? also, have you tried other formulations of azelaic acid before? im wondering if the one by the ordinary is right for me.",
            "score": 1,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "I use it after cleansing when my face is dry (sometimes I put eye cream on first lol) and then moisturiser once it’s on and rubbed in! I haven’t tried any other formulas no, I just stuck with this one daily and after 1-2 months my skin cleared up!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cuntymuthafucka",
                            "body": "did you notice any pilling with this product and your sunscreen",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aggressive-Seaweed24",
                                    "body": "Only if I don’t let the AA sink in fully first! If i have to apply my moisturiser and SPF quickly after it (when I’m in a rush, etc) it can pill a bit, but if I let it soak in for 5 mins and don’t apply too much, no issues usually haha",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nerdgeek123",
            "body": "are you in the US? where are you ordering BoJ SPF from?",
            "score": 1,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "I’m in the UK! I bulk buy a few at a time from Yesstyle usually",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ldorothy",
            "body": "Yup, azelaic acid saved mine too! A combo of tret, azelaic acid and spiro has made such a difference for me. And my dermatologist called me in prescription for the azelaic too, which I’m super happy with",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -3,
            "replies": [
                {
                    "author": "Aggressive-Seaweed24",
                    "body": "😭😭 thank you lol",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}