{
    "title": "Insert scold",
    "author": "Dachshunds_N_Dragons",
    "subreddit": "GenZ",
    "rank": 16,
    "score": 57,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/GenZ/comments/1je4rcy/insert_scold/",
    "id": "1je4rcy",
    "selftext": "You all suck because X. You need to do better because Y. You’re the worst generation ever at Z. Because of A, B, and C that your generation has done, not done enough of, or hasn’t done at all, the world is completely ruined. If you all were a little bit better at D and not so concerned with E, the world would be saved, but noooo, your selfishness couldn’t allow that. So now, I, the wisest savior of all Reddit, have to come into this sub, to save you from your own stupidity. Insert scold, insert other scold, scolding scoldiest scold scold. Style scold. Pedantic scold. Esoteric scold. Virtue scold. \nThere, I win the internet. I, in all my glory, have solved Gen Z. Upvote me for my dopamine hit, plebeian swine. \n\n/s ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Did you know we have a Discord server‽ You can join by clicking [here](https://discord.gg/NWE6JS5rh9)! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GenZ) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagnaFumigans",
            "body": "You forgot “Sure my generation was bad at (insane problem I’m underplaying) but”",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "Dammit I did forget that. 🤣",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NateLPonYT",
                    "body": "I mean, eventually Gen Z will get old enough and probably do the same thing lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MagnaFumigans",
                            "body": "And the kids of that day will roast them for it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NateLPonYT",
                                    "body": "Yep, it’s an endless cycle lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Agustusglooponloop",
                            "body": "I hear gen z complain about gen alpha all the time. Some gen alphas are toddlers so not sure how we are drawing conclusions on them already.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Hugo_El_Humano",
                                    "body": "damn toddlers today can't toddle like we toddled",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dachshunds_N_Dragons",
                                            "body": "This is my favorite comment so far.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "NateLPonYT",
                                            "body": "Take my upvote",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "International_Bend68",
                            "body": "lol yeah each generation goes through this!  The topics do change over time though. Not nearly as common nowadays to hear “because your wife works outside of the home”, “because you’re in an interracial relationship”, etc.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NateLPonYT",
                                    "body": "That’s true",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Tension6133",
            "body": "We did it guys, let’s close down the sub. Will be using this formula for all my gen z feedback needs from now on.",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "🤣🤣🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dbclass",
            "body": "I’m a man but I’ve never encountered any issues in my life at all so other men also haven’t experienced any issues due to them being men because my point of view speaks for everyone /s",
            "score": 1,
            "replies": [
                {
                    "author": "CetaWasTaken",
                    "body": "“True and all other men are whiners and need to suck it up. You’ve been gifted such an easy life compared to everyone else and any hardship you’ve encountered is 100% your fault and not do to systemic issues whatsoever and nobody owes you anything” repeat ad nauseam",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MemeLasagna7",
            "body": "What about the most oppressed group of all tho? I'm talking about Gamers of course\n\nRise up!",
            "score": 1,
            "replies": [
                {
                    "author": "TheCitizenXane",
                    "body": "https://preview.redd.it/p8tmwxt8cgpe1.jpeg?width=828&format=pjpg&auto=webp&s=bec640d59158421d081c490a3f0c45255234fa96",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MemeLasagna7",
                            "body": "https://preview.redd.it/3yiv2hnpcgpe1.jpeg?width=176&format=pjpg&auto=webp&s=9b5d740c704b96dd228194a04c9a77900c73b587",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EpicWolfandSparrow",
            "body": "[Opposing argument with links to two different news articles]",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "Angry rant that doesn’t have anything to do with your point.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Numa_Numa_Numa_Yay",
            "body": "It was always easier to find the problem than be the solution. And while gaining internet points from pointing out where others are wrong is something to do, it won't make anyone any better of a human. And if you don't have any pressing issues within yourself to work on, it's because the ego is deterring your sight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stolen_Away",
            "body": "As a millennial, welcome to the club. I think your generation is amazing 💚\n\nYou've used your voices and spoken your truth and resisted all this bullshit much better than my gen has. Proud of you",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "You’d think the cycle would stop. I’m not going to ever rag on Gen Alpha. Unless they eat something worse than Tide Pods. But only on that ONE thing.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stolen_Away",
                            "body": "Well that's probably inevitable lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bombastic_Bussy",
            "body": "A bunch of Gen X and Millennials brigade this sub.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zsal830",
            "body": "This is my last post.\n\nYes. I'm completely serious. You see, I'm not who you all think I am. Not at all. Currently, I'm a writer for Washington Post, living in a small studio apartment, always looking for the next big story, barely scraping by sometimes. I was asked several months ago by my editor to do a piece on the so-called “GenZ” community on Reddit that seems to become more and more popular by the day.\n\nInitially, I was intrigued. The humor was bizarre, yet interesting. Nonsensical, yet genius. I spent several months interacting with people I had never met before in my life, learning the culture, what was \"cool\" and what wasn't. Eventually, I began to make my own posts, testing the waters now and then. And eventually my own posts started getting noticed, and maybe for a minute or two I understood why you all do this. But that didn't last long. And with time, I began to notice how stale the content truly was. How the same 'memes' could be spammed over and over again, and still get massive amounts of attention.\n\nAnd I also began to notice something else. The viciousness with which you attacked each other. The semi-constant bullying and harassment. Each day, it made me even more sickened than before, to the point where you people made me start questioning everything about reality and what I knew about it.\n\nI couldn't eat. I couldn't sleep. I was drinking 2 bottles of milk every night. But, finally, my mission is complete.\n\nTomorrow, we will be publishing a comprehensive guide on this group, potentially exposing some of your members' most well kept secrets. I'm deactivating this account at midnight, but before I do, I just want to let you know you all make me sick.",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "The Post must really be struggling if they think this is a news story worth reporting. Breaking: Anonymous people on the internet are assholes to each other!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "zsal830",
                            "body": "this is also a copypasta",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Dachshunds_N_Dragons",
                                    "body": "Mmmm pasta 🍝",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ragingdivinedragon",
            "body": "Bootstraps or whatever the saying is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prinssi_Nakki",
            "body": "OP i nominate you as the supreme leader of the world 😂",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "I, as a gracious humble bragger that has more intelligence than anyone else, and who’s farts smell good, accepted your offer. /s 🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UnexceptionableHobby",
            "body": "Hey everyone - keep up the good work. Stuff sucks and you are getting the worst of it. Wish we could help more, but most of us don’t know how with all the crap we are also going through.\n\n- an average millennial.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cadwalider",
            "body": "The oldest genz is 28, you'll get all the blame you can handle when you get older.",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "I thought it was 30 now? I can’t keep track.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OzzyFinnegan",
            "body": "It’s like that for each generation. I heard all this from my grandparents as well. I’m a millennial. I hope as the earth ages we can get rid of this concept. I am hopeful for Gen Z. And I’m sorry our generations have lead to the shitshow we’re in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EightyDaze_",
            "body": "\\[Snarky reaction gif\\]",
            "score": 1,
            "replies": [
                {
                    "author": "Dachshunds_N_Dragons",
                    "body": "Surprised Pikachu face",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDuellist100",
            "body": "I won't feel shame when the world blames me for it's downfall even though I'm literally the most chill person in existence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "temperofyourflamingo",
            "body": "Lock in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tr0nvicious",
            "body": "https://preview.redd.it/p49citkmjipe1.jpeg?width=538&format=pjpg&auto=webp&s=c56c75ab22ecb97dc09aae8ff7b4e84008bed8f7",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agrippa_Evocati",
            "body": "Genz if fine by me simply by not ever being as bad as millennials",
            "score": 1,
            "replies": []
        }
    ]
}