{
    "title": "Anyone else feeling nostalgic over 2015-2016?",
    "author": "Even_Description2568",
    "subreddit": "GenZ",
    "rank": 6,
    "score": 244,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 134,
    "url": "https://www.reddit.com/gallery/1jea5aa",
    "id": "1jea5aa",
    "selftext": "Idk why but the past week i’ve just been thinking about this era, i’ve been listening to songs and shit from 2016 for the nostalgia. Is anyone else feeling this???",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Did you know we have a Discord server‽ You can join by clicking [here](https://discord.gg/NWE6JS5rh9)! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GenZ) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "moonlitjasper",
            "body": "a lot of these are giving 2014 too",
            "score": 1,
            "replies": []
        },
        {
            "author": "5567sx",
            "body": "Harambe’s death is when the timeline split happened",
            "score": 1,
            "replies": [
                {
                    "author": "SaraisaFemboyToo",
                    "body": "Her 10th death anniversary is next May. Maybe we could visit her death site, reconstruct her, recreate the events (with the og kid ofc), sing kumbaya, and restore the timeline. 🤯",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Initial_Wrap_3914",
                            "body": "Harambee was a male",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Even_Description2568",
                            "body": "Since when was Harambee a woman?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SaraisaFemboyToo",
                                    "body": "Just looked it up and she is actually a he... I could've sworn he was a female but I was wrong ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "obungaofficial",
                    "body": "ur actually so right wtf",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "plutonium-rain",
                    "body": "Ohh I remember this. You're right!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkSea3002",
            "body": "Wasn't ice bucket challenge more of 2014 thing?",
            "score": 1,
            "replies": [
                {
                    "author": "Royal-Rayol",
                    "body": "AOL ice bucket challenge was like 2012",
                    "score": 1,
                    "replies": [
                        {
                            "author": "man_lizard",
                            "body": "The AOL ice bucket challenge. Dumping ice on our heads to save dial-up internet.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WokeWook69420",
                    "body": "Half of this is from my high-school days as a Millennial lmao, like pre-2010.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Even_Description2568",
                    "body": "Yeah I just noticed.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Forzaman93",
                    "body": "Also same with the phone screenshot and the iPhone the screenshot is of skeumorphic era around 2012 and the iPhone was an iPhone 4 from 2010",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaveTheRaveyah",
            "body": "I don’t think it’s the era I miss, I think I miss being younger. \n\nIt’s be nice if the world wasn’t also on fire right now but",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Mix of both I’d say.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ManBirdTurtle2",
                    "body": "I’m reminscing on 2024",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WhiteAsTheNut",
                    "body": "Yea everyone who was actually semi grown in 2016 hated it. It’s become our dorky 90s kid nostalgia that buzzfeed did for millennials. To be honest 2016 was a low point of my life I kind of hated I don’t understand the glaze. I also think a lot of it is younger gen z/gen alpha making it seem so much better and wishing they were a teenager at the time. News flash being a teenager has always sucked…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reasonable-Mix-6782",
            "body": "I can feel the 6th image",
            "score": 1,
            "replies": [
                {
                    "author": "jankyspankybank",
                    "body": "Those were really popular when I was in elementary. I didn’t think they would make a come back when I was in high school. And I can smell the picture just looking at it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OwOPango",
                            "body": "When I was in elementary school, they were called silly bandz and they would come in the shape of a dog or a butterfly or something and kids would trade them until the school banned them",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "leeryplot",
                                    "body": "Those aren’t made with silly bandz though, I don’t think. I made lots of these with just really small, round rubber bands. They came in kits with a little loom and bags of different colored bands. Unfortunately you couldn’t really twist silly bandz into patterns like this because of their shapes haha. You’d get really weird bunched corners (I’ve tried lol)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AutumnGway",
                                    "body": "Maan I remember this! And there were super rare/special shapes and eventually they even had little ring versions!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jankyspankybank",
                                    "body": "That’s exactly what happened at my school too!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Reasonable-Mix-6782",
                            "body": "those were the days, it had the best of everything, all aspects of life, video games, socializing, trends (not brainrot), authentic music, there were no chronically online people, compliments were wholesome, none of the \"Rizz\" nonsense. Humanity at its peak. the world itself seemed so calm and carefree",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jankyspankybank",
                                    "body": "We were kids then, we didn’t know the world like we do now.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leeryplot",
                    "body": "It honestly hurt when you had that many on because they’d start pinching your arm hairs haha",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Reasonable-Mix-6782",
                            "body": "and that satisfying feeling when you roll it up and down your arm",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "leeryplot",
                                    "body": "Yes, it was like a low-grade “indian burn.” But it felt nice lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tackling_problems",
                                    "body": "Omg yes,felt so nice",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Even_Description2568",
                    "body": "I remember our class making an entire 20 foot long loom band jump rope. Good old days.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Reasonable-Mix-6782",
                            "body": "we made one out of nearly 150 rubber bands, sneaking it here and there from the teacher's desk whenever possible, she didn't mind. one of us would have the responsibility of making it \"grow\" over the weekend by taking it home.  \nonce it got long enough we'd take it to a park on a Saturday morning and make this \"Laser\" obstacle course, pretending to be spies. We used to stretch it to such an extent there was always a fear of it snapping, but it was fun.  \none day it snapped, hurt like hell, seemed like the day that tore, our childhood ended for me and my friends.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Even_Description2568",
                                    "body": "Gosh, must’ve been a fun time. Would do anything to do something like that with my class again.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RandomBaguetteGamer",
            "body": "I was in college back then so yes. I miss going out to grab a beer with fellow students, playing video games while ignoring finals, and the worst thing happening in the world for me being the biochemistry lessons (the professor responsible was horrible).\n\nNow my pals are 200km+ away, I can't play as much because I have to get up for work in the morning, and the worst thing happening in the world is old people trying to start WW3 to ensure they're remembered as their names will be written in History with my generation and younger ones' blood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zombies4EvaDude",
            "body": "2010s were a better time…",
            "score": 1,
            "replies": [
                {
                    "author": "Zill_Chill",
                    "body": "I was just a kid tryna live life in my small town 😔",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "leeryplot",
                    "body": "The 2010s were wild fun until 2015 when my mom died. And then Trump ran and won office in 2016 and my entire family became politically polarized, plenty of people haven’t spoken over the last decade and things have felt extremely different and wrong ever since.\n\nSo, honestly, I’d say only half the 2010s were good. But that could just be me lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shesangel",
            "body": "2016 was the last time I felt truly alive",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Same, would do anything to go back",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emotional-Rich-341",
            "body": "Time flew by",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Bandicoot-9920",
            "body": "When smiles weren't forced and people were actually happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sir_Arsen",
            "body": "we’re just getting old, missing the days of childish ignorance",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdvancedYoYo",
            "body": "I can feel this for sure! 👍",
            "score": 1,
            "replies": []
        },
        {
            "author": "AppealLow6962",
            "body": "yessssssssssssss you forgot slime",
            "score": 1,
            "replies": []
        },
        {
            "author": "devil652_",
            "body": "![gif](giphy|q49YSnLzrvghiyKBAR|downsized)",
            "score": 1,
            "replies": [
                {
                    "author": "WeWereAllOnceAnAtom",
                    "body": "Definitely not me either. Few years before that, maybe. Ten years before that too. But this era put the downward spiral of the world into over drive, honestly.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlackTech00",
            "body": "This was before 2015-2016",
            "score": 1,
            "replies": [
                {
                    "author": "leeryplot",
                    "body": "It feels very 2012-2014 to me (minus the fidget spinners, which were definitely later)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeWereAllOnceAnAtom",
            "body": "Dude the guy who introduced fidget spinners and fidget devices to me was a real dickhead in hindsight so they’ll always have this bad taste for me.\n\nDude was introducing them like he was on to something 😂 when it was already a bubbling trend. \n\nWent on to never speak to me again after I referred him to a life changing job too. Fuck that guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ViC_tOr42",
            "body": "No, 2016-2017 were the worst years of my life",
            "score": 1,
            "replies": [
                {
                    "author": "Dazzling_Face_6515",
                    "body": "Nice pfp 👌🏻",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ViC_tOr42",
                            "body": "Spiral out 🌀",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Even_Description2568",
                    "body": "What about 2015-2016? 😄",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrincessGamer2012",
            "body": "The sixth image reminds me of 2014 so much. I remember rainbow looms being the craze and when I was really helpful to my mom when she was shopping somewhere one day, she bought me my first pack as a reward. Then the following year my parents bought me a large box of them which I haven't even used up all of to this day 😅\n\nI feel more nostalgic for 2014-15. Weird cause I was 5-6 back then but I do remember quite a lot and since I moved away in mid 2015, that was the main turning point of my life. That's pretty much where most of my nostalgia stops. Though 2020 and before were much simpler times to me. Probably because I was still a small child back then.",
            "score": 1,
            "replies": []
        },
        {
            "author": "XTraumaX",
            "body": "I’m 31 years old and this popped up on my Reddit feed and seeing people feeling nostalgic over stuff that happened after I was out of high school is really making me feel old lmfao",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Nahhh trust me even my older siblings who were in college during this time feel nostalgic over this era. Was a fun time, we all enjoyed it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BTM_6502",
            "body": "The image of the Loom Bands hit so hard. I swear I can smell that image!",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "I can just feel it!!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jprod97",
            "body": "Very much so. My HS senior year. Main thing I miss was the EDM from that time period. EDM doesn't feel that popular or good anymore. Used to feel like absolute bangers were coming out every other week.\n\nCalvin Harris, Galantis, DJ Snake, Zedd, Diplo, etc. The music really contributed to the awesome vibes from that time. It all seemed positive, hopeful. Wtf happened?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Least_Money_8202",
            "body": "We remember 2016 really fucking differently based off these photos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Entire-Adhesiveness2",
            "body": "Heard let me love you on the radio the other day and went “wow every song used to have a beat drop that sounded exactly like this”",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "I miss that so much 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "alfalferton",
            "body": "Hot dogs or legs",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Blue and black or white and gold?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ear_Enthusiast",
            "body": "My oldest son came to live with me when all of these things were popular. He was 11 years old. His drug addict mom was too fucked up to take care of him. This post brings all that shit rushing back to me. Fidget spinners and those bracelets were all over my house. We did the ice bucket challenge a couple of times, even though I think that was earlier. Man this smacks. \n\nHe took a very negative turn when he hit high school. He walked out on us a few years ago to go back to his mom's and he hasn't spoken to me since. I have a lot of negative feelings towards him and how he treated us before he left and the then way he left. Seeing spinners and bracelets takes me back to before things went sour. He was a good kid and I loved doing these things with him, before his mother and her trashy family sucked him back in. I haven't thought about them in years and it brings a lot of old feelings rushing back.",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Poor kid must’ve had his innocence stolen from him. I’m sure you did an AMAZING job taking care of him, much better than his other family.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Chocolate-3396",
            "body": "This makes my heart happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Halflife37",
            "body": "The 2010’s , trumps presidency not withstanding, were good times. I was in my 20’s and many of yall were in your teens. Best section of your life until you realize who you really are and then the real fun begins…if you can figure that out ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Equivalent-Fan-1362",
            "body": "Idk I guess life was simple I just hooped and smoked joints with my buddies now I just do the same thing but with more pain and work on top of it😭",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "I’m glad nothing changed haha 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Surround_Successful",
            "body": "Where can I find more of this nostalgia",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "My entire tiktok feed is just 2015-16 core. I’ve been liking and reposting all of em and now it’s all i see.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Antaeus_Drakos",
            "body": "2015 WAS A DECADE AGO??? Darn, I miss being young and not being so informed on how horrible the world is.",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "SAME omg. I miss how innocent and clueless i was.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Antaeus_Drakos",
                            "body": "Now I have to worry about fascism, the ever growing threat of hyper capitalism, the seemingly never dying racism, there's also the inequalities of all the minorities, and etc.\n\nCan't I just go back to watching Stampy playing an adventure map or watching PopularMMOs' Epic Proportions series? Also, there's the go to school then come back and just play.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Even_Description2568",
                                    "body": "Gosh, so much issues. I still sometimes tune out every single issue in this world so i can sit down and watch some old popularMMOS videos. I would give absolutely everything to go back in time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Antaeus_Drakos",
                                            "body": "Putting on a playlist of Stampy playing adventure maps or his Quest series will always be comfort that others might not understand. Even as recent as the Time Traveler’s series with Squid and AshDubh is comfort. The year I graduated high school really just had to be the year the world went on this abused timeline.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Even_Description2568",
                                                    "body": "I don’t like to think of them as the past because I still watch their old videos every now and then for the nostalgia, nothing will beat their original content that never failed to brighten our days as youth. Going to watch a Stampy vid after dinner, may shed a few tears.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Antaeus_Drakos",
                                                            "body": "I will always remember them as the past, especially when a new kid watches Minecraft and doesn’t mention any of the OG. \n\nTime moves forward, and we’re forced to finally face all the hardship that has been dumped onto us.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Even_Description2568",
                                                                    "body": "True, we’ve unfortunately been replaced. Their time will come and soon they’ll see dream and whoever as nostalgic.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vancouverrrrr",
            "body": "2014-2016 were my true coming of age years. They were also the toughest years of my life. I do have some nostalgia for the period of time but I agree with others in that it's more a nostalgia of being young. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Familiar-Shopping973",
            "body": "I miss 2020 except for the COVID part",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSeriousFuture",
            "body": "This was also when Cartoon Network was at its peak!",
            "score": 1,
            "replies": [
                {
                    "author": "FunFry11",
                    "body": "Lmao no Cartoon Network peaked in like ‘04-‘06",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheSeriousFuture",
                            "body": "\nWanna just say both were good?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FunFry11",
                                    "body": "I was 14 in 2015 I wasn’t on Cartoon Network anymore. Courage the cowardly dog supremacy",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheSeriousFuture",
                                            "body": "I watched courage as well. It was still airing around that time I'm sure",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FunFry11",
                                    "body": "I was 14 in 2015 I wasn’t on Cartoon Network anymore. Courage the cowardly dog supremacy",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "leeryplot",
                            "body": "I was about to say the exact same thing haha. Necessary correction",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wrinklefreebondbag",
            "body": "Maybe a little? That was my first year of university, which was new and exciting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capistrano9",
            "body": "Currents and A Moon Shaped Pool came out those years. My favorite bands coming out with their best albums right as I got a medical marijuana card and started driving. \n\nHigh school rocked",
            "score": 1,
            "replies": [
                {
                    "author": "leeryplot",
                    "body": "High school was fun until COVID mucked that up. I had the weirdest, non-ceremonious graduation. And I was in such a rural area that not enough kids had WiFi, so we just didn’t have school during lockdowns. We had a 9 month summer break. I had to take the SATs without prep in a very strange liminal space of a room. Then I was graduated, and the whole thing didn’t feel real lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZucchiniNo1892",
            "body": "nope!",
            "score": 1,
            "replies": []
        },
        {
            "author": "stylebros",
            "body": "Found my old spinner. That shit is still fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "THEpeterafro",
            "body": "2016 had the holy trio of memes (The Nutshack, Harambe, We Are Number One) and was the last good year for me. Do not remember much of 2015 because it was solid",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dazzling_Face_6515",
            "body": "All the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "ctlMatr1x",
            "body": "The pre-trump era.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rathosalpha",
            "body": "Dam that was a decade ago? But no",
            "score": 1,
            "replies": []
        },
        {
            "author": "Varsity_Reviews",
            "body": "Ah, 2015. Call of Duty Black OPS 3 released, Rainbow Six Siege was coming out, I was in middle school and everyone was hyped for Star Wars The Force Awakens.  Ahhh. And who could forget the summer of 2016 when I was about to be a freshman in high school.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whozesty",
            "body": "that was time to be alive",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royal-Rayol",
            "body": "AOL ice bucket challenge was about 2012-2013",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "I think it was 2014-2015 wasn’t it?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheIncredibleBean",
            "body": "https://preview.redd.it/gsot3c5tlhpe1.jpeg?width=300&format=pjpg&auto=webp&s=b454a3106c1883f8e3fce6d4e42f84e7e74e7fd4",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheIncredibleBean",
            "body": "https://preview.redd.it/je8zdfrulhpe1.jpeg?width=300&format=pjpg&auto=webp&s=182940753db5af6ef1a05d77f64f94eccffa3776\n\nLOOM BANDZ MAAATE",
            "score": 1,
            "replies": []
        },
        {
            "author": "thomasrat1",
            "body": "Not at all lol. My life was hell 2008-2020",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "dang a whole 12 years?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thomasrat1",
                            "body": "I mean, 2006-2020 is more realistic haha.\n\nBut yeah it was a very very rough time.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Even_Description2568",
                                    "body": "I hope your doing better now",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thomasrat1",
                                            "body": "Thanks man! I am, got a lot of therapy, lot of fights out of the way. My later 20s are so much better than anything before.\n\nThings get better, albeit slowly",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Even_Description2568",
                                                    "body": "Great to hear!! Glad everything has worked out for you.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "u56703422",
            "body": "I miss instagram",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Same bro now it’s so boring",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rates_empathy",
            "body": "You missed Pokémon go. \n\nThe summer of 2016 was the last time happiness existed 😆",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Holy crap, I haven’t thought about that in years. You just brought back so many memories.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Audible_Whispering",
            "body": "Nope. Not a bit. Can't think of even one thing from then that I miss. \n\nIDK, I'm sure good things happened then. But more than any other random two year period? Not really. If you're nostalgic for a specific point in time instead of points in your life you're doing it wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crackpipewizard666",
            "body": "I uhh i dont think ive actually enjoyed life in a very very long time now that im thinking about it.\n\nI look back on those years with nostalgia but there was also some really fucked up stuff going on that i would like to never re-visit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea_Working5429",
            "body": "Not really… For me it was just being a mostly friendless 13-14 yo with bad grades… I’m not saying it was all terrible, but missing it is definitely a stretch",
            "score": 1,
            "replies": []
        },
        {
            "author": "xander012",
            "body": "Not really",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectionSalty6097",
            "body": "When are we not",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hey-__-Zeus",
            "body": "Absolutely not. My childhood was a real childhood in the 90s. Sad for you guys though.",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "Ours was the 2010-2020 era. Not sad for us, just different upbringings.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mean-Seaworthiness50",
            "body": "All you did back than was using your phone?",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "A lot of our memories were from youtube videos and musically but we also spent a good amount of time outside. Perfect mix, no such thing as doomscrolling back then.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "g_wall_7475",
            "body": "Yes, simpler time. Markiplier was an important part of my 2015-2016. Anyone else?",
            "score": 1,
            "replies": [
                {
                    "author": "Even_Description2568",
                    "body": "My siblings were big on markiplier, not me tho.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "This_Pie5301",
            "body": "My nostalgia takes me back to 2005-2015, everything after that still feels pretty recent but give it another 5 or so years and I’ll be nostalgic for that. I was in high school by 2015 so my “childhood” was earlier than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Finlaycarter2002",
            "body": "Nah this was a grey zone for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpollack21",
            "body": "I do and don't. I'm a huuuuuge music nerd particularly with hip hop so 2016 was around the death of great hip hop which sucked but we got Denzel Curry and JID so it's not all bad I guess lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ashtonlovesyou",
            "body": "nah bro just you",
            "score": 1,
            "replies": []
        },
        {
            "author": "TopBoysenberry5095",
            "body": "No",
            "score": 1,
            "replies": []
        }
    ]
}