{
    "title": "\"Congrats mortal, you're being promoted to battle servitor\"",
    "author": "Sigward_TheOnionbro",
    "subreddit": "Grimdank",
    "rank": 6,
    "score": 2419,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 27,
    "url": "https://v.redd.it/qjqxeilh8gpe1",
    "id": "1je4se4",
    "selftext": "",
    "comments": [
        {
            "author": "EhrenGandalf",
            "body": "https://preview.redd.it/omuzw9wmigpe1.jpeg?width=1200&format=pjpg&auto=webp&s=fa688c4b8b94a918016335920746b6f51c05370d",
            "score": 265,
            "replies": []
        },
        {
            "author": "TheSouthernSaint71",
            "body": "Flesh can't be weak if there's no flesh 🤷‍♂️.",
            "score": 134,
            "replies": [
                {
                    "author": "Satanicjamnik",
                    "body": "![gif](giphy|gFwZfXIqD0eNW)",
                    "score": 34,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ododazz",
            "body": "Best scene from robocop 2",
            "score": 72,
            "replies": [
                {
                    "author": "Robrogineer",
                    "body": "That movie was so damn solid until the last 3rd of it, which entirely consists of a continuous fight with like 3 or 4 fake-outs, and the company abruptly looks like nazis.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "Random-Lich",
                            "body": "Most movies nowadays I’ve seen seem like that. \n\nEasy writing for the last half being fake-outs, saying ‘good guys were bad’ or vice versa with no lead up and stockstandard villain motives",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Olddirtychurro",
                    "body": "Why did I see this shit as a child?! My parents switched channels when a sex scene came on during flicks but they let us see this pure body horror and were like \"Aight, off to bed now and try not to scream in your dreams when this comes back to haunt you.\"\n\nAnd toy companies had the *nerve* to make toys out of this shit.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "hellatzian",
                            "body": "because when a kid watch porn they can get addicted to it.\n\nso kids must not allowed to watch porn",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Random-Lich",
                    "body": "THATS where it’s from.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TROLLMASK2222",
            "body": "¿Canon?",
            "score": 64,
            "replies": [
                {
                    "author": "Sigward_TheOnionbro",
                    "body": "Unfortunaly yes, Iron Hands became basically Adeptus Mechanicus marines after Ferrus death",
                    "score": 150,
                    "replies": [
                        {
                            "author": "hunterarcer",
                            "body": "Mechanicus and iron hands are actually quite different tho. Mechanicus augment themself to get closer to the omnisiah, for them its a holy union of humanity and the greatness of the machine.\n\nThe iron hands augment themself and other out of insecurity. Its been stated that many of the iron hands augments aren't actually upgrades to their capabilities. Since even the greatest of cybernetics can't beat just how perfect space marines are. So if anything their desire to augment themselves is almost more akin to self harm than anything else",
                            "score": 93,
                            "replies": [
                                {
                                    "author": "Sicuho",
                                    "body": "True, but they also became the AdMech's marines simply because the AdMech is a bunch of greedy control freak who will, when given an inch, take away your ability to make decisions.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "KPraxius",
                                            "body": "This is one of the many reasons why they'll be put up against the wall if the Emperor ever actually wins.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Pristine_Title6537",
                                                    "body": "My money would be on the Admech to be honest they have gained so much power within the imperium that dare I say not even the emperor could win against them if he tried too",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FrucklesWithKnuckles",
                                    "body": "Stated sure in a single book by one Magos. Every time it’s shown however that the Iron Hands augments ARE upgrades.\n\nExample: Rauth being impaled through the chest by Julius Kaesoron, a blow stated to kill any normal marine, and walking it off.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ridingwood333",
                            "body": "https://preview.redd.it/8juovd770ipe1.png?width=960&format=png&auto=webp&s=c758bd8c58443dbb37c3d851ce7b5a549765902a",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Current_Employer_308",
            "body": "Saved? Nah, recycled!",
            "score": 12,
            "replies": []
        },
        {
            "author": "Angryagathe",
            "body": "Adeptus Mechanicus will do this to you even if you're healthy. Bless the machine.",
            "score": 11,
            "replies": [
                {
                    "author": "UH1Phil",
                    "body": "Praised be the Omnissiah.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zockerisin",
            "body": "You know your fucked when the Admech say your weird for turning them into servitors",
            "score": 9,
            "replies": []
        },
        {
            "author": "Castellan-Albrecht",
            "body": "\"Congratulations guardsman, you have qualified for a promotion, you may serve our chapter as a combat servitor!\" -The iron hands probably",
            "score": 7,
            "replies": [
                {
                    "author": "TemperatureSweet2001",
                    "body": "They wouldnt congratulate you. They would be more like:\n\n\"You are a servitor now, deal with it. Now go shoot that thing over there and most likely die...again\"",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mitigated_Miracle",
            "body": "I believe in the Iron Hands cultural revival. 🦾",
            "score": 3,
            "replies": []
        },
        {
            "author": "Curvy_Bon",
            "body": "01010100 01101000 01100101 00100000 01100110 01101100 01100101 01110011 01101000 00100000 01101001 01110011 00100000 01110111 01100101 01100001 01101011",
            "score": 3,
            "replies": []
        },
        {
            "author": "baneblade_boi",
            "body": "This is how the 1st-ed Chaos Androids would look like nowadays.\n\nPlus, I want that and by extension Chaos Squats to be canon. The Chaos Dwarves are so cool it's criminal they're gone from all settings.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sampleswift",
            "body": "That assumes the Iron Hands would bother to rescue the guardsman.",
            "score": 2,
            "replies": []
        }
    ]
}