{
    "title": "TWD Retribution",
    "author": "LeeH1998",
    "subreddit": "OculusQuest",
    "rank": 13,
    "score": 8,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 12,
    "url": "https://i.redd.it/9r9rohgnigpe1.jpeg",
    "id": "1je60mh",
    "selftext": "Noticed this has gone down in price alot, is it worth it and did it recieve a quest 3 upgrade? TIA",
    "comments": [
        {
            "author": "-OrLoK-",
            "body": "I'm currently playing the first game. does it impr9ve as one plays or is the game loop consistent?\n\nI mean, it's ok but its no Into the Radius.",
            "score": 4,
            "replies": [
                {
                    "author": "Moses015",
                    "body": "I mean you've got to remember Saints and Sinners came out LONG before Into the Radius. Without Saints and Sinners there probably wouldn't be Into the Radius as it borrows a lot from Saints and Sinners.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "-OrLoK-",
                            "body": "oh, im not blind to its heritage etc, I think I was expecting a little more.  That said I'm still \"early game\" it might pick up!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeeH1998",
                    "body": "To be honest I haven't finished the first, mainly because of how unforgiving the game is but I'll probably give it another chance at some point",
                    "score": 1,
                    "replies": [
                        {
                            "author": "-OrLoK-",
                            "body": "thanks! I'm going through it as i bought the other for cheap and thought i may as well do the first :)\n\nI'm not uber impressed with it but also not hating it, however I'm hoping for a pace change or a bit deeper feel.\n\nworth a go imho.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PorkPiez",
            "body": "For that price it's a really good buy, lots of hours of content. Did you play the first game?\n\nUnsure of a Quest 3 upgrade.",
            "score": 3,
            "replies": [
                {
                    "author": "ell_toon96",
                    "body": "How would you compare it to the first one? I enjoyed my time with that one. But heard mixed feelings about this sequel.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PorkPiez",
                            "body": "Retribution mostly builds off the systems of the first game and improves upon them, *however* there is more noticeable jank in this one. \n\nI think if you enjoyed the first game, there really isn't any huge things that would prevent you from enjoying this too. There's cool new weapons, the threat feels bigger and the hordes feel harder. You even have to go out and do missions at night in this one, plus you have a villain hunting you throughout the story which increases the intensity. \n\nFor such a low price it's really a no-brainer game, and will make any jank feel like less of a big deal.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Business_Worry_3107",
                            "body": "its broken, unfinished abandonware. Beware of your two hour refund limit. Just sayin",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeeH1998",
                    "body": "I have the first but haven't finished it yet",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "White_Bar",
            "body": "i don’t believe it has received a quest 3 update, retribution was left to fester in its bugs while skydance worked on behemoth.\n\ni really do hope they come back to retribution because i’m sure it’s an awesome game beneath all of the bugs and crashes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rocket42236",
            "body": "Anyone mod this?",
            "score": 1,
            "replies": []
        }
    ]
}