{
    "title": "Key to a happy life",
    "author": "akin975",
    "subreddit": "wholesomememes",
    "rank": 274,
    "score": 1572,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 39,
    "url": "https://i.redd.it/fxzo21i8nsjd1.jpeg",
    "id": "1ewru7h",
    "selftext": "",
    "comments": [
        {
            "author": "mraltuser",
            "body": "But successful people always try to do better and better because they know when someone else can do it, it is possible for everyone to do so once they paid hard work, example Julius Caesar admired Alexander alot that he thought if Alexander can conquer the world in such a young age, he can also do it because he was older than him",
            "score": 11,
            "replies": [
                {
                    "author": "Funny-Performance845",
                    "body": "Your best can change with time",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 8,
            "replies": [
                {
                    "author": "Deg220",
                    "body": "it truly does. You begin to understand that as long as you are doing as much as you can do, there is no point about worrying about the outcome. It is what it is. If you can't do something, it can't be done by you - so it's not your fault. The hard part is figuring out what you truly can and cannot do. Your limits, in other words.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Nyte_Knyght33",
                            "body": "The Serenity prayer is a great reminder.\n\n\n \"God grant me the serenity\nto accept the things I cannot change;\ncourage to change the things I can;\nand wisdom to know the difference.\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flimsy-Ad364",
            "body": "My mum use to say this to me, it was the best advice ever given. \n\nI’ve watched friends go in and out of careers thinking they will be happy with their big wages and weekends off. The result of it all is being burnt out, depressed and unhealthy. I feel for them. They chase after things like designer clothes and big fancy holidays; spend thousands and it still get them such a short amount of happiness. \n\nI’m thankful I’m happy with what I’ve got, it’s not much but as long as I can feed myself and relax, I’m happy.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Made_Me_Paint_211385",
            "body": "They say comparison is the thief of joy. I find that an envious statement. It would imply we're lesser if we cannot overcome arbitrary challenges we value. What's greatness if it doesn't bring joy?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Kryonic_rus",
            "body": "Also - understand that nothing and no one is perfect. Sometimes being good enough is already an accomplishment",
            "score": 3,
            "replies": []
        },
        {
            "author": "Junior_Recording7536",
            "body": "Loser mentality",
            "score": 4,
            "replies": [
                {
                    "author": "akin975",
                    "body": "Perspective bro. Stress yourself and work harder and live 50 years or Relax and live 90 years enjoying those retirement benefits.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Junior_Recording7536",
                            "body": "How bout work hard for 15 years and live extra chill life for the next 40?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "akin975",
                                    "body": "Doing your best doesn't mean not working at all. Everything has limits. People ignore their health while working hard and it doesn't let you live another 40 years happily.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "prof_devilsadvocate",
            "body": "my best is worst as per academic standard...so i think i wont work way..i have to try to be better",
            "score": 2,
            "replies": [
                {
                    "author": "Realistic_Grass3611",
                    "body": "Daring to try is already half the batle, seeking to try harder is the way to the other half, you are wining",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emily_Babyx",
            "body": "Key to happiness",
            "score": 2,
            "replies": []
        },
        {
            "author": "Civil-Current-7375",
            "body": "powerful meaning, love it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pisangguy",
            "body": "Thanks jimothy",
            "score": 2,
            "replies": []
        },
        {
            "author": "MUDKIPZ089",
            "body": "Fun fact: this post, as of this comment, has the same number of likes as 1 year in days.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "What if you can't do either?",
            "score": 2,
            "replies": [
                {
                    "author": "akin975",
                    "body": "Stay at peace.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "I don't have peace. Haven't had it for a while. :/",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "akin975",
                                    "body": "By looking for it, one shall not find peace; by letting go, one might.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Prince-Angel-Wing",
                                            "body": "If I let go, I'd be dead, because life itself is what is causing the lack of peace. Are you basically telling me that I should forfeit my life?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "akin975",
                                                    "body": "Seek help, my friend. \nRemember, if you change nothing, then nothing will change. \n\nI was going through hardships myself till I changed a few things. Now, I feel lighter.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Prince-Angel-Wing",
                                                            "body": "Already tried for years, and only dug a deeper hole. Can't change genetics. :/",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "akin975",
                                                                    "body": "We should not worry about things that we are born with. It is what it is.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Prince-Angel-Wing",
                                                                            "body": "Basically, you're telling me if it kills me, it kills me, and I should be happy regardless. That's *sure* helpful. :/",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DaxCorso",
            "body": "Don't try to be a great man just be a man and let history make it's own judgements., Zephram Cochrane",
            "score": 2,
            "replies": []
        },
        {
            "author": "DrStufoo",
            "body": "But I want to be the best though ○.○",
            "score": 2,
            "replies": [
                {
                    "author": "akin975",
                    "body": "YOU ARE THE BEST",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DrStufoo",
                            "body": "O●O. W h o a",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RageReaver7370",
            "body": "What if my best is the best",
            "score": 2,
            "replies": [
                {
                    "author": "akin975",
                    "body": "You have peaked.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hot_Frosting4504",
            "body": "This\n\n![gif](giphy|1oBwBVLGoLteCP2kyD)",
            "score": 2,
            "replies": []
        }
    ]
}