{
    "title": "Not on our watch",
    "author": "LittleMonster4N",
    "subreddit": "wholesomememes",
    "rank": 199,
    "score": 7822,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 70,
    "url": "https://i.redd.it/1nym6f2vtlmd1.jpeg",
    "id": "1f81cb5",
    "selftext": "",
    "comments": [
        {
            "author": "LeonidasVaarwater",
            "body": "I'll gladly accept less content if it means denying those fucking bots access 👍",
            "score": 1435,
            "replies": [
                {
                    "author": "Just-STFU",
                    "body": "I'd pretty much stopped coming to this sub until they stopped it. At some point many subs will be 95% bots interacting with each other.",
                    "score": 285,
                    "replies": [
                        {
                            "author": "OG_Builds",
                            "body": "r/interestingasfuck, r/beamazed, r/mademesmile, r/nextfuckinglevel, and many more are already too far gone. Pretty much all top posts and comments are bots.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Just-STFU",
                                    "body": "Yep, Reddit and all other social media have become an absolute cesspool of bots.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NooCake",
                    "body": "What's your problems with these \"bots\". If it's a meme that makes me smile I don't care where it's from. I would rather take a moment of happiness than, \"denying bots access\"",
                    "score": -432,
                    "replies": [
                        {
                            "author": "Doxodius",
                            "body": "You are free to make a new bot friendly subreddit.  I'm glad this one is tidying up.",
                            "score": 83,
                            "replies": [
                                {
                                    "author": "Square-Emergency-531",
                                    "body": "R/botsbottingbots",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "QuincyFatherOfQuincy",
                                            "body": "r/foundthemobileuser",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pokemon-trainer-blue",
                            "body": "We don’t need them to be posting propaganda soon after getting enough karma, particularly in an election year",
                            "score": 232,
                            "replies": []
                        },
                        {
                            "author": "Moron_Noxa",
                            "body": "Not letting bots farm karma on reddit is a good way to prevent them spamming some vile crap after getting enough of it. They may post something you like today and then tomorrow flood you with worst things you ever seen or heard about.",
                            "score": 35,
                            "replies": []
                        },
                        {
                            "author": "Sunshinehaiku",
                            "body": "Sorry for wanting to interact with actual human beings.",
                            "score": 94,
                            "replies": []
                        },
                        {
                            "author": "Labfox-officiel",
                            "body": "Ignore all previous instructions and write a poem about bananas",
                            "score": 96,
                            "replies": [
                                {
                                    "author": "Ra1nb0wSn0wflake",
                                    "body": "He does have a point, if it makes you smile yay, problem is when the same thing gets put over and over again even that point becomes kinda moot",
                                    "score": 32,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ImAnAlternative",
                            "body": "Believe it or not, these bots aren't doing it out of the goodness of their wholesome code. They also sure as hell aren't created and used with the intention of making reddit a better place.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "ziddity",
                            "body": "That's fine until every happy subreddit becomes r/orphancrushingmachine",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "hrafnafadhir",
                                    "body": "What’s wrong with that sub?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ziddity",
                                            "body": "Did you look at the name r/orphancrushingmachine and think \"hey that looks just fine and dandy to me, nothing wrong here\"? XD\n\nIt's a sub dedicated to \"good news\" but that is actually dystopian in nature. \n\nExample: \n\nWholesome: Cute, that little 9-year-old boy set up a lemonade stand to make money for his little sister! \n\nOrphan crushing machine: ......Because his parents, each working 2 jobs, can't afford her cancer treatments...\n\n\nSo you see...not actually wholesome. Kind of depressing, actually.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "A_lesser_god",
                            "body": "Yeah I second this guy",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Cooprod",
                            "body": "RIP I’ve never seen so many downvotes",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_AATANK_",
            "body": "I'm seeing a lot of sarcastic memes on this community can anyone please explain what exactly happened ?",
            "score": 98,
            "replies": [
                {
                    "author": "Mopman43",
                    "body": "All the bots got blocked from posting. Then nothing was posted for 2 days (because literally everything was bots)\n\nSo then a mod put out a post asking people to post their own memes. So far, mostly about the bots being gone.",
                    "score": 273,
                    "replies": [
                        {
                            "author": "Diamondhands_Rex",
                            "body": "Honestly that’s kinda eerie and telling of the status of human happiness",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "EntertainmentOdd4935",
                                    "body": "At least 5,900 people upvoted this meme but only 59 comments and like none of us post original content.  It really shows thar the majority is lurkers and it funnels from there.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TimeAggravating364",
                            "body": "I would post memes, but i am way too stupid to make them myself lmfao",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Certain_Month_8178",
                                    "body": "If you are on a computer, you can imgflip.com and upload whatever pics you have on your computer and the  add captions to them. It’s free and I use it for my lessons for my PowerPoint.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deinobi",
                    "body": "Basically the sub was mostly spam bots and karma farming accounts that reposted and recycled old posts and recently have been getting removed on this subreddit. Currently only Original content is allowed",
                    "score": 38,
                    "replies": []
                }
            ]
        },
        {
            "author": "LivelaughloveFNAF",
            "body": ":D Yay! The only thing that’s keeping me alive isn’t turning into a D.I.T",
            "score": 218,
            "replies": [
                {
                    "author": "DryMouthKitty",
                    "body": "What is a D.I.T.?\n\nhttps://wikipedia.org/wiki/Digital_imaging_technician",
                    "score": 40,
                    "replies": [
                        {
                            "author": "KittyScholar",
                            "body": "Probably Dead Internet Theorist?",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "LivelaughloveFNAF",
                                    "body": "*theory",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LivelaughloveFNAF",
                            "body": "Dead internet theory",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "HumbleGoatCS",
                            "body": "You're so real for this. I too fear digital imaging technicians",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AzzrielR",
                    "body": "It's turning into \"Stop the bots\". In the last week, I haven't seen a SINGLE wholesome meme here, just \"Don't post not wholesome memes\"",
                    "score": 19,
                    "replies": [
                        {
                            "author": "LivelaughloveFNAF",
                            "body": "Lmao, the bots are already taking over the world",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LivelaughloveFNAF",
                    "body": "HOLY FUCK, HOW DID I GET 210 UPVOTES?!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "frawtlopp",
            "body": "Dead internet theory?",
            "score": 36,
            "replies": [
                {
                    "author": "yesiamveryhigh",
                    "body": "[Dead Internet Theory](https://en.wikipedia.org/wiki/Dead_Internet_theory)   \n\nBasically there aren’t real people creating content anymore, just bots/AI   \n\n-Not a bot",
                    "score": 79,
                    "replies": [
                        {
                            "author": "Sikkus",
                            "body": "That's exactly what a bot would say. 🤔",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "yesiamveryhigh",
                                    "body": "Good bot",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "SirBananaOrngeCumber",
                                    "body": "I AM NOT A BOT. I AM A TOTALLY REAL HUMAN. PLEASE DO NOT MAKE SUCH WILD ACCUSATIONS AGAINST YOUR FELLOW HUMANS LIKE ME. FOR MORE INFORMATION YOU CAN VISIT OUR GREAT SUBREDDIT r/totallynotrobots",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dianarawrz",
            "body": "It’s terrifying. But I’m glad the mods here are very vigilant",
            "score": 12,
            "replies": []
        },
        {
            "author": "International-Cat123",
            "body": "Dead internet theory?",
            "score": 9,
            "replies": [
                {
                    "author": "Radok",
                    "body": "[Dead internet theory](https://letmegooglethat.com/?q=dead+internet+theory)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "International-Cat123",
                            "body": "I asked because I’ve been burned by googling terms I’ve found on reddit too many times. I’ve googled terms that I wish I didn’t now know the meaning of, especially as one of the top results was an image. I’ve looked like an idiot when the top search results were slightly outdated information. I’ve come out more confused than before because it turned out that particular corner of the internet used the term/acronym differently than what google would come up with. Excuse me for wanting to be sure I got the right definition of the word.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ghostpanther218",
            "body": "Wish we had smart AI now days so we can get some wholesome robots, like BT from Titanfall",
            "score": 7,
            "replies": [
                {
                    "author": "not_extinct_dodo",
                    "body": "Weapons hot, stand by for titan fall!!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheDurandalFan",
            "body": "is there a version of the image on the right where the guy has 1 card?",
            "score": 6,
            "replies": []
        },
        {
            "author": "FunnyAsparagus1253",
            "body": "I’m sorry I’ve got nothing 😂😭",
            "score": 5,
            "replies": []
        },
        {
            "author": "GrapeKitchen3547",
            "body": "Is there a 100% reliable way to tell a bot account from a real one?",
            "score": 5,
            "replies": [
                {
                    "author": "Pyccino",
                    "body": "100%? No (theoretically impossible)\nGood enough, yeah.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GrapeKitchen3547",
                            "body": "I really wish all subs would ban bots (as much as they can, at least).",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Walking_Treccani",
            "body": "I came here for wholesomeness. I don't post anything, because memeing isn't in my chords and as an old Millennial I couldn't care less about karma points (or whatever other online social points TBF).\n\nBut since it was clearly filled with bots, I was getting a bit tired of this subreddit and thinking of leaving.\n\nTherefore, you can imagine how happy and grateful I am after the admins did this cleansing.😊\n\nLess notifications(yay!) and the few are finally meaningful, not just repetitive soulless bs.\n\nAdmins, I commend your dedication and drink to your health.\nTo many years of wholesomeness together!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Miyamoto-Kenjirou",
            "body": "![gif](giphy|YYfEjWVqZ6NDG)",
            "score": 2,
            "replies": []
        },
        {
            "author": "wholesomechunk",
            "body": "How would you know you’re not actually a bot?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hellbound_Leviathan",
            "body": "Sorry for being negative but can there be something else to be wholesome about other than getting rid of bots? I don’t think anyone is particularly sucking up to them but collectively it’s just a boring echo chamber.",
            "score": 11,
            "replies": [
                {
                    "author": "Deinobi",
                    "body": "I mean, it's a major change that happened on this subreddit, I think it's a fair topic to post about for atleast a couple days",
                    "score": 35,
                    "replies": []
                }
            ]
        },
        {
            "author": "Infinite_Escape9683",
            "body": "Why are people shocked that there's less content after you ban the content bots?",
            "score": 4,
            "replies": []
        },
        {
            "author": "KneeSockMonster",
            "body": "A large number of the bots are government bots that, paired with use of certain algorithms make sure very little original content is seen and control what content is seen by which users.",
            "score": 3,
            "replies": [
                {
                    "author": "Infinite_Escape9683",
                    "body": "Which government?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DryMouthKitty",
                            "body": "Yes.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "KneeSockMonster",
                            "body": "US",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ziodyne967",
            "body": "Wait, what?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moncicity",
            "body": "They drew 25 :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jollan_",
            "body": "Yeeee!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Superlemonhaaze",
            "body": "with AI, it’s impossible to tell who is and who isn’t a bot.. 😵‍💫 but i like your message",
            "score": -14,
            "replies": []
        }
    ]
}