{
    "title": "Gotta watch out for them. Especially this time of year",
    "author": "pee_shudder",
    "subreddit": "wholesomememes",
    "rank": 83,
    "score": 9100,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 43,
    "url": "https://i.redd.it/i1h1xstn744e1.jpeg",
    "id": "1h3o4uv",
    "selftext": "",
    "comments": [
        {
            "author": "Terrible_Ear3347",
            "body": "It is okay to check in on someone just to personally verify that they are safe and at least in a well enough place to be left alone. But other than making sure they know you're available no matter what, don't overstay your welcome. Sometimes wanting to be left alone is genuinely the answer and it's important to respect that. Just make sure they're safe they know you're available if they change their mind and then leave them to make their own decisions about what they want.",
            "score": 438,
            "replies": []
        },
        {
            "author": "Pup_4ever",
            "body": "I would give anything to have a friend that gives enough of a shit to check on me....",
            "score": 110,
            "replies": [
                {
                    "author": "Snackasm",
                    "body": "Got one now, how ya doing? How's it hanging? What's the word?",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Eufafnism",
                    "body": "Same. Same.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "epabafree",
                    "body": "hope you're having a wonderful season!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Tangelo7221",
            "body": "About one and a half years ago I was really depressed, I generally suffer from chronic depression.\n\nI had a really close friend that I would meet 2-3 times a week. One time I told her I needed some time alone, I was spiraling, was shut inside my apartment for a month, besides 1 message early into the month I haven't heard or seen her. \n\nAfter forcing myself to make contact I got very cold replies, later our mutual friends told me she didn't want to be my friend anymore because I didn't try to talk to her during that month. \n\nSeeing this post... yeah I wish",
            "score": 46,
            "replies": [
                {
                    "author": "Deal-Correct",
                    "body": "Im sorry you went through that :( O got really depressed during the start of covid. I spoke to no one for a couple months, I was in a very dark place. I had a childhood bestfriend for 15 years I used to talk to everyday. Ever since I isolated myself, she's never been the same. It's been 3 years where I'll still reach out to say I miss her, and she just likes the message but doesn't reply. She said I wasn't putting in the effort she needs from friendships. I still love her and miss her so deeply. I'm heartbroken over losing my sister in crime",
                    "score": 6,
                    "replies": [
                        {
                            "author": "No_Tangelo7221",
                            "body": ">She said I wasn't putting in the effort she needs from friendships.\n\nDam brother, almost sounds like we had the same friend... \n\nThe unfortunate thing is the trust issues later",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "Trust me when I say that is *not* the way to do it.",
            "score": 106,
            "replies": [
                {
                    "author": "Apart-Landscape1012",
                    "body": "\"i want to be left alone\" \n\n\n\"lol no you don't!\"",
                    "score": 70,
                    "replies": [
                        {
                            "author": "MRSN4P",
                            "body": "An example of Extroverts that don’t understand introverts.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "I throw hands...",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "raisedbypoubelle",
                    "body": "It depends. For the most part, when someone wants to be left alone, I’m happy to. I had one friend a few years ago that cancelled a hang and it made me nervous. So I stopped by and came literally in time to keep her from killing herself. \n\nI had to stay on suicide watch for 24 hours until her husband got home to put her in a facility until she could get everything sorted. \n\nIf you’ve got a bad feeling, check on your friend.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "I most certainly don't have these \"bad feelings\" because I lost a good friend and coworker due to not having that feeling.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KareemOWheat",
                    "body": "For real. If I say I don't want to hang out, I'm not answering the door. Forcing yourself on me to be a \"good friend\" isn't the cure for my depression",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "ssouthurst",
                    "body": "I'm assuming you are referring to the \"check in him\" gaffe...\n\n\"I want to be left alone\"\n\n\"oh really...?\" *snap*\n\n\"y.... ESSSS!\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DryMouthKitty",
            "body": "![gif](giphy|VGQu30l3RjwT3ZXeTb|downsized)",
            "score": 19,
            "replies": [
                {
                    "author": "Viva_la_fava",
                    "body": "I wish I could watch this series, it seems so good",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Token_Creative",
                            "body": "It’s on Hulu.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Viva_la_fava",
                                    "body": "Thank you dear ☺️\n\n![gif](giphy|Jev4iU72S9RYc)",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SteakAnimations",
            "body": "I don't know about others, but for me, when I want to be alone. I want to be fucking alone. So GTFO of here with this BS.\n\nEDIT: Grammar",
            "score": 6,
            "replies": []
        },
        {
            "author": "KG354",
            "body": "It’s the time of low tire pressures and lower self esteem. Check on your friends.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Snackasm",
            "body": "Sometimes I want to be less alone, but yes, sometimes come check on me",
            "score": 5,
            "replies": []
        },
        {
            "author": "FortunateFunction_79",
            "body": "Really thankful to friends like this. Sometimes it's just exactly what you need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Firm-Contribution973",
            "body": "A true friend is somebody who can make us feel better no matter how bad things may be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "delta4mel",
            "body": "I’ve been diagnosed with depression for 4 years now and I’ve always felt guilty, thought I would ruin my friendships with all the negativity, but they messaged me to check in if I wanted some alone time. Well..as soon as I got better they all left me. I thought it’s usually the other way around lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saturated_Seagul3000",
            "body": "Nice watermark 👍",
            "score": 1,
            "replies": []
        }
    ]
}