{
    "title": "I'm seeing a lot of misinformation surrounding South Africa's new land act",
    "author": "TJ736",
    "subreddit": "socialism",
    "rank": 496,
    "score": 11,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/socialism/comments/1ihs5cd/im_seeing_a_lot_of_misinformation_surrounding/",
    "id": "1ihs5cd",
    "selftext": "The literal first and only page of the act states that compensation for expropriation **will be** determined by a number of factors, including **market price**,  making it near impossible for expropriation without compensation. Expropriation without compensation *may* happen solely based on a courts approval, but this rarely happens and for the most part expropriation will work on a willing buyer willing seller basis, as has always been the case. \n\nAs the EFF have pointed out, there is a principle known as the \"Gildenhuys principle\", which determined that, as a rule, any question of compensation should be according to a two-stage approach which prioritizes the market-value of the property: the price of compensation must start with the market-value of the property, & thereafter other factors may be taken into account for decreasing or increasing the price of compensation. \n\nNothing has changed much legally speaking. The act is not this grand act of decolonisation I'm seeing a lot of comrades claim it is. It's more liberal nonsense. As my more well-read friend says: \n\n\"One of the reasons why the EFF & other leftists dispute this expropriation act (besides disputing the act's protection of the right to private property, which renders expropriation without compensation nigh impossible), is that the act fails to mention the factors determined by this judgment to be relevant for calculating compensation [...] Without abolishing private property, expropriation without compensation is extremely unlikely under the new law, & most expropriations will merely result in payments from state funds — which may amount to reimbursing or indemnifying settlers who stole the land in the first place — but not redistribution, let alone commonization, of land.\"\n\nNevertheless, America needed a reason to stop aid from coming to this country. As the same friend put it:\n\n\"That's a post-hoc argument for why they already cut off funding to RSA. The Trump government is doing the same to all countries — cutting-off funding & coming up with an excuse after the fact for why they did it.\"\n\nWe can't fall for misinformation and false propaganda comrades. \n\nThanks to u/GVCabano333 for helping me write this. He's the smarter, well-read friend I was referring to. He said he should have his own analysis on the act out this weekend. If I got anything wrong, it's my fault solely, however.\n\nI've linked the act [here](https://www.parliament.gov.za/storage/app/media/Acts/2024/Act_13_of_2024_Expropriation_Act_2024.pdf) (pdf) if you want to read it yourself.",
    "comments": [
        {
            "author": "AdventureBirdDog",
            "body": "yup a ton of information, he's just cutting all money to every country besides Ukraine and Israel. He doesn't care about the land act. If anything he cares that South Africa brought charges of genocide against Israel and wants to punish them",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ancient_Sound_5347",
            "body": "The whole point of the misinformation campaign is to set up the narrative that white people are being ethnically cleansed in South Africa and set the stage for 'regime change' by Trump.\n\nThink of it how the US went about fabricating information that Iraq had WMD's that led to the Invasion of Iraq.",
            "score": 3,
            "replies": [
                {
                    "author": "TJ736",
                    "body": "And this is why I don't like the idea of comrades playing into this misinformation. Based as it would be, this misinformation is only going to hurt actual South Africans in the long run",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ancient_Sound_5347",
                            "body": "Only a small segment of the white population in South Africa are Pro-Trump and MAGA supporters.\n\nThey believe he is their \"saviour\".\n\nThey are online with their MAGA counterparts in the US spreading false information that they are the victims of ethnic cleansing or that 'their farm was taken\". \n\nComplete with edited clips from land grabs from Zimbabwe years ago to make it appear that it's from South Africa.\n\nIt is they who now have his ear whereas before Trump had moderating influences in his cabinet when he waded into South African politics back in 2018.\n\nThe South African MAGA supporters are well aware that there is currently a purge underway in the US government  to get rid of career civil servants to install Pro-Trump loyalists.\n\nThe most recent target being the C.I.A\n\nWhite South Africans are going to feel the hardship as well.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hark3n",
            "body": "Ja, I've spoken to a couple of my less enlightened colleagues and they all think that the act will take their homes and is saying that Trump will save South Africa from the ANC. If I ask them if they actually read the thing they just shrug.\n\nOn a side note, it has enabled me to explain the difference between public, private, and personal property. I think I might have opened some eyes, at least enough to do some more reading.",
            "score": 2,
            "replies": []
        }
    ]
}