{
    "title": "In the coming months",
    "author": "Dazzling-Screen-2479",
    "subreddit": "socialism",
    "rank": 471,
    "score": 30,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/socialism/comments/1iiv18h/in_the_coming_months/",
    "id": "1iiv18h",
    "selftext": "You all are about to hear many voices whether in the media, online, or in person. These voices will be amplified by coin (counter insurgency) actors as a strategy. I say amplified because these voices won't simply just be from infiltrators or feds, but they'll be an organic result of individuals being restrained by preexisting petite bourgeois perspectives that favor things like respectibility and civility towards political opposition. An example of this was videos of young youth yelling \"fuck this place, fuck trump\" and all types of profanity, and the comments are flooded with \"this won't help but hurt the movement\" or \"real nice..face tattoos, masks, stealing cars, aggressive music. Yeah this won't appeal to everyone. Keep the spray paint, masks and bad attitudes at home. Hurting the movement\". \n\nThis sentiment is nothing new. It's not just sentiment though. It's a piece of a larger puzzle. That puzzle is the overall COIN strategy utilized to pacify movements by keeping their praxis within the realm of liberalism. The goal is preventing them from existing as a form of resistance. To do this they utilize NGOs, even compromised leftist groups, the media, rumors and liberalism. They even have so much as directly had these ngos hire security who would police people, doing things such as \"demanding\" people remove masks or tone down their langauge or rhetoric. \n\nIt's important to call this out and expose it for what it is, but also pay attention to it so you don't fall victim to it. This is literally what keeps any movements from growing in America. This is reflected in the following quote in regards to all the anti police brutality movements,\n\n\"I think the uprisings are good but we’re seeing that they have limitations as a revolutionary uprising. These limitations allow the state to subvert the nature of uprisings as well as the issues as mere reforms. The state and liberal politicians and others are able to utilize that against the movement. This kind of co-optation has been happening for a while. I’ve watched 60 years of protests and so-called “riots” and rebellions and uprisings in major cities and small towns like Ferguson, Missouri. I’ve watched 60 years of them going back to 1964 with the Harlem rebellion in Harlem, New York. It was always something to do with the police. One form or another, they kill somebody, beat somebody, or just came in the community and did some kind of atrocity. And the people responded with a fight back. What’s been allowed to happen in this instance is that the people rebel, the people fight back, and people put up a mass front of protests. Then the politicians and the others claim to be using their issues or their drive to then turn around and propose some liberal reforms, which aren’t liberal at all, actually.\"",
    "comments": [
        {
            "author": "Bhartbunny",
            "body": "I think this is already shown perfectly in the 50501 protests and the posts/comments telling people to keep things as civil as possible. Thank you for putting it to words.",
            "score": 7,
            "replies": [
                {
                    "author": "Dazzling-Screen-2479",
                    "body": "There needs to be the place for all types of personalities and temperaments to take part in struggle according to their levels of comfort. In 2008 when there was an uprising in Greece, militant marxist groups and anarchists would constantly be denounced by reformists and liberal politicians. They would denounce them while claiming to, or taking part in the movement. I feel like I should eventually post about it, because it's a pivotal moment in history and partially plays a part in the recent history of fascist developments; I wouldn't say the neo liberal elite of europe were terrified (unless in greece), but they were extremely concerned.\n\nIn this video you can see the same COIN utilized against Greek revolutionaries. It's standard tactics that became the norm after military analyst studied the failures of Vietnam. Afghanistan played a role in the development of this standard as well. Most neo liberal societies utilize this as a mechanism of self sustaining suppression of the radical left.\n\nhttps://youtu.be/VRE-DmmK544?si=Tiawv2ZD7uOQdKpS\n\nThis video is an example of subtle propaganda. They mentioned how it came at a horrible time for shopkeepers near christmas. They didnt say \"comrades, friends and family lost a friend during the holidays. Instead of celebrations they gather in outrage and anguish\". This is apart of why the greek anarchists took such actions. So the mainstream media would expose its allegience to commodities above life. What's extra ridiculous about liberals denouncing anarchists in Greece in this period of time is.. their uprising was because police shot a kid they were educating. He was killed right outside of their buildings. The anarchists released a statement against the liberals from a political office building they occupied declaring \"these nights and days do not belong to the media tongues, the shop keepers, the reformer, commodity, nor state authority or bourgeois mechanisms of control. These nights and days belong to our fallen comrade.\"",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "No-Mushroom-8632",
                    "body": "Are you saying the 50501 protests don’t do anything? I spent hours last night making signs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dazzling-Screen-2479",
            "body": "\"Rebellions are great. They’re wonderful, it’s great to see people standing up. The only thing is, you know my standpoint as an old long-term activist and everything, I try to look at the actual essence of a struggle, not just the fact that it’s happening. The orientation of the struggle today is very similar to what I saw in the final stages of the civil rights movement. You see them win reforms, but not transform the system itself. \n\nWe can’t organize the way we organized back in the 60s, we can’t organize the way we organized even 30 years ago, 20 years ago. We’ve got to break new political ground and have new political theory and new political tactics.\n\n\nWe have to make it so that we create a new kind of political system of our own, whether it’s dual power or revolutionary direct democracy, whatever we want to call it in this period. We need to create that kind of movement, a mass anti-fascist movement on one hand. And on the other hand, we need to have the capacity on a mass scale to build a community-based mass economic survival tendency, based on cooperatives in the ghetto for housing the poor, rebuilding cities, and taking care of the material needs of the poor. We need to be able to build that. I’m not opposed to some of these groups that are coming about because although they are not radical now, potentially they could turn into something else. But what needs to happen is that we need to be reaching the masses of urban poor people with these programs. We’re not fighting just to have a cult or a group, or some leaders. We’re fighting to put power in the hands of the people in a new society. Presumably, revolutionaries know some things in some areas of organizing that people don’t know. So we need to be training them, equipping them to be independent of this political structure. The Black Panther Party was right, we need to have survival programs and we need to be going beyond just what they had. We should be trying to build the survival economy in this period right now.\"",
            "score": 2,
            "replies": []
        }
    ]
}