{
    "title": "With Trump getting the CIA, who is going to enforce for capitalism in the Global South?",
    "author": "Wob_Nobbler",
    "subreddit": "socialism",
    "rank": 456,
    "score": 98,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 44,
    "url": "https://www.reddit.com/r/socialism/comments/1ij6uua/with_trump_getting_the_cia_who_is_going_to/",
    "id": "1ij6uua",
    "selftext": "",
    "comments": [
        {
            "author": "secondrunnerup",
            "body": "I’d be very excited by the dismantling of these horrible imperialist programs if it weren’t for the fact that they will likely be replaced with something much, much worse.",
            "score": 172,
            "replies": [
                {
                    "author": "skeptic9916",
                    "body": "Worse yes, but as capable? Likely not for decades. Gutting the CIA essentially deletes all of the institutional knowledge, contacts and operational infrastructure that the Agency established over its history. \n\nThen you get to the staffing, Trump and his crew are putting the least intelligent , most unqualified people in leadership positions. How well do you think someone like Mike Lindell would run a clandestine organization or maintain a long term plan to destabilize political movements over the long term across several continents? How effective can a MAGA cultist be in an Agency were individual capability is of the highest import and knowledge of the minutia of a region and it's languages, sects and political history are a prerequisite? \n\nTrump may have inadvertently given the global leftist movement some breathing room amidst his rampage of destruction.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Katyusha_2",
                            "body": "Maby trump was just a leftist accelerationist the whole time/j",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wob_Nobbler",
                    "body": "Worse for sure, but do you think this new hypothetical CIA would be as effective if staffed by yes-men?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Public-Spring5259",
                            "body": "it could rely less on subversive influence and be more military/direct imperalism",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "loadingonepercent",
                                    "body": "We’re not very good at that either and there is no public apatite for it.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "rogerbroom",
                                    "body": "How? The US can barely fight a proxy war in Ukraine. How can they rely on militarism.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PanchoPanoch",
                                    "body": "The DIE - Doge International Enforcement",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sirscooter",
                            "body": "Also, a bunch of Ex-CIA or current operatives who might not be too happy about the current 45 situation. That know how to hide and manipulate the situation due to their training.\n\nThen again, I'm not going to correct an enemy when they are making a mistake",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Mrhorrendous",
                            "body": "I mean rather than covert coups and funding right wing death squads I suspect Trump wants to just send the US military. Which I think would be perfectly capable of showing up and killing a bunch of people.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "HikmetLeGuin",
                            "body": "Trump isn't abolishing the CIA. He's just remaking it in his own image. It will still be as brutal as ever.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Tal_Onarafel",
                            "body": "Probably a slightly more formalised version of the Safari Club but under the influence and patronage of tech oligarchs this time rather than like Count Alexander De Marenches, Adnan Kashoggi and Kamal Adham.  Like probably still some Saudi arms dealer influence but more also of this Musk-Thiel stuff as well. I'm not sure exactly how Russia and Israel would play into this though. .",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "JBNYINK",
                            "body": "If you think that he is gonna completely use it for internal disruption and propaganda.\n\nBrown shirts loyalty \n\nYour right.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "t_g_spankin",
                    "body": "I think it's definitely worth keeping in mind that these programs will be more brutal, but they will also be less competent and capable. \n\nThe irony is that as horrible as the CIA is for what it does, it has been able to do it's job well because it receives strong government support. Running espionage isn't cheap. It's pretty funny to see neoliberalism eat away at the defenses of the capitalist class too. There is no end to the greed of the capitalists, they will even strip away the bones of their own defenses to save money and increase profits. \n\nSome self-owns have already happened, BTW. A few years back, a bunch of CIA agents in China and Iran foreign nationals who were working for the CIA, not CIA officers) were uncovered because rather than relying on time tested (and expensive) means of communication (like dead drops, etc.) The CIA decided to use some \"secure\" app that some tech bro sold them on. The Iranians hacked into it, were able to monitor all communications and handed it over to the Chinese. Dozens of agents/informants were rounded up and executed.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "reddit_detective_",
                    "body": "Last hoorah of the system before it falls is always fascism\n\nEdit: the hyper capitalist system, the last nail in the coffin, the very tip of late stage capitalism",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "jdvanceisasociopath",
            "body": "An intelligence agency of Trump's own design",
            "score": 24,
            "replies": [
                {
                    "author": "Wob_Nobbler",
                    "body": "If staffed with cronies and yes-men it would be far less effective at its task no?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "jdvanceisasociopath",
                            "body": "Maybe. Could be more brutal",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "voidgazing",
                                    "body": "It will be more brutal for sure- history is littered with ham handed attempts at that kind of work. The methods of the unskilled generally prove ineffective or even pyrrhic. \n\nSo mad that \"can we just not mess with people\" is just never on the damn table as an option. But if its going to happen, FFS let the professionals handle it.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GreenTheOlive",
            "body": "Trump is dismantling these programs in order to implement more traditionally colonialist policies as opposed to the soft power neoliberal colonialism we’ve had for the last 40 years. Guarantee before his term is up we will have settler colonial crypto colonizers creating their own hellscapes ",
            "score": 20,
            "replies": []
        },
        {
            "author": "telejeem",
            "body": "My hunch, he’s not getting the CIA.  More likely they are getting him.",
            "score": 8,
            "replies": [
                {
                    "author": "SocialDoki",
                    "body": "That's my bet too. The CIA is smarter than he is and pissing off the people who can pull off assassinations of world leaders isn't exactly playing 5d chess.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Important_Baby5462",
                    "body": "I can’t believe I’m rooting for the CIA in this scenario",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "uluvboobs",
            "body": "It's just all being privatised so there can be zero oversight even for authorised gov officials.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Dchama86",
            "body": "It would only be replaced with direct, military-enforced imperialism. Hallmarks of a fascist/authoritarian regime.",
            "score": 3,
            "replies": []
        },
        {
            "author": "anachronissmo",
            "body": "Do you hear that whooshing the sound, that is the soft power vacuum about to be filled by China. This is a good development.",
            "score": 11,
            "replies": [
                {
                    "author": "Wob_Nobbler",
                    "body": "Yeah many here seem to think the US will just start colonizing with no resistance. China may take up the reign of anti-imperialism that the Soviets used to have in the Cold War.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "HamManBad",
                            "body": "Hopefully China won't need to, ideally the whole people of the global south will take up that mantle so China won't have to paint itself as the spearhead. Their strategy demands as much neutrality and stability as possible, as they serve as an important bridge from the old world to the new. \n\n\nNow, if some other country ends up having a proper revolution full of young, first generation comrades willing to go out and support world revolution, then we'll be cooking with gas. ",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BaronTazov",
                    "body": "I really hope so. My instinct is that the issue is power more than stated ideology but even in that context China just couldn’t do what the US has don’t even if they wanted to.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "diecorporations",
            "body": "Hopefully the tyranny of the US around the world will be lowered. But I doubt it.",
            "score": 1,
            "replies": [
                {
                    "author": "Wob_Nobbler",
                    "body": "No doubt the US will become more direct and violent in its imperialism. But for China this is a golden opportunity to take up leadership against Western Imperialism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "50501-supporter",
                            "body": "Europe is changing. Most people here aren't really interested in imperialism anymore.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thorsbosshammer",
            "body": "Power abhors a vacuum. Something will fill the gap.",
            "score": 1,
            "replies": [
                {
                    "author": "Wob_Nobbler",
                    "body": "China and the EU are set to fill the vacuum IMO. I know which side I favor.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic_Date_7716",
            "body": "The CIA is incapable of enforcing capitalism",
            "score": 1,
            "replies": []
        },
        {
            "author": "tecate_papi",
            "body": "Unless I missed something, he said he's reorienting them to other targets than the ones they have now and \"non-traditional\" CIA targets. Who even knows what that means.",
            "score": 1,
            "replies": [
                {
                    "author": "BaronTazov",
                    "body": "Likely the “enemy within”.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TiredPanda69",
            "body": "The CIA.\n\nThey're not going to get rid of it, just making it more leaner. More repressive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "balrog687",
            "body": "Lol, CIA will be replaced by AI bots, and Kill Squads will be replaced with AI drones.\n\nIt has been proven that you don't need more to destabilize countries and enforce capitalism.\n\nWhy waste money on payroll.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ownthepibs",
            "body": "Capitalism isn’t something you “enforce” down on people it’s a mode of production that happens once production of commodities becomes the dominant basis for social relations. Global south countries aren’t “forced” into capitalism nor is the CIA some all magic wizard that is keeping global south countries from becoming socialist.\n\n\nYes US imperialism is a primary contradiction is the development of the global south living standards but there is still class struggle present between global south bourgeois and proletariat and the international bourgeois and comprador bourgeois, US imperialism ending doesn’t preclude a socialist world. The US didn’t create capitalism nor is it the sole maintenance of it\n\nThis is a very idealistic and outright revisionist way of describing geopolitics",
            "score": 1,
            "replies": []
        }
    ]
}