{
    "title": "Gödel's Loophole",
    "author": "7x1e",
    "subreddit": "socialism",
    "rank": 461,
    "score": 31,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/socialism/comments/1ij637x/gödels_loophole/",
    "id": "1ij637x",
    "selftext": "The mathematician Kurt Gödel is said to have found a way that the US constitution would allow for a dictator to take control. Many historians/constitutionalist said he was lying because how did he find something that they couldn’t. So was he right after all? I worried from the first election about this. When Trump nominated a Republican judge on the Supreme Court giving them majority. The fact this election he has both house and senate makes him quite invincible since a-lot of republicans are Trump loyalist. There is also a problem with the fact that Trump has removed the FBI committee that focuses on election interference which is surprising since he cried a-lot about this. Honestly, Im losing all hope. By midterms I think Trump will have done so much damage and will rig elections and nobody will be able to do anything about it because the FBI and CIA will consist of only Trump loyalists.",
    "comments": [
        {
            "author": "Radical_Coyote",
            "body": "We can only speculate what Gödel had in mind. Probably he was thinking about it very abstractly, as a math problem, and who knows what flaw he saw. Still, I think it’s pretty clear that the constitution is flawed in that it requires every president to have a bit of George Washington’s restraint in order to prevent any president from becoming a dictator. Let’s see why:\n\n1. The president is the commander and chief of the armed forces. Yes technically the military swears an oath to the constitution, not the president, but the constitution says that the president is your commanding officer now doesn’t it? So legally speaking the president will always have the backing of the military. As Mao says, “power grows out of the barrel of a gun.”\n2. While only congress is empowered to enact laws, they have no power to enforce or bring to fruition those laws without the president. This means, in effect, that there is very little to stop the president from ruling by fiat by executive order. Indeed, congress has already willingly neutered itself decades ago by insisting on a 60 vote threshold to pass anything besides routine budget approval (the budget also usually largely set by the OMB, i.e., the president). This means that effectively all public policy must be enacted by the president by executive order, which has essentially been how things have worked since at least as long as I can remember (I’m 29). So congress, both de jure and de facto, is basically a symbolic rubber stamp that the president can choose to just ignore. \n3. That leaves the SCOTUS. While the courts can say what the president is doing is illegal, they have no power to enforce that ruling without the president. See Andrew Jackson’s famous and foreboding quip “they’ve made their ruling, now let’s see them enforce it.” So the courts only have as much power as the president is willing to give them.\n4. So the only true check on the president’s authority is impeachment by congress. But all a president needs is a short window of time with a sufficiently compliant congress in order to shore up their regime (for example by changing election laws to make all subsequent victories guaranteed). By “sufficiently compliant” I do not mean that you need to control congress, all you need is 34 loyal senators because the threshold for impeachment is so high. Because of the absurd way the senate is constructed, you can obtain that many senators by winning as little as 4% of the popular vote supporting your party. (Method: win 51% of the votes of the 17 least populous states). You can do it with even less if you can suppress voter participation rates. Hitler won around 34% of the vote in 1933 to kill the Weimar Republic, you could probably kill the American Republic with similar margins under the right circumstances. As it is, Trump won 51% and he has everything he needs to become dictator if that’s what he wants to do.\n\nTo sum up, the constitution itself does almost nothing to prevent a dictatorship. The only thing that has historically prevented it is the tradition of identifying as a democratic republic. If the president doesn’t care about that identity, then the constitution isn’t worth the paper it’s written on.",
            "score": 17,
            "replies": [
                {
                    "author": "desiderata1995",
                    "body": ">1. The president is the commander and chief of the armed forces. Yes technically the military swears an oath to the constitution, not the president, but the constitution says that the president is your commanding officer now doesn’t it? So legally speaking the president will always have the backing of the military.\n\nPlease clarify, but I think you're alluding to the idea that as commander-in-chief he can, on a whim, order the military to take action against it's own citizens? \n\nThat's incorrect, Posse Comitatus Act prevents that.\n\n>they have no power to enforce or bring to fruition those laws without the president.\n\nThey do, it would look like this; \n\nCongress passes a bill to his desk to be signed into law, he vetoes it and kicks it back. If the House and Senate each vote a 2/3 majority to override the veto, then it passes into law regardless of his veto. \n\nFunctionally is something like that historically difficult to achieve, absolutely. But they do possess that ability, so it can't be dismissed and pretended that it doesn't exist.\n\n>that there is very little to stop the president from ruling by fiat by executive order.\n\nThere is quite a bit, with the courts issuing preliminary injunctions and temporary restraining orders that prevent those Executive Orders from being enacted until they have gone through a trial to determine whether or not to sustain the EO. \n\nThere are currently several injunctions and TROs against various EOs that he has signed since taking office. Many of the EOs he has signed off are performative nonsense whose actual purpose is to flood and overburden the courts and our institutions. \n\nNow from that aspect they are succeeding, especially as the administration also carries on with dismantling some institutions, causing further chaos.\n\n>Indeed, congress has already willingly neutered itself decades ago by insisting on a 60 vote threshold to pass anything besides routine budget approval\n\nYou're referring to the act of \"invoking cloture\", which 1. The 3/5 votes needed is less of a \"neutering\" than what it was prior to 1975 when they reduced the votes needed from 2/3, and 2. Is not the primary method through which bills are passed, it's a tactic utilized primarily to force an end to a filibuster.\n\nThe genuine drawback that persists with having cloture as an option is that it can be initiated by a minority opposition and could cause the measure to not pass, assuming they're unable to achieve the 60 vote minimum that is necessary upon using cloture. \n\n>This means that effectively all public policy must be enacted by the president by executive order, which has essentially been how things have worked since at least as long as I can remember\n\nI would have to investigate this further to counter it, I won't speculate on it but I do think it's incorrect. \n\nIf I remember to I'll look into it and edit this with what I find.\n\n>So congress, both de jure and de facto, is basically a symbolic rubber stamp that the president can choose to just ignore.\n\nThis is reductive to the point of inaccuracy, the reason Democratic presidents are unable to pass  as many measures as they claim to want to is due to\n\n1. The Democratic party functionally behaves as controlled opposition by not putting considerable genuine effort into pursuing the passage of laws they want, but also \n\n2. Directly because of opposition from Congress (when they don't hold a majority, when they do, refer back to the point of them behaving as controlled opposition)\n\nSo as a socialist while I do recognize that they are a capitalist party which will endeavor to see the expansion of capital, calling Congress a rubber stamp the president can ignore is too reductive of a viewpoint when the reality is that they do routinely oppose presidents and succeed.\n\n>3. That leaves the SCOTUS. While the courts can say what the president is doing is illegal, they have no power to enforce that ruling without the president. See Andrew Jackson’s famous and foreboding quip “they’ve made their ruling, now let’s see them enforce it.” So the courts only have as much power as the president is willing to give them.\n\nNothing more to add here, you're correct. \n\nThe executive branch is the authority to enforce their ruling, it would simply be very odd and cause much confusion to the authority of SCOTUS if the president were to repeatedly oppose their rulings.\n\nAs things are currently though, this SCOTUS is practically all but assured to deliver favorable rulings to the current administration, so they're getting along fine, to our detriment. \n\n>4.\n\nNot going to copy all of that,  no need as again I agree. \n\nImpeachment is their real power against him, however they would have to be able to cite articles against him and yes of course they would have to be in agreement amongst themselves that they should even move forward with the impeachment, and it's unlikely given how favorably stacked things are in this administrations favor. Even if they do he has previously escaped 2 prior impeachements, so I hold no real hope that one would be successful now.\n\nEdit:\n\nThis is one of those moments that I really dislike the voting system on comments, because this is a conversation that should be had directly and engaged in dialectically. \n\nI'm by no means the arbiter of Constitutional law, but I try to speak within the bounds of my knowledge, and if I'm wrong and someone can highlight what I'm wrong about and have a discussion with me about it, that's how myself and maybe others reading can learn from that synthesis.\n\nInstead people anonymously voice their displeasure with a downvote and no one benefits from that. I always appreciate an opportunity to learn wherever there is one, it's a characteristic I've found intrinsic among the left that attracted me to it in the first place.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "HamManBad",
            "body": "It's all pretty irrelevant, the constitution is just a peice of paper after all. Plenty of countries had democratic constitutions and became dictatorships- turns out dictators don't really care what a constitution says.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Slight-Wing-3969",
            "body": "I never really understood why it would be considered a loophole. A constitution is just a piece of paper without ratification by the constant tacit consent of those governed by it. Even if it had rules saying, some rules can't be changed, and had a no dictators rule the mechanism that actually prevents someone being a dictator is that actual people don't let them. So if there aren't people willing and able to prevent that, then the words on a page are just words on a page. Material reality is not controlled by magic words in a contract but by their enforcement. So it is actually quite normal operation for a constitution to be able to be changed so it reflects the will of those who hold power and not really a loophole if it has provisions in it to be changed such that formal naked dictatorship appears instead of the obscured bourgeois dictatorship that does a dog and pony show with parliamentarian distractions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "F_RankedAdventurer",
            "body": "Meh, socialists have always thought the US sucked and is fascist. Just another day",
            "score": 2,
            "replies": []
        }
    ]
}