{
    "title": "Should I take a class about \"democracy\"?",
    "author": "lenin_beard",
    "subreddit": "socialism",
    "rank": 455,
    "score": 15,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/socialism/comments/1ijmgr8/should_i_take_a_class_about_democracy/",
    "id": "1ijmgr8",
    "selftext": "I'm currently enrolled in a course about \"democracy\" in uni, but now, I'm uncertain whether I should continue. There's a part about Marxism, but I think my prof is not a socialist. And there will be a group project, but I probably won't find a single socialist in my class. \n\nDoes a course like this worth my time? Should I continue, or drop it?\n\nEdit: Thank y'all for your responses! I guess I'll continue taking the course :D ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "myaccountisnice",
            "body": "You're at a university for a degree, right? You have to take the courses they offer or ones they allow you to transfer from another institution. Not gonna find perfect courses...take this one, it will give you a chance to understand their definition and probably hone some skills in debating their concepts against your view...and might convert some people. \n\nAt the very least, you'll get credits and maybe learn something about yourself and your politics along the way.",
            "score": 33,
            "replies": []
        },
        {
            "author": "None",
            "body": "I feel like it’ll be focused on liberal, bourgeoise democracy (or capitalist democracy whatever you want to call it). I don’t see why you shouldn’t take it if you want to, but the framing is going to be based around that liberal framing, and the “Marxist” aspect perhaps won’t be as honest, since the honesty is bourgeois scholars is highly skeptical. If you want then go ahead, but be ready to criticize and question everything you hear since you’re a socialist/communist, it should be your approach.",
            "score": 17,
            "replies": []
        },
        {
            "author": "SpeakerWeak9345",
            "body": "Yes, take the class. Your professor is most likely not a socialist. That is true for most of your professors in college. Democracy is a broad topic and you will not be covering every aspect of it in class. That doesn’t mean it’s not valuable or you shouldn’t learn about it. I’m guessing you are in undergrad, you are getting a pretty broad education. You don’t start specializing in a specific topic until grad school.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mineturtle1738",
            "body": "Infiltrate the class and spread socialist ideological interjections (without calling it socialist)",
            "score": 11,
            "replies": [
                {
                    "author": "Doub13D",
                    "body": "Any professor teaching a class on “democracy” will immediately recognize what you are doing and point it out to the class. \n\nYou’re not going to be able to hide thinly-veiled narratives and talking points from an educated person with a background in political science or history…\n\nOP is better off just being open about their beliefs and willingly discussing them in class. These types of course are usually big on open-ended discussion, debates occurring organically as a result of course material were some of my most eye-opening experiences in undergrad.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doub13D",
            "body": "Yes, this type of course is absolutely worth your time. \n\nYou may genuinely adopt a new perspective that you did not have before based on how you engage with the material… or you might actually strengthen your current beliefs while also gaining a deeper understanding of how other people view the world and the ideological reasons that underpin it. \n\nThe goal of an education is to broaden your understanding of the world, if you refuse to take a course purely because you believe your beliefs will be challenged, then you are not secure in your beliefs. \n\nIts the political equivalent of refusing to take a course on evolutionary biology because you believe in young-Earth creationism…",
            "score": 4,
            "replies": []
        },
        {
            "author": "WhereIShelter",
            "body": "You will probably just learn that liberal democracy is the only real democracy and everything is fake democracy and for sure commie democracy is the opposite of democracy. There I saved you a semester.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Melodic_Frame4991",
            "body": "Is it optional? Also why do you only care if there are other socialists. You should be taking classes because you want to gain something from it ",
            "score": 1,
            "replies": []
        },
        {
            "author": "IDIDMYTIMENIWANTOUT",
            "body": "know your enemy or learn something nice and get credits while doing it what's wrong",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpicypickleSpears",
            "body": "take it and argue with the prof :p",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigdaddyputtput",
            "body": "This is kind of the beauty of university. Your professor will present an educated point of view on the topic and you’ll have the ability to learn about your own worldview as well as others.\n\nIf socialism was so flimsy an ideology that it didn’t stand to scrutiny, it wouldn’t be worth believing in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lenin_beard",
            "body": "Thank y'all for your responses! I guess I'll continue taking the course :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Yes. And read Plato’s Republic, you nonce.",
            "score": -1,
            "replies": []
        }
    ]
}