{
    "title": "Thousands protest in Germany against far-right extremism",
    "author": "donutloop",
    "subreddit": "socialism",
    "rank": 406,
    "score": 383,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.euronews.com/my-europe/2025/02/09/thousands-protest-across-germany-against-far-right-extremism-ahead-of-snap-elections",
    "id": "1ilb77j",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pacey1996",
            "body": "i bet at least 90% of them liberals. fascism is bad but not when Israel does it according to them.\nthere are almost no migrants at these protests. why? because they know that most of them are racist or look away",
            "score": 71,
            "replies": [
                {
                    "author": "lovecatsforever",
                    "body": "This was my feeling, too. And those who do oppose Israeli apartheid are too afraid to say anything.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "Manufacturing_Alice",
                    "body": "if you look at how arabs and muslims are seen in germany it’s very similar to the old fascism with the jews. it’s always been clear that germany never denazified.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "RagingMayo",
                    "body": "As a non-ethnic German, I totally agree. I stay away from these protests because they are organised by \"Anti-Deutsche\"/liberal Antifa groups and liberal to centre-right political parties like the Greens and the SPD (social democratic party). I would not be welcome there, if I would appear with a Kuffiya. These deadbeats would rather throw us migrants under the bus than to rethink their absolute devotion to the israeli-american imperialism.\n\nThe very ironic thing is that these \"against the right\" protests from last year were also organised by the centre-right party CDU (Christian Democrats) which is now toying with the idea to work with the AFD to push their neoliberal, racist agenda. These protesters have learned nothing from last year's protests. Even if the SPD and the Greens will collaborate with the other parties to deport immigrants, they would never see themselves as the villains in their own story.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "clickyclaws",
                    "body": "I don't understand how the rest of the world knows liberalism is also fascism but in the US liberals are celebrating deportations as some kind of punishment for the Left, but they'll turn around and act like they care about it, too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZeUhrWerk",
            "body": "As someone who went to one of those, yes they are attended by mostly liberals. But only pointing that out kinda misses the point. At least at the one that I went to there was also a sizable presence of leftist orgs and parties. \n\nThe speakers were often part of social organisation that frequently highlighted the fact that a large part of the issue are the underlying economic and social issues. There were open calls for the abolition of capitalism. They also highlighted multiple times that just attending demonstrations isn't enough and that people need to organise. These demonstrations are incredibly important because they reach an audience of liberals that might otherwise not really come in contact with leftist positions or grassroots social organisations that tell them they need to organise if they want to combat the far-right.\n\nI can't speak for all of the demonstrations across Germany of course but just saying that they're mostly liberals so it won't change anything is just seeing things too short. These are the people we need to reach and get organised and the demonstrations could help with that.",
            "score": 15,
            "replies": [
                {
                    "author": "Anxious-Tadpole-2745",
                    "body": "Correct me if I'm wrong but simply calling people liberals because they will stand arm in arm with working class folks against the far right is the beginning for possible left movement like you said.  That I agree.\n\n\nTheir opinions on Isreal is to be expected of liberals is it not? This is why leftists are there, to provide education and elevate class consciousness. Once they arrive at class consciousness, the Israel problem fades into the background as a cultural concern because it is.\n\n\nIsrael, is funded because the German government is captured by capitalism. However, it's chauvanism to assume that Israel will be halted through only socialism in Germany. China did not stop Israel nor do allies of socialist nations. And there's no guarantee that Germany will stop Isreal genocidal ambitions either. Only socialism from Isreal can bring freedom to Palestinian people's. Palestinian can not fight because they are captured by a deep religous culture war. Without socialism, they have struggled to effectively fight back for a long time. The lack of socialism in the middle east can not be ignored either. Though the deep historical involvement of anti left thought by western forces can't be ignored.\n\n\n\nThat is not for the German people to engage in what Mao called social imperialism. Israeli leftists need to come to class conscious. They are beginning to organize but have a far distance to go. Concerning ourselves in a fight that is not our own to force upon them something they do not want is the height of chauvinism and imperialism. Meanwhile the working classes of Germany are fighting the Israel within AFD. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Fascism bad unless you’re Israel. Then we support you.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Azzie18",
            "body": "Oh so now the apartheid backers are gonna preach to us. Fuck germany",
            "score": 8,
            "replies": []
        },
        {
            "author": "PoliticalGuy33",
            "body": "I'm actually scared of the upcoming election...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Real-Victory772",
            "body": "Meanwhile Americans are doing? Oh yeah, nothing.",
            "score": 2,
            "replies": [
                {
                    "author": "HaydenPSchmidt",
                    "body": "American liberals are too busy being proto fascists, American leftists are too busy being doomers, and American fascists are actively destroying the lives of millions around the world",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kartesia",
            "body": "I don't understand what the goal of these are especially when they aren't in power yet. Are there actionable demands? I feel like people already know both the intention of Afd and that there is a considerable 'progressive' populace in Germany. I feel like this would just embolden people to vote for Afd?\n\nI don't care about down votes I just would really like someone's perspective. In not saying marching against fascism is pointless it just has an air of liberal grandstanding especially in the face of Palestine.",
            "score": -2,
            "replies": [
                {
                    "author": "ouchycore",
                    "body": "I appreciate your curiosity and transparency. \n\n\nFrom my pov as a multiply marginalized crip, who did not attend demos this year for health reasons, but who sometimes does and appreciates everyone who shows up: the demos provide us with hope (and thus strength), solidarity, connection and community, among other more and less tangible things. Many here are terrified and we are trying to reach enough people to change course, to prevent the far right from becoming even more powerful. \n\n\nDemands are as varied as the participants, but primarily focus on refusing cooperation with AfD as it poses a danger to our constitution and human rights. Attempts to ban the party have not succeeded thus far. \n\n\nI'm not sure about these particular protests, but based on those I have been at, there are also often other fights (or facets of a bigger fight) you can support with your signature. Organizations like Amnesty, but also individuals or small groups with a lesser-known concern or particular case of injustice have info material and petitions ready for you to sign, and new parties need a certain amount of signatures in order to qualify for the elections. A lot happens at demos.\n\n\nRegarding your closing remark, especially in the context of this river (or sea?) of comments in which it is embedded - in my experience, regardless of what people do in their activism, cynics always try to paint it as unproductive, naiive, 'merely' performative and so on.\n\n\nIn other words - I'm not saying bringing up Palestine is pointless. It just has an air of liberal grandstanding, especially in the face of Sudan.\n\n\n ",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}