{
    "title": "Given the new rise of fascism, will socialism become more prominent during the next decades as a reaction to it?",
    "author": "LancaLonge",
    "subreddit": "socialism",
    "rank": 348,
    "score": 299,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/socialism/comments/1inv93w/given_the_new_rise_of_fascism_will_socialism/",
    "id": "1inv93w",
    "selftext": "Basically what I asked in the title.\n\nWe know fascism and the far-right in general have been on the rise and it's only getting worse. In a few years they may rule many more countries than they currently do.\n\nDo you see socialism rising and having a comeback as a reaction against fascism?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharlieMartiniBrunch",
            "body": "It will absolutely and accidentally grow in the west. The question is whether history will repeat itself (as it usually does) and be quashed by capitalism before it can develop strong roots.",
            "score": 228,
            "replies": [
                {
                    "author": "TakenUsername120184",
                    "body": "*sweats in Marxist*",
                    "score": 90,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zachbutastonernow",
            "body": "You have to stop thinking that movements will spur from the population because it has happened before.\n\nHistorical trends can predict things like that, but when everybody is expecting it to happen because other people will do it, they don't call to action.\n\nThose things happened because people like you or us took action in reaction. We have to be the reaction. \n\nA really problematic shift in the internet age is that people now hold their image of the future based on what they think others will do rather than on their own actions. We perceive our actions to have limited effect (which might be that we have a more accurate perspective of it) and then do not act. \n\nRattle your chains, throw sand in the gears, and most importantly try to organize others to do the same. Don't sit back waiting for \"the inevitable revolution\" because it's only inevitable if we all stop waiting.\n\nRattling your chains doesn't have to mean pulling a luigi (although that is amazing if you have the guts). It can be as small as organizing a free breakfast program. Capitalists need the threat of starvation to survive, if you can find a way to feed and house people it throws sand in the gears and can change people's lives.\n\nAny successful movement will need to also serve it's community. The Black Panthers had clinics, breakfast for children, jobs, and did all kinds of other things to build their communities. Not only is this important just because of what it is, but it also builds the image of the revolution and shows people what communism is about.",
            "score": 67,
            "replies": [
                {
                    "author": "Automatic-Pop-9636",
                    "body": "Fk man.. In trying so hard to organise in my city, mutual aid, activism, collective knowledge building but its do hard. Almost everyone has a cop and a normaliser in their heads. Anyone who doesnt, is burnt out physically and legally. But yeah.. Just keep experimenting until something sticks",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Invalid_Pleb",
            "body": "Fascism and other right-extremist views aren't an organic response to liberalism. They are propped up by elites who either are fascists themselves or who view fascism as something they can control, and therefore push for it.\n\n\nSocialism on the other hand doesn't have very many elites willing to shill out constant propaganda for it. The result is that the right wing usually wins the propaganda war. It's totally possible that people never realize that the right wing isn't on their side or that every socialist movement just gets astroturfed or destroyed. We can't just sit around and hope that people are going to come over to our side when there are incredible forces trying to stop them from doing that constantly.",
            "score": 91,
            "replies": [
                {
                    "author": "theangrycoconut",
                    "body": "I don't see why fascism being held up by elites and fascism arising organically out of liberalism are mutually exclusive.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Darth_Inconsiderate",
                            "body": "This guy dialecticizes",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Angrydroid21",
                    "body": "Sadly without a strong counter the to propaganda and brainwashing it can takes years of effort to just make one person even consider the idea. I know I have been trying for 4 years with a centrist friend.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Glum_Reaper",
            "body": "Depends. \n\nFor change to occur, people must fight for it.",
            "score": 25,
            "replies": [
                {
                    "author": "Angrydroid21",
                    "body": "And to fight takes time and energy to prepare, engage, respond and recover. Capitalism keeps us exaughsted. So to start the fight we have to start by making sure we can feed and shelter ourselves and others. Lucky for us capitalism keeps giving us chances at this. Help out at your local food bank, homeless charity, medial charity, anywhere capital has left destroyed lives.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "FernandoMachado",
            "body": "as long as rivers of capitalism are still running, fascism will always be at its borders.\n\nsocialism requires the rivers to understand they are rivers and come together to shape a new ocean.",
            "score": 33,
            "replies": []
        },
        {
            "author": "balrog687",
            "body": "climate collapse will come first with a very high probability",
            "score": 9,
            "replies": []
        },
        {
            "author": "Serious-Cap-8190",
            "body": "It's likely.  As the US grows more isolationist I would expect China to step into the resulting power vacuum, at least when it comes to international aid and overall soft power projection.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Dazzling-Screen-2479",
            "body": "Its reverse. Fascism is a reaction to the rise of struggle.  A lot of people don't remember that very recently much of parts of europe like Greece, and Spain were facing workers insurrection. In the country sides you'd see miners on strike shooting improvised rockets at police as the city centers were filled with anarchists and marxists who clashed with authorities. These trends grew. The decentralized nature caught authorities off guard, and the style of militant or mass civil disobedience spread to America in recent years after with occupy and anti police uprisings, each wave becoming more and more militant under obamas presidency. \n\nSources:\n\n[uncut footage 1](https://youtu.be/9ICMOee25UM?si=f2bm5lziTdwfZr2f)\n\n[Media report](https://youtu.be/1Qmb2LNCPzM?si=2mtD7vHKGF1eflGS)\n\n\n[raw footage of the type of occurrences going down in city centers at the time](https://youtu.be/ieXrS3jvbUI?si=0goANSAY2anKSkXj)\n\n[a few years prior, in athens](https://youtu.be/Cdb3D-wJ3jg?si=-G47N36IboSyvwCm)\n\n\n\nThe fascists openly begin their reactionary propaganda campaign against agitators:\n\n\n[source 1](https://youtu.be/ZKyi2qNskJc?si=hpB4dw-c-KakDLbg)\n\n[source 2](https://youtu.be/45UfIEIU14w?si=gD7YUrGIEtyCIrO5)\n\n\nAny growth of socialism you see in these times do not come from fascism. It comes from agitation and organizing. The contradictions of capitalism will lead to a growth in socialism if people continue to expose these contradictions properly.",
            "score": 8,
            "replies": []
        },
        {
            "author": "The_Jousting_Duck",
            "body": "I think it's a little more complicated than that. Neoliberal policies have definitely left the working class behind, which has already nearly killed the Progressive and New Deal Liberal movements. But most people disillusioned with the Liberal establishment will either be pushed left or right by it, which definitely set the stage for the current rise of fascism, but it's also already been driving people towards socialism. If anything, I'd say it's setting the stage for a confrontation between those 2 fundamentally opposing forces",
            "score": 5,
            "replies": []
        },
        {
            "author": "bobak41",
            "body": "Yes.....but things will get worse....much worse before your avg. Joe understands what's happening.",
            "score": 4,
            "replies": []
        },
        {
            "author": "tryagainin47seconds",
            "body": "I feel like the argument could be made that there has been an ongoing rise in the US left here in the last 20 years with increasing protests and civil unrest as a direct response to the bang up job that capitalism has been doing so far and now all this Fascism is a reaction from the private sector to use this volatile moment for their own gain.",
            "score": 7,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 11,
            "replies": [
                {
                    "author": "socialism-ModTeam",
                    "body": "Hello u/OkHeart8476!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Submisison not high quality enough:** We don't expect you to write a dissertation, but one liner posts with no clear socialist construct do not help contribute to the foundational objective of r/Socialism; a community for socialists under an uniterrupted, critical socialist analysis which promotes valuable discussion.\n\n>Please consider re-sumitting your comment from a more developed, critical perspective.\n\n\n\n- r/socialism's mod team.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HeadDoctorJ",
            "body": "Just finished Revolutionary Left Radio’s new podcast about mask-off oligarchy in the US leading to a breaking point, and to your point, he also talks about the rise of resistance in the face of oppression. It’s only 28 minutes. Great pod for anyone who is interested in the progression of fascist techno-feudalism, what to expect, and how to fight back:\n\nhttps://revolutionaryleftradio.libsyn.com/red-hot-take-the-dawn-of-techno-feudalism",
            "score": 3,
            "replies": []
        },
        {
            "author": "ThrowRA-Two448",
            "body": "I'd say no because socialism and fascism are both ideologies which emerge during the times of need, times of economic crysis.\n\nThe West sure as hell is experiencing economic and cultural crisis... rich have suppressed socialism.\n\nSo we are getting fascism instead.",
            "score": 4,
            "replies": []
        },
        {
            "author": "duggtodeath",
            "body": "No. The political systems and their structure are designed to reward fascist candidates and behavior. Under that system, even the best opposition candidate cannot change much. Further, whoever controls the media controls the outcome. You have to basically get oligarchs on your side and thats not happening. The only thing to do is tear it down and build something equitable.",
            "score": 5,
            "replies": []
        },
        {
            "author": "WAU1936",
            "body": "Socialism won’t rise again on its own. And it shouldn’t simply be a reaction against fascism, or even capitalism. It should stand for an alternative and keep striving for it. I believe among the horrible conditions around us, there are some glimmers of hope. People are way more upset and disgruntled with the status quo than the past. For now the far right has capitalised on this and emerged as the only alternative to the establishment, but with work and organized action the narrative can shift. Already, there is partly a certain desire for putting class conflict more prominently on the agenda.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdhesivenessEven7287",
            "body": "Theoretically yes. But I believe the left wing clearly failed to keep away Trumpism and this rise of fascism. Therefore there should be a large collective uncensored 'back to the drawing board'",
            "score": 2,
            "replies": []
        },
        {
            "author": "alig98",
            "body": "The Social Gospel movement (socialist Christianity, preached that having wealth when others are suffering is immoral & was led by socialist presidential candidate Eugene Debs) was POPPING during the late 1800’s/early 1900’s as a response to rising wealth inequality and is largely credited for the leaps in workers rights/mass unionization around that time. Too bad it was squandered by oligarchs who funneled all of their money into bribing churches and pastors to teach “Prosperity Gospel” (God rewards good people with money, tithing is mandatory) instead, which dissolved the movement by the 40’s. They literally invented 4th of July as a nationalist response to try to squander the movement and it worked (seriously look it up, it’s wild). For more info, I’d highly recommend Behind the Bastards series “How the Rich Ate Christianity”. Super fascinating, but with how much control these technocrats have, I’m unsure if the response will reach these prior levels :/ But it is definitely common response to rising fascism and has happened in our country before.",
            "score": 2,
            "replies": []
        },
        {
            "author": "shrekoncrakk",
            "body": ">will socialism become more prominent during the next decades as a reaction to it?\n\nWe're watching it unfold, currently. \n\nThe current U.S. president is a direct result of the desperation of a population that is largely too prideful to admit that it's been deceived/convinced to trade it's own current and future prosperity for the chance to strike back at enemies that never existed.\n\nThe common people of the West become increasingly aware of China, the success of market socialism in providing affordable and fulfilling lives for it's citizens, the success of U.S.-brand capitalism of depriving it's own citizens of such prosperity.\n\nDeepSeek and Omnihuman are just the latest subversions of western tech (power). BRICS adds new members seemingly every other week. \n\nIt's been going on for years. People are paying closer attention every day. The illusion fades at an accelerated rate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LordovVengeance666",
            "body": "I'll say it definitely will become more prominent in the coming decades but all socialist organisations across the world must work together to push back against fascism and any other right wing nonsense and capitalism as well but we also need to keep being prominent even when fascism has been defeated",
            "score": 2,
            "replies": []
        },
        {
            "author": "FreesponsibleHuman",
            "body": "Move now. Move fast. Millions are about to be disillusioned. Let’s create an Enlightened Alliance of the New Left to oppose and counter the Evil Axis of the Far Right. Socialists, environmentalists, progressives, the Green Party, the CSA, and every languishing actually leftist organization out there. Unite our voices and paint a vibrant picture of a future with social and ecological justice for all! \n\nPeople and Planet over profits.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LetMePushTheButton",
            "body": "It’s socialism or barbarism.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lexicon101",
            "body": "Fascism is a reaction to socialism and anarchy threatening the hegemony of capital, socialism is not a reaction to fascism.\n\nSocialism is a political project that aims for the democratization of political power and is a reaction to a recognition of the class conflict responsible for strife, and is not dependent on the presence of fascism.\n\nFascism is a reaction to this process specifically, forming around a strong man or party recognizing the strife happening and the frustrations inherent to that, and blaming minority groups for the failure of society to deliver on its promises, especially to a historically privileged group who ultimately never had real power over their situation.\n\nSocialists always rise against fascism, but while socialist tendencies might be made stark by impending fascism, they're also made more risky by fascism, so people are just as likely to preserve themselves by keeping silent as they are to stand up and actively resist. We can't count on the looming specter of fascism to drive recruitment.  The only way a socialist movement happens is by willful, intentional effort.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CataraquiCommunist",
            "body": "Yeah but not for a long time. We still have to go through a phase of liberal reactionaries who think they can “set things right again”. That will inevitably fail, then will come a period of mass disillusionment at both liberal/social democrats and fascist regretfuls on a meaningful scale. After the faith in the old institutions and their mythology is lost and the despair period passes, there’ll be a return of socialist thinking in the popular mindset.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sakodak",
            "body": "It's an uphill battle in the West after over a century of anti working class propaganda. \n\n\nIt is the duty of every class conscious worker to try to spread it.  It's not going to spread itself, especially in the face of ongoing propaganda.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DullPlatform22",
            "body": "Not if socialists don't get better at messaging",
            "score": 1,
            "replies": []
        },
        {
            "author": "LotusEaterEvans",
            "body": "It needs to come in a strong package and if a leader can strong arm us into it the way we’re being strong armed into fascism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "apitchf1",
            "body": "This is the appropriate response that the Dem party needs. It needs to be taken over by the a true left party and stop trying to be diet republicans. \n\nIt is primed (at least with the average working person) to be a dramatic change and force against the far right\n\nr/newdealparty",
            "score": 1,
            "replies": []
        },
        {
            "author": "Automatic-Pop-9636",
            "body": "Hasn't socialism had its run? Multiple times.. Perhaps its time to actually try anarchism... Just saying...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent_Body_4576",
            "body": "Fascism was a bourgeoisie reaction to socialist uprising.",
            "score": 1,
            "replies": []
        },
        {
            "author": "communistgamerchic",
            "body": "The books technofeudalism and surveillance capitalism say otherwise… I believe that we aren’t necessarily living in capitalism, but a form of crony capitalism. \n\nNonetheless, I don’t feel confident that socialism will be the next order as Marx predicted, I do agree with the book techno feudalism that we are entering an economic system which is controlled by tech billionaires, rather than individuals which own the means of production.",
            "score": 0,
            "replies": [
                {
                    "author": "OriginalBeast",
                    "body": "This is the dangers of relabeling things. Capitalism is the same thing as crony capitalism. There is no difference other than the amount of contradictions, the core contradictions remain they just look slightly different over time as no system remains the same through time.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "communistgamerchic",
                            "body": "I agree with this. I don’t see a world where capitalism is implemented to truly promote equality and fairness. It’s an oxymoron.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nesphito",
                    "body": "I could see techno feudalism being the next form of government and it seems to be the natural transition of capitalism.\n\nIt’s  something early socialists failed to foresee. I think it will lead more people sympathetic towards socialism.\n\nI think Elon, JD Vance, and Peter Thiel idea of splitting up the US into tiny serfdoms won’t come without pushback. I think anarchy and socialism has a chance of taking foothold on some places if they actually end up attempting something like that.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "drbirtles",
                    "body": "I agree. I don't think Marx, or anyone else, could have predicted technofeudalism or the rise of digital space in the last 40 years, so I can forgive the fact that we have to readjust how socialism can be implemented and educated in a realm where the means of production are somewhat directly tied to digital commerce.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dxmndxnie1",
            "body": "That’s our hope. A multiracial working class lead revolution against the billionaire ruling class of tech oligarchs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Honeydew9251",
            "body": "No, the opposite",
            "score": 0,
            "replies": []
        }
    ]
}