{
    "title": "Moroccan workers fight back against “anti-worker” bill",
    "author": "HikmetLeGuin",
    "subreddit": "socialism",
    "rank": 338,
    "score": 33,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://peoplesdispatch.org/2025/02/13/moroccan-workers-fight-back-against-anti-worker-bill/",
    "id": "1ioo27j",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "HikmetLeGuin",
            "body": "Solidarity with the class struggle of Moroccan workers.\n\n\"On February 5 and 6, workers in Morocco went on a general strike to protest the passage of the strike law, the high cost of living in light of soaring prices, and unprecedented tension between trade unions and the government.\n\nThe general strike was called for by five central unions: the Democratic Confederation of Labour, the Moroccan Union of Labour, the National Union of Labour in Morocco, the Federation of Democratic Trade Unions and the Democratic Organization of Labour, in addition to a number of professional and sectoral organizations and unions.\n\nThe participation rate on the first day of the general strike reached 84.9%, according to the Moroccan Confederation of Labour, one of the largest trade union centers in Morocco, stating in a statement that “the wheels of production and movement stopped in all components of the economic fabric, including the service, agricultural and commercial sectors, and in all institutions, departments and services in the public service and ministerial sectors.” Educational institutions at various levels and fields were “completely paralyzed,” and the strike included vital and strategic sectors, production and services, both public and private.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "hoopnet",
            "body": "80% that’s amazing. People dont even strike anymore in Aus",
            "score": 3,
            "replies": []
        }
    ]
}