{
    "title": "What does this sub think of Keyu Jin and her “New China Playbook: Beyond Socialism and Capitalism?”",
    "author": "Whinfp2002",
    "subreddit": "socialism",
    "rank": 331,
    "score": 7,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/socialism/comments/1ip5edn/what_does_this_sub_think_of_keyu_jin_and_her_new/",
    "id": "1ip5edn",
    "selftext": "Is she a Dengist or a glorified social democrat? Is her book a good resource on learning about China? She does seem to be very supportive of Dengism and its sucess as an alternative to American capitalism. But she does purpose further market reforms in the financial sector. So it seems she really is wanting an Asian Nordic Model. Is this fair? I haven’t read it yet. Is it worth reading?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been identified as being related to the People's Republic of China due to containing the following keyword: China.\n\nDue to this subreddit's long-term experience with PRC-related threads, [low effort discussion will not be permited](https://www.reddit.com/r/socialism/comments/l5ccjb/topics_of_contention_raising_the_quality_of/) and may lead to removals or bans. Please remember that r/Socialism is a subreddit for socialists and, as such, participation must consist of conscious anti-capitalist analysis - this is not the place to promote non-socialist narratives but rather to promote critical thought from within the anti-capitalist left. Critques are expected to be high quality and address the substance of the issue; ad hominems, unconstructive sectarianism, and other types of lazy commentary are not acceptable.\n\nPlease keep in mind that this is a complex topic about which there may be many different points of view. Before making an inflamatory comment, consider asking the other user to explain their perspective, and then discuss why specifically you disagree with it.\n   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "dbadsh",
            "body": "I think her book is refreshing in a lot of ways, and I say that as somebody who has lived in China for a long time and works in a tech/IP/law-heavy professional field. I liked it specifically because it’s one of the few English-language books that have gotten wide release, but are not dogmatic, and give you some actual insight into how things are playing out here.",
            "score": 3,
            "replies": [
                {
                    "author": "Whinfp2002",
                    "body": "I’ll read it.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}