{
    "title": "The Age of Surveillance Capitalism",
    "author": "LuisCaipira",
    "subreddit": "socialism",
    "rank": 299,
    "score": 32,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.ember-red.com/the-age-of-surveillance-capitalism-introduction/",
    "id": "1iqe9zh",
    "selftext": "Hello everyone!\n\nI started a blog a few weeks ago, and this is my first post!\n\nPlease, check it out!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "hmmwhatsoverhere",
            "body": "I gave up on this book very quickly. It is clear from the author's language that she is a liberal whose analysis is fundamentally rooted within the logic of capitalism.\n\nFor example she repeatedly talks about a form of \"rogue capitalism\" - thereby implying that if it weren't \"rogue\", if it were perhaps \"regular\" capitalism instead, then it would be fine. Even if that isn't her intent, using \"rogue\" to scare the reader is regardless a superficial rhetorical trick at best. I rolled me eyes every time she did it.\n\nFundamentally the problem is capitalism. There's nothing \"rogue\" about the techno-neoliberalism her book is about. If she gets that core part of her analysis wrong, I can't trust anything else she says.\n\n\nShe also seems historically underinformed about the surveillance efforts of capitalists and their governments, who've been making extensive lists of communists and their daily habits around the world for a very long time to initiate genocides, Red Scares, strike suppression, etc. Yet she pretends the material in her book is unprecedented. It's an active erasure of history.",
            "score": 18,
            "replies": [
                {
                    "author": "Short_Explanation_97",
                    "body": "dammit, i just bought this upon recommendation from a fellow leftist. i’ll give it a shot, but damn. thanks for your analysis, comrade.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "anachronissmo",
                            "body": "Its worth digging into IMO even if doesn't 100% align with your politics. Good background on the development and implementation of the modern day Panopticon as created by Google in the early 2000s and its implications for society at large. Even if Zuboff isn't a Marxist, there is still plenty of useful takeaways",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "hmmwhatsoverhere",
                            "body": "Who knows, you might get more out of it than I did! I stopped after about 1.5 chapters so maybe her analysis improves later in the book. If so, it would be great if you could report back here!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "hmmwhatsoverhere",
                            "body": "I don't know of any good books that are topically very similar. But if you break her argument into its component pieces it's basically a very narrow critique of neoliberalism coupled with a very narrow critique of surveillance, so I'd recommend books that deal with those.\n\n\nFor the former, my favorite analysis of neoliberalism is a chapter in *What is antiracism and why it means anticapitalism* by Arun Kundnani. It lays out the popular myths regarding neoliberalism, the actual history and intent of its creators, the standard Western Marxist analysis given by people like David Harvey, and an expanded version covering colonial activities.\n\n\nFor the latter, a great starting point is *The Jakarta method* by Vincent Bevins which details (among other things) the efforts a capitalist government will put into monitoring millions of citizens *of other nations* (let alone its own).\n\n\nFit the two concepts together and you've already got a broader and better fundamental understanding than Zuboff seems to.\n\n\nYou could argue a third key component of her argument relies on modern digital technology, and I haven't found any great books dealing with that from a socialist perspective. But I think that's a misguided argument in the first place. Hoover was keeping track of hundreds of thousands of union organizers, immigrants, socialists, etc on index cards in the early 20th century. As far as surveillance goes, modern tech just allows for way more detailed data gathering on way more people, rather than introducing anything fundamentally new to the surveillance equation.\n\n\nOn that note, Zuboff also praised Henry Ford in this book, which is ironic because he spied on his own employees extensively so he could fire them if they were gay, for example. She just seems totally self-unaware of her subject matter.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LuisCaipira",
                    "body": "I don't see a problem in reading from a liberal if they have a valid point. Yes, every now and then she brings the idea that this new form of capitalism need to be \"tamed\".\n\nAnd I don't see her as historically uninformed at all, the surveillance part is not about governments spying on people, but a form of extraction of our intimacy and creating a market for it.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "hmmwhatsoverhere",
                            "body": "The problem isn't her being a liberal writing on some random point, like why frogs are green. She's a liberal making a critique of capitalism from within the framework of capitalism - in other words, as a liberal. A socialist sub is not an appropriate place for liberal critiques of capitalism. It's literally against the sub rules.\n\n\nObviously multiple people in here have said they mistook this for a socialist text. I wasted nearly two hours of my life reading this thing because I was misled into thinking the same.\n\n\nThat's why I made my comment: To save time and energy for people coming in here expecting a book rooted in socialist thought.\n\n\n>surveillance part is not about governments spying on people\n\n\nMy statement was \"capitalists and their governments\". The governments of capitalists do what they do for the sake of capitalists. *The spying is for capitalists.* Don't pull random words away from their critical context and use them to pretend I said something else. It's extremely rude.\n\n\n>but a form of extraction of our intimacy\n\n\nThat is what spying is.\n\n\n>and creating a market for it\n\n\nYes, exactly. They are doing capitalism with the things they spied. You see how we're right back to what I said?\n\n\nHonestly you shouldn't be arguing points like this in this sub. I'm not trying to be mean, I'm just being honest. This is the wrong sub for liberal logic. I'm not reporting you because I believe in dialogue over alienation. But that dialogue does not extend to debating a liberal author's views on capitalism in a book where she praises Henry Ford and leads people down mudholes thinking neoliberalism is \"rogue\" capitalism. I will not be responding to this further.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}