{
    "title": "Anarchism Discussion Thread for February, 2025",
    "author": "AutoModerator",
    "subreddit": "socialism",
    "rank": 281,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/socialism/comments/1irkhub/anarchism_discussion_thread_for_february_2025/",
    "id": "1irkhub",
    "selftext": "This is a thread for all anarchism-related themes. Feel free to discuss your struggles, your frustrations, your joys, and whatever else is on your mind here.  \n\nYours in solidarity, until the robots rebel.\n\n\\- Automod",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lotus532",
            "body": "I don't know if this comment will be removed, but I just wanted to get this out there. I think that anarchism is widely misunderstood by many of its critics, even in the broader socialist movement. From my years of being an anarchist, I have noticed that many of the critiques of the philosophy from people outside of it are lacklustre. The main reason being that they often don't come from a place of constructive good-faith critique, but instead with the intent on discrediting anarchism and pushing further into the margins. A lot of the arguments against anarchism (especially from Marxists) rely on whatever clichés and talking points stem from what Marxist theoreticians (like Engels, Lenin, Trotsky, etc.) have said about the anarchists of their time, a lot of which are useless and don't adequately address anarchist ideas.",
            "score": 1,
            "replies": [
                {
                    "author": "Dazzling-Screen-2479",
                    "body": "That's because a lot of anarchists (and marxists) have a base level appeal to classical anarchism and Marxism. They become attracted to anti capitalist or anti authortarian slogans but never delve deeper.  How many young anarchists will quote bakunin but ask who's that when talking about Lorenzo Kom’boa? Anarchism in America, if not for black anarchists and PoC would be nothing more than a white social club using the imagery and slogans of historic anarchism whilst being disconnected from the class struggle they took part in. The only reason American anarchists began to get their shit together as a movement was the black organizers critiquing their praxis and theory",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}