{
    "title": "Liberals couldn't figure out why the quality of cinema is declining!",
    "author": "Ok_Cherry_6258",
    "subreddit": "socialism",
    "rank": 219,
    "score": 67,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/socialism/comments/1iue0ib/liberals_couldnt_figure_out_why_the_quality_of/",
    "id": "1iue0ib",
    "selftext": "Someone asked a good question [in this thread ](https://www.reddit.com/r/CasualConversation/comments/10ijg3k/is_there_a_scientific_explanation_for_why_newer)about why newer movies suck, but unfortunately the comment section was trash. This is a good post to show people who think Reddit is very left-wing. I think it's interesting to analyse the excuses people make for capitalism: \n\n1. The number one reply was \"survivorship bias.\" This seems typically buzzwordy for liberals. Apparently, OOP was forgetting that most movies of the past weren't good, or perhaps they're simply not finding the good movies produced in the here and now. *If that was the case, then why are movies in the same franchise as those produced in the 80s worse now, despite all the technological advances? Why is Jurassic Park amazing but Jurassic World quite forgettable? Even though I enjoyed the latter.* This is such a lazy excuse for capitalism. If the quality of media declined under socialism, every person in this thread would be all over it. Apparently, under capitalism one must blame themselves for the system's failure to provide economically, *and* it's also an individual problem when the quality of media declines. One has to pull themselves up by their bootstraps and find supposedly good indie media lol. Never mind the fact that you need to go in search of indie media is one of the signs that media in general has declined. \n2. Another typical reply was that OOP preferred older movies (such as Shrek vs modern kids films) more because it's nostalgic. I'm 25 and I have zero nostalgia for e.g. Labyrinth, Drop Dead Fred (I watched these as adults) and they are clearly better films than what is produced today. I grew up watching Scooby-Doo films produced in the 2000s/2010s, but they are nothing compared to the ones from the 80s and 90s despite the lack of nostalgia factor for me. 80's and 90's Scooby Doo had stories about 'real' monsters (the Zombie Island & Witches Ghost), the characters being zapped into a video game, the Hex Girls, weird monsters who worshipped cat gods because they were French settlers and their village was killed by Louisiana biome pirates, they used magic wax to make voodoo dolls, and the zombies were the good guys lol. Versus 2004 Scooby Doo and the Loch Ness monster.... Which was pretty predictable and boring: a huge decline in story quality in just 6 years. *Generally, people prefer media from their childhood (especially when we're discussing kids movies specifically), but the nostalgia factor doesn't hold when young people prefer media from decades before they were born to media from their childhood. I'd take most 80s things over 2010s things in a heartbeat.* \n3. In the same vein, the comment section is \"ok boomer\"-ing OOP for their \"glory days nostalgia.\" This is because liberals never try to understand left-wing arguments, they just say buzzwords to be performatively 'woke'. That's why they'll call people misogynist for hating Kamala Harris for supporting/not opposing Gazan genocide. They just generally have no idea what's going on. Liberals don't understand that \"ok boomer\" was a reaction to being blamed as an individual for systemic economic decline. It's also a reaction to people who hate seeing social progress, such as more female or black leads in media. \"ok boomer\" doesn't make sense when someone is critiquing how life has declined under capitalism, even though OOP doesn't know that they're essentially asking that. With this reply, they become the boomer, because they're gaslighting people into believing that they're individually at fault for the systemic decline in quality of life under capitalism. \n4. Lastly, some comments blame a \"woke agenda,\" showing the true colours of how 'liberal' the average person is. Interestingly, while commenters \"ok boomer\"-ed OOP, which was misplaced defence of modern media (perhaps because they assumed OOP hates anything modern because it's not chauvinist like the past, etc.), no one critiqued \"woke agenda\" comments. Liberals showing what they really are: critiquing leftists endlessly, leaving fascists alone. \n\nOne person mentioned an interview with Matt Damon, someone who actually knows what he's talking about, and Damon revealed the true cause (which is, of course, economic): streaming services have killed film sales, so there is greater emphasis on performing well at the box office. Movies don't get a 'second chance' at doing well financially. Therefore, filmmakers take less risk (hence the endless sequels, prequels and remakes). Rather than incentivising innovation, capitalism has incentivised the opposite. The advent of streaming services roughly corresponds to when movies started to become poor, especially when streaming became more mainstream: 2000's movies were still pretty good, 2010's movies were forgettable, and 2020's movies are largely garbage. \n\nCasualConversation is like a circle jerk of white guys in their 30's down the pub, who of course have libertarian tendencies. If I were to ask a question, the comment section shows how I would get mansplained & piled on with arguments designed to sound clever (\"survivorship bias\"), but are absolute trash if thought through for more than 2 seconds. And this post is how someone would reply to that circle jerk if they weren't be spoken over aggressively, as politics is about winning a fast-paced debate, rather than the quality of ideas, much like the fast food cinema we consume now.",
    "comments": [
        {
            "author": "Frigginkillya",
            "body": "Yeah capitalism asks it's believers to do so much to prop it up\n\nSo many mental gymnastics we're all Olympic athletes at this point\n\nIt's so insidious that it's able to blame its failures on those forced to participate in it",
            "score": 15,
            "replies": []
        },
        {
            "author": "dude_chillin_park",
            "body": "But TV is better than it used to be. When I was young, TV was invariably pulp, while movies could be great art. TV can now be great as well. (An artistic show like Twin Peaks, 1990, disintegrated into low-quality pulp before a redemptive finale, but the third season make in 2017 was unapologetically avant-garde.)\n\nThe demand for entertainment and the bubbling of artistic inspiration may not be exactly finite, but there's a rough limit of how much time people want to spend watching, and how many people want to spend their careers filming. Much of the talent has shifted to TV in order to better reach viewers. Capitalism mediates the relationship, even though it's ultimately driven by artistic libido.\n\nThe material realities of streaming favor artists to tell serial stories. A customer is more likely to keep paying for a service that hooks them into long form stories rather than two-hour stories, considering many of us spend one hour scrolling through choices each time.\n\nThere are still great movies made, just as there are still great novels written. But the zeitgeist is in TV-- in fact, it's very nearly in streaming, but I'm not sure we have seen Great Art yet in that format. Point me to it, if it exists!\n\nThe balkanization of music is fascinating, as well.",
            "score": 21,
            "replies": []
        },
        {
            "author": "HikmetLeGuin",
            "body": "There are good movies now and were good movies in the past. There are bad movies now and were bad movies in the past. Often, the best movies aren't the mainstream films, and they aren't produced in the US or performed in the English language. \n\nSo I wouldn't make any broad, generalized claims about cinema today vs. in the past, because if you look for great films now, you can find them, but they just aren't likely to be the Marvel Hollywood blockbusters.",
            "score": 12,
            "replies": [
                {
                    "author": "Nylo_Debaser",
                    "body": "There is an actual difference in how studios operate now though. During the New Hollywood period from the mid 60s to the early 80s there was a brief period during which director-led artistic cinema was a major focus for studios and such films were given enormous budgets. This lead to movies like The Graduate, Bonnie and Clyde, Taxi Driver and so many more. For a time directors had more power than producers and executives and because of this the quality of movies produced was genuinely higher. After a few financial failures the producers and execs seized control again. Since then the focus has been on money and not quality cinema. There is massive risk avoidance, which is the primary driving factor behind the endless remakes, reboots and MCU films. Although good, auteur-type movies are still made now they almost never have big budgets and have to be produced by smaller companies because the big studios will no longer commit budget to what they consider higher-risk artistic films. Artistic creation has generally not been centred in Hollywood but there was a brief period where it was. Funny enough this period coincides with the period when America had its strongest education system and when the fairness doctrine was still in place.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "HikmetLeGuin",
                            "body": "I think you're right about US cinema. I guess my point is that we shouldn't fixate too much on mainstream big-budget American cinema if we're looking for good stuff, because there's a whole wider world out there that sometimes gets ignored. But your point about changes in Hollywood is valid.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}