{
    "title": "It's time to view each Human as a cell in the body of Humanity as a larger organism.",
    "author": "GiftToTheUniverse",
    "subreddit": "socialism",
    "rank": 128,
    "score": 4,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/socialism/comments/1iyyqg9/its_time_to_view_each_human_as_a_cell_in_the_body/",
    "id": "1iyyqg9",
    "selftext": "Humanity simply must ascend beyond using money.\n\nTrading our lives for chits is old-think.\n\nEveryone is afraid that AI will take their jobs. We shouldn't be afraid of it. We should embrace it. And seize AI from the forces that seek to use it against us.\n\nIt should surprise no one that the billionaires are ready to reduce the numbers on Earth by any means necessary. Wars. Drugs. Violence. Diseases. Suicide.\n\nThey just want fewer people so they can keep all the abundance for themselves as the Earth passes the Climate Catastrophe tipping point.\n\nThe Great Depression will look like nothing but a missed dessert if we don't let go of the profit motive and start seeing our neighbors as exactly as deserving of ourselves.\n\nWe have to stop feeing ourselves comforting lies about how and why WE deserve to be okay while those around us wither and starve.\n\nWe need to value each other more than we value the bottom line in our bank accounts.\n\nWe are being controlled by money. Money we never even see anymore. Money that is nothing but a number on a computer screen that is constantly drained by ever increasing fees and new expenses that didn't even exist last year.\n\nWe could keep things running okay by evaluating what we do all day long and determining: is that a service to Humanity or is it a drain? All the people working at insurance companies, banks, finance, advertising... none of that is to benefit Humanity.\n\nWe need to view ourselves as cells in the body of Humanity as a larger organism.\n\nWhen a cell starts to divide out of control just to hog up more and more resources without forming tissues that benefit the larger organism then that is a malignancy.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sin_nombre__",
            "body": "How's the organising going?",
            "score": 2,
            "replies": [
                {
                    "author": "GiftToTheUniverse",
                    "body": "Most people are still asleep.  Fitfully, but asleep.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nikolaos-libero",
            "body": "\"GiftToTheUniverse\" is Sephiroth posting. Color me surprised.",
            "score": 1,
            "replies": [
                {
                    "author": "GiftToTheUniverse",
                    "body": "Feel better? Lol!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}