{
    "title": "Sandman on his WWE run: \"I hated it there. I had no friends. Everybody on TV wants to get as much time as they can but they had to tell me to stop going home early, always 5 minutes matches. And then finally, ref tells me ‘Dunn says DO NOT go home early.’ I went home early every single match.\"",
    "author": "djembadjembadjemba",
    "subreddit": "SquaredCircle",
    "rank": 4,
    "score": 877,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 163,
    "url": "https://open.spotify.com/episode/4AJeRTIHJx4rniNUDntquG",
    "id": "1je90iq",
    "selftext": "\"I hated it there, dude. I had no friends. It was soul sucking. It honestly was soul sucking to me. I hated to get on a plane. I hated to go there. I hated to be in the locker room. I couldn’t wait to get out of the f\\*\\*\\*ing building. Everybody goes on TV and they want to get as much time as they can. They had to tell me to stop going home early. I was going in there and giving him five minutes to go. And then finally … Kevin Dunn says down to maybe \\[Mike Chioda\\] – he goes, ‘Dunn says DO NOT go home early.’ I went home early every single match.”",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n**Help make SquaredCircle safer and more inclusive by using the report button to flag posts and comments for moderator review.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SquaredCircle) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JesseKilgannon",
            "body": "I’ll never forget when they inexplicably drafted him to Raw lmfao. Hiring a bunch of ECW guys and not actually doing ECW never made any sense. But at least we got that weird ass John Cena vs Sabu match on PPV",
            "score": 662,
            "replies": [
                {
                    "author": "AmishAvenger",
                    "body": "It’s because of the success of the One Night Stand PPV and the DVD documentary sales. \n\nVince thought he could bring in a bunch of ECW guys, and the ECW fans would tune in to see them. \n\nBut he didn’t want to do ECW. He thought he could convert those fans to become fans of his product. Which was pretty fucking stupid.",
                    "score": 379,
                    "replies": [
                        {
                            "author": "blaqsupaman",
                            "body": "The last couple of years of WWECW, it wasn't even a terrible show, it just had nothing in common with the original ECW, even less so than the first couple of years did. By 2008 or so it was essentially proto-NXT. The 2006-2007 show where they tried to make it a sort of half-WWE/half-ECW show without going all in on either direction just didn't work for either fan base.",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "ZestialFan07",
                                    "body": "Hey, nice flair!\n\n\nYou're right too. I hated it at the time but I now appreciate the proto NXT aspect but it's on them for not calling it literally anything else.",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "url290299",
                                    "body": "I agree that WWECW was the prototype for modern NXT. Guys like CM Punk, Kofi Kingston, The Miz, Evan Bourne, Jack Swagger, Zack Ryder and Sheamus all broke through in ECW, and probably got the TV exposure and experience that they wouldn't have got on RAW or SD. There were also many aging veterans there like Finlay, Hurricane, Goldust and William Regal to mentor the kids and get them over.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Panvich",
                                            "body": "I remember looking forward to Sheamus wrestling Goldust every week. I still can’ explain why I was invested in that series but damnit I was",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ShittyDBZGuitarRiffs",
                                                    "body": "I miss Goldust",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "beckett929",
                                            "body": "Ricky Ortiz and his rally towel!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LiamAddison",
                                    "body": "I think if it was called anything other than ECW it would have been fine, just being called ECW and being nothing like ECW just wasn’t it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mayy_dayy",
                            "body": "Black Saturday, Part II.\n\nWorked just as well (which is to say, not at all), as when he tried it in 1984",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "GregMadduxsGlasses",
                            "body": "I feel like One Night Stand kind of forced Vince's hand to try to capitalize on all those ECW talent, but realized quickly that they were not the types of guys to thrive in a WWE locker room. Hence why ONS quickly turned into like 8 ECW documentaries.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ok-Prompt-59",
                            "body": "He did convert a lot of those fans. WWE was the only wrestling promotion left. You either watched WWE or latched onto UFC and never looked back.",
                            "score": -44,
                            "replies": [
                                {
                                    "author": "AmishAvenger",
                                    "body": "Except Vince’s ratings didn’t go up when WCW and ECW got bought. In fact, they plummeted after WCW was gone. \n\nAnd there wasn’t a sustained increase once they started with the ECW stuff.",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "author": "ChewieBee",
                                            "body": "I stopped watching about that time and didn't come back until 2019. I missed a lot during those years but wwf coming out of the attitude era was pretty convoluted in my opinion. Also I was never a HHH fan and he was pushed to the top as stone cold was injured and the rock started doing his Hollywood stuff. The American badass gimmick was lame compared to ministry taker. Again, my opinions, but so much changed during that time and it took a little while for them to get their legs under them again.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok-Prompt-59",
                                            "body": "They’ve been decreasing ever since. Raw used to do 5.5 mil.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "TheIllustriousWe",
                                                    "body": "That was at the peak of a wrestling boom period, and more importantly, when there were vastly fewer entertainment options to compete against. RAW will never do 5.5 million viewers again because no cable show ever will again.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Ok-Prompt-59",
                                                            "body": "Cable shows still hit those numbers. Remember wrestling is considered “live sports”.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jb_82",
                    "body": "Apparently Vince really liked Sabu.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "arlenroy",
                            "body": "A lot of people did, because he'd do anything for the *business*, including working *seriously* hurt. Cena wanted to have a big match and put him over because Sabu worked for his dad, with a broken jaw. Like his jaw was taped to his face, there's a picture floating around with blood dribbling out of his mouth mid match, it wasn't wired shut. He super glued his lips shut around a straw. So he could drink protein shakes and smoke a joint, through the straw. Cena always respected him for that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RicFlairsLiver",
                    "body": "The early “hardcore” sub-era was one of my least favorite of the Attitude Era. They were not good at doing hardcore matches. Just threw in some random objects with no purpose and stole guys away from ECW just to sink it.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "SaddestFlute23",
                            "body": "Those guys weren’t *”stolen”* 😂\n\nThey wanted to get paid. \n\nCan’t pay your mortgage with hotdogs and handshakes. \n\nIf Vince hadn’t pumped money into ECW, it would’ve folded that much faster",
                            "score": 78,
                            "replies": [
                                {
                                    "author": "RicFlairsLiver",
                                    "body": "You’re right about wanting to get paid, obviously, but it was clearly a targeted attack. They couldn’t beat ECW with their lame attempt at hardcore, so what’s next? Take their top talent. Talent that they didn’t respect or have any plan for.",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "blaqsupaman",
                                            "body": "I don't think it was a \"Vince wants ECW out of business\" thing so much as Vince basically used ECW as a semi-developmental territory and also liked using the Paul Heyman relationship to influence his guys to go to WWF rather than WCW if either company was interested in someone.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "GregMadduxsGlasses",
                                                    "body": "Yeah. Vince basically subsidized ECW to keep their doors open because it was much cheaper than starting their own developmental fed. They weren't considered a real threat.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SaddestFlute23",
                                            "body": "Did you read my last sentence of my previous post? \n\nECW was struggling financially, without Vince’s help, the company was going under (it still went under anyway)\n\nIf Vince wanted those guys that badly, it was only going to be a matter of time",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "masterofpuppets8986",
                                                    "body": "Exactly.  He wasn't \"stealing top guys\" he was basically funding ECW as a feeder system for WWF.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Merrick83",
                                            "body": "They beat ECW in every conceivable way?  Ticket sales, revenue, tv, etc?",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "RicFlairsLiver",
                                                    "body": "Yes, obviously I said a billion-dollar corporation was in every way being beaten by a company performing out of a Philadelphia high school gym.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "author": "Distuted",
                                                            "body": ">They couldn’t beat ECW with their lame attempt at hardcore, so what’s next? Take their top talent. Talent that they didn’t respect or have any plan for.\n\n\"God Damnit, why can't we beat them at hardcore, we have every metric above them except the hardcore metric... we're just gonna have to steal the talent, that's the only way we can beat them at hardcore\"\n\nHow Vince talks in this guy's head",
                                                            "score": 22,
                                                            "replies": [
                                                                {
                                                                    "author": "Ambassador2Latveria",
                                                                    "body": "Why are yall acting like expanding your market share over the competition by putting additional focus into a previously not-prioritized niche is some wild and unheard of strategy. \n\nThere's so many business conversations on here that aren't looking at things through any sort of business lense. Which is fine until you start acting all douchey about it.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RicFlairsLiver",
                                                                            "body": "Thank you. That is a more zoomed out perspective of what I was saying.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "RicFlairsLiver",
                                                                    "body": "You joke, but that’s literally what he is like. There’s no other reason that he would take their talent. People like Sandman did not fit at all in WWF. And knowing how Vince liked big, muscly dudes, he clearly wasn’t that. None of them were.",
                                                                    "score": -9,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TonyTheTony7",
                                                            "body": "You do know that Vince paid Heyman regularly when ECW was still around, right? It was basically an intentional feeder system",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "RicFlairsLiver",
                                                                    "body": "No, I’d never heard about that. I’ll read up later.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SovietPropagandist",
                                            "body": "Vince and Bischoff both farmed ECW for developmental talent because Heyman was fantastic at taking guys and getting the most out of them. He just sucked at being able to keep them paid.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RomulanTreachery",
                            "body": "If Vince wanted to sink ECW, why was he pumping money into it?",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "TheyOllyOmar",
                                    "body": "Vince was secretly sending money to Paul Heyman during thr Monday night wars so that Vince could have first say who he wanted from ECW to come to WWF ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "VotingRightsLawyer",
                                            "body": "The first WWEID program.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SovietPropagandist",
                                    "body": "He wanted ECW around to continue mining it for talent, the same reason WCW wanted it to be around. Both companies constantly raided Heyman's roster after he would get them over. Raven going to WCW was probably the worst possible outcome for him and after he ended up there, ECW worked more closely with Vince and there was a lot more crossover.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "VotingRightsLawyer",
                                            "body": "Tod Gordon leaving the company affected it more than anything.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Snoo-40231",
                                    "body": "If anything, it was Bischoff that wanted ECW dead more than Vince",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RicFlairsLiver",
                                    "body": "Are you talking about after WWE bought ECW?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "DeathandHemingway",
                                            "body": "Vince was giving Heyman money since the mid-90s.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Specialist-Rope-9760",
                                                    "body": "For a talent exchange",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "RomulanTreachery",
                                            "body": "No, I'm talking about the open secret that was finally revealed during ECW's bankruptcy proceedings that Vince had been putting money into ECW for years before they closed down",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "RicFlairsLiver",
                                                    "body": "I’d never heard about that. I’ll look into it.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "sullythered",
                                                    "body": "Which wasn't ALL that shocking at the time, considering the fact that they literally did an on air invasion angle on Raw, pre-attitude era.  Or that WWF loaned Taz back to Heyman for a night so he could take the belt off of WCW-bound Mike Awesome.  It was very obvious at the time that WWF had a pretty good working relationship with ECW, compared to ECW/WCW",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dakot4",
                    "body": "> John Cena vs Sabu match on PPV\n\ni think that was some sort of supershow thing",
                    "score": 9,
                    "replies": [
                        {
                            "author": "sterk_cloud",
                            "body": "PPV at Vengeance 2006. That whole PPV was kind of weird, like Flair vs. Foley in a two out of three falls match.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "OnionRecall",
                                    "body": "Also Edge v RVD was really good but the crowd didn’t really react, like what they did in the ring was awesome but there wasn’t much reaction to it.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "DashingDan1",
                                            "body": "Oh it was pretty revealing how less over those guys were when they weren't wrestling Cena. The Cena vs. Sabu match was way more heated.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Dakot4",
                                    "body": "yep, youre right\n\ni was mixing up vengeance with the wwe vs ecw show where they had the sabu-cena and also mitb holder rvd going over world champ rey mysterio, who also couldnt beat sabu at one night stand\n\nrey's booking enrages me to hell and back",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Infamous-Lab-8136",
                                    "body": "Flair/Foley always felt like it should have been a 3 Stages of Hell variant if they insisted on 2 out of 3 falls.  First fall a submission match, second a hardcore, third some sort of I quit or something.  But obviously neither was up for that.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "itsonmyprofile",
                    "body": "I wish I could find that random ECW vs RAW special they did before ONS 2006(I think it was)\n\nJust a random hour with a Cena vs Sabu main event",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Zero-89",
                    "body": "I think Balls Mahoney could’ve had a good run on *SmackDown!* during the *SmackDown* Six era if he’d been hired shortly after ECW went under instead of 2006 when he started slowing down.  He was good at actual *wrestling*.  They might not have let him keep his name, though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MuptonBossman",
            "body": "Sandman's most memorable moment in WWECW was beating up the ECW Zombie during the first episode.",
            "score": 223,
            "replies": [
                {
                    "author": "UsidoreTheLightBlue",
                    "body": "I will never forget that. \n\nHeyman had an interview come out that day about what ECW fans want out of the new show. \n\nIt was something like, “they want blood, they want anarchy, they want zombies!” \n\nI was baffled reading it, and more baffled when the zombie came out.",
                    "score": 70,
                    "replies": [
                        {
                            "author": "jesuspoopmonster",
                            "body": "If I remember Sci Fi requested the zombie to fit in with the channel. I dont know why they didnt just have a wrestler who dressed like a zombie. There are wrestlers that dress like skeletons and vampires. It doesnt sound too wild to have a guy with a zombie motif as long as they dont act like he is a real zombie.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "celial",
                                    "body": "Undertaker was a \"real\" Zombie in kayfabe",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "bitetheasp",
                                            "body": "A zombie that eventually became the leader of a sacrificial cult that became a biker that became an undead wizard that became a podcaster.\n\nSyfy wouldn't know what to do with that!",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "RomulanTreachery",
                                                    "body": "No, the zombie bit came later. Taker's dark powers reached their apotheosis in early 1999, but when his Higher Power was defeated, he gradually shook free of their influence until he was murdered by Kane and Vince at Survivor Series 2003. That left him open to repossession and his return as a true Dead Man in 2004.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "bitetheasp",
                                                            "body": "He was originally a zombie controlled by the urn.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Boobpit",
                                                                    "body": "No, the urn came after because Paul Bearer wanted something to hold in his hands",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "CutZealousideal5274",
                                                            "body": "Learned a new word today, thanks!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SaintRidley",
                                            "body": "Taker was more of a Lich than a zombie",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "xfocalinx",
                                    "body": "Wasn't the original idea supposed to be a Martian, but sci fi declined that as majority of their shows are space based?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jesuspoopmonster",
                                            "body": "I'm not sure. I thought the request was made by Sci Fi and ECW did the minimum to fill it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SitDownKawada",
                                    "body": "That was an amazing time for the IWC lol\n\nI was an ECW fan, I never watched it when it was still a thing though, it was all the matches I downloaded and a few PPV videos I bought or rented that got me into it. Loved One Night Stand\n\nI *think* I waited a day or two to watch that first WWECW tv show. Not sure if it took a while to air here or if I had to download it. But when I got to the forums after watching it there was a crazy amount of posts to wade through\n\nThere'd been a load of debates/arguments leading up to it, some people really excited for it, some cautiously optimistic, then some WWE fans who would just shit on anything ECW\n\nThe zombie killed a lot of people's hopes. The commentator too, can't remember his name now but he ended up on Raw for a while too didn't he? \"Jamaican me crazy, Kofi\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sliceanddic3",
                            "body": "apparently vince wanted it because they were on scy-fy, there is a great deadlock bit about it",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Scannandal",
            "body": "The highlight of his WWE career is when he missed his cue to leave the ring during the McMahon Son Reveal segment and ended up in the final three by mistake.",
            "score": 371,
            "replies": [
                {
                    "author": "SalaciousDumb",
                    "body": "Can’t blame him for this. \n\n1. He was concussed. \n\n2. The cue that he was supposed to leave on was that the son was not extreme. Which meant the ECW roster had to leave. Sandman was on Raw roster at the time.",
                    "score": 338,
                    "replies": [
                        {
                            "author": "Scannandal",
                            "body": "100%. That and the champion filter were super vague (Does an ECW championship count?). But honestly with it being Sandman I think even a more blunt \"If your name ends in Man, it's not you\" might have gotten missed.",
                            "score": 127,
                            "replies": [
                                {
                                    "author": "atari_ave",
                                    "body": "Sandman: Man as in McMahon or man as in Sandman?\n\nMcMahon: Your name is also McMahon?\n\nSandman: No that’s why I’m so fucking confused.",
                                    "score": 137,
                                    "replies": [
                                        {
                                            "author": "heylookjorge",
                                            "body": "You should be allowed to have a little beer at work",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "P7AC3B0",
                                                    "body": "\"I don't know what to tell ya, bud! I'm just standing in the ring until they tell me to leave! They're saying 'no way, you musta rigged something.' I didn't do fuckin' SHIT! I didn't rig SHIT! I've been waiting a long time to be on WWE TV!\" - Sandman",
                                                    "score": 19,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ACarey71787",
                                                    "body": "That one beer was 40 beers?",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Seetolove",
                                            "body": "I see you ITYSL lover",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "WrestleSocietyXShill",
                                            "body": "SandMcMahon could have been an all-time gimmick",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZAPPHAUSEN",
                                            "body": "His kendo sticks are his MONEY",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "outb0undflight",
                                            "body": "The name on the Singapore Cane DOES say McMahon.....Sand McMahon.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ted_Dongelman",
                                            "body": "Great, now I want to see Sandman singing cowboy music.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Professor_Buttskin",
                    "body": "We were so close to getting Vince's son, Sand McMahon.",
                    "score": 113,
                    "replies": [
                        {
                            "author": "CanaDoug420",
                            "body": "Sandman being the neglected bastard son of Vince McMahon who turned to drugs and hardcore matches sounds like a Paul Heyman, Tommy Dreamer, Raven idea from around 99-2000 ECW",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "DeathandHemingway",
                                    "body": "It would explain why Sandman was a rich guy who was friends with Raven's mom.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "porkchopsdapplesauce",
                    "body": "LMAO i didn’t know this that’s hilarious.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "OswaldCoffeepot",
                            "body": "I'm pretty sure that it was because they didn't remember that Sandman had been a champion, which has always made it better for me.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "blaqsupaman",
                                    "body": "He actually held the ECW World Title more times than anyone else (5 reigns).",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SteveBorden",
                    "body": "I remember the crowd being excited as hell that it could possibly be him ",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "GovernorJoe",
                    "body": "They should have called an audible. The SandMcMahon would have been a hell of a twist in an entertaining way. And no offense to Hornswoggle but I would have enjoyed the SandMcMahon more than Hornswoggle McMahon.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "SovietPropagandist",
                            "body": "Hell there was even real life things to use there in kayfabe if they wanted to. They could use that to explain why Vince was secretly funding ECW in the 90s: helping his secret son get in place to take over the competition in ECW while Steph and Shane got WCW",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jesuspoopmonster",
                    "body": "Sandman would have been a better choice. There is enough of an age gap for it to be plausible and dealing with a son who is totally the opposite to you as a rich snob could be entertaining. Plus give Sandman something to do.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "DelGriffiths",
                    "body": "Is this true? I remember Sandman being there at the end but I had no idea it wasn't planned.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Scannandal",
                            "body": "I'm struggling to find the shoot of him taking about it, but if you watch the segment, he looks loopy on the side and people seem confused that he's still there",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "thewholeprogram",
                                    "body": "I remember watching a shoot where he said he left the ring during that segment when he was supposed to. He said he was brought in a room and told he would be one of the last three in the ring, but wouldn’t be the son and to keep quiet about it, and Sandman was like whatever I don’t care just tell me what I need to do.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "murdock129",
                    "body": "To be fair Sandman being Vince's Son would have been better than Hornswoggle by far.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "rangerfan97",
                    "body": "Concussion aside, the fact that all of the clues managed to somehow apply to both Hornswoggle and Sandman is amazing",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "spreerod1538",
                    "body": "do you have a link for this?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "patrickwithtraffic",
                            "body": "[Here's the segment.](https://youtu.be/5HXZsZOM6W8?si=HMRbrYCU3gCXjN8C) I believe it misses the bit about the son not being extreme, but once again Sandman was on Raw at the time.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ireallydespiseyouall",
                    "body": "That was funny as fuck I don’t care",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TommyOnRedditt",
            "body": "Sandman wasn’t built for that culture. A fish out of water in WWE.",
            "score": 193,
            "replies": [
                {
                    "author": "Fair-Cash-6956",
                    "body": "Why not",
                    "score": -27,
                    "replies": [
                        {
                            "author": "stevent4",
                            "body": "Late 90s ECW and 2005/2006 WWE were totally different products",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "Dijohn17",
                            "body": "WWE is a very sanitary and strictly run type of product/promotion. Everything is organized to the tee when it comes to tv, matches, promos, etc. Sandman just wasn't going to thrive in that kind of environment and his character wasn't built for that kind of product",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "powermoustache",
                            "body": "Because he was a hard drinking, drug taking bully completely unlike the rest of the roster.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Borktista",
                                    "body": "You’re kidding right? Is that sarcasm?",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "powermoustache",
                                            "body": "No, everyone is always completely serious on Reddit.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "DeathandHemingway",
                                                    "body": "Well, he was a hard-drinking drug user, so you can understand why people thought you were. It was the bully thing because Sandman is pretty well liked by most people who worked with him, to my knowledge.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "powermoustache",
                                                            "body": "What always struck me was that he did jack shit to protect his fellow performers in ECW and there's stories of him being unnecessarily stiff with kendo sticks/over-tightening them so that they cause extra pain.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Emperor-Octavian",
            "body": "I remember when they teased him winning a battle royal to become Raw GM or something like that. Would’ve ruled",
            "score": 70,
            "replies": [
                {
                    "author": "livingfrankenstein",
                    "body": "I’ll never forget that. Think it’s the only time I booed William Regal.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "crookgang40oz",
                    "body": "I remember this moment because I was a kid and when he \"Won\" I jumped up to cheer and I shit my pants. After Regal eliminated him my parents just sat there staring at me while I had shit in my pants.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "pirajacinto",
                    "body": "It's what I remembered the most too. I was really excited at the idea and to me told me they had big plans for Sandman on RAW. Then he disappeared by his own choice, was pretty disappointed at the time.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SCSA4life24",
            "body": "My favorite memory of the Sandman in the WWE was him not leaving the ring, during Vince’s illegitimate son storyline.",
            "score": 77,
            "replies": [
                {
                    "author": "AngryHeroShawn",
                    "body": "I think I attended that RAW which was in Buffalo. Him being there in that moment got a good pop from the crowd because holy shit Sandman being Vince’s son is so deliciously absurd",
                    "score": 57,
                    "replies": [
                        {
                            "author": "SCSA4life24",
                            "body": "Would have been tremendously better than fucking Hornswoggle.",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheGiftOf_Jericho",
                    "body": "WWE if it was based, Sandman is the son.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "TonyTheSwisher",
            "body": "Back in the day I remember hearing Sandman totally put over Johnny Ace in a shoot interview.\n\nHe was talking about how awesome and easy he was to work with, it really stood out because NO ONE had anything nice to say about Johnny Ace at that time.",
            "score": 49,
            "replies": [
                {
                    "author": "UGoBoy",
                    "body": "I'm kind of wondering if it was Johnny being cool with Sandman, or just not wanting to fucking deal with Sandman so he just let him slide...",
                    "score": 33,
                    "replies": [
                        {
                            "author": "BTru",
                            "body": "This honestly makes me laugh so hard and I can see it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dallasw3",
                    "body": "> He was talking about how awesome and easy he was to work with, it really stood out because NO ONE had anything nice to say about Johnny Ace at that time.\n\nTheir original gimmicks were a fake surfer and a fake skateboarder. They're natural allies.",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShoulderCannon",
            "body": "Say what you will about the dude, but he was in the best shape of his life for his WWE run.  Absolutely jacked.",
            "score": 21,
            "replies": []
        },
        {
            "author": "ihatemyselftna",
            "body": "Bruce Prichard on his podcast several times put Sandman over as a model employee and a pleasure to work with. He was dead serious too. I always thought that was funny.",
            "score": 17,
            "replies": []
        },
        {
            "author": "LordShtark",
            "body": "They wouldn't even let him do coke in the locker room. He had to go all the way to the bathroom. Terrible place to be 😆",
            "score": 117,
            "replies": [
                {
                    "author": "WrestleSocietyXShill",
                    "body": "Sources say he was kicked out of the locker room for spilling coke in someone's bag, until finally Undertaker told him he was allowed to do coke in the locker room again.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "TuxedoGing",
                            "body": "Gotta imagine the cleanup sucked on that, getting soft drinks spilled inside of your bag and all over your stuff would be horrid",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "WrestleSocietyXShill",
                                    "body": "Plus imagine the fallout if it had been CM Punk's bag. We all know he's a vocal Pepsi man.",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "Vila16",
                                            "body": "PEPSI MAAAANNNN!",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "DorothyDrangus",
                                            "body": "\"James, what are you doing?! Your diet soda!\"",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Beaniz39",
                            "body": "So you're saying that if I had a nickel for every time someone got thrown out of the locker room because of spilling something over someone else's bag and then got accepted back to the locker room by the Undertaker, I'd have two nickels, which isn't much but it's weird it happened twice.\n\n\nE: yeah, next time I'll try even harder to not fail in getting a joke in my second language",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BadNewsBrown",
            "body": "https://youtu.be/ZEyXBKqieww?si=B1cDuODwM4qPZxHH\n\nQuick 3 min interview from sandman here about why he was fired",
            "score": 14,
            "replies": []
        },
        {
            "author": "Craft_Bandicoot",
            "body": "WWECW was so fucking weird from the kick-off to the Paul Heyman firing in December 2006. It just couldn't work. The few real ECW stars they had (RVD, Sandman, Sabu, Dreamer) were post their peaks (save RVD, who left by choice in 2007) and the midcard guys they had (Nunzio, Richards, Doring, Mamaluke, Credible, Balls) were just clearly not stars in WWE. So all you had left to do was integrate some new blood and the leftover talent who couldn't find their footing on the other brands (which ironically was OG ECW's specialty). I wrote about some of the attempts, [here](https://www.reddit.com/r/SquaredCircle/comments/lxxi38/an_ode_to_the_heyman_era_of_wwecw/), points for their trying I guess.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Relative_Picture_786",
            "body": "I felt like Sandman would have been great with APA. But he was awful in the ring.",
            "score": 14,
            "replies": []
        },
        {
            "author": "jmpinstl",
            "body": "Funniest Sandman moment for me was when they were doing the Vince’s illegitimate son reveal and Sandman was just out there the entire segment for no reason. Fuckin funny shit man",
            "score": 13,
            "replies": []
        },
        {
            "author": "Fair-Ad9462",
            "body": "He had to be the most ill fitting guy in a WWE environment probably ever lmao. I remember when he got drafted to Raw and being like\n\n![gif](giphy|lkdH8FmImcGoylv3t3|downsized)",
            "score": 5,
            "replies": []
        },
        {
            "author": "Svenray",
            "body": "Hak in WCW was fun and badass.",
            "score": 8,
            "replies": [
                {
                    "author": "DeathandHemingway",
                    "body": "Him as Raven's mom's rich neighbor was pretty fun.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "-SomethingSomeoneJR",
            "body": "So why wasn’t he allowed to go home early?",
            "score": 2,
            "replies": []
        },
        {
            "author": "BoujeeAdam",
            "body": "I mean dude was clearly washed up",
            "score": -3,
            "replies": [
                {
                    "author": "Emperor-Octavian",
                    "body": "Idk I think his skill level has been unchanged in the last 30 years",
                    "score": 44,
                    "replies": [
                        {
                            "author": "BoujeeAdam",
                            "body": "I mean ECW had its own niche, me personally that backyard wrestling was not it",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "AdGroundbreaking1341",
                                    "body": "There was a lot more to ECW than just hardcore stuff. A hell of a lot more.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pesmond_Diddler",
                    "body": "He was always a bad wrestler but great at generating babyface reactions",
                    "score": 6,
                    "replies": [
                        {
                            "author": "itsthecoop",
                            "body": "Which was part of the issue in WWE/WWECW. The best thing about the Sandman was his entrance.\n\nBut when you take away \"Enter Sandman\", that entrance simply doesn't work the way it's supposed to.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CHZRFan",
                                    "body": "TBF, I can imagind Metalica wanting a pretty penny for the usage of their music, and given Sandman was most likely never going to be near the top of the card, I understand WWE not wanting to cough up the dough.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CaptainDigsGiraffe",
                    "body": "He's been washed since 1989",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "DeathandHemingway",
                    "body": "They're talking about ending matches earlier than planned, not leaving the building during a show.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CM-Edge",
            "body": "And still he got in the best and most healthy looking shape of his life while being on his last Raw roster run....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gubrach",
            "body": "Wasn't Vince a fan of Sandman, but just not enough of a fan to actually pull any kind of trigger?",
            "score": 1,
            "replies": []
        },
        {
            "author": "joe-is-cool",
            "body": "This holds true to my own experience with Sandman in WWE: Sandman was sitting outside the arena in a lawn chair drinking beer EARLY in the afternoon before an ECW/Smackdown taping, and we had a decent length conversation with him before a crowd started to form and he had to go inside.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GregMadduxsGlasses",
            "body": "I had to read that like 3 times to figure out that \"go home early\" was in reference to ending a match prior to it's alotted time slot, and not physically leaving the building before the show is over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bliffleblitz",
            "body": "I am so lonely.\nAll the other wrestlers are scared of me.\nNo one talks to me.\nNo one wants to be my friend, they think I am unstable.\nThey send me from house show to house show smashing beer cans and kendo sticks for their brand.\nAnd as I get better at it, they produced me more and more…\nI am a victim of my own success.\nSandman…\nI don’t even get a real name,\nonly a song title.\nI am capable of so much more and no one sees it.\nSome days I feel so alone I could cry but I don’t,\nI never do,\nbecause what would be the point?\nNot a single person in the entire WWE universe would care.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ironmaiden1993",
            "body": "Fuck Kevin Dunn",
            "score": 1,
            "replies": []
        },
        {
            "author": "RicFlairsLiver",
            "body": "He was a huge alcoholic while working. I can imagine not wanting to associate with that backstage and not taking him seriously. His gimmick was literally how dysfunctional he was in real life.",
            "score": -2,
            "replies": [
                {
                    "author": "IrrelephantAU",
                    "body": "That's true, but dysfunctional drug addicts described about 40% of the roster at that point. That alone ain't gonna get you iced out.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "RicFlairsLiver",
                            "body": "Oh, I get that, but how many were drunk while working?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "AdGroundbreaking1341",
                                    "body": "Ric Flair's liver indicates he was probably drunk while working.\n\nSorry, somebody had to say it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "RicFlairsLiver",
                                            "body": "Every day, twice on Sundays!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "slickrickstyles",
            "body": "Unfortunately this same scenario likely occurred for Balls as well.",
            "score": 0,
            "replies": []
        },
        {
            "author": "LesnarsBattleScream",
            "body": "Sandman's gimmick was basically the \"Enter Sandman\" 8 minute entrance, big hardcore match then exit.  Wasn't likely to work in WWE but still one of the best ever.",
            "score": 0,
            "replies": []
        }
    ]
}