{
    "title": "Konosuke Takeshita asked to describe AEW roster with one word; calls Kenny Omega mentor, Cope hero and Kyle Fletcher husband",
    "author": "secretpandaxx",
    "subreddit": "SquaredCircle",
    "rank": 10,
    "score": 141,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 35,
    "url": "https://v.redd.it/xav3iqotjipe1",
    "id": "1jeg118",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n**Help make SquaredCircle safer and more inclusive by using the report button to flag posts and comments for moderator review.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SquaredCircle) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "bayleysgal1996",
            "body": "Skye Blue/Takeshita feud incoming apparently",
            "score": 65,
            "replies": [
                {
                    "author": "MrPuroresu42",
                    "body": "Skye Blue is a lovely lady, don't get me wrong but if were her I'd worry bout my hubby leaving me, cause Takeshita is freaking beautiful.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "fttxdd666",
                            "body": "Skye would just have to steal Yuka then, to make it even",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "MrPuroresu42",
                                    "body": "Meanwhile Yuki Ueno is Takeshita's true love.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "just-smiley",
                    "body": "![gif](giphy|XCmQvKPNCHbW02hx3E)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrPuroresu42",
            "body": "Takeshita name-dropping Shibata vs Akiyama 2005 proves he knows ball.",
            "score": 42,
            "replies": [
                {
                    "author": "AllezLesPrimrose",
                    "body": "There’s a Vice documentary with a scene when he was a teenage trainee and he was going through a tape library picking some of his favourites.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gorgeoff",
            "body": "Kyle's work wife getting in the way of his shoot girlfriend",
            "score": 50,
            "replies": []
        },
        {
            "author": "Snoo-40231",
            "body": "Based Yakuza truther",
            "score": 25,
            "replies": [
                {
                    "author": "ramonzer0",
                    "body": "He dressed up as Majima during that Yakuza street fight, he's very much based\n\nAlso I've him to thank then for spreading the word if he's the reason Shida got into the games",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Acrobatic-Room-9478",
            "body": "Please make Takeshita a babyface again, he has so much charisma and natural babyface energy. Or, just give him more promo time. \n\nI’m just in favour of more Takeshita on TV.",
            "score": 27,
            "replies": [
                {
                    "author": "scruntdouble",
                    "body": "the day Takeshita turns on Don Callis will be a banner day for AEW.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "mexploder89",
                    "body": "He will be a babyface again for sure. But as of right now he's fine in the Don Callis Family as a heel. His time will come",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MrPuroresu42",
                    "body": "I think Takeshita will turn babyface after the loses the NEVER Title (most likely to Gabe Kidd), leading to Callis betraying Takeshita and kicking him out of the DCF. Takeshita can then work his way back up, make peace with Omega and Ospreay, then hopefully be the one to take the Continental Championship off Okada.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AnfowleaAnima",
                    "body": "But he LOOKS amazing as a heel also",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "X-Budd",
                    "body": "I don't know, he's such a cool heel... if he ever goes back to being a babyface, I don't want him to be the same underdog nice guy he was, I want him to stay heel Takeshita but feuding\n with heels, like Swerve and Stone Cold.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "all_in_the_game_yo",
                    "body": "I've got a feeling he's the next one to leave the DCF. Blames Don for losing his title. Takeshita Vs Kyle Fletcher at All In 💪",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Snoo-40231",
                            "body": "Way too early to split them up imo",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AllezLesPrimrose",
                    "body": "Please don’t, him turning heel is the first time AEW have ever come close to using him properly. The turn absolutely should not be anywhere near yet.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Snoo-40231",
                            "body": "Yeah his charisma and character work came out way more when he turned heel and the DC pairing is working like a charm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SPZ_Ireland",
            "body": "Takeshita... your style too different, your demeanor too wholesome, your husband too bad.\n\nDon's gonna kill you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Champiness",
            "body": "DDT has taught him well",
            "score": 6,
            "replies": []
        },
        {
            "author": "SharkGirl666",
            "body": "Oh my god 🫠",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sajkhow",
            "body": "So Don Callis Family is an actual family it seems",
            "score": 1,
            "replies": []
        },
        {
            "author": "manhaterxxx",
            "body": "And he’s supposed to be a heel. A *heel*!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoftCalligrapher280",
            "body": "So he’s the drug dealer responsible for getting Shida addicted to Yakuza.  /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "AllezLesPrimrose",
            "body": "Edge putting Takeshita over would be a good use of both, to be honest",
            "score": 1,
            "replies": [
                {
                    "author": "SirRedRising",
                    "body": "I've been hoping this whole Jay White storyline leads to either or Cope turning on the other and it culminating in a feud where Cope puts over Jay. But Takeshita would be good too. Hell, if you space the matches out by a few months you could have Cope put over both guys.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MrPuroresu42",
                            "body": "Now that you mention it, we've never seen Takeshita vs Jay White and I want it so bad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kazuchika420",
            "body": "Nah, this man is too sweet for being such a beast 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirRedRising",
            "body": "If/when Danielson comes back for some one-off matches, I would love to see him revisit some of his hits like vs Takeshita, Hangman, and Kenny. I feel like all 3 of those guys he faced early on, then never again (outside the BCC vs Elite multiman hardcore matches)",
            "score": 1,
            "replies": []
        },
        {
            "author": "KafeenHedake",
            "body": "Is it me, or is his English getting REALLY good? He sounds much more natural and comfortable than Okada.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ferdinandingo",
            "body": "GOAT mentor for a GOAT protege",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kazuchika420",
            "body": "Funny how Cope would never put this lad over",
            "score": 1,
            "replies": []
        }
    ]
}