{
    "title": "[Silent] on PD complaining about Besties shootouts",
    "author": "Ok-Acanthaceae-9488",
    "subreddit": "RPClipsGTA",
    "rank": 5,
    "score": 0,
    "upvote_ratio": 0.28,
    "num_comments (reported by reddit)": 5,
    "url": "https://streamable.com/aiab7t",
    "id": "1jeir3c",
    "selftext": "",
    "comments": [
        {
            "author": "ProduceHopeful5151",
            "body": "This needs better editing.    Or at least timestamps of when he talks.  00:17 - 00:54 is silent (pun intended); 01:01 - 02:46 is silent;   I then stopped caring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yoyomancollman",
            "body": "I mean he is kinda right and wrong on stuff like bank trucks besties expect a shootout or stupid stuff like robbing the g6 truck today it wasn't suprising they got shot.\n\n\nOn stuff like cops using their SUVs to ram and disable a car it is basically a shootout bait where the cop knows what he/she is doing even without an SUV I think as viewer it's pretty easy to tell when a cop doing something that'll lead to a shootout and it's usually repeat offenders.",
            "score": 1,
            "replies": [
                {
                    "author": "Sensitive-Canary4694",
                    "body": "I've heard at least 5 separate conversations of PD saying they need to train Dee on how to pit because he tends to full on ram but nobody actually follows through with it. It's like once the conversation ends the thought ends with it.\n\nBtw, I don't think Dee was at fault for this situation. Just an example that comes to mind.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "zafapowaa",
                            "body": "well was easy when you had people that called out the wrong doing right at the spot , i still remeber snow cooking people because of radio comms and everyone after getting called out 1 time improved instead of private meetings xd",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rickbuh1",
                    "body": "I don't think ramming should be done to be fair. But disabling is the only way for the PD to stop a lot of cars now. There's been multiple times where criminals are still driving full speed through the city without much trouble despite being half or even completely spiked. Even most successful boxes end up with interference cars YOLO ramming cops to break it.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}