{
    "title": "Anti Trump protests around the world. America, the world is watching.",
    "author": "Fire-Haus",
    "subreddit": "Anarchism",
    "rank": 460,
    "score": 788,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/gallery/1i9571e",
    "id": "1i962lc",
    "selftext": "",
    "comments": [
        {
            "author": "WildAutonomy",
            "body": "There's been some cool stuff. Not as much as 2016, but it's a start",
            "score": 33,
            "replies": []
        },
        {
            "author": "EKsaorsire",
            "body": "That last pic is Derek from Colorado. Dude is at every single protest or event giving people hell. That pic was opposite a Proud Boys event I believe. Not everyone can afford to be everywhere, but I’m glad that someone who can, does. \n\nAlso the USA has been a laughing stock for decades I feel. But now more people have access it seems. Now they can see our shame and we can see their mockery.",
            "score": 25,
            "replies": []
        },
        {
            "author": "mormon_freeman",
            "body": "Is the world watching? Because I haven't seen any of this on any of my feeds.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Fun-Distribution2290",
            "body": "We can’t see it unfortunately since it’s blocked",
            "score": 14,
            "replies": []
        },
        {
            "author": "supercatpuke",
            "body": "As an American, I can't tell you how happy I am to see this happening all over the world. \n\nObviously I'd prefer that we weren't in this situation at all, but it's emphasizing the lack of response here at home. No one is standing up in a meaningful way yet, and we haven't for years. Sad that we'll need to follow the lead of people in other countries, but nonetheless this will encourage more of us to be braver and openly angry, to assemble and protest as is our right, and hopefully to make our voices heard like there's no tomorrow.",
            "score": 11,
            "replies": []
        },
        {
            "author": "None",
            "body": "It’s good to protest against Trump, but the goal is not to protest against one government or another - it’s to oppose all governments and all states.",
            "score": 7,
            "replies": []
        },
        {
            "author": "xilanthro",
            "body": "Funny how the genocide was not even a blip by comparison...",
            "score": 4,
            "replies": []
        },
        {
            "author": "Arnaldo1993",
            "body": "I dont get it. What is the point of protesting another countries president?",
            "score": 3,
            "replies": [
                {
                    "author": "Fire-Haus",
                    "body": "U.S. President’s decisions affect other countries too. Civil issues, trade, climate, immigration, etc. \n\nPeople in other countries protest to show human unification on an issue. They show support to say they’re against those decisions and don’t want them spreading worldwide. That’s essentially why you might protest someone else’s leader.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Arnaldo1993",
                            "body": "Thanks",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Overall-Idea945",
                    "body": "The day before yesterday a flight of chained Brazilians arrived back, our supreme court had to force them to remove the deportees' chains before they boarded and the majority of those who return don't even have a place to stay",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bezos-is-a-POS",
            "body": "2 and 4 goes hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "lastonelater",
            "body": "Love the flag burning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mr_Dennis1",
            "body": "what’s the difference between Biden and Trump?",
            "score": 2,
            "replies": [
                {
                    "author": "mariajaja",
                    "body": "Well, Trump has Nazis in his cabinet. I hate Biden too. The bar is in hell, but Trump loves to make it sink lower.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mariajaja",
                                    "body": "What game? Steven Bannon is well known for his ties with neo Nazis and other white supremacists. He specifically worked with them while under Trump. There's others, but you can do your own research for that. \n\nWhy do you assume I'm overusing Nazis? A neo Nazis is a Nazi. 🙄\n\nhttps://www.forbes.com/sites/janetwburns/2017/10/06/breitbart-emails-trace-neo-nazi-moves-of-steve-bannon-milo-yiannopoulos-report/",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "APEX_REAP3RZ",
                    "body": "One upholds the oligarchy, one wishes to move further towards theocracy",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Overall-Idea945",
                    "body": "One wants to maintain the status quo, the other wants to end more rights",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}