{
    "title": "Writings by anarchist thinkers",
    "author": "gradientusername",
    "subreddit": "Anarchism",
    "rank": 411,
    "score": 29,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/Anarchism/comments/1id8iee/writings_by_anarchist_thinkers/",
    "id": "1id8iee",
    "selftext": "I’ve been reading Kropotkin and I recently read God and the State by Bakunin but I’ve been jonesing for anarchist writings that are more recent and more relevant to the world today.\n\nDoes anyone have any suggestions for modern anarchist thinkers that wrote books? Perhaps even writers that are alive and still writing? Is there a magazine I could subscribe to? Or a website I could regularly check?\n\nThanks in advance",
    "comments": [
        {
            "author": "ArloDoss",
            "body": "David Graeber is supposed to be really good- I haven’t gotten in to him yet.\n\nChomsky is really entry level for a lot of people and I’ve enjoyed everything of his I’ve read.\n\nI can’t wait to see what others here write.",
            "score": 23,
            "replies": [
                {
                    "author": "onewomancaravan",
                    "body": "[https://davidgraeber.org/articles/are-you-an-anarchist-the-answer-maysurprise-you/](https://davidgraeber.org/articles/are-you-an-anarchist-the-answer-maysurprise-you/)",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "onewomancaravan",
                    "body": "I highly recommend \"Bullshit Jobs\" by David Graeber, as a place to start.  Edit to add: [https://theanarchistlibrary.org/library/david-graeber-bullshit-jobs](https://theanarchistlibrary.org/library/david-graeber-bullshit-jobs)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Article_Used",
                            "body": "*Debt* was also an awesome read, also on the library",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "onewomancaravan",
                                    "body": "That's one of my favorites.  But it's a long, challenging read.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cycloanarchist",
                    "body": "Graebers books are well written, can only recommend them.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "ilovewaterbottles",
                            "body": "He’s so fun to read. Gone to soon :/",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GroundbreakingWeb360",
            "body": "[TheAnarchistLibrary.org](http://TheAnarchistLibrary.org) has some good stuff, free to read too. Anarchist writers are more hyperfocused on certain topics nowadays, there are not as much generalized \"anarchist\" writers as much as there used to be. You have people who focus on stuff like Ecology (Bookchin) or Anthropology (David Graeber)",
            "score": 18,
            "replies": []
        },
        {
            "author": "executivejeff",
            "body": "I really love Margaret Killjoy's work. \nhttps://margaretkilljoy.substack.com/",
            "score": 11,
            "replies": []
        },
        {
            "author": "OwlHeart108",
            "body": "Do you know about anarchist publishers like AK Press & PM Press? \n\nAnarchism: A Very Short Introduction by Alex Pritchard is really good.\n\nThe Dispossessed by Ursula Le Guin is a wonderful exploration of anarchist ideas in the form of a brilliant novel.\n\nThe Anarchist Studies Network offers [reading lists ](https://anarchiststudiesnetwork.org/reading-lists/)on different subject areas that might interest you.\n\nAnd David Graeber is very good, as others have mentioned.\n\nEnjoy your explorations!",
            "score": 9,
            "replies": [
                {
                    "author": "baconfriedpork",
                    "body": "best answer right here!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Marionberry_Bellini",
            "body": "I’ve enjoyed Peter Gelderloos’ books",
            "score": 7,
            "replies": []
        },
        {
            "author": "NavyAlphaGamer",
            "body": "Abdullah Öcalan (although not explicitly an Anarchist) is a good read. Takes Bookchins arguably best work of Social Ecology, and combines it with extremely valuable Women's Liberation and a great Sociological analysis.\nSociology of Freedom is a great read.\n\nOthers have mentioned Graeber. Also a great read. \n\nEmma Goldman's essays are always worth a look too.",
            "score": 7,
            "replies": []
        },
        {
            "author": "onecoledface",
            "body": "•Anarchism and the Black Revolution by Lorenzo Kom’boa Ervin. \n• Murray Bookchin \n• Luigi Galleani The most dangerous anarchist in America by Antonio Santa \n\nAdjacent-\n\n•We Go Where They Go. story of Anti Racist Action. \n•Militant Anti-Fascism M. testa \n• Blood In My Eye by George L. Jackson",
            "score": 5,
            "replies": []
        },
        {
            "author": "CrimethInc-Ex-Worker",
            "body": "Duty-bound to direct you to [crimethinc.com](http://crimethinc.com)",
            "score": 5,
            "replies": []
        },
        {
            "author": "footfirstfolly",
            "body": "Bookchin is reductionist and not very scholastic, but I like his thoughts on ecology and anti-authoritarianism. Along those lines, Apo Ocalan ties some of Bookchin's ecological communitarian to women's justice and post colonial justice movements in engaging ways.much of their corpus is readily available online. Even some nice lectures.",
            "score": 10,
            "replies": []
        },
        {
            "author": "sambuhlamba",
            "body": "James C. Scott, Yale professor of Anthropology and Agricultural studies is a self proclaimed anarchist and has written many university level books on historical and social topics seen through an anarchist lens. I just finished reading his book *Against the Grain, a Deep History of the Earliest States.* \n\nThis book specifically investigates whether or not emerging agricultural methods (such as the discovery/cultivation of grain and millet using flood plains) led to centralized settlements, and whether this centralization led to hierarchies. It's sort of a trojan horse argument against the capitalist / nationalist claim that hierarchy and institutions create the greatest human potential for development and progress. James C. Scott says, no, actually, we were doing just fine before hierarchy and institutions began to control us.\n\nIf your tastes are more offbeat, I recommend Terrence McKenna, the godfather of psilocybin research. Some of his theories match up quite nicely with James C. Scott. I enjoyed *Food of the Gods*. While much of McKenna can be refuted through hard archaeological evidence, his stoned ape and death of the feminine divine theories are fascinating.\n\nScott & McKenna would both agree: Capitalism=/=Imperialism are the current forms of a millenia old subjugation of humanities greatest potential.",
            "score": 4,
            "replies": [
                {
                    "author": "UsurpedLettuce",
                    "body": "I'm trying to read through Scott's *Two Cheers for Anarchism: Six Pieces on Autonomy, Dignity, and Meaningful Work and Play*. I'm sort of \"meh\" on a few of his critiques so far, but I've only been reading it off and on around doing errands, so not really in depth.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Soft-Negotiation7480",
            "body": "Blessed is the flames - serafinski",
            "score": 3,
            "replies": []
        },
        {
            "author": "maddilove",
            "body": "No Trespassing! by Anders Corr, is a brilliant book on squatting. I definitely recommend it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anumaen",
            "body": "I'll add to the David Graeber train here. A small collection of his essays just got released, called \"The Ultimate Hidden Truth of the World\". It has some of the stuff that's less well-read but really important, like \"Deadzones of the Imagination\", and \"There Never Was a West\". It's a really solid primer for both modern thoughts on Anarchism and Graeber's work generally. Some of the essays there were super impactful on me when I read them",
            "score": 3,
            "replies": [
                {
                    "author": "icarusrising9",
                    "body": "Thank you so much for mentioning this, I had no idea he had more posthumously published work!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Art-X-",
                            "body": "Also posthumous is \"Pirate Enlightenment, or the Real Libertalia\" (about pirates and locals on the northeast coast of Madagascar).",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "icarusrising9",
                                    "body": "Cool, thanks!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "The Zapatistas aren’t explicitly anarchist but you might like some of Subcomandante Marcos‘s writing. And has anyone mentioned Crimethinc yet?",
            "score": 3,
            "replies": [
                {
                    "author": "Art-X-",
                    "body": "One of the best books I read last year focused on the Zapatistas as germinal in a blossoming of communities practicing self-governing autonomy in Latin America, and relating that to the self-governing democratic confederalism of Bookchin/Ocalan mentioned above and practiced in parts of northern Syria. The book is Raul Zibechi, Constructing Worlds Otherwise: Societies in Movement and Anticolonial Paths in Latin America (AK Press 2024). Really good.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SilverHare23",
            "body": "Stuart Christie and Albert Meltzer \"The Floodgates of Anarchy\"\nColin Ward \"Anarchy in Action\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "tsy-misy",
            "body": "I read Practical Anarchism by Scott (Shuli) Branson recently and I really liked it, but I am new to reading about anarchism so I don't have much to compare it to. One thing that really stuck with me was the emphasis on recentering community and care to counteract the systems that support capitalism and authoritarianism. I'll definitely be checking out some of the other recommendations in this thread!",
            "score": 2,
            "replies": []
        },
        {
            "author": "catastrofae",
            "body": "Crimethinc is a great place to start. Books, posters, zines, journals, podcasts, web articles, links to free media, list goes on. Alliance that began the \"Cookbook\". Great book to begin with is \"Days of War, Nights of Love\"!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "icarusrising9",
            "body": "I know others have already been singing the praises of Graeber, but I wanted to suggest a specific book: *Debt: The First 5,000 Years*.\n\n\nIt's not explicitly anarchist, as in, it's not a persuasive work advancing any anarchist position; it goes through anthropological records covering the way debt, and money later on, developed in a variety of societies. Absolutely fascinating, totally blew my mind and made me see human sociopolitical structures in a whole new light. I could not possibly recommend it more highly.\n\nEdit: Also, the sci-fi work *The Dispossessed* by Ursula K. Le Guin is in my opinion an absolute masterpiece. It explores a number of various anarchist ideas and themes, if you're interested in fiction.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Artistic-Choice6785",
            "body": "Bonanno - Armed Joy",
            "score": 2,
            "replies": []
        },
        {
            "author": "baconfriedpork",
            "body": "backing all the great suggestions here like Graeber, and checking out AK Press and PM Press. \n\ni also recommend the books by the Invisible Committee: https://en.m.wikipedia.org/wiki/The_Invisible_Committee",
            "score": 2,
            "replies": []
        },
        {
            "author": "Art-X-",
            "body": "Everything by David Graeber is great. He was an anthropologist and I would paraphrase his main 'anarchist' point as \"Human beings have the fundamental freedom/capacity to get together in groups and create social reality. The trick is to do that using democracy (i.e., group decision making on what's best for the group).\" I really liked his somewhat unheralded book, The Democracy Project (which is shorter than most of the others \\[shortest being the pamphlet-like Fragments of an Anarchist Anthropology\\]). \n\nAlso good, by Zoe Samudzi and William C. Anderson, As Black as Resistance: Finding the Conditions for Liberation.\n\nAnd I haven't read it yet, but also looks good: William C. Anderson, The Nation on No Map: Black Anarchism and Abolition.\n\nAnd check out AK Press!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Art-X-",
            "body": "Also... everyone should read After the Holocene: Planetary Politics for Commoners, by Gene Ray (Autonomedia 2024). Important for now!\n\nHe makes it available for PDF download >> [https://www.researchgate.net/publication/379837928\\_After\\_the\\_Holocene\\_Planetary\\_Politics\\_for\\_Commoners](https://www.researchgate.net/publication/379837928_After_the_Holocene_Planetary_Politics_for_Commoners)",
            "score": 1,
            "replies": []
        }
    ]
}