{
    "title": "This is how you know the cost of living is getting too expensive…",
    "author": "False_Cream_5453",
    "subreddit": "Anarchism",
    "rank": 379,
    "score": 209,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 34,
    "url": "https://i.redd.it/ekay3wu2bdge1.jpeg",
    "id": "1iekpwv",
    "selftext": "This was at a local Family Dollar (cousin to Dollar General)… security tags on their laundry detergent… I talked to the cashier and she said it doesn’t help either because people will still just pour it into another container and run out with it…\n\nIt is pretty sad I went in for a few necessities and it totaled almost $50 for what used to cost maybe $20 when I was a kid (I’m a 25M).\n\nI hope in coming years we can produce more of our necessities within our own country and get costs down… or soon we will just use cheaper “natural” alternatives baking soda and vinegar for stuff like laundry detergent because soap and other common household necessity CONSUMABLES are just so expensive anymore… and the monster mega-opolies that manuf. all these consumables aren’t getting any less greedy…\n\n",
    "comments": [
        {
            "author": "None",
            "body": "Always been like this in the hood.  Tide is basically an alternative currency.",
            "score": 70,
            "replies": [
                {
                    "author": "GlassAd4132",
                    "body": "I grew up in a city, though not an inner city neighborhood, and a lot of stores where I grew up locked that type of stuff up. I’m out in the middle of nowhere now, and they don’t lock up shit, which is nonsense because I don’t think theft is really any lower in poor rural areas than poor urban areas",
                    "score": 28,
                    "replies": [
                        {
                            "author": "None",
                            "body": "But you can’t signal safety to the scared white middle class that way.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "GlassAd4132",
                                    "body": "Racism is also an explanation",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "For sure. It’s also about image and signaling.  Every time I saw this or baby formula locked up in my mostly black neighborhood, I’d get the image of a rich dude saying “see what I have to do because of you?”  The strategy is to abuse people by limiting resources then blame the victim.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Choice-Birthday-2235",
            "body": "Did I see things right? 2.6 liters of detergent for 12 bucks? I'm my country, you can get 3 liters of detergent for 2 bucks and a few cents if you're looking for the cheapest brand. The cheapest brand here may not have the prettiest color or the prettiest bottle, but it does its job well. \n\nTo save detergent, and make it last longer, there are a few simple tricks: \n\n* Use a small amount for each wash. The recommended amount for each wash, according to the market, is one capful per wash. If the detergent is good, use half a bottle cap per wash. Most likely you won't notice any change.\n* Maybe this advice sounds very cliché, but in times of need all advice is welcome. Accumulate a large amount of clothes to wash, that way, you'll save water and liquid detergent. It doesn't matter if you wash clothes of different colors, unless, for example, all your clothes are black and there is only one white garment. \n* Also, use a little less water, if your washing machine allows you to lower the water level or something similar. With less water, the little liquid detergent you use won't be diluted as easily and can be effective.",
            "score": 20,
            "replies": [
                {
                    "author": "None",
                    "body": "This is America.  All human action is analyzed for profit.  We’re chattel.  Some of the highest paid people here are quants that calculate exactly how much life they can extract from a human over the course of their life.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Choice-Birthday-2235",
                            "body": "Yeah, I know :\\[ ; all the shit that's happening due to the rotted carrot administration made me pay more attention to how the **real** average american is living right now. In my country, US is seen as the land of opportunities, and even as an example to follow. Not gonna lie, many people in my country think the majority of americans are rich (big houses, expensive cars, fridge overflowing with food, etc.). \n\nWhen I saw the price increase, especially in food and medicines, I thought: \"Oh well maybe that's expensive for me but for sure americans receive very high salaries\". A couple weeks ago I found out the minimun wage per year in the US is approximately 15.080 dollars; and, doing the math, it isn't enough for average people, considering how much the cost of living has risen.\n\nThe minimun wage per year in my country is approximately 6.120 dollars, but things are way cheaper here. How come inhalers for asthmatics cost over 500 dollars? In my country both public and private services give them for free to anyone with the disease! And even if you decided to buy them, on average you would spend 2 or 5 dollars. Maybe 10, if you go for the more exclusive and expensive ones. In my country, a person only needs to spend 70 bucks per month to buy all the essencial, basic food; I've seen Americans spending $30 a week for food that isn't even enough to be healthy! \n\nI really wish americans stand up as soon as possible for their rights, it's really a living hell right now for the average american :\\[ <3",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "TheLostDestroyer",
                                    "body": "The federal minimum wage in America is 7.25. there are a bunch of states that have mandated higher. But it's 7.25 my friend. Also don't forget that lots of people in our economy work off tips. And for them minimum is something like 2.60 and then whatever they make in tips.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Choice-Birthday-2235",
                                            "body": "That's way too low for one of the richest countries in the world. If I remember well, the federal minimum wage in America is 7.25 USD per hour, right? How many hours per day an American has to work to survive? :C\n\n\nIn my country, minimum wage is 510 bucks per month. Tipping works differently here. You aren't required to tip people who work in tipping areas. The employer is obliged to pay the employee at least 510 bucks per month for their work, so no, people in my country don't live on tips. \n\n\nFor example, in restaurants, when you ask for the bill, they give it to you including the total cost of everything you ordered, and the total cost of everything you ordered plus tips to the waiters. You can decide whether to pay the bill with tips included, or just pay for what you ordered. The waiters' tip is approximately 20% of what you ordered, that's how is calculated in my country. At the end of the day, or month, the waiters divide the tips they earned equally.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "TheLostDestroyer",
                                                    "body": "So in America for tipped workers the employer in supposed to make up the difference if they do not make the federal minimum wage in a pay period through tips and their pay. But they don't always do that.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "False_Cream_5453",
                                                    "body": "What country do you live in? And we spend a lot more than $30/week on food!! Hahahaha try $150.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "n1ckh0pan0nym0us",
                                                            "body": "I just dropped almost double that for a family of 4 at Aldi (cheapest option) and that will probably only last us a week.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Choice-Birthday-2235",
                                                                    "body": "My family in my natal city (mom, my brother and me, my dad works in another city) always buy at the cheapest market too. We usually spend $200 approx. per month to eat for an entire month. We don't buy anything too exclusive though, just the necessary. In the internet, I learned americans eat way bigger portions than chileans. Not gonna lie, chileans enjoy food a lot, but we don't eat as much as americans. I couldn't believe there are jars with 500 ibuprofen pills at sale there, in Chile ibuprofen pills are sold in small boxes that contain 15-30 pills (they can cost from some cents to 7 bucks).",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "n1ckh0pan0nym0us",
                                                                            "body": "I bought fruit, veggies, nuts, bread, milk, eggs (since it's winter here and my chickens are on strike lol), canned goods, cheese, deli meat...nothing big or special. Prices are just that outrageous here and they keep going up because out government is run by rich people who would like to see us all be slaves.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Choice-Birthday-2235",
                                                            "body": "In Chile! A country in South America! :\\] \n\nWe have a little bit of inflation here, but the cost of basic food (fortunately) has lowered to 68 or 69 bucks. \n\nIn recent years, the minimum wage has increased. Previously, the minimum that an employer had to give their employee was approximately $459, which wasn't enough for several middle and lower class families, taking into account inflation. Almost 10 years ago, free universities came into effect. To apply for this benefit, you must be part of the most vulnerable 60% of the population, have taken the university entrance exams, and have had high grades during the last 4 years of school. Higher education in Chile used to be incredibly expensive and was only accessible to a few. It was quite common that young people were accepted to universities, but were forced to turn down the offer due to lack of resources, or to go into debt for years. \n\nThere are several excessive costs in my country, for example, clean water. The cost of water in Chile is ridiculously expensive when you consider that water is purified through literally the cheapest and simplest method in the world, the same goes for the electricity bill. Add to this the problem of insecurity, especially in Santiago, the capital of my country. However, I think that Chile has made progress in several social and economic issues.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "Go on apartments.com, search a city you are interested in, you’ll get your answer.  Minimum wage workers in cities are living in bunks or as dependents with family.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Polenisfun",
            "body": "It's why I try to clip coupons and look around different stores to see if there is a cheaper price honestly. Things are getting way too expensive and ration whatever I get. Sometimes I wear an outfit for 1.5 weeks and try to be careful around food and exercising too much. Also trying to use household natural things as you said. Hate greedy corporations and boycotting the ones that don't support DEI and funded the orange Cheetos inauguration.",
            "score": 9,
            "replies": []
        },
        {
            "author": "BIGTIDYLUVER",
            "body": "You can still steal the off brand though so we’ll be fine",
            "score": 6,
            "replies": []
        },
        {
            "author": "Asking4urFriend",
            "body": "Fuck that.  Also fuck laundry soap.  All you need is baking soda and vinegar.  Drop of castille soap.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SailingSpark",
            "body": "This is all planned. Fascism came into being in the aftermath of WW1 and the great depression when people had nothing It is only natural for people to look to a strong leader that promises them everything in times like that.\n\nToday, we live in a time with unequaled riches, knowledge, and as close to post scarcity as the world has ever seen.. so the .01% have jacked the prices up on everything from food, to housing, to education, and even water to make us more poor and at each others throats. All in an effort to bring the riches that fascism grants them.\n\nI told my parents 40 years ago that they wanted to bring about neo-feudalism, and they laughed at me, my mother recently told me that I was right. Thankfully my father didn't live long enough to see this, nor my grandparents who fought against fascism the first time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "user_generated_5160",
            "body": "I see their named brand crap doesnt have the fancy tags on'em.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pheonix0114",
            "body": "We switched to laundry sheets. Much much cheaper and our clothes are still clean. If they're really soiled we throw in some vinegar.",
            "score": 3,
            "replies": [
                {
                    "author": "angrybats",
                    "body": "Never used them, I use powder which seems cheaper too",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kalavinika",
            "body": "Making detergent is one of the easiest DIY tasks you can do. And unlike a lot of DIY projects - the up-front investment pays itself off instantly and only takes about 5 minutes to make. \n\nIt costs about $15 for supplies but creates the equivalent of $100-$200 worth of liquid detergent. It also cleans better than liquid detergent, in my opinion, and i work in construction + garden so my clothes get very heavily soiled. Here’s the recipe: \n\nIngredients\n• 1 cup Washing Soda\n• 1 cup Borax\n• 1 cup Laundry Bar Soap (grate with a cheese grater)\n• A container for storage\n\nInstructions\n• Combine all ingredients in container\n• Use approx. 1-3 tablespoons per load",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "You know what? In South Korea, the inflation is worse. One Welsh onion is for 'bout 5$!\n\n\nWhile chaebol are buying buildings for investment, we aren't able to buy our own house to live in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "justababydontbemean",
            "body": "Next is food.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Charming-Score7015",
            "body": "You know...comapanies say that all the products should get moreexpensive by only 2% each year!",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlastIconoclastic",
            "body": "Being protectionist is the solution. Paying workers instead of billionaires is the solution.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FinancialSubstance16",
            "body": "Ironically why people voted for Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CountySufficient2586",
            "body": "Why you should stock up whilst you still can. Probably making things worse if everyone did it but ehh..",
            "score": 1,
            "replies": []
        },
        {
            "author": "n1ckh0pan0nym0us",
            "body": "Equal parts borax, baking soda, soda ash mixed together in a large tub is a whole lot cheaper and works just as well. Scent with essential oil to your liking",
            "score": 1,
            "replies": []
        }
    ]
}