{
    "title": "Herd Mentality",
    "author": "Hamiiitha",
    "subreddit": "Anarchism",
    "rank": 322,
    "score": 30,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ih7r41/herd_mentality/",
    "id": "1ih7r41",
    "selftext": "Even though I truly believe in this cause there is something that deeply disturbs me when showing up to an organisation or event and people are just there nodding their heads in agreement. I feel like I am missing something and even if I agree with what they are saying I feel myself being repulsed by the whole system.\n\nI feel like there needs to be some room for open discussions and thoughts and ideas to come through rather than one spewing their beliefs.\n\nIs there anyone else that has gotten these vibes and worked through them? Should I be trying to quiet this voice? I'm just so confused by it all.",
    "comments": [
        {
            "author": "villagedesvaleurs",
            "body": "I mean I tend to avoid events which are dictated by overly specific ideological constraints and/or don't leave room for healthy discussion. But that being said most events, unless they are direct action/protests, are usually very cordial and people are very accommodating and polite (go figure nerdy leftists are polite).\n\nIs it possible what you're seeing is just the crowd giving space for the speaker of the moment?",
            "score": 31,
            "replies": []
        },
        {
            "author": "Hopeful_Vervain",
            "body": "I'd suggest you bring it up with the people involved if you feel like there could be a better way to hold discussions and share ideas, maybe some people share your feelings and a different approach would be better, or maybe they don't particularly disagree or they don't feel comfortable sharing their thoughts... either way tho, what works best for one person might not work best for another, it's okay to suggest different dynamics, but sometimes you also have to look for a different organisation if this one doesn't feel right to you",
            "score": 10,
            "replies": []
        },
        {
            "author": "sickpete1984",
            "body": "I can relate. Some groups I have checked out also act like a cool kids club. I understand the vetting and security cultural, but to act unwelcoming and elitist is unproductive.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Cpt_Folktron",
            "body": "You want something more. That's good. That means you're alive inside. Keep that fire burning. Be true to yourself. Figure out how to make it happen.",
            "score": 9,
            "replies": []
        },
        {
            "author": "ThoughtFox1",
            "body": "Show up for solidarity, then go do some independent action.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Anarcho_Humanist",
            "body": "There's technically a term for this but I'm not sure what it is.\n\nIf you're not speaking up, the odds are there are plenty of other people feel the same way and also aren't speaking up.\n\nPersonally, I've done this at many protests that are dripping with liberal BS",
            "score": 2,
            "replies": []
        }
    ]
}