{
    "title": "Let the salting begin",
    "author": "Exciting_Chapter4534",
    "subreddit": "Anarchism",
    "rank": 305,
    "score": 100,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ihtse3/let_the_salting_begin/",
    "id": "1ihtse3",
    "selftext": ".",
    "comments": [
        {
            "author": "Nanarchenemy",
            "body": "My feeling definitely is to show up, when/if you can, and contribute whatever skills you have - soup (actually always a great idea :), street medic, legal assist, flyers, etc. Let the salting begin, indeed! Or, if not at the event, coordination from home, a place to rest before/after (for those you know and trust) also super valuable.",
            "score": 35,
            "replies": []
        },
        {
            "author": "OwlHeart108",
            "body": "Collective cooking classes as a way to build relationships while addressing materials needs of the community?",
            "score": 76,
            "replies": [
                {
                    "author": "LunarGiantNeil",
                    "body": "My soup is praxis.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "OwlHeart108",
                            "body": "My praxis is soup 🥰",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "LunarGiantNeil",
                                    "body": "If you need ingredients come summer, I'm growing plenty at my community garden!",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "OwlHeart108",
                                            "body": "Ooooh fresh veg grown cooperatively with love is the tastiest!",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThadiusCuntright_III",
                                    "body": "\"wah, I need this soup...soup for my Praxis\"",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "am_az_on",
            "body": "Remind me again the reasons it's called salting?\n\nI remember learning it before, but then my brain defaults to how salting the earth is a way to kill plants and make sure nothing grows. Much different than the \"salt of the earth\" saying too.",
            "score": 14,
            "replies": [
                {
                    "author": "cristoper",
                    "body": "Just like a few granules of salt can flavor a quantity of food, a few individuals can make a difference in an entire organization.\n\nIn its modern context it usually refers to getting a job somewhere for the purpose of organizing a union (https://en.wikipedia.org/wiki/Salting_(union_organizing))\n\nI'm not sure if the saying is original to Jesus, but he famously told his followers that they were the \"salt of the earth\" and the \"light of the world\", meaning that a few small communities and individuals could make a large difference in the world.",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "sleepy_din0saur",
            "body": "I love sodium!",
            "score": 6,
            "replies": [
                {
                    "author": "waterfowlfriend",
                    "body": "Get that mineral!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 5,
            "replies": [
                {
                    "author": "shmoozygoozy",
                    "body": "salting is a term that means showing up to these mostly liberal protests as anarchists and making our voices heard and leading by example at protests.  Most people out there don't or won't have experience with being out there and dont really know what to do in a lot of situations.   Share pamphlets, advice, be charismatic, organize, bring attention to stuff that will get people mad, hand out pamphlets, tell people they should stand here to block off this road or there to block off that one, be an anarchist.  Protests are anarchists loudest microphone.\n\nIt's kind of a vague and in-the-know term right now, though, like 'fedjacketing'.\n\n(it also has a use in unions which it originated in which I am less personally familiar with, but basically means a union member getting a job at a place in order for the union to communicate with the workers, agitate them, and encourage them to unionize and use labor power)",
                    "score": 67,
                    "replies": [
                        {
                            "author": "am_az_on",
                            "body": "all those federal workers r/fednews won't like that 'fedjacketing' term\n\nthey can be one of the key hubs of the resistance if you want to talk about creating coalitions and building connections",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "shmoozygoozy",
                                    "body": "lol. fedjacketing as a term has been around for a long time and doesn't even disparage federal agents, really lol.  fedjacketing refers to accusing other people of being federal agents or outside agitators.  baseless accusations that someone is secretly a fed or plant doesn't help us.  As anarchists our tactics are naturally pretty immune to feds and too decentralized for any of them to have any real effect.  Obviously, there really are underground police, but throwing cop at someone who you think is suspicious without any evidence is dangerous and could dissolve the whole moment you're in.  As a matter of fact, underground cops will often fedjacket other people.  Newton towards the end of his life had isolated himself from other revolutionaries our of fear they might be police.  Protect urself against underground cops by being decentralized and spontaneous.",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "baconfriedpork",
                            "body": "dang i thought we were dumping salt all over billionaire’s and politician’s lawns so nothing ever grows there again",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Ikxale",
                                    "body": "No we wanna grow food there.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Foronerd",
                                    "body": "To be fair not much is growing on rich people’s lawns",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "advocatus_ebrius_est",
                                            "body": "Yet",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WhippingShitties",
                            "body": "Don't order people around and tell them to block off traffic or whatever, listen to the people you came there to help. Don't use protests as a vehicle to push your individual agenda.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "shmoozygoozy",
                                    "body": "Great, we agree.  No one of us has the authority to order people around.  We should go there to help by using our expertise.  An anarchist is far more likely to have experience handling these kinds of situations and is more likely to have ideas and tactics.  Do you know what to do if police start to kettle you?  How many random liberals have street medic training?\n\nAlso, a protest quite literally is a vehicle for people to push our personal agendas.  That's what it is.  We ARE the people.  Do you hear yourself? \n\nAlso also, do you know what subreddit you're on?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "WhippingShitties",
                                            "body": "Stay on task and don't hijack other people's movements is all that I'm saying. These aren't Anarchist protests, they're for a few specific causes that align with ours, but that doesn't give us any right to undermine people who may be more directly affected than we are. It's a great place to hand out literature and pamphlets. We definitely should be a presence. But if I'm marching for BLM, I listen to black organizers. If I'm marching for women's rights, I listen to women. If I'm marching against capitalism, I listen to other leftists and anarchists. We can definitely use our experience and expertise without hijacking the movement and alienating potential allies.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "icarusrising9",
                                                    "body": "What specific causes? What organizers? What movement? All I've seen are vague \"Trump bad\" sentiments.\n\nAnd anyway, talking to people about stuff is not \"hijacking\".",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "WhippingShitties",
                                                            "body": "https://www.reddit.com/r/grandrapids/s/j7pB26YAs5\n\nLeftist/anarchist orgs alienated a lot of the local Latino protesters in my neck of the woods. This harms our cause.  Just because someone is organizing doesn't mean they're organizing for your specific political opinions and anarchists are not the only people who have experience protesting.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "icarusrising9",
                                                                    "body": "I agree with your general sentiment, but the event you linked seems like it was organized *by* leftists. They didn't hijack it; they literally organized it. Or am I misreading this? It seems more a \"fit the message to the crowd\" issue than what you're talking about; organizers struggled to pivot to more practical stuff when more laypeople showed up than they thought they would (understandable, given the nature of planned talks) but OP (and others in the comments) still thought the event was a success. I don't see any talk of \"alienation\".\n\nI understand where you're coming from, but I think anarchists know not to show up at a protest they didn't organize with a megaphone and start yelling out Kropotkin quotes, y'know?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WhippingShitties",
                                                                            "body": "Yeah, it is a possibility that I'm misinterpreting the complaints. I'm not here trying to argue against organizing or anarchism. I guess I'm just saying it's important to stay mindful and big picture about it rather than trying to get everything done in a day. I'm somewhat critical of anarchism and leftism but that's only because I care and I'm tired of media skew and being scapegoated by public opinion. I know those concerns are probably futile anyway. But I appreciate the discourse at any rate.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "icarusrising9",
                                                                                    "body": "Oh, no, I didn't mean to come off as argumentative! I'm in agreement with your general sentiment. It's important to be cognizant of this sort of thing, you're absolutely right, I feel you.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "shmoozygoozy",
                                                    "body": "What do you think this movement is for if not mobilizing opposition to Trump and Musk's consolidation of power in the hands of the ultra-reactionary?  This isn't a woman's rights protest, it's general protests without an explicit leader.  Historically, decentralized, spontaneous action is what's going to naturally happen in response to what's happening right now.  It's also the most effective strategy.  When and where are anarchists supposed to step up if not here?  It's very possible liberals completely let the energy they have slip by and produce no change.  When that happened in Germany it didn't proceed well.\n\nSaying \"I listen to Black organizers at a BLM protest\" is great, until you start thinking about the fact Black organizers are not spokesmen for a unified group.  There is no manager of women.  There is no leader of black people for you to listen to.  Did you know its possible for Black people or women to be anarchists?  There's whole ideological strains around it!  Who do you listen to when two black organizers at a BLM march give you conflicting orders?  \n\nPersonally, I try to choose how I act and what I do at a protest off principle and practicality.  It's all you can do.  I have my code, and I have what I know might work\n\nYou know how you can really be an ally?  stop being an ally, become an accomplice.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "WhippingShitties",
                                                            "body": "https://www.reddit.com/r/grandrapids/s/j7pB26YAs5\n\nAnarchists and leftists somewhat alienated a lot of the protesters in my neck of the woods this week.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "shmoozygoozy",
                                                                    "body": "I just scrolled down the comments and found a comment literally saying that people who were there and stuck around resonated with a speaker who talked about ICE, and that the OP left early.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WhippingShitties",
                                                                            "body": "That's great, and I'm glad some people were reached. However, I believe it is important to also recognize the people who are not engaged and figure out the reasons why they weren't and find a solution within reason to get more engagement with the community at large.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "shmoozygoozy",
                                                                                    "body": "Theres always be someone who's not engaged, or someone being socially awkward and uncharismatic in front of a crowd.  The biggest argument we can provide is sharing our side and letting reality prove us right.  We shouldn't spend time worrying about every hypothetical person we didn't and probably can't get to.  \n\nIt's too important that we even make a dent in the nonstop flood of horrible shit to worry about how likeable each dent is.  What's the alternative?  Have none?  Have so few ounces of \"leftism\" being shared because we're terrified of not being 100% perfect and forming perfect arguments and polemics for everyone in the world that it might as well be none?  Why does it bother you so much whether or not everyone is reached?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pean-",
                            "body": "Fuckin A1 to all the radical diplomats willing to talk to liberal weenies\n\n\nI've been shitting on them all day and my friends are saying I need to shut up about it but I just fucking hate Liberals and seriously doubt their ability to even be radicalized.\n\n\nThat said, if the cops tear gas and beat peaceful hippy liberal types, I'm certain they'll run towards the black flaggers quicker than a greyhound",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "incandescent_quokka",
                                    "body": "You know a lot of people are liberals because they don’t have exposure to other political ideologies, right? Like a lot of people saying they’re liberal may actually have anarchist/mutualist leanings and just not have a name for it.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Herefourfunnn",
                                            "body": "This is very true. It took someone else letting me know that my beliefs aligned with anarchism. Many of us were socialized to believe Anarchy is a bad word, an awful thing. I knew my views didn’t align with others, but I needed someone else’s input to realize I wasn’t alone in my beliefs. And I’m really fortunate that someone helped me identify it. Right now knowing I’m not alone in my beliefs is helping me to continue on in what I’m working on, even if I don’t really have community where I am",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "HKJGN",
                                            "body": "Mood. This is how I ended up in this sub",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "shmoozygoozy",
                                    "body": "\"That said, if the cops tear gas and beat peaceful hippy liberal types, I'm certain they'll run towards the black flaggers quicker than a greyhound\"\n\nThis is basically the idea.  The state *will* crackdown on liberals.  Our job is to tell them, be there to try and help the ones who continue learn what to do, and go \"IIII TOLDDD YOUUUUUU SOOOOOO\" as much as possible and as publicly as possible afterward. \n\nUnfortunately, the state and capital have a much wider net in terms of controlling the public \"conversation\".  Usually, in my experience, once a protest stops and the media/social media picks it up, the right completely controls the narrative.  I remember one night coming home, red from rubber bullets and tear gas, after being a street medic, and my media-illiterate, liberal father telling me it didn't happen, even when I showed him the bruises.  News, social media, and \"influencer\" media lives in a reality that's just fundementally different than the people who were actually there and saw it ourselves, and I have never been able to change a liberals mind that wasn't there.  Still, we need to grab as many as we can from the pool of people who live in reality and are actually there.\n\nWe need more anarchists, really badly.  No matter how clandestine or guerilla our tactics get, or how many forms of mutual aid we establish, there's not enough of us, and non-anarchists/fellow travelers provide even less than us.  I wonder if anarchists will ever manage to have a real chance at sharing our ideas to the public when things like uber-rich oligarchs, the state and their bots run media and are in this kind of constant gaslighting making a population that doesn’t even know whats real and what isn't.  Maybe it's time to go really grassroots and have anarchist street preachers.  It seemed like it worked in the past.  I've always wondered if maybe we should just completely abandon their media and start dropping off anarchist newspapers on our neighbors front door.  Maybe we should set up public speeches and engage in every audience-gathering tactic possible.  If the crowd gets big enough, the police come, and we repeat?  I know it seems idealistic, but I'm trying to look at things that have worked in the past.\n\nI don't know.  Our numbers don't need to be a majority for us to stop the world from catapulting further into the dystopia it's becoming but we definitely need more people, and we need to tie our ideas to the sort of fundemental ideals most people hold already.  I think salting at protests is one of our best tactics right now.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "pean-",
                                            "body": "I've had the idea of making anarchist newspapers now for a while, after reading Slingshot at a bar once. Would be nice but I don't know how to journalism and I also don't have a newspaper printer lmao",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "brown-foxy-dog",
                                                    "body": "been thinking about producing a local zine. probably shouldn’t let it be a thought anymore.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "shmoozygoozy",
                                                    "body": "look up opendistro.net.  It seems like the site is down for me but you should be able to use the wayback machine.  Also worth it for checking around your area for pre-existing local ones.  Really, a zine style magazine is most effective in subcultures in my experience.  Music scenes n the like.  Most random people have zero interest in reading our personal polemics.  especially not ones which are explicity anarchist.  They're already too scared of the name.  I think the writing has to come after the communities already exist.  Local artists and art scenes are more welcoming to zines.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Florolling",
                                            "body": "What about conservatives like me who are starting to see the light?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "shmoozygoozy",
                                                    "body": "If you're new to anarchism, this sub and r/anarchy101 have some great resources.  If you go to anarchy101 and search beginner, new or intro and check the top results, there's usually something there.\n\nMalatesta was the most convincing anarchist I ever read as a beginner, but that was me personally.  A resource which is weirdly educational, but not really trying to sway you one way or the other too heavily is the tvtropes article on Anarchism.  If YouTube videos are more your thing, Anark and Andrewism are two I personally find helpful.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zealousideal_Bet4038",
            "body": "Huh?",
            "score": 1,
            "replies": []
        }
    ]
}