{
    "title": "Has anyone checked on the homeless?",
    "author": "plain_ass_username",
    "subreddit": "Anarchism",
    "rank": 292,
    "score": 44,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iik3h5/has_anyone_checked_on_the_homeless/",
    "id": "1iik3h5",
    "selftext": "With the ICE raids becoming more and more indiscriminate. I'm worried that the homeless will become targets when/ if they can't provide documentation of citizenship. Have they been clearing camps?",
    "comments": [
        {
            "author": "the_umbrellaest_red",
            "body": "I feel pretty confident that yes, many people in the US have checked on homeless people.   \n  \nDo you know any homeless people in your area? If you're concerned, there is probably a lib nonprofit where people know a lot about their unhoused neighbors on a day-to-day or at least month-to-month basis. You might consider volunteering to gain a better understanding of how ICE raids are impacting them. My experience has been that there's a certain amount of chronically homeless community, although obviously there are people on their own or couch surfing etc. with other community.",
            "score": 22,
            "replies": []
        },
        {
            "author": "EDRootsMusic",
            "body": "They've been clearing camps for years. What metro are you near? Maybe we can connect you with people doing work around this.\n\nEdit: Oh damn, looking at your comment history, I bet I know a TON of people to connect you with.",
            "score": 20,
            "replies": [
                {
                    "author": "plain_ass_username",
                    "body": "My closest metro is duluth mn. A couple hours away anyhow.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "EDRootsMusic",
                            "body": "Ah. The couple hours away does complicate things. Are you already involved in stuff locally where you're at? A lot of the orgs in the Twin Cities that service the camps have ties to the Native orgs down here, since a lot of the homeless are Native. So, I can connect you with people doing work around that in the Cities, or assistance to the homeless in Duluth, but I probably don't have contacts near you, because the networks of activists get a little thin out in the north. Though, I might know folks who know folks, through the pipeline fight or through the community down here.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "plain_ass_username",
                                    "body": "Inbox me",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HeloRising",
            "body": "We haven't had much public reporting to indicate that camps have actively been targeted but it's unlikely they will be. At least not for a while.\n\nThe point of the sweeps is to be loud and public, it's meat for Trump's base who want to see all the \"Mexicans\" who are \"taking American jobs\" be thrown out. That means they largely target workplaces because that's where it's easiest to find undocumented people.\n\nWhen Trump's concentration camp in Cuba opens up, who knows?",
            "score": 12,
            "replies": [
                {
                    "author": "DiogenesD0g",
                    "body": "It’s open. Some victims arrived yesterday.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "katieleehaw",
            "body": "I haven’t heard of any raids from the homeless folks that I help at work.\n\nThere have been police events at the encampment in my town (different from where I work) but no definitive info that ICE has been there.\n\nOur food pantry has been providing what legal info they can to anyone who visits.",
            "score": 2,
            "replies": []
        }
    ]
}