{
    "title": "Is \"fascism\" still a relevant category for political analysis today?",
    "author": "Aleor_28",
    "subreddit": "Anarchism",
    "rank": 249,
    "score": 23,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 69,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ilmd11/is_fascism_still_a_relevant_category_for/",
    "id": "1ilmd11",
    "selftext": "Hi everyone, I’d like to start a discussion about the use of the term *fascism* and whether it remains a useful category for analyzing contemporary political phenomena from an anarchist perspective.\n\nIn many political debates today, especially within antifascist circles, the term *fascism* is frequently used to describe authoritarian right-wing projects and figures such as Trump, Bolsonaro, or Elon Musk. However, I wonder if this usage is still analytically helpful or if, on the contrary, it oversimplifies the issue and prevents a deeper understanding.\n\n**Personally, I believe that antifascism as an ethical horizon will always be relevant.** However, labeling figures like Musk or Trump as \"fascist\" seems problematic to me. Even if they share authoritarian and reactionary elements, applying this label often turns them into mere *Hollywood villains*, making it easier for them to reject the accusation and weaken the critique. Additionally, this broad use of *fascism* may prevent us from identifying the specific characteristics of today’s political and economic landscape, such as **corporate capitalism** or **techno-feudalism**.\n\nAuthors like **Murray Bookchin, Peter Gelderloos, and Noam Chomsky** have criticized the indiscriminate use of the term *fascism*, arguing that applying it to any contemporary form of authoritarianism can be misleading. Instead, they suggest analyzing power structures within capitalism, colonialism, and broader hierarchical systems. (**Edit: I originally made a mistake regarding Chomsky. In fact, he does use the term** ***fascism*** **quite broadly. Thanks to a response from DvD\\_Anarchist on this post, I can now clarify this.**)\n\nSome questions I’d like to explore:\n\n* To what extent does *fascism*, in its historical sense (Mussolini, Hitler, etc.), remain a valid category for understanding today’s authoritarianism?\n* Does the overuse of *fascism* reduce complex political phenomena to historical comparisons instead of analyzing them in their own context?\n* From an anarchist perspective, is it more useful to focus on power structures and hierarchy in general rather than labeling certain movements as \"fascist\"?\n* What do you think of the critiques from Bookchin, Gelderloos, and Chomsky on this topic? Are there other anarchist thinkers who address this issue?\n\nI’d love to hear your thoughts and any relevant bibliography on the subject. Thanks!",
    "comments": [
        {
            "author": "TheTarquin",
            "body": "It's a useful label because it describes an actual (and depressingly common) political tendency. Umberto Eco's \"Ur-Fascism\" lays out it's common strands.\n\n\nIf we don't use \"fascism\", we will still need a word to describe that very real tendency ",
            "score": 90,
            "replies": [
                {
                    "author": "angrybats",
                    "body": "I'll ask another question about these labels. Why so some people think being \"antifa\" is extremist, but saying \"antinazi\" is not?\n\nI also think fascism is useful, specially for those who don't dig into the super-specific flavors of fascism&adjacents to give them a more exact name.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "saturnrazor",
                            "body": "corporate propaganda is why",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "cefalea1",
                            "body": "Because Nazis are the only fascists that killed white people.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "marxistghostboi",
                                    "body": "lmao what? that's not true at all",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "cefalea1",
                                            "body": "Yeah Ik, they brought the settler colonial process used by western powers back to the west and are thus view as the most evil,  thus Nazis are the only genocidal empire to be actually hated by the nations that committed just as horrible atrocities but in the global south, but that doesn't have the same punch u know.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "marxistghostboi",
                                                    "body": "I just mean Mussolini's government also killed a lot of white labor organizers, same with fascist Spain",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "cefalea1",
                                                            "body": "I mean this genuinely cause I don't know, but did the west considered Italians and Spaniards white in 1930s?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "marxistghostboi",
                                                                    "body": "Italians and Spaniards considered themselves white at the time, and it was their own government doing the killing",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cefalea1",
                                                                            "body": "I think the fact that Hitler is more prominent as the literal devil to the west probably speaks to the racism of western nations.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lembocha",
                            "body": "Because some antifas are violent. They are not anarchists, no one who would use violence is.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AKFRU",
            "body": "Two points. Elon Musk literally did a Nazi salute at the Trump inauguration. The assault he is carrying out on the institutions of the nation state are straight out of the Fascist play-book. They use the same rage-bait to mobile their base and target the same minorities as the 20th century Fascists. If they salute like a Fascist and act like a Fascist, it's fine to call them a Fascist. Quibbling over terminology in the face of a Fascist coup seems counter-productive.  \nThat said, there is definitely use in analysing the specific goals and the methods they are employing. It seems that there are competing factions within the Trump administration, on one hand there are the Christo-Fascists who seem hell bent on winding back civil rights and reimposing segregation, and the Techno Fascists / Feudalists of big tech. I'd write more, but I gotta go to work.",
            "score": 41,
            "replies": [
                {
                    "author": "Desperate_Solid8989",
                    "body": "How is the assault on institutions of the nation state, fascist? As an anarchist, shouldn't you want the institutions of nation states abolished?",
                    "score": -10,
                    "replies": [
                        {
                            "author": "AKFRU",
                            "body": "If it was the workers taking over these organisations and running them as part of a stateless post capitalist society, it'd be fucking great, but they are being dissolved in order to be taken over by corporations, putting what was once a service provided to all by taxes on a privatised, for profit basis.\n\nTo quote Mussolini \"The definition of fascism is the marriage of corporation and state\"\n\nSome of the institutions in the firing line are decent projects that the state funds, that we would want people to keep doing after capitalism falls. Stuff like government weather services and the Centre for Disease Control are really useful, we'd want people doing that work and we'd want the info they provide to be free for all.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Desperate_Solid8989",
                                    "body": "So you're a communist, not an anarchist. Why would an anarchist society have government institutions?",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "HotIndependence365",
                                            "body": "Having no community in place to support those whose safety and ability to eat he is jeopardizing in the name of edgelord revanchism isn't the no gods no masters i want. \n\n\nHe's making himself the chief of a kleptocracy that makes humans in the US less connected to each other and thus harder to organize. \n\n\nCelebrating plutocrats imploding democracy is the type of shit that filled media smear campaigns about anarchists in the 90s. ",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Solid8989",
                                                    "body": "I don't care about trump. Or his edgelord revanchism? Whatever that means. All I know is government and state equals evil, democracy is just a way to make you vote for the cooler dooshbag. They all suck. And anything to disrupt the autocracy that is already in place is a benefit",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "HotIndependence365",
                                                            "body": "Not caring about how people are going to be hurt... I guess Congratulations on having enough privilege and protection from the destruction and deportation and extrajudicial murder they are engineering. And a lack of compassion for suffering. \n\n\nBut also if you think they are *disrupting* autocracy as opposed to breaking everything to come into alignment with plutocracy and kakistocracy, you're naive and misunderstanding the reason for opposing the state which is about ending domination. Milquetoast liberal democracy can be your enemy, and you can still prefer it not be sacked and turned into a malevolent, fascistic plutocracy.\n\n\nAnd if you don't understand what any of those words mean, you can look em up. And if you're being purposefully inflexible to not understand what revanchist edgelording is ... Maybe it's inside the house.",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheQuestionsAglet",
                                                            "body": "You don’t care about something you can’t even define?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AKFRU",
                                            "body": "The Institutions wouldn't exist, the people doing that work should probably keep doing that work if they think it is important. They would become Federations most likely, or be part of other federations, I don't know, it would be up to the workers. People will still do medical research and study the weather and the rest of us would probably be happy to feed and clothe them for doing that job as long as we got access to their work.\n\nThe CNT ran public transport in revolutionary Barcelona. Just because the social system changes, the work still goes on.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Solid8989",
                                                    "body": "How is an anarchist society going to ever happen in the u.s. if government institutions don't fall apart?",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Big-Investigator8342",
                            "body": "We want all power to the people and to the individual.away from.the bosses political, economic and religious. The idea that the wealthy further concentrating their power away from.democrarix concessions is not a move away from.authoritarianism it is a move towards something much worse.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "UpstairsRegion",
                            "body": "Dismantling state institutions that prevent overreaches of power, so that you can attain more power is not in line with anarchism.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Desperate_Solid8989",
                                    "body": "There's already an overreach of power, and it's been there for a while. Trump is just naked about it. The goal should be to burn down all state power.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "UpstairsRegion",
                                            "body": "I don't think Musk is getting rid of state power as much as moving it around. They are trying to consolidate it not eliminate it.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Solid8989",
                                                    "body": "I can see that actually, and that is definitely concerning",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "va_str",
                            "body": "You might want to look into the role the industrialists lined up behind Hitler played in the NSDAP takeover. As a German educated in Germany, that picture with the billionaire techbros standing at attention behind Trump was creepy as fuck. This is textbook Nazism, there are no two ways about this. We've learned to spot this because Germany said \"never again\" and we are damn well spotting it right now.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Desperate_Solid8989",
                                    "body": "Sure, Harris and biden also had tech billionairs, wall street bankers, and construction tycoons behind them. I don't ever hear people calling them nazis.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "va_str",
                                            "body": "I can write a lengthy explanation here, but I feel like pretending one single data point somehow is what anyone claims is the indicator is disingenuous in the first place. Especially when you got wrong what the actual point was. It's not that they line up behind a polititian, it's normal for large companies to support the neoliberal order. The point is actually that they turned on a dime, switched sides and realigned with the fascist administration, which is fascist for different reasons. The argument here isn't that the administration is fascist, but that a fascist coup is in progress, signified by the industrialists realigning their priorities. Google just recently changed their AI policy, which previously stated they wouldn't use the technology for weapon and surveilance development. Hyper-lib Zuckerberg swapped over to endorse Trump despite being a life-long democrat. If you can't see the writing on the wall, you don't want to see it.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Solid8989",
                                                    "body": "Idk how that's an absolute indicator of anything besides the ceo's being spineless. A lot of them also where with biden when he was president. Than a lot before were with Obama. So I guess they just get behind whoever is president, because a president has a lot to say about the economical direction of a country. Kinda silly to say that trump is more fascist because the ceos are kissing his ass, even though they kiss every president's ass?..",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "va_str",
                                                            "body": "I feel like you're not reading what I'm writing. And no, they're not getting behind whoever is president either. Funny when I say they pivot and you point out that their support so far was for democrat presidents. Yes, that's what I said. Did they support Trump in the first term? Nope. Did they support Bush? Nope. Did I say Trump is a fascist because industrialists support him? Definitely pointed out that is NOT what I'm saying.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Desperate_Solid8989",
                            "body": "Why is a question being downvoted?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DvD_Anarchist",
            "body": "Of course fascism is a relevant category, as much as in the 30s. Funny how you mention Noam Chomsky criticizing the indiscriminate use of the term, when I've seen he himself saying that corporations are basically fascist, to mean top-down authoritarian.\n\nAfter studying the different perspectives on what fascism is, I came up with the following definition: Fascism is a reactionary, right-wing ideology that is anti-democratic (in the broadest sense of the word, including representative/liberal democracy), anti-communist (against both state and libertarian socialism), nationalist with a victimizing and revitalizing discourse (MAGA in a nutshell), and views violent speech and actions as legitimate means in politics. \n\nConsider these four elements as a checklist for defining a movement or a person as fascist, because it is important to keep in mind is that it’s not enough to take individual ideas or methods to define an organization or a person as fascist, since many ideas and actions are not exclusive to fascism. What matters is the big picture; examining the sum of ideas and actions is what will allow us to determine whether the fascist label fits or not.\n\n  \nMusk and Trump are undeniably fascist. You may have had reasonable doubts to call Trump a fascist in 2016, but not after January 6 and him controlling the Supreme Court and ruling the country as a dictator through executive orders, many illegal ones too, with total disregard to Congress.",
            "score": 16,
            "replies": [
                {
                    "author": "Aleor_28",
                    "body": "You're absolutely right about Chomsky—I made a mistake when writing the post. He came to mind because, when discussing this topic with an anarchist friend, they mentioned Chomsky's comment in *On Anarchism* about how he described East Asian countries as fascist. If I remember correctly, he defined them as state-managed economies cooperating with large conglomerates.\n\nFrom there, we started discussing how this definition could apply to almost any modern state, even before Mussolini, which partly led to the questions in this post. Thanks for the clarification—Chomsky does indeed use the term *fascism* in a very broad sense. I'll edit the post to point this out",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "I agree with just about all that there  except fascism   Extends past right politics.   Many people call out faschism but they way they act is that of faschism themselves.  \n\n\nThis thread posed  an interesting question . I understand where they are coming  from but also agree with who ever mentioned that there’s fascist tendencies that live today unfortunately.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Desperate_Solid8989",
                    "body": "In your opinion, is it fascist to use the nsa to spy on u.s. citizens illegally, or to not get permission from congress before drone striking enemies?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DvD_Anarchist",
                            "body": "Imo those things are not per se fascist. They just show the nature of states and how consent never mattered in a state. One of the reasons why we anarchists want to abolish it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Desperate_Solid8989",
                                    "body": "Lmao what??? So it's not fascist when obama uses the state in an authoritarian matter, but it is when trump does because... of his manner?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DvD_Anarchist",
                                            "body": "All states do surveillance. By your definition, everything would be fascist, and this abuse of the word until because don't take it seriously is something I and others have made called against.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Solid8989",
                                                    "body": "Yes. If you are a true anarchist that should be your proposition. All states who are illegally spying on its citizens and than killing and silencing whoever it wants, is an illegal and corrupt government. Which is why we shouldn't have nation states. Congratulations on finally realizing what it means to be an anarchist",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AutoModerator",
                                                                    "body": "Hi u/DvD_Anarchist - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "DvD_Anarchist",
                                                            "body": "You are a condescending j*rk and you do a disservice by calling all states fascists. Because of people like you normal people then don't take fascism seriously when it really comes. All states are repressive and illegitimate, but fascism is a specific kind of ideology.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Desperate_Solid8989",
                                                                    "body": "I won't report your comment even though you called me a jerk. I could, but I believe in free speech and I know you're really passionate about what you believe so I don't take it personal. I'm glad you don't want to take the term fascism lightly. But in my opinion, obama is as much a fascist as bush or trump, it doesn't matter the party, democrat or republican. They're all evil.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DirtyPenPalDoug",
            "body": "Yes it's relevant as it's it's on the rise in real time right now.",
            "score": 11,
            "replies": []
        },
        {
            "author": "hellraiserxhellghost",
            "body": "Of course it's relevant, just turn on the news and see what's happening right now lol.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Anxious_Comment_9588",
            "body": "it is useful. it has a meaning. when someone fits that meaning, the label is therefore valid. i don’t see how using words as intended turns someone into a “hollywood villain”",
            "score": 5,
            "replies": []
        },
        {
            "author": "C_Plot",
            "body": "Fascism is quite a useful category for today’s discourse and very apt in contemporary society. Fascism itself is not authoritarianism and domineering hierarchy. Rather, fascism is a strategy to achieve domineering hierarchy, by appealing to the basal hatreds and bigotries within the working class—so that those hatreds and bigotries entirely eclipse the  material and spiritual interests of the working class for  their fully dignity and equality. The hatreds and bigotries overwhelm all political discourse so that the authoritarian autocratic tyrants might impose their most sadistic whims upon us. First they come (with these hatreds and bigotries) for the communists, … then anarchists… then socialists…, then immigrants…, Palestinians, … Muslims, … and on and on—concocting a hated out-group set for smiting by a “heroic” all powerful (“Teutonic”,) tyrannical and totalitarian State (“only I/we can destroy those you hate” is the claim of the tyrants).",
            "score": 3,
            "replies": []
        },
        {
            "author": "Remote-Remote-3848",
            "body": "It is what it is.  Relabeling something as something else dosen´t make it more Up to date, I don´t think there is a need to make up new categories for fascism. Maybe you could but there is like spraying dog shit with gold spray, it is always gonne be dog shit even if its golden so why relabel it?\n\nMenthol ciggarettes is still dangerous and .... yeah its gonne kill you even if its another label . Like light ciggarettes or menthol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "triangle-over-square",
            "body": "i think fascism is the natural conclusion of the evolution of any state system. the second we created institutions (political or economic) that had a central motivation to grow and control we planted the fascist seed. It might not be useful talking to everybody, in every context.\n\nI think that fascist is often used an anarchist buzzword, or as an appeal to emotions. Sometimes this might be valid, depends on function. I agree that we need other words to describe a range of authoritarian systems",
            "score": 2,
            "replies": []
        },
        {
            "author": "AmarzzAelin",
            "body": "About new class dynamics I recomend A hacker manifesto by McKenzie Wark",
            "score": 2,
            "replies": []
        },
        {
            "author": "tzaeru",
            "body": "In regards of how I factually see things, I usually call them proto-fascists if the context is fascist leaders (though their ideology might really be actual fascism. At least for Musk). These kind of people are not necessarily the same who might end up being fascist dictators themselves; they are the people who set up the groundwork that allows easy fascist takeover.\n\nThese are the von Papens and Hindenburgs, the Emmanuel IIIs, Óscar Carmonas.\n\nBut yes, there's also of course pretty obvious differences from the sort of fascism Europe saw around WW2. Which can mean that fascism is a bit inaccurate term. The backgrounds tend to be different - historical fascist dictators were by large military officers, who utilized the dying traditions of monarchism for support. They weren't necessarily supportive of the wealthy (though often were allied with many oligarchs and the general bourgeoisie) or come from a wealthy background themselves.\n\nThe similarities are pretty striking tho. Nationalist ethos, militarism, conservatism, autocracy, naturalized social hierarchy, .. so yeah - that's fascism.\n\nWhen communicating these things, I think it can be a fair approach to not focus too much on the individual leaders, and rather focus on hierarchical systems like capitalism, or even centralized state apparatuses overall, having the tendency of spawning fascism. Trump or Putin or whatnot, those are the individual leaders, but it indeed is the underlying system that has allowed their raise to power.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Over-Employment-2241",
            "body": "People don't want to hear this, but I think it's a little cartoonish to think Elon is actually a Nazi. I don't know if he did the salute to be an edgy asshole; he could also have done it by accident. I cannot imagine any situation that - as bad as everythting has become - that an Nazi salute would be openly supported. Even people who we would call racist and right wing are hardly actually Nazis or even anti-Semetic.\n\nI do believe the actions of Elon and Trump are \"fascist-like\" just because they do support the fascist core of the Trump administration: anti-immigration policies, the extinction of the Palestinian people, regid social structures, denunciation of civil rights, and devotion to the state leader and (nominally) the state.\n\nRegardless, Trump, Elon, etc. are not fascist: they believe private power over state power, and they're not idologically fascists. I don't doubt elon and Trump are racist in various ways as Trump is damn near an 80 year old white man from the U.S., and Elon is a filthy rich, middle-aged white man from South Africa; of course they are racist in some way.\n\nThis is pedantic on my part as I know that when people reference fascism, they usually are not concerned about the role of ideology in its construction; they usually are concerned about the results of fascism, which current America is trending towards.\n\nI think we should acknowledge the reality that Trump is a dangerous human being; I'd argue he's the most dangerous individual due to his views on climate change. I don't know if he's racist because he really seems to be about himself, and I doubt he cares even about \"white Americans\" or any kind of ideology. It give him too much credit.\n\n  \nHowever, the term fascism comes with a lot of baggage, and I think its use as a catch all perjorative term for authoritarian goverment and racist does three things: it sometimes keeps us from working with people that we label \"Nazis\" because we have this conception of the barbaric nature of the Nazis and their supporters; it promotes the idea that the Republican party is actually fascist and isn't merely absurdly pro-business and anti-human opportunists; and it ignores how closely the Democrats - who I don't think any of us would call fascist - mimicked a lot of the fascist policies, as well, including shelling Gaza and promoting immigrants as taking our jobs.\n\n  \nMaybe I'm covering for fascists by saying all of this, and again, I believe it is pedantic in many ways. But I think we draw a hard line, call people \"fascists\" or \"fascist supporters\" and ignore that individuals have developed these thoughts outside of a strong ideological movements. I know a lot of common, working-class and middle -class Americans who believe immigrants are taking money out of our system, that America should come for, or are not as supportive of certain civil liberties for a host of reasons, usually due to issues in education.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chemical_Country_582",
            "body": "Yes and no. \n\nFascism is in some ways a very specific ideology, being that of Mussolini and Evola. However, the continuation of the same trends as seen in the far right of Europe and South America is similiar enough that we can call it the same thing, in the same way that the UK, France, and Switzerland are all democracies but they express it very differently. \n\nIt is useful to know what is fascism in a pragmatic way. United fronts work, and - as seen in the recent French elections - sometimes it is more important to prevent Fascists from getting into power than it is to be principled and refuse to work with anyone else. It's important to know who we can work with or against. \n\nEco's essays on fascism are probably an excellent start. Understanding what people are on about is helpful too, so either the moustache man's angry screeching known as \"Mein Kampf\" or Evola's \"Revolt against the Modern World\" are probably good to read as well - in that they help us see the emotional and spiritual reasons why someone would become fascist. See if you can pirate a copy rather than buying it though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andWan",
            "body": "„Tech fascists“, a label that „my brothers“ have just received in this comment: \n\n„Nobody cares except your fascist tech bros. Fuck off\n\nGo cower in fear of rockos basilisk or whatever you freaks do for fun“\n\nunder this repost of mine: https://www.reddit.com/r/PhilomenaCunk/s/Kz3hgdYDam\n\nI think the comment is not completely off the truth. AI is indeed a dangerous game (of power) even outside the current relationship of tech billionaires and US politics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MostPsychological602",
            "body": "of course it is. i’m reading a book right now that does distinguish between “historical fascism” and “neo-fascism” (which maybe is what you were trying to get at?) but neo-fascism is just seen as an evolution of historical fascism— think similar to liberalism turning into neoliberalism. not using the word fascism is doing a disservice to the anarchist movement, the anti-fascist movement, and honestly does a disservice to anyone attempting to accurately describe what is happening globally right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/gravewisdom - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Legitimate-Ask5987",
            "body": "I did some reading of Mussolini's brand of fascism; it is chilling to see how these people tried to use social science to justify themselves. Fascism begins with fostering nationalism and patriotism to a degree of fanaticism, where your loyalty to the state is the same as your loyalty to the land you live on. The USA has been fostering this brand of white supremacist ideology from its foundations. Those in power tie patriotism to God, they deify the flag and make it a moral imperative that if you don't like the government, you can't be in the USA or you're an enemy of the people. We are in the slow creep to it, fascism is a more open ideology than one would think.\n\n\nAlso, Bookchin is not an anarchist he is a libertarian municipalist and has documented his disagreements with anarchism and Marxism. Chomsky is a linguist and obviously has more weight in this, but he's not a sociologist or an expert in fascism. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "RagingBillionbear",
            "body": "After watching the current US administration action, I have no qualms calling them fascists for two reason.  First, it is accurate.  Second, they don't like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cybin333",
            "body": "centrist",
            "score": 1,
            "replies": []
        },
        {
            "author": "Florolling",
            "body": "I can tell you as someone who has there foot in the left and right that those on the right think it’s an absolute joke that the left is using the term to describe Trump and Musk. And they also believe it further discredits anything of substance the left has to say. Keep in mind that everyone who voted for Trump was willing to vote for him even though he became a convicted felon, even though he lost a sexual assault civil suit. I think a big reason for this is sensationalism on the left. People don’t believe the left when they say things because they are so overly dramatic. \n\nOne of my big things with using the term fascism is that it denigrates an entire generation of people that went through the real horrors of fascism. Now, it being thrown around for the smallest little grievance that people on the left might have against the right. I don’t even know if most people even have a clue of what fascism is. I’m sure a lot of people are just parroting main stream media or other leftists in their life. \n\nI agree with in that whatever it’s called that Trump is doing it should be thoroughly analyzed and properly labeled.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mcchicken_deathgrip",
            "body": "It's an almost meaningless term nowadays, at least in the way its used in the popular lexicon. If you want to define it using its actual political theoretic definitions laid out by Mussolini, then people like FDR, Bernie, or Stalin are more fascist than Hitler was. Classical fascism was basically a program that declares humanity needs to shrug off class struggle and instead have classes come together under the banner of the state, and that an incredibly strong omnipotent state with all its citizens united under the banner of extreme nationalism will deliver the ultimate form of society. It's class collaboration committed via a state that takes on an almost spiritual characteristic. \n\nBut as you said, most people aren't using that definition of fascism. They're mostly just talking about conservative authoritarianism. I agree that it's reductive to call any right wing movement fascist. However in reality, it doesn't matter much how you label authoritarian right wing movements. Call out why exactly they are our enemies by highlighting their beliefs and actions. Using a thought terminating label by just declaring them fascist is insufficient.",
            "score": 0,
            "replies": [
                {
                    "author": "Florolling",
                    "body": "👏 well put",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Worried-Ad2325",
            "body": "I'd be more interested to hear arguments to the contrary of this. Fascism remains relevant because it hasn't changed its form at all in the last century. There's nothing that meaningfully distinguishes the desired outcomes of modern Nazis from the Nazis of yesteryear.\n\nLikewise, the political tactics, contributing trends, and methods of governance all remain the same.\n\nThe political cure also remains the same. Rock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoNoSabathia64",
            "body": "I don't have anything to add to this specific discussion, but it does seem like hyperbole is a big problem with anarchists and other leftists and it might be good to work on that.",
            "score": -8,
            "replies": [
                {
                    "author": "LunarGiantNeil",
                    "body": "Hyperbole is used by all political factions, except perhaps some forms of extremely moderate liberalism, which studiously refuses to take a stand against Fascists from the perspective of politeness.\n\nIt's good not to be hyperbolic but it's such a common trait that it's hardly worth worrying about. \n\nWe aren't in the situation we're in because we were using insufficiently precise political language.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Florolling",
                    "body": "I agree",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ordinary_Passage1830",
            "body": "Well, for people using the term fascist for non fascist groups and organizations, yes it is, it becomes a word to throw like communist. What I mean is that it sounds redundant and definitely loses meaning\nBut I think it's important to use terms that signify a person or people's ideology and actions. Not every authoritarian is a fascist but all fascist are authoritarian",
            "score": -1,
            "replies": []
        }
    ]
}