{
    "title": "How influential is the Durruti Group's updated anarchism on anarchists in the west?",
    "author": "Big-Investigator8342",
    "subreddit": "Anarchism",
    "rank": 200,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ip2u75/how_influential_is_the_durruti_groups_updated/",
    "id": "1ip2u75",
    "selftext": "\nThis version keeps the revolutionary tone and key terminology while avoiding terms that could be get it taken down. I had to run the old words of the durruti group through a PC AI to soften and tone down the 1930s anarchist lanuage to  be more sensitive and anti-oppressive ironically.\n\nThe collapse of an anarchist revolution that had everything in its favor was a pivotal moment. The Durruti group identified key structural weaknesses and sought to address them to prevent similar failures in future anarchist movements.\n\nThey followed apolitical theories to their logical conclusion and recognized a critical issue: the absence of political decision-making structures necessary for the coordination necessary to sustain the revolution.\n\nIn 1938, they proposed a program with a strategic adjustment to anarchism. How influential have their insights and warnings been on contemporary 21st-century anarchist thought in the West?\n\nOur Programme\nRevolutions cannot succeed without clear objectives and direction. The July Revolution demonstrated this shortcoming—while the CNT had the strength, it lacked a cohesive plan to channel revolutionary energy. Leaders were caught off guard and uncertain about how to proceed. The result was hesitation at a moment when decisive action was essential, ultimately leading to the revolution’s loss.\n\nThese critical junctures leave no room for uncertainty. There must be a clear path forward. We aim to address this gap, ensuring that the lessons of July and May are never repeated.\n\nTo this end, we propose a strategic modification to anarchism: the establishment of a Revolutionary Junta.\n\nThe revolution requires organized bodies to oversee and defend it against hostile elements. Experience has shown that opposition will not simply fade away—it must be confronted. While some anarchist comrades may have ideological concerns, the reality of events demands that we take a firm stance.\n\nIf we wish to avoid repeating past mistakes, we must act decisively against forces that do not align with the interests of the working class.\n\nKey Proposals:\n1. Establishment of a Revolutionary Junta or National Defense Council.\n\nThis body will be formed through democratic elections within union organizations. Consideration will be given to those at the front, ensuring their right to representation.\nThe Junta will not interfere in economic matters, which remain under union control.\nFunctions of the Junta include:\nCoordinating defense and managing the war effort.\nMaintaining revolutionary stability.\nHandling international affairs.\nConducting revolutionary outreach.\nPositions will rotate regularly to prevent entrenchment, with trade union assemblies exercising oversight.\n2. Economic Power to the Syndicates.\n\nSince July, unions have demonstrated their ability to manage economic production effectively. Their role must be fully recognized and elevated.\nAn Economic Council, aligned with industrial federations, may be established to enhance coordination.\n3. Free Municipality.\n\nBefore foreign rule, Spain had a strong tradition of municipal autonomy. This decentralized model must be revived to prevent the formation of a new state system.\nIn the new society, governance will be handled by local municipalities, supported by unions. Since all members of society will be producers, there will be no inherent conflicts of interest.\nMunicipalities will be organized into local, regional, and national federations, maintaining strong ties with the unions at every level.\nTowards a Fresh Revolution.",
    "comments": [
        {
            "author": "EDRootsMusic",
            "body": "Because there has never been a syndicalist revolution since Spain, the program of the Durruti Group is something that anarchists debate, but has never really been put into practice since. It seems obvious to me, however- and I say this with the experience of having been a coordinator of community self defense, attached to a syndicalist union- that a revolution cannot be done by labor alone, without a plan for defense. A program for the defense of the revolution in a coordinated way, accountable to the control of the syndicates and other federated, democratic bodies of the working class, is absolutely essential. If anarchists do not form such means of defense, then other parties will step in to do so, and their monopolies of violence and of authority will become, as history has shown us repeatedly, the gravediggers of the revolution.",
            "score": 5,
            "replies": [
                {
                    "author": "Big-Investigator8342",
                    "body": "So, the fact that these forms are a prerequisite for a revolution to endure for any time shows why the libertarian socialist revolutions, as they are so-called, put the insights of the Durruti group into practice.\n\nIn my opinion, Syndicalism is not the big takeaway from Spain. The people can self-manage politics and the economy without bosses or the state. \nThere are jobs in political self-administration that are bigger than those in economics or local issues. That is where the durruti program, Zapatista or democratic confederalism, or like what Bookchin suggests, lays out the space for mandates delegates and civil society to ensure that work gets done too.\n\nAnother point is the relationship to religion in an anarchist society. The Durruti group took a hard line against religion that maybe does not square with freedom of association and expression...because the Catholic fascists were such a problem.\n\nThe question of religion's reactionary nature and possibly the fact that it is rich with meaning and will necessarily be a factor in a free society --that needs addressing is worth discussing, too.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Big-Investigator8342",
                    "body": "What do you think it would take to promote greater awareness and debate around the Durruti group and their  update of anarchism? What is in the way of this discussion really happening among anarchists today?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EDRootsMusic",
                            "body": "Well, on a broad level, anarchists today are mired in some very basic debates, like between left and post-left, revolutionary and anti-civ/promitivist, what Bookchin called social and lifestyle. So, a lot of discourse is eaten up there. But more importantly, we remain a small movement. We grew in the 90s and 2000s and even 2010s, but in the 2020s as the left is reborn, people flock to social democracy and Marxism. We need a mass movement that takes revolution seriously to have such debates. That's not to say no serious debates exist. But, Durruti Group's work is very focused on security in a syndicalist model. No such model exists today unless and until we build the syndicalist unions. In the 2010s, CNT models were a hot topic of discussion in the NARA IWW GDC. \n\nThis discussion happens, mostly, among deeply involved anarchist geeks who love this history. It should continue to happen, but to win a mass support for our ideas, anarchists must be at the front of labor, community self defense, mutual aid, and other struggles, always promoting anarchist models and praxis as our framework.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Big-Investigator8342",
                                    "body": "It is why Marx had so many adherents that the framework was easy to comprehend, and the method of winning the revolution was easy to comprehend. The reason they advocate using that method is also evident.\n\nAnarchism as you point out in the minds of the masses and in the minds of many anarchists lacks clarity even in theory under the best v conditions on how anarchists would create an anarchist society, how it would work, how people might relate politically and how might the balance of power be organized so that the people are sovereign so the anarchist principles are upheld in how society is organized, not by chance but by organized choice.\n\nAnarchism is intuitively appealing as it works on the day to day and resonates with lived experience. The thing we keep saying the more detailed the dream the better you are able to realize it also applies when people dream of anarchy. People have to have an idea what it could be when the workers win. We use the spanish revolution to poimt out the proof of concwpt yet despite the many many beautiful successes we have a political failure.\n\nWith the Durruti group and other examples that appear to practice their version of anarchism we can point to anarchism that survives repression and war and upholds and reproduces the anarxhist society and ideals we aspire towards.\n\nThis dissonancw betwewn dreams and reality I tjink can be bridged by dreaming with lessoms learned in memory. Not abandoning anarchism just allowing it to be updated after almost 100 yeats.\n\nI wonder what does it take for that shift to happen? I know that education like how we learn and teach and con ect has cbanhed so much. I imagine in person discussions in assemblies or something. Or like really kick ass videos?\nI guess the word could get out anh way. I wonder what has taken it so long?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SkyBLiZz",
            "body": "sadly theyre not influential at all. they have some recognition in platformist circles but even there theyre not that popular.  which imo at least is partially because of the language they used like \"Revolutionary Junta\" and thus were accused of \"marxism\" and \"trotskyism\" even tho stuff like the coordinating defense and managing the war was also done by the anarchist specific group in makhnovshchina.",
            "score": 3,
            "replies": [
                {
                    "author": "Big-Investigator8342",
                    "body": "It was sort of done in Ukraine out of necessity. Accepting that necessity and how to accommodate that within anarchism is a big step toward making successful anarchist revolutions.\nI see this vast gap; when movements apply the Durruti group insights, many anarchists seem shocked and dismayed, even though they are all aware of the Spanish revolution and why a revolution of the vast majority of the country lost quickly after showing such promise.\nThose movements, they admit, are directly self-managed and exert direct control and rotate leadership regularly, representing a fundamentally freer and stateless society--in that there is no ruling and ruled class, and autonomy and freedom of association and self-determination are respected. The economy is also mixed and primarily cooperative.\n\nSo many anarchists act like they do not understand why any of those are in place.\n\nYou say the platformists also aren't very aware of the Durruti group? To me, it should have been a fundamental debate and altered anarchism to resolve that revolutions are both economic and political and that we actually have an answer to the Marxists about how anarchists will organize the defense and administration of the revolution.\n\nDo you know if others have looked at Rojava or the Zapatistas through the lens of the Durruti groups' insights?",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}