{
    "title": "What Are You Reading/Book Club Tuesday",
    "author": "AutoModerator",
    "subreddit": "Anarchism",
    "rank": 148,
    "score": 24,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/Anarchism/comments/1is5wgo/what_are_you_readingbook_club_tuesday/",
    "id": "1is5wgo",
    "selftext": " What you are reading, watching, or listening to? Or how far have you gotten in your chosen selection since last week?",
    "comments": [
        {
            "author": "DrMisterius",
            "body": "Reading Debt by David Graeber now. Very good read that is helping me come up with ways to refute the idea of capitalism as being a natural extension of human nature.",
            "score": 19,
            "replies": [
                {
                    "author": "anarcho-slut",
                    "body": "Capitalism is whiteness. Shameless plug here, but, \n\nr/abolishwhiteness\n\nAlso i just finished Debt..., The Dawn of Everything, and Pirate Enlightenment: The Real Libertalia. All awesome!",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Article_Used",
                            "body": "that middle title is soon on my list, read debt last year and finished pirate enlightenment recently! \n\ndebt is such a great read",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OceanofChaos99",
            "body": "Just re-read The Dispossessed by Ursula K Le Guin. Even better than I remembered it",
            "score": 13,
            "replies": [
                {
                    "author": "NoBackground7266",
                    "body": "Such a great book, it was hard for me to get into at first but I loved being able to see an example of an anarchist society, despite it having its flaws",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OceanofChaos99",
                            "body": "Honestly I love that it's not perfect, it's a more realistic portrayal of what an anarchist society might look like and we should not pretend it would solve every problem we've ever had. Of course it'll be a hell of a lot better than capitalism/authoritarianism but you can't expect a utopia, and you must build it yourself",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "NoBackground7266",
                                    "body": "Beautifully said",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoBackground7266",
            "body": "Currently working through the audio book of Emma Goldmans anarchism and other essays. I go slow though because a lot of my mental capacity goes towards studying my second language which is my primary goal at the moment",
            "score": 10,
            "replies": [
                {
                    "author": "piercethecat13",
                    "body": "I read anarchism and other essays in April and ended up using it as a source in an essay for my comp class. I also used the communist manifesto as a source I ended up getting a 97% on this essay.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RepresentativeAir723",
            "body": "I am reading both \"Anarchism and other essays\" by Emma Goldman as well as \"Reform or Revolution\" by Rosa Luxemburg.",
            "score": 5,
            "replies": []
        },
        {
            "author": "FroggstarDelicious",
            "body": "Anarchism in Latin America by Ángel J. Cappelletti. The cover art alone on this book is worth it. https://www.akpress.org/anarchism-in-latin-america.html",
            "score": 4,
            "replies": []
        },
        {
            "author": "eat_vegetables",
            "body": "Spartacus - it’s  historical novel by American writer Howard Fast. It is about the historic slave revolt led by Spartacus around 71 BC. The book  inspired the 1960 film directed by Stanley Kubrick\n\n> Howard Fast self-published the novel in the United States during the McCarthy era in 1951. He began writing it as a reaction to his imprisonment for charges stemming from his earlier involvement in the Communist Party USA. He had refused to disclose to Congress the names of contributors to a fund for a home for orphans of American veterans of the Spanish Civil War. He was imprisoned for three months in 1950 for contempt of Congress.",
            "score": 4,
            "replies": []
        },
        {
            "author": "9911MU51C",
            "body": "Not really anarchy themed but I’m re-listening to Red Rising",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nonchalant_Khan",
            "body": "Watership Down.",
            "score": 4,
            "replies": []
        },
        {
            "author": "LunaBeanz",
            "body": "Re-reading Breakfast of Champions (Kurt Vonnegut) this week because I need something to laugh about with my home country under the thread of invasion by fascists.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Article_Used",
            "body": "*A Participatory Economy* by Robin Hahnel\n\nKropotkin’s *Mutual Aid* (free ebooks available!)\n\n*Orwell’s Roses* by Rebecca Solnit, just picked this one up recently & it’s good and poetic so far!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Daringdumbass",
            "body": "Gaza faces history by Enzo Traverso",
            "score": 4,
            "replies": []
        },
        {
            "author": "bouncingpaperwad",
            "body": "'The Savage God: A Study of Suicide' by A. Alvarez",
            "score": 3,
            "replies": []
        },
        {
            "author": "ghostchiefmnt",
            "body": "Willful Disobedience by Wolfi Landstreicher",
            "score": 3,
            "replies": []
        },
        {
            "author": "Marionberry_Bellini",
            "body": "Just finished Matt Christman’s book *No Pasarán”.  It’s by one of the Chapo Trap House Boys about the Spanish Civil War.  Pretty short and sweet, while I don’t think I really gained a whole lot from it (I’ve read several books on it already) it was still a fun read especially with his commentary and approach to breaking it down.\n\nAlso halfway through rereading *The Two Towers*, not really relevant but figured I’d mention it.\n\nNow that ive finished *No Pasaran* I’m probably gonna get started on a big ass book about the history of European Social Democracy and Christian Democracy next",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Marionberry_Bellini",
                            "body": "My degree is in politics I read about all kinds of political ideologies/history regardless of whether it’s what I believe or not.  If it was solely a book on the history of Christian Democratic parties (a center-right political movement) I’d still read it.  I don’t remember the name of the book though (not at home rn)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "piercethecat13",
            "body": "Women Race Class by Angela Davis",
            "score": 2,
            "replies": []
        },
        {
            "author": "LunitaCor",
            "body": "The Dawn of Everything by David Graeber and David Wengrow",
            "score": 2,
            "replies": []
        },
        {
            "author": "GruttePier1839",
            "body": "Reading Blood Meridian right now. It's really fucking good and I'll probably be finished with it at the end of the month. Going all out with annotating post it notes because there's so much vocabulary that I wasn't familiar with.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Elegant_Rice_8751",
            "body": "King Solomon's mines by H Rider Haggard.",
            "score": 2,
            "replies": []
        },
        {
            "author": "your_friend_red",
            "body": "The Seers by Sulaiman Addonia",
            "score": 2,
            "replies": []
        }
    ]
}