{
    "title": "Are there any home security systems that aren’t terrible?",
    "author": "Jierdan_Firkraag",
    "subreddit": "Anarchism",
    "rank": 143,
    "score": 24,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Anarchism/comments/1isgofg/are_there_any_home_security_systems_that_arent/",
    "id": "1isgofg",
    "selftext": "Help me techy comrades!\n\nI recently had something happen (obviously not going to go into details) that makes me want to take extra precautions about my safety.\n\nI want some kind of home security system, but I am not comfortable giving that data about myself to some company (especially something like Ring that will work with the police because ACAB).\n\nHere are my questions:\n\n1) Are there any companies that do home security systems with halfway decent data and privacy policies?\n\n2) Is it possible/feasible for me to set up my own camera system to go only to a local storage of a non-internet connected computer? Is this something a hobbyist with a soldering iron (me) could do without electrocuting themselves or breaking the law (since there might be laws about keeping video if the camera can see into a neighbor’s property from the angle it’s at)?\n\nThanks!\n\nNEXT DAY EDIT: Thank you all so much for the great suggestions! I think I’m going to set up a hardwired system like one of the ones suggested. Now I just need to research the best one.",
    "comments": [
        {
            "author": "Federal_Ad_5898",
            "body": "An old school wired cctv is easy to install and doesn’t need to be web connected. It’s plug and play. The control box will link to any computer monitor/tv and will record either everything with a self rewrite over a given period of time, or it can record events (adjust sensitivity) such as movement etc.\n\nIt’s really easy and not expensive. Hardest part is fitting the cameras, but they can also be inside (though be wary of reflections from windows)",
            "score": 34,
            "replies": [
                {
                    "author": "Jierdan_Firkraag",
                    "body": "Thanks! That seems the way to go. I’m hoping that extremely conspicuous cameras are in and of themselves enough of a deterrent (though hopefully I never need even that much).",
                    "score": 11,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Hi u/Englander580 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Hi u/Englander580 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jasonbaby19eighties",
            "body": "My partner and I set up four security cameras, Hiseau brand, that have 3 terabyte storage and 4k feed to a second monitor on my partner’s computer. They are wired cameras that came with 100ft of cable each. All it involved was a ladder and drilling through the wall. There is also an app for the cameras and only you see your camera feed.\nThis whole setup cost us about $500 and was easy enough to install for not the handiest people in the world.",
            "score": 5,
            "replies": [
                {
                    "author": "thejuryissleepless",
                    "body": "why did you get Hiseau over others?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jasonbaby19eighties",
                            "body": "mainly was looking for video quality and they were the ones with the highest fps of any consumer-grade systems I could find.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jierdan_Firkraag",
                    "body": "That sounds pretty good! I’ll look into that brand. Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LostInIndigo",
            "body": "We have Eufy cams and it’s not connected to the internet at all unless you want it to be. No montly fees etc either.",
            "score": 4,
            "replies": []
        },
        {
            "author": "dashibid",
            "body": "a dog?",
            "score": 8,
            "replies": [
                {
                    "author": "clickrush",
                    "body": "Dogs are great and they obviously provide some level of security.\n\nBut I will state the obvious, just to be sure, that one shouldn’t get a dog just for security.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "TCCogidubnus",
                    "body": "I once had to get some professionals to break me back into my house after locking myself out. They weren't sure whether they should go in or I should to unlock the door, until my unusually large huskies arrived at the window frame with great enthusiasm and suddenly they were very very sure whose job it was to stick a limb in first.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "LaurenDreamsInColor",
                    "body": "Came here to say that. Dogs. They are the best. And cow bells strung around in different entry places that the dogs will hear in the middle of the night. And signs that say: beware of dogs.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "J4ck13_",
            "body": "It's been a while since I looked but there are some off brand systems that use a sim card (basically a stationary pre-smart phone cell phone built into the control pad) to call preprogrammed numbers and deliver (at least) audio of what's going on in your house after the alarm's been tripped. So iow there's no monthly fee or monitoring service as long as you use a prepaid sim -- so no cops involved. These are generally modular kits that include window and door sensors, movement sensors, glass break sensors etc. And I would imagine higher end ones have cameras too. There are even systems that include the option for networked fire and/or flood alarms which can be useful. And of course the audible alarm part. Some of them include the option to remotely talk to or yell at the person who broke into your house! \n\nI'm including an [example](https://www.amazon.com/Wireless-Security-Detector-Notifications-Compatible/dp/B09SZG3DC4?source=ps-sl-shoppingads-lpcontext&ref_=fplfs&psc=1&smid=A1039P2GNFPVKE&gQT=1) but there are a lot of other options out there and I can't specifically vouch for this one. This is a giant rabbit hole that can eat up hours or days looking at all the options, so be aware of that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bananasRtryntokillMe",
            "body": "r/homesecurity is where I did a bunch of research and got a Reolink system. I hardwire with Ethernet into a DVR and from there to my computer. I have an app and I hdmi from the dvr to an old Roku so the feed is always on in my office. It can be pricy and I use it as more of a visual deterrent.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Subversing",
            "body": "If you own the home, get wired sensors. Wireless can get drowned out by jammers and never report an intrusion. \n\nI created my own security system using [Home Assistant](https://www.home-assistant.io/blog/). Hard to get better than that in terms of data privacy. It's definitely not for everyone though. It's a good route to go if you already have some IoT stuff.\n\nFor cameras: [Frigate NVR](https://frigate.video/). You can route lots of brands video feed into this, and it has the capability to detect pretty much anything from cars to insects to peeing dogs, but for the special stuff you need to train the recognition engine, which is an involved process if I remember correctly. \n\nFrigate has a Home Assistant integration so once you wire cameras up and send them through frigate, you can monitor those feeds through home assistant from your phone or even wall-mounted tablets, get notifications when the cameras identify something, run automations based on detections, etc. It's a fun tech stack. Vast majority of the coding is YAML with a sprinkling of Python, so it's simple to set up. And these days, pretty much everything in both systems can be done via the UI. \n\nYou can run both systems 24/7 on the same machine if you use a hypervisor like Proxmox.",
            "score": 2,
            "replies": []
        },
        {
            "author": "satanismysponsor",
            "body": "Reolink NVR all local build it yourself it's not hard. Local data. I bought a house and with no experience set up 8 cameras and notifications really easy it was just plug and play with small adjustments once installed. All hard wired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LoveCareThinkDo",
            "body": "They sell kits to do a full CCTV system at Costco. You can order them online and set up your own system. \n\nIn any decent sized city there are probably at least a few security system contractors left. You can get them to install a whole system, and simply leave out the part where it automatically dials them or the police if there's a break in. In old school security systems, all they used to do is simply dial their home office, and then their home office would call you and make sure that it wasn't a false alarm, and then call the police. But, you had to have an actual phone line for that. \n\nAnother option is to have an alarm system essentially have a cell phone built in that merely calls your cell phone. But, I don't know of any of those exist.\n\nSource, I used to work for a burglar alarm company. Essentially, it's nothing but an electronics circuit board that connects to a bunch of switches, and then sets off alarms if those switches aren't behaving the way the electronic circuit board expects them to. What those alarms do is kind of up to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight_Account_7605",
            "body": "Shotguns and big ass dogs",
            "score": 1,
            "replies": []
        }
    ]
}