{
    "title": "Hope and resistance",
    "author": "None",
    "subreddit": "Anarchism",
    "rank": 133,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iu3bzi/hope_and_resistance/",
    "id": "1iu3bzi",
    "selftext": "Dearest lovers and fighters,  \nEspecially to my comrades and siblings residing in the so-called \"United States\", you have my love and my solidarity. I don't internet much, and so if this has been said/shared/assimilated then consider my words a reinforcing echo.\n\nFirst, let me indulge myself and share a true event from a few weeks back.\n\nI am outwardly queer and noticeable, my lover somehow more queer but less noticeable. We sat in a cafe, my partner fawning her gay heart over the decor and we excitably talked about the life we hope to one day live. A group not too far from us began talking loudly, they cycled through a series of subjects (Palestine, immigration, US politics, Ukraine), there was one amongst them who seemed to be 'correcting' their groups various opinions (basically regurgitating 'moderate' views) - even when they clearly agreed he'd still loudly explain why his (un)\"nuanced\" is actually more developed (my word def not his). When I got back from the toilet I noticed my partner looked incredibly anxious. Before I'd even sat down I'd caught the jist, they'd reached 'the trans issue' on their tour of current affairs, and dispassionately discussed a barrage of dog whistle topics. There was no outright hatred and there was no kindness, compassion, understanding, wisdom, logic or tact. For 10 minutes they painted themselves as people who would celebrate mine and my lovers suffering. \n\n*(I live in the UK, direct confrontation is less common than certain macho personalities would have you believe, we are indirect implicit communicators. For example, if someone is rude to wait staff, we're less likely to tell the offender to simmer down, and more likely to firmly exclaim to our friends how awful that behaviour is. So when a group is loudly discussing certain topics it's not unreasonable to connect your presence to their discussion. It's not just stating facts (which are inert), it's the action of stating 'simple biological facts'. It's not just stating statistical figures, it's the action of stating 'stats on ethnicities and crime'.)*  \n  \nIn their world they were simply discussing current affairs, shooting the shit, this small intimate café was owned by an Egyptian and they'd decorated it with various photos and decorations from their culture, I'm guessing this called to mind Palestine and thus launched them into current affairs. To reassure my lover I began talking more, I'd kept an eye on the loud group because it was a guilty pleasure listening to the loud 'know-it-all' piss of his friends but now I was anxious and keenly listening for cues of violence. My voice became the loudest in the café (a symptom of anxiety), I loudly shared a story of a teapot I once had that looked like one hanging from the ceiling (apparently I should have been using it for coffee), my lover grabbed my hand and kissed me. I wanted to keep the 'shit-opinion' group in my eyeline, I succumbed to passion and once the flames subsided I expected dagger eyes. Instead I was met with a telling nudge between friends, a polite smile and even an accepting nod. Next to us, two older gentlemen, and I mean **gentlemen** had been invariably talking about World War 2 . I typically deplore posh accents, and I admit to my own prejudice against upper class people, but the melodic rhythm of their conversation and conviction they afforded themselves made me peg them as something else. I didn't really catch what they were talking about other than 'book burnings' and something about the holocaust. 'Shit-opinon' group had ran out of steam and my partner and I quietly flirted. Forehead to forehead, my lover and I listened as they poetically back and forthed, like listening to the rain I thought it was contextless rambling. Until my heart skipped a beat and I heard them **\"...optimists are the ones that survive\"**.   \n  \nAs a lifelong pessimist I am humbled. I am reminded of all our struggles political, social or human, that which lacks hope fades, we are all here right now for better or worse. Born of optimists, lifted by hope and courage, our lives, our stories, our light will weather the harshest of storms. \n\nI write this for those undergoing a regime change, but hope others find use. I should preface that despite a common language the U.S. is an alien entity to me. I was married to a Texan and so much about the U.S. boggles my mind, please do adapt anything I share to fit the context of your, take what is useful and discard the rest. For context I'm a country gal from the UK, anarchist since I left the military, primarily worked in health care, heavily involved in organising/squatting/mischief (less so now) and queer since birth.\n\n**1.  \"...optimists are the ones that survive\"**  \nFoster a sense of optimistic hope, over-ride the negative self talk and defeatism. Being optimistic is hard, being pessimistic is easy, pessimism makes us feel secure, makes us feel safer, helps us conserve energy. Optimism means spending energy and resources on things that we can't be certain will pan out. Optimism is a gamble that opens us up to critique, failure and pain. Whatever your goals, beliefs, ideology, group etc. somebody had to deliver it to you. Somebody was optimistic about their ideals. Not that sunny optimism we see painted on ignorant faces. But that 'good enough' imperfect DIY optimism that's just enough to get to the next day. The optimism that something will catch and spread. Ideas have survived tyranny and disaster, people have survived tyranny and disaster, an unbroken chain of optimistic survivors extends from you to the past, **keep that chain going**.  \nI never in my life have believed in a large scale anarcho-revolution. But I will die building pockets of resistance, teaching anarchist principles, fighting in solidarity with causes I believe in, standing with the oppressed and creating spaces that liberate and elevate. I think of myself as a realist (pessimist), but it's only recently clear why I would expend so much energy and incur so much harm for a reality I didn't believe possible - and it's painfully obvious, maybe I don't get to live exactly to my values, maybe there is no commune where I feel liberated. I have hope that through my actions others will be inspired, I'm a born again optimist that what I do will one day spark enough passion and hope in others to keep them pursuing liberty and justice for all. I am an optimist. I pour all my fuel on the torch I pass to the youth, I hope it burns brighter than when it was given to me and I'm optimistic that the torch they pass burns brighter yet, and I'm optimistic that one day we will carry blazes that cannot be extinguished.\n\n**2. Homage to Catalonia**  \nI have an immense dislike for all nations and countries, that said folks of the U.S. yours is being dismantled into a modern autocracy. Exploitation and oppression of a scale we'd hoped were long left in the past are now on the horizon. Their destruction and greed will create cracks and fragmentations ripe for seeds of resistance. In the outbreak of the Spanish Civil War the CNT/FAI had long been at work in Catalonia. Existing as workers unions they expanded to provide vital services in their community. In the face of crisis the people turned to the CNT/FAI rather than their government or bosses.  \nThis is a critical time for anarchists residing in the U.S.. As the rich dismantle essential services this is an opportunity to supplant them, demonstrate to your communities how useless the government is, how greedy corporations are. Provide for your communities! Create spaces that attract people with the skills you need, appropriate funds and get people skilled and trained. Anything that is cut or dismantled try to have an alternative ready for people to turn to. A lot of people in Catalonia were unaware of anarchism, what it meant, 'how to do it' etc. Anarchist isn't a trade it's a DIY mindset. Teachers might not teach for free for 'anarchists' but they sure as shit will teach to help the disenfranchised, help organise them, make it easier for them, likewise with any other service or need your community has. Where there's a skill shortage gather people together and workshop through it, y'all know how to organise, you gotta take this opportunity to get people together.  \nIf nothing else, **feed people**.\n\n**3. Divided we march, united we fight**  \nBad quote, I know. But the point stands. Don't isolate, work with people with different ideologies. Don't debate, evangelise or try to show up other factions. **Always seek to work together**. I don't know a single anarchist that was convinced to be one. Every anarchist I know either hung around the crowd long enough, saw some shit they thought was cool and wanted to join in, or read every book they could find on the subject. Just inspire those around you. Be known for bringing people together. Do set your tolerance level and fight back against any infringements, do protect one another, do stand up for your beliefs. But things like this are **demonstrated through ordinary actions** in the course of a day. Not at a debate or a meeting or whatever. Volunteer widely, get to know the religious types, the middle class do-gooders, anyone with half a brain and a working heart that gets things done. These people themselves can be valuable resources for desperate people and connecting them changes lives and helps people consider the big questions we all think about. Treat everyone as if they belong, as if they have a place, as if they are valuable (because they are), they don't have to be idealists, they can just want to do XYZ (feed people, teach people, give rides), they don't need to organise or read Conquest of Bread. They just need to agree to your groups mutual aid principles. Your role as a clued up anarchist or community organiser is to remove the obstacles so people can do what they've agreed to. We, as folks with a different situational awareness than most, unfortunately or not, might not get to spend much time on frontline projects or doing direct action.\n\n**4. Know your objective**  \nIn the UK protests don't have as much impact as people seem to think they do. It's near impossible to start a riot and most radical elements get shut down quickly for many reasons. We still have an odd culture of believing that protests will be more than they are and I hope that they again become a meaningful direct action tool. But, as far as getting an objective or goal, they are useless. Without a real cause for believing they will cause change or lead to a substantial occupation I'd prioritise other areas - do enthusiastically take part when and wherever, but apply resources and energy wisely. Your state will be seeking to wear you down, the first few demos may be huge, there may be clashes, without an occupation, they're usefulness is limited. Protests are great for - outreach, team building, experimenting and more. I'd be very sceptical of any action done solely for 'optics' or 'social media' or 'to get coverage', yeah there's variable successes there and it can be useful, but they're such a drain on everyones energy and resources with the consequence of a high attrition rate (people getting snatched, burnout, or disillusioned about walking the same route in the same way with  the same banner. Utilise the full range of tactics, emphasise diversity of tactics to organisers but ultimately don't give them as much creedence as cosplayers (sorry - snark) might have you believe.  \nWhy? Well friendos, you might actually take territory, you might actually trigger ongoing civil disruption, you might actually need everyone to turn up, energised, ready to go - which they won't if you've marched them back and forth through the streets a dozen time to no avail. As with anything, when theirs momentum pour all your resources and energy into it, you may never get a second chance.\n\n  \nI can go through technicals and how-to's if anyone needs it, but at this stage it's the same core principles on the same tactics. If you've read through this far I hope there's something that resonates with you or something that you can adapt for your own purposes. My heart goes out to you all and I look forward to hearing about your successes. Solidarity x",
    "comments": []
}