{
    "title": "how do you cope with anxiety due to global crises/difficult experiences as an activist?",
    "author": "blue_cherrypie",
    "subreddit": "Anarchism",
    "rank": 55,
    "score": 27,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Anarchism/comments/1izswzx/how_do_you_cope_with_anxiety_due_to_global/",
    "id": "1izswzx",
    "selftext": "im not sure if this post is appropriate for this group but i think this community would understand my struggle most, because of general high awareness about world issues, which can be deeply overwhelming mentally, that requires a lot of effective coping mechanisms for emotional well-being\n\nso my mental health got a lot worse since i became an activist and have experienced a lot of difficult things emotionally. i took a break but my mental health keeps getting worse, and i feel anxious most of the time\n\nmy question is, if some of you are struggling/ have struggled with mental health due to the current crises in the world, or reading a lot of stuff that are exhausting to read, or activism that is mentally draining, how do you cope with that feelings in a healthy way? for me doing nothing isn't an option, it doesn't really go away, i want to engage but i want to feel okay:') but idk if you can feel okay, in the world that isn't okay",
    "comments": [
        {
            "author": "clickrush",
            "body": "The best way to overcome fears is to face them repeatedly in a proactive manner. Everytime you win a little bit. Anxiety is very similar in that regard. But sometimes it can just build up from an accumulation of small, negative inputs.\n\nNow, at the risk of sounding trite, here's some stuff that works for me:\n\n- talking to friends / loved ones\n- walking my dogs or just taking a walk alone\n- reading (physical) books\n- drawing (*)\n- preparing TTRPG sessions (*)\n- remember not to take myself too seriously\n- when anxiety builds up, take a deep breath and exhale slowly, think about how I always seem to overcome it\n- drinking a bunch of clear water\n\n(*) those things use a different part of my brain than my dayjob.",
            "score": 10,
            "replies": []
        },
        {
            "author": "disqersive",
            "body": "I think this is a very appropriate and real and needed convo to have in our anarchist spaces. I think turning towards our difficult emotions + taking care of ourselves and others emotional and social experience is a balm for these times. I like what another commenter said about tending to the internal conflict. Getting out of our intellectual mind when we can, and being in it wholeheartedly when we need to. Taking breaks when things go south in our bodies, and building up networks of local resiliency. I think having a spiritual practice, a ritual practice, a play practice, something that is contained and nurturing. I understand the desire to feel okay. What I've been thinking is impossible is to be okay all the time right now. It makes sense not to be okay right now. But wherever you can, finding real ways to play or pray or bring about a bubble of \"militant joy\" \\*\\*\n\n\\*\\* from the book Joyful Militancy by carla bergman and Nick Montgomery\n\n\"To emphasize joy, in contrast to happiness, is to move away from conditioned habits, reactions, and emotions. Bubbling up in the cracks of Empire, joy remakes people through combat with forces of subjection. Joy is a *desubjectifying* process, an unfixing, an intensification of life itself.[\\[20\\]](https://theanarchistlibrary.org/library/joyful-militancy-bergman-montgomery#fn20) It is a process of coming alive and coming apart. Whereas happiness is used as a numbing anesthetic that induces dependence, joy is the growth of people’s capacity to do and feel new things, in ways that can break this dependence.\"",
            "score": 6,
            "replies": [
                {
                    "author": "Brilliant-Rise-1525",
                    "body": "Good quote! I shall hunt that down and read it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "disqersive",
                            "body": "<3 [https://theanarchistlibrary.org/library/joyful-militancy-bergman-montgomery#toc12](https://theanarchistlibrary.org/library/joyful-militancy-bergman-montgomery#toc12)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Brilliant-Rise-1525",
                                    "body": "A star you are!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Anarcho_Humanist",
            "body": "I'm not sure if this is a nice way to look at it, but I basically see global crisis as the norm. The 1940s were an absolute nightmare as the world was basically consumed by the fire of war. Then ever since every few years there's been a really nasty war somewhere in the world.",
            "score": 4,
            "replies": [
                {
                    "author": "countuition",
                    "body": "Yeah this is part of my perspective (along with utopian thinking to help combat the doomer mental space easy to sit in)\n\nI think of all the strong and liberatory fighters for resistance throughout history and think of the conditions they lived and died through, and how important their efforts were in creating a history of resistance and social progress. If they can do it then I ought to try now.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Brilliant-Rise-1525",
                    "body": "True. I think a lit more people are aware of a lot more stuff now though.... including the possible end phase of humanity . Collective pAnik!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant-Rise-1525",
            "body": "I think there is truth in the notion that holding opposing concepts in yourself causes internal conflict. \n\n- so strengthen one concept and defeat the other.\n\nIn other words a side effect of social conditioning is internal conflict . Conflict between what you feel is real and the various authoritarian properganda that also fight each other. \n\nSo in your head you could have\n\nYour feelings VS Capitalism VS Democracy VS fascism VS state communism VS liberalism VS twitter idpol \n\nThe trick is to turn the volume up on your feelings and defeat the others. Realize and ritualy strengthen your own view by whatever means.\n\n\nAs for whatever work your doing which is draining your energy:\n\nI find that pulling off successfull action increases energy levels and ineffective action drains energy due to frustration over a sneaky feeling that what your doing is pointless. \n\nIf your burning out, try a different angle .\n\nIf your traumatized from violence you've just got to ride it out though, I'm afraid. So be nice to yourself.",
            "score": 8,
            "replies": [
                {
                    "author": "flowingnow",
                    "body": "Such a beautiful point here on strengthening your view. It somehow reminded me of Zizek’s claim on the importance of utopia. Whether if it’s possible or not is not the point. It’s so we have conviction on what we are working for, collectively.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Brilliant-Rise-1525",
                            "body": "Oh thanks but I think I may of nicked that from Jung :/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VolcrynDarkstar",
            "body": "Personally, I don't. It just feels shittier every day. I don't recommend that, but it's my answer. Thank you for coming to my TED talk.",
            "score": 1,
            "replies": [
                {
                    "author": "blue_cherrypie",
                    "body": ":( 🫂",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}