{
    "title": "We've produced a zine version of \"Become an Anarchist or Forever Hold Your Peace\"",
    "author": "CrimethInc-Ex-Worker",
    "subreddit": "Anarchism",
    "rank": 51,
    "score": 77,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 3,
    "url": "/r/CrimethInc/comments/1izvquj/weve_produced_a_zine_version_of_become_an/",
    "id": "1izvuca",
    "selftext": "",
    "comments": [
        {
            "author": "None",
            "body": "I've seen many liberals and neocons in Reddit saying \"Get through 4 years, and it will be okay\". That was exactly what South Koreans were thinking at the start of military junta (1961-1987), and North Koreans at the start of Kim Dynasty (1948-). Stay sharp, and keep your eyes open.",
            "score": 6,
            "replies": [
                {
                    "author": "epickneecap",
                    "body": "Exactly. Fascism doesn't blow over. It will only go away if we fight it.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Previous_Scene5117",
                            "body": "What always worried me was this gravitation towards it.\nI remember the situation and state of mind of the underground in relation to the subject. We have seen it embedded in the state itself and in action on back then fringe groups of boneheads. Now this is guys in expensive suits on the salons of government politics, with money and power. The subject back then was tinfoil hat like... \"Why are you so obsessed with the threat of nazism?\"... The normals ignorance was and is the biggest threat. Once they are on board with it it is too late and I see it being now. Now their minds are on the zone and pulling them out of it will require a catastrophe.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}