{
    "title": "At least 25 undercover cops infiltrating environmentalist and left-anarchist groups had sex with deceived women",
    "author": "DoOwlsExist",
    "subreddit": "Anarchism",
    "rank": 9,
    "score": 1301,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 66,
    "url": "https://www.theguardian.com/uk-news/2025/mar/02/revealed-at-least-25-uk-spy-cops-sexual-relations-deceived-women",
    "id": "1j2ptn4",
    "selftext": "",
    "comments": [
        {
            "author": "beeradvice",
            "body": "FBI infiltrator at an org I used to be part of had to fuckin kids with a member before raiding the place and sending her to jail, kids went into the system.",
            "score": 344,
            "replies": [
                {
                    "author": "katieleehaw",
                    "body": "What the actual fuck??",
                    "score": 158,
                    "replies": []
                },
                {
                    "author": "shadeandshine",
                    "body": "Honestly it tracks with the FBIs record",
                    "score": 74,
                    "replies": []
                },
                {
                    "author": "VolcrynDarkstar",
                    "body": "On what charges was she sent to jail? Being a leftist?",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "stygianelectro",
                    "body": "that's horrifying",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Zero-89",
                    "body": "Pigs are dead-hearted monsters.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "No-Lifeguard-5308",
                    "body": "This has to be in the news somewhere, give us some names. I would never go quietly if I was the mother and my kids were put in the system in this situation.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "autonomommy",
                    "body": "They will revolt. Children remember everything somewhere in their body.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "NiceGuyJoe",
                    "body": "That can’t be real",
                    "score": 5,
                    "replies": [
                        {
                            "author": "GooseShartBombardier",
                            "body": "I believe it, they've done far worse and simply excused themselves.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "NiceGuyJoe",
                                    "body": "Power is gross",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DoOwlsExist",
            "body": "This is an update on the longer running 'spy cops' scandal in the UK. \n\n> At least 25 undercover police officers who infiltrated political groups formed sexual relationships with members of the public without disclosing their true identity to them, the Guardian can disclose.\n\n> The total shows how women were deceived on a systemic basis over more than three decades. It equates to nearly a fifth of all the police spies who were sent to infiltrate political movements.\n\n> Four of the police spies fathered, or are alleged to have fathered, children with women they met while using their fake identities to infiltrate campaigners.\n\nThe inflitrations started in 1968 and (supposedly) lasted until 2010. I think there's good reason to think these kinds of operations are still ongoing, because in 2021 [a Black Lives Matter organiser was approached to be an informant for police](https://www.theguardian.com/uk-news/2021/oct/25/recording-reveals-police-efforts-to-recruit-blm-activist-as-informant) and the political shift towards the right means an increased confidence by the state to carry out these kinds of operations. \n\n> In total, about 139 undercover officers – employed in two covert squads – spied on more than 1,000 political groups. Tens of thousands of mainly leftwing and progressive campaigners were put under surveillance.\n\n> The officers typically spent four years pretending to be campaigners while they infiltrated political groups, befriending activists while simultaneously hoovering up information about their protests.\n\nI think it's very significant that most of the infiltrators were men and most of the victims were women. Trans people are similarly likely to be victims of this kind of abuse, but whether that was the case here is hard to tell because The Guardian is known to often be transphobic. \n\nIn my opinion the text [**Why Misogynists Make Great Informants**](https://theanarchistlibrary.org/library/courtney-desiree-morris-why-misogynists-make-great-informants), about the very similar case of Brandon Darby, is basically required reading for anyone involved in activist organising. It talks about the way misogynist behavior by domineering men can tear apart political organisations when such behavior is tolerated by other activists. Because while it is very difficult to tell if someone is an informant, blatant misogyny often goes unadressed and can do harm regardless of whether the men perpetuating it are secret police, recruited informants, or just doing it for the sake of gaining control over others. Listen to victims, don't treat intersectional struggles as secondary to the 'real' issues, and be aware of the bigotry you're letting slip just to keep the peace. \n\nAlso keep in mind that reddit is a public forum and anything you say can be read by cops.\n\nEDIT: I want to link to [this comment with lots of great links on this topic](https://old.reddit.com/r/Anarchism/comments/1j2ptn4/at_least_25_undercover_cops_infiltrating/mfup9ef/) so it doesn't get buried.",
            "score": 408,
            "replies": [
                {
                    "author": "SallyStranger",
                    "body": "Came here to mention \"why misogynists make great informants\". Thanks.",
                    "score": 178,
                    "replies": []
                },
                {
                    "author": "am_az_on",
                    "body": "Just to note, I think you are mixing up informants and police a bit: \n\n\"a BLM organiser was approach to be an informant\"  \n\"most of the informants were men and most of the victims were women\"\n\nThe article is talking about infiltrators who were already trained and employed as police, but informants is simply anyone who decides they will provide info to the police. Not to invalidate any of your points, except to make that distinction clear.  I think the Misogynists Make Great Informants is talking about people in the movement who perpetrate problems, whereas any specific misogyny of the police infiltrators doesn't seem much known beyond the facts of their fraudulent intimate relationships with women.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "DoOwlsExist",
                            "body": "Fair point on informants/infiltrators, changed.\n\nMMGI is also about infiltrators, as cops don't truly hold anarchic values and will fail to apply them outside of the theory they've memorized to fit in.",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChaosRulesTheWorld",
                    "body": "Sorry but what actually do you expect people to do? I've been in left activist spaces where misogynistic men were leading it and thriving in it and almost everyone were tolerating and supporting them because somehow being a misogynist is charismatic. It's easy to know what to do in case of SA or other kind of physical aggression. But for their psychological abuse and manipulation tactics?\n\nI wouldn't call people who choose to support them, to validate them, to have friendships, to have relationships or to have sex with them: victims. They choose it, they ain't no victim. And honestly i'm pissed by those \"victims\". I've been ostracized and bullied by those misogynistic men for standing my ground against them! What did those \"victims\" do? Keep suporting and validating them in their behaviors, helping them finding other \"victims\" or real victims. Telling me i was exagerating and jealous or other kind of diversion and dismissive bs.\n\nI was blamed for standing against them. Now i'm the one in burnout with a trauma and isolated (almost no one has kept contact with me after i leaved) while those misogynists keep thriving in those spaces and being supported and validated by their \"victims\".\n\nThose \"victims\" ain't no victims, they are enablers. And they help them thriving and finding real victims. Those \"victims\" (i precise again that here i talk about the one who choose, not the one who were actually victims) should question themselves on why they are attracted to people displaying misogyny and why they enable them. Imo that's because they are misogynists too.\n\nEdit: i see it comming so i'll answer first. Why do you blame people who were friend and in relationships with them first and not the misogynists themselves and the other people who tolerated them too?\n\nFirst, i'm blaming those misogynists, as i said i tried to stand against them but they only thrive and are confident because there are people who enable and encourage them in their behavior. They are basically giving them fuel and without that those misogynists would be powerless.\n\nSecond, the one who were the most proactive to defend and enable them were those \"victims\". The others were just passive. Still pisses me of but at least they weren't trying to actively defend them, to discourage me to call them out on their behavior or to do something about them, or to actively support them in their lives and anything they do.\n\nEdit 2: yeah sure downvote me. Blame people who stand against misogynists and had to pay the price for that just because you don't like that they are calling out enablers, instead of blaming those ones.\n\nI said that to share my experience and what doesn't work. But sure blame me and repeat the same mistakes and then have pikachu faces because misogynists still thrive in our spaces. Of course we always loose if we don't learn from eachother experiences. That's a human olympic sport.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "DoOwlsExist",
                            "body": "Abuse tends to condition people to meekly accept domination by lowering their sense of Self and making them codependent on the abuser. In a society where youth are conditioned to accept authority figures, marginalised youth doubly so, people are denied from birth full autonomy and the ability to stand up for themselves. Abuse victims are very likely to end up back in abusive relationships. Victims validating and supporting their abusers is hardly surprising: that's exactly what abusers want to get out of their victims. So one can be both a victim of & complicit in abuse. \n\nI don't blame you for having a terrible time opposing abuse when no one else joins in on the fight and I don't blame you for being burnt out by that, but why respond to a call to action to fight abuse with this defeatism? I don't know what the right move against widespread misogyny in an org is strategically, that probably depends on the specifics of any given situation. Best I can propose is trying to look for allies who also oppose misogyny by being a very vocal proponent of anarcha-feminism",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "ChaosRulesTheWorld",
                                    "body": ">but why respond to a call to action to fight abuse with this defeatism?\n\nBecause i'm tired of people putting all the responsibility on people who have no power to change the situation when the people who have the actual power to change it are just presented as powerless victims. They are not. They are the one who have the power to change it.\n\nEnablers are responsible for abusers power. All we can do is show we can support them if they want to struggle against those abusers, but if they don't they are just complicit. Grown ass adults aren't comparable to children or teenagers. It's easy to frame them as powerless victims of abuse but that's rarelly the case. They are not isolated individuals without alternatives traped in relationships for socio-economical reasons. They make the proactive choice to start friendships and relationships with those misogynists and to stay in it while they have the possibility and support to leave them. They make the proactive choice to defend those misogynists, to help them abuse other people.\n\nI'm asking what do you expect people to do because this is a situation that can only be resolved by either kicking out abusers and their enablers out of our spaces or to push enablers to take their responsibility and stop enabling those misogynists. There are the only two options. All other alternatives don't work (in activist spaces and organizations).\n\nSo if you frame enablers as \"victims\", you consider that kicking them out of our spaces  or putting the responsibility on them to stop enabling those misogynists his not on the menu. So what do we do? It leaves us in a contradictory situation where misogynists have power because people enable them, but we can't fight against them because they have to much power thanks to enablers, and we can't fight enablers because they are \"victims\". So what do we do?\n\nThat's cool to tell people to do things but if what you expect them to do is impossible, what are we suppose to do? That's why i ask this and made this comment.\n\nI personnaly consider that we should treat enablers and abusers in the same way. They are complicit and interdependant, one can't thrive without the other. While still showing we can help and support the ones who want to change and stand against this.\n\nBut that's not possible to do if you discharge people who choose and support those misogynists while having the possibility to escape, by calling them \"victims\" instead of enablers. Victim should be a term saved for people who can't escape (without making their life harder) and didn't choose their situation, like childrens, teens, people trap with partners or friends for socio-economical reasons. Those are two very different kind of victims. You can't help someone who doesn't want help. And nothing can justify or excuse them being complicit of abusers by enabling, defending and supporting them.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "AKFRU",
                                            "body": "My local crew implemented a Safer Spaces policy, the specific one we repurposed seems to have gone from the Internet, but [this one seems](https://theanarchistlibrary.org/library/anonymous-for-your-safety-and-security) OK. We have used it to kick out one misogynist (probable rapist) and chase one probable rapist off from a protest. Being the oldest cis-male it has fallen to me to be the one who does the kicking. Both of the accused were once friends, where enforcing the safer spaces policy cost me those friendships. I don't regret it at all. Ending oppression starts at home.\n\nWe don't get into what actually happened and I just said 'some comrades don't feel safe around you, so you aren't welcome at the meeting / protest'. Each time they arced up and made misogynist arguments against being excluded, which in my mind gave me the confidence that I was doing the right thing. Both times there was a moment where you could see their logic 'I am a man, I should be able to get away with this' and the misogynist fury at being called out was directed at me (as someone who should, in their minds be misogynist too). It's messy to go through, but the organisation is definitely more healthy because of it.\n\nI recently made light about playing a game of just a shitty person or cop? Effectively there is no difference to the movement.",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "author": "ChaosRulesTheWorld",
                                                    "body": "Thanks for this exemple. I agree that this is something you can do and we also did things like this multiple times in our spaces and orgs. But that was only possible because they didn't have enablers or few of them. When the misogynist is surrounded by enablers and supported by the community, you can't do that.\n\nIt's easy (relatively speaking) to kick the isolated or unpopular misogynist out of our spaces. But if you try to do the same with the popular ones, you are the one who will be targeted by the community.\n\nWhere i was it was a place (people call ZAD) where a lot of people pass regulary. So kicking out misogynists and sexual agressors was saddly a relatively frequent things to do. But last year one of the very popular guy has been called out by his ex who told in a text all the manipulative, abusive behaviors he had and that he raped her multiple times. She is the one that had to leave the place and he his the one that can stay and people are just \"checking on him to make sure he learn and doesn't do it again\" (aka bs justification). They never did that for previous agressors. But for him they made an exception and all their \"but you know he is nice\" \"he had a difficult childhood bla bla bla\".\n\nThis was just before i definitively leaved the place. Before, i was bullied during a whole year by an ex friend of mine who revealed himself to be a manipulative misogynist who groomed multiple people. People told me to shut up and to not respond to him bullying me. Why? Because he was popular too.\n\nEnablers are the worst adversaries you will have when you try to stand against misogynistic abusers and agressors. They are objectively complicit.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "AKFRU",
                                                            "body": "Yeah, it worked for our crew, but hasn't been as effective in broader movement work. The local Trots had a member shipped in from another city who they moved here because of rape accusations in the city he was living in. We wouldn't work with him, some comrades directly accused him of being a rapist (they know the victim) and the Trot org shipped him to yet another city because it was clear we weren't going to drop it. It has made our relationship with them unworkable. They hate us for 'making baseless accusations about their friend and driving him out of the city'.\n\nOthers then accused us of being sectarian, which may be true, but they are a sect that protects rapists, so fuck 'em. It sucks, but you do what you can.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "ChaosRulesTheWorld",
                                                                    "body": "Wow! Your crew is based and thank you for standing your ground. That's rare enough to need being mentionned. Hope your crew will thrive.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AKFRU",
                                                                            "body": "Thanks! I was lucky to attend a workshop about safer spaces that was put on by Anarchists who had been victims of abuse. They formed a collective and spent months working through the issue in all it's complexity, and put forward their safer spaces policy which was enacted in the squat we were organising out of (we were there for summit protest in another city). It was the hardest workshop I have ever sat through, hours long discussion of abuse, violence and how to deal with it in an Anarchist way. It was fucking hard going, but changed my life. I guess at some point everyone has to ask themselves 'Am I really an Ally? Or just when it's convenient?' Then it's a matter of stepping up.",
                                                                            "score": 9,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "judithishere",
                                                            "body": "We had some people come through our social center from ZAD in 2012.  It was really inspiring at the time.  They gave a great presentation.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "am_az_on",
                            "body": ">somehow being a misogynist is charismatic. It's easy to know what to do in case of SA or other kind of physical aggression. But for their psychological abuse and manipulation tactics?\n\nI think this hit the nail on the head, it's not just in activism or leftism but everywhere - a charismatic psychologically-abusive and manipulative man just got people to approve him as president. \n\nPeople don't seem to know how to address it, and it happens everywhere. Blaming people doesn't necessarily make things any better.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "ChaosRulesTheWorld",
                                    "body": "I mean, that's exactly what we do in politics. When people enable charismatic abusive and manipulative men with authoritarian policies and behaviors, when they actively defend them, help them and oppose those who fight against them. We blame them and fight against them. So why here is it different?",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "judithishere",
                            "body": "Just wanted to share, that you are not alone in this experience.  I had a similar trajectory, as did many other people that I have spoken to over the years.  In my case, I had what I suspect was at least 2 actual police informants/infiltrators launch a smear campaign against me that endangered myself and my children, so I withdrew from organizing altogether.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "PresumedDOA",
                            "body": "I have no satisfactory answers as to what to actually do, I just wanted to express sympathy, since I've experienced similar situations on a smaller scale, and take a guess at the problem. Maybe that'll help both of us figure out what the hell to do, somehow?\n\nFirst, before I forget, I get exactly what you were saying about certain people not being victims, by the way. I think in the case of misogyny, if they have relationships or sex with the person, then I would still call those people victims and perpetrators at the same time, since it often has to do with the cycle that draws them into the abuse. But supporters, friends, enablers? No, they are not victims. They are not experiencing the abuse, there's not some strong psychological bonding coming from abuse that keeps them there, they are simply giving in to the human tendency of wanting to keep things \"normal\", what they have become accustomed to. That is cowardice, not being a victim. I'll concede that some of these people might be experiencing the abuse and are victims, but the majority of friends and enablers are not and don't have a valid reason to fall back on that excuse.\n\nAnyways, I've experienced similar with a couple of friends recently, either those who are suddenly showing their true political colors, or in one person's case, someone I just suddenly realized was using very abusive like behavior on me.\n\nI think they illustrate two reasons why this happens. For my friend who started showing his true colors? He has a lot of enablers, so I've had to really isolate myself, because I refuse to stand by and watch as someone keeps spouting right wing twitter propaganda at us all, pulling the classic right wing \"I'm just asking questions, I'm just making jokes\". I think it demonstrates that for a lot of people, they just don't want confrontation. They don't want to rock the boat, as it were. They are just hoping this person happens to change, because if they rock the boat, that's going to disrupt a relationship they enjoyed at one point and it's really unlikely they'll be able to get back to it, so they stand by. This is just conjecture, but I think a lot of people's brains have a bias towards keeping things in a \"normal\" state, so without something huge, if they can ignore it, they will. And they'll deal with the cognitive dissonance for a while.\n\nThe other friend I think is an entirely different problem. In my experience, they were really cool at first. A really fun person, very happy, fun to hang around, so I did. Quite a bit. But eventually, they started letting more and more of their bad side come out. To cut a long story short, I realized I'd essentially been baited by a nice, more fake side and it took me a while to realize, if they could fake it, then they *can* control themselves and there's no reason for me to be accepting all the little verbal jabs and negativity all the time. But I told myself for a long time, oh they had a tough childhood, they've got some mental issues they're working through, I care for them and want to be there for them. But at a certain point, trying to be continually caring, to be so empathetic, is like the saying \"lighting yourself on fire to keep another warm\".\n\nMaybe that's what's happening in some of your examples elsewhere? I think this side of the political spectrum is inherently more empathetic, and they are therefore willing to understand another person, why they have such issues, and want to give them space to work through it. And sure, maybe they will work through it eventually, but as I've had to learn the hard way, you cause yourself a lot of pain waiting for someone to work something out, even if they're actively working on it, if they refuse to stop hurting you in the process.\n\nFurthermore, if they haven't even apologized or acknowledged what they did was wrong, then they don't acknowledge there's anything to fix and obviously can't be working on it, so there's no reason to wait for them to fix something.\n\nAnyways, I'm sorry that happened with you, it's a really shitty feeling. I don't really know what to do either, other than finding new, less shitty people, but I just wanted to weigh in that I get what you mean, and I was hoping maybe laying out my theories would help us both, although I'm still at a loss personally, but maybe I'll get there one day.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "countuition",
                            "body": "“I wouldn’t call people who choose to support them, to validate them, to have friendships, to have relationships or to have sex with them: victims. They choose it, they ain’t no victim.”\n\nMe when I don’t understand the basics of how abusers manipulate and victimize the people they’re in relationship/community with for personal gain",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ChaosRulesTheWorld",
                                    "body": "Keep reading my other comments and come back here if you have more to say about my critic.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "countuition",
                                            "body": "Lol i did, you’ve made a foundational error in your critique and are mad about how people are pointing that out",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ChaosRulesTheWorld",
                                                    "body": "Ok so, do you consider people from oppressed social groups who vote for far right policies: victims? (Wich are the majority of people who vote for far right policies. For the simple reason that the majority of voters are people from oppressed social groups)\n\nEdit: you could precise that you have edited your comment. No i didn't made a foundational error and i'm not mad about it. Why can't you answer to this question instead of editing your comment? Because this is basically the same situtation.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "countuition",
                                                            "body": "I edited before you replied silly\n\nAnd if you think engagement with a false democracy is at all a signifier of one’s victimhood or not based on subsequent authoritarian oppression then you’re just a misanthrope who doesn’t understand how populations and people are manipulated and therefore victimized. Have fun with the victim blaming though!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yeahbitchmagnet",
                            "body": "Just out of curiosity what is actually happening specifically. I always see these accusations but they are always so vague",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ChaosRulesTheWorld",
                                    "body": "Can you be more specific? I talked about a lot of things i personnaly experienced and also witnessed multiple times in french left autonomous activist spaces as an autistic agender anarchist. So it's hard to know what you are talking about here",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "yeahbitchmagnet",
                                            "body": "The misogynistic people. Not trying to be confrontational just trying to figure what's happening. My experience with sexist d bags is from the film industry so its different",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ChaosRulesTheWorld",
                                                    "body": "Oh, in activists spaces and organisations you will frequently see misogynistic men being at the head of informal hyerarchies and using manipulation tactics to accumulate power. It's hard to find organizations or spaces where there is no history of SA, grooming younger people (generally women and queer people). Countless collectives who split because one side of the collective support the rapist and the other not.\n\nThese misogynists use their power not only for sexist purpose but also to basically control orgs and spaces, exclude people they don't like or on their way (generally poc, working class people or disabled people). And you have generally their enablers explaining to you that \"you have to understand\", \"they had traumatic experiences or a difficult childhood\", \"they are nice, cool, fun\", \"they are a pillar of the community\" and some other kind of bs.\n\nAnd they are the one you will have to deal with everytime you will question their misogynist behaviors and authority. They will tell you to keep your head down when you get punched. They will find targets to groom and abuse for their misogynistic friend or partner. They will tell you to shut up when you try to call out what is happening. (Edit: i'm talking about enablers in this paragraph but that's true for misogynistic abusers too)",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "yeahbitchmagnet",
                                                            "body": "What manipulation tactics are used? I want to know what to look out for but this is what people are always so vague about. \n\nJust out of curiosity have you or someone else ever used humor and shame to deal with it? I've found it to be very effective to dealing with some men. It's easier said than done though.\n\nOne thing I've always found strange about these accusation is a man is always at the center of abuse and drama but woman are just as likely to abuse people and more and more woman have found ways to be in charge of people even in informal hierarchies. To be clear I am not saying you are wrong or lying but I am general curious about this especially as a transwoman that doesn't exactly present well so I'm basically assumed to be a man by 99% of people even amongst leftists spaces and I tend to be pretty militant but in general pretty quiet but sometimes how people talk about leftist spaces I genuinely wonder how people perceive me, this perception has a lot to do with how people perceived me in college but that was more woman exluding me so maybe I'm just paranoid",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zzabur0",
            "body": "ACAB",
            "score": 111,
            "replies": []
        },
        {
            "author": "Ghost_of_Durruti",
            "body": "This is 100% rape. These women can't consent to this any more than a drugged person can consent to having sex with a person who is impersonating their significant other. Rape with a capital R. Fuck these douchebags. ",
            "score": 148,
            "replies": []
        },
        {
            "author": "quriousposes",
            "body": "having kids as an undercover informant is so fuckin foul.... those poor kids",
            "score": 39,
            "replies": []
        },
        {
            "author": "corpdorp",
            "body": "Hey so I've been writing and researching for a book that covers provocateurs so I have read a bit up on these cases- you can read survivor accounts on their website:https://policespiesoutoflives.org.uk/ \n\nI also found these resources which cover history and practical instructions- I read Why Misogynists Make Great Informants and while I think it is a great critique it\n\ndoesn't specifically help with understanding how to identify provocateurs in movements:\n\nStill Spying on Dissent- [https://www.rightsanddissent.org/wp-content/uploads/2020/03/Still-Spying-on-Dissent.pdf](https://www.rightsanddissent.org/wp-content/uploads/2020/03/Still-Spying-on-Dissent.pdf)\n\nThis report provides an overview of surveillance in the US and is still useful in understanding the global context of police surveillance and the effect this has on movements.I also highly recommend looking at Trevor Aaronson's work- he is a reporter who has been writing on the FBI's use of informants and fabricated terror plots for 15 years- his older work is on motherjones and you need to access it on internet archive but you can read his book the terror factory which covers some of the stories of these 'plots'  [https://archive.org/details/terrorfactoryins0000aaro/mode/2up?view=theater](https://archive.org/details/terrorfactoryins0000aaro/mode/2up?view=theater) \n\nHe also has more current reporting on BLM infiltrators here: [https://theintercept.com/staff/trevor-aaronson/](https://theintercept.com/staff/trevor-aaronson/) and has a series called 'Alphabet boys' which has recordings made by the informer Michael Windecker in Denver 2020. \n\nAnother great resource is HOW AGENT PROVOCATEURS HARM OUR MOVEMENTS which discusses non-violence and provocateurs, some may disagree with the point the author is making but Steven Chase provides a critique of violence and the how the state uses this. [https://www.nonviolent-conflict.org/wp-content/uploads/2021/11/Agent-provocateurs-publication.pdf](https://www.nonviolent-conflict.org/wp-content/uploads/2021/11/Agent-provocateurs-publication.pdf)\n\nI think the most important zine to read is: Was my friend a spycop? [https://files.libcom.org/files/wasmyfriend.vl3\\_.pdf](https://files.libcom.org/files/wasmyfriend.vl3_.pdf)\n\nThis pamphlet is a great read for anyone involved in protest movements. Inevitably the idea that someone might be a police agent crops up. It is important not to suggest or gossip about this idea- this is called 'snitchjacketing' and promotes paranoia and disrupts work. During COINTELPRO the FBI used snitchjacketing as a common tactic of disruption. Instead if you have legitimate concerns this pamphlet provides a step-by-step guide to what you can do. \n\nAlso last just as an aside- while the tactics used by the spy cops in the UK targeted women- women infiltrators have also been used historically while not as common as male infiltrators is still a factor to be aware of.  The Stasi, the East German police used both 'Romeo's and 'Juliettes' to lure citizens to conduct espionage. Another famous example is the 'Anna' and the Eric McDavid case of 2004: [https://theintercept.com/2015/11/19/an-fbi-informant-seduced-eric-mcdavid-into-a-bomb-plot-then-the-government-lied-about-it/](https://theintercept.com/2015/11/19/an-fbi-informant-seduced-eric-mcdavid-into-a-bomb-plot-then-the-government-lied-about-it/)\n\nMy last takeaway from my research is- no organisation is too small, no person is too small for the state. I have read declassified COINTELPRO papers that discussed targeting one high school aged student, several memos from the heads of the FBI discussing just one student. The future is looking more and more fascist so be prepared.",
            "score": 65,
            "replies": []
        },
        {
            "author": "HrafnkelH",
            "body": "In kkkanada, the pigs had kids with some of the anarchists...",
            "score": 54,
            "replies": []
        },
        {
            "author": "CosmicCitizen0",
            "body": ">139 undercover officers – employed in two covert squads – spied on more than 1,000 political groups. Tens of thousands of mainly leftwing and progressive campaigners were put under surveillance.\n\nStill, it's not apparent to people that the state is the biggest terrorist organization in the world, it can do anything to protect its authority and rule over us. People think the legitimacy and authority of the state as the fundamental law of nature. Pathetic news :(",
            "score": 17,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "I have been excluded from groups in the same way the kids Brandon Darby entrapped were directly before he was able to victimize them.\n\nFucking include disabled people and even those you disagree with. Stop letting difficult people get chewed up because they are being ignored so badly by you.",
            "score": 9,
            "replies": [
                {
                    "author": "Ghuldarkar",
                    "body": "I was gonna mention how neurodivergent and disabled people often work as good vibe checks for their ethnosocial groups. You're absolutely right that we need all voices.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "autonomommy",
                            "body": "Thank you for responding. We will get to that.\n\nPlease bear with me. This is going to come out whichever way it does. \n\nMy DID system joined our group of whatever-we-weres in 2004 when I was 21. I forced myself to be included even though there was something wrong with me. Due to the history of the org, there was a lot of unchecked subcultural misogyny. I don't think this changed with the name change. I assimilated into that rather than be victimized by it, and now I have a DID alter from that time period. How nice for me. I watched people get shunned. I was punished more than once. I also watched people leave because insert blank freaked them out. Idk why I'm even obscuring names anymore. I remember when Darby came to our meeting. How perfect for him to try and find a place or profile us. All we cared about was \"there's a nazi at Barton Springs,\" and all it took was one member to vouch for this guy... one who was also stuck in Darby's long con. \n\nMy life is hell because of the paranoia that escalated during that time period. I tried to handle this when I was a drunk and had to join a 12-step program. I have 5 months after not being able to get sober since 2011. I have like 2 people left now and a ton who I will have to do amends with at step 9. I CANNOT IMAGINE WHAT IT'S LIKE for women who got stuck in a worse hell of having to put up with this man because of the \"SOMETIMES YOU HAVE TO TAKE THE L FOR THE TEAM\" mentality?????????????????????????? \n\n???????????!!\n\nThis went on for so long, but there were always signs that people who joined and left saw.  My DID would not let me see, and after a certain point, I developed Stockholm syndrome. \n\nI was doing a union campaign while this was happening, but I know more than one person from different projects who were going back and forth from TX to LA in 2005 and to that shit in 08. Watching the energy get drained from a person in real time by events exacerbated by the fucking misogyny of organizers is really something else. Especially when some of them also go once a year to a self-flagellatory white guilt fest where everyone comes back the same as before, only hungover. We were all drunk all the time except for a few people including this one kid who is a fucking lawyer now and would not give me the time of day.\n\nI needed meds, therapy, and for someone to be there for me in a real way. Maybe someone tried to tell me this. I went to jail in 13 after getting kicked out of rehab, for having an episode trying to help my homeless friend. All it took was 6 months in state jail for me to get ruined. I'm still with the same guy who I found on the street because at least he wasn't the dudes in that group. Y'all are special trying to make girls who get out of prison feel like heroes because you think ex cons are hawt. You ain't give me a house though, huh. \n\nWhat is the lump in the carpet? The lump is these issues that led to his bullshit in the first place. \n\nOur org was ego and talk. We knew how to do stuff but only always the same stuff. The one effective public action we had was using puppets to make fun of nazis in front of a town of college students until they broke down and literally just effed off back to their cars crying. I don't think b and d got to be part of that because they had already been ostracized at that point. We got made fun of by other people in the org.\n\nThis one member eventually told me the group was not appropriate for me. He ain't answer my texts now. \n\nBe careful where you fall in.\n\nI believe people with disabilities and those who prefer to address the same things in different ways should be welcomed and encouraged to express themselves with solidarity from the group. I am now a practicing Catholic and because of my experiences it's very hard for me to find a home.\n\nBrandon also chased women at AA meetings.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ghuldarkar",
                                    "body": "That sucks, I've recently learned from a youtuber how debilitating alcohol addiction can be, let alone when you have other issues as well.\n\nI'm late diagnosed ADHD and probably also ASD, and fortunately for me I've learned to read group dynamics rather early on, after being bullied a lot.\nAs amab I am also very sceptical of many men online and offline. It might seem innocent to many, but a lot of male behaviours is at best stepping over other people, and at worst pushing socially weaker people out.\n\nLike you mentioned, it's exactly that need to put yourself second and thinking you need to please the (perceived) group mentality that enables toxicity and thus abusers.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrCaptainDickbutt",
            "body": "It's endlessly frustrating that for time immemorial, the state of human society can be summarised as one absolute piece of shit male planting his feet firmly into the anuses of willing supplicants to wear them as slippers. \n\nLike why *don't the shoes mind* this man sliding his feet inside them, hammering their prostates and tearing at their anus walls? Because these \"alphas\" would prefer a strong man inside them to making decisions for themselves. *They fundamentally value proximity to power over actual freedom.*",
            "score": 29,
            "replies": [
                {
                    "author": "SpasticFlow",
                    "body": "Damn, last sentence hit like a brick.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "shadeandshine",
            "body": "Can we agree having kids while undercover is rape like they literally couldn’t consent if you aren’t even honest about who you are. Also those women should be one immune to any case brought against them because they’re a victim they made in the name of the law and they should be able to sue for millions enough to take themselves and their kid away to another nation cause the state did irreparable harm to them and their lives. Also this is proof ACAB",
            "score": 14,
            "replies": []
        },
        {
            "author": "SailingSpark",
            "body": "That's just vile.",
            "score": 6,
            "replies": []
        },
        {
            "author": "VolcrynDarkstar",
            "body": "25 names and addresses. All I'm saying.",
            "score": 7,
            "replies": []
        },
        {
            "author": "GooseShartBombardier",
            "body": ">\"The total shows how women were deceived on a systemic basis over more than three decades. It equates to nearly a fifth of all the police spies who were sent to infiltrate political movements.\n\n>Four of the police spies fathered, or are alleged to have fathered, children with women they met while using their fake identities to infiltrate campaigners.\"\n\nI'm surprised that people are still just finding out about this. It should have been an international scandal when the first story broke years ago, but apparently too few people gave a fuck about activists, the same as always. \n\nDon't fool yourself into believing that there are some good cops in the rotten barrel, and don't render aid to any of them under any circumstances. They don't deserve it for accepting and embracing this state of affairs among other less/more egregious abuses, I wouldn't piss on them if they caught fire for fear of accidentally extinguishing the flames.",
            "score": 5,
            "replies": []
        },
        {
            "author": "yeahbitchmagnet",
            "body": "Since they go after non-violent groups the same you might as well be violent and tactically and logistically prepared. Why would we keep doing the same thing for the state to just shut people down very easily. While bad and sexists men will infiltrate movements with violent tactics let's not assume all advocates of violence are infiltrators. It's clear that good violent tactics are the only thing that beat violence from the state so being non violent is literally more dangerous. The only other option is to keep getting arrested by not being covert and lethal or to just not do anything which is no solution for a mass movement. It's funny when people compile reports about this acting like we should always be non violent because violence is inherently a state infiltration tactic but they are literally proving that it doesn't matter anyway so you might as well fight\n\nEdit: So this is from a piece posted by op in the comments and there's a bit that's I think isn't significant enough to most people. The author is discussing the arrest of an activist after an inflitration.\n\n\"He testified on behalf of the government in the February 2009 trial of two Texas activists who were arrested at the RNC on charges of making and possessing Molotov cocktails, after Darby encouraged them to do so.\"\n\nSo being arrested and charged for molotov cocktails is very interesting. I'm not sure about the details of the case but these were likely already wicked if they were considering them to be destructive devices but knowing the state they could probably argue and convince a jury that because anything could be used as a wick, that the political motivation would have dictated that they would have used anything as a wick, thus making the glass bottle a destructive device just from having a flammable solvent in a glass bottle. \n \nThis us from the ATF site: \n\n\"Destructive devices include explosive, incendiary or poison gas bombs, grenades, rockets, missiles, mines, and similar devices. Molotov cocktails, or glass bottles filled with gasoline that ignite their fuse when broken, are destructive devices and thus illegal to possess under federal law.\"\n\n\nSo under this definition and by how we know the state operates, any anarchist can be arrested for buying a bottle of grain alcohol. Kind of sounds like the violence has nothing to do with this and that the lessons we should be drawing from this are about tactics. Don't let random people you just met talk you into making or doing illegal stuff, do that shit with people you trust.  Keep information seperate, vet properly, use information tests. We have access to lots of information on covert tactics so people should use it like lots of anarchist already do. Just because some people fuck up and let cops talk them into doing something where they get caught easily doesn't mean that violence is a bad tactic.\n\nAlso remeber the left can still train and practice military tactics in the open without having to do anything illegal. Lots of military training is just learning how to move together, digging special holes, camouflaging stuff. It's hard for the state to do anything against people basically just camping in the woods and if they do that's like the best propaganda for the left ever. If you aren't creating a militia structure and keep it as a training club like the SRA nothing will happen to you, and it's very important because shooting a gun is a tiny part of military training and you can't keep yourself safe from facists without understand military tactics. I know people suggesting firearms and \"self defense\" training are doing so in good faith but that only works on an individual level. We have organized right wing paramilitary militias everywhere and theyre about to start their terror campaigns. Only shooting our rifles together with combined arms support will keep is safe from their violence.",
            "score": 11,
            "replies": []
        },
        {
            "author": "The-Greythean-Void",
            "body": "**Where do I even begin with this?**\n\n* >![Category:Police officers convicted of rape](https://en.wikipedia.org/wiki/Category:Police_officers_convicted_of_rape)!<\n* >![Category:Sexual abuse in law enforcement](https://en.wikipedia.org/wiki/Category:Sexual_abuse_in_law_enforcement) !<\n* >![Category:Child sexual abuse in law enforcement](https://en.wikipedia.org/wiki/Category:Child_sexual_abuse_in_law_enforcement)!<\n* >![Law Enforcement – Republican Sexual Predators](https://goppredators.wordpress.com/tag/law-enforcement/)!<\n* >![New Police Strategy in New York – Sexual Assault](https://theanarchistlibrary.org/library/david-graeber-new-police-strategy-in-new-york-sexual-assault)!<\n* >![Since 2010 At Least 1300 Women and Children Have Been Sexually or Physically Attacked by UK Cops](https://theanarchistlibrary.org/library/lohse-cops-crimes-against-women-and-kids-theory-and-analysis)!<",
            "score": 4,
            "replies": []
        },
        {
            "author": "idrilirdi",
            "body": "The Spanish government is doing the same with the Catalan independence movement and other leftist groups in Catalonia (it's probably leftist groups in general in Spain, but it's in the Catalan groups where their cover has been blown). \n\nHow \"fun\" they never do this kind of extrajudicial infiltration in fascist groups, that'd probably lead to the spiderman meme",
            "score": 3,
            "replies": [
                {
                    "author": "idrilirdi",
                    "body": "The day after I post this comment they find another one:\nhttps://diariosocialista.net/2025/03/05/descubren-a-otra-policia-infiltrada-en-movimientos-sociales-de-barcelona-durante-dos-anos/",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlantainHopeful3736",
            "body": "Reminds me of the film Art School Confidential.",
            "score": 3,
            "replies": []
        },
        {
            "author": "crabbot",
            "body": "\"blatant misogyny often goes unaddressed\"\n\nYeah. Often, or basically always.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Instruction-3653",
            "body": "This isn't too surprising, and this is unfortunate. And it's highly advised that people are more careful with who they let into their revolutionary and radical movements.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Illustrious2786",
            "body": "Did it all for the nookie.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Herbacio",
            "body": "Anna is a stool pigeon. And will forever be.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lux-xxv",
            "body": "Oh and I bet they charged the people they slept with for solicitation because all cops put their hand in the cookie jar before busting it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "coldbrains",
            "body": "Fucking deviants!",
            "score": 1,
            "replies": []
        }
    ]
}