{
    "title": "Are there any good anarchist Youtube channels?",
    "author": "princealigorna",
    "subreddit": "Anarchism",
    "rank": 8,
    "score": 150,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 96,
    "url": "https://www.reddit.com/r/Anarchism/comments/1j35ptr/are_there_any_good_anarchist_youtube_channels/",
    "id": "1j35ptr",
    "selftext": "Just what it says. Not broadly Leftist, but specifically anarchist?",
    "comments": [
        {
            "author": "twodaywillbedaisy",
            "body": "Check out Andrewism, CyberDandy, AnarchaSemiyah",
            "score": 91,
            "replies": [
                {
                    "author": "chileowl",
                    "body": "Plus anark",
                    "score": 23,
                    "replies": [
                        {
                            "author": "twodaywillbedaisy",
                            "body": "Certainly wouldn't be on my list of good anarchist Youtube channels.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "VolcrynDarkstar",
                                    "body": "Why not? Anark is great. His 'The State is Counter-Revolutionary' and 'A Modern Anarchism' series are top tier.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "crake-extinction",
                                            "body": "Maybe he's watched an Anark video on regular speed. Gotta 2x that shit.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kotukutuku",
                                    "body": "What's your problem with Anark?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mm--yess",
            "body": "Zoe Baker is pretty cool",
            "score": 84,
            "replies": []
        },
        {
            "author": "Julian_1_2_3_4_5",
            "body": "I lovee andrewism",
            "score": 35,
            "replies": []
        },
        {
            "author": "Comfortable-Bag7100",
            "body": "Radical reviewer",
            "score": 28,
            "replies": []
        },
        {
            "author": "NoGoodAtIncognito",
            "body": "Andrewism, Zoe baker, Anark, An Anarchist FAQ, Prince Shakur, Radical Reviewer, The Anarchist Audio Library (no particular order)",
            "score": 28,
            "replies": []
        },
        {
            "author": "ringpopcosmonaut",
            "body": "Andrewism is excellent\n\nThought Slime’s early work was how I got introduced to anarchism. They do a good job going over the basics for a beginner with a fun and silly style\n\nThe Anarchist Audio Library is a channel that records audiobooks if you’re into that\n\nAnansi’s library isn’t entirely focused on anarchism but they cover it a lot. Lotta good media analysis too\n\nEdit: left out Noncompete. Tbh his production style and the way he delivers his message isn’t my favorite, but he was also one of my first exposures to anarchism. It’s a good introductory source but as I learned more nuance I eventually drifted away from him",
            "score": 53,
            "replies": [
                {
                    "author": "Hotbones24",
                    "body": "There's something weird about Noncompete to me and I don't know what it is. Maybe how it feels like he's selling the aesthetics of Communism? Idk. The videos themselves aren't bad, but there's this air of.. like I'm being sold to.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "ringpopcosmonaut",
                            "body": "I totally agree - Idrk how to describe it but there's def something that feels off. Broadly speaking I don't think he's overtly wrong about a lot... but as I learned more about anarchy, noncompete got harder to watch. I'd still say he's a decent starting point for new people tho",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Hotbones24",
                                    "body": "True, true. I think I watched some newer (maybe the newest) video of his that said his journey into learning about leftist ideologies started in 2017 and he almost immediately started making videos about it. Which kind of made things make more sense to me. He hasn't spent very long with the subject and instead of letting his views/ideas develop in peace, he keeps making them into consumable products as he goes along.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ringpopcosmonaut",
                                            "body": "That makes a lot of sense actually. Kinda wild to do that... I was exploring socialism and anarchism for a couple years before I felt comfortable enough to talk to others about it lmao\n\nI remember he had other videos where he talked about how he started a business in the past and was describing how he shifted from capitalist to communist. Maybe he just got really excited about it, needed income, and decided youtube was the way to go.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SINGULARITY1312",
                            "body": "Completely agree. I am cynical about noncompete, and his tankie wife at that.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "MrGoldfish8",
                            "body": "I'm not very fond of him. I recommend watching Zoe Baker's response to him talking about Platformism.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ringpopcosmonaut",
                                    "body": "I haven't seen that vid. Thanks for the rec, I'll check it out!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "learned_astr0n0mer",
                    "body": "Noncompete is a tankie.\n\nAlso, I hear good things about Prince Shakur.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "SINGULARITY1312",
                            "body": "really? doesnt he identify with anarchism?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "learned_astr0n0mer",
                                    "body": "Yeah, but then he married Luna Oi and now apparently he's an anarchist in name only.\n\nI don't follow YouTube stuff. Maybe there's a comment here explaining it.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Feeling_Wrongdoer_39",
                    "body": "Strongly agree with anansi's library and Andrew am, both are great. Non-compete however has one of the poorest understandings of anarchism I've seen, only beat by I forget his name, re-education or something",
                    "score": 9,
                    "replies": [
                        {
                            "author": "MrGoldfish8",
                            "body": "Yeah, it's Re-Education.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stonekite2",
            "body": "SolarpunkAlana is great.",
            "score": 16,
            "replies": []
        },
        {
            "author": "AcadianViking",
            "body": "Anark is my favorite",
            "score": 42,
            "replies": [
                {
                    "author": "NoGoodAtIncognito",
                    "body": "I CANNOT believe I had to scroll so far down to find Anark mentioned. His essays are masterpieces and his abridged series has helped really grasp some concepts that didn’t make sense at first",
                    "score": 23,
                    "replies": [
                        {
                            "author": "AcadianViking",
                            "body": "I love his videos for his critical analysis of anarchist theory and how he always ties it in with historical parallels. That he primarily keeps all of his analysis grounded in reality to push back against the notion that anarchism is \"idealist fantasy\" ^(while simultaneously pointing out the idealism of statist philosophy in their blind trust of a State entity after numerous examples of how those entities will put their own interests above the needs of the collective to maintain its authority but I digress)",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "SINGULARITY1312",
                            "body": "yeah in terms of quality per video anark is a top contender",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "QueerAlQaida",
            "body": "Soma’s Academy and TwinRabbit (First Nations anarchist his video on two spirit people is my favorite) are one of my favorites other than the people already listed here . Colormind Nicholas Black and John the Duncan are also great.",
            "score": 14,
            "replies": [
                {
                    "author": "mcchicken_deathgrip",
                    "body": "Twin Rabbit's video on stolen anarchy is a must watch for sure.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "QueerAlQaida",
                            "body": "As much as I liked that video I’m still kind of confused about it honestly. Though I do love the reading materials he put in towards the end of it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Daringdumbass",
            "body": "Andrewism and Prince Shakur",
            "score": 11,
            "replies": []
        },
        {
            "author": "RickAF1",
            "body": "Thank you for all the suggestions, much appreciated! And OP for asking!",
            "score": 10,
            "replies": []
        },
        {
            "author": "The-Greythean-Void",
            "body": "* Anarchistara\n* Anark\n* Andrewism\n* ItHadToBeSaid\n* Libertarian Communist Platform\n* LuckyBlackCat\n* Lucretia McEvil\n* Prince Shakur\n* Zoe Baker",
            "score": 17,
            "replies": [
                {
                    "author": "WildAutonomy",
                    "body": "I like 1 of those channels",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Artistic-Choice6785",
            "body": "Andrewism, Prince Shakur, Zoe Baker, AudibleAnarchist..",
            "score": 8,
            "replies": []
        },
        {
            "author": "HowlMockery",
            "body": "They've mostly shifted to video games and movies over the past year, but Renegade Cut is great.",
            "score": 9,
            "replies": [
                {
                    "author": "princealigorna",
                    "body": "Let's plays or game reviews?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GrahminRadarin",
                            "body": "Something different. Closer to a review. Kind of like an extremely low energy and calm RussianBadger. He stopped because political works were getting to be far too much for him to handle.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Catnip_Overdose",
            "body": "IDk if FD Signifier is explicitly anarchist, but I enjoy his commentary a lot and I think there’s a lot of overlap.\n\nThere’s also Overthrow Media/Bigg Villainous\n\nFirestorm books has a channel with all their author talks and panel discussions",
            "score": 7,
            "replies": []
        },
        {
            "author": "DyLnd",
            "body": "Channels I frequent/recommend:\n\nNon Serviam Media (for podcasts etc.)  \nAndrewism  \nZoe Baker  \n(the above two other ppl have mentioned, they're pretty good)  \nPlutophrenia has a few good videos on Mutualism specifically\n\nTbh, that's about it in terms of those I watch. There's a load of generally good lefty/adjacent/whatever/politcs+philosophy YouTube ppl who I like, making pretty consistent content, but yea, not specifically anarchist.",
            "score": 7,
            "replies": []
        },
        {
            "author": "cuzaquantum",
            "body": "Thought Slime is pretty good, but they don’t post very often anymore.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Anarchist_BlackSheep",
            "body": "Add Anark to the list. He uses big words and it isn't intro level stuff, but he's good at what he does.",
            "score": 23,
            "replies": []
        },
        {
            "author": "chileowl",
            "body": "Submedia",
            "score": 5,
            "replies": []
        },
        {
            "author": "nightslayer78",
            "body": "All the good ones I used to watch don't post any more. But libertariansocialistrants was a good one i liked. \n\nsubMedia has a lot of educational videos. I recommend the A for Anarchy series. And \"What is Mutual Aid\" and \"What is Direct Action\".",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ghuldarkar",
            "body": "He's definitely not an anarchist youtuber but I want to mention Unlearning Econonics, he's been very useful to me to understand some economical topics that are not often discussed in anarchist media.",
            "score": 4,
            "replies": []
        },
        {
            "author": "grandlotus2",
            "body": "Lucretia Mcevil",
            "score": 9,
            "replies": [
                {
                    "author": "BlackOutSpazz",
                    "body": "Underrated!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "grandlotus2",
                            "body": "INCREDIBLY",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "BlackOutSpazz",
                                    "body": "It's a real shame. Channels like that really deserve more support. There's already so few and I've seen so many come and go through the years that made great content but the audience never came so they moved on.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "grandlotus2",
                                            "body": "They're pretty active, I'm sure they are aware of the uphill battle.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Daringdumbass",
                    "body": "Literally just discovered them yesterday",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "GroundbreakingWeb360",
            "body": "Andrewism is, I think, THEE Anarchist Youtuber. Covers a wide range of topics, has politics that are solid and consistent, not focused on drama or BS. Plus he has a great speaking voice and a beautiful accent, could listen to him for hours. And he is interested in like solarpunk and library economies. Something that I think is the future really.",
            "score": 9,
            "replies": [
                {
                    "author": "princealigorna",
                    "body": "What are library economics?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Destro9799",
                            "body": "Andrewism's video explaining the concept (27min):  https://youtube.com/watch?v=NOYa3YzVtyk\n\nVery simply, it's organizing other aspects of the economy similarly to a library system, where things that are currently commodities can be \"checked out\" from the community as needed instead of being rented/bought from capitalists.  The video explains it in much more depth, with links to sources you can use to learn even more.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "princealigorna",
                                    "body": "That sounds  cool. Will definitely check out the video",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "crake-extinction",
                            "body": "If only there was a [smooth talkin' Trinidadian](https://www.youtube.com/watch?v=vW5EVNT--DA) to explain it.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Strawb3rryJam111",
            "body": "Anark, Prince Shakur, and Andrewism are the top three that really helped me in my learning of anarchism.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Plenty-Climate2272",
            "body": "NonCompete *was* good, but he's been on an M-L pipeline lately. I can't entirely blame him. His partner is a Vietnamese marxist, and he lives in Vietnam. His channel is decently well known, so he may have to publicly toe the line. And when our loved ones believe things that differ from ours, we are inclined to look at those ideas more charitably, then we might otherwise.\n\nIf he is drifting towards Marxism, it's definitely on the more autonomist, libertarian left side. So I don't think he's bad. Just... not strictly anarchist anymore.",
            "score": 10,
            "replies": [
                {
                    "author": "DyLnd",
                    "body": "\"lately\" I think he's pretty solidly barrelled down it from the getgo.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "NoGoodAtIncognito",
                    "body": "I thought I was going crazy thinking to myself watching his latest video thinking “wasn’t he an anarchist?”",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ringpopcosmonaut",
                    "body": "Maybe that's why he's seemed off to me recently. He was one of my first exposures and I really liked his stuff, but over time there's def been a shift and I didn't know how to describe it. But your explanation makes a lot of sense to me so ty for sharing",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CharaFan101",
            "body": "Andrewism, Anark,",
            "score": 7,
            "replies": []
        },
        {
            "author": "EKsaorsire",
            "body": "Rattling the Cages is pretty dope",
            "score": 3,
            "replies": []
        },
        {
            "author": "CatTurtleKid",
            "body": "Sophie From Mars and AnRel are my two recs! \n\nAnRel only put out a couple videos but their work theorizing around how to implement anarchist practice in interpersonal relationships is brilliant and incredibly worth while. Can't recommend enough. \n\nSophie From Mars is a classic ancom in a way I don't really see anymore. Her video \"the World Isn't Ending\" is well worth a watch and her coverage of various tech industry grifts are sick.",
            "score": 5,
            "replies": [
                {
                    "author": "bobnobody3",
                    "body": "I'm so glad someone mentioned these! Fully agree.\n\nAnRel is fantastic, every single video is super interesting, engaging and enjoyable.\n\nAnd as someone who started to get interested more earnestly in anarchism through frustration with liberal and doomer takes on the climate crisis, \"The World Isn't Ending\" had quite an influence on me. I'd recommend it to pretty much anyone.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QueerAlQaida",
            "body": "Art of Paya was also a favorite YouTuber of mine but she hasn’t uploaded in a while :( she paints and talks about the experience of being black and autistic",
            "score": 2,
            "replies": []
        },
        {
            "author": "DrRudeboy",
            "body": "Wasn't hbomber anarchist when he was still making political content? I seem to remember as so, but this is going back many years",
            "score": 2,
            "replies": [
                {
                    "author": "DyLnd",
                    "body": "nah hbomb is/was a demsoc of some variety, as far as I can tell.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DrRudeboy",
                            "body": "Yeah fair, I haven't watched his videos in yonks",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DyLnd",
                                    "body": "i find his videos are generally great, don't get me wrong.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Returning_Armageddon",
            "body": "Lucretia Mcevil is really informative and natural",
            "score": 2,
            "replies": []
        },
        {
            "author": "thisthe1",
            "body": "Andrewism",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Instruction-3653",
            "body": "Anark is a good channel and ItHadToBeSaid is also good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MacondoSpy",
            "body": "Colonial outcasts",
            "score": 2,
            "replies": []
        },
        {
            "author": "WildAutonomy",
            "body": "[Submedia](https://youtube.com/@submedia) is the one to beat. Breadtubers are really hit and miss.",
            "score": 2,
            "replies": [
                {
                    "author": "princealigorna",
                    "body": "Thank you for the link. Definitely looking into Sub. Their stuff appears to be very professional and documentary-like",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "princealigorna",
            "body": "Probably should have added this to the main body, but what I'm interested in is an anarchist counterpart to say The Young Turks or Democracy Now! Daily current events and news through the anarchist lens.\n\nI'll definitely check out everyone's suggestions though. \n\nAlso, to whoever suggested Audible Anarchist, I already follow the podcast, but I agree they're great. Fantastic way to be introduced to theory.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BrownArmedTransfem",
            "body": "Andrewism, zoe baker, and thoughtslime.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SINGULARITY1312",
            "body": "\"WhatIsPolitics?\" Is underrated, as is Anark",
            "score": 2,
            "replies": [
                {
                    "author": "Emergency_Okra_2466",
                    "body": "the fact that no one before you mentionned what is politics is a pretty good indicator of how underrated he is. His videos really are going back to the basics and use anthropology and political sciencse very effectively",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SaltyNorth8062",
            "body": "NonCompete, although their work is very Marx heavy. They were the first exposure I had to anything beyond liberalism, but I bounced right off. Their early stuff is still good but I'm keeping them at arm's length for now.\n\nThoughtslime was my real proper introduction. They haven't done much about anarchism explicitly in a while, but their early stuff is great for basics. Probably my peak recommend for baby leftists.\n\nAndrewism is great for wider anarchist concepts like library economies and third spaces. Probably my peak recommend for someone that isn't a baby leftist.\n\nZoe Baker covers a lot of things from an anarchist perspective and does great work on cultural understanding.\n\nRadical Reviewer is great if you're new to theory.\n\nPrince Shakur does kore general youtube stuff but as an anarchist with a pro-black perspective.\n\nElliot Sang also does good work in spreading word on how to organize.\n\nCam James does basic youtube political discussion, and I recommend him, but I'm not sure if he's explicitly an anrchist or not. Same goes for We Gon Be Alright: not sure if he's an *anarchist* but he does good work especially for me, because he lives in my state of Ohio near my area, and covers local poltics and news. If you are an ohioan, I strongly recommend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alboralix",
            "body": "Weirdly enough, Badmouse is back at making anarchist content.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sorry-Apartment5068",
            "body": "I came to add a kind of offbeat one. Feral Historian does not directly identify as an anarchist, but also, in a recent video, alluded to it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "commenting to save this lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical_Screen112",
            "body": "Lucretia mcevil",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoadCaptin2000",
            "body": "Re education",
            "score": 1,
            "replies": []
        },
        {
            "author": "BubbleTeaDream",
            "body": "[Valium Sadfemme McGirlBoss](https://youtube.com/@valiumsadfemmemcgirlboss?si=6O3Jt5fnwHb2-koj)",
            "score": 1,
            "replies": [
                {
                    "author": "princealigorna",
                    "body": "Ooh, a link!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "month_unwashed_socks",
            "body": "Gotta share one of my new finding that i think deserves some more love [RE-EDUCATION](https://youtube.com/@deadheadanimation?si=806YhGBc7KZaQ8zs)",
            "score": 1,
            "replies": []
        },
        {
            "author": "HydarPatrick",
            "body": "I would mention Andrewism again and also Kathrin. I’m not sure if she’s explicitly anarchist, but she definitely leans that way and her videos are brilliantly thought out and observant either way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult-Touch1464",
            "body": "Someone said it probably but Badmouse is pretty good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anarcho_Humanist",
            "body": "Here's my list\n\n* [Anark](https://www.youtube.com/@Anark)\n* [Andrewism](https://www.youtube.com/@Andrewism)\n* [LuckyBlackCat](https://www.youtube.com/LuckyBlackCat)\n* [Zoe Baker](https://www.youtube.com/@anarchozoe)\n\nEDIT: AudibleAnarchist and SubMedia too\n\nAlso, I'm not sure if she's an anarchist but [Dr. Fatima](https://www.youtube.com/@dr.fatima) has some of the best videos I've ever seen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "These-Shop-1716",
            "body": "Didn’t see anyone mentioning LuckyBlackCat so far but she has some great videos",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lotus532",
            "body": "Prince Shakur",
            "score": 1,
            "replies": []
        }
    ]
}