{
    "title": "Just got a Series X and wow!",
    "author": "maingon",
    "subreddit": "XboxSeriesX",
    "rank": 19,
    "score": 590,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 259,
    "url": "https://www.reddit.com/r/XboxSeriesX/comments/1cv983c/just_got_a_series_x_and_wow/",
    "id": "1cv983c",
    "selftext": "I’ve had a ps5 for a while and also a Xbox one X and too bad this isn’t selling better. Hardware is so so nice  ",
    "comments": [
        {
            "author": "Ambitious_Dig_7109",
            "body": "The backwards compatibility is a really nice feature. Between that, gamepass and exclusives it’s worth it for me to have both main consoles.",
            "score": 415,
            "replies": [
                {
                    "author": "Chris9871",
                    "body": "I also really love quick resume. My ADHD brain has a hard time focusing on one game at a time",
                    "score": 142,
                    "replies": [
                        {
                            "author": "ReeceReddit1234",
                            "body": "Kinda wish they'd let us turn it off for certain games (online games that can't use quick resume)",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "carlctz1978",
                                    "body": "You can just on home screen on the game you played press the menu button and then scroll down to quit game... I hate the quick resume don't know why just hate it and took me all of a week to figure out that is how to quit a game",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Chris9871",
                                    "body": "But everyone should know already that suspending online games don’t work anyway. Quick resume isn’t any different when it comes to online games",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ReeceReddit1234",
                                            "body": "Yes but typically with QR, when I turn my Xbox off, and come back to it, the online game crashes. Which is obviously going to happen but there should be an option to turn that off so it just quits when the game is switched or the console turns off etc. That way when you come back to it you just go through the loading screens rather than having it crash then take you through the loading screens",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "LightsShine17",
                                                    "body": "You could also just \"quit\" the game you don't want to quick resume.... you press the xbox button to get to the menu, then use the start button to select quit. Works like a charm",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "amazingdrewh",
                                                            "body": "It could also just quit the game when the console is turned off that would work like a charm if they had put more than two seconds of thought into the feature",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Chris9871",
                                                    "body": "I never turn my Xbox off, so I guess that makes sense",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "Agreed. COD doesn't like it or at least it didn't the last time I played COD on a XBSX.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "KD--27",
                                            "body": "This will be an interesting one for the next entry into the series",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Bluetenant-Bear",
                                                    "body": "What makes you say that?",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dolphin_Hornet",
                                    "body": "Yes and certain games just flat out crash. We need to be able to choose what games can be quick resume",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "carlctz1978",
                                            "body": "You can just on home screen on the game you played press the menu button and then scroll down to quit game... I hate the quick resume don't know why just hate it and took me all of a week to figure out that is how to quit a game",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dolphin_Hornet",
                                                    "body": "I know but it doesn't always work.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Leafs17",
                                    "body": "Yes. They need to add the option.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Don't know how you do it. I'm also ADHD and the opposite. If I put a game down my interest is immediately focused on a new game. Takes me forever to finish some games because I'll forget about them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thelastsandwich",
                    "body": "Do yourself a favor and buy or put in the game disc of SSX 3\n\nhttps://preview.redd.it/1s0exh1hlc1d1.jpeg?width=745&format=pjpg&auto=webp&s=6485474cc08edbc9c951ab4fc1c8a36821c7789d",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "No-Strike-4560",
                    "body": "The best feature IMO is play anywhere. Not enough people talking about it and it really is a .. ahem ... Game changer being able to play something like infinite wealth at home on my X , then stay at my girlfriend's for a few days, take my laptop and keep playing from where I left off. AND without having to buy the game twice too.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "pichael289",
                    "body": "Those first two sold me. A modern system I can play most of the metal gears on? Absolutely. And then they even rereleased them to people who don't own the hd disk. Also the first game was included in the system now? Great. \n\nExclusives? Ehh, they didn't turn out so well. But gamepass and backwards compatibility sold me. Been hearing FF7R2 might come over, then there's just death stranding two standing on the way. Might rent a PS5 if it's still just one game then.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Dimitri_De_Tremmerie",
                    "body": "Been a ps gamer all my life but this gen ... Sony lost me. I still have a ps5 and am really doubting to also get a series x. Because of gamepass and all this Xbox content I have never seen or played. \nI'm guessing you keep the ps5 for the exclusives and the Xbox for all gamepass and multiplat?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ambitious_Dig_7109",
                            "body": "Yeah basically plus the auto hdr, frame rate and resolution boosts for older games. Xbox is the best place to play old titles imo.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pristinejake",
                    "body": "I got both main consoles and I’m super happy this generation. I really enjoyed the exclusives on both the xbox series and the ps5. What a fantastic generation. That new hell blade was amazing!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "In-corrections",
                    "body": "*having",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "XCRIPSXX_OG",
                    "body": "What exclusive bro😂😂😂😂, they all\nSuck. Even starfield was mid ,  and I have an Xbox plus a ps5, so don’t think I’m a hater",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ambitious_Dig_7109",
                            "body": "I’m a big classic crpg guy so games like Pentiment and Avowed are the exclusives I enjoy. Looking forward the next Elder Scrolls will be a big one.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "XCRIPSXX_OG",
                                    "body": "I’m\nAn huge elder scrolls fan man , but I belive xbox will successfully fuck it up",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ambitious_Dig_7109",
                                            "body": "If anyone can it’s Microsoft lol. Fingers crossed. Don’t fuck up!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LateralEntry",
                                    "body": "Wasteland 3 was soooo good!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ambitious_Dig_7109",
                                            "body": "Fantastic game. Need to play through again one of these days. Fire smg was too op.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "Have you played 2",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LateralEntry",
                                                    "body": "I tried, couldn’t get into it. It was a little too rough around the edges.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "I just asked cause I felt 2 was better.  3 is still awesome.  If you want rough around the edges try the first one lol.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "gibbersganfa",
                                    "body": "How can you possibly say you “enjoy” Avowed when it’s not released yet?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ambitious_Dig_7109",
                                            "body": "I’m a huge Obsidian fan and loved the PoE games. I can’t wait to get back to Eora. I joined the kickstarter for both 1&2. Hopefully WotC gets them to do BG4 after Larian dropped out.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "I havent played it , is pentiment is an rpg? \n\nI'm interested in avowed but not thrilled about the first person view. I'll still try it. I have all 3 systems and kinda have just dev mode my Xbox until some stuff drops. I know playstations first party hasn't exactly lit it up this year either but what has been exclusive was awesome and I play pretty much all multiplatform games on my ps.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ambitious_Dig_7109",
                                            "body": "Yep, adventure rpg. No combat.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "I see. Maybe I'll check it out. I just ignored it cause I seen it described by a couple as more of a visual novel. Guess I should've checked myself.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -106,
                    "replies": [
                        {
                            "author": "NumerousBug9075",
                            "body": "And how is your last point relevant to the XBOX sub exactly? Where is the competition?\n\nOP is simply celebrating a new console and everyone here simply wants to congratulate them. To go 'PC is better', when NOBODY asked is pedantic for no reason.",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "Ambitious_Dig_7109",
                            "body": "PC is a great option if you want to deal with the quirks. I did it for years. My Steam account has well over 500 games on it. I tried living room PC’s because I game on a couch and tv set up and never was able to build a system as small, quiet and cheap as the main consoles. They’re basically subsidized proprietary PC’s. Now I don’t have to mess around with driver updates, game settings or trying to figure out what combination of drivers will let old games run. On my Xbox all my old games boot up and run flawlessly at 60fps with auto hdr. It’s way better than the equivalent experience on PC imo. I also don’t have to deal with lazy, unoptimized PC ports that require top end hardware to run around the equivalent performance of its native console hardware. I lived the PC life and don’t regret switching over one bit.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I like having all the current game consoles and a PC for games only on PC (plus modding) and for emulation of games too.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Picked-sheepskin",
                                    "body": "Currently dealing with a (possibly) failing graphics card. Graphical glitches and artifacts in games. Frequent crashing, especially with Diablo 4. Computer’s 3.5 months old. So yeah, I feel that. I’ve got both a Series X (living room) and Series S (office) and those things can sit dormant for months then boot up, maybe the occasional update, but basically right back to where I was when they were last on. \n\n\nI love me some PC gaming, and sometimes that’s what you need (Hades 2 EA anyone?) but goddamnit it’s so much simpler on a console",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -21,
                                    "replies": [
                                        {
                                            "author": "Ambitious_Dig_7109",
                                            "body": "Yeah Bethesda has been a shit show for ports for years. Fallout 3, New Vegas and Skyrim were all buggy messes. They were buggy messes on PC too but up until recent years you couldn’t access mods to fix it on console. Modding Skyrim on my Xbox is a great leap forward and I hope other games like BG3 offer mod support in the future. I’d imagine being a Microsoft owned company Bethesda is going to get more focus on console optimization like Starfield getting a 60 fps patch so soon after release like you mentioned. \n\nIt’s pretty hard to come up with a list of PC to Console ports these days. The majority go Console to PC with Sony’s titles being particularly poorly optimized for the platform. Some bad examples from the last couple years are: Forspoken, Horizon Forbidden Dawn, The Callisto Protocol, Gotham Knights, Hogwarts Legacy, Elden Ring, Midnight Suns and Dead Space. \n\nhttps://www.pcgamer.com/pc-gamers-really-fed-up-with-one-bad-pc-port-after-another-2023/\n\nPC gaming, to me, is more similar to building hot rods as a car guy. They’re cool and in limited ways they can have incredible performance but they’re wildly impractical and expensive for regular use. Checking out all the effects on Cyberpunk running on my 3080 was neat but I honestly didn’t notice much of a difference when actually playing the game on my Series X.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PixelProphetX",
                            "body": "Xbox actually supports backwards compatibility for some xbox games that aren't on PC and also has superior backwards compatibility enhancements including double the FPS up to 60, increased resolution, tessalation, AA, HDR, etc \\*\\*in select titles\\*\\*.\n\nPC is really good and probably better overall but the purposes of XBox and PC are pretty different.\n\n  \nsigned, someone with a rtx 4090, 5800x3d, 84 inch LG G2 OLED, Samsung G9 Neo monitor.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "PixelProphetX",
                                            "body": "That's why said \\*\\*for select titles\\*\\* learn to fucking read",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "PixelProphetX",
                                                            "body": "It depends on the title.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MonsterThumb101",
                            "body": "So, why are you even on this sub? To act superior?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "GilmooDaddy",
                                    "body": "His language suggests severe basement dweller syndrome. Save your energy on this one. 😂",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Malakai0013",
                            "body": "All they said was that backward compatibility was a nice feature, not that it was better than PC. Chill, homie.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ItsLCGaming",
            "body": "Just in time for hellblade 2",
            "score": 185,
            "replies": [
                {
                    "author": "maingon",
                    "body": "One of the big reasons! I’m excited.",
                    "score": 80,
                    "replies": [
                        {
                            "author": "SMRAintBad",
                            "body": "Have fun and enjoy!",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DRAGONZORDx",
                    "body": "I’ve seen a couple trailers, but I can’t really tell for myself: is this going to be a horror game? If so, I’m not interested, but if it’s “horror” the same way Diablo IV is, as opposed to say, Dead Space, I’m in!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "RheimsNZ",
                            "body": "It's not a horror, more a psychological thriller. Probably some horror aspects, but not a full-fledged horror game.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "DRAGONZORDx",
                                    "body": "Kind of like Alan Wake II in that sense then, right?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "RheimsNZ",
                                            "body": "If I'd ever played Alan Wake I would let you know 😅",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "UnoriginalGinger",
                                            "body": "Sorta. The first one is available now to try if you want to find out for yourself. I found it really creepy at times, but nothing truly horrific like Dead Space. Honestly it’s a beautiful game with some simple mechanics, but the voices in her head creeped me out, but made it a very memorable experience.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "DRAGONZORDx",
                                                    "body": "You had me at “simple mechanics”! Putting the time in to master a game with crazy mechanics can look pretty daunting. Especially if you’re playing multiple new games at the same time.\n\n\nI’ll have to give it a shot since the first is on GP right now!",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sean3192",
                                            "body": "It's been a while since I've played the 1st Hellblade, but from what I can remember there's really no horror elements to it. If anything just some psychological moments, with Senua hearing voices or seeing things that aren't really there. Nothing I'd have considered \"scary\" though and I'm a pretty big pansy and not a fan of the horror genre either.\n\nI'd say if you've played Alan Wake II you should have no problem with Hellblade. I absolutely loved Alan Wake II and to me that had plenty of legitimate jumpscares and tense moments, definitely more intense than anything I can remember from Hellblade.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "DRAGONZORDx",
                                                    "body": "Really appreciate this comment, considering you’re not into horror either, and loved AWII like I did!\n\n\nI’ll give the first one a go on GP for sure!",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "KD--27",
                                                            "body": "Just a tip, headphones are where it’s at when the voices come.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Malakai0013",
                            "body": "Watch gameplay from the first game, might give you a decent idea of what the sequel will look and play like.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DRAGONZORDx",
                                    "body": "Will do, thanks!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "arex333",
                                            "body": "And also if you decide you're interested, you'll probably want to play hellblade 1 prior to 2 since the story is a direct continuation.\n\nI wouldn't personally call hellblade a horror game. It's definitely gory and tense, but I don't remember a single instance of the game trying to scare me.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CryptographerSafe252",
            "body": "Big fan of the hardware, OS and environment. Marketing has been a dud with Xbox…",
            "score": 114,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Darth_Carnage",
                            "body": "Not only that, but I grabbed a Backbone for $100 and with remote play it essentially turns your Series X into a handheld console. Quick resume works the same way, and you can even play disc games.\n\nBeing able to play games like Balatro on the couch while I hang out with my wife in the evenings has been wonderful.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Skidoood",
                                    "body": "Yeah you don’t even need your Series X for remote(cloud) gaming anymore",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "maingon",
                    "body": "It’s sad because it’s pretty great",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "PitiedVeil55831",
                    "body": "Agreed, feel like the general public don’t even know the series x exists",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "kenshinakh",
                    "body": "It's kinda funny because Sony's heavy exclusive deals and large advertising as the main place to play exclusives, with their generally anti-consumer approach to things pushed me to Xbox where they might not have the best exclusives, but at least they're not locking things to a console. The PC cross support from Xbox won me over big time. Steam, PC and Xbox game pass is my main gaming spend now. I rather things be more open and accessible.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "You say this as if Sony hasn't been releasing its 1st party games on pc lately. As far as 3rd party exclusives all 3 do it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "derbock203",
                            "body": "Same thing happening to me right now. Selling the ps5 now and thinking about buyin the xbox",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rupal_hs",
            "body": "Real gamers game on all platforms. 🫡",
            "score": 27,
            "replies": [
                {
                    "author": "Klashus",
                    "body": "Nice to be able to play the originals and get stuff on pc for better fps.  Games releasing at 30 fps is a shame.  Feels like the game is laggy once you know better",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AbbreviationsThis550",
                    "body": "true dat. I just wish PS consoles weren’t so expensive, as I have a Switch and XONE.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "I grabbed a second one for the kids for 280 off marketplace and it was a disc version.  Used obviously.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lurky-Lou",
            "body": "Forza Horizon 5 is a wonderful welcome",
            "score": 77,
            "replies": []
        },
        {
            "author": "ShakeItLikeIDo",
            "body": "I’m glad more people own both than just one",
            "score": 62,
            "replies": [
                {
                    "author": "maingon",
                    "body": "I’ve always owned all the major systems. Just never right at launch. Got ps5 first but always planned on getting the series X",
                    "score": 25,
                    "replies": [
                        {
                            "author": "ShakeItLikeIDo",
                            "body": "I’m the opposite. Had both xbox one and ps4 last gen and I upgraded to the series x but haven’t to ps5 yet",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "CallMeDucc",
                                    "body": "i had playstation and xbox growing up, but after all my friends started playing halo i kinda just fell into that category. so nowadays i skip the ps5, but i do keep up with nintendo consoles, the switch is great",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ShakeItLikeIDo",
                                            "body": "I do sometimes think about going back to Nintendo. Last handheld Nintendo consoles I bought was the DS and last home console was the SNES. I was going to buy the Switch but with all these Switch 2 rumors, I think I’m just going to wait",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "CallMeDucc",
                                                    "body": "nintendo is the only console brand i still buy physical games for. they keep their resale value unlike any other",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "ShakeItLikeIDo",
                                                            "body": "Plus you dont need to actually install them on the Switch, correct?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "CallMeDucc",
                                                                    "body": "only a select few games require an install, usually games that are just too big to fit on the cartridge. that or multiplayer games with a day one patch, beyond that? you pop it in and it starts",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SlammedZero",
                                                            "body": "Yup, funny enough, I'm the same. I've finally turned to enjoying digital games on my Xbox/PS5, but I love to have physical games for my Switch.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "amazingdrewh",
                                                    "body": "At this point I'd just wait, they're gonna reveal the Switch 2 by the end of March",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "amazingdrewh",
                                                    "body": "At this point I'd just wait, they're gonna reveal the Switch 2 by the end of March",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Impassable_Banana",
                                    "body": "ps4 crushed last gen, what made you upgrade to seriesx instead of ps5?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ShakeItLikeIDo",
                                            "body": "I only use PlayStation for its exclusives and Xbox for everything else. Thats how I was last gen and thats how I’ll be this gen. Also besides Ragnarock, theres nothing else that is currently out that I want to play on PlayStation",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "-Sniper-Wolf-",
                                    "body": "Not sure why you're being downvoted. If you have a Series X and don't care for PS5 exclusives, why own both?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ShakeItLikeIDo",
                                            "body": "When did I say I don’t care for ps5 exclusives?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "-Sniper-Wolf-",
                                                    "body": "I never said you did? Do you understand what the generic usage of the word \"you\" is or did you really think I was *literally* referring to *you* specifically? Lmao.\n\nThink you missed my point, champ.\n\nEdit: guy responded and blocked me. alright, i'll take that W lol",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "xjupit4r",
                                                            "body": "Bro chill ☠️",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "fuzzy-sushi1444",
                                                            "body": "man, here you are showing some support for a fellow Xbox user and instead of just taking the W he straight up sandbagged you and so you clap back and then you're the one being told to chill lol what even is this community 💀",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fuzzy-sushi1444",
                    "body": "Just wondering, why is this a big deal? Who cares if more users own both?\n\nedit: bro wtf this was a genuine question: Why does it matter if people own BOTH? I'm dead serious. Why is this a fucking big ass deal??? This place seems like it's more of a PlayStation community then an actual Xbox community with these kinds of posts. Someone reply to me and explain, PLEASE lol.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joker28CR",
            "body": "It is an amazing piece of hardware. I love it so much. Quiet af, very aesthetic, black, good OS, quick resume. Play anywhere...",
            "score": 8,
            "replies": []
        },
        {
            "author": "None",
            "body": "I always had a ps5; now I have both too\n\nI still play more on ps5 but my series X is great for backwards compatibility \n\nShout out to assassins creed origins, sooooo much better looking on series X",
            "score": 20,
            "replies": []
        },
        {
            "author": "TheUrbanHobo",
            "body": "I'm a PS5 main but XSX sold me with being able to play my old 360 discs and upgraded the performance and graphics. ",
            "score": 14,
            "replies": [
                {
                    "author": "stealthieone",
                    "body": "Should sell the xsx and get a steam deck. I have all 3 but once I got my steam deck, I barely touch my xbox",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hunter_rq",
            "body": "I got the series x for $350, $383 with tax. \n\nLoving the backwards compatibility",
            "score": 19,
            "replies": [
                {
                    "author": "digitalibex",
                    "body": "I’m waiting for that price again.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Liquidfighter",
                    "body": "You can't forget about the quick resume",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Thedcsport1",
                    "body": "Where did u find it at that price? Hoping for a sale soon",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hunter_rq",
                            "body": "It was back in December, Walmart and amazon had them for $350. It was when lots of articles were saying “Xbox has no games” I think they wanted to being up console sales.\nI think it will happen again later this year",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gottalovethecougs24",
            "body": "MS flight is my fav game when I don’t wanna have to stress about being competitive.",
            "score": 4,
            "replies": [
                {
                    "author": "BitterPackersFan",
                    "body": "Heard it's super fun and relaxing",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MixedMongoose",
            "body": "Quick resume is my most loved feature. It’s unbelievable how great it is being able to quickly switch between games and then reopen them up weeks later. Something I never knew I needed but can’t live without it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "NiceColdPint",
            "body": "I own both. The Xbox controller absolutely feels better than the Dualsense imo.",
            "score": 66,
            "replies": [
                {
                    "author": "Ty20_",
                    "body": "Except for racing games. Dual sense is far superior in that category. I use my dual sense for Forza on my Series X because of that",
                    "score": 8,
                    "replies": [
                        {
                            "author": "OTDH",
                            "body": "Wait, you can do that? :O",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "TheMoonFanatic",
                                    "body": "He’s prolly using a xim or a chronus",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ty20_",
                                    "body": "💯.  $40 adapter let’s you use any controller. I also use a PS3 controller for GTA definitive editions (as it’s the superior option). Also great to use for the entire PS2 & PS1 library on my Xbox",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "puneet95",
                                            "body": "which adapter let's one use any controller on xbox series x?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ty20_",
                                                    "body": "“WingmanXB” is the product. About $43 but worth EVERY penny. It’s amazing",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "For me it’s usually Xbox controller for shooters, Dualsense for pretty much anything else.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ty20_",
                                    "body": "Yeah I still havent adjusted to the triggers for the shooters",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OTDH",
                    "body": "I disagree, it feel cheap and have less features than the dualsense. Even the switch pro controller feel better than xbox controller",
                    "score": 27,
                    "replies": [
                        {
                            "author": "theoristofeverything",
                            "body": "I would like better build quality, but you just can’t beat the ergonomics of the Xbox controller.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "SMRAintBad",
                                    "body": "The offset sticks are my favorite part. I like the PS controllers, but the sticks make my left thumb ache after a while.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Wow_Space",
                                            "body": "As an fps player, I appreciate claw grip for dpad which is possible cause of bottom left thumb stick. Maybe try angleimg your hand different cause none of my thumbs are sore with both thumbs on the thumbs sticks.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SMRAintBad",
                                                    "body": "Thanks, that’s rather helpful knowledge. I ordered a victrix PS5 controller recently with Xbox layout, but I’ll probably try your method in the meantime.\n\nDoes that mean I’m doing reverse claw on Xbox? I use my index to press ‘B’ on Xbox, and my middle finger for bumper and trigger.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Wow_Space",
                                                            "body": "Oh, that's considered claw grip in general. That's essentially the same as claw grip on your left hand which is more practical with the joystick at the bottom",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SMRAintBad",
                                                                    "body": "Huh, neat! Claw grip feels so comfy on my right hand but so odd on the left. Maybe it’s hand dominance or something.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "aeiouabc",
                                    "body": "That exactly it for me. The build quality is bad compared to the PS5 controller, but the ergonomics are way better. Given that, I can understand both sides",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "llama-friends",
                            "body": "The switch pro controller is the most comfortable controller out there.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "GreyRevan51",
                                    "body": "WiiU pro controller was even better imo, it fit sooooo well in the hand and was far lighter \n\nI like the switch pro controller but it starts approaching too bulky status for me",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NiceColdPint",
                            "body": "Oh the features are better, but the feel and shape of the Xbox one just feels more comfortable.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Brellow20",
                            "body": "I think the Dualsense’s features are gimmicky. But it’s also quieter, which definitely feels more premium.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SMRAintBad",
                                    "body": "That’s a great point, one I didn’t think of. I do love the whisper quiet bumpers on the dual sense.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SMRAintBad",
                            "body": "Some people like myself prefer the simplicity of the Xbox controller. Dual sense is really cool, but very gimmicky. Don’t understand the need for so many features. I guess maybe it’s an old-head opinion.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I'm am old head(41) and think the dualsense features are awesome.   Xbox controller is also loud.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "peezytaughtme",
                            "body": "I agree on features - touchpad notwithstanding - but I disagree on quality. Definitely doesn't feel cheaper. As cheap, maybe.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maingon",
                    "body": "Yes it does!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Venerable_dread",
                    "body": "This is the main reason I swapped from PS1 to Xbox back in the day. The Xbox controller ergonomics are just more comfortable. That and I could hack the shit out of the original Xbox 😂. Suck with xboxes ever since just out of preference.\n\nI agree the dualsense is better in terms of tech etc, I just don't like the feel of them.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Toretto65",
                    "body": "I agree",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Josh100_3",
                    "body": "Really? The Xbox controller feels like cheap plastic and it’s so loud and clicky.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RheimsNZ",
                            "body": "The clickiness is a good thing, not a bad thing",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Josh100_3",
                                    "body": "Too noisy, I’m not a fan.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "RheimsNZ",
                                            "body": "It is too loud (although that only matters if you have to be quiet) but the clickiness itself is fantastic",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "segagamer",
                    "body": "I have never liked the DPad on PlayStation controllers. The split hurts my thumb and pressing diagonals is awkward.\n\nThe 360 DPad was awful too mind. It's only since the Xbox One and finally the Series controller that the DPad became the best.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thelingererer",
            "body": "What do you think of the Quick Resume feature?",
            "score": 11,
            "replies": [
                {
                    "author": "Berkzerker314",
                    "body": "Love it. Best new feature by far and I wish I had it on my PC.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "proleart",
                    "body": "Meh.",
                    "score": -22,
                    "replies": [
                        {
                            "author": "Delicious_Cattle3380",
                            "body": "It's literally an insane feature. How can you say meh 😂 you never need to load your game again you can just switch between multiple in an instant.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "austinalexan",
                                    "body": "Because any game that has online features makes it useless and more of a nuisance because you have to close out of the game manually.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Delicious_Cattle3380",
                                            "body": "That is not an issue with quick resume but in how online games have to operate. Knowing this, it isn't a problem.\n\nIt works for offline games 🤷‍♂️ very good functionality",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "austinalexan",
                                                    "body": "Just because it isn’t an issue with quick resume itself doesn’t make it any less annoying.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Delicious_Cattle3380",
                                                            "body": "Don't find it annoying personally, just close it like you would have for any other console. It's such a non issue.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lausee-",
                            "body": "It is probably the greatest feature on any console ever made and you say meh? Lol",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Lol. Not even close",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Lausee-",
                                            "body": "Noted. Thank you for your opinion.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "I meant to extend on that but I had a machine alarming.  To say it's one of the best console features ever I feel it should benefit everyone. As someone who plays at most two games at a time, quick resume isn't a huge deal. As someone who has gamed since atari/nes these console now a days load so fking fast as is, I do believe ps5 is a bit faster then my series x but either way they both smoking, it just quick resume isn't a huge deal to me. As much as i feel it was natural progression I'd say putting a hdd was a much better feature. Maybe not the best but definitely better then quick resume. I feel quick resume is better suited for people who can't settle down on 1 to 2 games at a time.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Lausee-",
                                                            "body": "Even just playing one game, it boots up right where you left off. The fact that it can do multiple games is amazing to me.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "Not to me. Alot of those game end up crashing when you go back to then. MLB did it to me every time.  I just don't feel the same.  I'd roll with the hdd",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lausee-",
                                                                            "body": "Odd. Ive been doing it for 3 years now with no issues.  To each their own I guess.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Thats what I thought. One it's pointless for someone who doesn't bounce around games like a madman. At most im playing between 2 games, one i stream and one im just playing. Plus consoles these days are pretty damn fast.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "proleart",
                                    "body": "I honestly didn't realise how popular a feature it was. I barely notice it. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Me either. Guess I just don't see the point in it really. Games these days load sondamn fast and I don't bounce around.  I guess kudos to those that really enjoy it 🙄",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AramaticFire",
            "body": "I have both systems too and I really like so much of what Xbox does on the hardware and services level. Xbox Studios are just not cranking out interesting games at a fast enough rate despite all these massive acquisitions. Like I’m really hoping Hellblade 2 makes a splash (and that Ninja Theory is allowed to exist afterwards).\n\nMy PS5 is awesome too, I like the controller a lot, and I know what to expect of the games. But it’s a shame the Xbox is lagging behind in mindshare/marketshare.",
            "score": 3,
            "replies": []
        },
        {
            "author": "militaum90",
            "body": "Backwards compatibility and Quick Resume are the best exclusive features of the console, in my opinion. Not to mention it's the most powerful console this gen. Very underrated.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JessicaBri_US",
            "body": "I have had both since release, I personally like the PS5 UI over the Xbox one. But they are both great consoles! 🥰",
            "score": 11,
            "replies": [
                {
                    "author": "Invayder",
                    "body": "Same and I agree.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Randomjibroni",
            "body": "After jumping over to PS5 this year I gotta say that Xbox outshines it in most areas other than a few exclusives.  \n\nThey just marketed everything horribly and Sonys community is strong.",
            "score": 7,
            "replies": [
                {
                    "author": "IndividualAd3140",
                    "body": "I agree, besides the exclusive games, everything over on Xbox feels much better. ",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "blazinjesus84",
            "body": "One big thing ive noticed is games that are locked to 30fps somehow seem to run smoother than on PS5.",
            "score": 10,
            "replies": [
                {
                    "author": "Significant_Trash_14",
                    "body": "Nonsense. There's very little between the two on any game",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Alexmich321",
                            "body": "I have both. My LG OLED has a feature that it shows the bandwidth in real time coming in through the 4k 102HZ HDMI ports. When I compare any game the XBX always slightly shines. my PS5 sometimes hits a max of around 32-33 and the XBX maxes the 2.1 threshold out at around 40 or higher at times. Numbers dont lie man",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Significant_Trash_14",
                                    "body": "Neither does digital foundry or software that does the job better than a gimmick built into tv",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Significant_Trash_14",
                                    "body": "Games LOCKED at 30 FPS are 40fps on your Xbox?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "Idk digitalfoundry themselves have said most multiplatform games  run better on ps5.  Their usually pretty big on Xbox to.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AbbreviationsThis550",
                    "body": "I’ve played on both Series and PS5, I don’t own them but played at a friends house, and a game that ran pretty badly on One, but good on PS4, ran better on Series X than it did on PS5. At least for me, imo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Magni107",
            "body": "Welcome!",
            "score": 6,
            "replies": [
                {
                    "author": "maingon",
                    "body": "Thanks",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "elperro73",
            "body": "The initial speed, compared to what we used to have is AWESOME!!! And it looks BEAUTIFUL!!! ENJOY!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SomeOldDude73",
            "body": "Welcome aboard!",
            "score": 2,
            "replies": []
        },
        {
            "author": "OakyAfterbirth91",
            "body": "Great hardware. It's so quick and silent. I love that it doesn't make a sound. My PS5 is more noisy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unlikely-Places",
            "body": "Now get Elite Controller 2 and that will blow your mind again ;) got mine second hand, it's a game changer",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wanlain",
            "body": "If there were no exclusives I would always go with an Xbox console.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Black_RL",
            "body": "Now get Game Pass!!!!\n\nAmazing deal!",
            "score": 2,
            "replies": []
        },
        {
            "author": "2014RubiX",
            "body": "Congratulations! My humble advice is to pair it with the proper monitor now! I was playing on a Samsung Premiere projector for the longest time but switched over to an LG UltraGear. Now I’m running at max specs! Such a beautiful and easy change to miss! Have fun!",
            "score": 2,
            "replies": []
        },
        {
            "author": "EnoughStatus7632",
            "body": "Back compat was THE CLINCHER for me personally. Gamepass is cool but in the end, the game can go away. I'd you don't buy it. If you have a 360 game on your drive, it'll almost certainly get auto-upscaled.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "This system itself is great, just sucks about the lack of exclusives.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BitterPackersFan",
            "body": "Love my series x",
            "score": 2,
            "replies": []
        },
        {
            "author": "Embarrassed_Simple70",
            "body": "It truly is! Love it",
            "score": 2,
            "replies": []
        },
        {
            "author": "adam19k10",
            "body": "Xbox def rules them all.  Such a better console on every way. Playability is the best experience on a console.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beasthuntz",
            "body": "It's been out for 3 years now and no one knows the actual sales numbers and none of you should care. Play the effing piece of plastic and continue to be happy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "carlctz1978",
            "body": "Yeah I love my series X but Windows and Xbox really screwed up with ditching microphone input on the console when recording gameplay either through the console or even via usb webcam. So at this moment its a hassle to get video tutorials done where you could just plug a mike in and record audio over your game play...\n\nNow the only options you have is to either use a screen capture card with a mike and then a laptop with OBS and do screen capture that way with the mike audio. (in my case my pc in another room so I need to invest in  2x 60 feet HDMI cables and 1x 60 foot Mike cable to make my capture card work)\n\nOR   \n\nA standalone screen capture card with its own screen that you can record on directly and put a mike in that and it will record video from xbox and then audio from your mike.\n\nOR\n\nYou must use the remote play feature and connect to your PC with the xbox pc app and then use the windows Game Bar app to screen record and use the mike input on pc for voice over. ( This is how Windows suggest you do it- kinda defeat the purpose of having a console then if I'm going to sit in front of the pc the whole time) \n\nMAYBE\n\nStream directly to twitch and try to get audio that way but then again Xbox does not support audio from the webcam  and also not even from the 4 official webcams they suggest you use.\n\nGiven all this hassle I still love my Series X",
            "score": 2,
            "replies": []
        },
        {
            "author": "ATR2400",
            "body": "It’s a shame Xbox can’t get its PR in order and can’t pump out more games. Everything else about the system is great. Backwards Compatibility, cloud saves, play anywhere. It’s all awesome. If Xbox actually put in effort into making  games  they’d be more than a worthy competitor for the PlayStation. \n\nXbox beats PlayStation in a lot of areas but fails in the only one that really matters for *game console*. *games*",
            "score": 2,
            "replies": []
        },
        {
            "author": "sm_rollinger",
            "body": "Huge step up from the One I had since like 2015, very nice",
            "score": 3,
            "replies": []
        },
        {
            "author": "FinalOdyssey",
            "body": "Definitely try out Starfield now that the new patch came out this week. But keep in mind they're gonna keep updating til at least the expansion in September. So it might be best to hold off til then, but I played it at launch and absolutely loved it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "zzzpoint",
            "body": "Wait until you realise how useful quick resume is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Genesteen",
            "body": "Try out ori and the blind forest. And willow of wisps. Great Xbox exclusives.",
            "score": 9,
            "replies": [
                {
                    "author": "ActionHank9000",
                    "body": "They’re on the switch, too",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "xDefimate",
            "body": "Welcome friend!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hoylegu",
            "body": "I’m a PS5 fan, but I also love my Series X. \n\nIf only the nicely-sized Xbox controllers were made better and not made out of such cheap plastic and glued together at the last minute by grade school kids heh. \n\nOh, and I need to be able to browse and buy games on my Xbox iPhone app like I can on the PS app.",
            "score": 3,
            "replies": [
                {
                    "author": "Misgendered_Gay",
                    "body": "Can’t you search games from mobile, tell them to download to console, then once you login to the console it’ll prompt you to pay?",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "mustyfiber90",
            "body": "Welcome! I know I’m biased because Xbox is my preferred platform, but I just find the actual hardware miles better than the PS5. Quick resume, FPS boost, controller, being able to download games before you own them, the UI, and hdmi CEC that actually works. Love PS exclusives but there’s so many things with the PS UI that annoy me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cravenous",
            "body": "I have both and feel like the Xbox UI is just…better for some reason",
            "score": 4,
            "replies": [
                {
                    "author": "ChromeGhost76",
                    "body": "I agree. Xbox has always done cloud saves and transfers way better than PlayStation. What’s seamless and streamlined on Xbox seems to take at least one or two more steps on PlayStation.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ty20_",
            "body": "First thing you need to do is never pay monthly for game pass. Buy it in three-year increments and save $500.",
            "score": 2,
            "replies": [
                {
                    "author": "barnesnoblebooks",
                    "body": "Curious how you do this",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ty20_",
                            "body": "It \"should\" still be available. Latest method I think is letting your sub expire. Buy 3yrs of Live (through 3rd party) then buy 1 month of ultimate which it should convert. I would search online to clarify but that was my understanding.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GetAtMe_0_",
                    "body": "And how does one do this?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Howl_Wolfen",
                            "body": "Here to find out too",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Thedcsport1",
                                    "body": "Anyone find out if this still works?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Nice",
            "score": 1,
            "replies": []
        },
        {
            "author": "rocketbunny77",
            "body": "How much you pay for wow",
            "score": 1,
            "replies": []
        },
        {
            "author": "leonryan",
            "body": "It drives me insane that I shut down, plug my controller in to charge, and it restarts the console.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneGlitchyImp",
            "body": "Same it’s so nice and has better feature but sadly no one cares. I don’t even use it anymore. I went back to PlayStation after seeing how badly the ship is sinking. Still have fun on it when I do hop on to play halo from time to time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BugHunt223",
            "body": "Cherish it as msft begins to drop physical media from their premium machine. Last of the Mohicans ",
            "score": 1,
            "replies": [
                {
                    "author": "Rotisseriejedi",
                    "body": "For someone wanting a SX, smart to wait until after the Showcase in case the SX gets a price cut?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sagara-ty02",
            "body": "Pretty good time to jump in with Hellblade 2 about to come out and Avowed, Indiana Jones and more in Game Pass.\nEvery year from now on is looking to have multiple big releases every year now.\nAlso love being able to jump back into some 360 games every now and again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ricardosteve",
            "body": "I got my Series X before the PS5 (the latter due to lack of availability), and I game more on the Xbox than on the PlayStation, which is a first for me. The Quick Resume and Game Pass has been quite a treat when it comes to playing games, and some games run a little better on the Xbox.\n\nIt's just a shame that the Xbox execs seem to make strange decisions and the future of the platform looks to be \"uncertain\" at the moment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Sniper-Wolf-",
            "body": "Series X is criminally underrated. Microsoft fucked up so bad on promoting it and are still paying for their Xbox One sins. Nice to see more people enjoying it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kell_215",
            "body": "I’m not shocked about the ps selling better jus due to the gaming part if you want next gen games, but I love the BC and I feel Xbox future games will be great like hellblade but I’m just waiting to see",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mhben45",
            "body": "This is exactly how I feel about the series x. I really wish Microsoft could figure out their software because the hardware is unbelievable. Anybody telling you the PS5 is quiet have never used a series x. Even at my desk 2 feet from it I just can't hear it at all. I can definitely hear my PS5 in demanding games. When you pick up the series x it immediately feels so premium. The PS5 is a great console but the hardware engineering isn't even close to the series x. My first console was an Xbox and my library is primarily on Xbox but I have started getting new multiplatform games on PS5. I just don't trust Microsoft to turn it around at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slayvantz",
            "body": "I've been on the fence about going back to Xbox from PS5. I originally got it for the exclusives but now they're on PC so game pass seems like a better choice.\n\nAny thoughts or input from OP or switchers that made the jump recently? I'd love to hear your opinions!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "No need for an XSX if you have a decent pc",
            "score": 1,
            "replies": []
        },
        {
            "author": "beaglepooch",
            "body": "I’ve had a lot of value out of my Series X and Ultimate so far. I was always PS before with a light dalliance with a 360 alongside a long time ago. I’m not a starter finisher with games so having the huge choice of ‘free’ games is perfect for me. And since my free BT Broadband subs has now ended I’ve finally learnt how to do the Core to Ultimate switch and managed to get Ultimate at the equivalent of 3.95 a month for the next two years so I’m more thrilled.",
            "score": 1,
            "replies": []
        },
        {
            "author": "turdburgalr",
            "body": "I know this is an old post but, just got a steal of a deal on one tonight and I'm installing all my games now. Fuckin pumped boys!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "It is an awesome console, but it was never going to sell super well and I’m sure ms had to know that. With the huge leg up Sony had on ms last gen it would be really hard to get people to swap back unless Sony screwed up big time. Sony is riding their own coat tails right now tho so let’s see if next gen they drop the ball with greed, as Sony gets complacent and their console continues to sell despite Sony themselves giving no clear sign of direction (no directs and very little communication with their customers) they very well may make another ps3 screw up and allow Xbox to undercut them on price while delivering the same features. I live in my own world tho so who knows.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "It is amazing gamepass is a must and if you get. Lucky i got a 4k 120hrtz tv for Father’s Day last year on sale it’s beautiful welcome to the family",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Juste got one for 300. The only thing I HATE is the internet obligation and the move to destroy physical games. All the other things are pure gold : controller, quick resume, game pass, hardware, extended library with BC, FPS boost.\n\nI don't understand the hate only for 3-4 exclusives games on ps5 - which is a very good piece of gaming rig -  I don't even like. Uncharted = I have tomb raider. Astrobot = I have mario galaxy with developper mode. Spider man = it is  Batman reboot. God of war = I have Witcher 3, lol.\n\nSo so happy, my first console since the xbox 360 :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "JKrow75",
            "body": "Sold my PS5 after a half a year or so. Idk why I even bought it in the first place, but never again. The controllers are miniature and I’ve never really dug the symmetric sticks. \n\nSeries X is just setting up the next level, and I’m 100% okay with that. \n\nXbox always FTW, If only for GamePass and the awesomely configured controllers, also backwards compatibility, exclusives and well, I guess all of it 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "miojo",
            "body": "It’s not selling because you need games to play on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "crazydiavolo",
            "body": "Yeah, the hardware was really well done this time. A shame it's not doing even, makes me kinda \"nervous\" that they might go \"lazy\" next time.\n\nIf they maintain or improve the quality I'll probably be back next time, despite everything goin' on within the department.",
            "score": -1,
            "replies": [
                {
                    "author": "ChocolateRL6969",
                    "body": "Lazier - Xbox has been fucking horizontal for years and continue to be.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "crazydiavolo",
                            "body": "My god. You guys are so emotional over a box.\n\nI said lazy in the sense from them not putting effort to make the hardware great, as they got screwed this gen in sales. So they can just go \"whatever\", since MS has been confused and changing plans over night to day lately.\n\nDoesn't matter if its vertical or horizontal, they could just underpower the shit out of it just cause they feel like they ain't getting enough money. \n\nLol.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Lausee-",
                                    "body": "Rumor has it they might go hybrid console/PC with windows and add gamestores like steam on it.\n\nSpeculated by Digital Foundry.\n\nSarah Bond also stated that it is going to be the largest technological leap in generational history.\n\nThat leaves me to believe that it will be a hybrid",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "3kpk3",
            "body": "SX and SS sold pretty well this gen though not as much as PS5.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MileHighRC",
            "body": "Cross platform saving is incredible, and fuck Playstation for locking it behind a paywall.\n\nHave xsx in theater room and Xbox one in living room. Can seamlessly swap back and forth playing games and it's amazing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SamuraiNeutron",
            "body": "I give it two weeks before the honeymoon phase is done",
            "score": -2,
            "replies": [
                {
                    "author": "Manduck",
                    "body": "Lol yeah, I have both a ps5 and an xsx. To me the ps5 has better games and a better interface. The ps5 controllers are also a generation ahead of the xbox. Plus my xbox would regularly loose connection with the controller and need rebinding. This is a common issue with the xbox",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DaRealShady",
                            "body": "For real? I never, ever had my controller disconnect (from my series S)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Microsoft can't create quality exclusive games. PS5 has the better game selection",
            "score": -2,
            "replies": [
                {
                    "author": "Lausee-",
                    "body": "Opinion noted.\n\nNone of the PS5 exclusives had made me upgrade my PS4 pro yet.\n\nHaven't put my XsX down since I bought it a couple years ago.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Cool. I have both too. I play more single player games on PS5. I play shitty warzone on Xbox because I like the controller and that's where my friends play. PS5 objectively has better exclusives lmao not even a debate",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Lausee-",
                                    "body": "None of the PS5 exclusives are worth buying the new system for in my opinion.  I wouldn't play any of them.\n\nJust because you use the word objectively doesn't mean you're correct. Your opinion is always subjective.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Ok. Well I do. You can enjoy starfield and red fall, brotha",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lausee-",
                                                    "body": "I'm currently playing Starfield with the new update. 60fps and survival elements on Xbox. Game changer, made a good game great.\n\nAlso Palworld is a phenomenal game. \n\nHellblade is relasing very soon. \n\nAvowed, Stalker 2, Indiana Jones are coming later this year.\n\nPlus many more coming after that. It a good time to be a gamer.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Connoisseur8771",
            "body": "The Xbox controller is pathetic compared to Dualsense",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "The hardware is there but not the games. Xbox team like 🤪",
            "score": -2,
            "replies": []
        },
        {
            "author": "SqueezyCheez85",
            "body": "I love the styling of the Series X way more than the PS5, but if we're being honest, it just doesn't compete with the software selection.",
            "score": -2,
            "replies": []
        },
        {
            "author": "KiroW01F2",
            "body": "What’s better a series x or s?",
            "score": -3,
            "replies": [
                {
                    "author": "LocmonstR",
                    "body": "Series X",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Chezky6",
                    "body": "how much money are you willing to spend and you have your answer",
                    "score": 7,
                    "replies": [
                        {
                            "author": "KiroW01F2",
                            "body": "I don’t much know the differencw",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Logical_Stage_3387",
            "body": "Mozeltof",
            "score": 0,
            "replies": []
        },
        {
            "author": "gigibi89",
            "body": "Just moved from series S to series X..man this thing Is a Beast!",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "So tell us all how it’s so much better",
            "score": -8,
            "replies": []
        },
        {
            "author": "Dtoodlez",
            "body": "It’s nice but just can’t support Microsoft any more.",
            "score": -4,
            "replies": []
        },
        {
            "author": "matt-404",
            "body": "Be super careful with the hdmi port. I have two series x because my first one had the port sheer off of the circuit board. I bought a second one, then found someone who could fix the first one later. I won’t even move the Xbox now for dusting or anything with iut first unplugging it. The guy that fixed it said it’s super common. Bad design.",
            "score": -1,
            "replies": []
        },
        {
            "author": "New_Task9484",
            "body": "I rather play nintendo switch  exclusive  got a ps5 and xbox x",
            "score": -10,
            "replies": []
        }
    ]
}