{
    "title": "Dredge is now Play Anywhere for anyone who has a PC/ROG Ally",
    "author": "MRHipshot",
    "subreddit": "XboxSeriesX",
    "rank": 17,
    "score": 168,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/XboxSeriesX/comments/1cvhlua/dredge_is_now_play_anywhere_for_anyone_who_has_a/",
    "id": "1cvhlua",
    "selftext": "Just checked my PC library and Dredge showed up as installable. Previously it was only Console.\n\nNo 2nd purchase required to install on PC. God I love Play Anywhere.\n\nI’m not saying it’s coming to Game Pass immediately but this is usually a step that games have to do to meet the GP requirement. Having a Windows version. So maybe sometime in the near future.\n\nCheck the link for a review.\nDredge is a beautiful and relaxing indie horror fishing game where you’re a boat\n\nAlso shout out to Legion Go.\n\nhttps://xboxera.com/2024/05/19/dredge-is-now-play-anywhere-on-xbox-game-pass/",
    "comments": [
        {
            "author": "None",
            "body": "dredge was one of the best games I played last year; its modest appearance hides one heck of a great game",
            "score": 23,
            "replies": []
        },
        {
            "author": "Lupinthrope",
            "body": "Still want that Xbox handheld",
            "score": 14,
            "replies": [
                {
                    "author": "Roklobster1",
                    "body": "Thats what your phone is.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "God forbid people want dedicated devices.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Roklobster1",
                                    "body": "That's what your phone is.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "My phone is not a dedicated gaming device.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Roklobster1",
                                                    "body": "That's what your phone is",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "handsomejack11",
            "body": "It will be coming to GP because I just bought it.",
            "score": 14,
            "replies": [
                {
                    "author": "MRHipshot",
                    "body": "Thank you for your service haha",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "segagamer",
            "body": "Whenever there's a Dev AMA I always ask the question and encourage its support. I have a Legion Go and so games being PlayAnywhere get prioritised since I can finish them quicker on my commutes to/from work and lunch break.\n\nYes I know cloud streaming is a thing, but it's always annoying to set up with the office firewalls, and nothing beats native.\n\nWell, I'll be asking for PlayAnywhere until a portable Xbox of some form happens lol. Would love to go through my 360 backlog this way.",
            "score": 14,
            "replies": [
                {
                    "author": "Existing365Chocolate",
                    "body": "Dredge won an award earlier in the year for some kind of best of streaming games",
                    "score": 1,
                    "replies": [
                        {
                            "author": "segagamer",
                            "body": "OK?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shinikahn",
            "body": "What a great game",
            "score": 13,
            "replies": []
        },
        {
            "author": "mancastronaut",
            "body": "Play Anywhere doesn't get anything like the credit it deserves. While Sony forces people to double dip (or wait) and gets all the praise, Microsoft out here doing the right thing...",
            "score": 5,
            "replies": []
        },
        {
            "author": "LukeAriel",
            "body": "That's actually all I need to push me over the edge. Play anywhere is criminally underrated in the age of pc handhelds",
            "score": 5,
            "replies": []
        },
        {
            "author": "nikolapc",
            "body": "Nice, I may buy it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beasthuntz",
            "body": "I play anywhere in my house on the ROG Ally due to its magnificent remote play abilities. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "adastro66",
            "body": "Any replay value to this game?",
            "score": 2,
            "replies": [
                {
                    "author": "Bogonauta",
                    "body": "I'm still very early in the game, but I think there are three different endings.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "shinikahn",
                            "body": "You decide the ending in the final half hour so licking one doesn't change playtime very much. But you can get dozens of hours of gameplay if you want to get everything done.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Existing365Chocolate",
                            "body": "There’s two endings",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shinikahn",
                    "body": "If you are a completionist, you can play this game for dozens of hours trying to get every fish every variation and completing every quest",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Existing365Chocolate",
                    "body": "It’s a blast to 100% with an expansion DLC campaign coming this year",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KileyCW",
            "body": "Awesome ty",
            "score": 2,
            "replies": []
        },
        {
            "author": "Able_Contribution407",
            "body": "That's awesome! Thanks for the heads-up. I'll install it on my Ally.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anchelspain",
            "body": "Games don't have to be Xbox Play Anywhere to be on Game Pass though. Quite a lot of them don't. Tomb Raider ans Rise of the Tomb Raider for example aren't (but Shadow of the Tomb Raider is).\nFallout 4 isn't either, nor does it have cross-save.\nOr the first Hellblade, or any Ubisoft or EA game at all.\nWhich is annoying because I always have to decide on which platform I wanna play some of those games: ROG Ally? Or on my Xbox console? Can't start in one and continue on the other.\n\nReally wish Microsoft would put more incentives for developers to integrate this, or at the very least to do just the cross-save part like some games do.",
            "score": 0,
            "replies": [
                {
                    "author": "strangerinhere88",
                    "body": "All the games you listed were out before game pass was a thing",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Anchelspain",
                            "body": "Assassin's Creed Odyssey and Valhalla, Jedi Survivor, , Far Cry 6, Immortals of Aveum, Chants of Sennaat which just released... there are plenty of new games that are not Xbox Play Anywhere and released well after Game Pass and the Play Anywhere initiative were a thing.\nAt least the recent Ubisoft ones have cross-save, but almost no EA games have that.\n\nMy point is that it's super inconsistent. Take Final Fantasy for example. Of all the FF games that went through Game Pass, only FF9 is Xbox Play Anywhere. And 15 supports cross-save. The rest each have a separate PC and Xbox purchase, and don't have any kind of cross-save support. It's just strange that 9 would have it, but 7, 8, 10, 12 and 13 don't, despite all of them receiving Xbox achievements when they arrived on Game Pass.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Roklobster1",
                                    "body": "Ok?",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MRHipshot",
                    "body": "Oh no I know.. it’s odd for them to add it so late and after the fact. It’s either at launch or around the time of a game being added to GP.\nLike Resident Evil 2 suddenly got an Xbox PC version so it could be play anywhere.\n\nBut yeah recent an example of Play Anywhere with no GP (yet) is Like a Dragon Infinite Wealth. I bet maybe a year from now it might be in GP",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Anchelspain",
                            "body": "I'm hoping that with the rising popularity of PC gaming handhelds, and Phil Spencer having publicly talked about how it's not so great that not all games share saves with Xbox or they may have to be purchased again, Microsoft will make a bigger push to get more publishers onboard with this.\n\nSo perhaps what we're seeing is part of that: pushing even older games to receive the treatment.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}