{
    "title": "Neptunia: Sisters VS Sisters",
    "author": "None",
    "subreddit": "XboxSeriesX",
    "rank": 13,
    "score": 38,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 9,
    "url": "https://ifi.games/neptunia-sisters/",
    "id": "1cw31h9",
    "selftext": "Neptunia: sister vs sister is coming out this Tuesday, May 21. \n\nIf you guys want more Neptunia games besides this one and neptunia game maker revolution. Buy this . I surprised this has advertisement for it. \n\nDo your part!! I'm doing my part! ",
    "comments": [
        {
            "author": "Dago22",
            "body": "Already preordered.\n\nWaiting for the Amazon listing for Neptunia Game Maker R:Evolution to preorder it as well.",
            "score": 8,
            "replies": [
                {
                    "author": "None",
                    "body": "Nice, let's go\n\nSo excited 😊",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "MRHipshot",
            "body": "I might make a post on release day. I know Hellblade 2 is gonna get most of the attention but this is some good counter programming haha.\nI pre installed it with the Xbox mobile app and it’s like 12GB. I’ll be playing it day 1!\nBtw it’s Play Anywhere for anyone who has a PC or ROG Ally for anyone who gets it digitally.\nI do want a physical version at some point just to have it though haha",
            "score": 7,
            "replies": [
                {
                    "author": "DraketheKidd",
                    "body": "Definitely do make a post if you remember! I’d love to get the full rebirth trilogy on Xbox",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheTerenity",
            "body": "I bought it despite having it on PS5. \nI’m all for continuing support for JRPGs on the platform.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheMuff1nMon",
            "body": "My brother loves this series but has them all on PS or PC already",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zeo560",
            "body": "I am for sure buying this but I probably have to wait until next week to pick it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wooden_Echidna1234",
            "body": "Is preorder a digital code emailed to you? Couldn't find it on the site.",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "It should, f5 or reload your email, it does take a few minutes to show up",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}