{
    "title": "Why Headphones Are So Important For #SenuasSaga Hellblade II according to Ninja Theory Audio Director David Garcia\n\n",
    "author": "JP76",
    "subreddit": "XboxSeriesX",
    "rank": 8,
    "score": 173,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 91,
    "url": "https://youtube.com/shorts/nTek6v64bG4",
    "id": "1cw76ub",
    "selftext": "Use headphones when watching.",
    "comments": [
        {
            "author": "Significant-Age5052",
            "body": "Charged up my starfield headphones for this",
            "score": 21,
            "replies": [
                {
                    "author": "BrokenNock",
                    "body": "Same!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Benti86",
            "body": "I still remember being like \"okay how crazy can this binaural audio be?\" When I played the first game.\n\n\nAnd then the start of the game made me think my speakers weren't plugged in right because it actually was so well done lol.",
            "score": 17,
            "replies": []
        },
        {
            "author": "giulianosse",
            "body": "Playing Hellblade 1 with a surround system still ranks as some of the best audio experiences I've ever had in a videogame. At least twice I subconsciously turned to face something that wasn't there.",
            "score": 66,
            "replies": [
                {
                    "author": "PurpsMaSquirt",
                    "body": "As someone with a 5.1 system and headphones… my Hellblade experience drastically changed when I started using headphones. Surround sound is great but dude the binaural voices are unbeatable with headphones. Please try it if you haven’t already.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "maybeidontknowwhy",
                            "body": "If using headphones that support Dolby Atmos, should I turn that off?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Hehehelelele159",
                                    "body": "Doesn’t the Xbox have an option to output Dolby atoms audio?",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "moreexclamationmarks",
                            "body": "I tried both with the first, I'd rather sit comfortably without anything on my head and still have voices from around me. I don't need it right at my ears. \n\nI think the issue is from what it sounds they didn't try to make a proper surround mix anyway with object-based audio, they just focused on the binaural.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "OSUfan88",
                                    "body": "I've done it both, and it's just SOOOO much better with headphones, even when compared to a really high end sound system.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "pookishanta",
                                    "body": "You're talking about the first one? I didn't hear voices from surround speakers, only environmental stuff. I thought something was wrong with my setup till I looked it up online",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OSUfan88",
                    "body": "I have a $30k+ 7.2.2 sound system, and I can honestly say that they don't even come *close* to the experience of playing this game with a decent quality headset. It truly makes that big of a difference.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Necessary_Basil4251",
                    "body": "Happened to me on Saturday ! Still early in the game doing puzzles and I leaned to see a corpse on an altar as she was just talking and they way it fuckin timed the phrase ( ... something looking at you .. ) got me jump and remove my headsets because it was PERFECT!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "segagamer",
            "body": "They always compare it to people who listen through a TV.\n\nNever from people who have a 5.1",
            "score": 44,
            "replies": [
                {
                    "author": "VITOCHAN",
                    "body": "No Surround sound system will get the sounds of voices 'inside' your head the way binaural audio with headphones does.      Sure, it will sound great in 5.1, and better with 7.1.  But it will sound fucking magical and be an audiophile experience with headphones.",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "JP76",
                    "body": "It's just not the same. There's a whole research field around this subject especially now that binaural audio is the basis for spatial sound in VR. Microsoft did a ton of research with HRTF (head related transfer functions) when they designed HoloLens and that research also benefited Xbox and Windows.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "AstralDoomer",
                            "body": "Are you suggesting that headphones will offer a superior experience when compared to 5.1 HT?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Spokker",
                                    "body": "Yes. People don't listen to ASMR on 5.1 theater systems. They listen on regular ass stereo headphones. That's what this is. Binaural audio.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "moreexclamationmarks",
                                            "body": "ASMR is terrible anyway, I can't wait for that fad to fade. People try to inject it into everything.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Strider-SnG",
                                    "body": "In this specific situation (binaural audio) it’s likely that they would.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "cashy57",
                                    "body": "Binaural audio has the benefit of being able to put totally different sound in each of your ears, completely isolated from one another. This is not possible without headphones. The game was designed with this specifically in mind. That said, I’ve quite enjoyed what I’ve played on my Sonos Arc sub and surrounds setup.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Imthecoolestdudeever",
                                    "body": "Massively different. Check out videos on binaural vs Dolby Atmos. \n\nBinaural is much wider and more \"open\", whereas stereo l, and even the more advanced Dolby Atmos, is much more short, closed in, and much less \"alive\" feeling.\n\nIt's pretty wild actually.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "OSUfan88",
                                    "body": "ABSOLUTELY. Not even remotely close.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "OGRedd",
                                    "body": "its emulating the chick being crazy, voices in her head. So for this game it is.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sQueezedhe",
                            "body": "Should have made a good Halo instead.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OSUfan88",
                    "body": "As a person with a $30k 7.2.2 surround sound system... surround sound doesn't come anywhere close to this came with a good set of headphones. Headphones are basically a requirement to truly experience this game.\n\nThe jump from headphones to a $30k surround sound system is greater than the jump from a $30k surround sound system to TV speakers. It's *that* big of a difference.\n\nSurround sound speakers will make it sound like the voices are coming from your left or right.\n\nHeadphones will make it sound like the voices are coming from *inside you*. Like they're *your* thoughts.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "segagamer",
                            "body": "I've played the first game with the official set of Xbox headphones (not the wireless ones) and I just don't feel that way compared to my £150 Pioneer Xbox 360 5.1 Surround Sound, sorry. Maybe it has to do with speaker placement.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TonyCartmanSoprano",
                                    "body": "but dude he has $30,000 speakers. didnt you hear him? 30K!! so unless you have a $31k speaker your opinion is invalid sorry",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shity_Balls",
                    "body": "I’ve got a 5.2.4 setup, with mostly ideal speaker placement, room treatments, room correction, etc. I also have A50s, and there’s not much difference. The only thing is when I’m playing a shooter and there’s sound below me, I can tell better with the A50s vs my Home Theater setup. \n\nWhich makes sense because headphones can create a sphere of sound all around you, and HT setups are limited to just the top half of the sphere more or less. Does that really matter though? Not to me unless you’re playing a competitive shooter, because nobody else mixes sound from coming directly below you, and you don’t really need to to be honest.\n\nEverything else sounds 1000 % better through my HT vs the A50s, much more clarity and quality. I prefer to use my HT over my A50s as it’s much more realistic sounding as well, even though the soundscape is ever so slightly limited. \n\nI’ve never had the experience of sound coming from behind me or over head and legitimately tricking my brain that something was actually there with my A50s or headphones for that matter. I have had that experience with my HT setup many times. Sometimes if someone walks through a door behind me in a movie, or talks unprompted, it’ll cause my wife to jump because she thought it was real.  \n\nThe biggest thing I think besides speaker sound quality, is the low end frequencies being much more robust, and a subwoofer for any tactile response. Through the headphones once you compare, the low end is significantly limited. Below 150-120Hz, it’s barely present. Your ears can hear it and it sounds…flaccid? The lack of your whole body feeling the 60Hz kick and below is also a big piece as well. It’s just not even close when you hear an explosion, vs hearing AND feeling it. The last thing for me is also feeling headphones on my head, is truly a very unconvincing experience, IF you’ve experienced both. \n\nBefore my HT, my A50s were great. Now, eh, They’re just ok.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Drunk_Securityguard",
                            "body": "headphones + a bass transducer so i can still \"feel\" the low end.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Shity_Balls",
                                    "body": "Bass shakers are nice for sure, in HT they are used to accentuate the sub 20 Hz frequencies for extreme tactile bass. However, unless you are pressurizing your room with a subwoofer, you are in fact missing out on the “feel”. The punch you get in your chest cannot be replaced, unfortunately.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ZeroedCool",
                    "body": "Ok and?  That's the audience for the message.   You freakin' /r/audiophiles will already have chosen your preferred method.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WolverinesThyroid",
            "body": "I've got to figure out how to hook up 2 sets of headphones to my xbox and not lose atmos sound.",
            "score": 3,
            "replies": [
                {
                    "author": "Sh4rpSp00n",
                    "body": "Does using 2 controllers with headsets connected not just work? (I genuinely don't know)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "moreexclamationmarks",
                    "body": "Binaural wouldn't need Atmos. \n\nIn a way if you have Atmos for  headphones and they're 2-channel, then both are essentially trying to do the same thing, which is mimic surround with only 2-channels.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "swartzkw",
                    "body": "My girlfriend and I use two controllers with headphones for Atmos. Sometimes one of them needs to be plugged in but for the most part it works great!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mrexcitment",
            "body": "I wanna play this game, but deaf on one side, should I just play with mono sound?",
            "score": 2,
            "replies": []
        },
        {
            "author": "According-Page3047",
            "body": "If you own an actual surround sound system you don't need headphones for this",
            "score": 2,
            "replies": []
        },
        {
            "author": "Golden-Event-Horizon",
            "body": "My a50's are charged and ready",
            "score": 7,
            "replies": []
        },
        {
            "author": "Eejay39",
            "body": "So is he talking about 'in ear' buds, or over ear cushioned ones? Is there a difference?\n\n\nI have the official xbox wireless headset, so wondering if that would be enough.",
            "score": 4,
            "replies": [
                {
                    "author": "Spokker",
                    "body": "The effect will be noticeable no matter what headphones you use. Better headphones will make it sound better, of course, but you don't need to go crazy.\n\nTake whatever headphones you have and go listen to binaural audio on YouTube to test it.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Eejay39",
                            "body": "Thanks, I  just wondered because before I got those, I had a cheap pair of wired, in ear headphones that I played RE2 Remake, and was really impressed with the binaural effect there.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "famewithmedals",
                                    "body": "Same thing, I was impressed with my wired Skullcandy earbuds for RE2 but I got the official Xbox wireless headset for this and it’s absolutely incredible.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "someguyfromtheuk",
                    "body": "The best effect will be through in-ear headphones since the audio was recorded using in-ear microphones.\n\nIn-ear headphones will replicate the original audio environment naturally.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmajorjr",
            "body": "I’m so ready!\n\n[https://imgur.com/a/RwZ7KPr](https://imgur.com/a/RwZ7KPr)",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "famewithmedals",
                    "body": "I thought they were so cool in the first game but last night I had to end my session early because of them, they were driving me actually insane lol.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DieHardCubFN",
            "body": "Audeze Maxwells with HB 2 are just incredible.  Sounds are so crisp and make a great surround experience.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheCookieButter",
            "body": "I'm using open headphones + 5.1 speakers (in stereo) so I can still get my subwoofer involved.\n\nIt's a shame how poorly mixed it felt for surround sound.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nhbonline",
            "body": "I have both audio apps on xbox, so does it might have a negative effect if I use them with hellblade 2? Should I switch to stereo in xbox settings?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jofrie",
            "body": "I think headphones and surround speakers have both advantages and disadvantages. \nI compared both today (respect to person who stated that company probly expect people use soundbar or TV speakers) I think so to.\n\nThe voices are only left and right (front)\n\nMight the vocals be shifting on rear (behind speakers) some vocals \nSpeakers would be clear winner.\nBut it's so immersive on speakers maby better they only did front stereo. \n\nBut in cave with all rain drops. Speakers win.\n\nThey should add this game should be played twice \nOn headphones \nAnd on surround speakers",
            "score": 1,
            "replies": []
        },
        {
            "author": "soopjung",
            "body": "Playing with Hifiman Susvara, $6000 planar magnetic headphones.  \nMagic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "If the comments lead me in the direction I think, I'm super excited to play the sequel especially if they continued with the spatial audio. Yessssssssss. I loved the first game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slasaru",
            "body": "As I remember from Hellblade 1, they had pretty much reverb / delay on the voices. Now in Hellblade 2 the voices are just flat. That steals some of the atmosphere",
            "score": 1,
            "replies": []
        },
        {
            "author": "Papapain",
            "body": "I am desperate to find a good headset. I want wired through USB so I can get that seductive surround sound. Wireless is just a constant thorn in my side. And everything seems  to lose surround if it goes into the 3.5 jack.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pharsti01",
            "body": "I think I haven't played a game without headphones for years. They're pretty much mandatory for every game as far as I'm concerned.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwdownvote",
            "body": "Open ear headphones + speakers, simultaneously, with a bass shaker.\n\n*That’s* how you play this game.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeafEgo",
            "body": "I got a weird bug where my Xbox turns off every 15mins when I have a 3mm jack plugged in my controller. 😔 I'm playing Hellblade 2 in mono sound because I can't hear the voices in stereo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "door_of_doom",
                    "body": "Just to be clear, that isn't necessary. Binaural audio will come through just fine with just a regular pair of headphones without any additional special setup. The magic is all in how it is recorded, and the effect comes through on stereo headphones.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Spokker",
                    "body": "Binaural sound uses two simple stereo channels. You can hear binaural sound right now by listening to demos on YouTube or playing practically any ASMR video.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Imthecoolestdudeever",
                    "body": "No. You don't need to.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blakejohann",
            "body": "I call BS on this whole 'best on headphones' argument and surround sound being incapable of providing the same level of experience as binaural. I think that anyone parroting this information here has never experienced a good atmos/dtsx mix on a 7.2.4 system (5.1.4 too probably but i have never tried that configuration). my reasoning:\n\n  \n1. ambiance is better with a whole room system than headphones because they can recreate an acoustic space in a way that is impossible with speakers so close to your head. with a good atmos mix, when you are in a cave it feels like you are in a cave, when you are in a cathedral it feels like you are in a cathedral, etc. it is able to mimic sounds bouncing off of walls and coming back to you and every sound feels like it is present in your space.\n\n2. bass is better with a whole room system\n\n3.dynamic range is better with a whole room system. you can have some stuff really loud occasionally where this is limited in headphones to protect your ears.\n\n4. no headphones is more comfortable than headphones.\n\n5. discrete sound channels are always cleaner than matrixes sound channels.\n\n6. in a properly calibrated system sounds can sound like thy are coming from insides of your head. in fact sounds can be mapped to feel like they are coming from any exact spot in the sound field.\n\n7. a lot of people do not experience binaural sound when using headphones because of the shape of their ears or how their brains work. \n\n  \nnow - I'm not saying that them putting all this effort into a binaural mix is a bad thing. the number of people with good home theater atmos setups make up a tiny portion of the user base, so having the experience available with headphones, and advertising that people should use headphones to play is great.  But not also mapping to spatial systems is disappointing. maybe its a budget issue, or a stubbornness issue, i dont know, but hiding behind the 'it has to be experienced with headphones because it cant sound as good otherwise' argument is just super lame. Really having a first party game using its own spatial engine instead of using the system level one is also super lame. if its so good and relutionary then why hasnt it replaced the system level one so it can work with all games? Look at playstation's tempest engine. when it first launched with the ps5 it was a headphones only binaural solution. a few years later, when sony finally introduced atmos combatibility, they made it all run through the tempest engine and then mapped it to atmos on output. this made it so that every game to date that supported tempest instantly supported atmos.  \n\nthis is a flagship first party title they have been advertising for years. they should have coded atmos properly and they should be saying 'for best experience use headphones or a properly calibrated home theater system with a minimum discrete 5.1.4 speaker setup. '\n\nI was so certain atmos would be an option that I was completely flabbergasted when it wasn't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "what games nowadays isn't Important wearing headphones?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LostSoulNo1981",
            "body": "Using headphones, wouldn’t you need the Dolby or DTS app for headphones?",
            "score": -1,
            "replies": [
                {
                    "author": "JP76",
                    "body": "I don't think you do. First Hellblade had its own implementation of headphone spatial audio on console before Atmos or DTS:X was available on consoles.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "LostSoulNo1981",
                            "body": "Thanks!\nI’ll have a look as I have the first game.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "moreexclamationmarks",
                    "body": "Binaural is based on only 2-channels anyway. And it is not object-based audio so Atmos/DTSX wouldn't be relevant.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Spokker",
                    "body": "No. Plug any headphones into the controller. That will be the simplest way to hear the binaural audio.\n\nHere's a classic binaural audio demo from almost 20 years ago. I'm listening to it on a pair of $20 earbuds on my phone. \n\nhttps://youtu.be/IUDTlvagjJA\n\nThis is the technique the game is using.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LostSoulNo1981",
                            "body": "I gave it a go with the wired Xbox stereo headphones I have and it wasn’t what I was expecting.\n\nI thought it was meant to be more spacious sounding, but it just has the voices coming out of different sides like standard stereo.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Imthecoolestdudeever",
                    "body": "Not at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dr__panda",
            "body": "I’m probably just going to listen to daft punk the entire time",
            "score": -26,
            "replies": [
                {
                    "author": "BECondensateSnake",
                    "body": "I can understand listening to music while playing something like devil may cry or doom or killing floor but Hellblade? Nah dude you're losing so much immersion.\n\nYou're free to do that though",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "supa14x",
                    "body": "Why? There’s no point to playing a game like Hellblade then",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Dr__panda",
                            "body": "Because I can?",
                            "score": -28,
                            "replies": [
                                {
                                    "author": "Ouch_i_fell_down",
                                    "body": "And you can have your HDMI input switched over to your cable box while playing Katamari Damacy. Whether or not you can do something has no impact on how stupid it is to do it. I **can** clean my toilet bowl with my tongue. Doesn't make it a good idea.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "subsignalparadigm",
                    "body": "Very very edgy dude. You do you, as boring as that sounds.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MoonNStar51",
                    "body": "Love this guy, upvote him.",
                    "score": -21,
                    "replies": []
                }
            ]
        },
        {
            "author": "TopHalfGaming",
            "body": "I'd say Last of Us 2 is the bar for sound this generation, but excited for this too.",
            "score": -45,
            "replies": [
                {
                    "author": "turkoman_",
                    "body": "Nope, it is Gears 5 with Dolby Atmos by far. There is a hall in the DLC two speakers broadcasting music, my wife was able to aim that speakers in a blind test with headphones. Gears 5’s 3D sound is super accurate.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "TopHalfGaming",
                            "body": "By this generation I mean console generation. Gears 5 was still One X era.",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "cremvursti",
                                    "body": "Last of us 2 was a PS4 game as well",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "DOUBLEBARRELASSFUCK",
                                            "body": "I love when someone just digs themselves a deeper and deeper hole while someone stands outside the hole beating them with a shovel.",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TopHalfGaming",
            "body": "Sheeeit, yeah, 6 months before the consoles. This is where I say I'm playing the PS5 update and you say it has a Series X update. \n\nStill better sound.",
            "score": -45,
            "replies": [
                {
                    "author": "rchelgrennn",
                    "body": "Your message is honestly incomprehensible",
                    "score": 27,
                    "replies": [
                        {
                            "author": "TopHalfGaming",
                            "body": "Not really.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "KesMonkey",
                                    "body": "It really is. \n\nI haven't a fucking clue what you tried (and failed) to convey with that comment.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "TopHalfGaming",
                                            "body": "TLOU dropped in June before the new consoles. I'm currently playing part 2 which got a PS5 update. I played Gears on release before the Series X update. Still, I don't see how if you've played both that Gears 5 has a more effective use of sound. They can both be incredible, just pointed it out since I'm playing it right now. \n\nDefinitely gave enough contextual information, but whatever.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "Joshimitsu91",
                                                    "body": "Because you're not replying to your previous comment chain, so your top level comment just makes no sense without the context. And you seem to be assuming everyone who replies to you is the same person?",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "Ouch_i_fell_down",
                                                            "body": "Everyone who replies to me is the same person, and man are you a hypocrite and always moving the goalposts",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "blueowl47",
                                    "body": "I think you wanted to reply to a previous comment and that’s why they didn’t understand.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "TopHalfGaming",
                                            "body": "Ah, apparently. I was just trying to neutralize with that comment too since my general argument was a mistake. Done posting after midnight lol.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}