{
    "title": "Some people believe we never landed on the moon. When it was clear Spain had arrived to unknown land (the Americas), was there anyone doubting their clams as a conspiracy theorist would today?",
    "author": "PaTirar2023",
    "subreddit": "AskHistorians",
    "rank": 18,
    "score": 835,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/AskHistorians/comments/1jdk2wx/some_people_believe_we_never_landed_on_the_moon/",
    "id": "1jdk2wx",
    "selftext": "I don't mean people doubting their claims based on, for example, thinking they had actually arrived to another place. I mean full on conspiracy like today. For example, thinking Castile is claiming that in order to gain power or whatever",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/AskHistorians. **Please [Read Our Rules](https://www.reddit.com/r/AskHistorians/wiki/rules) before you comment in this community**. Understand that [rule breaking comments get removed](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/).\n\n#Please consider **[Clicking Here for RemindMeBot](https://old.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps://www.reddit.com/r/AskHistorians/comments/1jdk2wx/some_people_believe_we_never_landed_on_the_moon/%5D%0A%0ARemindMe!%202%20days)** as it takes time for an answer to be written. Additionally, for weekly content summaries, **[Click Here to Subscribe to our Weekly Roundup](https://old.reddit.com/message/compose/?to=AHMessengerBot&subject=Subscribe&message=!subscribe)**.\n\nWe thank you for your interest in this *question*, and your patience in waiting for an in-depth and comprehensive answer to show up. In addition to the Weekly Roundup and RemindMeBot, consider [using our Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/). In the meantime our [Bluesky](https://bsky.app/profile/askhistorians.bsky.social), and [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) feature excellent content that has already been written!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "henryroo",
            "body": "While you wait for a specific answer to your question, this older answer from /u/terminus-trantor might be of some interest. Reading through that and the previous answer it links to, it sounds like we might not have many good primary sources for how ordinary people viewed the discovery of the Americas: https://old.reddit.com/r/AskHistorians/comments/bkh2uj/how_quickly_did_news_of_the_discovery_of_the_new/emh13y7/\n\nThe only specific reference to skepticism in there is this quote they shared from the official History of the Ming Dynasty:\n\n>During the Wanli Reign, a man of that country, called Li Madou (Matteo Ricci), came to the Capital. He presented a map of the world, stating that there are five continents... . His narration appears strange and indistinct, and can-not be checked. But since a man of that country came all the way to China, we should not deny its importance",
            "score": 304,
            "replies": [
                {
                    "author": "jtobin22",
                    "body": "Building on your Chinese source, Matthew Mosca’s *From Frontier Policy to Foreign Policy* is a really good review of how the Qing empire dealt with European maps and the claims they made. A couple key points:\n- knowledge is not just absorbing info, it’s about judging the relative reliability of different systems of knowledge being put together\n- so Qing audiences of European maps (which included the Americas) had to judge them against Buddhist world maps, maps by previous Chinese explorers, etc, many of which were incommensurable\n- therefore a lot of responses were exactly as the quote here says, skeptical but without strong ability to test them\n\nMosca also has a lot about how the structure of bureaucracy changes how this knowledge gets to the center, which I thought was very neat.\n\nAgain, a little off of your question but in the same general field of “how did people deal with competing maps of the world?” I would guess that the mapping paradigms in Europe were more settled, so that people found it easier to absorb new information arriving in that familiar paradigm?",
                    "score": 134,
                    "replies": [
                        {
                            "author": "Unicormfarts",
                            "body": "European maps in the 1450s are not all that standardised in any kind of sense we would think of them as standard. They are still moving from being mappa mundi in that they may include historical, biblical or other not exactly geographic information, and there's not a strong consensus on which way is \"up\". ie it could be directions other than North. [They are gorgeous pictures of how the mapmaker saw the world](https://upload.wikimedia.org/wikipedia/commons/1/1b/FraMauroDetailedMap.jpg), but they aren't practical documents as you might think of them.\n\nI don't think we're quite at mapping paradigms until the 1520s, maybe a scootch earlier? Ricci doesn't go to China until 1582, which was a really long time in map history.\n\nI think the question \"how do we reconcile these competing versions to get the correct answer\" is not a question that would have been framed by Columbus' contemporaries. There are accounts of travels which have become popular texts by that time. Mandeville's Travels is a massive bestseller, in this time, reprinted a bunch by Caxton, and it's clearly a text people are deeply engaged with. \n\nAnthony Bale has a nicely nuanced discussion (referencing Mary B. Campbell, *The Witness and the Other World: Exotic European Travel Writing, 400-1600*) of the readership and the relationship betweeen fact and entertainment in that particular travel book in “ut legi”: Sir John Mandeville’s audience and three late-medieval English travellers to Italy and Jerusalem. Mandeville's work is presented as a truthful first-person narrative about his pilgrimage in copious detail, factual description of the Holy Land. Buuut, he made the whole lot up while sitting at home reading other books. People who had his book used it as a reference when they went on the \"same\" journey, and then of course they have experiences of the landscape that turn out to be different. The key thing is, though, that people don't reject Mandeville's book because of this; he's still an \"authority\".\n\nI think the Europeans are probably in the same boat as the skeptical Chinese on Columbus. There's an expectation people who go on journeys to far away places are going to come back with some wild stories, and maybe they are true or maybe they are not. \n\nMy favourite bit from Mandeville is his description of this marvellous tree in the Holy Land, and you can tell you are in the Holy Land because here's this tree, growing in the desert and it has fruit on it, no shit, actual fruit, and when you cut the fruit in any direction, lengthwise, crosswise, diagonal, whatever, the fruit will show, because it knows and the tree knows it grows in holy soil, the figure of the cross. \n\nHe says the name of this fruit is the banana.",
                            "score": 89,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "galactic_observer",
                    "body": "This is a great answer so far, but I would caution you on your usage of the term \"discovery of the Americas.\" Many modern sources oppose the use of this term for Columbus's voyage because it overlooks the fact that the Americas had been inhabited for over ten thousand years beforehand and reinforces the outdated concept of *terra nullius*.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thePerpetualClutz",
                            "body": "Which term would you use?",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "LustfulBellyButton",
                                    "body": "This is an impossible and never-ending debate, but some alternatives are:\n\n* \"Neutral\": \"encounter with America/the Americas\" and \"contact with America/the Americas\" \n* Antieurocentric: \"conquest of America/the Americas\" and \"invasion of America/the Americas\"\n* Cultural: \"amazement with America/the Americas\"\n\nThere are millions of pros and cons for each alternative, including the standard \"discovery\"; in Latin America it's quite common for historians to advocate for one or another of these options (although this movement has been weakening since the turn of the century). In the end, the decision depends on the point of view you wanna adopt in your discourse.",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "GabrielMP_19",
                                    "body": "Invasion would certainly be more historically accurate.\n\nMost contemporary historians who study the period would rather not use the eurocentric vision that America was \"discovered.\" It already had people, after all.\n\nA more neutral term could be \"arrival.\" However, invasion certainly sounds more honest.",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "henryroo",
                            "body": "Thanks for the correction, I will remember that for the future :)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}