{
    "title": "[META] Question for the mods: How has user engagement in /r/AskHistorians changed since it first began?",
    "author": "sandwiches_are_real",
    "subreddit": "AskHistorians",
    "rank": 6,
    "score": 107,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/AskHistorians/comments/1je72pb/meta_question_for_the_mods_how_has_user/",
    "id": "1je72pb",
    "selftext": "I was looking at a post today that was fairly new. It had a mix of removed answers and very short, anecdotal and otherwise-rulebreaking answers that are almost certainly likely to be removed. This made me wonder - /r/AskHistorians is by this point kind of famous for the strict enforcement of its rules, and at first blush I would assume people would not waste effort (however little) on making posts they know are likely to be removed. But that either isn't true, or else other trends and factors are causing these posts to continue to consistently show up.\n\nThis made me generally curious what the trend line looks like for low-effort replies across the sub's history. And that made me curious about overall user engagement and how it may or may not have changed as the sub has grown in popularity from a few hundred thousand to several million subscribers.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hello, it appears you have posted a META thread. While there are always new questions or suggestions which can be made, there are many which have been previously addressed. As a rule, [we allow META threads](https://www.reddit.com/r/AskHistorians/comments/4re4rw/rules_roundtable_no_14_make_your_own_meta_post/) to stand even if they are repeats, but we would nevertheless encourage you to check out the [META Section](https://www.reddit.com/r/AskHistorians/wiki/faq/meta) of our FAQ, as it is possible that your query is addressed there. Frequent META questions include:\n\n* [Why is everything deleted?](https://www.reddit.com/r/AskHistorians/wiki/faq/meta#wiki_why_is_everything_deleted.21.3F)\n* [Why isn't there an 'answered' flair?](https://www.reddit.com/r/AskHistorians/comments/g3ph8c/rules_roundtable_xi_answered_answered_flair_and/)\n* [Have you considered relaxing the rules or letting the upvotes decide?](https://www.reddit.com/r/AskHistorians/comments/h8aefx/rules_roundtable_xviii_removed_curation_and_why/)\nYou may also be interested in the [AskHistorians Browser Extension](https://www.reddit.com/r/AskHistorians/comments/d6dzi7/tired_of_clicking_to_find_only_removed_comments/) for a more accurate comment count, or [subscribing to the weekly roundup](https://www.reddit.com/r/AskHistorians/comments/di8t2i/tired_of_clicking_over_to_a_thread_too_early_so/). [Twitter](https://twitter.com/askhistorians), and the [Sunday Digest](https://www.reddit.com/r/AskHistorians/search?q=title%3A%22Sunday+Digest%22&restrict_sr=on&sort=new&t=all) also highlight content already written.\nThis isn't intended to be the last and final word, and we encourage you to bring up any further questions you might have which are not addressed there as well, but we hope that this will at least provide you some additional information until a moderator is able to show up and respond further!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskHistorians) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jschooltiger",
            "body": "We've always had low-effort replies, but the type and nature have significantly changed over time as a result of growth, the way that Reddit promotes content, and the nature of mobile apps and websites. \n\nGrowth is fairly easy to explain -- we hit the Eternal September threshold in Reddit very early on, when we had maybe 350,000 subscribers (Reddit counts these differently now, but we have about 2.3 million \"readers\" now). As any place grows, the number of people who walk in not knowing what it is also grows. \n\nThe issue of walking into a place and not knowing where you are is one that I will absolutely and quite happily lay at Reddit's feet. Old Reddit had style, in the sense that you could make subreddits look distinctly different from one another. New Reddit and shreddit both have abandoned that for a very uniform design, where it's very difficult to tell where you are on any given day browsing Reddit. The reason for this is tied into mobile and app design, where you have fairly limited space to work with; within that limited space, Reddit has limited subreddit moderators to being able to change the top header bar and the Snoo, but everything else looks just the same from one subreddit to another. \n\nNow, we do have the ability to sticky a couple of posts at the top, and we also have the ability under a small \"about\" link to link to our subreddit rules, but that's most of what we can do in terms of design. It's very difficult to expect people to read rules and understand the difference between this and another subreddit that Reddit is throwing at you when you have to go two or three clicks deep to get to the rules (this is leaving aside the issue that no one, ever, anywhere, in the history of time, actually reads directions). \n\nOne of the things that we've tried to do over time to mitigate this is to have a sticky at the top of each thread that explains our rules, and what we expect of answers. We think at least some people may see this on desktop Reddit, but on mobile and in apps, by default, stickied comments are collapsed. We have brought this up to reddit admins multiple times, but have about as much hope of it being fixed as we do a fix to the comment count (this is a way to say \"none.\") \n\nImagine a sane and rational world, like the one I live in, where I sit in the lobby of a building that has a clear name on the front and a function to it. Near me is a church with Gothic-revival architecture, a cross on top, and big red-painted wooden doors with the name of the church on it. Across the street is a pizza joint in a low-slung building with \"[place] pizza\" in prominent letters on the sign. Across the way is the public library, with funky late-20th-century architecture and a prominent library sign. Down the other way is a theater with a marquee of current showings. I can infer the uses of these things by the signs on them, but also by their structure and design, and gain context clues by their appearance -- the church is draped purple for Lent, the neon beer sign in the pizza joint flashes, the barber pole revolves, etc. \n\nThe state of current Reddit means that my visual experience is as though someone has stuck those each into the monolithic five-story Soviet-style bloc housing you see in former republics of the USSR, with the function of each building being indicated by a 2' square plaque on the front door. \n\nThe way that Reddit promotes content could be its own post on here, but suffice it to say that it seems to value controversy over all else -- a post with no visible upvotes asking about how Hitler felt about people with one testicle will shoot up in rankings, while a six-upvote post on the nature of field guns in the Napoleonic period sits in obscurity. This is reflected on the \"front page\" of Reddit, which is a feed that provides you with the same visual experience over and over again, to hell with the type of content being shown or what you've set your preferences to. \n\nIt's no wonder people don't know expectations here with that landscape to contend with.",
            "score": 147,
            "replies": [
                {
                    "author": "ducks_over_IP",
                    "body": ">this is leaving aside the issue that no one, ever, anywhere, in the history of time, actually reads directions\n\nAs someone whose job involves writing lab procedures for freshmen, let me just say that this is the most undisputably true statement that I've ever read on this sub.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "jschooltiger",
                            "body": "https://i.imgflip.com/2r56g8.jpg",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "paradoxunicorn",
                    "body": "Now I want a writeup on the history of people not reading directions and what incidents have happened because of it",
                    "score": 24,
                    "replies": [
                        {
                            "author": "A2-",
                            "body": "I had a similar first thought along the lines of:\n\"When did instruction manuals as we might recognise them start to appear, and has anyone ever really paid attention to them?\"\n\nBack on the original topic of this thread, the official Reddit app displayed a message while I was typing this of:\n\n\"Before submitting your comment, please ensure your reply complies with the rule [linked] of r/AskHistorians, which is generally different from other subreddits.\"",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "jschooltiger",
                                    "body": "Yeah. That's also a thing you can do but again, not sure how many people read it.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "bug-hunter",
                                    "body": "Given that no instruction manual has ever been read, how can we be sure they have even been invented yet?",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "VoilaVoilaWashington",
                    "body": "> but on mobile and in apps, by default, stickied comments are collapsed.\n\nWait what? Doesn't, like, every subreddit use that to bring up their rules right at the start when people get to a post? Is the undermining of the mods really that on the nose?\n\nI'm still on Old Reddit, and stopped looking at it on mobile the day RIF stopped working. But the whole FRICKIN' point of stickies is to tell people the rules!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "jschooltiger",
                            "body": "Yeah. you get the impression that people making design choices for Reddit don’t use Reddit very much.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KimberStormer",
            "body": "I'm not sure if I'm allowed to ask a follow-up question yet, but this question reminds me that I was curious about how many questions, that seem reasonable to me, seem to be downvoted to zero or worse by the time I see them in the weekly digest.  It seems to me like it's much more common lately, but I don't know if that's actually true (or if there's any way to track this.)  It seems to me like voting on questions is a major part of user engagement here, even though it doesn't seem to have much effect on what gets answered.",
            "score": 1,
            "replies": []
        }
    ]
}