{
    "title": "Dallas Rep. Jasmine Crockett walks out of Trump speech: 'He's spewing all kinds of nonsense and bull****'",
    "author": "Chance-Procedure6448",
    "subreddit": "politics",
    "rank": 26,
    "score": 1381,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 134,
    "url": "https://www.fox4news.com/news/jasmine-crockett-trump-speech-walkout.amp",
    "id": "1j46e2c",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kooky-Flounder-7498",
            "body": "I want to point out that despite all the dumb shit Texas does it was two Texans who actually reacted to Trump reasonably in this speech",
            "score": 1,
            "replies": [
                {
                    "author": "HopeFloatsFoward",
                    "body": "Yesterday, it was \"why is green the only one?\". Now we find out he wasn't,  is it possible more were doing things, you just didn't hear about it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Chance-Procedure6448",
                            "body": "Ten democrats walked out with Crockett, including Maxwell Frost. \n\nhttps://www.binnews.com/alternate/amp/2025-03-04-no-kings-live-here-democrats-stage-walkout-in-protest-of-trumps-speech/",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "winnie_the_slayer",
                                    "body": "Crockett organized that walkout.  She was talking about it right after it happened on the state of the people livestream.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "No-Equivalent-5228",
                                            "body": "Shouldn’t have been a walkout. They should have been heckling him the whole time he gave that stupid speech with made for tv, Oprah-like giveaways! What a joke!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kooky-Flounder-7498",
                            "body": "Yeah, Bernie walked out too and AOC refused to attend at all",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HopeFloatsFoward",
                                    "body": "\nOthers as well\n\nhttps://www.binnews.com/alternate/amp/2025-03-04-no-kings-live-here-democrats-stage-walkout-in-protest-of-trumps-speech/",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Kooky-Flounder-7498",
                                            "body": "Shoutout to all of these people",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheDamDog",
                            "body": "The others who walked out didn't disrupt the speech, though.  Green *was* the only one with the guts to actually make a stand.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HopeFloatsFoward",
                                    "body": "And what did it accomplish?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "EternalMediocrity",
                                            "body": "The same way people that people that refused to leave their diner seat, or move to the back of the bus, or to refusing to stop going to integrated schools. It creates fuss. It creates attention. It creates dialogue. It wont do anything to change the minds of his true believers, but it highlights that this is not normal and potentially gives courage to the people on the fence to not just go along with it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MichiganMom420",
                                                    "body": "And it really rattled trump at the beginning so a continued effort would have made a statement.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "Or, maybe it makes you look unprofessional and like you won't work with the opposition on things we agree on.\n\nYelling at someone does not solve things. The people who sat on a bus or walked into a school to integrate did more than yell at people.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "buffysmanycoats",
                                                            "body": "Trump is dismantling all the bipartisan shit we did agree on. Dems have no reason to negotiate with people who aren’t negotiating in good faith. That’s what the whole budget argument is about— Dems want assurances the money will actually go where they agree it’s going to go, that Trump won’t step in and divert it. And Republicans won’t agree to that. Fuck them then, let them do it alone.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "You can be angry all you want, but Republicans want Democrats to take the blame for a reason.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "buffysmanycoats",
                                                                            "body": "And democrats will not take the blame so ~~best~~ worst of luck to republicans.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "We shall see.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Traditional_Life7538",
                                                            "body": "They are not currently in a professional environment. Staying silent when you have a voice is being complicit.\n The yelling is not for the people in the building. It's for the people watching, who might wake up and do more than yell.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Its performative nonsense and means people are more focused on democrats being disruptive than on Trumps actions.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Traditional_Life7538",
                                                                            "body": "People see trumps actionsthey are in front of you 24/7. What isn't seen is someone doing anything about it. Sometimes you gotta put on a show in order to be seen, and as long as there is also action behind the performance then the performance has use..",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Democrats have little action they can do, so performative politics doesn't work.\n\nAnd as much as we want to believe people can see what Trump is doing, most dont pay attention. And this just distracted them more from paying attention.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Traditional_Life7538",
                                                                                            "body": "That's loser shit. And that feckless attitude is why your country is where it is.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Traditional_Life7538",
                                                                                                    "body": "There are people in deep red republican areas going to townhalls looking for answers on what Donald is doing. They are not getting those answers from their reps and are becoming increasingly hostile to the point where the speaker is saying to no longer hold town halls. The democrats had a perfect opportunity to, as an example, get up every few minutes and shout about issues that are affecting people (usaid funding affecting farmers, medicare and medcaid funding going missing or halting, doge, unelectect billionaires getting personal data, cozying up to russia, attacks on marginalized peoples, etc), get kicked out, run to news or social media and message about it, and take the spotlight away from a narcissist that loves the spotlight, ruin the evening.\nStealing the spotlight and disrupting things is a way to take power. Al Green had the correct idea.\n\nBut the best the rest of them had was color coded clothes and some small signs. \n\nLoser shit.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SmileyMan694",
                                                                                                            "body": "100%. Dems playing rock-paper-scissor against someone raping their spouse.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "HopeFloatsFoward",
                                                                                                            "body": "Shouting in the middle of a speech wasn't necessary if people are actually bringing it up to their representative.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Traditional_Life7538",
                                                                                                                    "body": "What happens when their representative won't listen? Or removes the ability of the electorate to voice their opinion?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "HopeFloatsFoward",
                                                                                                                            "body": "You work on replacing them",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "YakiVegas",
                                                            "body": "There's no working with Nazis.  These aren't normal times. Stop acting like it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Sure just keep the erratic protests.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "he_is_Veego",
                                                            "body": "Hilarious; a republican claiming someone else won’t cross the aisle to get things done after EVERY vote for years for Rs has been straight party line",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Crazytreas",
                                                                    "body": "Yeah, I'm done with people who act like Democrats need to work with Republicans. I'm so tired of \"reaching across the aisle\" when it's just weak appeasement.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "I am not a Republican.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Aponda",
                                                            "body": "Lol. But disrupting Biden and Obama speeches arent unprofessional? The ones that heckled didn’t get kicked out. They were free to express themselves. But now it looks like Dems are the bad guys? Republicans want to dethrone and lock up their opps. \n\nTrump was saying a lot of lies. Green yelling brought attention to the subject Trump was talking about and now people a searching and the press are talking.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "I never said they were professional. \n\nNo, they are not searching. They are just hearing that someone created a disruption and was kicked out.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Aponda",
                                                                            "body": "You can clearly see he is trending on social media…",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "That doesn't mean he is for what you want him to",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "thejimbo56",
                                                            "body": "Why would they work with Republicans?\n\nThere is no common ground to be had with fascists.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Bipartisan bills are passed all the time. They just rarely get noticed",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "thejimbo56",
                                                                            "body": "Really?\n\nHow many were passed in the 118th Congress?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TheDamDog",
                                            "body": "It disrupted Trump's speech.  That's the point.\n\nThe Democrats keep saying over and over that they \"haven't got any leverage,\" well, if that's the case then you disrupt.  You make the process as bumpy and painful as possible for the opposition.  That's what the Republicans have been doing for two decades at this point and it's been a *hugely* successful strategy for them, politically.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "What exactly happens to disrupting a speech? Nothing. Because a speech doesn't do anything.\n\nIt hasn't actually been that successful, when they win it's by the skin of their teeth.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Fit_Letterhead3483",
                                                            "body": "The point is to send a message to the people who are watching that they are willing to stand up against this asshole for us. The point is to energize the base. That’s literally why republicans do it. Don’t be naive.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Have you considered the Democrats base might not be interested in performative nonsense?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Crazytreas",
                                                                            "body": "I think you'll come to find that people in general are done with no performance.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Certain people.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "onomastics88",
                                                                            "body": "What’s your idea?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Make a clear plan to highlight items that a clear majority disagree with that Republicans are pushing.\n\nRight now there is so much noise about everything no one can focus.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TheDamDog",
                                                            "body": "You know, for people so obsessed with performative politics, libs don't seem to understand how to put on a performance at all.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Kooky-Flounder-7498",
                                            "body": "It demonstrated that people who are pissed aren’t allow and invited them to resist",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "How exactly did he resist?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Kooky-Flounder-7498",
                                                            "body": "He shouted at Trump until they removed him and the almost immediately attempted to impeach the president for the 3rd time",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "What does shouting at him have to do with impeachment?\n\nAnd what good does impeachment him do? It just looks exactly like what Republicans kept doing.\n\nUntil we can convince the middle he needs impeached it isn't happening. And yes, there are people in the middle.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Kooky-Flounder-7498",
                                                                            "body": "They were both things that he did to resist and they were both direct answers to your question",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Neither have to do with the other. Filing impeachment is at least an action that does something, but until you get the middle wanting him impeached, he isnt going to be impeached.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "thejimbo56",
                                                                            "body": "The people in the middle are called Democrats.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "There are people who belong to neither party that vote.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NoneOfThisMatters_XO",
                                            "body": "It’s called protesting, hun. He accomplished something by interrupting that embarrassment of a speech and making Trump uncomfortable. \n\nI can tell by your replies who you voted for…",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "I did not vote Trump. Disagreeing with you doesn't mean I voted for Trump.\n\nTrump was not uncomfortable, this played right into the reality show trump wants.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NoneOfThisMatters_XO",
                                                            "body": "Then why are you being so argumentative in your replies? Such a simp for Trump.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Disagreeing with you doesn't mean I voted for Trump.\n\nThe question is, why does my disagreement mean to you I must be a Trump supporter?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "NoneOfThisMatters_XO",
                                                                            "body": "Why are you disagreeing that people shouldn’t protest? What was wrong with a protest at a speech that was full of lies? Explain your disagreement because it makes zero sense.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "The protest distracted from Trumps nonsense. It didn't highlight anything problematic.\n\nProtests have to make sense to the public or they are worthless.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                            "body": "Yeah it distracted from him which is exactly what he *didn’t* want, which is why it’s effective.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "HopeFloatsFoward",
                                                                                                    "body": "The point shouldn't be to pass him off, but to communicate to the public what he is doing.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                            "body": "Yeah…and the public saw that on camera. Not a usual thing to happen at the state of the union.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "HopeFloatsFoward",
                                                                                                                    "body": "From the point of view of the general public it is normal.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                                            "body": "What Al Green did is not normal for a state of the union address. What was normal about that…? I think you don’t even know what you’re arguing anymore.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "HopeFloatsFoward",
                                                                                                                                    "body": "Have you been watching coverage of the previous state of the unions?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                                                            "body": "I guess I don’t understand your point here. Are you saying protesting is stupid and no one should do it?",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "HopeFloatsFoward",
                                                                                                                                                    "body": "No, I am saying that the protest needs to have a clear point. Just mad at Trump isn't cutting it.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                                                                            "body": "Look up what Al Green actually shouted and tell me he didnt have a clear point. Shame on you.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "HopeFloatsFoward",
                                                                                                                                                                    "body": "Shame on you for claiming i am saying he didn't have a point.\n\nHis method is what I am criticizing.\n\nEdit blocking someone doesn't change reality.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                                                                                            "body": "You are because you said he didn’t have a point. He absolutely had a point.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        },
                                                                                                                                                                        {
                                                                                                                                                                            "author": "NoneOfThisMatters_XO",
                                                                                                                                                                            "body": "I can’t keep arguing with stupid.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": []
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "catresuscitation",
                                                            "body": "Because it was only one person",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Multiple people walked out on him. He was not alone",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "catresuscitation",
                                                                            "body": "That shouted like that",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Why do they have to shout?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "catresuscitation",
                                                                                            "body": "To be heard. To take a stance",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "HopeFloatsFoward",
                                                                                                    "body": "About what. \n\nAll people are hearing is he got thrown out. Not what he was yelling about.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "catresuscitation",
                                                                                                            "body": "We know he was disapproving",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ddubyeah",
                                            "body": "Its not about singular acts. What has being disruptive overall accomplished for republicans?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "Not much. They can barely pass any legislation or government because they spent so much time not governing. Internally because their party because it is made of obstructions they obstructtheir own party's governance.\n\nThey barely win races, and it is because of heavy gerry mandering they do win",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ddubyeah",
                                                            "body": "Reality check. They own the house, the senate, the courts, the executive. Thats what ten years of playing to your base with accomplish for you.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "Reality, they barely own anything, and just like last time, won't accomplish anything",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Leisesturm",
                                                                            "body": "Tell that to any of the 100 odd **thousand** sacked Federal Workers. NOTHING done so far has actually gotten a single one of them their job back. Judges have frozen, blocked or denied just about all Trump/Musk executive actions and the response has been more of the same. Republicans? Seriously? Congress is over. Democracy is in free fall. Republicans don't have to do anything any longer. We have shifted from the prevailing Order that was in effect.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "Democrats don't have the power to get them their jobs.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Leisesturm",
                                                                                            "body": "What part of \"CONGRESS is over\" wasn't clear? Neither Republicans, Democrats, Lower Courts, Upper Courts ... THE SUPREME COURT. No legal entity that exists as such has the power, any longer, to influence the MAGA directive. Stay tuned.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "HopeFloatsFoward",
                                                                                                    "body": "We will see.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "ddubyeah",
                                                                            "body": "Keep repeating that mantra as they codify half of trumps EOs.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "We will see.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Crazytreas",
                                            "body": "People are talking about him. People are mad that he was the only one who did what he did.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "People? Or people that think like you?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Crazytreas",
                                                            "body": "How do you think Trump got where he is today? He represents a change for people, even if it very well is a bad one.\n\nHe did start out as the outsider, after all.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "He was never an outsider, and his success has been based in luck.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MazzIsNoMore",
                            "body": "Even today, I turned on the radio and the morning show was trashing Democrats for more people not doing these antics like Rep. Green. I'm sure they aren't going to correct themselves and will just leave it as \"Democrats aren't doing anything!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "mecon320",
                            "body": "Just like how since the media is ignoring all the protests, we're already seeing people here on Reddit accuse all Americans of being okay with Trump.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Drakaryscannon",
                            "body": "Oooh 10 out of how many? Come on it’s a valid criticism of the party as a whole",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HopeFloatsFoward",
                                    "body": "It comes across as less valid when you don't use facts",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Drakaryscannon",
                                            "body": "If you say so. It’s an accurate generalization though so I think you’re being pedantic personally",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HopeFloatsFoward",
                                                    "body": "Its factually a lie.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Drakaryscannon",
                                                            "body": "It really isn’t though. The democrats as a whole are being ineffective and doing nothing. It’s cool a few found their spines but to act like that makes the prior statement false is just disingenuous",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "HopeFloatsFoward",
                                                                    "body": "It isn't disingenous to support facts.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Drakaryscannon",
                                                                            "body": "You’re ignoring other facts to support your point of view here. The vast majority of elected dems are doing nothing full stop your feelings about it don’t matter just because it’s also a fact like 12 dems are actively doing something. Stop being ridiculous",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HopeFloatsFoward",
                                                                                    "body": "That's because you are not paying attention",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lurkingostrich",
                    "body": "The opposition in Texas is great, it’s the majority that sucks. Perhaps the opposition is good in Texas because they have to come up swimming against the current. Tough times make strong people or whatever the saying is.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kooky-Flounder-7498",
                            "body": "Just think it’s worth reminding people",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lurkingostrich",
                                    "body": "Not coming for you personally, either. I say this as a former Texan who is happy to see Crockett and Green making moves.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "winnie_the_slayer",
                            "body": "some Democrats are great.  The Texas state democratic party is really awful.  they don't do anything.  they have been losing for longer than any other state dem party.  Beto got as far as he did by not working with the dem party.  At least after the recent election, the chair stepped down (gilberto hinojosa).  at least we have a few rising stars like Crockett and James Talarico.  we lost sylvester turner last night.  my local texas dem party is not supportive of jasmine crockett.  I know because I've talked to them about her on multiple occasions.  Bunch of old retired people who get the vapors when they hear the word \"damn.\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dynamic_caste",
                    "body": "Jasmine Crockett and Al Green are true American heroes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "williamgman",
            "body": "Sure miss the good old days of Large Marge and Boebert sitting there quite and respectful... 🤡",
            "score": 1,
            "replies": [
                {
                    "author": "Chance-Procedure6448",
                    "body": "Their hypocrisy is astounding.\n\nLance Gooden ripped a sign out of Melanie Stansbury’s hands last night and threw it, and he was allowed to remain with zero comment. But Al Green was removed by the Sergeant of Arms for being “disruptive” because he said Trump doesn’t have a mandate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "williamgman",
                            "body": "I predict fist fights before this summer.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheChunkyMilk",
                                    "body": "That's one way to get the octogenarians out of Congress.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WorriedandWeary",
                    "body": "I'm tired of the media and a large number of Dem voters holding Dems to some long forgotten standard of decorum while the GOP acts like rabid animals. \n\nIf the Dems react, they're browbeaten for being hysterical, fear-mongering or trashy. If they don't react, they're spineless.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "williamgman",
                            "body": "Let me introduce you to Fox News... The larges single news source for Americans (sadly). When republicans act this way in Congress...  Fox reports it's because of our \"tyrannical democrat president\". When Democrats do this..? It's pearl clutching outrage. This is why Americans buy this. We've lost the ability to get facts and truth to the voters. Hence why the largest party in the US is the non voter at 90 million \"strong\". This allows them to sway just 3-4 million voters to win the election.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "acceptance1085",
            "body": "I’m convinced that the entire DNC war chest should be allocated towards fostering division within the GOP, making Elon primary people, and then propping up reasonable moderate conservatives after the two lunatics split the vote. The DNC has been useless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vespamike562",
            "body": "Every democrat should have walked out singing the Star Spangled Banner. Just like in Animal House when Dean Wormer and the Omegas tried to railroad the Delta house.",
            "score": 1,
            "replies": [
                {
                    "author": "D_REASONABLE_OPPZ",
                    "body": "\"Sic Semper Tyrannis\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No_Ant_7255",
                    "body": "Trump and co would love that. Especially the 3rd verse.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "vespamike562",
                            "body": "That’s why only the first verse is sung.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "No_Ant_7255",
                                    "body": "So Kanye’s pre-nazi psychosis songs are cool then too? Lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "donkeybrisket",
            "body": "All Dems should have walked out. Staying was giving tactic approval to the orange rapist",
            "score": 1,
            "replies": []
        },
        {
            "author": "chanska",
            "body": "God bless Jasmine Crockett.  Fightin the good fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wynnduffyisking",
            "body": "I’m starting to think Crockett, AOC and Bernie are the only Democrats in Congress who actually have the guts to stand up to Trump",
            "score": 1,
            "replies": [
                {
                    "author": "ArcherSea1246",
                    "body": "In the house, for sure. Sen. Chris Murphy has been very outspoken regarding his concerns pertaining to Trump/the country no longer being a democracy within 6 months. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Gas2086",
            "body": "She says what we are all thinking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Letterhead3483",
            "body": "So clearly all the Texas democrats are based",
            "score": 1,
            "replies": []
        },
        {
            "author": "FedrinKeening",
            "body": "Yeah, that's his specialty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Purple_Space_1464",
            "body": "Jasmine Crockett is an icon",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Equivalent-5228",
            "body": "Thank Christ! At least someone is saying it!! Besides Bernie and AOC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yoppee",
            "body": "What did she think when she showed up?",
            "score": 1,
            "replies": []
        }
    ]
}