{
    "title": "Discussion Thread #9 - Chat & Discuss Anything About Cats!",
    "author": "AutoModerator",
    "subreddit": "cats",
    "rank": 1,
    "score": 18,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 213,
    "url": "https://www.reddit.com/r/cats/comments/1ivcqqd/discussion_thread_9_chat_discuss_anything_about/",
    "id": "1ivcqqd",
    "selftext": "**Wecome to the Cat-Chat Thread**\n\nAsk any questions you have about cats or discuss topics that don't require a full post. Whether you're a new cat owner, seeking advice, or just want to share something fun about your furry friend, this thread is for you. Feel free to:\n\n* Ask simple questions about cat care, behavior, feeding, etc.\n* Seek advice on any minor concerns.\n* Post anything cat-related that doesn't need its own post.\n\nAlso, if you see someone asking for help and you have the knowledge to share, feel free to jump in and assist them!\n\n*Just a friendly reminder to follow the subreddit's rules and be kind and respectful to everyone !*",
    "comments": [
        {
            "author": "Random_scroller99",
            "body": "Hi! My partner and I are planning to adopt a cat. Neither of us have had any pet before so we don’t have any experience with cats. We are really concerned about a few things and would really appreciate any feedback or advice.\n1. We want to adopt a kitten considering it’s easier to train.. up to 2 years actually but are flexible. Is this true? Or getting a bit older cat better? Also, are two cats better than one specially to give each other company, play and in general distress.\n2. We stay in a one bed apartment on the fourth floor so no outdoor garden time. Will that be okay for the cat or will we be detrimental for it?\n3. Lastly are there things we should keep in mind or think of before adopting? Or any general advice?\n\nThank you",
            "score": 4,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Cats adapt to their surroundings.....but since the kitty will be indoors make sure the little one has a window to sit at! They love to watch out the windows! My 3 cats are indoors and they love to watch out the windows! Lots of toys, scratching posts and treats! Also maybe get 2 siblings because cats can get bored. Don't forget to make little hiding spots such as little cat houses! Go out and become new cat parents!! You guys will be wonderful! 😻💯❤️",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NikoUla76",
            "body": "https://preview.redd.it/6h9ogvv5ucme1.jpeg?width=1917&format=pjpg&auto=webp&s=1f132d8d7d4baf2559a0a00a5e6de1cb2cd96175\n\nHello, this is Niki. I’ve had him for about 5 weeks. He’s 3 months. This weird mark has been growing under his chin. I asked at the vet when he had his jabs but they didn’t seem concerned. It’s spread quite a lot. Does anyone know what it is? Thanks",
            "score": 3,
            "replies": [
                {
                    "author": "meowmeowlovermeow",
                    "body": "Feline acne maybe. You can use a clean damp towel to wip at it gently, and make sure you're using non plastic bowls since plastic bowls can harbor more bacteria than other materials.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dapper_Beyond_2484",
            "body": "Hello fellow cat owners! We need your help and desperately!!!\n\nWe have two kittens… Well one is a little over a year and the other is maybe just over 6 months. Scribbles was a stray that my boyfriend’s sister found and gifted him. Tiger is the younger one and we adopted him from the SPCA. Scribbles is a female tabby calico mix while Tiger  is a male orange tabby. Scribbles was fairly well behaved until she found out about the counter but other than that she had been a great cat. Tiger is much worse than a dog when it comes to food. HORRIBLE begging and once he found out about the counter it was over. He’s constantly on the counter, in our sink trying to see what he can find. And don’t even get me started on how he managed to open our trash cans. One sits in a drawer and one is a stand alone that you push the foot peddle to open. He ended up breaking the drawer to the other and gets in it all. The. Time!!! And now Scribbles has started following his pawprints and doing the same things. We have tried spray bottles, tin foil, cat spray and positive reinforcement. But NOTHING seems to work! Just a few moments ago we had some chicken thawing in the sink and stepped to the store to grab a few things… Came back and Tiger was in the sink and had chewed through the bag while Scribbles had a WHOLE chicken tenderloin on the ground.  What can we do to prevent this?! This is really a desperate cry for help. We love them both so much and don’t want to even think about having to give them up.",
            "score": 3,
            "replies": [
                {
                    "author": "ErrorBeneficial2507",
                    "body": "strips of double sided tape on the counters can work they dont like the sticky on the paws. heating it to remove can work. I used cookie sheets and put water in them and setting them along the counters had about 4. Normally cats dont like getting their paws wet. Lining your counters with tinfoil can also help...not sure what you have tried but these are ones that worked for me. My cats dont climb on the counters anymore, at least not  what I have seen. Other options are a citrus spray of some sort, I had a male stray always spraying my BBQ the smell was horrible. I cleaned it off and cut a lemon in half and rubbed it all over the bottom half of the BBQ, you will have to do this once every 2 or 3 days but it did work for me. Inside the house a spray bottle with a cut up lemon and filling it with water kept my boys from scratching the furniture, may be helpful with the counter tops as well.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hach95",
            "body": "I've buried my cat yesterday, my buddy passed most likely because of poison, from poisonous sick people. he was okay at first but his behavior changed  drastically towards me, usually he gets bored and do other activities than sitting with me but last week he wouldn't leave me unless for a sunbathe.\nI buried my best buddy, the one that knows I'm home before i even knock, and the one that comforts me when I'm upset. don't have words I'm writing this and my heart is tearing apart, i loved him so much i gave him freedom he gave something money can't buy, your grown ass buddy can't stop crying, and be sure once I find the asshole who did it, I'll send him right to hell.\nGotcho, my best friend, have fun in heaven, and dont stress it as usual, I'm not gonna gonna raise or adopt any pet after you.\nR I P",
            "score": 3,
            "replies": [
                {
                    "author": "TotalNectarine5122",
                    "body": "I’m so sorry for this tragedy and loss! It is a sadness like no other. Bless you for being such a loving cat daddy! \nOne thing that is helping me is I had a canvas print made of my cat and it is near the front door so she can still greet me when I come home and keep our spirits connected.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Hach95",
                            "body": "bless you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Radiant-Guidance1873",
                    "body": "I'm sorry for your loss. 😣",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ErrorBeneficial2507",
                    "body": "S sorry to hear of your loss. Sending love.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CringeWorthyDad",
                    "body": "Sorry for your loss. Cats add so much to our lives.  Try to remember the good time and try not to think about who may have poisoned your cat unless you truly know the cat was poisoned and have a good idea who did it, otherwise it will drive you crazy and increase your anger and pain.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Muffin-Rose",
            "body": "My cat has suddenly started scratching the hell outta my couch. How do I stop him or get him to scratch something else? Should I get him a scratching post?",
            "score": 3,
            "replies": [
                {
                    "author": "fisfia",
                    "body": "Mine have a scratching post but do scratch my arm chair anyway.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Muffin-Rose",
                            "body": "Is there anything I can do to prevent it? He is starting to shred the leather",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fisfia",
                                    "body": "Sorry, I don't know :(",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Muffin-Rose",
                                            "body": "It's all good, thanks :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ErrorBeneficial2507",
                    "body": "Highly recommend getting a scratching post, having the alternative helps save your couch. Lemon water or just a lemon cut in half and rubbing the juice on the area can help to detour them from scratching in that spot. I do not know what affect it will have on your couch maybe try in a hidden area to make sure it wont cause any damage.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Muffin-Rose",
                            "body": "Thank you!!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CringeWorthyDad",
                    "body": "Try covering the area being scratched with aluminum foil, which cats despise.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Waggmans",
            "body": "What the hell on not being able to tell people to keep their cats indoors or to spay/neuter them!? If we can't agree on common sense things like that I'm out.\n\nDisgraceful.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ravenclawrebel",
            "body": "Hello! I lost my fur baby of nearly 16 years a few months ago. In the next month or so I’m planning on going by the shelter to adopt a new kitty! \n\nIf I do walk away with a tiny kitten, can any of y’all offer advice? It’s been a while since I’ve had to care for a kitten, obviously 😅\n\nI’ve got an automatic feeder, a heated cat bed my old cat never got to use, and a litter robot that he also never got to use!\n\nJust looking for guidance to make sure potential new kitty will be in the best hands possible",
            "score": 3,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Awww it will come back to you! The special little one will choose you! But you might need to get just a regular little box for the kitty because it might spook the baby! Maybe you might just walj out with 2 sibblings! 💯☺️😻YOU GOT THIS!!👏😄❤️",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ravenclawrebel",
                            "body": "Thank you! I was definitely going to get a normal litter box while they were still itty bitty!\n\nMy HOA explicitly forbids two pets but they only selectively enforce their bylaws and I’ve dealt with enough bullshit from them over the years (moving isn’t currently an option for me!) that I wouldn’t say no if a bonded pair chose me. \n\nThank you for the reassurance 🩷🩷🩷",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CreepyCourtney70",
                                    "body": "Your so very welcome! Haha! Well the one kitty will be fine! You know they adapt pretty quickly! I'm super excited for you on a new journey with a new little buddy! You are going to be fantastic! 🐈❤️🐈‍⬛😻",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Positive-Level4948",
            "body": "Help!! My cat keeps bringing dead rats to my back door 😭only started today and brought me three!! I’m so grossed out I can’t even pet my cat and won’t allow him on my bed. Like should I allow him on my bed and should I pet him again I’m so traumatised I know it’s normal for cats it’s in their nature. Any advice would be really appreciated.",
            "score": 2,
            "replies": [
                {
                    "author": "ErrorBeneficial2507",
                    "body": "Usually it means they love you and it's a gift lol Sorry but apparently true. My farm cat used to line up mice on the deck for me. It really is a show of how much they love you. Good luck.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rhazein",
            "body": "HELP!!! \n\nMy kitten just turned 6 months old a few days ago, I got back from a work trip and gf said she was (and still is) in heat. I’m afraid we waited too long and can’t find an appointment soon enough to help her. I’m freaking out on the down low but I don’t want to upset my girlfriend. I’m a little disappointed that she hasn’t been more proactive about getting this done ASAP and feel as if I’ve done all the work to make sure our kitten is happy and healthy; (I.e. doing all the research, buying all the supplies, now having to find a place to spay her asap, etc.) even though I purchased this kitten specifically for her.  We’re both first time cat owners so I don’t know what to expect firsthand.\n\nCan someone tell me that Im either wrong and it’s okay we didn’t spay her before her first heat cycle so I can calm down, or tell me I’m right to be alarmed and should do whatever is necessary get it done as soon as possible. Thanks in advance.",
            "score": 2,
            "replies": [
                {
                    "author": "lnz_adsn",
                    "body": "Spaying before the first heat is recommended because it decreases the chance of mammary cancer. However, spaying between first and second also decreases this risk, just not as much. Kitty should be perfectly fine though! You sound like a great owner 🙌",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LesCommon",
            "body": "Whose kitty? \n\nUnchipped stray adopted me 7 months ago. \n\nI then put posters up seeking previous owner. A response then would have gotten a cat back.\n\nMonths of happy kitty and happy me ensue.\n\nOrig owner saw an old poster. He just called.\n\n* * *\n\nEven though I'm a dog person, I *really* like the cat. Chipped her, confirmed spay scar was spay scar, will continue to deal with feline immunodeficiency virus issues. Happily homed. Dog door in use.\n\nCall was short, he was off to work and will call back. Happy she's ok. Wants to see her.\n\nWhat I don't clearly know is if he'll ask for her back. \n\nOr what I'd say.\n\nIs it\nNo chip? Finders keepers.\n\nOr\n\n \"your cat was found and returned after a long 7 months\"?\n\nI say let the cat choose, and she chose me. :-)\n\nWhat's \"the right thing\" in this situation? (other than take down the poster after you bond with the cat)?",
            "score": 2,
            "replies": [
                {
                    "author": "RubyBlackCat_Flow",
                    "body": "I'm not you, so you should make up your own mind. That said, if the cat is older than 1 year old, I'd (in theory) give it back, provided that the old owner has real proof that it is actually their cat. If the opposite is true, then I wouldn't, because i wouldn't trust the owner.   \nI hope you find the right answer!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "didntconsent-tolive",
            "body": "Hi, I came here because my question is specific. My cat is peeing on my dogs bed, I took all the covers off, just the real wooden base is there and she’s peeing on it too. She’s currently on antibiotics for a suspected UTI (they couldn’t get a urine sample to be sure) but this peeing has to stop. I used all three of the pee enzyme sprays I have. What can I do?? I can’t keep having her pee outside of her litter box. She’s only about a year also. Has many places to hide and get away from dogs. Inside.",
            "score": 2,
            "replies": [
                {
                    "author": "ErrorBeneficial2507",
                    "body": "I used a citrus spray, cut a lemon and covered it in water, let it sit so the lemon gets mixed in well. You could just squeeze the lemon juice out and spray it on the areas you dont want them in. It worked on a cat that was spraying on my BBQ. Worth a shot but all cats are different but its an inexpensive option to try.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "didntconsent-tolive",
                            "body": "I’ll have to give it a try. I’ve used citrus scented stuff and now I have a cat specific pee spray. \n\nNow she’s just peeing in different spots. Gonna call the vet soon and let her know.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "didntconsent-tolive",
                            "body": "Today she peed on a brand new litter mat and on the floor by a door lol idk what to do",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Munch-Hunter-Wizz",
            "body": "https://preview.redd.it/fvk0cwkrpule1.jpeg?width=2186&format=pjpg&auto=webp&s=65103d93e30fcf4214ac19c86facd0dba3f60576\n\nMissing my little girl Munch 2 weeks gone leaving a big hole her brothers are subdued as we all are",
            "score": 2,
            "replies": []
        },
        {
            "author": "Uxyt98",
            "body": "Looking for advice. \n\nMy 7 year old female cat keeps peeing on the chair and the couch, she's been doing it for a bit and ive tried adjusting number of things. The most stated advice is take better care of the litter box, and I do. There's been times when they have a brand new fresh cat box and 30 minutes later she pees on the chair. Any advice as to how to prevent it, keep her off the furniture, something might be wrong, etc. are greatly appreciated. \n\nI will mention her cat box resides inside a larger tote to keep out the small dog, could she be irritated by the confined space when she uses the bathroom?",
            "score": 2,
            "replies": [
                {
                    "author": "JaggedGreen88",
                    "body": "It could, and it also could be difficult for her to get in and out. I know the struggle of keeping a dog out of litter boxes/pans. It's a never ending struggle.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "imbrucebruce",
            "body": "Advice needed! I have been feeding a stray for a few months now and she is limping really bad. She’s already been TNR’d because she’s been ear tipped. She does not let me close to her or anybody, closest I’ve gotten is maybe 3 feet. I just lost my job so I have no income if I even was able to trap her and take her to the vet, I can’t afford it, but I’m worried for her because her limp is getting worse. \nWhat should I do??",
            "score": 2,
            "replies": [
                {
                    "author": "ExistingVegetable558",
                    "body": "If you're able to at the very least bring her inside, that may help. I understand that you can't afford a vet right now, I'm in the same boat, but if you can afford some basic necessities to keep her in, she may eventually let you see what her injury is. It may just be a sprain, but living outside isn't an excellent environment to heal that; she would be constantly on the afflicted foot, sometimes even running to avoid a perceived threat. Providing an environment where she can stay might help.\n\nIf you get her in and see her injury and it is very obviously worse than a sprain, consider surrendering her to a shelter that can provide treatment. Or surrendering her to someone who fosters and can provide treatment; in my area fosters often have deals with vet offices for lower cost, and the work they do is truly wonderful.\n\nThese are just some options, I'm sure there are many other ways to go about this. This is just what I would personally do :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ErrorBeneficial2507",
                            "body": "My male 3 1/2 year old cat just came home yesterday after having a blockage and the Vet using a catheder procedure to drain his very full bladder. Affordability is why I couldnt leave him at the hospital. As is the invoice I was given included 112 dollars to clip and clean????? \"Are you kidding me\" I thought. Blood test came back no bacteria or infection. Why do Vets not perscribe an anti-inflamitory after such a proceedure? Only pain management and from what I have researched the meds do not offer any inflamation help for the urithea to prevent swelling causing another blockage???? It's been more than 24 hours and he still cannot even drink and wont eat. I am feeding him liquids with a surynge and trying to spoon feeding him but he wont eat. He will get up go to the water and ends up just standing in it thus I started using the surynge to get fluids in him. I'm told he will likely block again within 3 to 5 days without a 3 to 4k surgery to make the opening bigger...wtf!!! My rent is higher than my paychecks and I just find the vets I have spoken to are just gauging. The catheder was traumatizing enough. I usually feed him apple cyder vinegar for preventative measures but didnt catch it in time this time. Usually if I see my 2 male cats spending alot of time in the litter box I would administer the ACV 1:3 part ratio with water and they get back to normal. I missed it this time :(. It works if you catch it before they get blocked in the first place. I swear by the ACV. However once blocked well this is the result. He is so lethargic. He does seem to want to drink, thus last night he fell in the toilet he's so doped up. I brought him home about 2 ish yesterday it is 6:30 now. Is his behaviour normal? He has not even looked at the litter let alone use it. Any suggestions for an anti-inflammatory?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ProgressEfficient951",
            "body": "Hello...thanks for the opportunity to ask a question. Just rescue a cat that was being bullied by another cat. He has moved under my bed. I provided a safe area with food and kitty litter. He lets me pet him under the bed but he won't come out and whimpers. It has been one week and not much progress. What to do?",
            "score": 2,
            "replies": [
                {
                    "author": "meowmeowlovermeow",
                    "body": "One week is very short for cats, I find that their personalities and how comfy they are in their homes can improve over months and years. Good things to do are to spend time in the room doing something else, like reading or using your phone/laptop on the floor, where the cat can see you. Also later on try gently playing, like take a string and tie a knot in it, then drag it under a towel to make it look like prey. Play really builds confidence in cats of all ages, it makes them feel like hunters. Thank you for taking care of him.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CringeWorthyDad",
                    "body": "Give him time. Put food just outside the bed.  Leave the room and close the door. You'll likely see the bowl isn't as full as when you left it.  That may help him feel it is all safe.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpicyPepperPasta",
            "body": "Hello. First time cat owner offering my cat tax [1](https://i.imgur.com/7KKTHWm.jpeg) + [2](https://i.imgur.com/WzDbJBj.jpeg).\n\nI adopted these two kitties in late December and they'll be 5 months old tomorrow. The black cat is a male, and the tuxedo a female. The vet recommended to schedule the desexing at 6 months. Should I push for an earlier surgery since I have a male and female living together indoors, or is 6 months fine? Are there any early warning signs so I could then schedule an urgent desexing? (aside from mounting, obviously.)",
            "score": 2,
            "replies": [
                {
                    "author": "ErrorBeneficial2507",
                    "body": "In my own experience when done within the first year, it does help to prevent spraying and aggression in males.  Females can also be spayed within their first year without any issues. The sooner the better either way .",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FallenFairFeline",
            "body": "My 10 yr old F cat, that I've had her entire life, gets zoomies while demanding food. Her weight has fluctuated real hard for most of her life but its so funny for this 10-11 lb loaf(she looks heavier than 10) to get zoomies and stop and stare into your soul.\nBut why are cats so obsessed with food?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Muffin-Rose",
            "body": "Hey guys!! My cat keeps sitting by the containers where I store his food and occasionally meows. He doesn't want food because I have tried feeding him extra when he does this. What could be wrong?",
            "score": 2,
            "replies": [
                {
                    "author": "ErrorBeneficial2507",
                    "body": "Could he be looking for treats perhaps? Mine will meow at me to clean the litter if I'm not on it, or for treats or food even tho they dont really eat if I give it to them anyway. They are characters :)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Muffin-Rose",
                            "body": "I keep the treats separate. He knows where they are he won't eat them even if I give them to him when he is doing this  :((",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ErrorBeneficial2507",
                                    "body": "Maybe nothing is wrong. My boys will just meow at me on occassion sometimes its because they are hungry, looking for treats, wanting the litter spotless or just chatting. Fred will greet me at the door and have a full conversation with me I think to say hello lol Unless they are howling/whining in pain and I promise you can recognize the difference doesnt sound like anything to worry about.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Muffin-Rose",
                                            "body": "Thank you! It eases my mind a lot✨️💜",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "turcois",
            "body": "friend of mine got sober and is kind of restarting his life atm, he was about to get kicked out of his apartment so he's living with his parents atm, but he had a cat and his mom's allergic so since him leaving his apartment was super sudden, he basically was like \"i need to be out of here in 2 days, i applied to give her back to the humane society (where he got her) bc nobody i know wants her, would you be able to watch her for a few days until the humane society can re-adopt her?\" and i was like well shoot, if he's paying for the food and she's already litter trained and pretty easy to take care of and friendly with me, why not watch her for a week?\n   \nanyways i've thought about getting a cat before but i'm kinda tight with money, but now one who needs a home who already knows and loves me is in my life. yes, i can afford 20 or 30 dollars a month in cat food and splurge on treats for her now and then. and i work from home so i can give her the socialization. my main worry is if/when she gets older (she's 3yo) and will start needing to go to the vet. i mean, hopefully i'll be in a better spot financially, but i might not be. i dont want to potentially get to that point and then just try and pawn her off on a shelter, that feels rude and irresponsible lmao, but if i return her now (assuming they could take her) i'd be giving them more work anyways... right? like, logically, at least with the first option, i could bear the cost and time of taking care of her for at least a few years, instead of some local shelter whose main purpose is finding people who will bear the cost and time of taking care of animals. \n  \nany advice?",
            "score": 2,
            "replies": [
                {
                    "author": "TotalNectarine5122",
                    "body": "Please don’t rehome her in a few years. I’m sure you realize how traumatic that would be. Either find a foster for her now or consider getting pet insurance. I understand the concern about future vet bills but you can also apply for care credit to pay off any expenses. These pets are only in our lives for part of our lives but we are in their lives for the entirety of theirs. Bless you for helping her!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RosaBeatrice",
            "body": "How many meals should a cat have every day?",
            "score": 2,
            "replies": [
                {
                    "author": "UnlikelyLemon7895",
                    "body": "I give my cats two pouches of wet food each per day, breakfast and dinner. I put down a small bowl of dry food that they can both snack on if they are hungry in between.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "circaflex",
            "body": "https://preview.redd.it/qd84junfa7ne1.jpeg?width=3024&format=pjpg&auto=webp&s=2682b413d967621be15e80bb3fc3ed6d94c80b93\n\nThis is Bob",
            "score": 2,
            "replies": []
        },
        {
            "author": "k75ct",
            "body": "160. If you think they are a lot of death notices, there were about 160 in the past month. I keep thinking they need their own sub.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Whole_Strike_5683",
            "body": "♥ YOU GUYS! I've been on a waitlist to foster kittens FOREVER and my foster application was finally approved.\n\n  \nI have one final interview tonight. I originally applied to foster kittens old enough to eat on their own, but they want me to foster pregnant moms right now. I am so excited! ♥\n\n  \nWish me luck. ♥ I really hope my interview goes well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pinkp0nyclurb",
            "body": "https://preview.redd.it/lpkij2a9mkoe1.jpeg?width=3024&format=pjpg&auto=webp&s=83bb3e3b4f78566c463d4900b28478daf13c93e2\n\nIs my cat dirty or it's just his color?",
            "score": 2,
            "replies": []
        },
        {
            "author": "gglamm_",
            "body": "My cat keeps bringing home dead birds, he’s brought home 5 so far (one was alive) is there a reason for him doing this?",
            "score": 2,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Haha!!! Well it's your cat saying \"Thank You\" to you! It's an offering to you from him! Cats love to hunt and pounce on their prey! You really can't stop what is already built into the natural way of a feline.. Hunting and stalking out there! 👏😻😄🐦🐈🐁🐈‍⬛",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Educational-Echo-766",
            "body": "Hello! As a fellow cat lover I just discovered this lovely forum and I thought this would be a great opportunity to ask for your all ,Cat-experts', opinion:) I'm currently working on goodies featuring cool cat designs. I'm reaching out to see if you might be interested in these kinds of items.\n\nFor example this Tote bag design I customized, but I also have T-shirts, Hoodies & Sweatshirts Mugs, Posters and Canvas Prints, Notebooks, Phone-Cases, Stickers and much more\n\nWhat do you think? Or do you have maybe also other creative Ideas that you think would be awesome, but doesn't already exist? Thanks in advance! 😊\n\nhttps://preview.redd.it/1mcrgdeksroe1.png?width=1333&format=png&auto=webp&s=31a2a08ebc13345c604a3172bb9ebdcb3ef973bf",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pitiful_Young7466",
            "body": "https://preview.redd.it/6ttsi8y8ruoe1.jpeg?width=4309&format=pjpg&auto=webp&s=bc4cd113a60b8812e057f0600a6eb016751c221e\n\nmy cat",
            "score": 2,
            "replies": []
        },
        {
            "author": "sf_ruslik",
            "body": "Hello world. This is Charlie. He is well-behaved and mellow kitty, but we do worry that he might dip out, as he likes to run out to the open door. He is and has been totally in-door cat, he has been chipped too, but my youngest kid wants to put an AirTag on him. Charlie doesn’t like to do things humans want him to do, and has been protesting against anything around his neck. How can I solve the problem? Would love to get your input. Thank you in advance\n\nhttps://preview.redd.it/yx2lbg9vzuoe1.jpeg?width=3024&format=pjpg&auto=webp&s=74a680f26dd12f5dd26f9215b52f79d1586998e1",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unlucky-Goose-1508",
            "body": "Hello everyone!! I have a two and a half year old cat named Lara and we've had her for 2 years now. We found her outside and are a bit unsure whether she was an indoor cat or not because she seemed in really good shape and was used to the sand. We don't let her go outside except for the rare occasions where we accidentally leave the door open and she makes a run for it. That happened a week ago and she was gone for about five hours. We were really scared because as much as the neighborhood is a quiet place, there are unexcepted dangers outside, especially for a cat that has gotten used to the comforts of a home. The past days ever since she went outside, she's been upset, unlike herself and has been meowing a lot, standing in front of the door which tells me that she is eager to go outside again. My heart breaks but I know that the safest thing to do is keep her inside. I would really appreciate some advice on how to deal with this and how to help Lara feel happy and fulfilled inside. My brother and I have tried to put her on a harness and take her out but she hated it and wouldn't move while wearing it. We are currently looking to buy a better one but another worry of mine is that there aren't any quiet, green areas around us; the best option to take her is pretty far (an approximately 30 minute bike ride away) and we are worried that she might get scared during the ride there. I'm sorry if this was a long explanation. Hearing some suggestions on how to improve Lara's happiness and sense of freedom would mean so much to me. Thank you in advance! :))",
            "score": 2,
            "replies": [
                {
                    "author": "Emergency_Tailor_172",
                    "body": "Well, I’ve been in your shoes.. \n  I’ve been a Mom to 4 babies..\nThey did Not go outside ( with my \npermission!). The first was “my 1st”\nCat. He was only abt 2 months old,and\nGifted to me by my brother.  I had no\nClue what I was in for!   We were in an \nupstairs apt. He could look out the\nSliders, but no outside  for yrs. ( I was too afraid to let him go out there)\n  But he enjoyed the fresh air when I \nOpened the sliders.  Slipping ahead.\nAt abt a year,  let him out there when I was there.  Fast forward..he slipped out the door & down the stairs & out!! He was gone for 3 days.  Then came back !\n We Kinda grew up together.  He was \nSatisfied with the balcony.  We were\nTogether for  17 yrs.   I had other babies\nSince, but we’re all inside boys.\n They had window-seats, glass doors,\n And we vacationed together twice. \n All inside boys.  I asked  their Vet if I shd let them out…he said “ not if you want to insure & protect their good health”.   In our neighborhood, there were other cats around, but you never know if they are healthy, vaccinated,\nwild, etc.  And there are, unfortunately, \nPeople who are cruel to cats. \n  Sooo, I am a believer in a “healthy cat\nis an indoor cat”.  I’m sure some would \ndisagree, but they are all loving, healthy, and beautiful boys!  Best of\nEverything with your new kitty.  Provide toys, snacks, and playtime & they’ll be fine!  ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Unlucky-Goose-1508",
                            "body": "Thank you so much for your lovely reply! :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Impressive_Plant_851",
            "body": "Hi! Just adopted a 1 year old cat yesterday. We went to pick her up from her foster parents’ home,  interacted a bit while we were there, but she was very very shy. After taking her home at 6pm, we took her directly to her basecamp in our empty guest bedroom (litter box, food, water, scratcher), we opened the carrier. She ran outside so quickly and went straight to the bathroom and hid behind our toilet (a place we didn’t know could fit her, otherwise we would’ve blocked it off). Now as newly cat parents we feel really bad that we couldn’t foresee that. After reading a few Reddit posts, it seems like lots of people recommended to just leave her alone, put a litter box and some food and water inside. However my situation is a bit different given that she’s behind the toilet and we do need to go in there from time to time to use the toilet + flushing. I have skipped showering for 2 evenings already just to give her more space in the bathroom alone to reduce the number of times we are coming in and out. I checked on her food, water, and litterbox and they’re all untouched. It’s almost 36 hours since she’s behind that toilet. Today I gave her 2 sticks of paste treats and made some progress as she actually stuck her head out to lick it all, but quickly went back into hiding. \n\nWhat should I do next? I’m genuinely worried for her health if she doesn’t come out tomorrow 😟",
            "score": 2,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Well kitties/ cats tend to do that until they trust the surroundings.. just keep doing what you normally do ..like shower, maybe that will get her to leave the bathroom...it might scare her a bit but it might stop her from going in there. Just keep talking to her in a soft tune and give her the paste treat! She will warm up on her terms. Did you get her history?! She might need a little friend! She will love you! Don't worry! ❤️",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Impressive_Plant_851",
                            "body": "Thank you so much!! Literally the morning after this post she was out 🥹 Then she proceeded to explore her “acclimation room.” Now 2 days later she’s already wondering around our living room and kitchen. So I would say she’s making a lot of progress so far. Thank you so much for the tips nonetheless!!! Still learning a lot about her everyday 😄",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "CreepyCourtney70",
                                    "body": "I'm so happy! I knew she would be out and about!! Hip! Hip! Hooray!!👏😻",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "IcyKrypton",
            "body": "https://preview.redd.it/ywzmv3y6l5pe1.jpeg?width=2252&format=pjpg&auto=webp&s=a8b5fee9d3ddedeed5938cf3800c38a15f23e902\n\nThis kitten and two others lost their mother a couple of days ago. I am taking care of them. Is this some infection around their eyes that needs medical attention? Appreciate the help.",
            "score": 2,
            "replies": [
                {
                    "author": "Emergency_Tailor_172",
                    "body": "I’d say “yes”.  Get him checked out…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CreepyCourtney70",
                    "body": "Yes! Go get them looked at because they will just keep passing the infection to eachother. Eye drops will work! Check for worms too!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DeterminedPolarbear",
            "body": "Hello all. My 12yo medium hair Siamese mix recently started laying near the water bowl and not drinking water when he’s near it. He’s still drinking water and eating normally that I can tell downstairs where I usually feed them but up here he’s just literally laying next to the water bowls with his chin hovering above the water. \n\nIt’s on tile floor and I started closing off this area when I go to work due to a different cat having an accident in the room a few days ago. \n\nIs this normal? Has anyone else’s pet done something similar? He seems ok and comes for pets, purrs and rolls around for love, etc., but I just worry he wants the water but somehow can’t drink it. The water is fresh, I always pour and rinse out the bowls because they like it fresh so it’s not that I don’t think. Any comments would help. I don’t know if I’m just worrying for nothing or being dumb for not taking him in for a checkup. Thank you to anyone in advance for advice/words of comfort.",
            "score": 2,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Well maybe when the other cat had an accident there he did'nt like that and he can smell the other cat...also it can be a more serious issue....He's an older guy so maybe its just his time to pass...Are you sure he's drinking and eating downstairs? You might have to start watching him to see if he is actually drinking and eating. ❤️",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DeterminedPolarbear",
                            "body": "Yeah, I’m sure :). He’s a little chubby guy and he still was playing with me last night. I was observing more today and he isn’t doing it as much. But I’ll keep an eye and I replaced the water bowls again just incase. Thank you for the advice and award ♥️ I hope it’s not his time since he’s still got so much more cuteness to share.\n\nEdit: to fix spelling mistake",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DifferentCrab966",
            "body": "I adopted a bonded pair of young adult cats. They are both anxious and the female is semi feral, as in she won’t let me touch her at all and gets very aggressive if she feels uncomfortable. However, she loves to be near me throughout the house. The male will let me touch him but does not want to be picked up and just always seems on edge that I’m going to grab him. He occasionally comes up to me throughout the day and sits for some pets. \n\nI’m looking for ways to make these cats friendly and be willing to be pet or picked up. I will mention, due to their past as rescues I assume, they are NOT food or toy motivated in any way. I have tried everything. Especially if they are on guard, they will not eat or want to play with anything.",
            "score": 1,
            "replies": [
                {
                    "author": "Infirezz",
                    "body": "It takes time maybe weeks months or years i guess",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OpositorCR",
            "body": "Help, my wife and I adopted a second cat around april last year, he was at most 1 month old at that time, recently we took him to the vet cause we feared he was overweight, and the vet recommended decreasing the portion to around 60g a day. Since then he started to show signs of 'rebelliousness' and started to steal food from us and even the other cat we have. It has gotten to the point that we cant even keep bread or anything on the counters because he will steal it and eat it without regard to if it's human food or cat food. Both cats have different food due to digestive issues on my older cat, and he has managed to open and break a feeder that it only opens up when the older cat approaches.\n\nAt this point we dont know what to do and it's causing issues with my wife.",
            "score": 1,
            "replies": [
                {
                    "author": "Single-Alternative37",
                    "body": "Cats like to hunt and scavenge. Its just in their instincts. One of our cats is very food driven too and is our healthiest weight cat but she also loves any chance we slip up and leave food out unattended. Our other 2 were a bit more on the overweight side so we have different portions going to each cat. \n\nMy suggestion is create a consistent feeding schedule so they know when they get to eat. Automatic feeders are great but remember dry kibble shouldn't be their entire dietary source. \n\nI will tell you it will be frustrating and it takes awhile for both you and your cat to adjust but cats really do learn habits and routines. It took awhile but we got ours to know which feeder is theirs so they all disperse to their bowls when it's time. Our scavenger kitty knows not to get on the counters and does a good job when we are present. We just need to make sure to do our part and not leave anything out, especially when we aren't present.\n\nCats will do cat things and if you are like me where you get impatient with things out of your control then it will be challenging but I can say you will also adjust with them if you stay consistent and learn their habits.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kibitty2709",
            "body": "Advice please! My boyfriend got two kittens, they think a brother and sister but they were aspca rescues. They’ve been so close since they got them ! \n\nUnfortunately, the boy started limping and we took him to the vet and they told us he broke the ball joint off his femur and they had to do surgery. He was great during surgery and has been in such good spirits for a little kitty who broke his hip. But ever since he had surgery, we’ve had to keep him in a crate and away from his sister unless they’re being watched. Now when she sees him, she’s very wary of him, hissing and growling at him when he’s in sight.\n\nIt has only been 3 days, and so I’m not sure if she doesn’t like the smell of his meds or the anesthetic or something from his surgery, but I’m just looking to see if anyone knows if this will pass, or if we have to begin some sort of reintroduction. I’ve seen people who have had to separate cats and slowly introduce them back to each others scents, but I just don’t know if we should worry about it being a problem or if she’ll come back around as he starts healing. \n\nPlease please if you have any advice or comments on what we should do (if I should chill out or if they are at risk of not getting along anymore, I hope that’s not it my heart would break!) thank you!!!",
            "score": 1,
            "replies": [
                {
                    "author": "RubyBlackCat_Flow",
                    "body": "Oh, when my cat Moomoo got stitches on his tail, my other cat hissed at him for like a week, but don't worry! Your cat's memory is fine and once your other cat is out of the crate and not smelling weird, it should go back to normal!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Infirezz",
            "body": "I have two kittens, the boy one is so calm and doesnt like to play just sleeping or only come to me for affection, the girl one is always come to me for playing toys\n\nI have to give 1 to my friend and cant choose which one i keep ![img](emote|t5_2qhta|7944)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit-Blacksmith-4704",
            "body": "Recently housed a stray cat for about half a day. Any special cleaning I need to do? I am not worried about any sickness since she was here about week and I know where she came from ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Single-Alternative37",
            "body": "We have 3 extra large litter boxes for our 3 cats all spread out throughout the house. We have had all 3 cats together for over a year now and no new stressers have been added. Recently one of our cats that had no prior issue with using the litter box has decided she would rather use the bath mats or entry way mat to pee on. We keep the litter boxes clean and scoop them out twice a day. Often times the litter box in the room she loves to stay in will be completely empty yet she'll still go to the mats. Anyone have any idea on how to stop this. Like I said it wasn't a problem for the 3 years we've had her and now all of a sudden it is. My only thought is to take her to the vet now and see if there is anything wrong but she seems otherwise fine and healthy. She's not extra irritable or hiding more and seems to have no problem going. Just won't use the litter boxes now.",
            "score": 1,
            "replies": [
                {
                    "author": "PoleWegian",
                    "body": "generally my cats have done that if they have a UTI. It's strange but I think they link the litter box with the pain. She needs a vet appointment.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MentalMidget3",
            "body": "Best cheap low dust cat litter to buy in Canada?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BloomYeager",
            "body": "does anyone else have picky eater cat with Megaesophagus, any tips will do?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ishita-5536",
            "body": "Why does my cat have one eye bigger than the other? His vision seems fine—could it be from an old injury, or was she just born this way?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoleWegian",
            "body": "I inherited a 17 year old cat when my friend passed away. I've cared for this cat while she was on vacations or in the hospital. She's pretty needy and of course thin since she's an old lady. \n\nWe were trimming her nails and found one that has turned into itself so many times it's now round. I'm not sure how to trim it. All of her nails were pretty long since her 'mom' had been sick for awhile.\n\nShe's pretty healthy except being thin and has a little arthritis in front legs. Now to get my other cats to accept her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CompletelyPuzzled",
            "body": "How do you teach a kitten that her claws are sharp?  I've heard that when puppies play too rough, you should yip to indicate it hurts, but what is the equivalent for kittens?  Or is there something else to do?  Kitten isn't aggressive, just trying to jump up, and digging her claws in to hold on.",
            "score": 1,
            "replies": [
                {
                    "author": "PoleWegian",
                    "body": "With my cat who's almost five years old now, I just took my hand away and told her GENTLE in a calm voice. Even now if she gets too rough I say gentle and she stops since she knows I won't play anymore.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TwinSong",
            "body": "Where does the notion that orange cats are more daft and not too bright come from?",
            "score": 1,
            "replies": []
        },
        {
            "author": "nonsenseword37",
            "body": "Hello all! Looking for advice-\n\nMy husband and I have had our cat for 4.5 years, and obviously she is our baby. We’ve been living in the same apartment the entire time we’ve had her. We just bought a house, and with the new space, we want to adopt a second cat. We are hoping to time things out to where we can introduce the cats  on neutral territory (aka the new house), but I’m not sure if this is the right move. Should we let the cat adjust to her surroundings first, or just dive in with changes, but introduce the cats slowly, keep them in separate rooms, etc.\n\nAny advice is greatly appreciated! Thanks",
            "score": 1,
            "replies": [
                {
                    "author": "didntconsent-tolive",
                    "body": "I’d say move first and let your cat get comfortable. Cats hate change and moving is a huge change. I would wait on another cat for a couple months after moving, and when you do get one, keep the new one in a room so the original can come sniff the door and know there’s another cat. There will probably still be acting out regardless but I think that would be the best way to",
                    "score": 2,
                    "replies": [
                        {
                            "author": "nonsenseword37",
                            "body": "Thank you so much! Yes, after some googling, this is the conclusion we came to as well. We’re excited to get another cat, but not at the cost of stressing out this one (well, at least not more stress than necessary!)\n\nI appreciate the feedback :)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cutiepunpunpun",
            "body": "Hello, I really hope that I can get some advice from here.\nI've been feeding a small stray cat and today she came up to me looking all sick and horrible.\nShe has a enfection on her nose making her unable to breathe through there, and right cheek looking melted. Dripping saliva.\nOf course I took her to the vet first but the recovery with the medical help were all for ₺8.000 and I couldn't afford to pay that no matter how much I wanted to.\n\nI'm looking for any other help that I can do for her, like, what should I do to make her feel better?\n\nI gave her a warm bath and food, she's staying in my house for a short time since I barely managed to make my parents allow this.\nI'm trying to seek for help from other people because I can't do really much. All I wish is to make her pain less, she sounds so hurt. It's late and she's not sleeping, so I won't sleep until she does. :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional_Guide_406",
            "body": "Hello, one of my cats was playing with a feather (from a pigeon, i think). He is indoor and i think his brother played with the feather too. They are both 11 months old. It's dangerous? Shall i take them to the vet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuxrayEnjoyer",
            "body": "Thoughts about feeding cat dry food, but adding water to it and letting it hydrate? I saw alot of people saying how dry food for cats is bad, due to the fact that cats take most of their water from eating and dont (usually) like drinking normal water. But what about if you were to fed dry food with added water so that their water intake is still higher. I think it should solve the problem, but I'm not a cat expert and I didnt see anybody talking about it online.",
            "score": 1,
            "replies": [
                {
                    "author": "TotalNectarine5122",
                    "body": "I give mine wet food in the morning and evening and leave a little dry out for nibbling. Some cats will drink more from a water fountain so you can try one of those as well. Hope that helps!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vini963",
            "body": "https://preview.redd.it/tul8jdzehkle1.jpeg?width=3024&format=pjpg&auto=webp&s=a372e326f09cdfd5d893aa614e18b75fbf75b9d7\n\n￼​\n\nPlease help me, this is my mother, her little sister died this morning and she was limp all day, just sleeping, not eating, not drinking water, she doesn't even get up, where do I put her, she stays, is it because of her grief?",
            "score": 1,
            "replies": [
                {
                    "author": "RubyBlackCat_Flow",
                    "body": "Your cat appears to be depressed. My cat acted sort of like that when her brother died. But you should probably take them to a vet as I am not an animal expert.![gif](emote|free_emotes_pack|sweat_smile)  \nHope your cat gets better! ![img](emote|t5_2qhta|8097)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Hi, I'm new to this app, so I'm not sure how to post correctly. 😅\n\nLately, I've been very concerned about my cat because he hasn't been playful and doesn’t seem too excited about food. However, he still eats whatever is on his plate. I'm not sure if this issue is related to the way he sleeps.\n\nCan anyone let me know if this is normal? He purrs whenever I approach him while he's sleeping this way.\n\nhttps://preview.redd.it/ybvyit1aulle1.jpeg?width=3000&format=pjpg&auto=webp&s=6442455bfb8e46170dbfe3274acc9764ce560b2c",
            "score": 1,
            "replies": []
        },
        {
            "author": "bbldrizz6",
            "body": "Hey guys! I want to make a post here as I am somewhat new to cats and I am fostering a 1 year old cat named Muffin from a local shelter. She is so sweet and easy going, however they told me she did have some stomach problems, so I have her on a probiotic and she’s been very comfortable and eating/drinking plenty in my apartment so far. The only issues are that she really has trouble with the litter box and frequently pees/poops outside of it. I’m not sure what to try. I showed her where it was at and even moved it near her favorite spots and away from her food. If anyone has any tips I’d greatly appreciate it!\n\nhttps://preview.redd.it/fyhw6x9memle1.jpeg?width=1242&format=pjpg&auto=webp&s=d07b1fbd8054c73075d8aac633d934c8b3bbdcbf",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit-Blacksmith-4704",
            "body": "How to lower stress in cats?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirKillingham",
            "body": "I've always thought my cat was an American Bobtail, but she is very small and I've just found out they're typically large. What\n\nhttps://preview.redd.it/9luuecbmnqle1.jpeg?width=1776&format=pjpg&auto=webp&s=daaa3f5a78c05595a71843ab0c7348fd558f4c21\n\nelse could it be?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thnksfrthmorgan",
            "body": "does feliway actually work for lower stress?",
            "score": 1,
            "replies": [
                {
                    "author": "meowmeowlovermeow",
                    "body": "Yes, but it's one part of stress management for cats. I used the spray and wipe version for stressed cats when I worked in a vet office. Many things can contribute to cat stress, but feliway/ cat pheromones are a good starting place.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ErrorBeneficial2507",
                            "body": "Thanks for the info",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Phaylz",
            "body": "Cat hurled. Idiot ate some Scotch tape the other day. Was playing with it, I went to take it away, he gulped it down and gave me the \"become ungovernable\" look. He's not sick, as he's not showing any other signs. And the last time he puked was because he snatched a tiny reese's cup wrapping (the black thing) and did the exact same thing. It's like his thing, alongside dragging a sock from my room to the kitchen to put it in his water bowl.\n\nAnyway, I know when my stomach expels its contents, my throat feels like shit. Is it the same for cats? What would be a soothing thing from his throat and/or stomach?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drakyndra",
            "body": "So, someone in my building was giving away their cats and I took them in. Both hid for a while but one has sniffed around my apartment, ate some of the food I left out etc.\n\n\nThe other has not. He's barely left his hiding spot.\n\n\n\nI have had cats before but not for a while - how long does it usually take to adapt to a new home and owner?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mtchkka",
            "body": "https://preview.redd.it/83poij2sr2me1.jpeg?width=3024&format=pjpg&auto=webp&s=0923af3498a01cd8f70826d9324c11f1926e42a9\n\nI have a cat named Tima already for about 2-3 years. Since we got him in our household he had those big black eyes and they never went smaller, he is just always like this, his eyes are always this colour and I’m feeling a little concerned about it. Tima is about 9 years old and he’s just an old grumpy guy. We also have a cat named Mars who is 1.5 years old and Tima is scared of him because Mars always tries to attack or bite Tima, maybe he has such eyes because of the stress? But he had these black eyes since the moment we got him so I don’t think so, can someone give some advices? (Sorry for my repetition and bad English, it’s my third language and I’m little guy who knows nothing)",
            "score": 1,
            "replies": [
                {
                    "author": "Place_Ambitious",
                    "body": "This is purely speculation, but I have a cat named Timo that just recently was diagnosed with cataracts in both of his eyes, which means he can barely see at all. His eyes do look as you describe Tima’s, could it be Tima also has that issue? It was only recently that I noticed he was bumping into things and he startles easily. I’m very distraught about this because I love him very much obviously, the way we cat people do. Since I’ve lived in the same house the entire time I’ve had him, he knows his way around the house but he used to enjoy going outside during the day and I’m not looking forward to keeping him indoors all day, but I will. I just joined this thread today because I wanted to ask people out there that may have had a blind cat if there’s anything specific other than not moving any furniture that I can do to keep him happy. About all I can think of is catnip and he does like his catnip",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gidgetsMum",
            "body": "Advice please! When is it time to say good bye?\n\nWe have a 15 year old cat. Some mobility issues, we are getting shots at the vet for arthritis. He has kidney issues too, peeimg more frequently and he has almost completely stopped going in his litter tray. He has destroyed our leather couch by peeing on it so much. My husband and and I have spent hours upon hours and much money cleaning it with enzyme cleaners and dragging it out to the sun. \n\nHe still has some.bouts of playfulness, and seems to be eating and drinking fine. He prefers to be in rhe sun all day and is very vocal at night sometimes waking us up frequently.\n\nMy husband asked the vet about euthanasia and they told him there is a few more things we can try for his pain. But to be honest I am at my wits end dealing with the piss and crying all night.\n\nIs it cruel to say goodbye now or should we keep trying?",
            "score": 1,
            "replies": [
                {
                    "author": "JaggedGreen88",
                    "body": " 15, for most cats, is a wonderfully full life. If his arthritis is that bad, I would seriously consider euthanasia.  Is he getting onto the couch just to wet on it or is already there? If he goes to it purposefully instead of the litter, it could be signs of a mental issue, if he's already there, then that would point to his pain being worse and simply not wanting to go to the box. \n\n The crying at night is a bit strange. I've never had a cat do that before. Keep in mind many vets will push for more and more treatments both to line their own pockets and prevent being \"blamed\" for putting a pet down. I've known several vets and vet techs that do this despite said pet being in obvious pain.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "meowmeowlovermeow",
                    "body": "The night time noises might be related to feline dementia. He could be sundowning. Night falls, it gets dark, and he gets confused and scared. ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "UnlikelyLemon7895",
                    "body": "We have similar issues with our cats- them seemingly not knowing how to use the toilet properly, sometimes yowling at night etc. They are both 17, so they are old. One of them definitely has joint issues and probably kidney issues too. Luckily one of them always uses the toilet in the same place (even if it is outside of the litter trays we put down :/ ). The other uses the litter tray but sometimes still defecates on the floor. Your cat peeing on your couch is defintiely a far more pressing issue.\n\nYour cat seems healthy in a lot of ways, just losing their mental faculties, like mine is. But I wouldn't judge any owner for thinking about and maybe choosing euthanasia in your case. No one can judge you for not wanting piss all over your couch and being disrupted by his noise. I think maybe you could try a few other things, maybe cutting off his access to the room with the coach if you can. Other than that, it's your choice. You need to prioritise you and your husband's quality of life at the end of the day.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheOriginOfSymmetry",
            "body": "Advice request! I'm hoping to become a first-time cat in the next few months.\n\nI think I have a pretty good idea of what I'm looking for since I've lived with several roommates in the past who have had different breeds of cats, and I have several friends for whom I've pet sat. I'm looking to adopt a young Russian blue, 4 months to a year old and be their forever home.\n\nMy only question I guess is what advice would you seasoned cat people give to a new cat owner?",
            "score": 1,
            "replies": [
                {
                    "author": "JaggedGreen88",
                    "body": "Don't go all out on toys first thing. Every cat I've ever owned/encountered could hardly be bothered with commercial toys. Be careful of Catnip. It relaxes some but causes others to become aggressive. My mother's cat is the latter. Keep your litter box clean, cats are neat freaks lol. Try to keep a sunny/warm spot available for them.  Watch out for house plants. Many cats like to chew on them and some can be toxic. Also because of plastic bags for the same reason.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JaggedGreen88",
            "body": "Advice Please! My mother and I recently took in a stray kitten. Normally we wouldn't, but it had been very cold here and she was just a little whisp of a thing. She has gotten much more comfortable and is making herself at home.  \nHowever, there is a mild issue. Said kitten, (Smoke for future reference), is becoming very attached to my mother and seeking her out, sitting with her, etc. This is a problem because we have another cat, an older male named Milo, that is very firmly my mother's cat. He does not get along well with Smoke and is spending less time with my mother because of Smoke.\n\nI know this sounds rediculous but my mother has Milo for years and this is bothering both her and Milo. Smoke won't come to me if I call her, (not sure if she knows her name yet), and will only sit with me for short periods if I pick her up. Does anyone happen to have ideas on how I can redirect Smoke toward me? She's an adorable little thing, I'd hate to have to find her a new home, but will if I have to.\n\nThanks in advance,  \nBest,  \nJ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rogerandrogu",
            "body": "Hello everyone! Wondering if anyone has had any experience with cats getting blackheads and if they did anything about it or just left it alone? I have two hairless cats and one gets a lot of it under his chin. Pic of the cutie included\n\nhttps://preview.redd.it/mb49wb7wvime1.jpeg?width=4284&format=pjpg&auto=webp&s=eec87f2098800f44f8528d6735dea1fb7174fa58",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant-Guidance1873",
            "body": "https://preview.redd.it/1af1ncjn0qme1.jpeg?width=8160&format=pjpg&auto=webp&s=230f4e68b911ba1af6ea18539bb69162288ab4a8\n\nRescued this little girl ( thought it was a boy) about 2 weeks ago. Please help me name her.",
            "score": 1,
            "replies": [
                {
                    "author": "Mediocre-Magazine-30",
                    "body": "Jade",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mejichu",
            "body": "I have this street cat my family somewhat takes care of a few times a week, we feed her, provide her water & let her sleep inside for a couple of hours since our parents don't want a cat since we can't afford to pay pet rent where we live\n\nI wanted to know if this is normal in a cat ? it's not as noticeable in person unless you get really close to her, but I want advice on what it could be ?\n\nI don't have any money for a vet visit either since I have a work injury & have been out of work for a month now\n\nhttps://preview.redd.it/g8so1ap3jsme1.jpeg?width=3464&format=pjpg&auto=webp&s=684f5ab012e1bc2683670bbb329ffe1003e93e67\n\nI'm also asking because there's another street cat she's become close with that also has this little patch on her head",
            "score": 1,
            "replies": [
                {
                    "author": "CringeWorthyDad",
                    "body": "Looks fine to me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fisfia",
            "body": "I have a 2 yo russian blue boy. He is peeing on me at night in my bed. He really empties his whole bladder too. It gets very wet and is of course very inconvenient. He does this once a month or one time every other month. I can't see a pattern of the litter box not being cleaned. What could I do to stop this? Any tips would be greatly appreciated!",
            "score": 1,
            "replies": []
        },
        {
            "author": "circaflex",
            "body": "I just adopted my first kitty cat, hes an f3 bobcat with bengal name Junglebob aka Bob for short. Hes starting to adjust well :)",
            "score": 1,
            "replies": [
                {
                    "author": "Acgator03",
                    "body": "An F3 bobcat hybrid is biologically impossible, so whoever you adopted him from may have been misinformed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "circaflex",
                            "body": "i see, they figured his grandparents were probably bobcat or something. either way i like him!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Acgator03",
                                    "body": "Nope, plenty of people have purposefully tried to breed bobcats with domestic cats, and it has never worked. There has also never been a real case in the wild either. Their chromosomes are too different.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "circaflex",
                                            "body": "glad i learned something, thank you :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Federal_Eye2362",
            "body": "I need advice!! So my boyfriend has stray cats in his neighborhood and there are two very precious babies what always come around for food and water and then wonder off for the rest of the day until they are hungry again. Anyway I believe that one (if not both) are pregnant. I don’t know how far along they are and i’m very unsure of what i should do. I really want to help them and bring them inside but 1. it’s not my house and 2. i wouldn’t want to stress them out. Should i leave them alone? and just continue normally with feeding them? or is there some way i can help them without putting too much stress on them? Help please :) and thank you of course",
            "score": 1,
            "replies": [
                {
                    "author": "CringeWorthyDad",
                    "body": "Just keep.providing food and water and if they know where you live it is likely they will show up when it is time to give birth.  Then let them in the house and set up a box with soft materials inside in a quiet apart place there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VegetableIll947",
            "body": "Hi! Does anyone have fish/seafood wet food  suggestions/recommendations for cat brands that have larger cans? I’m currently feeding my two adult kitties 2-3 Pro plan 3.6 oz cans each daily and it’s getting pricey and it also generates a lot of garbage. Thanks!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grand_Grapefruit_865",
            "body": "necesito que alguien me ayude a mi gata de 9 años le han detectado un tumor",
            "score": 1,
            "replies": []
        },
        {
            "author": "Virtual-Answer-5891",
            "body": "Hi I love cats but don’t have any yet! 😻 I keep hearing about bonded cats—what exactly does it mean for cats to be bonded? Does anyone here have a bonded pair? Would love to hear about them!",
            "score": 1,
            "replies": [
                {
                    "author": "Significant-Leek-516",
                    "body": "I do!  There were 3 littermates we saw were up for adoption at our shelter.  By the time we got there, there were two left.  The shelter vet happened to be walking by and said \"You should adopt both.  They are a bonded pair!\" We only wanted one, but how could we break up brothers?  I never really knew what bonded pair meant, but now I do, and I am so glad they have each other.  They play, sleep, groom and eat together.  They are usually in a tangle sleeping in their cat bed.  But one loves me more than the other.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Virtual-Answer-5891",
                            "body": "What a lovely story! I really appreciate how close they are. It's wonderful that one of them shares such a special bond with you too! 😻",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ok-Function3833",
                    "body": "Bonded pairs are cats who are mostly littermates or companions they adopted in a shelter or foster care. They learn and depend on each other with one being assertive and the other being shy but not in most cases. They mostly do everything together and stick to each other.  If you are financially capable of adopting a pair of cats, then bonded pairs will make your life easier.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DifferentCrab966",
                    "body": "I have a pair of bonded adult cats that met in the foster office. They are inseparable. I’ve very glad I did get two for two reasons: I know they will get along and they keep each other company. They play together, they don’t keep me up at night, when I am gone they don’t mind. BUT you have to understand that it’s like having a couple come and live in your home. They knew each other before meeting you so you might be the third wheel in their relationship. This might cause them to not have a ton of interest in you or your attention. If that is okay with you then I think it’s a great idea. If you want a cat who puts you at the center of their world and who they look to for comfort and attention, then maybe getting one cat is best. I agree with another poster that brought up financials too. Just because you have two animals in the same house doesn’t not mean you only need to get one large bed, one large food bowl, one large litter box, etc. They like having their separate items sometimes. I have a huge litter box that they like to share. Some cats won’t share a litter box though, even if they’re bonded. So just be aware that you may still have to get two of everything. 2x vet bills, 2x food costs, 2x toy costs, etc. \n\nOverall I am very happy as a first time cat owner to have gotten a bonded pair. I live alone and they are great company, even if they don’t want to interact with me all the time 😅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yadenenem",
            "body": "Rant: Why does every pet store I go to have their stock be mostly dog stuff and only a small hallway’s worth of cat stuff? Why do dog owners get to have a multitude of choice in product, food, toys, etc? But as a cat owner we’re an after thought? I swear some stores dedicate more to budgies and parakeets than cats. It really sucks :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "YT_Vis",
            "body": "Are there any recommended automatic feeders, particularly for wet food? I have an elderly (around 17 y/o) kitty who has no teeth so we typically only feed her paté that she can kind of lick up. With busy schedules, we wanted to slow down how quickly she was eating because she's has some issues with vomiting and the vet suggested she may just be eating too quickly. Thanks for any tips!",
            "score": 1,
            "replies": [
                {
                    "author": "JohnnyPsunahmi",
                    "body": "Some friends of mine have been using the \"Catit Pixi Smart 6-Meal Cat Feeder\" for a few years now. I've taken care of the cats several times while they're out of town, and I've found it really easy to use.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Whosiwhatsitt",
            "body": "Please help! My otherwise healthy cat has not eaten since Sunday and I just don’t know what else I can do for her. \n\nShe is a 16yo calico that is strictly an indoor cat and has been terribly congested for a month now. Occasional sneezing, some watery eyes but not much, no coughing, no puking, no other symptoms. Up until Monday she had been eating and drinking just fine with regular bowel movements. Her blood work all looks good, has no fever, does not appear to have any pain, teeth look okay for her age, mouth and gums look good, she’s still loving and social - she just has had this stuffy/snotty nose in both nostrils that she just can’t shake. \n\nShe’s had three different kinds of antibiotics, has gotten fluid twice this week and a vitamin b shot. I’ve been giving her a half tablet that’s supposed to be a good anti-nausea and decongestant for a few days now and I’ve applied a topical appetite stimulant on her ears, both prescribed by the vet. I’ve tried different foods at different temps but nothing seems to interest her. She’s had no interaction with any other cats, I keep my house clean, and have even installed an air purifier and humidifier in case she’s dried out or having some sort of allergy. Nothing works!\n\nDoes ANYONE have any other kind of advice I can try bc she’s seen three different vets and it seems there’s no other options at this point other than to let nature take its course.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Comparison1040",
            "body": "Hiya, got two cats on Friday (both six months) on Monday they were diagnosed with an eye infection and I am applying Ophtocycline twice a day. The secretion stopped but both are still having red eyelids and keep one more closed than the other. Is that normal? How long will it be till they are better? Just worried, I have had cats but never with an eye infection. The vet and the lady I got them from are not concerned, but I guess it's driving me crazy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cilokgawl",
            "body": "I just rescued a kitten with scarred eyes, so he might have some problem seeing. He doesn't want to or seems to understand using a litter box with tofu sand. Any advice?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tasty-Reflection-365",
            "body": "https://preview.redd.it/ry9zqarnlkne1.jpeg?width=3916&format=pjpg&auto=webp&s=84d3ece414931b8dd4a32ddfc87212808954efcd\n\nNeed help deciding a name for her. The place I got her from named her shanti.",
            "score": 1,
            "replies": [
                {
                    "author": "luckystrike1117",
                    "body": "Dot? Dotty?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "barkworsethanbite",
            "body": "Hi.  We found a feral mother with her kittens almost two years ago. We brought her in to care for her and her kittens.  We found homes for the kittens, had all spayed and neutered, and afterwards we have continued to feed the mother outside of our home.  She is semi feral I would say. She comes close to receive treats but won't allow us to touch her.  10 days ago she stopped coming for food.  After 10 days we had given her up for lost.  But on the 10th day we found her in a locked storage trailer.  She must have gone in there when my husband was getting wood out of his trailer.  I found her because she was talking loudly, I would say she was crying.  As soon as I tapped lightly on the trailer and told her we would get her out she stopped talking.  When we opened the trailer she did not run out. When I found her in a box she looked at me, jumped out of the box, and ran away, and then started talking talking crying.  She came for food and water.  We have not been able to catch her to take her for a vet examination.   After one failed attempt she became even more skittish.  Any advice?  She is running around as though she is fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Powerful_East2381",
            "body": "2 yr old cat suddenly startined urinating outside the box only a couple of times a week.  Put down aluminum foil and  she stopped for a few weeks then started again urinating only on the foil this time 1 or twice a week.   Resto of the time she uses a box.  No physical problems per vet wh suggested meds which I dont want to do.  Comments, Suggestions please",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpicyPepperPasta",
            "body": "My two 5 month old kittens are due for neutering in two days. Usually I can coax them into the carrier with treats, but they need to fast for the surgery. Any tips? I haven't tried catnip yet (aside from any that possibly came with toys).\n\n[Cat](https://imgur.com/WzDbJBj) [tax](https://imgur.com/7KKTHWm).",
            "score": 1,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Well catnip can slow down central nervous systems, espeacially 5 mos old, its dangerous,.do they have a speacial blanket? I wrapped my babies in a blanket ,one at a time 😄Get someone to help also I would get the carriers out a coulpe days before put blankets , a toy and give them a couple treats ....inside the carriers",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SpicyPepperPasta",
                            "body": "Thanks for your reply, and making me aware that catnip is not an option. I generally leave the carrier out, and the last time they were placed inside they were only a little resistant - [Frankie](https://imgur.com/J0lSRd3) jumped out a few times. But tomorrow they won't get breakfast and possibly no treats if the vet says I can't, so they might be more difficult than usual. Fingers crossed one doesn't run and hide once they see the other in the carrier.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ok-Function3833",
                                    "body": "You can try wrapping a few dry treats or dry food in a cloth or towel, make them smell it and lure them into the carrier. It has helped me while trying to get my not so friendly cat into the carrier before the surgery while he was fasting.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "CreepyCourtney70",
                                    "body": "GREAT!! I wish you luck! It will work out! Wrap them like a burrito in a blanket! ❤️😻",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SpicyPepperPasta",
                                            "body": "Thanks! So far everything has turned out smoothly, though they're a little active. I didn't think they'd look so cute in a [cone](https://i.imgur.com/MAzkIyR.jpeg).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Queen_of_wandss",
            "body": "So you know how cats are good at purring and that’s healing to them and others? Does anyone know if there’s a medical device that mimics this? My cat doesn’t purr a lot and even if he did he doesn’t sit near me 😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "CreepyCourtney70",
            "body": "Hello! I'm new on here! I'm going through some major loss,I've lost 3 of my cats😭My Kuku,Georgie and Groupie ...Kuku passed Late Oct(2 days before my birthday) She was 14 ( She was my shadow)💔Than Georgie passed the first week of 2025) and than Groupie passed (end of Feb) OMG!!! I'm overwhelmed with the losses...and well my Kuku really has hit me super hard,broke my heart! IDK but it seems so empty around the house! Sorry for posting a sad post but I wanted to share, Thanks!",
            "score": 1,
            "replies": []
        },
        {
            "author": "artsfreak123",
            "body": "Hi, im very much new here, but i need help asap. I am at my wits end. I got a persian cat (Simba) who's been abused his whole life as a playmate for the cat (Mimi) i rescued from the streets. Now, the cat i rescued from the streets, we got him last year when he was around 3 weeks old. the persian came after. They eat together, sleep together and play too. SImba, what he does is that when Mimi is asleep or relaxing, he sneaks up to him and bite him right in the neck. It wasn't that hard before i guess cuz we couldn't see any bite marks, but now the reddish part is visible. if they do everything together, then why does simba does this?? i just can't understand it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kingfezzard",
            "body": "Hey just a quick question if anyone can help, i'm moving in with my partner and her son would love a cat, i'm really excited about getting one again however he's allergic. I want to get a hypoallergenic cat but i'd really prefer to rescue as there's so many poor cats in shelters, I know it's a bit of a broad question but are there many hypoallergenic rescue cats or will I need to go to a breeder?",
            "score": 1,
            "replies": []
        },
        {
            "author": "luckystrike1117",
            "body": "Hi, in desperate need of advice. Our male cat (4) keeps attacking our female (3), both neutered. We have 2 other cats and none have a problem with him. He just fixates on her and keeps attacking her daily, biting her neck so hard it bleeds. She hides all day in the closet or under the bed and won't even let the other cats near her, she hisses and tenses up against the wall. Any ideas how we could stop him from attacking her? The vet didn't offer us any solutions",
            "score": 1,
            "replies": [
                {
                    "author": "UnlikelyLemon7895",
                    "body": "That is very unfortunate and strange behaviour from a neutered male. Are the two other cats male? He may just hate female cats. If so, it may not be practical for them to live in the same home.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "luckystrike1117",
                            "body": "The other two - 1 male, 1 female. He has no problem with either of them. He does attack a few of the females outside and males who come in front of our house when he goes for his hour outside (always accompanied by my bf). Our next door neighbor has around 15 cats outside (not neutered) and our backyard is literally next to theirs. Which is also weird because he doesn't mind some of them but he absolutely goes wild on a few of them and they're all in the same space. So I have no idea what to do and my bf really loves the female cat. That's his cat 😔",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "UnlikelyLemon7895",
                                    "body": "Well, if this one male cat is causing issues, you may have to consider rehoming him. The female does not deserve to be attacked by her fellow housemate, and as you are saying, the female is particularly special to your bf. Definitely if it were me I'd be looking to get the male put somewhere else.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TCORONA23",
            "body": "Sorry I came in late I didn't know you had a wonderful group chat.my name is Tris Corona 🇮🇹 my cat of 2yrs all of sudden stared throwing up for a day now she is lethargic..",
            "score": 1,
            "replies": [
                {
                    "author": "alexefi",
                    "body": "Take her to the vet.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TCORONA23",
            "body": "Am the only one here for the 1st time ever 👌🇮🇹",
            "score": 1,
            "replies": []
        },
        {
            "author": "TCORONA23",
            "body": "Where o Where is the help 🤔🇮🇹",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glittering_Fix_6574",
            "body": "Hello! I work night shift and my partner is an OTR trucker. I’m home most often but sleep pretty much all day after a shift. I’m interested in getting a cat but I’m nervous about the maintenance. I’ve had cats before so it’s not new new to me but it was when I was a kid and we lived on a farm. So a few questions:\n\n1. Daily cleaning of the litter box should reduce any smell? I live in a small apartment and don’t want it to smell like I own cats. \n\n2. Will the cat be okay to be alone a lot? Toys, food, water and good views of the pond w/ducks will always be had. \n\n3. Should I get a boy or a girl cat? I want one that’s chill and likes cuddles sometimes. \n\nAny and all advice about whether or not to get one is very much appreciated",
            "score": 1,
            "replies": [
                {
                    "author": "alexefi",
                    "body": "Its hard to say. Cats like people have different personality and different behavior. You can train cat to some sort of sucess but its hard and takes lots of time. If you adopting ask about cats and their behavior. If you getting new kitten from breeder research breeds. I adopted antisocial cat(didnt know that at time) so she rarely want to do anything with me and hides when any otyer human around. Shes very happy to get 1hour of attention from me throughout the day and other time she prefer to be left alone watching birds out of the window. She sleeps during nights instead of getting zoomies. My friend on the other hand got bengal and that cat want attention all the time. Smell its not only litterbox but cat itself. Litterbox is about what kind of litter you get, shape of the box, and tyere also stuff you can get to help with smell. But it will still smell like poop right after they poop, till deodorant kicks in. Clean litter box at least daily or even twice, it also help keep cat healthy. Yyou would also need to vaccum hair all over apartment to help with smell. I would be more worried about size of apartment cuz if you do get energetic cat they will climb everywhere. They also need personal space, places to hide, cat tree(if you dont want your furniture scratched), feeding spot, drinking spot.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UnlikelyLemon7895",
            "body": "Hi guys, I have to older cats, one male one female. They are both 17. We have moved home a few months ago and their toilet behaviour is becoming a challenge. The female seems to have designated the front door area as her toilet, whereas previously she went in the garden. We don't currently have a cat flap as we did, but we do let them both out regularly. Unfortunately, she is less keen on the new garden and prefers to stay in. It is a nuisance, but at least predictable, so we have put puppy pads down and I am working on making a custom box that shields that area and stops anything going on the floor. We did try putting a litter tray near the front door but clearly she has just designated that space as being the toilet so there is not much to do except, as I say, shield it. \n\nThe male cat uses the litter box that we have put by the back door just fine. 8/10 times he does everything in there and so there is no hassel. Unfortunately, he has the habit of sometimes using it to pee, but will then jump out and ten seconds later defecate somewhere else. As much as I am glad he uses the litter box most of the time, I just don't understand the sometimes when he chooses to defecate somewhere else. I can deal with the female cat's behaviour as it is consistent, but the male is a real issue. I'm not sure we can modify his behaviour at such an advanced age, and as much as I love him, it is hard not to get angry at his ridiculous toilet problems. So far all that I do when I know he is going to defecate is scoop him up fast and dump him back down in the litter tray.\n\nJust wondering what my fellow cat owners would do in this situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShowerWaste3965",
            "body": "Hi. I really could use an advice so please if u can. We adopted our cat almost one year ago from street and until now we didn't have any problems, we cleaned him from all parasites and he lives in apartment with us. Last week he hurt his paw so i took him to the veterinar where he got two injection. He was little tired 2 days after that but then i started acting like normal he has his appetite,he drinks water normally, he runs and plays and sleeps like a baby. But today i saw blood in his stool. So now im not sure what im supposed to do should ill be concerned or is it just because of stress after veterinar. \nPlease help if u bave some kind of advice. Thank u in advance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForeverTired_24-7",
            "body": "Hi! Please help a first time cat owner. My cat recently turned 6 months old, and he is an adventurous little guy who spends most of his day outdoors. I've regularly checked his ears before and never noticed anything of concern, but today, I found this. Does anyone know what this could be? Is it just dirt or something I need to be concerned about?\n\n(He is up to date with his vaccines, just waiting for him to get his boosters and are planning on getting him neutered ASAP. I also recently gave him tick and flea meds - Bravecto - a few days prior.)\n*",
            "score": 1,
            "replies": []
        },
        {
            "author": "NopeItsDolan",
            "body": "Our cat apparently caught a bat in our basement and brought it upstairs but we don't know if he was bit (there were no bite marks).\n\nHe got the three year rabies booster in late 2022. Should we take him to the vet again?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuriousKale",
            "body": "It's really fascinating how I am completely fine with waking up at 4am to feed the cat while it was a struggle to regularly wake up at 7am before I had her lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exact_Ad7382",
            "body": "https://preview.redd.it/1qmjwkmusdoe1.jpeg?width=1179&format=pjpg&auto=webp&s=2ec42d14370212c6bb5ea75d5e4a3922e6b15e3a\n\nMy 7 month old kitten has had loose poop since I’ve had her for about 2 months.  She’s been treated with dewormer before I got her, and again in her first vet visit with me.  Stool sample float test was negative.  I complained recently about continued loose orangey and tangy, foul smelling poop.  Rx of Proviable probiotics and diarrhea med.  I started feeding her Hill’s Science diet Sensituve stomach and skin with no improvement before that.    Have appt tomorrow with vet so after she pooped, I started digging for fresh poop in litter box.  Found this sticking out of some poop!  I am freaking.  It’s not moving.  I will obviously take it to the vet appt.  Anyone have any ideas what I might be dealing with, if it is a parasitic worm?  🪱 🤮",
            "score": 1,
            "replies": []
        },
        {
            "author": "DifferentCrab966",
            "body": "If you’re thinking of using sawdust pellets for litter because it is cheaper and you can buy it in bulk…..no.\n\nThis is just MY EXPERIENCE so don’t come for me but I thought it was a genius idea but quickly realized that sawdust/wood pellets completely disintegrate when (liquid) hits them. They are not sponges like I thought they would be. It’s a total mess when trying to clean the litter box and you end up having to go through waaaaaaay more so buying it in bulk ends up being a weekly trip to the store for a 40lb bag. I guess it covered the smell but that’s about the only good thing. Trust the litter companies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "okAlayna",
            "body": "Hey everyone. I'm looking to be a first-time cat owner. While I've taken care of outdoor strays, I've never owned an inside cat. I'm looking for any suggestions to get me started and help me in the future. Feel free to dm me as well.",
            "score": 1,
            "replies": [
                {
                    "author": "pumpkin-18",
                    "body": "Make sure you clean the litter box fairly regularly because they will go all over the house if it’s dirty! Also a hooded litter box+ a litter mat is a game changer if you don’t want to smell it/ have litter everywhere. My cat took about a month to warm up to me and my apartment so don’t be discouraged if they aren’t as playful or affectionate as you hoped. So excited for you to have your first cat!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Perlie6",
            "body": "Hi guys. I have a 8yrs old female orange tabby. I need help shes been pretty good since feb 2025 when i took her for her annual. Just last week i did feed her weruva lamb wet food first time having lamb and idk if i did something. After she had that she was lethargic for 2 days did not move and slept for majority of those 2 days. She started walking way more after that and was eating her dry food instead but just yesterday she started limping. Im concerned but remained hopefully it was maybe because her paws were dry and thought i’d only walk out with a cream for it. They did a blood analysis and came back that she may have a possible infection but it wasnt certain i did decline the xray as its expensive for me during this time but idk what it could be. Has anyone experienced anything similar should i get a 2nd opinion? Im super sad about this bcus im feeling guilty that i did this to her ever since i gave her that stupid lamb food. Pls share opinions /: pls do be nice",
            "score": 1,
            "replies": []
        },
        {
            "author": "pumpkin-18",
            "body": "Hey guys! I have to be away from Saturday-Monday and have no other safe option but to leave my cat at home. She is two years old and I bought her some toys that she doesn’t need me here to play with and a feeder. I feel so bad that I have to leave her and would appreciate any advice on how to make her weekend as comfortable as possible! Thank you in advance:)",
            "score": 1,
            "replies": [
                {
                    "author": "Equivalent-Ground-45",
                    "body": "I would arrange someone who is familiar with the cat to stop in for 20-30 minutes a day, check needs, and hopefully spend time with the cat.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shasan3",
            "body": "I’m looking for a large sized stainless steel sifting litter box with a lid, does anyone have any recommendations?",
            "score": 1,
            "replies": []
        },
        {
            "author": "beansandhotdogs",
            "body": "I have an almost 1.5 year old cat who’s been getting progressively more aggressive towards me and my other cats, whom he was fine with as a kitten. He chases them around, searching for conflict. He has a clean bill of health from the vet and has had no new changes in his life. It’s becoming a huge issue because he doesn’t groom himself properly, and constantly gets poo stuck on himself no matter how much I trim and any time I touch lower then his ribs he loses it. Any ideas to why he could be like this or is he just not a nice cat?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Reindeer-6648",
            "body": "PLEASE HELP! ADVICE NEEDED!\n\nhttps://preview.redd.it/0fnbhycb8toe1.jpeg?width=1242&format=pjpg&auto=webp&s=eb7b05d44903ed8a3b010632587cdd9ac4efb395\n\nHi! My kitty, Benny, (black and white boy on the right) has FPV and seasonal allergies, I’ve been thinking of starting him on lysine to help relieve some of his frequent respiratory upsets. My concern is that about three years ago he went into acute liver failure and it was BAD. He lost ten plus pounds, has completely yellow anywhere you could see his skin, Ihad to have him on a daily fluid IV, feed him baby food because he wouldn’t eat, and give him constant anti nausea medication. Miraculously he recorded, one day he just starting meowing for his food like he used to after weeks of being on deaths door, he started eating again, put the weight back on, and the pink color returned to his body.\n\nThe reason this worries me is that I’ve seen a couple sources say that there’s a potential risk there because lysine is processed in the liver, and might affect it if he has any sort of damage left over from whatever triggered his first bout with liver failure. I don’t think he or I would be able to handle him going through that again. So I’m wondering if anyone here has any experience with lysine in liver sensitive cats??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dazzling_Bad_1989",
            "body": "Does anyone else's cat sleep with one eye open?? My cat Nemi is about 20 years old and I just noticed today that she sleeps with one eye open. I live in a surban neighborhood and she's been able to come and go as she pleases. I know the saying 'sleep with one eye open' can either be used as a threat or as an intimidation tactic, but she's a cat..Am I perhaps just over thinking this, I've just never seen her do this..Anyone else noticed their cat doing this or something similar?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CreepyCourtney70",
            "body": "Your welcome! Im glad! Little cone babies!! 😻🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepysloth4lyfe",
            "body": "Help! I have a 7 year old male neutered, Russian blue. He has hypothyroidism and is medicated 2X daily. I had him checked for thyroid issues due to change in eating habits, vomiting and keeping us up all night meowing. Well, he is still keeping us up all night. I will play with him a lot during the day. He gets lots of exercise. He has a climbing wall, 3 cat trees, tons of toys and  our other cat to play with. I am at my wits end. I have tried doing a larger meal at night. Calming treats, cat nip, and after speaking to vet we tried melatonin. He is relentless with his meowing. I have tried ignoring him. He just gets louder. I have tried bringing him to bed and snuggling him. I'm losing my mind! I love my boy very much but I am exhausted. Advice?",
            "score": 1,
            "replies": [
                {
                    "author": "CreepyCourtney70",
                    "body": "Well maybe the vet should higher his meds at night....did he ever used to go outside?! Maybe he wants to go outside again....He might just like to meow at night! Some cats do that! Maybe you might want some melatonin so you can relax!☺️😻",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tsunasawada11",
            "body": "Hi guys! Any tips making my cats drink more water...",
            "score": 1,
            "replies": [
                {
                    "author": "No-Coach-4961",
                    "body": "Refill their water bowl daily. Place bowls throughout the house. Try a different water bowl\n\nhope this helps.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "goldencIoset",
                    "body": "Add it to their wet food!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Own_Egg7122",
            "body": "When I was a kid, I used to \"harass\" a bunch of street kitties by putting my face in them. One day my aunt (uncles wife) saw cat fur on my face and spread serious rumours that I drank the cat's milk. People believed it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mzmorrigann",
            "body": "I have a clumsy rescue cat that is forever scratching me not on purpose. Other than claw caps and never considering declawing, what is my other options if any?",
            "score": 1,
            "replies": []
        }
    ]
}