{
    "title": "My cat gave birth to her kittens in my bed while I was asleep",
    "author": "Dreadlord0128",
    "subreddit": "cats",
    "rank": 16,
    "score": 10186,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 125,
    "url": "https://www.reddit.com/gallery/1jdys06",
    "id": "1jdys06",
    "selftext": "I moved her and the babies to a nursery area and she brought them all back one by one. So I guess I’m hands on coparenting 🫡 ",
    "comments": [
        {
            "author": "Jezmebebe",
            "body": "One night, my 7 year old son was sleeping on the couch and I hear him whisper calling me. I go out there to see what’s up and he said his cat was acting weird. I asked where she was and he pointed to between him and the couch. Jezabel was having her kittens partially on him and partially on the couch. I got him out from under her but she was done. She had two little kittens. My son is 30 years old and still talks about that night.",
            "score": 3501,
            "replies": [
                {
                    "author": "grubbinx",
                    "body": "This is such a precious lil story. I love when cats love their lil humans 😭❤️",
                    "score": 1161,
                    "replies": [
                        {
                            "author": "Xe6s2",
                            "body": "She was like Ill keep them with the big kitten!",
                            "score": 660,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FredMist",
                    "body": "I like that jezebel is memorialized in your username.",
                    "score": 89,
                    "replies": [
                        {
                            "author": "Jezmebebe",
                            "body": "Hahaha… well, not exactly. Jezmebebe translates to Just me baby. Something I coined after a nasty breakup. I’ve heard a lot of em but yours was very funny! \nI love it!!!",
                            "score": 54,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ScooberDoobieDoo",
                    "body": "Jezabel is such a funny name, what did she do to deserve that?\n\nhttps://preview.redd.it/nxp7qyjgcgpe1.jpeg?width=1284&format=pjpg&auto=webp&s=b9d26ef79c3fc97116abaa82f55f4dc072d5db92",
                    "score": 414,
                    "replies": [
                        {
                            "author": "Pizza_Cat_Delivery",
                            "body": "Cats are just like that.",
                            "score": 342,
                            "replies": [
                                {
                                    "author": "OrangeJuliusCaesr",
                                    "body": "My kids cat is an absolutely like that.  If I’m home alone she’s all like “pet me, sir.  No you may not walk away from me”\n\n\nIf my kid is home she is like “do we know one another?”",
                                    "score": 101,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "geeknerdeon",
                            "body": "She had to get the kittens from somewhere",
                            "score": 91,
                            "replies": []
                        },
                        {
                            "author": "Jezmebebe",
                            "body": "That wasn’t her first litter of kittens.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "dysteach-MT",
                            "body": "Isn’t that the definition of a cat?",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "aberrantmeat",
                            "body": "Lol we used to have two saint Bernards that were named Jezebel and Delilah. They were the best dogs ever!!! My grandmother and my Catholic school teachers were not fans, but my parents thought it was hilarious.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mochimmy3",
                    "body": "My family dog growing up gave birth on the bed I was sleeping in, I was 6 years old and had a nightmare so I went to sleep with my parents and woke up to newborn puppies nuzzling in my neck and hair as she was giving birth. She refused to go to the nursery/birthing bed my mom had set up. My mom was there supervising the whole time",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Different-Pin5223",
            "body": "That's amazing! She may move them again...you'll just have to trust her instinct and needs. It's beautiful that she wanted to keep them where she can still be near you.",
            "score": 1509,
            "replies": [
                {
                    "author": "stunt876",
                    "body": "Can confirm when my cat had kittens the were under rmy older brothers bed for a day or 2 before my cat dragged each one via mouth to a small cubby hole next to the sofa.",
                    "score": 153,
                    "replies": []
                }
            ]
        },
        {
            "author": "m0rbid_butt3rfly666",
            "body": "Mines did that too 🥲 she was super clingy during and after birth. I think yours feels safer with you as well. Congrats on the grandkids!",
            "score": 1395,
            "replies": [
                {
                    "author": "Dreadlord0128",
                    "body": "Thank you! I feel honored she trusts me this much tbh! 😭",
                    "score": 658,
                    "replies": [
                        {
                            "author": "Zeero92",
                            "body": "If you weren't, I would've gladly informed you how much trust she must have in you to do this. It's *adorable.* <3",
                            "score": 145,
                            "replies": []
                        },
                        {
                            "author": "DurianBig3503",
                            "body": "Name checks out",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jupitermoonflow",
                    "body": "Mine too. I set up a box for her in the closet bc that’s where she was hanging out a lot. But when it came down to it she wanted to be on my bed. We compromised and she gave birth in the box once I put it on my bed for her. I was sitting there with her and at one point I tried to get up to go to the bathroom and literally mid birth she tried to get up and follow me. Poor lady was too scared to do it alone",
                    "score": 69,
                    "replies": [
                        {
                            "author": "catzillaiscoming",
                            "body": "How dare you try to miss out on this wonderful experience she’s sharing with you!!",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GloomyAd2653",
                    "body": "Grand cats!",
                    "score": 49,
                    "replies": [
                        {
                            "author": "kevmastaflex",
                            "body": "Grandkits",
                            "score": 75,
                            "replies": [
                                {
                                    "author": "lampcatfern",
                                    "body": "👍☺️",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bakhtiyark",
            "body": "She believes you're the safest person to be around. What an honour",
            "score": 537,
            "replies": []
        },
        {
            "author": "DurianProper5412",
            "body": "She needed her trusted [human] adult! Also, I am very jealous of your ability to sleep so deeply as to not be woken up 🐱",
            "score": 466,
            "replies": [
                {
                    "author": "Dreadlord0128",
                    "body": "lol, I woke up when she was contracting on her last one. I was shocked! She didn’t make any sounds she just moved around during her contractions.",
                    "score": 363,
                    "replies": []
                }
            ]
        },
        {
            "author": "niftybunny",
            "body": "Congratulations! The amount of trust is off the scale. She loves u!",
            "score": 187,
            "replies": []
        },
        {
            "author": "thought_about_it",
            "body": "The first time it happened to my oldest cat she was pushing with her feet on my side for a while then started going into labor. I’ll always remember the look she gave me that I probably reflected. A mixture of oh shit it’s happening and trust. I walked her over to her corner box I set up earlier for her. She had four healthy babies.",
            "score": 168,
            "replies": []
        },
        {
            "author": "Flat-Limit5595",
            "body": "Give momma some kitten milk, it takes a lot of calcium to feed babies. Also let momma keep kittens were she wants for the day, shes been through a lot.\n\nMy Momma Kiwi a  was super skinny stray and she put all of her effort in the biggest kitten. So watch out for that, she kept trying to relocate herself and son to feed him alone. She didn’t understand we have unlimited resources. She still glares at me when i get too close to him.\n\nhttps://preview.redd.it/g0cmq1yxpfpe1.jpeg?width=3024&format=pjpg&auto=webp&s=fde2c35599eb6efdf5b2d90686829c6c7305bf2e",
            "score": 137,
            "replies": [
                {
                    "author": "hmarieb263",
                    "body": "\"Mine, back off\"",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrandTie6",
            "body": "This is such a compliment that she wants you to help.",
            "score": 94,
            "replies": []
        },
        {
            "author": "Loud-Bee6673",
            "body": "Yep. Coparenting. \n\nSeriously though, that is a lot of trust. ❤️",
            "score": 75,
            "replies": []
        },
        {
            "author": "preciousmetal99",
            "body": "So how did you deal with the blood and all on your bed?",
            "score": 131,
            "replies": [
                {
                    "author": "Darmok-And-Jihad",
                    "body": "Our family cat also gave birth on my bed, way under the sheets where my feet would be. We had to throw out all of the bedding, and there was a very large blood stain on the mattress that we could never get out lol. \n\nI wasn’t there when it happened but was touched nonetheless that she felt the safest place was where my scent was arguably the strongest ",
                    "score": 77,
                    "replies": []
                },
                {
                    "author": "Dreadlord0128",
                    "body": "I took the bedding off and put fresh ones on. There wasn’t a lot of blood actually but she did leave some gross reminisce lol.",
                    "score": 230,
                    "replies": [
                        {
                            "author": "preciousmetal99",
                            "body": "🥲 It's an honor to have a pet give birth on your bed.",
                            "score": 126,
                            "replies": [
                                {
                                    "author": "Dreadlord0128",
                                    "body": "It’s my greatest bragging right tbh. 😂",
                                    "score": 139,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cflatjazz",
                            "body": "Maybe you can get her a baby box (a la Finland) that sits on your bed, maybe with shallow walls and some nice blanket lining, so she can keep them there with you.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NAKnowsNow",
            "body": "Aww, she feels the safest next to you. Congratulations on the new babies!",
            "score": 55,
            "replies": []
        },
        {
            "author": "Ok_Airline_9031",
            "body": "Damn, THAT is trust.",
            "score": 46,
            "replies": []
        },
        {
            "author": "aakaase",
            "body": "That is freaking ADORABLE and warms my heart so much. Soooo cute that she trusts you and wants your help.",
            "score": 40,
            "replies": []
        },
        {
            "author": "Ok_Kaleidoscope5624",
            "body": "Stealth delivery!  How are Mom and Kittens?  Everybody doing well?💕",
            "score": 31,
            "replies": []
        },
        {
            "author": "1998ChevyTaHoe",
            "body": "I love how attached cats are to their owners \n\nYou think they're assholes sometimes but they do this",
            "score": 33,
            "replies": [
                {
                    "author": "re_Claire",
                    "body": "I swear the love between a cat and their owner is something so very deep and special.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "PeachThyme",
                            "body": "Absolutely. When people say they don’t like cats I just feel sorry for them they’ll never feel this kind of love!",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "k-ramsuer",
            "body": "Congrats! She's going to need a lot of extra food, though. I've always had success with Purina kitten chow (get her the Naturals version if she has an upset stomach). You should also think about getting her spayed. Don't let her out, as much as she might want too! I'm assuming she's house trained?\n\nIf money is a concern, look into low cost veterinary care in your area. The kittens are going to need several rounds of vaccines. Also, look into a kitchen scale so you can keep track of their growth. You might want to get a cat bed for your bed, too. That worked with my Trojan cat as a nice compromise (she wanted her kittens in the blankets with me, I was afraid I'd roll over on them).",
            "score": 28,
            "replies": []
        },
        {
            "author": "popdivtweet",
            "body": "Gave birth in the family nest. Adorable.",
            "score": 20,
            "replies": []
        },
        {
            "author": "RichFoot2073",
            "body": "Congrats on your new fur kids",
            "score": 18,
            "replies": []
        },
        {
            "author": "Sewing_girl_101",
            "body": "My mom's cat gave birth on my boyfriend after meeting him for the second time. We were 17 and he had never pet a cat until he met me, so he was very proud to have been chosen",
            "score": 19,
            "replies": [
                {
                    "author": "dhskdk14",
                    "body": "😭😭😭🥹❤️ What an honor and a sign of his character!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Sewing_girl_101",
                            "body": "It is!! He's an amazing guy. We've currently got 4 cats and 5 foster cats, which is impressive to me given that he never grew up with them. My mom's cat could just tell!\n\nETA: here's one of our current fosters who is in love with him\n\nhttps://preview.redd.it/qchh9ax6qipe1.png?width=1080&format=png&auto=webp&s=5ba0e21272714805d96781b68551ed7a72bc4078",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Majestic-Marzipan621",
                    "body": "That's so sweet!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Njbelle-1029",
            "body": "Mine did that too. I woke up in the middle of the night to hear them and their tiny meows in between my husband and I. She was initially a stray that we took in bc my husband got really attached to her. We had a box and everything ready as her birth space, but nope she decided we were her safe space and had them in between us. So congrats on being her must trusted safe space!",
            "score": 18,
            "replies": []
        },
        {
            "author": "bigguccisosaxx",
            "body": "She will need a lot of extra wet food now because milk production burns a lot of calories. Feed her as much as she wants. Do not limit her food for the next 2 months.\n\nOnce kittens are about 5 weeks old get some milk formula for them and mix the food in. Then every time slightly change the ratio of food to formula so by the time they are about 7-8 weeks they will mostly not bother mom for milk anymore.\n\nAlso, immunization shots at 8, 12 and 16 weeks are very important.\n\nMom will likely try to move the kittens to a new location within these few days so try to block off unwanted places with aluminum foil (unless she is one of those cats that really likes the foil).\n\nAlso, don't invite people who have other pets to interact with your kittens for the first 2 weeks. Even if mom is fine with it, they are very prone to upper respiratory infection at this age.\n\nEnjoy your new babies!",
            "score": 44,
            "replies": []
        },
        {
            "author": "frolicndetour",
            "body": "What a surprise to wake up to!  I see a couple of teeny void bbs!",
            "score": 9,
            "replies": []
        },
        {
            "author": "AlphaArc",
            "body": "My mum's cat did the same thing back when I was still living at home. The little lady had 6 kittens and I took one of the kitties with me when I moved out. Rudi is now a big 8 year old baby and his mum lives with my mum ![img](emote|t5_2qhta|7962)",
            "score": 10,
            "replies": []
        },
        {
            "author": "Kind-Phone69",
            "body": "wow that's amazing![gif](emote|free_emotes_pack|heart_eyes), now you have a lot of kitten sweet babies around u lovely and pleasant home.  \nI also have a cute cat![img](emote|t5_2qhta|7952)",
            "score": 8,
            "replies": []
        },
        {
            "author": "EnycmaPie",
            "body": "That's a great honour. The cat felt that your bed was the safest place to give birth.",
            "score": 8,
            "replies": []
        },
        {
            "author": "stonkfrobinhood",
            "body": "Love how, in the second picture, she's gone on a well-deserved snooze, and you're on the clock.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Akavinceblack",
            "body": "Ours had hers in the dog bed.  The dog was confused.",
            "score": 7,
            "replies": []
        },
        {
            "author": "InTheBinIGo",
            "body": "That's sweet. Good luck with the kitties. I'm surprised about the cultural (?) differences about spaying/neutering. Where I'm from it's pretty much assumed your cat should be spayed. But at the same time I think microchips are mandatory too?",
            "score": 8,
            "replies": []
        },
        {
            "author": "Yourgirl_irLx",
            "body": "She must have felt your bed was the safest haven for her precious babies.",
            "score": 5,
            "replies": []
        },
        {
            "author": "WexMajor82",
            "body": "She feels safe with you, that's guaranteed.",
            "score": 7,
            "replies": []
        },
        {
            "author": "OkCryptographer8625",
            "body": "![gif](giphy|he0W8JEmFZL43nkpHx|downsized)\n\nYou soon coparenting those kittens 😂😍👏",
            "score": 6,
            "replies": []
        },
        {
            "author": "Few-Entertainer7431",
            "body": "Why is your cat not spayed?",
            "score": 12,
            "replies": []
        },
        {
            "author": "CherryKisses23",
            "body": "awwnnn, that's really sweet she must really trut you sm to bring her kids to your personal space even after you moved them to the nursery congratulation on your new grandkids",
            "score": 4,
            "replies": []
        },
        {
            "author": "ravingrose73",
            "body": "That's just sweet, Congrats to Mom and you",
            "score": 4,
            "replies": []
        },
        {
            "author": "labontefan69",
            "body": "Aw, she knew they’d be safe with you! Congratulations Mama Kitty ❤️",
            "score": 5,
            "replies": []
        },
        {
            "author": "1491Sparrow",
            "body": "Who's bed?",
            "score": 4,
            "replies": []
        },
        {
            "author": "re_Claire",
            "body": "Congratulations on being a coparent to her teeny little babies! How beautiful that she trusts you so much and wants you to help keep them all safe and loved. 🥰",
            "score": 5,
            "replies": []
        },
        {
            "author": "Tanesmuti",
            "body": "See if she’ll let you put the kittens in some sort of basket, or some sort of pet bed with sides on it, and leave that on the bed. Just to ensure the kittens are somewhat contained for safety. Otherwise, get some spare pillows and blankets to sort of build walls around them. \n\nYou can also move whatever birthing area you had prepared to right next to your bed and hopefully she’ll move them there herself after a few days. She wants the kittens close to you, so you’re clearly her safe space.",
            "score": 4,
            "replies": []
        },
        {
            "author": "frozenAuzzie",
            "body": "Allowing your cat to have kittens is super unethical. Every day thousands of cats are killed because of over population",
            "score": 11,
            "replies": []
        },
        {
            "author": "1491Sparrow",
            "body": "Whose bed?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Punkme_Talliah",
            "body": "Looks like she trusted you with the ultimate safe space! 🐾❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "gthhj87654",
            "body": "Had a similar experience as a kid, except it was in a tent. We allowed her to say in there until the floor started roting",
            "score": 3,
            "replies": []
        },
        {
            "author": "trollanony",
            "body": "My cat had babies and I would bring them to the bed and she would go drop them off the bed or bring them under the bed and come cuddle with me by herself lol she was fed up around 4 weeks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kflynn1337",
            "body": "Shows how much she trusts Op..",
            "score": 3,
            "replies": []
        },
        {
            "author": "bubblesmax",
            "body": "She maybe wanted to show them off to you when you woke up and was too tired to wake you",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kernowek1066",
            "body": "Awwwwww. My childhood cat also gave birth to hers in my bed. It’s so beautiful that they trust us that much",
            "score": 3,
            "replies": []
        },
        {
            "author": "kattko80-",
            "body": "She chose a place where she knew her little ones would be safe! You should feel so honored 😊 I'm really jealous and glaring at my neutered cat",
            "score": 4,
            "replies": []
        },
        {
            "author": "kittymcfyfe",
            "body": "That's her bed now ❤️❤️❤️ and that's so adorable she loves you so much to share them with you xx",
            "score": 2,
            "replies": []
        },
        {
            "author": "_l_Eternal_Gamer_l_",
            "body": "You are the safe space",
            "score": 2,
            "replies": []
        },
        {
            "author": "lickthemagaindeacy",
            "body": "That’s beautiful! She’s trusted you and felt safe there. It’s a mess, but beautiful!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eastern-Drag1639",
            "body": "Feel honoured because your bed was deemed to be the safest place in the world for her to have her kittens. Your shared mothering nest.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NegaDeath",
            "body": "There is no higher honor than an animal trusting you with its babies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ajhedges",
            "body": "Never before have I gone to sleep with one cat and woken up with four",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gerebc",
            "body": "How hard is it to get your pet spayed?",
            "score": 2,
            "replies": []
        },
        {
            "author": "iWillNeverBeSpecial",
            "body": "When my cat gave birth it was 4am and she was under my sister's bed who freaked out, then she went under my bed so I was like fuck it and went to watch TV, where she followed me to the kitty birthing box we made for her downstairs to give birth in\n \nSo yeah she wanted to be by her favorite human",
            "score": 2,
            "replies": []
        },
        {
            "author": "Christ_I_AM",
            "body": "If that ain't trust, idk what is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tooawesomeforthis0",
            "body": "Surprise, grandma!",
            "score": 3,
            "replies": []
        },
        {
            "author": "eat1more",
            "body": "I think your trying to frame the cat 🧑‍⚖️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Court_monster-87",
            "body": "Awww 🥰. Not telling you what to do but if it were me I would find a shallow box and put the kitties in there so they don’t risk falling off your bed while you and mama are away. Hopefully she won’t move them out of it. Congrats on your new little additions. ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "NetIllustrious",
            "body": "When I was 6 or 7 my beloved kitty Annabelle chose MY bed to give birth on. I remember feeling sad because my pink Barbie comforter was ruined but also honored that she chose my bed. I still think about it all the time and even now at 31 I swear it’s what catapulted my life long love of kitties. I’m now in the rescue business, have fostered 7, and have 2 fur babies of my own. I owe it all to my sweet girl Annabelle choosing my bed as her safe space",
            "score": 1,
            "replies": []
        },
        {
            "author": "k-boots",
            "body": "She trusts you so much!! 🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mjukplister",
            "body": "You have to move out , or co sleep\n. Congratulations",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive-Fee-7131",
            "body": "Aww too cute I remember when I was my cats midwife lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious_Tip_3450",
            "body": "Damn buddy you can sleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious_Tip_3450",
            "body": "Damn buddy you can sleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "indiR101",
            "body": "This is the cutest thing I have ever seen!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ooooooooono",
            "body": "How many kittens?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anonyma53",
            "body": "Set up a kitten basket on your bed stand ! This way kittens will be safe from you rolling over onto them.\n\nCongrats on your little potats ! I went through that a couple of years ago with my Cocoa and it was very bried. Enjoy them while they are smol!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SisterAlarmed",
            "body": "biggest compliment you could ever get maximum trust from your kitty <3",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_like_to_ghost",
            "body": "Void babies ![img](emote|t5_2qhta|7952)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Designer-Mirror-7995",
            "body": "HUGE show of trust!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SentaDR",
            "body": "She believes your bed is the safest and best place for her babies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "letscheerstothis",
            "body": "so cute! my cat did the same thing but RIGHT NEXT TO ME lol i woke up to the kitten meowing and i look down to my right and boom shes there next to my hip xD congratulations on being a grandma lol! that cat loves and trusts you so much",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swimming-Sand6166",
            "body": "She must really trust you .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medium_Cell_1657",
            "body": "This happened to me when I was 4 or 5.",
            "score": 1,
            "replies": []
        },
        {
            "author": "imanpearl",
            "body": "Aw, she really trusts you. I had a sweet and funny moment with my mama cat. She had her own little nursery, and one of the kittens kept bullying the others. She wouldn’t stop putting that kitten in my bed. I felt like she was saying, “I don’t want this one bullying my babies, I know you can take care of it.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "stillh20gal",
            "body": "Humm a mix of Awww cute and eeew, sort of.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wanh3da0418",
            "body": "Aww!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crxstallwashere",
            "body": "She gave you a surprise from your nap (she's super cute and so is her minis)",
            "score": 1,
            "replies": []
        },
        {
            "author": "flagphilosofur",
            "body": "God Bless your new little furry family",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdImaginary4291",
            "body": "Everytime my cats went into labor when my sister was there they had them in my bed or under my pillow. They always got pregnant at the same time. So my bed became kitten central.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kittensmittens27",
            "body": "That is so sweet! She knows it’s a safe place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happy_TMH2009",
            "body": "Congratulations on being a fur-grandparents 🥳❤️🎉",
            "score": 0,
            "replies": []
        },
        {
            "author": "ggnell",
            "body": "Such an honour 🥰",
            "score": 0,
            "replies": []
        },
        {
            "author": "xapros_smp",
            "body": "You're a grandma now! Congrats!",
            "score": 0,
            "replies": []
        },
        {
            "author": "False-Definition15",
            "body": "Lowkey kind of gross though 🤢 wouldn’t there be a ton of fluid from birthing where you’re sleeping?",
            "score": -9,
            "replies": [
                {
                    "author": "k-ramsuer",
                    "body": "My COVID Trojan cat did this. As long as you wash things ASAP and have a mattress protector, it's all salvageable. You just have to convince a very annoyed cat that you really need to change the sheets",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "JaneMcBeige",
                    "body": "That happened to me once as well and yes, there's a lot of fluid between each birth + placenta. The blanket was salvageable, surprisingly\n\nhttps://preview.redd.it/cskini3vxfpe1.jpeg?width=4640&format=pjpg&auto=webp&s=04fc3200d38b38c7cbb42eee6875a67ad7920f2b",
                    "score": 2,
                    "replies": [
                        {
                            "author": "JaneMcBeige",
                            "body": "Also maybe it's not possible to see but she delivered five kittens throughout the night. I woke up midway through the third",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChampionshipOld5063",
            "body": "You have to be careful with that. They can attach to you instead of the kittens. And they’ll refuse to take care of them.",
            "score": -4,
            "replies": []
        }
    ]
}