{
    "title": "My baby fighting 2! types of rare cancer",
    "author": "Substantial_Tea8292",
    "subreddit": "cats",
    "rank": 9,
    "score": 1372,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 28,
    "url": "https://i.redd.it/5zrzns106ipe1.jpeg",
    "id": "1jee2ta",
    "selftext": "This is Bacon! Over the last year she’s been diagnosed with two incredibly rare types of cancer: intestinal mast cell and ocular lymphoma. I’ll skip the very long story of how we got here but essentially she now has one eye (bc of the eye cancer) and is on chemo for the tummy cancer. She has baffled all of her specialists and none of them really understand much about her conditions bc there’s such limited research on it. The shortest lifespan expectancies for her are as bad as two months but we expect she’s already been fighting mast cell for about 1-2 years (medicated for the last 6 months). Her mast cell treatment is going well and the chemo seems to be working which is wonderful (remission isn’t possible but we’re just going to help her keep fighting for as long as possible). The eye is another story. We removed the one that was too far gone and now her “good” eye is showing some inflammation and there really doesn’t seem to be much we can do since she can’t be on two chemos at once. She’s on all the eye drops possible so we’re just hoping to keep it healthy for as long as we can. Anyway, if you have a pet with either of these diseases I’d love advice as her journey has been so complicated. If not, take this as your sign to get your pet treated for even the most minor things as soon as possible because our vet ignored her issues for many many many months and this led to unnecessary complications. ",
    "comments": [
        {
            "author": "ange7327",
            "body": "Bless her, wishing you all well x",
            "score": 37,
            "replies": []
        },
        {
            "author": "LushTwirl3",
            "body": "![img](emote|t5_2qhta|7949)![img](emote|t5_2qhta|7944)",
            "score": 11,
            "replies": []
        },
        {
            "author": "Frederickzy",
            "body": "May god help your cat. 🙏🏻✝️",
            "score": 6,
            "replies": []
        },
        {
            "author": "Beneficial_Sun5302",
            "body": "Sending love ❤️ ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Trick-Background9712",
            "body": "Wish you all the best!",
            "score": 3,
            "replies": []
        },
        {
            "author": "WillingnessNice9882",
            "body": "Poor baby. Wish you the best!",
            "score": 3,
            "replies": []
        },
        {
            "author": "FarhadTowfiq",
            "body": "Dear Bacon, wish you all the best <3",
            "score": 3,
            "replies": []
        },
        {
            "author": "Meiily_x",
            "body": "Ohw she’s so strong!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Antgodd1",
            "body": "My cat tippy also had 2 types of cancer, she lived for about 6 months after we found out, then passed away!",
            "score": 3,
            "replies": [
                {
                    "author": "Substantial_Tea8292",
                    "body": "Sorry for your loss!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gotkube",
            "body": "😢❤️❤️❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "ladyylithiumm",
            "body": "Sending blessings:,)",
            "score": 2,
            "replies": []
        },
        {
            "author": "b3nku",
            "body": "Wah un guerrier abuser bon courage et rétablissement 👌",
            "score": 2,
            "replies": []
        },
        {
            "author": "hatecriminal",
            "body": "Your cyclops is adorable",
            "score": 1,
            "replies": []
        },
        {
            "author": "gigizai",
            "body": "sending love 🫶🫶",
            "score": 1,
            "replies": []
        },
        {
            "author": "Horror_Box_3362",
            "body": "🙏🙏🙏",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSlashEffect",
            "body": "Sending love to the little gal 🙏 I wish nothing but the best to both of you",
            "score": 1,
            "replies": []
        },
        {
            "author": "carnelianPig",
            "body": "you can do it baby!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Week_8937",
            "body": "My brother's kitty has had mast cell tumours on his face for at least three or four years now and it's inactive unless it gets triggered. Doesn't seem to cause him any trouble, all his medical issues are from him being 15.\n\nMast cells are strange like that, and I wish your baby all the luck in fighting the cancer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seeamonstress",
            "body": "Good luck baby Bacon!! I’m so sorry for your hardships 🥺",
            "score": 1,
            "replies": []
        },
        {
            "author": "Objective-Minute6492",
            "body": "You got this bacon 💪",
            "score": 1,
            "replies": []
        },
        {
            "author": "Doctor-Delusion",
            "body": "# Chlorambucil (alone or in combination with cortical steroids) may be a good maintenance option for both GI and ocular lymphoma and mast cell tumors. not sure what current treatment little Bacon is on, but I would at least ask and if your vet is not being helpful it may be wise to consult a veterinary oncologist. Our pug Jack and our cat Silas both battled similar cancers and while they are incurable you can sometimes buy your pet months or even years of good quality life. The one thing I would urge you to do is remember that Bacon cannot make decisions, so unfortunately we are the ones who need to make the hard decisions, including when the symptoms of disease/treatment are robbing a pet from a good quality of life. One of my greatest regrets is that I let our poor cat Silas suffer far too long because I was unwilling to let him go, but ultimately it would have been far more humane if I had stopped subjecting him to treatments and tests while he was still relatively healthy, so by all means work to help Bacon live the longest and happiest life possible but also be prepared to let go if you seem him suffering and you will eventually be thankful for your decision. All the blessings and good will to you and Bacon",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big-Dr-Chrisulous",
            "body": "Sending prayers and best wishes to Bacon",
            "score": 1,
            "replies": []
        },
        {
            "author": "gaz61279",
            "body": "Poor girl ☹️ Give her a hug from me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Recognition-2918",
            "body": "Praying for your little baby!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ihamushi",
            "body": "wish her all the best!! 🫶🏻🩶",
            "score": 1,
            "replies": []
        }
    ]
}