{
    "title": "What should be made out of the relative success of Bundnis Sarah Wagenknecht” in Germany?",
    "author": "neuroticnetworks1250",
    "subreddit": "Marxism",
    "rank": 498,
    "score": 2,
    "upvote_ratio": 0.56,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Marxism/comments/1dc0xbh/what_should_be_made_out_of_the_relative_success/",
    "id": "1dc0xbh",
    "selftext": "Despite being a party formed in Jan 2024, it has grown as an alternative to Die Linke in Eastern Germany, as evidenced by their popularity in the EU exit polls. The party seems to be Pro Palestine, pro industry, socialist (at least left to most social democratic parties) in economic policies and nostalgic about DDR (German Democratic Republic), yet were against Covid 19 vaccines, pro migration control etc. \nShould the party be seen as another PatSoc degeneracy or does it show the way to progress as a socialist party? ",
    "comments": [
        {
            "author": "AffectionateStudy496",
            "body": "It's \"left-wing\" conservatism and nationalism that has nothing to do with correctly criticizing capitalism. \"Fiscally liberal, but socially conservative\". She criticizes left-wing identity politics obsessed with racism, homophobia, and sexism only to counter it with a conservative nationalist workerist identity politics. They blame immigrants for bad conditions instead of the capitalists and landlords. They portray German workers and capitalists as having more in common than German workers with immigrant workers because of language, history, values and customs. It's tepid social democracy that argues for a few national social welfare programs while blaming foreigners. Her cries about \"neoliberalism\" are also suspiciously similar to the fascist complaint about \"world jewry\" without saying Jews. The idea is that \"internationalist leftists who criticize nationalism and racism and greedy raping finance capitalists who want open borders for capital and labor constitute a new class of neoliberals who are rootless, cosmopolitan and have no respect for the good hardworking german who loves his country and community.\" I.e. the judeo-bolshevism/cultural Marxism crap. Even her distinction between productive \"real\" economy and greedy finance capital is a classic fascist criticism.\n\nVery opportunistic: \"the workers believe in some really dumb shit, so we should too!\"\n\nGroups Against Capital and Nation has a three part article criticizing her book. Gegenstandpunkt also has a few in depth articles shredding her arguments to pieces. (It's in German, but the translate feature  in Chrome does fine)",
            "score": 24,
            "replies": [
                {
                    "author": "Efficient_Wall_9152",
                    "body": "History, language, values and customs are important for a culture and its people, more so than these esoteric ideas of the material conditions which only began to exist after the enlightenment",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AffectionateStudy496",
                            "body": "So what? People think all kinds of stupid things are \"important\". That doesn't mean their ideas about these things are correct, nor that they are beneficial to them.\n\nSpeaking of \"history\", the \"esoteric idea\" of the nation-state itself did not exist until the bourgeoisie and its radical revolutionary enlightenment philosophers gave their ideal a real basis by inciting bloody nationalist  revolutions. It wasn't real until they made it real and organized powerful states that indoctrinate their subjects in what it means to be a people. A huge part of that is a compulsory national education system that teaches the people what it means to be a people. That involves standardizing dialects into an official language so that subjects can know the laws placed on them and so commerce can take place. That means creating \"culture\" by teaching the subjects who and what counts as national figures, poets, artists, war heroes, etc. That means a re-interpretation and systematization of events into a story or narrative that applies to a collective, to \"us\". That means enforcing the idea that people aren't just disparate tribes, religious sects, or classes but are a \"people\". (\"We have made Italy; now we must make Italians.\") It means standardizing what values and customs are considered a part of the \"national soul\". The bourgeois state teaches people to see through national rose-colored lens; it is not some pre-state feature that exists in people themselves.\n\nThe reason \"material conditions\" became a conceptual tool was because during the Enlightenment people finally figured out what science was and that the spooks that held so much weight during the medieval period could no longer hold their ground under the weight of rational scrutiny. Nonetheless, most of the Enlightenment philosophers weren't complete materialists, nor was it true that they had rid themselves of all spooks. They themselves developed the spook of \"the nation.\"\n\nIt was also a major feat of thinking for Marx to conclude that the economic organization is the base of everything else. Marx got the notion of economic base and social superstructure-- the ideas, values, philosophies, ideologies and \"culture\" depend on the way society is organized. If needs are not satisfied, if the production and reproduction of life does not take place, and if there is not leissure beyond mere survival, then \"culture\" does not take place. And we can see how culture takes off as people become less and less concerned with spearing their dinner. He noticed all the kinds of things by which people distinguish themselves and the economic is one of them, but it is the economic that must take place for \"higher spheres\" to exist in the first place. Democracy removes itself from the society it rules in a distinct form from the medieval state which was embedded in society, and this material fact played a part in the way ideology expressed itself.\n\nFascists like Mussolini and Hitler came up with this criticism that Marxism is \"economic reductionism\" because Marx discovered the source of these supposed \"higher values\" in the conflicts and antagonisms of society, the way it is organized. They didn't refute Marx's discovery but instead said, \"so what? We choose feel-good myths! We just heroically decide that the race, the people, the nation are our highest spiritual value!\" It's an irrationalist idealism. Fascists at least have the honesty to admit that; whereas today's bourgeois nationalists pretend it is some rational conclusion they r drawn about the nature of people themselves. The fascists got this criticism from anti-enlightenment counter-revolutionaries. There's no need to go into the origins of this, but I figure it's worth pointing out for anyone who wants to delve into the genealogy of this argument.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Efficient_Wall_9152",
                                    "body": "I’m critical of blind nationalism, but a shared history and culture is important for a people group.\n\nThe various German states share a history and way of seeing the world before becoming Germany. Germany inherits the Prussians, Saxons, Bavarians and others into its identity. Same for Italy. And this goes for outside the West as well. A lot of people in West Asia place importance on their Islamic culture and heritage, and it gives them more meaning and hope than material conditions ever could. Same with the many expressions of Buddhism across East Asia whose diversity I could not do justice in this comment",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AffectionateStudy496",
                                            "body": "\"blind nationalism\" -- so many leftists do this with everything, tacking on qualifications and conditions. So blind nationalism that goes too far is bad, but normal critical democratic nationalism is good. Well how \"far\" does it go? It doesn't outright shoot dissidents, but puts them on trial first before locking them away in prison for life!? It doesn't just bomb enemies of the state but tells them it's because freedom and democracy must prevail first? Anyway, this distinction between \"blind nationalism\" and \"patriotism\" leaves the essence of untouched, its inner logic. Both share the same inner core, and that is what we are criticizing. And I can't help but notice that there's nothing revolutionary about nationalism-- it's the ideology everyone is taught in school! It is the ruling ideology. Every politician -- even the most \"neoliberal\" -- share this nationalism. Instead what I notice is that communists who pick up the nationalist cause have abandoned communism, even if they haven't fully purged themselves of its memorabilia yet.\n\nLeftists often say the same with capitalism: \"oh, it's not capitalism, but greedy turbo financialized neoliberal capitalism.\" \"It's not capitalism that's the problem, but unregulated capitalism.\" \"It's not capitalism, but monopoly capitalism.\"\n\nThis isn't a criticism of capitalism, but its defense.\n\nIt's not the thing itself that sucks, but only a deviation from it. The ideal of it is fine, it's only the deviation from the wonderful ideal that is bad. \n\nOf course nationalism plays up \"meaning and hope\" because ultimately it culminates in nothing but war and sacrifice. It is trying to get people to go along with something that isn't actually in their material interest, so it is presented as a higher duty. And here the fascists were actually much more honest and consistent than their liberal-democratic counterparts. They didn't advertise their nationalism with the bourgeois-liberal lie that the nation was going to provide for your individual happiness and well-being, that it was about satisfying needs through consumerism. They just said, \"no, life is a deadly struggle and anyone who makes their support of \"their\" nation, of \"their\" people,  conditional on whether it benefits them or not is a traitor, a filthy materialist who doesn't belong and is a threat to our harmony! This lack of commitment shows nothing but how unfit you are to belong to such a wonderful collective!\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TadpoleNo694",
            "body": "I am german and Sarah Wagenknecht is saying Like Peace yay but she‘s willig to pay The price of Ukraine totally going to Putin. She also is extremely against immigrants. Every political opinion she has she has only to get her popularity and power",
            "score": 8,
            "replies": []
        },
        {
            "author": "-Buddy_Rough-",
            "body": "The proof is in the pudding. If their goal is socialism and they are making progress towards that then they are doing good. As long as they are not punching down on immigrants and instead blaming mass immigration on imperialism than I have no problem with their stance.",
            "score": 0,
            "replies": []
        }
    ]
}