{
    "title": "Article: Soviet Planning Demystified",
    "author": "acnemom",
    "subreddit": "Marxism",
    "rank": 477,
    "score": 18,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Marxism/comments/1dt78t0/article_soviet_planning_demystified/",
    "id": "1dt78t0",
    "selftext": "Across the left-wing political spectrum, the Soviet Union is often viewed as the prime example of a planned economy. However, despite the fascination with its perceived success, it is rare to find leftist political figures who possess a deeper understanding of how resources were actually allocated. The planned model is often dismissed as simply deciding the allocation of resources through \"rational\" means, without much consideration of how this rationality can be determined. A notable example of this is Hakim’s response to Economics Explained's video on the Soviet economy. Throughout the video, Hakim not only makes several factual mistakes (such as stating that only around 10,000 products were centrally planned) but he also fails to provide any clear and concise explanation of how exactly a plan could be formulated. Instead, he only asserts that plans are formulated for “political reasons,” which, if anything, would indicate the superiority of a market system with its clearer monetary incentive system driven by market signals. The goal, then, is to offer an informal introduction to the primary concepts of mathematical techniques — specifically Linear Programming — that emerged during the 1960s and 70s for formalizing plans and allocating resources.\n\n[Read the full article on the RTSG Substack](https://www.rtsg.media/p/soviet-planning-demystified), and feel free to leave your thoughts below.",
    "comments": [
        {
            "author": "AffectionateStudy496",
            "body": "\"Without market prices, it would appear that any economic plan would lack rationality because there would be no monetary calculation to guide proper allocation.\"\n\nSuch a circular assumption. The first lie of bourgeois economics that Marx criticizes is that money is some rational means of allocating useful items to satisfy needs. \n\nSee: https://libcom.org/article/critique-bourgeois-science-microeconomics-explanation-value-invention-marginal-utility\n\nCorrectly calculated, wrongly thought: on the abuse on mathematics, specifically in economics\n\nhttps://critiquebourgeoisscience.medium.com/correctly-calculated-wrongly-thought-gegenstandpunkt-d49cb4e29d47\n\n\nThese two chapters are also helpful:\n\nhttps://en.gegenstandpunkt.com/books/chapter-l-how-correct-unplannable-brand-planned-economy\n\nhttps://en.gegenstandpunkt.com/books/chapter-4-planning-levers-review-principles-soviet-economy",
            "score": 4,
            "replies": []
        }
    ]
}