{
    "title": "The Myth Of “Luxemburgism”",
    "author": "None",
    "subreddit": "Marxism",
    "rank": 455,
    "score": 22,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/Marxism/comments/1e0hlhz/the_myth_of_luxemburgism/",
    "id": "1e0hlhz",
    "selftext": "[https://libcom.org/article/myth-luxemburgism](https://libcom.org/article/myth-luxemburgism)\n\n...\n\nThere has been confusion over Luxemburg’s stances ever since she was brutally tortured and murdered by the proto-Fascist Freikorps. Some consider her to be a Left Communist, some paint her as a Leninist, and some have even argued that it was possible she wasn’t even a Marxist at all. \\[1\\] Nevertheless, this persistent uncertainty over her “ideology” has sparked many debates and discussions in Marxist groups.\n\nMore “Libertarian-leaning” Marxists like to assert that Luxemburg was a Council Communist. This view is quite ahistorical and confuses words with substance, as one of the main sources of this claim happens to be Luxemburg’s aggressive insistence of Workers’ and Soldiers’ Councils, exemplified by her 1918 pamphlet, “What Does The Spartacus League Want?”, where she raised “political and social” demands, such as:\n\n“2. Elimination of all parliaments and municipal councils, and takeover of their functions by workers’ and soldiers’ councils, and of the latter’s committees and organs.\n\n3. Election of workers’ councils in all Germany by the entire adult working population of both sexes, in the city and the countryside, by enterprises, as well as of soldiers’ councils by the troops (officers and capitulationists excluded). The right of workers and soldiers to recall their representatives at any time.\n\n4. Election of delegates of the workers’ and soldiers’ councils in the entire country to the central council of the workers’ and soldiers’ councils, which is to elect the executive council as the highest organ of the legislative and executive power.”\n\nIn the very same piece, Luxemburg says that “The Spartacus League is not a party that wants to rise to power over the mass of workers or through them.” This is taken as a rejection of Vanguardism and the Party-form and hence the claim that Luxemburg was a Councilist is “substantiated.” However, this is completely erroneous and ignores so much historical and theoretical nuance, that only through ignorance can this conclusion be reached.\n\nFirstly, we must define what a Vanguard is. Simply put, a Vanguard is an organization of socialists, usually taking the form of a Communist Party. At least, this is the way Luxemburg most commonly used the word, calling the Social-Democratic Party of Germany “the organised vanguard of the German industrial proletariat” and “the strongest vanguard troop, \\[…\\] the thinking head of the International.” Otherwise, Vanguardism can refer to a belief that a revolutionary organ of the most class-conscious communists should be at the helm of the revolution, helping the masses direct their forces along socialist lines and invigorating them through intellectual stimulation. The degree of centralism the Vanguard is built with depends on the contemporary conditions, but according to Luxemburg herself, “it is undeniable that a strong tendency toward centralization is inherent in the Social Democratic movement.” \\[2\\]\n\nGenerally, as well, Luxemburg was not only a prominent member of the biggest Socialist Party in the world, but she herself also founded and led a Communist Party in both Poland and Germany — the Social Democracy of the Kingdom of Poland and Lithuania (SDKPiL for short) and the Communist Party of Germany (KPD) respectively. It would be quite illogical for someone who accepted Vanguardism and directly participated in Parties and elections until the very end of her life to be a Council Communist, which rejects Parliamentarianism and Vanguardism. \\[3\\] Regarding the declaration that the Spartacus League was not a Party, this is completely true — it never was. It was an inter-party opposition of the Linksradikale which started as “the Group International,” first allied with SPD but then a part of the USPD (independents). The Spartacus League was dissolved and joined the Communist Party of Germany, co-founded by Luxemburg herself, who drew up its program.\n\n...\n\nAnother myth surrounding Luxemburg’s “libertarianism” is that she “opposed Lenin” and hence was anti-authoritarian. Not to mention how inaccurate this declaration is, Luxemburg certainly cannot be faulted for “anti-authoritarianism” deduced from a few out-of-context passages in her “The Russian Revolution.” As a matter of fact, she was much more authoritarian (a word that is so misused and misunderstood, that it had become completely useless to Marxists even in Marx’s time) than Lenin or Trotsky on some issues, like the National Question or the Agrarian Question. Not only that, but Luxemburg was known to be an iron-willed leader in her own Party, the SDKPiL, and certainly demonstrated the ability to overrule the majority if she felt that her position was more in line with Scientific Socialism:\n\n“Luxemburg and Leo Jogiches, the leaders of the Polish party, made the decision to break off the unity negotiations with the RSDLP on their own, without consulting their membership. This led to a bitter feud within the SDKPiL, in which Luxemburg sidelined Cezaryna Wojnarowkaya — a founder of the party who advocated closer relations with the Russian party. This was one of many signs to come of the extent to which Luxemburg exerted centralized control over the SKDPiL.” \\[7\\]\n\nShe was known for advocating the suspension of members from the Party if they deviated from the line extremely, challenging the notion that she upheld the bourgeois notion of “free speech.” In her view, the ability to express a different opinion was a vital part of the intellectual life of the Party, however, if this took the form of sabotage, disruption, or anything along those lines, she was ready to take extreme decisions and suspend membership.\n\nLuxemburg also warned against taking the will of the majority as a sign of correct policy, which disproves many people’s perception of her as an ultra-democratic figure, who valued it as a virtue:\n\n“Woe to the Social-Democratic party that should ever consider this principle \\[of legitimate majority rule\\] authoritative. It would be equivalent to a death sentence on Social Democracy as a revolutionary party.” \\[8\\]\n\nIn her famous polemic against self-determination, Luxemburg includes “democracy” as something that shouldn’t be viewed uniformly, or as eternally true and correct:\n\n“Dialectic materialism, which is the basis of scientific socialism, has broken once and for all with this type of “eternal” formula. For the historical dialectic has shown that there are no “eternal” truths and that there are no “rights.” … In the words of Engels, “What is good in the here and now, is an evil somewhere else, and vice versa” — or what is right and reasonable under some circumstances becomes nonsense and absurdity under others. Historical materialism has taught us that the real content of these “eternal” truths, rights, and formulae is determined only by the material social conditions of the environment in a given historical epoch.\n\nOn this basis, scientific socialism has revised the entire store of democratic clichés and ideological metaphysics inherited from the bourgeoisie. Present-day Social Democracy long since stopped regarding such phrases as “democracy,” “national freedom,” “equality,” and other such beautiful things as eternal truths and laws transcending particular nations and times. On the contrary, Marxism regards and treats them only as expressions of certain definite historical conditions, as categories which, in terms of their material content and therefore their political value, are subject to constant change, which is the only “eternal” truth.” \\[9\\]\n\nTherefore, it is abundantly clear to anyone who seriously studies Luxemburg that she was no “democrat” or “libertarian,” let alone a Left Communist. It can be concluded with certainty that Luxemburg’s ideas were far from Council Communism of the time. It isn’t surprising that she advocated for workers’ councils — so did the Bolsheviks, as the word Soviet means nothing but a council (“All power to the Soviets!”). The question, however, revolves around who directs these councils, the Party that connects and organizes them all (i.e. a Vanguard), or the council members themselves, independently and decentrally (we shall not spend any time reaffirming Luxemburg’s hostility towards decentralization, anarchism or syndicalism, which is self-evident to anyone who has seriously engaged with her works)? Luxemburg obviously went with the former option, allying her stances much closer with the Bolsheviks than perhaps even she herself could’ve anticipated.\n\n...\n\nLuxemburg as an anti-Leninist figure has been propagated both by Council Communists and surprisingly even self-described Leninists as well (we shall touch upon this in the section on “Luxemburgism”). For instance, her famous “Organizational Questions of the Russian Social Democracy” is unfortunately and erroneously also known as “Leninism or Marxism?” — a title which doesn’t belong to Luxemburg, but a group of anti-Leninist Council Communists. It appeared first in 1935 as “Leninism or Marxism?” printed by the “Anti-Parliamentary Communist Federation” based in Glasgow, and this name caught on and was gladly used by anti-Bolshevik supporters of Luxemburg.\n\nOne more common mistake is measuring Luxemburg’s Marxism against Lenin, who serves as the axis of “correct Marxism” to some:\n\n“It is also important not to read the relationship between Luxemburg and Lenin in light of the political narrative that prevailed in the decades after their death. \\[…\\] I am also referring to the tendency to read Luxemburg (as well as many other radical figures) in light of Lenin, as if he were the arbiter and measure of Marxist probity (or perfidy). This is understandable given Lenin’s stature in leading the 1917 Bolshevik Revolution and the subsequent global emergence of “Marxist-Leninist” ideology, but it makes little sense for the period in which they lived, since before 1914 Luxemburg was far better known (and more highly regarded) in the international socialist movement than Lenin.” \\[11\\]\n\nWhen it comes to disagreeing with the Bolsheviks, one must certainly speak about Luxemburg’s famous pamphlet, “The Russian Revolution.” Interestingly, much of its readers miss all the parts where the author clarifies the “errors” of the Bolsheviks as largely being the results of the contemporary, difficult conditions and affirms her support for the movement in general. Let us take a few examples:\n\n“Yes, dictatorship! But this dictatorship consists in the manner of applying democracy, not in its elimination, but in energetic, resolute attacks upon the well-entrenched rights and economic relationships of bourgeois society, without which a socialist transformation cannot be accomplished. But this dictatorship must be the work of the class and not of a little leading minority in the name of the class — that is, it must proceed step by step out of the active participation of the masses; it must be under their direct influence, subjected to the control of complete public activity; it must arise out of the growing political training of the mass of the people.\n\nDoubtless the Bolsheviks would have proceeded in this very way were it not that they suffered under the frightful compulsion of the world war, the German occupation and all the abnormal difficulties connected therewith, things which were inevitably bound to distort any socialist policy, however imbued it might be with the best intentions and the finest principles. \\[…\\]\n\nThe party of Lenin was thus the only one in Russia which grasped the true interest of the revolution in that first period. It was the element that drove the revolution forward, and thus it was the only party which really carried on a socialist policy. \\[…\\]\n\nThe party of Lenin was the only one which grasped the mandate and duty of a truly revolutionary party and which, by the slogan — “All power in the hands of the proletariat and peasantry” — insured the continued development of the revolution. \\[…\\]\n\nWhatever a party could offer of courage, revolutionary far-sightedness and consistency in an historic hour, Lenin, Trotsky and all the other comrades have given in good measure. All the revolutionary honor and capacity which western Social-Democracy lacked was represented by the Bolsheviks. Their October uprising was not only the actual salvation of the Russian Revolution; it was also the salvation of the honor of international socialism.”\n\nAnd so on. The whole pamphlet is filled with the sentiment of solidarity and respect, objectively viewing a struggle for an ideal revolution in less-than-ideal conditions. As the foremost Luxemburg biographer, J. P. Nettl remarked, it’s vital to consider that her writing on the Russian revolution is “based, like so much of Rosa Luxemburg’s work, on a form of critical dialogue, in this base with the Bolshevik October Revolution. Those who are made joyful by criticism of the fundamentals of the Bolshevik revolution would do better to turn elsewhere.” \\[12\\]\n\n...\n\n“The blame for the mistakes of the Bolsheviks lies in the first place with the international proletariat and above all the unprecedented persistent perfidy \\[baseness\\] of German Social Democracy, a party which in times of peace purported to march at the head of the world proletariat, presumed to lecture the whole world, numbered at least ten million adherents \\[followers\\] of both genders and for four years now crucifies, like the venal mercenaries \\[landsknechte, lansquenets\\] of the middle ages, socialism at the behest of the ruling class.” (Rosa Luxemburg, in the Spartacus Letters from September 1918, №11.) \\[…\\]\n\nAt the end of November or early December 1918, a German soldier brought me a small note written in Polish by Rosa Luxemburg to Warsaw, in which she wrote to me as an answer to my message roughly the following:\n\n‘When our party (in Poland) is full of enthusiasm for Bolshevism and at the same time (in a secretly printed pamphlet) has come out against both the Bolsheviks’ Brest peace and their agitation with the slogan of ‘national self-determination’ then it is enthusiasm coupled with a critical spirit — what more could we desire! I too shared all your reservations and doubts but on the most important questions have dropped them and in many cases have not gone as far as you. Terrorism certainly indicates weakness but it is aimed at internal enemies who build their hopes on the existence of capitalism outside Russia and receive support and encouragement from there. If a European revolution comes, then the Russian counter-revolutionaries will not only lose their support but — what is more important — their courage too. In other words the Bolshevik terror is, above all, an expression of the weakness of the European proletariat. Indeed the agrarian relationships \\[in Russia\\] which have been established are the most dangerous, the sorest point of the Russian revolution. But here too the truth holds good — that even the greatest revolution can only accomplish what development has ripened. This sore point too can only be healed through the European revolution. And this is coming!’ \\[…\\]\n\nWhen in December 1918, we moved towards the unification of Polish Social Democracy and the left of the PPS into the Communist Party, we first formulated a programmatic declaration, which we sent to Berlin to Rosa Luxemburg and Leo Jogiches for critical examination, neither found fault with a single word of this draft, and this programmatic declaration published in print, which drew directly on the Russian Revolution, was communist, i.e. it was the opposite of constituent assembly, democracy etc. \\[…\\]\n\nNevertheless, despite the errors and imperfection of the work \\[The Russian Revolution\\], this screed is a revolutionary piece of writing. For Rosa Luxemburg’s critique distinguishes itself from every opportunist critique, in that it never harms the revolutionary cause or the revolutionary party; on the contrary, it only stimulates it — precisely because it is a revolutionary critique. If someone thinks the present pamphlet should’ve been concealed, as it could’ve harmed revolutionary Russia, and that only now was it appropriate for publication, as the Soviet power now allegedly stands strong in the world, they merely prove that they conceive of critique only as opportunistic, revolution- and party-damaging critique; for them, the spirit of Rosa Luxemburg, like the spirit of revolutionary Marxism in general, is a Book of Seven Seals. If a critique harms the revolution or the revolutionary party, well, then it just isn’t a revolutionary critique.” \\[15\\]\n\nThese extracts, coupled with Zetkin’s work, reveal the actual attitude Luxemburg had towards the Bolsheviks: respect, solidarity, and critical support. Not the kind we see today, where the “critical” part of the critical support is completely illusory and nonexistent, but actual support through genuine, friendly criticism. Therefore, one can confidently claim that Luxemburg was certainly no anti-Leninist, nor did she ever oppose the Russian Revolution.\n\n...\n\nTo understand the historical roots of “Luxemburgism,” we must first ask the following: who conceptualized Rosa Luxemburg’s thought and philosophy into one, whole, unified unit? For there to be an -ism, a more-or-less systematic foundation has to exist. Hence, it was first necessary to compile Rosa Luxemburg’s legacy and works into a totality, and the honour of this task befell to none other than the prominent Hungarian Communist, György Lukács.\n\nIn his famous “History And Class Consciousness,” where he devoted a section to “The Marxism of Rosa Luxemburg,” Lukács provided a comprehensive summary of this revolutionary and her philosophy. He ended with the following:\n\n“It is characteristic of the unity of theory and practice in the life work of Rosa Luxemburg that the unity of victory and defeat, individual fate and total process is the main thread running through her theory and her life. As early as her first polemic against Bernstein’s she argued that the necessarily ‘premature’ seizure of power by the proletariat was inevitable. She unmasked the resulting opportunist fear and lack of faith in revolution as “political nonsense which starts from the assumption that society progresses mechanically and which imagines a definite point in time external to and unconnected with the class struggle in which the class struggle will be won”. It is this clear-sighted certitude that guides Rosa Luxemburg in the campaign she waged for the emancipation of the proletariat: its economic and political emancipation from physical bondage under capitalism, and its ideological emancipation from its spiritual bondage under opportunism. As she was the great spiritual leader of the proletariat her chief struggles were fought against the latter enemy — the more dangerous foe as it was harder to defeat. Her death at the hands of her bitterest enemies, Noske and Scheidemann, is, logically, the crowning pinnacle of her thought and life. Theoretically she had predicted the defeat of the January rising years before it took place; tactically she foresaw it at the moment of action. Yet she remained consistently on the side of the masses and shared their fate. That is to say, the unity of theory and practice was preserved in her actions with exactly the same consistency and with exactly the same logic as that which earned her the enmity of her murderers: the opportunists of Social Democracy.” \\[16\\]\n\nLukács argued that Rosa Luxemburg was a consistent revolutionary who dedicated her life to fighting for the proletariat, against the opportunists. Nettl summarized his positions in his biography of Luxemburg:\n\n“Lukács did not deal with Rosa Luxemburg’s work of 1917 as a problem of limited cognition, excusable on account of the particular circumstances, as did Zetkin and Warszawski \\[Warski\\]. He treated Rosa Luxemburg’s ideas as a coherent whole with universal application. So, for the first time Luxemburgism as a system now made its appearance — though not yet under that name. Lukács’ work conceptualized the official, respectful view of Rosa Luxemburg in this period. He also provided a bridge to the future, when Luxemburgism would be acknowledged as a recognized but fallacious system of ideas, first to be ‘paired’ with other deviations like Trotskyism and then to be almost totally confused with them.” \\[17\\]\n\nAfter Lukács’ efforts to offer Luxemburg’s thought as a complete system, there was a possibility to build an -ism around it. Unfortunately, this process took the form of an iconoclasm against “everything Spartacist.” Thus, “Luxemburgism” was invented to purge Luxemburg and her influence from German Communism and make sure her theoretical works were buried deep under. Being a “Luxemburgist” in the 1920s and 1930s meant opportunism and “right deviationism.” The term has its roots in removing Luxemburg’s thought from the foreground and making sure the “Spartacists” didn’t hold influential positions in the Labor Movement.\n\n...\n\n“In Germany, Bolshevisation was used to divide and rule the movement. The power struggle and economic stabilisation created the perfect environment for the rise of the Left, led by Ruth Fischer and Arkadij Maslow. The Left possessed no theoretical training and were extremely hostile to the old theoretical traditions of the KPD, which they considered “remnants of Social Democracy. Bolshevisation was used to defeat the old Spartacists who remained loyal to the theories of Rosa Luxemburg. The Stalinised Comintern pitted the Left and Right against one another and purged the party of all dissent. The party no longer resembled the mass base party that Luxemburg had attempted to build. Luxemburgism was invented as a means of ridding the party of the memory of Rosa Luxemburg. The attacks were partially successful. Luxemburg, the woman and martyr of the Spartakusbund, was rehabilitated. Her theories, however, were not. Crimes and errors were invented in an effort to destroy and possibility of dissent in the various Communist Parties.” \\[23\\]\n\nHere, we clearly get a sight of Luxemburgism’s genesis: an artificial invention opposed to Luxemburg and what she stood for, a political tool to wrap a movement around one’s finger and control it by replacing all the dissenting “Luxemburgists” (now synonymous with a saboteur, provocateur, opportunist, etc) with loyal Party cadre. As power struggles intensified in Moscow, this was reflected in the Austro-Polish-German scene too, already in the process of being Bolshevized. There was an urgent need to create a flexible label to apply to those, who durst go against the Party and show any objections:\n\n“In due course Communist theorists constructed for and on behalf of Rosa Luxemburg a system called Luxemburgism — compounded from just those errors on which Social Democracy relied. The person became increasingly separated from the doctrine-rather like the English notion that the Crown can do no wrong. The fiercer the Communist struggle against Luxemburgism, the greater the attachment to the revolutionary personality of Luxemburg, stripped of its errors. As we have seen, this delicate surgery made Rosa Luxemburg unique in Communist history. \\[…\\]\n\nThe later Communist construction of a Luxemburgist system, for the sole purpose of demolishing it in public, showed that what Rosa Luxemburg imparted to the German Labour movement was sufficiently powerful and pervasive to require systematic demolition. No one else in Germany, not even Kautsky, was elevated to a Communist-created, proprietary ‘ism’. In Russia, only Lenin and Stalin on one side, Trotsky and the Mensheviks on the other, were given such an honour.” \\[24\\]\n\nThus, the whole process of creating “Luxemburgism” was essentially strawman-esque in nature: build something “bad” and then destroy it yourself to showcase your revolutionary spirit and dedication to the correct tenets of Marxism. This was especially true in the department of Political Economy, where Luxemburg had indeed made some errors. But they were overblown and specifically highlighted and showcased as the prime example of what a “Luxemburg follower” had to believe in. Naturally, the purge of “Luxemburgism” followed the official establishment of the accumulation theory in the Soviet Union:\n\n“When the Third International established the existence of a ‘general crisis’ of capitalism as its official doctrine in the late 1920s, ‘Luxemburgism’ was created as a new deviation, associated with all sorts of dangerous thoughts. Even the leading economist of the Comintern, Eugen Varga, was repeatedly accused of ‘Luxemburgist’ thinking by his adversaries. In the guise of ‘Luxemburgism’, Rosa Luxemburg’s economic and political thought became completely distorted, and the official reading of her work was dominated by enumerations of her alleged ‘mistakes’.” \\[25\\]\n\nMuch of what was called “Luxemburgism” was in reality Luxemburg’s critique of Political Economy and her theory of Accumulation, which didn’t go unnoticed: it had dedicated critics both in the ranks of the Communists (most notably Nikolai Bukharin and Henryk Grossman) and the Reformists. But Luxemburg was still an extremely important figure of the Communist movement, so the Third International was extremely careful in erasing her influence and legacy.\n\n...\n\nBut the distinction of Luxemburg/Luxemburgism didn’t last long, for Stalin subjected this brave revolutionary ten folds better than him to scathing criticism, accusing her of first inventing and then agitating the theory of “Permanent Revolution” (an obvious smear and an ahistorical claim we shall discuss shortly). “Luxemburgism” generally meant “Polish Communism” in the socialist vernacular, but for Stalin, “Luxemburgism” was nothing but a Polish version of Trotskyism:\n\n“This, however, was not the kind of analysis in which Stalin was interested — nor was Zinoviev in the years 1923–24, when, in the name of the ‘Bolshevisation’ of the Polish Communist Party, they declared a holy war on Luxemburgism — that is, on the main ideological tradition of Polish Communism. \\[…\\] Stalin considered Luxemburgism as the Polish variety of Trotskyism. This provoked the furor theologicus with which the Comintern set out to crush the Luxemburgist heritage.” \\[28\\]\n\nHe succeeded in purging all the prominent Polish Communists, especially those who still had some respect left for Luxemburg. Rosa Luxemburg was now indistinguishable from Luxemburgism. They were one and the same, a bacillus of syphilis as Fischer had once called it. Kaganovich furthered Stalin’s point and destroyed Luxemburg where Stalin had left her untouched. An intense holy war was declared against her and the Comintern made sure to remove her works, influence and name from every sphere of the revolution. This contributed majorly to her becoming a persona non grata and being forgotten until in the latter part of the 20th century, some Marxist scholars rediscovered her as a thinker.\n\nMary-Alice Waters summarizes Stalin’s criticisms of Luxemburg well:\n\n“How and wherefore, however, did Stalin suddenly busy himself — at such a belated time — with the revision of the old Bolshevik valuation of Rosa Luxemburg? As was the case with all his preceding theoretical abortions so with this latest one, and the most scandalous, the origin lies in the logic of his struggle against the theory of permanent revolution. In his ‘historical’ article, Stalin once again allots the chief place to this theory. \\[…\\]\n\nAfter recapitulating the controversy between the Mensheviks and the Bolsheviks on the question of the moving forces in the Russian revolution and after masterfully compressing a series of mistakes into a few ones, \\[…\\] Stalin indites, “What was the attitude of the left German social democrats, Parvus and Rosa Luxemburg, to these controversies? They concocted a utopian and a semi-menshevist schema of the permanent revolution \\[…\\] Subsequently this semi-menshevist schema was caught up by Trotsky (partly by Martov) and turned into a weapon of struggle against Leninism.” Such is the unexpected history of the origin of the theory of the permanent revolution, in accordance with the latest historical researches of Stalin. But, alas, the investigator forgot to consult his own previous learned works. In 1925 this same Stalin had already expressed himself on this question in his polemic against Radek. Here Is what he wrote then, “It is not true that the theory of the permanent revolution \\[…\\] was put forward in 1905 by Rosa Luxemburg and Trotsky. As a matter of fact, this theory was put forward by Parvus and Trotsky.” \\[…\\]\n\nSo, in 1925, Stalin pronounced Rosa Luxemburg not guilty in the commission of such a cardinal sin as participating in the creation of the theory of the permanent revolution. \\[…\\] In 1931, we are informed by the identical Stalin that it was precisely, “Parvus and Rosa Luxemburg \\[…\\] who concocted the utopian and semi-menshevist schema of the permanent revolution.” As for Trotsky, he was innocent of creating the theory, it was only “caught up” by him, and at the same time by Martov! \\[…\\] The Stalinist falsifications are conscious in so far as they are dictated at each given moment by entirely concrete personal interests. At the same time, they are semiconscious, insofar as his congenital ignorance places no impediments whatsoever to his theoretical propensities.” \\[29\\]\n\nTherefore, Stalin’s criticisms of Luxemburg were not only contradictory, but completely unfounded as well: nowhere had Luxemburg advocated for the theory of Permanent Revolution, nor had she shown her sympathies towards it. Moreover, the only argument for this can be found within Trotsky himself (from My Life, published 1929), but Stalin couldn’t have possibly referred to this, as his initial article predated this erroneous assertion of Trotsky’s by a few years:\n\n“With much later hindsight, Trotsky referred to the affinity of Rosa Luxemburg’s view to his on the question of Permanent Revolution in My Life: “On the question of the so-called Permanent Revolution, Rosa took the same stand as I did.” At the Congress itself he said: ‘I can testify with pleasure that the point of view that Luxemburg developed in the name of the Polish delegation is very close to mine which I have defended and continue to defend. If between us, there is a difference, it’s a difference of shade, and not of political direction. Our thought moves in one and the same materialistic analysis.’\n\nBut Luxemburg had not spoken on the question of Permanent Revolution, which was nowhere on the agenda. There is no doubt that, in speaking about the relationship of Marxists to the bourgeois parties, she was developing ideas of the dialectics of revolution and the role of the proletariat as vanguard.” \\[30\\]\n\nHence, we have to conclude that Stalin was simply lying to besmirch Luxemburg’s legacy. When others pointed out this contradiction, he doubled down and rephrased his points, writing:\n\n“There is no contradiction between the article ‘The October Revolution and the Tactics of the Russian Communists’ (1924) and the ‘Letter to the Editorial Board of Proletarskaya Revolutsia’ (1931). These two documents concern different aspects of the question, and this has seemed to you to be a “contradiction.” But there is no “contradiction” here. \\[…\\] It was not Trotsky but Rosa Luxemburg and Parvus who invented the theory of “permanent” revolution. It was not Rosa Luxemburg but Parvus and Trotsky who in 1905 advanced the theory of ‘permanent’ revolution and actively fought for it against Lenin.” \\[31\\]\n\nThis poor reasoning didn’t absolve Stalin from lying, and he never justified his stance on why he thought Luxemburg had any involvement either in the creation or advancement of the theory of permanent revolution.\n\n...\n\nThe statement that “the murder of Karl Liebknecht and Rosa Luxemburg is an event of world-historical significance… \\[partly\\] because the best people and leaders of the truly proletarian communist international perished tragically” \\[33\\] rings just as true today as it did 100 years ago. Studying Luxemburg, her life, and her works is a vital part of being acquainted with the vast and beautiful world of Marxist thought. It is perfectly valid to observe her mistakes and errors, which could stem from personal shortcomings or the historical background, but it is evident that discarding this monumental figure would devoid Marxism from one of its most creative, talented, and dedicated thinkers.",
    "comments": [
        {
            "author": "None",
            "body": "*Saying that Luxemburgism does not exist is undeniably true.* Still, there are some serious problems I have with this article. \n\nLuxemburg was not a Vanguardist, and your definition of Vanguardism is weak If not utterly facetious.\n\nFundamentally Vanguardism is built on the idea that class consciousness can only come from outside the class, or at least that some political subdivision may only come from outside of the class. \n\n>*Class political consciousness can be brought to the workers only from without; that is, only from outside the economic struggle, from outside the sphere of relations between workers and employers. The sphere from which alone it is possible to obtain this knowledge is the sphere of relationships (of all classes and strata) to the state and the government, the sphere of the interrelations between all classes.* -- Lenin, WITBD\n\nBelieving in the party does not mean that you are Vanguardist. Vanguardist as a label denotes a certain belief about the relationship of the party to the masses that Luxemburg did not hold. She may have seen herself as part of a vanguard, but it was not the vanguard as Lenin professed it. \n\nThe answer to the sad liberalization of Luxemberg is not an equally wrong bolshevization, despite how much the vanguardists would like it to be so.",
            "score": 4,
            "replies": [
                {
                    "author": "None",
                    "body": "The article does not attempt to Bolshevize Rosa. It quite clearly states that she was not a Leninist and disagreed with Lenin/the Bolsheviks on several fundamental issues (National, Agrarian, Organizational). It does state that she upheld Vanguardism in that she considered the Communist Party to be the organised, revolutionary vanguard of the proletariat, but, again, it also clearly affirms that her view of the role of the vanguard differed from the tactics that Lenin/the Bolsheviks pursued.\n\n>Against The Narrative Of A Leninist Luxemburg\n\n>This taken into account, it is just as clear that Luxemburg was not a Leninist. Many have tried to claim so, but this erases her wide range of disagreements and disputes with Lenin and his theories. The accusation of Leninism also ignores the fact “that terms such as “Luxemburgism” and “Leninism” were contrived after their [Luxemburg and Lenin] deaths, which neither probably anticipated.” [10] Besides, anywhere from the self-determination of nations to the organizational methodology, Luxemburg and Lenin took different stances and subjected each other to friendly critique, abundantly making clear their friendship, but also the wide range of their differences.’\n\n>...\n\n>”Yes, dictatorship! But this dictatorship consists in the manner of applying democracy, not in its elimination, but in energetic, resolute attacks upon the well-entrenched rights and economic relationships of bourgeois society, without which a socialist transformation cannot be accomplished. But this dictatorship must be the work of the class and not of a little leading minority in the name of the class — that is, it must proceed step by step out of the active participation of the masses; it must be under their direct influence, subjected to the control of complete public activity; it must arise out of the growing political training of the mass of the people.”\n\n>…\n\n>But does this in itself make her a Leninist? Certainly not. There are still quite a few differences between Luxemburg and Lenin: the National Question, the Agrarian Question, the Organizational Question, etc. The two revolutionaries didn’t see eye-to-eye on these and some other topics even in the very end... Therefore, claiming that Luxemburg was a Leninist or a Bolshevik erases her stark disagreements on different topics...\n\nHowever, despite Rosa’s many lucid criticisms, she continued to support the Bolsheviks and the Russian Revolution to the very end, against ‘the spineless jelly-fish, the moaners, the Axelrods, Dans, Grigoryanz or whatever their name are, who, mouths frothing, sing their plaintive song against the Bolsheviks in foreign lands,’ contextualizing their many mistakes/wrong tactics in the context of their tragic isolation.\n\n>The Bolsheviks have certainly made a number of mistakes in their policies and are perhaps still making them – but where is the revolution in which no mistakes have been made! The notion of a revolutionary policy without mistakes, and moreover, in a totally unprecedented situation, is so absurd that it is worthy only of a German schoolmaster. If the so-called leaders of German socialism lose their so-called heads in such an unusual situation as a vote in the Reichstag, and if their hearts sink into their boots and they forget all the socialism they ever learned in situation in which the simple ABC of socialism clearly pointed the way – could one expect a party caught up in a truly thorny situation, in which it would show the world new wonders, not to make mistakes?\n\n>The awkward position that the Bolsheviks are in today, however, is, together with most of their mistakes, a consequence of basic insolubility of the problem posed to them by the international, above all the German, proletariat. To carry out the dictatorship of the proletariat and a socialist revolution in a single country surrounded by reactionary imperialist rule and in the fury of the bloodiest world war in human history – that is squaring the circle. Any socialist party would have to fail in this task and perish – whether or not it made self-renunciation the guiding star of its policies.\n\n>We would like to see the spineless jelly-fish, the moaners, the Axelrods, Dans, Grigoryanz [5] or whatever their name are, who, mouths frothing, sing their plaintive song against the Bolsheviks in foreign lands. And – just look! – they have found a sympathetic ear in such heroes as StrØbel, Bernstein and Kautsky; we would like to see these Germans in the Bolsheviks’ place! All their superior understanding would rapidly exhaust itself in an alliance with the Milyukovs in domestic policy and with the Entente in foreign policy; to this would be added a conscious renunciation of all socialist reforms, or even of any move in this direction, in domestic policy – all this due to the conscious eunuch wisdom that says Russia is an agricultural country and Russian capitalism is not adequately cooked.\n\n>Such is the false logic of the objective situation: any socialist party that came to power in Russia today must pursue the wrong tactics so long as it, as part of the international proletarian army, is left in the lurch by the main body of this army.\n\n>The blame of the Bolsheviks’ failures is borne in the final analysis by the international proletariat and above all by the unprecedented and persistent baseness of German Social Democracy. This party which in peace-time pretended to march at the head of the world proletariat, which presumed to advise and lead the whole world, which in its own country counted at least ten million supporters of both sexes – this is the party which has nailed socialism to the cross twenty-four hours a day for the four years at the bidding of the ruling class like venal mercenaries of the Middle Ages.\n\n>The news now arriving from Russia about the situation of the Bolsheviks is a moving appeal to what vestiges of honour remain in the masses of German workers and soldiers. They have cold-bloodedly left the Russian Revolution to be torn to pieces, encircled and starve out. Let them now intervene, even at the eleventh hour, to save the revolution from the most terrible fate: from moral suicide, from an alliance with German imperialism.\n\n>There is only one solution to the tragedy in which Russia in caught up: an uprising at the rear of German imperialism, the German mass rising, which can signal the international revolution to put an end to this genocide. At this fateful moment, preserving the honour of the Russian Revolution is identical with vindicating that of the German proletariat and of international socialists.\n\nhttps://www.marxists.org/archive/luxemburg/1918/09/11.htm",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "This article understands very well the misunderstandings others have of Luxemburg. It does not itself understand Luxemburg however, and so it presents a distorted picture.\n\nIt may not be *attempting* to Bolshevize her, but it's understanding is so colored by that of Lenin that it does so inadvertently.\n\n...\n\nHere are my issues: \n\n>*Firstly, we must define what a Vanguard is. Simply put, a Vanguard is an organization of socialists, usually taking the form of a Communist Party.*\n\nThis isn't wrong *on its face*.\n\n>*At least, this is the way Luxemburg most commonly used the word, calling the Social-Democratic Party of Germany “the organised vanguard of the German industrial proletariat” and “the strongest vanguard troop, […] the thinking head of the International.”*\n\nLuxemburg using the word \"vanguard\" does not mean that her beliefs aligned with the program that we referred to \"Vanguardism\", that program associated with Lenin's understanding of class consciousness and method of political organization.\n\n>*Otherwise, Vanguardism can refer to a belief that a revolutionary organ of the most class-conscious communists should be at the helm of the revolution, helping the masses direct their forces along socialist lines and invigorating them through intellectual stimulation.*\n\nLenin's understanding of the Vanguard is predicated on the fact that class political consciousness can only come from outside of the economic struggle, from the lips of those who have lifted themselves to theoretically comprehend the relation of all classes to the state.\n\n>*It would be quite illogical for someone who accepted Vanguardism*\n\nShe did not accept \"Vanguardism\", she accepted the existence of the party.\n\nTo accept \"Vanguardism\" is, from the perspective of Luxemburg, to seriously misunderstand the relation of the party to the proletariat.\n\n>*and directly participated in Parties and elections until the very end of her life to be a Council Communist, which rejects Parliamentarianism and Vanguardism.*\n\nShe is absolutely not a council communist. She correctly believed in the party, as Marx did. *She did not believe in the party as Lenin did.*\n\n...\n\n\"Vanguard\" and \"Vanguardism\" are not the same thing. \n\n\"Vanguardism\" is a specific term used for Lenin's understanding of the vanguard's role. Inadvertent Bolshevization.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "This is a boring and useless debate on terminology. \"Vanguardism\" is not a standardized term set by some international committee. Yes, Lenin said that socialist consciousness comes from outside the class, Luxembourg disagreed. \"Once we know this, our manner of speaking does no harm.\" You are dragging out a purely terminological dispute when you both agree in substance, it's like saying Marx and Lenin disagree on the state because Marx says we will have lower and higher phase communism while Lenin says we will have socialism then communism. \n\nA productive debate would focus on Lenin's concept of socialist consciousness arising from outside the class. This is, of course, a hard sell for Luxembourg, because socialist consciousness did arise from outside the class. Modern socialism was the product of Fourier, Owen, Saint-Simon, etc. Marxism was introduced in Russia by Plekhanov, the revolution was led by Lenin. Marxism was introduced in China in Beijing University circles, the revolution led by Mao. All these are intellectual circles developing theories of socialism, with ruling class individuals bringing the ideas to the masses and becoming leaders of the proletariat.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "\n>*Vanguardism is not a set term*\n\nYes that is in fact how words work. \n\nLet's do a little experiment. Let's look at the first sentence of the Wikipedia article for Vanguardism. We can't get more common than that, right?\n\n(I actually haven't even looked at it, I'm just that confident.)\n\nLet's see: \n\n>Vanguardism, in the context of Leninist revolutionary struggle, relates to a strategy whereby the most class-conscious and politically \"advanced\" sections of the proletariat or working class, described as the revolutionary vanguard, form organizations to advance the objectives of communism.\n\nWow. Turns out I'm psychic!\n\n>*A productive debate would focus on Lenin's concept of socialist consciousness arising from outside the class. This is, of course, a hard sell for Luxembourg, because socialist consciousness did arise from outside the class.*\n\nYou have mistaken the word consciousness for the word knowledge. Consciousness has never been described as a thing that can be brought from outside, that is a nonsensical statement, even ignoring Marxist philosophies and understandings.\n\nConsciousness arises from alienation. The splitting of the human spirit and the rendering of it into commodities.\n\nThis is not a useless debate about terminology. You could only think it is such if you are a Leninist who fails to grasp the humanistic aspects of Marxism. \n\n*Are you really arguing that class consciousness comes from the realm of ideas rather than developing via some material process?*\n\n...\n\n>*It's like saying Marx and Lenin disagree on the state because Marx says we will have lower and higher phase communism while Lenin says we will have socialism then communism.*\n\nYes 🗿🗿🗿",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}