{
    "title": "Looking for Marxist research on improvement in working class living conditions in the UK across the 19th century",
    "author": "oak_and_clover",
    "subreddit": "Marxism",
    "rank": 454,
    "score": 11,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Marxism/comments/1e10pkl/looking_for_marxist_research_on_improvement_in/",
    "id": "1e10pkl",
    "selftext": "While it's certainly contested that the living conditions for workers in the United Kingdom did not improve over the first half of the 19th c., I'm not aware of any Marxian economists who say they did not improve from 1800 to 1900, and improve significantly.\n\nMost are familiar with the bourgeois historical and economic narrative: namely, that through increased productivity via the Industrial Revolution, workers eventually shared in the ability of capitalism to raise the tide for all boats. It's a compelling narrative that's often used to justify pushing capitalism on poorer countries. That workers in the UK used to be as poor as they are now, but by unleashing the power of capitalism your poor workers today will be well off tomorrow.\n\nThe counter-narrative I have seen from Marxists is that all the improvements in living standards that workers experienced across the 19th c. in the UK largely came from 2 sources:\n\n1.) Working class agitation - the bourgeoisie feared groups like the Chartists and increasing militancy of the labour movement. Towards the later part of the century, capitalists shared a larger piece of the pie in order to stave off more revolutionary reactions.\n\n2.) The later half of the 19th c. is when we see hyper-exploitation of the colonies, particularly India. This is tied with #1 in that British capitalists were better equipped to pay off the domestic working class by earning super profits from extreme colonial exploitation.\n\nWhile the Marxist narrative makes more sense to me (since I am one), I'm having a hard time finding more rigorous sources - like books or academic research - that supports this thesis. Does anyone here know of good resources for this?",
    "comments": [
        {
            "author": "nostringsonjay",
            "body": "A dense topic. These will be useful\n\n[https://www.marxists.org/archive/marx/works/download/pdf/condition-working-class-england.pdf](https://www.marxists.org/archive/marx/works/download/pdf/condition-working-class-england.pdf)\n\n[https://www.marxists.org/archive/trotsky/britain/v1/index.htm](https://www.marxists.org/archive/trotsky/britain/v1/index.htm)",
            "score": 3,
            "replies": []
        }
    ]
}