{
    "title": "Film recommendation",
    "author": "LearnToSwim0831",
    "subreddit": "Marxism",
    "rank": 449,
    "score": 23,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Marxism/comments/1e4f6yr/film_recommendation/",
    "id": "1e4f6yr",
    "selftext": "I'm sure everyone's heard of it but just in case someone hasn't (or those that have haven't thought of it/seen it in awhile) definitely watch berolucci's film novocentro [1900] from 1976. It's a socialist comfort film for me, if that's allowed to be a thing haha. Starring de Niro, burt lancaster, sterling hayden, gerard depardieu, and Donald Sutherland in one of his most menacing roles as a fascist enforcer for the bosses, this thing is a 5hr15min marxist epic that follows italian peasants in their growing class consciousness from 1900 thru fascism and its eventual overthrow in 1945. A truly remarkable film, the type of which sadly no longer gets made, esp since the fall of the warsaw pact & ussr. May we see their ilk again (the films, not necessarily the states. Although another leftist bloc is sorely needed. \nWould post the badass poster but can't in this community. Just go check it out, you won't be disappointed. \n\nSolidarity. ",
    "comments": [
        {
            "author": "TheDweadPiwatWobbas",
            "body": "> I'm sure everyone has heard of ~~it~~ *this 50 year old obscure Italian film*\n\nSurprisingly, no lol. Never heard of it. But I'm certainly gonna check it out! Thanks for the recommendation",
            "score": 3,
            "replies": [
                {
                    "author": "LearnToSwim0831",
                    "body": "Well that's why I made the recommendation haha. But since de niros in it I figured a lot of ppl would've heard of it from that alone. Great film, tho, I don't think you'll regret taking the time. You can always split it up if it's too much for one sitting, too, since it is so long.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}