{
    "title": "Making sense of an expert from 'On the peoples democratic dictatorship' by Mao Tse-tung",
    "author": "Helpful_Cold_8055",
    "subreddit": "Marxism",
    "rank": 446,
    "score": 21,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Marxism/comments/1e6hv89/making_sense_of_an_expert_from_on_the_peoples/",
    "id": "1e6hv89",
    "selftext": "Hi comrades! I'm currently studying this work by Mao as to better understand what principles the CCP were guided by. What I don't understand with the quote attached below, is what Mao means by the people not only being \"the working class, the peasantry\" but also \"the urban petty bourgeoisie and the national bourgeoisise.\" \n\n\"You are dictatorial.\" My dear sirs, you are right, that is just what we are. All the experience the Chinese people have accumulated through several decades teaches us to enforce the people's democratic dictatorship, that is, to deprive the reactionaries of the right to speak and let the people alone have that right.\n\nWho are the people? At the present stage in China, they are the working class, the peasantry, the urban petty bourgeoisie and the national bourgeoisie.\"\n\nI find this quote quite strange as it seems to invite the collaboration between the bourgeoisie and the proletariat/peasantry, which seems quite contradictory to Marxist-Leninist-Maoist ideas. \n\nCould he possibly mean that the (then) present bourgeoisie would be given a possibilty to  work with the masses instead of against them ,which the capitalist system promotes and awards, in the progress towards a communist society? \n\nOf course then, if the bourgeoisie would resist the will of the people's democratic dictatorship (such as the kulaks in the Soviet union during the agricultural collectivisation process) and turn into reactionaries/counter-revolutionaries, they would be treated as such and the state would therefore \"deprive the reactionaries of the right to speak \".\n\n\n\n",
    "comments": [
        {
            "author": "anarcofrenteobrerist",
            "body": "Mao utilised the alliance with the national bourgeoisie in the context of creating a united front against japanese colonialism, which was considered the main contradiction initially. It was a succesful strategy that won the bourgeois-democratic revolution creating the base for the socialist revolution. You are correct that it had to be conditional as its a class that tends to vacillate and can end up supporting reacionary elements. This manifested in the fact the alliance broke and got restored a few times.\n\nMao talks about this alliance in the text [*On New Democracy*](https://www.marxists.org/reference/archive/mao/selected-works/volume-2/mswv2_26.htm)",
            "score": 15,
            "replies": [
                {
                    "author": "Helpful_Cold_8055",
                    "body": "Thank you for that information!\n\nMao also stated later in this work that the bourgeoisie would be allowed (as long as they don't revolt, sabotage or engage in other counterrevolutionary activities), just like the masses, to keep land and work to sustain themselves and through this work transform themselves into a part of the proletariat. \n\nI will definitely also read 'On New Democracy' as it seems to be very useful in understanding the initial bourgeois-democratic revolutions that often predated proletarian revolutions in the global south, as the colonial and precapitalist material conditions of the global south often meant that the masses first had to liberate themselves from imperialist/colonialist powers (such as the Japanese in Chinas case), then establish capitalism, and from those material conditions begin the gradual transformation towards a communist society.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Basic_Buyer_8888",
            "body": "Mao understands the necessity of development of the local productive forces against the imperialist preasure.\n\nWhy not try to develop them under full workers control? \nBecause of the material condition of having to compete against imperialist powers with their violent rythm of production.\n\nLenin also spoke many times about this necessity.  And look for temporary strategic allies in certain categories of the bourgeoisie, exploiting and making bigger their own class contradictions (the foreginer imperialist bourgeoisie who wants to enter the market and a local productive bourgeoise dont have the same interests, at least for a while).",
            "score": 5,
            "replies": []
        },
        {
            "author": "Nuke_A_Cola",
            "body": "A popular front strategy was taken to basically fight off foreign imperialism and the numerous Chinese warlords. In practice though this was quite disastrous as it was a class collaborationist approach that led to the CPC being completely caught off guard and being in a joint party with the KMT with communist ministers and left nationalists whilst workers revolution was on the cusp of happening - and the KMT were the ones massacring the workers revolution! Not to mention the KMT massacring the party to the point where lots of their leadership and proletariat base in the urban industrial areas was wiped out so they had to flee to the provinces. The CPC completely failed to mobilise to defend themselves and the masses of revolutionary workers. Mao himself took leadership only after this happened and he made a number of concessions now that the party had lost so much - including a softness on the petit bourgeoise and national bourgeoisie. The KMT destroyed the party, crushed workers resistance and destroyed emerging soviets. \n\nI think it should be taken as a lesson in why this strategy is extremely limited (or even a dead end) for communists now. The national bourgeoise will only go as far as to advance themselves are honestly more likely to back foreign imperialism as much as support a proletariat led alliance against it - see the general sentiments and ditherings of the Russian or French bourgeoise during world war 1 and 2. \n\nThe petit bourgeoise peasantry can be won to revolution as they are oppressed too but they don’t have the same interests as the working class so they will vacillate. In Russia this meant the proletariat state had to itself oppress the peasantry (largely just to feed their army and feed the millions of people in the cities though). \n\nIn practice the Chinese experience shows a complete misapplication and failure in the strategy. Even if you accept that sometimes alliances with the national bourgeoisie are necessary (I personally don’t as I see class collaboration as a dead end), they should always be made with a dagger behind your back and a willingness to break from them as soon as your forces are powerful enough. The CPC had a historic failure that actually meant during and after revolution they had a softness to the national bourgeoisie, allowing them to retain some power and merge with the new state. They did not complete their revolution.",
            "score": 4,
            "replies": []
        }
    ]
}