{
    "title": "The international \"labour deficit\"—what is the angle of a good Marxist analysis?",
    "author": "3corneredvoid",
    "subreddit": "Marxism",
    "rank": 436,
    "score": 31,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Marxism/comments/1efg6nj/the_international_labour_deficitwhat_is_the_angle/",
    "id": "1efg6nj",
    "selftext": ">We find that, in 2021, the economies of the global North net-appropriated 826 billion hours of embodied labour from the global South, across all skill levels and sectors.\n\nThis paper \"Unequal exchange of labour in the world economy\" was published on 29 July in Nature Communications.\n\n[https://www.nature.com/articles/s41467-024-49687-y](https://www.nature.com/articles/s41467-024-49687-y)\n\nWhat the authors refer to by \"net-appropriated\" is the huge \"labour deficit\" in international economic exchange between the global South and North. Put briefly, a vast amount of nett labour is continually exported from the global South for profits realised in the global North.\n\nWhile the exploitation of the global South by the global North is nothing new, this research also finds the mainstream economic claim \"a rising tide floats all boats\" has been deeply in question since about 2015, when closure of the wage gap between South and North began to slow right down.\n\nThe authors use worldwide cross-sector, cross-skill labour data to roughly value this \"labour deficit\" at an eye-watering 17tn euros per annum in global North terms (not at the 85–95% lower wages that prevail on average across the global South).\n\nOther points from the paper:\n\n* The \"labour deficit\" straddles all economic sectors and skills.\n* The global South does about 75% of all \"high skill\" work in this era.\n* There has been a significant downturn in the rate at which this situation is leading to higher wages and socioeconomic benefit for the global South since about 2015. \n\nWhat does the sub think is the generative, incisive Marxist line to take on this situation in the world political economy?",
    "comments": [
        {
            "author": "None",
            "body": "I literally just came across this paper, then logged into Reddit and boom this post lol. I'm going to read through it soon but right away the subject matter reminded me of Walter Rodney's How Europe Underdeveloped Africa. Glad to see some contemporary analysis on this.",
            "score": 9,
            "replies": [
                {
                    "author": "3corneredvoid",
                    "body": "Seems a great paper as far as \"mainstreaming\" global economic exploitation is concerned. Certainly a good one to post to friends and family as it is accessible and clear.\n\nIt reminds me of when Nature Communications published [**this climate change paper**](https://www.nature.com/articles/s41467-020-16941-y) which pointed out that no amount of green energy was adequately abating the rising consumption, and hence carbon footprint, of the world's wealthiest societies.\n\n>Any transition towards sustainability can only be effective if far-reaching lifestyle changes complement technological advancements. However, existing societies, economies and cultures incite consumption expansion and the structural imperative for growth in competitive market economies inhibits necessary societal change.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ministry_of_satire",
                    "body": "The lead author, Jason Hickel, has consistently done excellent work in the realm of unequal ecological exchange. Check out his book, *The Divide*, for a great discussion of the historical roots and contemporary manifestations of global inequality. Moreover, he has a book on degrowth called *Less is More* that is also very insightful.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "idareet60",
            "body": "So this paper has certain flaws and doesn't do justice to other papers on Unequal Exchange. I'd recommend reading [Ricci (2018)](https://thenextrecession.files.wordpress.com/2021/09/wp_ricci_unequal_exchange_and_global_inequality-1-1.pdf). There's a lot to be desired in it's treatment of productivity across countries. If accounted for, the estimates would have a downward bias in a way. Moreover, there's no proper treatment of exchange rates. When expressing everything in dollars, one should be careful in simply converting them and calling it the monetary expression of value. Law of globalized value works differently because of different monetary units and that was not talked about in detail imho. I'd also recommend another look at international exploitation in this [paper](https://journals.sagepub.com/doi/10.1177/0308518X231224618). Here, the focus is on capital inflows to poorer regions and a means to transfer surplus value. I like this one more since it has a good simple model on how exploitation takes place. \n\nThe first paper I cite does a very good job in explaining international homogenous labor, which I think is the crux of understanding labor transfer. There are productivity differences and intensity differences across countries. What does that mean? Does it mean there's more value in a commodity in a richer country or less? These are some questions the first paper/author talks about in great lengths. He also has a book out recently. There's a chapter on the other theories of Unequal Exchange. And there are not many that have theorized the transfer of value formally besides Emmanuel. Who gets a lot of mention in his book. Highly recommend. Here's the [book.](https://www.thriftbooks.com/w/value-and-unequal-exchange-in-international-trade-the-geography-of-global-capitalist-exploitation_andrea-ricci/27383709/#edition=65957808&idiq=55303071).",
            "score": 2,
            "replies": [
                {
                    "author": "3corneredvoid",
                    "body": "Thanks, genuinely. This is a cool set of recommended references and it's great someone responded in earnest. I'll try to read and understand some of the stuff you've suggested. \n\nReckon you'd hazard a guess, based on Hickel and his collaborators' research, as to why the aggregate rate they measure at which global South wages have grown relative to the global North has flattened out since 2015? Is their averaging making an anomaly or spike somewhere harder to spot?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "idareet60",
                            "body": "Oh I don't remember seeing that graph. Could you point out the graph in the paper? \n\nAlso, coincidentally the reviewers comments are on the website. One of the reviewers is Ricci. He makes the point about homogenous labor and productivity.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "3corneredvoid",
                                    "body": "> \"As of 2021, the average Southern wage was 94% lower than the average Northern wage, a small improvement from 96% in 1995 (Fig. 8). Improvements in the South’s position occurred during the period from 2005 to 2015. Improvements have since ceased and, to some extent, declined.\"\n\nI had a read of the Ricci paper last night, thanks. Seems from both sources that the period of the most rapid relative advance of China has been the major factor across the board. As Ricci notes with his category Emerging Periphery, whereas Hickel et al. stick to the global North and South.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "idareet60",
                                            "body": ">First, we established the scale of net-appropriated labour time within each skill level for each year. We then multiplied the net-appropriated labour time by the wages that Northern workers receive for the labour of the same skill level, rendered in the production of traded goods (ignoring goods produced for final domestic consumption). Labour is therefore compared like-for-like: for example, the appropriated quantity of low-skill labour is valued at the Northern wage for low-skill work, the appropriated quantity of high-skill labour is valued at the Northern wage for high-skill work, etc. In this way, we calculated the wage value of appropriated labour in a manner that answers longstanding questions about the degree to which this is affected by the skill level composition of exchange.\n\nI think this is very problematic. This approach is akin to what’s called Exchange rate deviation index or ERDI. If you look at the Implied PPP rates [here (IMf)](https://www.imf.org/external/datamapper/PPPEX@WEO/OEMDC/ADVEC/WEOWORLD), you’ll see that they are much lower than current nominal exchange rates, meaning a dollar would get more Yuans than what it should. PPP measures the cost of the same basket of goods across different countries. But getting more Yuans means a dollar can buy more goods than what the PPP exchange rate would tell you. \n\nAll Hickel et al are doing is telling you the overestimated monetary value in their paper. If they weight their observations as per labor force, then China should be the one that gets more weightage. Now if we look at the exchange rates, the yuan starts depreciation from 2015 onwards while until then it was on a long appreciating run. They do not give a lot of importance to productivity, which as I mentioned earlier needs to be at the heart of the labor value discussion. My guess would be that a lot of that stagnation could be a result of the exchange rate depreciation of the Yuan.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "3corneredvoid",
                                                    "body": "Makes it sound like the entire paper is unsound, and it's produced a \"labour deficit\" figure that's debatable but perhaps more importantly, the change of all these aggregate figures with time is very debatable. \n\nhttps://www.imf.org/en/Publications/fandd/issues/Series/Back-to-Basics/Purchasing-Power-Parity-PPP\n\nBased on the above discussion, it's not exactly easy to reproduce Hickel et al.'s model using the time-varying PPP rates because they're poorly and irregularly surveyed?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}