{
    "title": "Reading on the Kulaks?",
    "author": "Helpful_Cold_8055",
    "subreddit": "Marxism",
    "rank": 433,
    "score": 12,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Marxism/comments/1ehnnzy/reading_on_the_kulaks/",
    "id": "1ehnnzy",
    "selftext": "I'm currently reading and analysing the first draft of Marx' reply to Vera Zasulich. In the third last paragraph, Marx writes this:\n\n\"It may be asked, however: why have all these interests (and I include the big government-protected industries) found an advantage in the present situation of the rural commune? Why should they knowingly conspire to kill the goose that lays the golden eggs? Precisely because they feel that ‘this present situation’ is no longer tenable, and that the present mode of exploiting it \\[is not tenable either\\] is therefore no longer in vogue. The land, infected by the farmer’s poverty, is already growing sterile. Good harvests \\[which favourable weather conditions sometimes draw from the land\\] are matched by periods of famine. Instead of exporting, Russia has to import grain. The average results of the last ten years reveal a level of agricultural production that is not only stagnant but actually declining. For the first time, Russia has to import grain instead of exporting it. And so, there is no longer any time to lose. And so, an end must be made to the situation. The more or less well-off minority of peasants must be formed into a rural middle class, and the majority simply converted into proletarians \\[into wage­ labourers\\]. – To this end, the spokesmen of the ‘new pillars of society’ denounce the very evils weighing upon the commune as so many natural symptoms of its decrepitude.\"\n\nEspecially this sentence : \"The more or less well-off minority of peasants must be formed into a rural middle class, and the majority simply converted into proletarians \\[into wage­ labourers\\]\" peaked my interest. From my understanding of the material history, this rural middle class Marx spoke of was what would later become the Kulaks in russian capitalist society, a sort of rural bourgeoisie which even though poor by the standards of the western urban bourgeoisie, still exercised economic power over the serfs (and later informal serfs) of russian society, by owning the arable land which the majority of the russian peasantry (because of their material conditions) had to work on for self-sustenance, while only enjoying a small portion of the capital they produced, the rest being accumulated by the kulak.\n\nMy question for the community is this: Is this an correct understanding of what the kulak class was in russian society, and if not, what's missing from this analysis and is there any reccomended reading for this topic?  \n\n  \n",
    "comments": [
        {
            "author": "Jamie1729",
            "body": ">There is not a single decree (law) or decision of the Soviet government which fails to draw a distinction between the three main groups of peasants. The first group is the poor peasants (proletarians and semi-proletarians, as they are usually called in economic science). They are very numerous. When the landowners and capitalists were in power, the brunt of their yoke fell on the poor peasants. In all the countries of the world, the workers and the rural, poor supporting them are the firmest basis for the true  socialist movement. The second group is the kulaks, that is, the rich peasants who exploit the labour of others, either hiring them for work, or lending money at interest, and so forth. This group supports the landowners and capitalists, the enemies of the Soviet power. The third group is the middle peasants. They are not enemies of the Soviet power. They can be its friends; we are working for this, and will bring it about. All the teachers of socialism have always recognised that the workers will have to overthrow the landowners and the capitalists in order to build socialism, but that with the middle peasants an agreement is possible and essential.\n\n>Under the landowners and capitalists, only very few of the middle peasants, perhaps one in a hundred, managed to secure a stable welfare, and then only by becoming kulaks, and saddling the poor peasants, whereas the vast majority of the middle peasants inevitably must suffer from poverty and ill-treatment by the rich. That is the case in all capitalist countries.\n\n>- [Reply to a Peasant's Question](https://www.marxists.org/archive/lenin/works/1919/feb/14b.htm), V.I. Lenin, 1919\n\nThis is a brief summary of the analysis which Lenin first drew out in his 1899 work [The Development of Capitalism in Russia](https://www.marxists.org/archive/lenin/works/1899/devel/). The relevant section is Chapter II, which comes with a handy summary of the main points.\n\nThe only correction I'd make to the description you gave is the term \"informal serfs\". The abolition of serfdom did fundamentally change the composition of the Russian peasantry, greatly accelerating the growth of nascent capitalist relations. Whilst what Lenin broadly characterises as the \"labour service\" economy was a continuation of serfdom in a different form, it was the minority at the turn of the century, being systematically undermined and converted into an economy of agricultural wage labour. The aristocracy also hired workers, having monopolised important natural resources during the redistribution of the land in 1861.",
            "score": 6,
            "replies": [
                {
                    "author": "Helpful_Cold_8055",
                    "body": "Thanks for the reply, I read *Reply to a Peasant's Question* shortly after publishing this, and found most of his statements and conclusions to correspond with mine. The \"informal serfs\" will be corrected, thank you for giving such constructive and educated feedback!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Techno_Femme",
            "body": "this is a good understanding of what constituted a kulak in the official sense but you should keep in mind that as dekulakization campaigns progressed, the defintion increasingly included any peasant with a slight advantage over their neighbor. You can actually see Marx predict this phenomenon in his essay Private Property and Communism in the 1844 manuscripts\n\nhttps://www.marxists.org/archive/marx/works/1844/manuscripts/comm.htm\n\nI can recommend you works on Dekulakization or the famine in ukraine (i personally really like J Arch Getty' review of Robert Conquest's book on the subject and their subsequent back-and-forth because it gives a solid range of scholarly opinion and IMO, shows the problems with Conquest and the Terror-Famine hypothesis in general) but i'd like to know why exactly you want to know about the kulaks so i can recommend you exactly what you want.",
            "score": 3,
            "replies": [
                {
                    "author": "Helpful_Cold_8055",
                    "body": "In reading further into the topic, I understood that the definition of Kulaks changed during the 'Stalin-era' (for lack of a better term) to be just that of any peasant with a slight advantage over their neighbor. From my understanding, this was a product of the forced collectivisation of the Soviet countryside during this era, something that couldn't be acheived during the 'Lenin-era', because of material conditions facing the soviet economy following the first world war and the civil war. \n\nResponding to your question to what I specifically want to know about the Kulaks, I'm not sure. I've read that correspondance etween Getty and Conquest, and resarched some texts about it and definitions on MIA. I think this was a product of my autism getting ahold of me, and me researching far too deeply into this than was necessary for the work I'm currently writing. Thanks either way for your informative reply!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Techno_Femme",
                            "body": "if its the autism, you might be willing to read aboit Danielson and delve into the debates between him and Plekhanov/Lenin on development in Russia. Marx, at the end of his life, was very excited about Danielson's work but Marxists tend to not like it. I dont actually know a good place to start there besides Marx's correspondences with him, since Danielson's main economic work has not been translated from russian.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Helpful_Cold_8055",
                                    "body": "Ooh that sounds very intresenting! I'll be sure to look into that sometime in the future but yet again, thanks to my autism, I have aproximately 15 books I need to read before that, as they're all borrowed from my different locales of my party and therefore should be returned sometime in the future.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AffectionateStudy496",
            "body": "I'd recommend reading Bukharin's \"How It All Began\" for a sketch of life and the various social classes in Russia from around 1880 to the early 20th century. It was the last text Bukharin wrote while imprisoned before he was executed. It's a veiled autobiography, and not a super dense or theoretical text, very beautifully written and accessible. It does a good job of painting a picture of what life was like in Russia pre-1917, of the classes and various social and political groups, how the various classes lived and what kind of viewpoints were prevalent.",
            "score": 2,
            "replies": []
        }
    ]
}