{
    "title": "Is there an audiobook to understand the historical context of the Manifesto?",
    "author": "Sweaty_Quit",
    "subreddit": "Marxism",
    "rank": 429,
    "score": 37,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/Marxism/comments/1ej60ht/is_there_an_audiobook_to_understand_the/",
    "id": "1ej60ht",
    "selftext": "I read (listened) to the Manifesto twice but some of it is a little hard to understand without knowing the context of the times that Marx was writing about. Is there a book that explains how his world was set up at the time and why it made the Manifesto so influential?\n\nPreferably something available as an audiobook as this is how I consume literature, I know that will limit my options.",
    "comments": [
        {
            "author": "enjoyeverysangwich",
            "body": "Not an audiobook, but I would HIGHLY recommend the podcast series Revolutions by Mike Duncan. Start at season three, the French Revolution, and just listen on as if it were an audiobook. When you get to the Russian revolution series it has some episodes on Marx, Bakunin, and the development of the first international and more of the historical context of Marx's life. If you want you can skip right there but it works so much better in context if you listen to the whole series, because the events of the French revolution and its ripple effects define the rest of the series, as well as the framework Marx was most directly working in, historically speaking.",
            "score": 23,
            "replies": []
        },
        {
            "author": "friver86",
            "body": "I had a lot of problems understanding the crisis of overproduction as Marx described it on the Manifesto. What helped me understand it the most was reading Engels' Principles and Marx's Wage Labor pamphlets. Although it was originally published in 1848, the Paris Commune forced Marx and Engels to reconsider the nature of the state and it's role in the transition to communism.\n\nI would highly recommend reading the prefaces to the Manifesto, if you're more into audiobooks, look up Socialism4All on YouTube, he has readings of many socialist works.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheBittersweetPotato",
            "body": "For a general history of the 19th century, Richard Evans'  _The Pursuit of Power_ seems to be your fit and has an audiobook version on Amazon. One review however, mentions that for each new person the date of birth and death are also pronounced which interrupts the narrative flow apparently.\n\nAlso Hobsbawm's Age of Revolution and Age of Capital both have audio versions on Amazon. His vocabulary is a bit old fashioned and it helps if you already have a high school level general knowledge of history. Good, but not the most accessible by contemporary standards.",
            "score": 3,
            "replies": [
                {
                    "author": "Standard-Nebula1204",
                    "body": "I’m not a Marxist, but I came to the comments to recommend *The Pursuit of Power* if you want the general political-economic and social context of the 19th century Marx was writing in. Richard Evans isn’t a Marxist historian, unlike Hobsbawm, but that might actually be helpful for understanding the world Marx inhabited. He’s an excellent narrative historian besides.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrimalForceMeddler",
            "body": "Sorry this doesn't directly answer your question, but Engels' The Principles of Communism was basically the political content of the Manifesto with the details, historical context, and flavor removed. So it is a great companion piece and lays down the politics better.",
            "score": 4,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "PrimalForceMeddler",
                            "body": "Lol, what? No. These solutions, honed further by time, are precisely those that make sense, in that historic context, in our own time and context, and in general. Marx's point was never to suggest his politics only applied to those circumstances, quite the opposite, and he spent his life applying it to countless international and historic events.\n\nSo you're just a lame anti working class person here to red bait?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "PrimalForceMeddler",
                                            "body": "His politics are relevant for all times, but honed by new lessons, as I said. You need to try studying dialectical materialism instead of whatever bourgeois political science you have been.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "PrimalForceMeddler",
                                                            "body": "Yes. Engels is a big one, \"Anti-Duhring\" is all really good but the excerpt on dialectical materialism was published as \"Socialism: Utopian and Scientific\", excellent read. \nhttps://www.marxists.org/archive/marx/works/1880/soc-utop/\n\nThe best book I've read on the subject is George Novack's \"Introduction to the Logic of Marxism\" \nhttps://archive.org/details/introductiontolo0000unse\n\nWhich writings on it were to hold into power? You mean by Stalinists?",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PrimalForceMeddler",
                                            "body": "Where does he say the state and economic system don't need to be changed in the Manifesto?bIt's been a while but how does he say that? He was calling for social revolution in that pamphlet. It is incomplete but I don't recall any of it being incorrect. Your suggesting I read Marx as a \"bible\" is the height of red baiting and anti Marxist propaganda.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "PrimalForceMeddler",
                                                            "body": "Marxism is a scientifically derived best practices guide to winning power for the working class. So maybe you simply don't understand that. Any serious reading of it demands not reading it dogmatically. I however never suggested doing so, nor do I do so. I've been clear, as was Marx, about the need to use the METHOD of Marxism, dialectical materialism, to continually change Marxism to be more and more correct.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AffectionateStudy496",
            "body": "Michael Heinrich's \"Karl Marx and the Birth of Modern Society: The Life of Marx and the Development of His Work\" is excellent. It only covers his early life and is the first volume, but it's still invaluable. The second volume should be coming out within the next few years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seattle11",
            "body": "Unfortunately, not an audiobook, but Haymarket Books has an annotated edition of the Manifesto that I found to be pretty helpful.\n\nhttps://www.haymarketbooks.org/books/2107-the-communist-manifesto",
            "score": 1,
            "replies": []
        },
        {
            "author": "jayrothermel",
            "body": "Riazanov\nhttps://www.marxists.org/ebooks/riazanov/karl-marx-and-friedrich-engels/Karl%20Marx%20and%20Friedrich%20Engels.epub\n\nMehring\nhttps://www.marxists.org/ebooks/mehring/Karl_Marx.epub",
            "score": 1,
            "replies": []
        }
    ]
}