{
    "title": "Good sources for self criticism of socialist projects?",
    "author": "Agreeable-Payment806",
    "subreddit": "Marxism",
    "rank": 381,
    "score": 30,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/Marxism/comments/1f8cub4/good_sources_for_self_criticism_of_socialist/",
    "id": "1f8cub4",
    "selftext": "I am a student in the U.S. and I understand that the large majority of information communicated is anti communist propaganda, and fear-mongering.  But events like the  the Great Leap Forward in China, and the Holodomor did happen and cause death. Though not with the intentionality, or intensity that is ascribed in America. So I want to understand the facts of what did happen, and some theory on how this could hopefully be avoidable in the future. Also I am aware that there were environmental, and geopolitical reasons that are large factors, but I don't think everything can be put under that for blame. Thank you in advance!",
    "comments": [
        {
            "author": "TankieVN",
            "body": "“The economics of feasible socialism” by Alec Nove is pretty good for the criticisms of the Soviet economy, though you should be aware that he is against the labor theory of value. \n\n“Blackshirts and Reds” by Michael Parenti also has a section criticizing former socialist countries.\n\n“Arguments for socialism” by Paul Cockshott and Dave Zachariah also has a section criticizing former socialism.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Fecal_Contamination",
            "body": "Unfortunately you'll really need to learn languages and see what they were saying to each other. The Russian system at least had a fair bit of self awareness, I'm not sure abt the Stalin era, or China",
            "score": 16,
            "replies": [
                {
                    "author": "Interesting_Plane_90",
                    "body": "I don’t know as much about the Soviet case, but there is quite a bit of good critical history of the trajectory of Chinese Marxism in the twentieth century in English, including contemporary [ETA: Chinese/Sinophone] Marxists whose analyses are available in translation. \n\nRebecca Karl’s [recent book](https://www.versobooks.com/products/909-china-s-revolutions-in-the-modern-world) gives a good synoptic account of modern Chinese history, for example, while Yiching Wu has a more in depth account of the ambivalence of the [cultural Revolution](https://www.hup.harvard.edu/books/9780674728790). The Chuang (闯, to break through/leap, as a horse through a gate）Collective is a contemporary formation of Chinese Marxists who publish [occasional dispatches & analysis](https://chuangcn.org/) in English, including critical economic histories.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alarming-Grocery9088",
            "body": "I highly recommend \"The Years of Hunger\" by Davies and Wheatcroft as a source on the Russian Famine of 1931-1933. Really authoritative work full of documentary evidence, and it has incisive commentary on prior narratives around the famine. I learned more about the internal workings of the soviet union than I thought was possible to know (turns out they produced a LOT of documents).",
            "score": 9,
            "replies": []
        },
        {
            "author": "constantcooperation",
            "body": "[Rev Left Radio - Great Leap Forward and Cultural Revolution](https://revolutionaryleftradio.libsyn.com/modern-china-pt-3-the-great-leap-forward-cultural-revolution-w-ken-hammond)\n\n[Rev Left Radio - Stalin](https://revolutionaryleftradio.libsyn.com/joseph-mother-fucking-stain)",
            "score": 5,
            "replies": []
        },
        {
            "author": "sourceenginelover",
            "body": "Not self-criticism, but nonetheless Marxist criticism of revisionist states:\n\n[Amadeo Bordiga - Dialogue with Stalin (1952)](https://www.marxists.org/archive/bordiga/works/1952/stalin.htm)\n\n[Amadeo Bordiga - Straightening the Dog's Legs (1952)](https://files.libcom.org/files/The%20Amadeo%20Bordiga%20Collection.pdf#%5B%7B%22num%22%3A367%2C%22gen%22%3A0%7D%2C%7B%22name%22%3A%22XYZ%22%7D%2C69%2C229%2C0%5D)\n\n[Amadeo Bordiga - Mao's China, Certified Copy of the Bourgeois Capitalist Society (1957)](https://files.libcom.org/files/The%20Amadeo%20Bordiga%20Collection.pdf#%5B%7B%22num%22%3A536%2C%22gen%22%3A0%7D%2C%7B%22name%22%3A%22XYZ%22%7D%2C69%2C513%2C0%5D)",
            "score": 6,
            "replies": []
        },
        {
            "author": "tymofiy",
            "body": "Nomenklatura: the Soviet Ruling Class also looks at the structure of the USSR from marxist point of view https://archive.org/details/nomenklaturasovi0000vosl_l7v8/page/n487/mode/2up",
            "score": 4,
            "replies": []
        },
        {
            "author": "JameIsLucky",
            "body": "Tbh, it really depends on what communist current you ask. A Hoxhaist criticizes different aspects than a maoist or a trotskyist for example, it‘s probably best to have an ideological foundation and do your own research based on what interests you. And tbh, many aspects aren‘t as important for the movement as many communists online think. Have an ideological foundation first, get into contact with communist groups IRL. That‘s my advice. EDIT: this question is so general, the comments are already full of different leftist currents providing resources based on their ideology (which I don‘t claim is necessarily wrong) and these can and will probably be rather biased (again, not inherently wrong or avoidable). It‘s just important to view all of these critically, with the background they come from in mind. There is no “right” or “wrong” with this",
            "score": 2,
            "replies": []
        },
        {
            "author": "PrimaryComrade94",
            "body": "I think its a really good thing your doing to refine your ideas and criticise the ideology (its the most important to the growth of a political idea). I don't have many ideas, but Crosland's Future of Socialism and Giddens Third Way are the first in my head (Giddens gets some flak though). Finding other socialist critique o socialism books are pretty hard for me to find, but I did find Mandel's Marxist against Stalinism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Euromantique",
                    "body": "Stalin became a relevant and respected Bolshevik because he was considered an expert on nationality policy. It was mostly his idea to turn Russia into a federation, alongside the USSR itself, so that Russification could be reversed, alongide his vigorous implementation of Korenization. It's pretty comical to assert that the ethnic Georgian who spent decades of his life fighting against \"Great-Russian Chauvinism\" and spoke Russian with a heavy accent suddenly did a 180 turn and became a Russian nationalist, which is the complete opposite of his entire worldview.\n\nThe famine you mentioned affected Russia much worse than Ukraine, by the way. You have unfortunately fallen for nationalist propaganda yourself. There are many valid reasons to criticise Stalin's tenure without having to make stuff up.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -15,
            "replies": [
                {
                    "author": "Ugly-titties",
                    "body": "Holodomor (Soviet Famine of 1930-1933) where the crimes of the Kulaks who only made the famine worse.\n\nChina has yet to have a famine since the Great Leap Forward.\n\nMao and Stalin where both Marxist Leninist.\n\nYou reccomend the RCP, a Trotskyist organization, interesting choice u/“bolshevik”.\n\nFor those interested: https://www.marxists.org/archive/olgin/1935/trotskyism/index.htm",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Nuke_A_Cola",
                            "body": "The Soviet Union was a net exporter of grain during the holodomor. It’s not some intentional genocide but it’s a staggering level of incompetence and exploitation of the peasantry that led to millions of deaths. Sure the kulaks made it worse. They aren’t the only engineers of it though",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Bolshivik90",
                            "body": ">You reccomend the RCP, a Trotskyist organization,\n\nAnd that's so bad compared to recommending, for example, the CPUSA, a \"communist\" party which literally supports voting Democrat?\n\nYou don't have to agree with Trotsky but at least the RCA actually put forward an independent communist position instead of advocating lesser-evilism.\n\nWould Lenin have advised Russian workers to vote Cadet? The question answers itself.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "EctomorphicShithead",
                                    "body": "> CPUSA, a “communist” party which literally supports voting democrat\n\nCPUSA doesn’t endorse other parties or other parties’ candidates. Now, being involved on multiple fronts of US political activity inevitably means crossing paths with members and organizers of bourgeois parties. \n\nWe don’t have to agree on everything to lend capacity when a goal or development is in line with communist principles. What, do you think we should condemn all organizers and activists who don’t follow our line? \n\nOur class gains zero political experience from sectarian isolation. And communists gain few friends by neurotically nitpicking any activity that could risk such *horror* as being in the same room as a liberal.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sourceenginelover",
                                            "body": ">Unity is a great thing and a great slogan. But what the workers’ cause needs is the unity of Marxists, not unity between Marxists, and opponents and distorters of Marxism.\n\n* V. I. Lenin",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LocoRojoVikingo",
                            "body": "Comrade, the fundamental flaw in this Stalinist critique is its blatant disregard for the dialectical materialism that lies at the heart of Marxism. Trotsky's position on the impossibility of \"socialism in one country\" is not only rooted in a sound analysis of Marxist theory but has also been vindicated by historical developments. Let us unravel this issue with the clarity and rigor that Lenin would demand.\n\nLenin, in his extensive writings, never advocated for the idea that socialism could be fully realized in a single country isolated from the global capitalist system. Marx and Engels, too, were clear on this point: socialism is an inherently international movement, born from the contradictions of global capitalism, and cannot be confined within national borders. As Lenin stated:\n\n> \"The development of capitalism proceeds extremely unevenly in the various countries. It cannot be otherwise under commodity production. Hence, the victory of socialism is possible first in several or even in one capitalist country taken separately. But in the next period, after the expropriation of the capitalists and the establishment of proletarian state power, this victory must result in the unity and cooperation of many countries.\" (*Letter to American Workers*, 1918).\n\nStalin’s theory of \"socialism in one country,\" as articulated by his followers like Olgin, misinterprets Lenin’s acknowledgment of the uneven development of capitalism. Lenin understood that the revolution might first break out in one country, but he never suggested that socialism could be built in isolation. On the contrary, Lenin was clear that the survival and flourishing of the proletarian state would depend on the spread of revolution internationally. This is where Trotsky’s analysis becomes crucial.\n\nTrotsky argued, correctly, that the very nature of capitalism—its international division of labor, global markets, and imperialist conflicts—means that a socialist revolution in one country cannot survive without the support and eventual revolution in other countries. The forces of global capitalism, through economic blockade, military intervention, and political isolation, would seek to strangle any nascent workers' state that attempted to build socialism in isolation.\n\nTrotsky understood that the success of the Russian Revolution depended on the revolution spreading to more advanced capitalist countries, particularly Germany. Without this spread, the material basis for socialism—an advanced industrial base and the defeat of international capital—could not be sustained in backward, agrarian Russia. Lenin was acutely aware of this, which is why the Bolshevik leadership, including Lenin, placed so much emphasis on the revolutionary movements in Europe, especially during the tumultuous years following the October Revolution.\n\nStalin's policy of \"socialism in one country\" led to the degeneration of the Soviet Union into a bureaucratic dictatorship, precisely as Trotsky predicted. The isolation of the Soviet Union, combined with the lack of revolutionary success in other key countries, resulted in the rise of a bureaucratic elite that, under the guise of defending socialism, betrayed the very principles of Marxism. This bureaucratization was a direct result of the pressures from global capitalism and the retreat from internationalism, culminating in policies like the disastrous collectivization and purges, which bore no resemblance to socialism as Marx and Lenin envisioned it.\n\nMoreover, Stalin’s strategy did not secure socialism but instead led to the USSR's eventual collapse, proving Trotsky’s warnings about the dangers of abandoning internationalism. The Soviet Union could not withstand the internal contradictions of a system that was forced to operate under the constraints of a global capitalist market, while simultaneously suppressing genuine workers' democracy and international solidarity.\n\nTo build socialism, the proletariat must understand that their struggle is inherently international. National struggles are but the first step in a broader, global revolutionary process. As Lenin emphasized, the dictatorship of the proletariat in any one country is only the beginning, a beachhead in a global class struggle. The proletariat must aim to spread the revolution, support workers’ movements abroad, and unify the global working class against the international bourgeoisie.\n\nTrotsky’s insistence on the necessity of international revolution is not a sign of defeatism, as Stalinists would claim, but a recognition of the reality that socialism can only thrive in a global context. The working class, bound by no borders, must unite in its struggle against capital. This is why the concept of \"socialism in one country\" is fundamentally flawed and counter-revolutionary—it betrays the internationalist essence of Marxism.\n\nComrade, we must reject the Stalinist distortion of Marxism that seeks to isolate the proletariat's struggle within national borders. The true path to socialism lies in internationalism, as Trotsky so clearly articulated. The global nature of capitalism demands a global response from the working class. The history of the 20th century has proven that socialism in one country is not only impossible but a dangerous delusion that leads to the degeneration of the revolutionary movement.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Bolshivik90",
                            "body": "\"Marxist Leninist\" is a by word for Stalinism and ironically has nothing to do with the ideas of Marx or Lenin.\n\nNeither Marx nor Lenin would have ever advocated the idea of \"socialism in one country\" and the \"two-stage theory\" is pure and simple menshevism.\n\nYou also speak of China then and China now as if they're the same regime. \"China has yet..\"\n\nOkay then. Then what is Marxist ahout the fact China has more billionaires than the USA, and that the Chinese working class is one of the most exploited working class on the planet? What is Marxist about China, which has now a fully functioning capitalist economy?\n\nThe CCP should stand for the Chinese Capitalist Party.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "yeetusdacanible",
                                    "body": "MLoids are different then tankies, although you are correct. Stalinists are basically social democrats (ironic) larping in red, refusing to even move to state capitalism before communism.",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nuke_A_Cola",
                    "body": "So true. Dunno how people see Stalin and Mao as communists, it’s like they don’t read Lenin or Marx or are taught to read them in a certain lens. Stalin literally killed or exiled every old Bolshevik until the bolshevik party was the party of the bureaucracy - and championed socialism in one country against internationalism. Mao literally formed class collaboration alliances with the industrialists and progressive bourgeoise nationalists.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LocoRojoVikingo",
                    "body": "Comrade, your unwavering stance against the distortions of Marxism by Stalinism and Maoism is commendable and firmly rooted in the principles of true communism. Let us, together, dispel the misconceptions that are often propagated by those who conflate the brutal authoritarianism of Stalin and Mao with the genuine revolutionary theory of Marx and Lenin.\n\nFirstly, we must understand that Stalin and Mao did not embody the essence of communism but rather betrayed it. Communism, as envisioned by Marx, Engels, and Lenin, is a society where the working class seizes control of the means of production, abolishes class distinctions, and ultimately dissolves the state itself in favor of a classless, stateless society. This vision was grotesquely distorted by Stalin and Mao, who centralized power, suppressed dissent, and fostered a new bureaucratic elite that oppressed the very proletariat they claimed to liberate.\n\nLet us not mince words—both the Great Leap Forward and the Holodomor were tragic catastrophes brought about by the reckless policies of Stalin and Mao, and not by communism itself. These events were the results of forced collectivization, brutal central planning without the active participation of the proletariat, and the suppression of democratic control by the working class.\n\nStalin’s forced collectivization, culminating in the Holodomor, was not a necessary or inevitable outcome of socialist construction but a deviation into bureaucratic terror. This led to widespread famine, suffering, and the death of millions—a crime that cannot and should not be excused under the banner of socialism. Marx and Lenin both emphasized the need for revolutionary democracy, where the proletariat is not just a passive recipient of decrees from above but actively participates in shaping society. Stalin's regime, by contrast, replaced the bourgeoisie with a bureaucratic elite, thus perpetuating class oppression rather than abolishing it.\n\nSimilarly, Mao’s Great Leap Forward was an ill-conceived and disastrous attempt at rapid industrialization, driven by ideological zealotry rather than sound economic planning grounded in the material conditions of China. The result was mass famine, suffering, and death on a horrifying scale. Mao’s policies disregarded the principles of collective leadership and democratic planning, leading to one of the worst human tragedies in modern history.\n\nTo be clear, comrades, communism is not about creating a new ruling elite or subjecting the masses to top-down decrees. It is about empowering the working class, building genuine socialist democracy, and moving towards the abolition of the state and class divisions altogether. Stalin and Mao’s regimes, with their authoritarian practices, massive purges, and suppression of workers' councils, were antithetical to the principles of Marxism.\n\nLenin, in his work *State and Revolution*, made it clear that the dictatorship of the proletariat was to be a form of government where the workers themselves ruled directly, not through a separate, unaccountable bureaucratic elite. The withering away of the state, as envisioned by Marx and Lenin, could never be achieved under the repressive conditions imposed by Stalin and Mao, who merely replaced the old bourgeois state apparatus with their own.\n\nTo support communism is to reject the totalitarian practices of Stalinism and Maoism, not because we reject the goal of a classless society, but because we uphold it. We recognize that the road to socialism must be paved with the genuine involvement and leadership of the working class, not with the authoritarian decrees of a self-serving bureaucratic elite.\n\nComrades, let us not be swayed by those who mistake these authoritarian deviations for Marxism. We must stand firm in our commitment to the revolutionary principles laid out by Marx and Lenin—principles that call for the liberation of the working class through their own conscious and organized efforts, and that reject all forms of oppression, whether they come from the bourgeoisie or from within our own ranks.\n\nIn solidarity and struggle,\nA Comrade in Defense of Revolutionary Truth",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "fabkosta",
            "body": "> Though not with the intentionality, or intensity that is ascribed in America.\n\nOh boy, are you wrong. Just look at the number of deaths. You can find them online.\n\nI have little sympathy for the US anti-communist satanic-panic. But my father emigrated from a communist-socialist country, and I can tell you he never shed a single tear in his life living in a capitalist (actually: capitalist-socialist, to be very precise), Western society for not having to live anymore under a communist-socialist government.",
            "score": -3,
            "replies": []
        }
    ]
}