{
    "title": "What is the Marxist analysis of authority? ",
    "author": "Thr0waway3738",
    "subreddit": "Marxism",
    "rank": 377,
    "score": 20,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/Marxism/comments/1f8xbo2/what_is_the_marxist_analysis_of_authority/",
    "id": "1f8xbo2",
    "selftext": "I like to lurk on the anarchist subreddit and one of the people there made the criticism that Marxism has no critique or analysis of authority. \n\nThis sounded silly bc while I haven’t done all my reading this seems like it would’ve been covered somewhere by now. So what do y’all think? \n\nAlso they made the critique that there’s no way the state will just wither away which I sympathize with on some level. However that reality is too far in the distant, hypothetical future for us to really care about right now but we should think about it. What are your personal Marxist theories on how the socialist states will wither away in the future? ",
    "comments": [
        {
            "author": "orpheusoedipus",
            "body": "It really depends what you mean by authority. I think people misrepresent both the anarchist and the Marxist positions. Anarchists don’t think authority based on expertise is bad inherently, you would still go to a trained doctor for medical advice but even that system of knowledge I believe would be different under anarchist relations. They use power analysis to see what moves people, what is exerting pressure on who and why. For example why is the school making the decision to ban a club, reason the PTA is exerting pressure by saying this is bad for kids and we will get you in trouble or remove funding if allow it thereby making the school act in a certain way. For us Marxists power analysis isn’t useless and can be helpful, but we have a materialist conception of the state, the state isn’t something necessary or something that is consciously created, it arises from the the material conditions of class society, it arises from the need to subjugate one class to the whims of the other. Humans for the most part have lived in classless societies and in those cases states did not exist! This is why Marxists say the state will wither away, the proletarians must subjugate the bourgeois under their rule and unfortunately it will be forceful or else there is no way to defend ourselves from the state power that they hold. When the distinctions of class are removed from society then the state will have no more purpose or material grounds to stand upon. Authority in this case is sometimes necessary and it can be a tool for the working class, not that we don’t have collective decision making processes but that a certain amount of authority is necessary to protect the gains of the working class. The state withers away because who do you have to subjugate? We have abolished class. This brings up the question of a bureaucratic class created by the party, which is a fair question to ask, what needs to always be understood is that the party cannot be separated from the working class it must be embedded in and part of the working class, Mao’s mass line addresses this question pretty well. This is super simplified run down. I would recommend reading Marxists to see their full analyses",
            "score": 11,
            "replies": [
                {
                    "author": "nicholsz",
                    "body": ">Humans for the most part have lived in classless societies and in those cases states did not exist! This is why Marxists say the state will wither away\n\nI definitely agree with this -- but I've always had the nagging question \"how do we replace all of the logistical decision-making frameworks under stateless communism?\"\n\nlike who decides where a factory or train line goes or who works on it or what the factory makes etc. we have a lot more people than hunter-gatherer times, and we need to maintain industrial technology and global supply chains to not starve billions of them to death how do we do that",
                    "score": 4,
                    "replies": [
                        {
                            "author": "orpheusoedipus",
                            "body": "That’s a great question and one that I can’t give a concrete answer to, I can give you possible ideas that address those issues to an extent. I’ll do that but first, I’d like to really emphasize the role of material conditions for Marxism. There’s a reason the scientific development of Marxism as a thought and a science did not develop during the ancient Greeks, it wasn’t that they didn’t think about society hard enough but rather that the time they were living in was materially not at the level to even conceptually think up the ideas of Marxism they would just seem absurd. For example we can imagine a hunter gatherer society praying to a deity of hunting, but they certainly wouldn’t come up conceptually with the idea of praying to or even realizing a deity of farming because they just were not living in that type of material condition. This doesn’t mean they weren’t intelligent or creative it just point to how fundamental the way we structure our society for our given needs influences our ideas. This means we will constantly be learning and growing including Marxist theories and science. So taking that into account the answers to those extremely important and pressing question will be much more available to us once we are in the material and technological conditions of that time and through a concrete analysis of those specific conditions. For now we can come up with ideas and plans some of which may bear fruit. We can think of technology being to the point of advancement (under the rule and for the purpose of the people not the profits of a select few) is able to produce most of our needs while leaving us with very little to do with production. I believe at the stage in which the state is completely abolished all labour will be voluntary, people will consult experts and councils of the people can work with said experts to plan logistics with the help of technology. I think things like sustainability of resources and nature need to be studied and understood as much as we can do that as councils as people as experts we can come together to make decisions that will allow us to protect our planet and provide the needs of everyone. Advanced algorithms can possibly be used to make planning easier and remove the risk of mismanagement. People as a whole might be much more political in the sense they will be taking direct decisions on their future and their current needs than now, we can’t imagine what it would be like to not be alienated from process of production. We can also look to historical examples that attempted to implement some of these things what their failure were and how we can ensure they won’t repeat such as the famines from the Great Leap Forward (I say this as a Maoist).",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "nicholsz",
                                    "body": "I remember reading some Durkheim and he was making the point that the origin of border gods coincided with the advent of farming. I'm with you on material conditions influencing humans in a reactive way -- that's kind of how our species operates we get a new technology like fire or language or farming or government and we use it to change our living conditions and organization and way of life such that we can spread, being the evolving biological populations that we are.\n\nIt seems a bit like taking it on faith that we'll be able to organize industrial labor and supply chains with some new as-yet-unknown decision-making systems that have fewer drawbacks and greater benefits than our current systems though. I mean we can't even get one or two self-sufficient communes running this way isn't there some way to be a bit more careful and deliberate?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "fossey",
                                            "body": "I really don't get the the question of \"Now our system is run by corrupt, power-hungry politicians, who are often not experts in the things they decide and get paid by companies to make decisions that fuck over everybody else including the planet itself... How are we ever going to replace that system with a better one?\"\n\nJust have the people in an industry make the decisions, have them be able to get rid of their \"boss\" (read manager or \"ceo\" or whatever) if he is an idiot, no matter if he is a member of the right party or has the right daddy.\n\nSure we might still need a regulatory agency (e.g. for the railway sector or industrial sectors) but why would they have to function much differently from now except for not being influenced in wrong directions by corruption and dirty money and so on?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "nicholsz",
                                                    "body": ">Just have the people in an industry make the decisions\n\ndecisions are made with capital right now. a factory opens when an executive comes up with a plan to open a factory and uses capital to finance it.\n\nthe whole benefit of capitalism is to decentralize logistical decision-making by tying it to ownership. if you want to come up with a new way to decentralize logistical decision-making *without* using capital, you have to actually come up with it\n\nthis whole conversation reminds me of one I had with my dad about computer vision in college. I was explaining the function of V1 cortical cells, and he replied with something like \"why is vision so hard? the computer has a camera isn't that enough for it to see?\"",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "fossey",
                                                            "body": "> the whole benefit of capitalism is to decentralize logistical decision-making by tying it to ownership. if you want to come up with a new way to decentralize logistical decision-making without using capital, you have to actually come up with it\n\nIt's not like there is a single person making the decisions for big companies, they have boards and what not. Please explain to me how those would not function without money.\n\nWhat are you even talking about \"without using capital\"? How do you define capital that you seem to think it would vanish?\n\nAnd what about ownership? It's not like every functioning company today belongs to single individuals. Why can't they be owned by the workers?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "nicholsz",
                                                                    "body": ">How do you define capital that you seem to think it would vanish?\n\ndid you just jump in without context? we're talking about a future stateless moneyless \"communism actually achieved\" society.\n\ncapital is money. moneyless means without money. moneyless is therefore without capital. QED",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "fossey",
                                                                            "body": "Capital is money among a lot of other things. A house you don't need for your own accommodation is capital, machines that produce things are capital. And that's just for economic capital. Not everything we would define as economic capital nowadays will just vanish in communism. Even if we go by the most basic Marxist definition, capital is at least money and the means of production. But please keep asking me, if *I* jumped in without context...",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "nicholsz",
                                                                                    "body": "a house you don't need but have the deed for is capital under *capitalism*, sure\n\nI think the whole idea behind marxism is to *not* be under capitalism maybe that's the context you were missing. anyway thanks for trying to be part of the discussion",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "fossey",
                                                                                            "body": "So do you think the means of production are not capital or do you think they will vanish in communism? Because otherwise your argumentation doesn't make sense.\n\nBut.. okay.. I guess you mean, all forms of economic capital will vanish in communism.\n\nBut you still haven't properly explained why that would be a problem.\n\nThere will still be plenty of motivators left to give people a reason to \"open factories\".\n\nDo you mind to tell me, why you always just pick out a few words from my comments to reply to? Especially in this case I really don't get why you would pick the house example although I talk about a minimal definition at the end.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "nicholsz",
                                                                                                    "body": ">There will still be plenty of motivators left to give people a reason to \"open factories\".\n\ndoes anyone who wants a factory get one? does everyone have to work at the factory if they're assigned? who decides whether a factory makes sense to build at the location you have in mind? who connects roads, or, power, or water? who plans capacity for that infrastructure to handle your factory's needs? how do we account for all these myriad trade-offs that occur at multiple scales without something like money?\n\nI'm not talking about \"motivation\" or kindergarten-level like \"boo hoo everyone gets paid the same\" nonsense, I'm talking about population-scale infrastructure, supply chain planning, like if we seize the means of production, we have to actually manage the work of producing everything for the entire human race, and there are a lot of difficult problems involved in that whose only currently known solution involves the use of capital. \n\n>Do you mind to tell me, why you always just pick out a few words from my comments to reply to? \n\nbecause I want to have a productive focused conversation, I don't want to get sucked into an irrelevant argument about definitions",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "fossey",
                                                                                                            "body": "> does anyone who wants a factory get one?\n\nNo\n\n> does everyone have to work at the factory if they're assigned?\n\nThis question is rather moot if the first one is answered with \"No\". But if I take it in a more general sense of: \"Do you have to work at a factory if you are assigned to it?\" Also no, but there would obviously most likely still need to be incentives for working in general and - if the factory in the next town desperatedly needs workers - additional incentives to work at that factory even though it might be farther from your home or otherwise less desirable. These incentives is one function we use money for today. But considering modern computing capacities, I don't think the simplification through money is needed anymore, but more about that later.\n\n> who decides whether a factory makes sense to build at the location you have in mind?\n\nThe people that are making this decisions now or someone of similar expertise will still be available to make these decisions, except if we notice, that the decisions made were not made with the best interest oft the public in mind, then we might have to change the people or the system. But finding out something *didn't* work as we would like it to work should lead to optimization and not unsolvable problems.\n\n> who connects roads, or, power, or water?\n\n\"Stateless society\" doesn't mean there is no bodies where these decisions are made. What do you propose as a possible difficulty to experts and involved parties (not the political kind) coming together and making these decisions? It's just that they can't be made that easily over so many people's heads anymore.\n\n> who plans capacity for that infrastructure to handle your factory's needs?\n\nAgain.. you would have to explain how and why this would be harder than it is now.\n\n> how do we account for all these myriad trade-offs that occur at multiple scales without something like money?\n\nFactory X produces chairs because people need chairs, it uses the electricy made by plant Y, which produces electricity because people need electricity, X's waste water is cared for by the sewage people, who maintain the sewage system because people need a functioning sewage system.\n\nCould you explain what exactly these \"trade-offs\" are, that you are talking about?\n\n> I'm not talking about \"motivation\" or kindergarten-level like \"boo hoo everyone gets paid the same\" nonsense, I'm talking about population-scale infrastructure, supply chain planning, like if we seize the means of production, we have to actually manage the work of producing everything for the entire human race, and there are a lot of difficult problems involved in that whose only currently known solution involves the use of capital.\n\nIf \"we\" seize the means of production we will most likely have to go through a prolonged stage of socialism first, not necessarily because we don't theoretically know how to do a communism, but because society will mostly have to undergo a slow metamorphosis to where communism is even possible.\n\nIf we have then established egalitarity as a basic value of our society just as we do now with private property, I don't see the big difficulty in the logistics or other organizational problems of a moneyless society. All of these things are done by people now, they will be done by people then. \n\nI'm sorry, I really can't see the big problem with any of that.\n\nLike.. in most of the transactions that happen to get a product from source to consumer, money only plays the role of incentive (or more often compulsion but the two are somewhat similar) or universal trading value. Incentives are easy to come by, compulsions we want to get rid off as much as possible and the universal trading value might for example exist only mathematically/theoretically, which wouldn't be a problem at all given even current computing power. As an example for that last part: Let's say we underproduced on fridges and desperately need some additional fridges (ignoring that it should be pretty easy to calculate these things with today's computing capabilities). A reasonable trade value for that (time, amount, additional work etc.) could be computed (or maybe otherwise determined) and the workers working overtime or otherwise especially hard to produce those extra fridges could be awarded with an appropriate incentive.\n\nAfter all this, one could ask, why not just keep money, if it is mostly an universal trade value anyway.. The reason is that this property of money is a double edged sword as it can also be easily and rather stealthily converted to political power for example.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "nicholsz",
                                                                                                                    "body": ">The people that are making this decisions now or someone of similar expertise will still be available to make these decisions\n\nexpertise isn't the problem. I don't think you have a real conception of what I'm even talking about.\n\nno single person makes these decisions right now. the decisions are made collaboratively by massive numbers of people. the medium they use to signal each other is money\n\n>Again.. you would have to explain how and why this would be harder than it is now.\n\nbecause we have existing systems that solve these hard problems in some way. if you take away the solution, you have to make a new one. making a new solution is harder than using an existing solution\n\n>Could you explain what exactly these \"trade-offs\" are, that you are talking about?\n\nthere's a finite amount of concrete humanity can produce in a year. who gets it and who doesn't? that's a trade-off.\n\nothers would include things like \"how far into the backcountry should we run fiber optic lines?\" or \"should we invest into factories for consumer goods or for industrial equipment\" (this last one should sound familiar if you've studied soviet history)\n\n>If \"we\" seize the means of production we will most likely have to go through a prolonged stage of socialism first... society will mostly have to undergo a slow metamorphosis to where communism is even possible\n\nare you saying communism is just democratic socialism with star trek belief-in-the-future characteristics?\n\nthat doesn't seem like it could be correct. \n\n>not necessarily because we don't theoretically know how to do a communism\n\nare you saying we *do*? what's the blueprint then let's try it out in practice at small scales\n\n>A reasonable trade value for that (time, amount, additional work etc.) could be computed (or maybe otherwise determined) and the workers working overtime or otherwise especially hard to produce those extra fridges could be awarded with an appropriate incentive.\n\nwho is responsible for computing this \"trade value\"? how do we make sure they're accurate and unbiased? how do they receive feedback? what incentive do they have to be correct? how much should they take into account?\n\nI'm sorry this seems far more impractical than even bitcoin",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "fossey",
                                                                                                                            "body": "> expertise isn't the problem. I don't think you have a real conception of what I'm even talking about.\n> \n> no single person makes these decisions right now. the decisions are made collaboratively by massive numbers of people. the medium they use to signal each other is money\n\nI'm sorry if my non-native use of the english language made you think, that I believe any of these decisions were made by a single person. I don't.\n\nWhat exactly does this process of \"signaling with money\" entail that is hard to accomplish without money, *if* we consider an appropriately transformed society with new values/values differing from the ones we have now (and please don't just dismiss this as being close to impossible. Things like private property, freedom of speech or freedom in general are just a few examples of values that haven't been that ingrained in society for a particular long time)?\n\n> because we have existing systems that solve these hard problems in some way. if you take away the solution, you have to make a new one. making a new solution is harder than using an existing solution\n\nBut the things you were talking about there (roads, electricity, ...) are in most states of the world state controlled and not exactly very capitalistic ventures. The people making these decisions work in agencies whose purpose it is to manage those infrastructures. What parts of that would have to change significantly?\n\n> there's a finite amount of concrete humanity can produce in a year. who gets it and who doesn't? that's a trade-off.\n\n> others would include things like \"how far into the backcountry should we run fiber optic lines?\" or \"should we invest into factories for consumer goods or for industrial equipment\" (this last one should sound familiar if you've studied soviet history)\n\nMaking these decisions with the welfare of society as goal instead of profit, should lead to better outcomes though, shouldn't it? Again, we don't have to change all of the underlying systems. Just posing the question of \"What is best for the people?\" instead of \"What brings the most profit?\" wouldn't be that much of a change.\n\nIt's not as if this profit motive would lead to good decisions all the time anyway. Short sighted profit motives even ruin the companies themselves quite often, not to talk about ruining the environment and other really bad consequences. So just like in the two points above, I can only imagine that this again comes down to the role of money as a mediator which, I have to say, still remains nebulous in your argument.\n\n> are you saying communism is just democratic socialism with star trek belief-in-the-future characteristics?\n\n> that doesn't seem like it could be correct.\n\nI'm sorry.. What?! I don't get your point. I talked about about giving society time to acclimate to changes in ideology and core values. How did that lead to this quite desparaging response of yours?\n\n> are you saying we do? what's the blueprint then let's try it out in practice at small scales\n\n1. *No* it didn't say that, I only said it wasn't the reason\n2. Just because we know how something could be done, it doesn't have to work on a small scale\n3. What even is a small scale? There is plenty of small, functioning communes. If the scale gets much bigger the US comes in and coup d'etats your ass or kills your leaders\n\n> who is responsible for computing this \"trade value\"? how do we make sure they're accurate and unbiased? how do they receive feedback? what incentive do they have to be correct? how much should they take into account?\n\nWell, the values would have to be adjusted in way that people would be incentivized enough for all the needed work to happen. This might lead to people working in mines and the sewage system getting a lot of these incentives. There we would have to watch out for these incentives to not be to close to money (like a bigger house, personal woods or something else permanent) so they can't be exchanged for money, but rather fleeting or strictly personal things like vacations, more free time, earlier retirement etc.\n\nThe feedback and also part of the incentive would then, simply put, be a functioning society. The right amount of workers in the right places doing the right amount of work in the right time. People permanently working on this problem is obviously in danger of abuse but I think most of the actual work could be done by algorithms and how these function could be decided democraticly. But these are details. We can't get lost in these, and it would be unreasonable to ask me to present you with the perfect system from my fingertips.\n\n> I'm sorry this seems far more impractical than even bitcoin\n\nWhy? What does this even have to do with bitcoin? Also.. bitcoin would be working perfectly fine if it's purpose was only to replace money afaik but I'm no expert on this",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "orpheusoedipus",
                                            "body": "I think the period of socialism itself prior to the complete abolition of the state (which again kind of depends what you mean by state) will create the necessary infrastructure for such a transition. The whole point of this socialist stage is to finally consciously make decisions about what we are making rather than reactively doing so through mystical means like “the invisible hand”. As Marxists that’s why we aren’t advocating for the immediate implementation of communism before creating the conditions to do so. It wouldn’t be based on faith but based on the work of planning our world within a socialist society that finally allows us to move forward. We are appropriating the parts of development we have gotten to so far and not completely building from scratch, the socialization of labour has already occurred in our current moment, we are removing the contradictory elements of it. I’m sure we can come up with and test many possible ideas now in this moment that can be used later but I’m not well read on this question. I’ll have to read more and see what is being proposed or tested, maybe other here can give you better examples or ideas.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "nicholsz",
                                                    "body": ">The whole point of this socialist stage is to finally consciously make decisions about what we are making rather than reactively doing so through mystical means like “the invisible hand”.\n\nAny system involving 8 billion individual humans cooperating together is going to be fantastically complex and vulnerable, I hope you agree with *these* material conditions.\n\n\"Consciously make decisions\" reads like more faith to me. How do you know you're more \"conscious\" than any random enlightenment thinker? \n\n>we aren’t advocating for the immediate implementation of communism before creating the conditions to do so\n\nis there some reason that communism can only be achieved first at massive scale? you already made the claim that communism is the natural state of man at small scales. why not *start* at smaller scales? like make a commune that works.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "orpheusoedipus",
                                                            "body": "We can't really claim it's the natural state of man on a small scale; we can claim it is what occurs in the absence of classes. We can see examples of extremely hierarchical structures and exploitation of labour in small-scale settings such as cults. Hoping for some sort of return to our \"natural state\" is just a fantasy, we have no natural state of being this thinking derives from the same petit-bourgeois return to the past as fascism a return to homesteading and providing for our small community, what happens to those who need medicine, who are disabled, the elderly? We developed to the point that our needs are not just met by small-scale communes that produce enough food for those present. We do have communes and some of them do well for themselves but are not self-sufficient for those with complex needs. And how would that expand? If we assume a bunch of communes develop their own economies throughout the world and eventually become the primary mode of existence, how would those communes work together in the large scale? We fall into the same issues you brought up but to a greater degree. How will medicine be shipped between independent communes who developed at different times and all the while still have capitalist powers at play interfering as they develop. The big scale of communism is needed to ensure that it can subdue the powers of capital and realize the freedom of all, not just those in this or that commune. \n\n  \nWhen I say consciously it means we are deliberately producing for needs of everyone and to make that clearer we can contrast it with capitalist production, which allows supply and demand to make the decisions of what we produce based on what will create more profit. Deliberate conscious decisions mean we look at the needs of our society and we decide to produce what is needed for ourselves then we decide what would make our lives even better, it is not driven by profit motive or some other adjacent concern, it is strictly by and for people. Yes they are extremely complex which is why we need to use every tool at our disposal including our advancing technology. Experts on shipping and supply chains will have to be asked to develop the necessary infrastructure. We need to make use as well of the already existing infrastructure that we have built under capitalism but to appropriate them for our own needs.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "nicholsz",
                                                                    "body": ">Experts on shipping and supply chains will have to be asked to develop the necessary infrastructure.\n\nThis doesn't inspire confidence. It sounds like you're completely unaware of the scope of the problem here.\n\nAgain, what's the reasoning to only start at massive scale and not small scales?\n\n>The big scale of communism is needed to ensure that it can subdue the powers of capital and realize the freedom of all, not just those in this or that commune.\n\nWouldn't it be nice to have some evidence that the systems you're imagining can actually feed people before we start the revolution? I really don't think it's that hard to stick a commune in upstate ny and avoid getting messed with by the feds\n\nI mean plus it's not like you're worried that working on a commune will *slow down* the adoption of communism you're still waiting for the right material conditions anyways",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "orpheusoedipus",
                                                                            "body": "You seem to think we are starting from scratch and need to build up. We already have much of the infrastructure in place we need to expand it to meet the needs of those being neglected not broken down to nothing and rebuilt. Capitalism has brought us to this point we might as well use the good that came out of it. The systems after revolution can feed the people because we are not destroying everything we are simply removing the contradictions by reappropriating the means already available while then making improvements. The current infrastructure isn’t just destroyed simply made to be collectively owned. What it can do is now expand without worrying about profits. Most of the places that produce most of the goods in the third world barely have enough, and most of first world has so much that companies throw it away to make sure they keep making a profit. Repurposing the already existing infrastructure will make sure that the people aren’t starving. Experts on supply chains and shipping will be consulted to see how we can better make it accessible to the places that have already been neglected by capitalism not some new found shipping way.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "orpheusoedipus",
                                                                            "body": "You also seem to be conflating. Your initial question was how do we in the abolition of the state do this but now you’re asking right after the revolution. Your question itself seems to be shapeshifting.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Statelessness doesn't mean being without decision making structures. I think a stateless society would have administrative infrastructure might even look like what we think of as a government. But if this structure is fully democratic and enmeshed in society and not separated _above_ society then it's not a state. It's just democratic self administration.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thr0waway3738",
                    "body": "I agree, authority seemed pretty vague when the person was talking about it. They thought of the state as a class itself and by that nature the working class could never be in control of it bc it would make them the ruling class.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Leogis",
                    "body": "But do you not think that is counter productive ?\nPromising democracy while also forcing people's hand is bound to make them more likely to join the opposition, and it has also lead to terrible collateral damage.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "orpheusoedipus",
                            "body": "Forcing whose hand? It would be a democracy for the workers, but the capitalist class who is currently in control and currently repressing workers is not going to give up power easily. In order to bring about democracy for the workers who are the majority and abolish class as a category the capitalist class needs to be stopped from attacking and reasserting the current conditions from which they benefit from. Lenin asked “freedom for whom, freedom to do what” freedom for the working class? Or freedom for the capitalists to continue exploiting us? The only counter productive thing would be to simply leave things as they are. Capitalists hold on to power through state violence and we can’t assert the will of workers by asking them nicely unfortunately. It’s not ideal it’s just the conditions in which we find ourselves.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Leogis",
                                    "body": "I'm not talking about the revolution itself, i'm talking about the \"dictatorship of the proletariat\", \"state capitalism\" or the \"transitory period\" that comes after during wich democracy will be put on hold to \"defend the gains of socialism\" against sabotage",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sourceenginelover",
            "body": "ignore the stupidity of the anarchists and read Marxist literature:\n\n[Friedrich Engels - On Authority](https://www.marxists.org/archive/marx/works/1872/10/authority.htm)\n\n[V. I. Lenin - The State and Revolution](https://www.marxists.org/archive/lenin/works/1917/staterev/)\n\n[Karl Marx, Friedrich Engels - The Communist Manifesto / The Manifesto of the Communist Party](https://www.marxists.org/archive/marx/works/download/pdf/Manifesto.pdf) (read the prefaces)\n\n[Karl Marx - Critique of the Gotha Programme](https://www.marxists.org/archive/marx/works/1875/gotha/ch04.htm)\n\n[Karl Marx - The Civil War in France](https://www.marxists.org/archive/marx/works/1871/civil-war-france/index.htm)\n\n[Friedrich Engels - The Origin of the Family, Private Property and the State](https://www.marxists.org/archive/marx/works/1884/origin-family/)\n\n[Amadeo Bordiga - The Democratic Principle](https://www.marxists.org/archive/bordiga/works/1922/democratic-principle.htm)\n\n[The First Congress of the Communist International (Comintern)](https://www.marxists.org/archive/lenin/works/1919/mar/comintern.htm)\n\n[Amadeo Bordiga - Proletarian Dictatorship and Class Party](https://www.marxists.org/archive/bordiga/works/1951/class-party.htm)\n\nDemocracy is NOT a principle. Democracy is an intermediary instrument.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Flat-Package-4717",
            "body": "There are two quotes that sum up Marx's belief about authority, although he does not say the word *authority*, it is synonymous.\n\n*\"The executive of the modern state is but a committee for managing the common affairs of the whole bourgeoisie\"  and \"political power, properly so called, is merely the organized power of one class for oppressing another\"*\n\nTo explain this in other words, Marx believed that the state or government was controlled by the wealthy ruling class, and anything that it did was decided by the ruling class. For an example, if the state decides to lower the minimum wage, then it is the ruling class who writes that law, and if the state declares war on another state then the declaration is written by the wealthy ruling class, not the workers and poor people.\n\nSince authority figures serve the state, it therefore means that authority serves the ruling class and follows the orders of the rich and powerful while oppressing the lower class.",
            "score": 2,
            "replies": [
                {
                    "author": "CrumbledFingers",
                    "body": "You need to complete the circle, however. In a revolutionary society, the ruling class is the proletariat, and they use their power to oppress the bourgeoisie. Marx is not against the acquisition and  application of authority by the working class during the period of revolutionary transition to communism, which in many situations takes decades or more.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Flat-Package-4717",
                            "body": "Marx says \"The proletariat will use its political supremacy to wrest by degrees all capital from the bourgeoisie, to centralize all instruments of production in the hands of the State, i.e., of the proletariat organised as the ruling class; and to increase the total of productive forces as rapidly as possible.\"\n\nHe then mentioned a list of ideas and measures for how to build a communist economy including \"Centralization of credit in the hands of the state, by means of a national bank with State capital and an exclusive monopoly.\", \"Extension of factories and instruments of production owned by the State\", \"Centralization of the means of communication and transport in the hands of the State.\" And \"Confiscation of the property of all emigrants and rebels.\".\n\nAlthoug Marx does say \"When, in the course of development, class distinctions have disappeared, and all production has been concentrated in the hands of a vast association of the whole nation, the public power will lose its political character.\" He does not mention the *withering away of the state*. This would perhaps mean that the revolution was supposed to end at the moment when a socialist state had been formed and that the state was supposed to manage the economy on behalf of the workers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cylongothic",
            "body": "[Actually, Engels wrote about Authority. ](https://www.marxists.org/archive/marx/works/1872/10/authority.htm)\n\nAs for me personally, the withering of the state is practically utopian thinking. I know that we make a big to-do about how the modern state is just a tool for the enforcement of class society, but there will probably always be a need for large scale organizational units to coordinate production and distribution. Whether we choose to call them \"states\" or not is a pedantic distinction, and I'm sure the anarchists will waste no time in pointing this out. I am sympathetic to the anarchist position (as a former anarchist myself), but I just can't shake the feeling that Anarchy would see human society reduced to little enclaves of a prefeudal character, and I am absolutely not charmed by the fascist call to RETVRN to our supposed roots. Personally, I would like us to have a space program. \n\nThis is all just my little old opinion :3",
            "score": 4,
            "replies": [
                {
                    "author": "None",
                    "body": "I think the Marxist withering away of the state means eventually society will be at a place where there's still central infrastructure and planning but no longer a need for borders, prisons etc as the main cause of crime and war (competing for property) will be gone. And I think there's good ideas in both Marxist theory and anarchist theory, both have their pros and cons.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": ">but there will probably always be a need for large scale organizational units to coordinate production and distribution\n\nThat's not what the state means in marxism tho. Marxists are not against, say, centralized control of the production or education or whatever. Didn't Engels talked about that specifically in this same article?\n\n  \n>Whether we choose to call them \"states\" or not is a pedantic distinction\n\nIt's not. It's an incredibly importand difference of the analysis.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "emekonen",
            "body": "The Zapatistas are an example of a stateless society. Not an example of one withering away but one established as such. Not sure if they’re Marxists or anarchists, I know Marxist professors helped them along. I also had a friend from Kerala, India and he said it’s very communist there, I’m about to order a book about it from someone who has lived in Kerala and worked in admin there. So not sure if the latter is an example or not as of now.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "I think it’s more accurate to say that Marxism has no *structural* analysis of authority.\n\nWhat I mean is that Marxists view authority kinda how liberals view capitalism.\n\nMany liberals think that capitalism is simply “when trade happens”, and some sort of interpersonal relationship or isolated act. \n\nExamples of this are the arguments around renting out lawnmowers and similar sorts of nonsense.\n\nAnarchists, however, see authority and hierarchy as *social systems*, just as Marxists recognise capitalism as a class system, a larger, pervasive social structure that goes beyond isolated interpersonal interactions.",
            "score": -1,
            "replies": []
        }
    ]
}