{
    "title": "Relative vs Equivalent forms",
    "author": "TheVictoriousII",
    "subreddit": "Marxism",
    "rank": 371,
    "score": 6,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Marxism/comments/1faq5eb/relative_vs_equivalent_forms/",
    "id": "1faq5eb",
    "selftext": "I know it's a rather recurring topic, but I didn't find an answer to my specific question. So here goes:\n\nWhen talking of the Relative vs Equivalent forms of value, using the x linen = y coats equation, Marx seems to contradict himself in these two quotes, both from Chapter One, Section 3:\n\n>When occupying the position of equivalent in the equation of value, the coat ranks qualitatively as the equal of the linen, as something of the same kind, because it is value. **In this position it is a thing in which we see nothing but value,** or whose palpable bodily form represents value.\n\nAnd\n\n>Hence, in the value equation, in which the coat is the equivalent of the linen, the coat officiates as the form of value. **The value of the commodity linen is expressed by the bodily form of the commodity coat, the value of one by the use value of the other.** As a use value, the linen is something palpably different from the coat; as value, it is the same as the coat, and now has the appearance of a coat. Thus the linen acquires a value form different from its physical form.\n\nIndeed, the first quote makes perfect sense to me — since the equation accounts only for the *value* of both commodities, we are focusing on what they both have *in common*, ie. we are abstracting from their use values, ie. their differing bodily forms. And yet, in the second quote, Marx says that it is exactly the *bodily form* of the coat that we account for. But that means we are equating the *value* of linen to the *body* of a coat, ie. apples to oranges. How is that even possible? As commodities in an exchange, at no stage of the analysis should the bodily form of *either* come into play at all. So what gives?",
    "comments": [
        {
            "author": "LocoRojoVikingo",
            "body": "Comrade, first, let me commend you for your deep engagement with Capital. Many stumble in these sections, and it is to your credit that you are struggling with these concepts, which are central to understanding Marx’s critique of political economy. Now, let us resolve the confusion between these two quotes with precision, for understanding the distinction between the relative form of value and the equivalent form of value is key to grasping how commodities relate to each other under the capitalist mode of production. \n\nThe first quote you reference states that the coat, as the equivalent, is not considered in terms of its use value but purely in terms of its value. Marx is explaining here that when we look at the coat in the position of the equivalent, we are focusing on its ability to express value. It no longer matters that it is a coat with a specific use. In this capacity, the coat stands for abstract human labor, the substance of value. In this sense, the bodily form of the coat as an object disappears from the equation. We are looking at it as an embodiment of labor time, as value. \n\nNow, in the second quote, Marx seems to suggest something different: he points out that the bodily form of the coat is necessary for the value of the linen to be expressed. This might appear contradictory, but it is not. Let us examine why. \n\nWhen we say that the coat expresses the value of the linen, we are forced to recognize that value must take on a form to be visible in the material world. In a capitalist system, value is invisible, abstract—it must be expressed through something concrete. In the equivalent form, the commodity (here, the coat) acts as the material representative of value. The bodily form of the coat is the form through which the linen's value is expressed, even though we are abstracting from the coat’s use value. \n\nLet me explain this further: \n\nThe relative form of value (the linen) seeks expression. The linen has value, but that value is abstract, it is labor-time that is socially necessary—but invisible.\nThe equivalent form of value (the coat) materializes that value. The coat’s bodily form stands in for the abstract value of the linen, but not in terms of the coat's use value—this is the key. The bodily form of the coat makes the abstract concept of value tangible, but we are not considering the use of the coat in this equation. The coat is reduced to a mirror through which the value of the linen is made visible. \n\nMarx beautifully captures this relationship between form and substance in the value expression. The value of the linen finds its form through the coat, but that doesn’t mean we care about the coat as a coat—it means the coat, in this specific relationship, functions as a vessel for the abstraction of value. We have to “see” value, and it is “seen” through the bodily form of the equivalent commodity. In other words, the coat expresses value through its form, not through its utility. \n\nThe physical form of the coat becomes the form of value of the linen, and therefore the coat becomes value in relation to the linen, or appears as value. This is critical. The bodily form of the coat, in relation to the linen, becomes the form through which value is expressed. But it is still only a form of value, not the use value of the coat. \n\nWhat may seem contradictory is resolved by recognizing that the bodily form of the coat is needed to give value a material appearance, but we are not equating use values (linen for coats) or ignoring the value relationship. Rather, the bodily form of the coat serves to represent value—it is simply the vehicle for the abstract labor that both commodities embody. \n\nWhy is this so crucial for Marx's analysis? Because it reveals the fetishism of commodities. The act of exchange mystifies the social relations that produce value, making it appear as though value exists in the commodities themselves, when in fact it is a relation of abstract human labor. By focusing on the coat's bodily form, Marx shows how value, an abstract concept, can only be grasped through a material, physical thing in the process of exchange. \n\nMarx’s genius here lies in showing how value, which is invisible, must take on a visible form, and how in this process, the commodities begin to mystify the very social relations they embody. \n\nComrade, continue your studies with confidence. As Marx said: \n\n\"There is no royal road to science, and only those who do not dread the fatiguing climb of its steep paths have a chance of gaining its luminous summits.\"",
            "score": 6,
            "replies": [
                {
                    "author": "TheVictoriousII",
                    "body": "Wow, big, big, thanks! You didn't overestimate me and went through the whole thing step by step, even repeating yourself. You made what I only vaguely intuited very clear and I finally understand. And thanks for the kind words as well.\n\n  \nThe fetishization part sounds very interesting too. I've not gotten to that part in the book yet. From what I gather, it seems that capitalist exchange obscures the difference between value and use value, and that while the former may go up and down, the latter never changes. Looking forward to getting there!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill-Software8713",
            "body": "Not sure but my reading is that quote is that the emphasis isn't the linen's exchange value is = to the coat's use value, but emphasizing how the coat provides a kind of mirror in which the linen's value is reflected. One can't establish that the linen has value outside of that equality, but it does it through another commodity which in this example has a physical/bodily form. It's not the equivalence of the linens exchang value with the coat's use value but emphasizes that the physical form of the coat provides an expression or visual form to the linen's exchange value.   \nAnd of course one can establish such an equality of commodities of all sorts before one ends up with the universal medium of money and as such in all such commodities is the value of one commodity reflected back onto it by the other commodities. To say X amount of linen is worth Y amount of coats.\n\nAt least that's the most charitable attempt I can offer.",
            "score": 2,
            "replies": [
                {
                    "author": "TheVictoriousII",
                    "body": "You're most likely correct. He does mention that the coat functions at the same time as pure value, in addition to a use value, in the equation. I just don't see why he would mention use value at all here. It comes as a total curve ball for me. Or, having mentioned it, I don't see why he should stress the use value of the coat moreso than the linen. Why is use value more relevant to the Equivalent form than the Relative? In fact, I'm not even sure why this differentiation between the poles of the equations is necessary in the first place...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "C_Plot",
                            "body": "Chapter one includes an advanced course in Hegelian metrology, which is why many find it so hard to read (and as an introductory chapter as well). In measurement, it is units of use-value that stand as the measure of another use-value. \n\nThis is true on most any measure. For example, water at its maximum density (measure in milliliters) becomes the measure of mass (grams) of all other objects of matter. This water occupies the equivalent pole for measuring all other objects of matter. Water becomes the universal equivalent for the abstract matter borne by all objects of concrete matter.\n\nThe poles can be reversed, but measurement relies on a standard of measure (in different units than being measured such as milliliters of water for measuring mass or kg of gold for measuring value). In the classical political economists, this metrology is all confused. So Marx has to disentangle the mess. This led him to his crucial distinction of labor and labor-power. It is abstract labor that is the common substance of all objects of value. The prior classical labor theories of value treated labor (undistinguished from labor-power) as occupying the equivalent pole. \n\nCritics of Ricardo, such as Torrens, would point out that any commodity could be substituted for labor (as a commodity) and then you have a corn theory of value or a gold theory of value. Marx’s advanced lesson in metrology is meant to confront directly these missteps on classical political economy. The common substance is abstract labor. The use-value occupying the equivalent pole can be labor-power, or corn, or gold—none of those various commodities occupying the equivalent pole negates abstract lsbor as the common substance of value for all objects of value. Torrens and other critics (and the classical political economists with their flawed theories of value) profoundly misunderstood metrology.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Ill-Software8713",
                            "body": "I think you’re tripped up by the word use but I do think he is simply emphasizing the bodily form which constitutes the coats use value. And in the following sentence we see the emphasis being the incommensurability of each commodities use values.\n\nAnd I think the relative and equivalent form reflects the position of the person trading each commodity:\n\n“Here both, linen and coat, are at the same time in relative value-form and in equivalent form. But, nota bene, for two different persons and in two different expressions of value, which simply occur (ins Leben treten) at the same time. For A his linen is in relative value-form – because for him the initiative proceeds from his commodity – and the commodity of the other person, the coat, is in equivalent form. Conversely from the standpoint of B. Thus one and the same commodity never possess, even in this case, the two forms at the same time in the same expression of value.”\n\nSo the coat in itself doesn’t express the value of linen but is a means of expressing the relative value of the linen itself, the coat is a mirror for the linen’s own value.\nIt has to have value in order to be exchanged and you can’t directly see the value by examining this exchange, because as will see later on, it’s exchange value can be posited against an infinite amount of commodities with their own value.\nAnd part of presupposing there exists an actual value of the commodity which is to be inferred is an inference that the item has a stable value in relation to all other commodities rather than an arbitrary one. Part of defending such a stability of value eventually flows into Marx’s assertion of an equality of average social labor (not an equality of physiological effort expanded in labor)\n\nhttps://www.marxists.org/archive/rubin/value/ch12.htm\n“This opponent was [Samuel] Bailey, who held that the concept of value is thoroughly unnecessary in political economy, that one must restrict oneself to the observation and analysis of individual proportions in which various goods are exchanged. Bailey, who was more successful in his superficiality than in his witty critique of Ricardo, tried to undermine the foundations of the labor theory of value. He maintained that it is wrong to speak of the value of a table. We can only say that the table is exchanged once for three chairs, another time for two pounds of coffee, etc.; the magnitude of the value is something thoroughly relative, and it varies in different instances. From this Bailey drew conclusions which led to the negation of the concept of value as a concept which differs from the relative value of a given product in a given act of exchange. Let us imagine the following case: the value of a table equals three chairs. A year later, the table is exchanged for six chairs. We think we are right if we say that even though the exchange value of the table has changed, its value has remained unchanged. Only the value of the chairs fell, to half their former value. Bailey finds this statement meaningless. Since the relation of exchange between the table and the chairs changed, the relation of the chairs to the table changed also, and the value of the table consists only of this.\n\nIn order to disprove Bailey’s theory, Marx considered it necessary to develop (in Capital) the conception that exchange value cannot be grasped if it is not reduced to some common factor, namely to value. The first section of Chapter 1 of Capital is devoted to giving a foundation to this idea of the transition from exchange value to value and from value to the common basis under both, namely labor.”\nFurther reading: https://kapitalism101.wordpress.com/2014/04/28/intrinsic-value/\n\nAnd assuming they have value and we don’t yet know what that value is derived from, it’s enough at this point to make the point that the relative/equivalent value-forms are exactly that, only forms of appearances of value but not value itself.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}