{
    "title": "When shouldn't we participate in parlament? ",
    "author": "aboliciondelastetas",
    "subreddit": "Marxism",
    "rank": 369,
    "score": 16,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/Marxism/comments/1fb3d32/when_shouldnt_we_participate_in_parlament/",
    "id": "1fb3d32",
    "selftext": "After reading *Left wing communism* by Lenin it is clear he supports participating in bourgeois elections and parlaments as its important to the working class\n\nHowever, reading about the October Revolution and the previous years, he opposed this tactic in particular moments. It happened several times under zarist rule and in september-october 1917 he opposed participating in the anteparlament as it was a tool the capitalist class would use to relegate the soviets to a secondary paper, and participating would mean confusing the working class about the true intentions of this institution. Thats the argument Stalin gives in *Trotskyism or leninism*. However, he does not go in depth and such an argument can be fabricated to justify not participating in basically all parlaments. So, is there any texts that go more in depth about when we shouldn't participate in elections and Parlaments? For example, by Lenin in cases he supported boicotting as a tactic?",
    "comments": [
        {
            "author": "sourceenginelover",
            "body": "Support for participation in parliament should be directly correlated to the revolutionary situation, be it favorable or unfavorable.\n\nOn the eve of revolution, participation should be staunchly boycotted (it would mean directing the working class's revolutionary energy towards bourgeois electoralism, thus the death of the revolution - as simple electoral means could never overthrow the bourgeoisie and the bourgeoisie has historically pacified the proletariat through parliamentarian concessions)\n\nIn a highly unfavorable situation, participation is an acceptable strategy (it exposes the Communist programme to the proletariat at large and it highlights class conflict, the stark differences between the class interests of the bourgeoisie - & their affiliated parties - and the interests of the proletariat). But, to make it abundantly clear, participation should not be done by joining bourgeois parties (riding the coat tails of the bourgeoisie) - instead, by the creation of a separate, proletarian class party",
            "score": 20,
            "replies": []
        },
        {
            "author": "WarmongerIan",
            "body": "Here two of Lenin's pamphlets concerning the State Dune and what to do about it;\n\n[Should we boycott the State Duma?](https://www.marxists.org/archive/lenin/works/1906/jan/00.htm)\n\n\n[The State Duma and Social-Democratic Tactics](https://www.marxists.org/archive/lenin/works/1906/feb/00.htm)\n\n\nDon't listen to the weird Anarchist in the comments rambling about how Lenin actually hated democracy.",
            "score": 10,
            "replies": [
                {
                    "author": "sourceenginelover",
                    "body": "Communists see democracy as a means to an end, not an invariable principle in and of itself. The Dictatorship of the Proletariat is the largest expansion of democracy and a necessary stage towards establishing Communist Society. Democracy will wither away with the state",
                    "score": 7,
                    "replies": [
                        {
                            "author": "PompeyCheezus",
                            "body": "Democracy should be a principle in and of itself, just not the one person, one vote form of representative democracy we practice in the West. The Mass Line and the Soviets are both forms of democracy.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EctomorphicShithead",
            "body": "Lenin makes clear when the conditions deem necessary, e.g. as long as masses of workers are convinced of and invested in the political legitimacy of bourgeois parliaments, communists must use them both for the purpose of advancing workers’ interests legally and exposing the corruption and opportunism through which bourgeois parliaments subvert workers’ demands.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "You need to start with Marx and Engels in 1850  \n\n\nAddress of the Central Committee to the Communist League\n\n(Karl Marx and Frederick Engels, London, March 1850)\n\n> ... 3. As soon as the new governments have established themselves, their struggle against the workers will begin. If the workers are to be able to forcibly oppose the democratic petty bourgeois it is essential above all for them to be independently organized and centralized in clubs. At the soonest possible moment after the overthrow of the present governments, the Central Committee will come to Germany and will immediately convene a Congress, submitting to it the necessary proposals for the centralization of the workers’ clubs under a directorate established at the movement’s center of operations. The speedy organization of at least provincial connections between the workers’ clubs is one of the prime requirements for the strengthening and development of the workers’ party; the immediate result of the overthrow of the existing governments will be the election of a national representative body. Here the proletariat must take care: 1) that by sharp practices local authorities and government commissioners do not, under any pretext whatsoever, exclude any section of workers; 2) that workers’ candidates are nominated everywhere in opposition to bourgeois-democratic candidates. As far as possible they should be League members and their election should be pursued by all possible means. Even where there is no prospect of achieving their election the workers must put up their own candidates to preserve their independence, to gauge their own strength and to bring their revolutionary position and party standpoint to public attention. They must not be led astray by the empty phrases of the democrats, who will maintain that the workers’ candidates will split the democratic party and offer the forces of reaction the chance of victory. All such talk means, in the final analysis, that the proletariat is to be swindled. The progress which the proletarian party will make by operating independently in this way is infinitely more important than the disadvantages resulting from the presence of a few reactionaries in the representative body. If the forces of democracy take decisive, terroristic action against the reaction from the very beginning, the reactionary influence in the election will already have been destroyed.  \n> [Address of the Central Committee to the Communist League by Marx and Engels (marxists.org)](https://www.marxists.org/archive/marx/works/1847/communist-league/1850-ad1.htm)\n\n---\n\nThe question I have about bourgeois elections:  \n- In 1931, why did the German Communist Party (KPD) support the NSDAP (Nazi) referendum to bring down the Social Democratic government of Prussia?   What Marx, Engels or Lenin ever support a right-wing or fascist initiative to overthrow a social-democrat?  Did Stalin support this?  \n  \n> \"In August 1931, to capitalise on their growing popularity, the Nazi Party launched a referendum to overthrow the Social Democratic government of Prussia. At first the KPD correctly attacked it. Then, three weeks before the vote, under orders from Stalin's Comintern, they joined forces with the fascists to bring down the main enemy, the Social Democrats. They changed the name of the plebiscite to a 'Red Referendum' and referred to the fascists and the members of the SA as 'working people's comrades'!\"    \n> Rob Sewell, *Germany: From Revolution to Counter-Revolution*, Fortress Books (1988), [ISBN](https://en.wikipedia.org/wiki/ISBN_(identifier)) [1-870958-04-7](https://en.wikipedia.org/wiki/Special:BookSources/1-870958-04-7), [Chapter 7](http://www.marxist.com/germany/chapter7.html).   \n> available online here: [https://www.google.com.au/books/edition/Germany\\_From\\_Revolution\\_to\\_Counter\\_Revol/y259DwAAQBAJ?hl=en&gbpv=1&dq=Germany%3A%20From%20Revolution%20to%20Counter-Revolution%20sewell&pg=PT90&printsec=frontcover](https://www.google.com.au/books/edition/Germany_From_Revolution_to_Counter_Revol/y259DwAAQBAJ?hl=en&gbpv=1&dq=Germany%3A%20From%20Revolution%20to%20Counter-Revolution%20sewell&pg=PT90&printsec=frontcover)",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "Firstly, it's spelled parliament. \n\nSecondly, Lenin disliked democracy, and whilst he was the first person in Russia to ever run free elections...he lost...so he discarded the result.\n\nLenin didn't like democracy, but he did encourage limited participation in parliament purely to spreaf leftist ideas amongst the population. So it is not a bad idea overall, just likely pointless in many countries which would not let anarchists in/they would not be voted for.\n\nIn my country some socialists are voted in, we even had four communists (now three) in Parliament. But anarchists are just laughed at by communists/socialists, I won't lie. It's a shame though, they should be represented.\n\nEdit: \n\nFor anyone who didn't know, Lenin lost to the Socialist Revolutionary Party by 7 million votes and overturned the result. This is why I say he's against democracy, as without a doubt he is. Objectively. \n\nhttps://en.wikipedia.org/wiki/1917_Russian_Constituent_Assembly_election\n\nI for one am glad that Lenin overturned the result, to argue that peasants who had never voted in their life knew what was better for the country than Lenin is questionable.",
            "score": -14,
            "replies": [
                {
                    "author": "GeistTransformation1",
                    "body": "Lenin was one of the greatest advocates for democracy in history, it's nonsense to say that he didn't like it considering his entire platform was about fulfilling the democratic needs of the masses, and Soviet elections were more free than what the constituent assembly could provide.\n\n>But anarchists are just laughed at by communists/socialists, I won't lie. It's a shame though, they should be represented.\n\nRepresented through what? They're too insignificant for there to be any need to compromise with them.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "pharodae",
                            "body": "Haha that's crazy I didn't know Lenin loved demcracy like that. He loved it so much that he named his faction \"Those of the Majority\" despite holding a minority position of the worker's party. \n\nLook, I'm rather neutral on Lenin as a whole, despite my numerous disagreements with him he did genuinely seem to act in the interests of the peasants and workers (usually), however you can't take a serious look at the history of Lenin and the Bolshevik's rise to power and come to the conclusion that he was \"one of the greatest advocates for democracy in history\" - especially if you intend to extend that definition to the Western conception of political democracy and/or the democratic control of the workplace by rank-and-file workers (and not the roundabout worker's state justification).",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "sourceenginelover",
                                    "body": "ownership of a factory by its workers is not Communist, it's petite-bourgeois anarcho-syndicalism \n\nLenin didn't \"love\" democracy. Lenin acknowledged that expanding democracy was a necessary step towards Communist Society, but that it would ultimately wither away",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SilverWorld4330",
                                            "body": "respect for your opposition to \"workers control\" as being anything more than another method of capitalist organization but lenin didn't believe in democracy in the abstract like that beyond some lines in state and revolution, the 1918 constitution gave workers 5x the votes in order to maintain the proletarian state against the pressure of the reactionary peasantry",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "sourceenginelover",
                                                    "body": "i dont understand what you mean. Lenin didn't believe in democracy as a principle, this is what i've been saying throughout this whole thread. Democracy was simply a means to an end. The peasantry was subordinated to the proletariat, any collaboration with the peasantry was born out of pure material necessity, not out of principle. he supported democracy as a STAGE, not indefinitely. The State and Revolution accurately reflected his views, it wasn't just some text that wasn't connected to reality. The theory described in the State and Revolution corresponds to his actions within the Bolshevik party\n\nthe soviets were not the same thing as factory councils taking ownership of factories. the entire working class is meant to take hold of ALL the means of production, not just sections of it control of some means of production. Lenin was not a councilist, he was a Communist",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "pharodae",
                                            "body": "I fail to see how \"expanding democracy\" in an abstract sense is a necessary step towards communism, but democratic control of the MOP is not. I assume you mean \"democracy\" in a liberal democracy sense. Literal socialism is a step towards communism per the Marxist playbook.\n\nDepending on the circumstances and context, yes, a worker-owned MOP can replicate capitalist forms, especially if the extractive colonial nature of the supply chains remain intact - however, this is not an issue that is fixed or mitigated by state ownership/control either, so I'm not sure where your criticism stems from.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "sourceenginelover",
                                                    "body": "you fail to see it because you have not read The State and Revolution. the lower phase of Communist Society, Socialism, can't be achieved without the Dictatorship of the Proletariat. Expanding democracy is necessary, but democracy will wither away with the state. Democracy is not a principle for Communists",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "pharodae",
                                                            "body": "I have read S&R several times, I just don't put a lot of stock into it. You can't trust a theory book whose writer ignored 90% of its contents once he actually came into power. I also have a lot of issues with phase/stage-theories of history since the archaelogical and ethnographic record of human social development is often far, far more complex than what stage theories have to offer in terms of analysis.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Nuke_A_Cola",
                                                                    "body": "How did the Bolsheviks ignore State and Revolution!? \n\nLenin was no stageist either, that’s a misinterpretation of his theory often supported by politically moderate “communist” revisionism. It’s written in abstract as we have no idea what it’ll look like in practice and it’s not some regimented program to follow. The important theory was about how to treat the state now, about revolution and about the dictatorship of the proletariat in the aftermath to protect a new workers state.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "pharodae",
                                                                            "body": "He literally launched the New Economic Policy which explicitly recreated capitalists forms of economics in order to build the productive forces of the nation - why would you ever do this if you didn't believe in the stage theory of development? Surely there are ways they could have organized a more grassroots and less self-defeating system of building their productive forces.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Nuke_A_Cola",
                                                                                    "body": "He did that to stop the state from collapsing during the civil war and afterwards where the proletariat more than halved, industry stalled at 20% of pre civil war levels, was entirely dedicated to arming the red army and overall workers were starving. It was also to temporarily placate the peasantry who did not like having grain requisitioned from them to feed the cities. Millions of people died in the war. \n\nThere’s no magical solution to that other than Russia being saved by international revolution. Which they had bet on. It’s not stageist to realise you needed to stop the workers state from imploding in the immediate situation. And that to have a workers state you need actual workers who are fed and work.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "sourceenginelover",
                                                                    "body": "so you're not a Communist and are also lying lol\n\nI misread your reply. The expansion of democracy I'm talking about is anything but \"abstract\" - it is as practical as can be, and not only that, it is the only way to progress towards Communist Society. The expansion of democracy I was referring to is the same one mentioned in The State and Revolution, the wresting of political & economical power from the bourgeoisie, by the proletariat, with the proletariat thereby abolishing itself as a class. \n\nThe *entire* proletariat (concentrated in the Vanguard Party) shall take possession of **ALL** of the means of production and abolish itself as a class.\n\nRegardless, I am not here to debate. Communists do not debate, they simply present the Communist Programme.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Nuke_A_Cola",
                                                                            "body": "Communists do debate all the time lol, Lenin had to argue most of his points for hours and hours to the central committee before they put it to a vote. Sometimes he was unsuccessful and had to come back for a second round after rousing the masses to support him.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GeistTransformation1",
                                    "body": "> however you can't take a serious look at the history of Lenin and the Bolshevik's rise to power and come to the conclusion that he was \"one of the greatest advocates for democracy in history\"\n\nI can.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": ">considering his entire platform was about fulfilling the democratic needs of the masses\n\nI agree, but the fact still remains he discarded the election results when they went against him.\n\n>Represented through what?\n\nThrough Parliamentary representation, e.g. representing the people\n\n>They're too insignificant for there to be any need to compromise with them.\n\nWho are too insignificant? Anarchists or every government in the world? And no, I am not Amerikan, non Yanks do exist!",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Nuke_A_Cola",
                                    "body": "You need context for what the election results actually meant. Communists do not simply change their platform and rhetoric to reflect the masses, they instead argue to the masses their radical platform to win them over. Losing an election is meaningless, revolutionary communists expect to lose every election up until basically before insurrection. \n\nLenin was never under any illusion that the Bolsheviks would be voted in. Bourgeoise democracy is not a democracy and will never result in revolutionary socialists winning. The elections are done to gauge the communists support, to use as a launching point for their rhetoric and as a political tool. This is explicitly stated in the bolsheviks theoretical debates on participating in elections - many didn’t even want to due to being completely undemocratic tools of the bourgeoisie to neuter the working class, which is true but misses the reasons why we should participate - hence Lenin weighing in on the debate in 1920. \n\nThe constituent assembly deserved to be dissolved as it was a pale comparison to the mass workers democracy of the soviets. It had really nothing to do with the Bolsheviks winning or losing in it. It was a tool of class warfare used to mislead workers into maintaining illusions with bourgeoise democracy. Entirely unrepresentative. The Bolsheviks weren’t even a majority in the soviets until after the kornilov coup. Once the soviets had voted for majority in favour of insurrection is basically the signifier that they had fully turned to revolutionary politics led by the Bolsheviks. Then we turn to the dictatorship of the proletariat with the soviets as the new democratic building block and the party as the leadership. \n\nCommunists are basically meant to argue to workers to take a revolutionary communist position and not water themselves down on questions of important substance even if it would win you an election or get you more seats - that’s opportunism. That’s what separates revolutionaries from reformists ultimately. It’s fine to meet workers where they are at as long as you don’t compromise on the fundamental questions. It’s fine to lose an election, elections don’t mean the same things to us as to bourgeoise and reformist parties. Our strength is mass politics. \n\nLenin always saw the soviets as vital for democracy under the dictatorship of the proletariat.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I am referencing this election when the Socialist Revolutionary Party beat the Bolsheviks by 7 million votes, and Lenin discarded the result. I like Lenin, and I am suspicious of democracy as a whole, but to argue that he didn't dislike democracy is silly.\n\n[https://en.wikipedia.org/wiki/1917\\_Russian\\_Constituent\\_Assembly\\_election](https://en.wikipedia.org/wiki/1917_Russian_Constituent_Assembly_election)",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Nuke_A_Cola",
                                                    "body": "I mentioned the constituent assembly in my paragraph. Contextually it was completely undemocratic, built on a bourgeoisie parliamentary system that did not give proles representation. Lots of the reps were not accountable to the masses who had massively shifted to the left by that point. The SR party was disintegrating after October and had no popular mass support outside of the peasantry! Lots of the delegates were basically fraudulently representing people who no longer wished them to or were made up reps of the peasantry who had no say either way and no choice. The soviets were the supreme organ of the workers state, most workers did not care for the constituent assembly **at all** by this point. The vote was basically an attempt to gaslight the revolutionaries and pull the rug out from them and it failed miserably. \n\nBourgeoise parliament is not democratic or impartial, it’s capitalist through and through! \n\nAre you familiar with the slogan All Power to the Soviets?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "Haha, well at least we agree that the result of the election with Lenin retaining full autocratic power was a good thing. I'll read into it more later and see if I can come to the same conclusions as you regarding your other points! 🤝",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Nuke_A_Cola",
                                                                    "body": "He didn’t have full autocratic power though. Lenin himself did not consider himself to have this. He was a beloved party leader for sure but was accountable to the executive and central committees and more importantly the masses as represented by the soviets. Through most of the party’s life he was actually arguing for minority political lines in the party despite being its most important leader. The way he fought for his beliefs was relying on the pressure of the masses. In his speeches he always emphasises the democratic nature of the masses, the party and of the soviets being essential to socialism. He’s portrayed as an authoritarian by the bourgeoisie and by Stalinists that don’t read theory critically and see no nuance in his actions. \n\nHe could have been voted off of the committees he was on at any time. Even at his most unpopular post October he wasn’t due to being basically the theoretical head of Marxism, the most skilled orator and most insightful polemicist respected by revolutionaries in every country of the world. It’s a complete debasement of his principles and of historical record to say he was an authoritarian with dictatorial power. The dictatorship of the proletariat is **of** the proletariat, not over it.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sourceenginelover",
                                            "body": "Bourgeois democracy IS democracy. Athenian democracy WAS democracy. This is revisionist nonsense from someone who has clearly not read Lenin. \n\nCommunists never speak in terms of what is \"deserved\", what is \"just\", etc. this is moralist nonsense. Communists solely speak in terms of social necessity. \n\nNot all soviets had Bolshevik majority, the Bolsheviks awaited for majority in the majority of the most important industrial areas.  They never awaited 50% + 1.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Nuke_A_Cola",
                                                    "body": "https://www.marxists.org/archive/lenin/works/1917/jul/18.htm\n\nhttps://www.marxists.org/archive/lenin/works/1918/dec/23.htm\n\nLenin arguing about the class nature of democracy. Communists must ask “democracy for whom?” He was not arguing for abandoning democracy altogether quite clearly, just the idea of bourgeoise democracy - and that any other class deserves democratic rights other than the proletariat in a proletariat state.  Lenin was the major proponent of the soviets and of democratic structures within the party. The distinction is Communists don’t fetishise democracy, it’s a tool to be used and an aspect of empowering the proletariat in class struggle. It’s not the ultimate moral aim. You should look into his debates with Rosa Luxembourg if you want a fuller picture on party structure. \n\nCommunists can speak in terms of morality from a personal perspective lol, we aren’t robots. Particularly if it lends weight to our arguments. It’s just not something to be relied upon for theory as we aren’t moralists, we don’t decide things based on moralism but on what advances the class struggle. \n\nI didn’t say they had to have a majority in every soviet. They had a majority in those that mattered and overall had the working class behind them. Lenin argued that insurrection was necessary but was adventurism until they had won over the soviets and the peasantry to the idea - they’d be crushed without popular support.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "sourceenginelover",
                                                            "body": "From the State and Revolution (my bold, separate paragraphs):\n\nParagraph 1\n\n>And so in capitalist society we have a democracy that is curtailed, wretched, false, a democracy only for the rich, for the minority. The dictatorship of the proletariat, the period of transition to communism, will for the first time create democracy for the people, for the majority, along with the necessary suppression of the exploiters, of the minority. **Communism alone is capable of providing really complete democracy, and the more complete it is, the sooner it will become unnecessary and wither away of its own accord.**\n\nParagraph 2\n\n>**Democracy is a form of the state**, it represents, on the one hand, the organized, systematic use of force against persons; but, on the other hand, it signifies the formal recognition of equality of citizens, the equal right of all to determine the structure of, and to administer, the state. This, in turn, results in the fact that, at a certain stage in the development of democracy, it first welds together the class that wages a revolutionary struggle against capitalism--the proletariat, and enables it to crush, smash to atoms, wipe off the face of the earth the bourgeois, even the republican-bourgeois, state machine, the standing army, the police and the bureaucracy and to substitute for them a more democratic state machine, but a state machine nevertheless, in the shape of armed workers who proceed to form a militia involving the entire population.\n\nParagraph 3\n\n>From the moment all members of society, or at least the vast majority, have learned to administer the state themselves, have taken this work into their own hands, have organized control over the insignificant capitalist minority, over the gentry who wish to preserve their capitalist habits and over the workers who have been thoroughly corrupted by capitalism--from this moment the need for government of any kind begins to disappear altogether. **The more complete the democracy, the nearer the moment when it becomes unnecessary. The more democratic the “state” which consists of the armed workers, and which is \"no longer a state in the proper sense of the word\", the more rapidly every form of state begins to wither away.**\n\nParagraph 4\n\n>Democracy for the vast majority of the people, and suppression by force, i.e., exclusion from democracy, of the exploiters and oppressors of the people--this is the change democracy undergoes during the transition from capitalism to communism.\n\n>Only in communist society, when the resistance of the capitalists have disappeared, when there are no classes (i.e., when there is no distinction between the members of society as regards their relation to the social means of production), only then \"the state... ceases to exist\", and \"it becomes possible to speak of freedom\". **Only then will a truly complete democracy become possible and be realized, a democracy without any exceptions whatever. And only then will democracy begin to wither away, owing to the simple fact that, freed from capitalist slavery, from the untold horrors, savagery, absurdities, and infamies of capitalist exploitation, people will gradually become accustomed to observing the elementary rules of social intercourse that have been known for centuries and repeated for thousands of years in all copy-book maxims. They will become accustomed to observing them without force, without coercion, without subordination, without the special apparatus for coercion called the state.**\n\nJust read [The State and Revolution](https://www.marxists.org/archive/lenin/works/1917/staterev/). Seriously. Democracy withers away with the state. It is not a principle. It is not an \"end goal\". Downvote away, I do not care. This is the correct stance.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Nuke_A_Cola",
                                                                    "body": "I’m in agreement but would emphasise different points, I’ve read state and rev several times. I don’t think what you’re highlighting is incompatible with anything I have said. A communist’s immediate implementation of program shifts with time based on what’s the pre-eminent political situation. Lenin argued for democracy and was its strongest proponent under and in the build up to the dictatorship for be proletariat. Transitioning to socialism radically changes the social conditions of society which he illustrates. They never got that far in Russia. The proletariat state never begun to wither away. It’s correct to say he was vehemently pro democracy for the proletariat in the form of the soviets and for establishing democratic procedures in the party, he just did not fetishise it but understood it as a tool. You emphasise what is important at different times depending on the needs of the political situation. He’s arguing for the need to expand democracy as part of emancipating the proletariat. Here he’s polemicising against the bourgeoisie parliament and arguing for a DoTP. He pens in abstract what “true” democracy is as we get closer to communism and correctly points out that democracy itself is a tool of class rule. That’s what makes him its greatest proponent! \n\nYou’re missing the forest for the trees.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "sourceenginelover",
                                                                            "body": "What exactly am I missing? Democracy is a necessary step in order to progress towards Communist Society, not an end goal. I am aware they never reached Socialism.\n\nThe Dictatorship of the Proletariat is a Democracy, so Democracy is necessary up to a point. Nothing he said seems abstract to me, it's all very practical, pragmatic and anchored in reality.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "sourceenginelover",
                                    "body": "even from your petite-bourgeois perspective you are incorrect, the Duma refused to call another vote accounting for the split among the SR's (Left and Right wing SR's)\n\nthere is not a single revolution that waits for a 50% + 1 majority and there never will be \n\nparliamentarism is not Communist",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "> man shut the fuck up retard \n\n  \nTruly you must be one of the thinkers of all time.\n\n> but oh wait guys we gotta put the revolution on hold and respect democracy by letting a left wing bourgeois party take power\n\nNope, I categorically agreed with the actions Lenin took. Lenin was in the right.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "senopatip",
            "body": "I think political parties shouldn't exist at all, it creates factionalism and corruption. Parliament should be \"elected\" through Sortition, not voting, as voting makes the most popular people to win, and that creates unfair competition among citizens. \n\nChoices should be about policy, not people. Why choose a person instead of directly choosing policies? See what happens in USA when you try to choose people to carry out your favorite policies. Is it working? Obviously not. The person they elect never makes policy that benefit the voters.",
            "score": -1,
            "replies": []
        }
    ]
}