{
    "title": "Is it possible that Jeff Bezos has read Das Kapital?",
    "author": "damagedproletarian",
    "subreddit": "Marxism",
    "rank": 372,
    "score": 0,
    "upvote_ratio": 0.37,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/Marxism/comments/1fb5qln/is_it_possible_that_jeff_bezos_has_read_das/",
    "id": "1fb5qln",
    "selftext": "Amazon is quite a ruthless and exploitive company. It's is much closer to how Marx explains capitalism as being about \"ruthless exploitation\" than it is about Adam Smith's description of producers working in their self-interest creating an \"invisible hand\" of the market. The original name of Amazon was \"Relentless\" and Bezos was certainly an ambitious and curious reader. He may have found Marx's work in his youth.   \n  \nIf Bezos got some of his ideas from Marx's works then it shows a lot of irony. The reading material that is supposed to held educate the proletariat has been used to further exploit them.  ",
    "comments": [
        {
            "author": "TankieVN",
            "body": "I personally reject this idea. Capitalism encourages exploitative practices by itself through competition. No capitalists want to lose the competition so they will fo anything to prevent it.",
            "score": 35,
            "replies": []
        },
        {
            "author": "WarmongerIan",
            "body": "Capital is a work describing how capitalism works. So yes it's entirely possible he read it. But does it matter?\n\n\nIn fact plenty of capitalists do understand quite a few concepts and important parts of Marx's work because it's in their interest to know how capitalism operates, not to dismantle it like the proletariat but to further their own goals. \n\n\nCapital's analysis of capitalism can be read and understood by anyone, but it won't change their class interest. Any member fo the  bourgeoisie that reads it would have to become a class traitor, and while some number actually do, the vast majority do not.\n\n\n\nSo regardless if he read it or not it doesn't really matter. He still understands how to further his own class interests. That's class consciousness, it's why the workers should read Marx's work, to understand how to further their own class interests against those of the capitalist class.",
            "score": 32,
            "replies": [
                {
                    "author": "rpbmpn",
                    "body": "Was wondering about this today.\n\n1 Am I right in thinking that elements of Marxism (Marxism Leninism?) emphasize the scientific and predictive power of Marxism and downplay 'morality'?\n\n2 Then given its predictive power, is it not in the interest of a given capitalist to study and apply Marxist understanding for their own ends?\n\n3 (Basically an extension of 2) Do we know of any particular instances where Marxist understanding has been applied in order to generate personal fortunes, relying on its understanding of markets and predictive power?\n\n(Entirely open to the idea that this is not a novel thought, but perhaps something we see every day, or even the default in the current age, or something like this. Have no idea either way.)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "damagedproletarian",
                    "body": ">it's why the workers should read Marx's work, to understand how to further their own class interests against those of the capitalist class.\n\nI just seems to me that the working class is kept as ignorant as possible on purpose. Women are discouraged from taking up an interest in politics for example. I'm suspicious that the ruling class absolutely knows Marxism very well and they use this knowledge to stop the working class from rising up. The other theory is that the working class is being tested and taught lessons like a giant open world school.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "WarmongerIan",
                            "body": "Of course they know about Marxism. It's in their best interest to discourage it and they take active action against it. \n\n\nI don't know what are you talking about a open world school??? What on earth do you mean?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "damagedproletarian",
                                    "body": "> I don't know what are you talking about a open world school??? What on earth do you mean?\n\nWell maybe not all capitalists are just about extracting the surplus value to make profit. They know quite well that the means of production produces the next generation of workers and they view this as the special and essential product not just the commodities that are made in factories.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "WarmongerIan",
                                            "body": "This is discussed by Marx. Social Reproduction is the concept you are looking for. \n\n\nAnd yes capitalism is stuck between a contradiction of commodifiying it and leaving it up to to worker to figure it out by themselves.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "damagedproletarian",
                                                    "body": "The workers didn't have much free time to read das kapital or Marx's other works. They didn't have literacy levels required either. They certainly didn't have the capital required to implement capital. It seems to me that Marx's work was a cunning trap for the bourgeoise and now the proletariat (that came into existance because of it) are angry. Is that hitting the nail on the head?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "WarmongerIan",
                                                            "body": "The workers do have the ability to read and understand Marxism. Capital the book doesn't call for the proletariat to enact anything using capital. \n\n\nThe proletariat was not created by Marx or his work. Is that what you are saying or am I misunderstanding you? What trap do you mean was laid out?\n\n\n\nI have to ask, have you read Capital? Because it sounds like you don't know what topics the book actually covers.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "damagedproletarian",
                                                                    "body": "Things like \"commodity fetish\" for example. The bourgeoisie know this inside and out while the workers have been making or buying the shiny bling with no formal reading on the subject.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "WarmongerIan",
                                                                            "body": "Commodity fetishism affects everyone regardless of class unless you consciously fight it, there is a layer of abstraction where you only see the physical commodity but you can't see the labour that was put into it. \n\n\nYou just don't factor it into you daily understanding of life unless you consciously try to do it. \n\n\nWhat the bourgeoisie has that the proletariat currently is lacking is class consciousness. Yo see the world as class struggles and understand that siding with another class can only harm yourself and your own class \n\n\nUnderstanding how capitalism works and what class struggle is generate class consciousness. only a class acting for their own interests can enact the required change to end capitalism and eventually abolish class entirely.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "damagedproletarian",
                                                                                    "body": "Going back and reading  \"The wealth of nations\" by Adam Smith it seems that the workers were happy to work hard at their trade, fall in love, marry, have children, send their children to school so that each generation was a little bit better off than the last. We could have slowly progressed and taken our time at each development stage. We could have completed the goals of bourgeois development at a leisurely pace say over 2000 years instead of 150.\n\n>Understanding how capitalism works and what class struggle is generate class consciousness. only a class acting for their own interests can enact the required change to end capitalism and eventually abolish class entirely.\n\nThe problem is which class is \"consciousness\" and how do they intend to \"abolish class entirely\"? They don't want the working class doing this so if the bourgeoisie continues to abolish classes then it's called classicide.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "WarmongerIan",
                                                                                            "body": "Guess that answers whether you read capital or not. You haven't. \n\n\nThe process of class disappearing is explained in detail, and no, the bourgeoisie cannot and will not do it. Because they are not acting fo the majority of humanity the key difference is that the proletariat is the vast majority of humanity. \n\n\nThis leasurely pace you describe and all the workers were happy. Go and read Engels; the condition of the working class in England and see what your allegedly happy workers were suffering. \n\n\nThe development of productive forces cannot be done at a \"leisurely pace\" if you had read capital you would know why. Productive forces will break through attempts to stop their development. \n\n\nThe working class suffers in misery while the bourgeois sits on his dragon hoard of gold and you claim this is an acceptable thing to prolong for 2000 years, if it was even possible. \n\nRead this if your actually want to know how capitalism destroyed the lives if innumerable people:\n\n[The Condition of the Working Class in England](https://www.marxists.org/archive/marx/works/1845/condition-working-class/)\n\nI have to say your understanding of what Marx even wrote is so oddly twisted, talking about traps and open world schools? \n\nYou would do well in actually reading the works you are trying to claim caused X or Y because you don't actually know what they say.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "damagedproletarian",
                                                                                                    "body": "Yes, I have read Engles: conditions of the working class in England. Living in a mouldy rental property gave me some idea of what it might be like to like in a Victorian era workhome.\n\nI think we are actually both right in a way. There was always a lot of exploitation but unfortunately Marxism hasn't stopped it. It has helped gain advantage in certain areas yes but it is important that workers arm themselves with as much political and economic education as they possibly can. Unfortunately not every worker is able to do this and comrades must stand with them until they are strong enough.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jacquix",
            "body": "Marxist analysis describes societal, economic developments based on material grounds, framed in a dialectical understanding of the driving forces causing constant change. The fact that we see the economic system play out the way he describes it doesn't mean people act according to his prescription, it means he correctly understood how things work on a general, fundamental level.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Zeikos",
            "body": "I honestly don't think you can be a good capitalist without having at least a medium to good understanding of Marx, or at least Das Kapital.  \n\nReally, to be good at something (capitalism included) you need to understand it. To understand something you need to understand its limitations and critiques.  \n\nSo it's totally plausible, even likely.  \n\nBeing in agreement with Marx's analysis doesn't mean being ideologically aligned with him.  \n\nObviously they're not going to admit it but there are plenty of right wing experts on Marx's work.  \nObviously they use said knowledge to pursue their own interests.  \n\nHell, Marx did successfully play the Stock Market once or twice.  \nIt's not quite the same as actively founding a company and exploiting workers, but it's still participation on the system (which cannot be avoided as long as capitalism is the main method of production, which it currently is).",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fuzzyknurl",
            "body": "Historical materialism dictates that it's the material conditions that create the contradictions between the capitalist class and the working class. The material conditions created the capitalist class which replaced the feudal class. And it's the material conditions of the capitalist mode of production which created the working class. This is independent of what any individual capitalist has read or not read.\n I guarantee you that if Jeff Besos has read capital he doesn't understand the fact that the interest of the working class is diametrically opposed to the interest of the capitalist class. And that the capitalist class is digging their own grave by exploiting the working class. Jeff Bezos is going to float the story that the capitalist class and the working class are working together to build a Democratic Society. That's just an idea and as I said history is driven by the material conditions not ideas.",
            "score": 5,
            "replies": [
                {
                    "author": "damagedproletarian",
                    "body": "In Adam Smith's \"the wealth of nations\" he covers the topic that the workers need to earn enough to marry and have children and that enough of those children need to survive for the working class to continue. I'm sure Marx covers this topic too. In my city people aren't marrying and having children because housing and other living costs are so expensive. How exactly are the capitalists creating their \"own grave diggers\" when those supposed grave diggers die out in a generation?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fuzzyknurl",
                            "body": "According to Marx, the capitalist class creates their \"own grave-diggers\" by bringing the working class together. It's not about ideas it's about the material conditions. In the old days it would have been large factories where they literally brought thousands of workers together in one place. This makes it easier for the workers to organize against the capitalists. But nowadays it's social media that is exploiting billions of people but it is also bringing those billions of people together. The capitalist class can't exist without the working class and by its very nature also exploits the working class. And by exploiting the working class they are creating the conditions for the workers becoming alienated from the fruits of their labor. This is the main contradiction which says that the working class will eventually rise up to finally obtain all of the fruits of their labor.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "damagedproletarian",
                                    "body": "The question I have is if you have rich parents but you are a student in a college dorm room are you (or perhaps do you self identify as) proletariat or bourgeoisie? Because Rupert Murdoch was a student in his dorm room reading Marxism and getting ideas. He later goes into business but the Marxism he read is still ingrained in psyche and his class consciousness once he is bourgeoisie. Perhaps you don't read Marxism it reads you.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "3corneredvoid",
            "body": "If you want to read a Marxist worldview, check the pages of a private equity investor brochure. You'll find at least some of the aspirations of a revolutionary movement reframed as \"risk\", and a bit less prattle about the mysteries of the market than prevails in tertiary institutions. It's a bit like historical materialism in the mirror, because major investors don't stay rich by keeping politics out of their economics.\n\nI don't know if Jeff Bezos would've read Marx. He doesn't seem the type. But a couple of the Silicon Valley elite are readers, notably Peter Thiel, who's very interested in the conservative Catholic Nietzchean, René Girard. It doesn't add up to much.",
            "score": 3,
            "replies": []
        },
        {
            "author": "radd_racer",
            "body": "He is a member of the bourgeois, and adept enough at utilizing an exploitative system to maximize his own wealth, while utilizing business practices to keep those beneath him oppressed. Even if he was well-versed in Marx, it would be pointless, since Marxist principles are anathema to to his own self-interests.\n\nThe bourgeois will continue to utilize capitalism as a means to maintain their power, that will be the course of things until their rule is overthrown.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PrimaryComrade94",
            "body": "Nah. He's a man with immense wealth who will stop at nothing in the name of ownership and exploitation. If anything, he probably red Rand's Atlas Shrugged and thinks of himself as this John Galt that wont let nothing stop him. He's probably think of Das Kapital as something to inspire him sure, but only certain parts of it (like how kids sometimes read over the sexy bits instead of the whole book).",
            "score": 2,
            "replies": []
        },
        {
            "author": "MonsterkillWow",
            "body": "He's just trying to extract as much profit as possible. Exploitation of labor, consumers, etc is all part of the game. Maybe he read it, but I doubt it. He clearly has no communist ambitions or sympathies. China has some billionaires that have some Maoist beliefs. \n\n\nNeville Singham is an American multimillionaire communist. His wife is one of the founders of Codepink. ",
            "score": 3,
            "replies": [
                {
                    "author": "damagedproletarian",
                    "body": "Thanks for that. I have never heard of Neville Singham. Looks like an interesting character.\n\nBTW young Rubert Murdoch was a radical socialist with a bust of Lenin in his uni (college) dorm room.\n\nThe problem is that most of the workers don't read Marx. They know on some level they are being exploited and they get angry when someone behaves like bourgeoisie around them yet they get equally angry when someone tries to explain how the economic system works to them. Sometimes people that read enough to develop an understanding of capitalism go on to become capitalists but the system certainly doesn't make this easy.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MonsterkillWow",
                            "body": "WTF happened to Rupert Murdoch then? Wow. I guess he got rich and then, predictably, his interests shifted. Same old story.\n\n\nIt's hardest to convince someone they have been fooled. Acknowledging Marx had a point about class interests would undermine the collective worship of the rich that drives most of our culture. Once your eyes are opened, it destroys a lot of things, including the myth that the US government is a force for good on this planet lol. ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sourceenginelover",
            "body": "Capitalists develop spontaneous class consciousness by virtue of their social existence (as members of the owner class). They are not the victims of false consciousness as is the case with the majority of proletarians \n\nCapitalists don't need to read Capital in order to be capitalists and follow their class interests",
            "score": 1,
            "replies": []
        }
    ]
}