{
    "title": "The socialist response to US railroads’ false claim that “labor does not contribute to profits” (2022)",
    "author": "JohnWilsonWSWS",
    "subreddit": "Marxism",
    "rank": 367,
    "score": 26,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Marxism/comments/1fd9a5u/the_socialist_response_to_us_railroads_false/",
    "id": "1fd9a5u",
    "selftext": "[The socialist response to US railroads’ false claim that “labor does not contribute to profits” ](https://www.wsws.org/en/articles/2022/08/25/rail-a25.html)\n\n>... from an economic standpoint, the railroads’ claim is totally false. The reaction to the provocative claim shows that workers instinctively grasp this, but it was proven scientifically more than 150 years ago by Karl Marx, in his seminal 1867 work Capital. On the basis of his extensive critical analysis of the economic and social laws underlying the capitalist system of economy, Marx founded modern socialism, which is based on scientific laws of development of the class struggle.\n\n> Labor and the origin of surplus value\n\n> Marx’s Capital begins with an analysis of the commodity, the cell form of the capitalist system in which all its development is rooted. In societies where the capitalist mode of production prevails, he wrote, wealth presents itself as an ‘accumulation of commodities’—from industrial products, means of communication, entertainment, etc, to all the basic necessities of life—which are bought and sold on the market.\n\n> Marx begins by an examination of the laws of commodity production as the basis for his analysis of capitalism. The value of any commodity (a phone, a car, etc.) is determined by the socially necessary labor needed to produce it. That is, commodities that require the same amount of labor to produce have the same value and are exchanged as equivalents in the market.\n\n> In the transition to capitalist society, which develops out of simple commodity production, an epoch-making change takes place. This happens when labor power, or the capacity to work, becomes a commodity, likewise bought and sold on the market.\n\n> But if, according to the laws of commodity production, equivalents are exchanged for equivalents, how does an additional or surplus value (profit) arise, as it clearly does in capitalist society?\n\n> Of course, an individual may be able to sell, for one reason or another, a commodity above its value, and he will gain in the exchange. But there will be no creation of additional value in society as a whole because one individual’s gain is another’s loss—a zero-sum game.\n\n> The answer to this question lay in the examination of the new commodity, labor power, the capacity to work, which forms the basis of social relations in capitalist society.\n\n> The value of the commodity labor power is determined by the value of the commodities needed to reproduce it—that is, the value of the commodities needed to keep the worker alive and continuing to work, including food, clothing, shelter, etc., and to raise a family and produce the next generation of wage workers.\n\n> But the particular usefulness of this commodity labor power is its ability to create new value out of the labor of the worker. The value that a worker adds to the productive process in a given day is equal to more than the value that goes to wages. A worker, for example, may need only work for four hours in a day in order to reproduce the value that was spent on his or her wages. But this fact does not keep the capitalist from keeping the worker on the job for eight, 12 or even 16 hours a day. This surplus value, the difference between the value of the workers’ wages and the value of the goods and services he or she produces over the course of a working day, is the source of all profits.\n\n> Marx’s discovery of the origins of surplus value was revolutionary in the most literal sense of the word. It showed how the apparent free exchange of equivalents in the market, including the exchange of labor power for wages, concealed in actual fact a system of class exploitation. While the working class produces all surplus value, this surplus is expropriated by the capitalist. The worker, who himself owns no factories, railroads, mines or other means of production, is forced to sell his labor power to the capitalist in order to survive.\n\n> Even though they deny that workers’ labor is the source of their profits, the statement by the railroads that workers are not entitled to share in profits because they “have been fairly and adequately paid for their efforts” is essentially a paraphrase of what Marx said, from a critical standpoint, about capitalist exploitation.\n\n> Since its discovery, the law of surplus value has formed the core of the socialist understanding of the class struggle and the inevitability of socialist revolution. Tracing the history and forms of surplus value accumulation—that is, the economic history of modern society and next to it, the conflict between the working class and the capitalist class—Marx and subsequent generations of socialists concluded that the working class, the basic creative and progressive force in capitalist society, would eventually be compelled to take political power, expropriate the expropriators, and reorganize economy in the interest of human need, not private profit.\n\n> This historical turning point would be reached when the capitalist system and the profit motive are no longer compatible with the further development of human civilization—as Marx said, when “the material productive forces of society come into conflict with the existing relations of production.”\n\n>…\n\n[The socialist response to US railroads’ false claim that “labor does not contribute to profits” ](https://www.wsws.org/en/articles/2022/08/25/rail-a25.html)",
    "comments": [
        {
            "author": "Moosefactory4",
            "body": "That’s hilarious, if they could automate all the trains perfectly then maybe? But they’d still depend on all the labour that goes into the capital they use. They can’t escape labour. Not until the final self-improving AI auto-replicating super robot that can build and do everything is invented. \n\nMaybe a hierarchy of the people who/whose ancestors most contributed to creating it will get special first use of them (the robot). As determined by the final CEO of course.\n\nSorry I wrote this when I was high.",
            "score": 12,
            "replies": []
        },
        {
            "author": "redpiano82991",
            "body": "I don't think a rhetorical response is necessary. They don't think labor is necessary for their profits? The experiment is easy enough. Let's have all the railway workers go on strike and see what happens to the profits of the owners. We'll find out the truth pretty quickly, don't you think?",
            "score": 20,
            "replies": [
                {
                    "author": "JohnWilsonWSWS",
                    "body": "That was raised by workers themselves in their slogans.   Open the article to see the image of a silk screen print done on the back a hi-vis vest which says, obviously sarcastically, “labor does not contribute to profits\".  (Perhaps it was done in preparation for a walkout so this would be the last thing the managers see as the workers go out the gate?)  \n  \nHowever we do need to say that process of extraction of surplus-value from labor and its conversion into profits is not obvious.  That's why Marx had to conduct such a painstaking analysis of the issue.  The pressure of bourgeois ideology on workers is to demand a \"fair day's pay for a fair day's work\".",
                    "score": 7,
                    "replies": []
                }
            ]
        }
    ]
}