{
    "title": "Marxists who still believe in the Labour Theory of Value, here is your example in the wild",
    "author": "JiuJitsuBoxer",
    "subreddit": "Marxism",
    "rank": 334,
    "score": 0,
    "upvote_ratio": 0.08,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/Marxism/comments/1g0fwny/marxists_who_still_believe_in_the_labour_theory/",
    "id": "1g0fwny",
    "selftext": "[https://dotesports.com/concord/news/concord-dev-dismisses-haters-as-talentless-freaks-following-lackluster-launch](https://dotesports.com/concord/news/concord-dev-dismisses-haters-as-talentless-freaks-following-lackluster-launch)\n\nAs you know, the game Concord was a high budget game of $400M, which was already canceled one day after launch due to a lack of players.\n\nOne of the developers is here saying how much of a labour it was to make. \n\nThe value? practically zero. There were 600 players before they shut it down.",
    "comments": [
        {
            "author": "Reasonable-Towel-414",
            "body": "Hey, for a commodity to be sucessfully sold it needs to have a use value, which means that it satisfies some social need. the producers have simply miscalculated that there is enough demand for this product that sales will cover production costs. this has nothing directly to do with the labor theory of value. the theory of value only applies when industrial products are successfully exchanged in a free market under competition",
            "score": 61,
            "replies": []
        },
        {
            "author": "peanutist",
            "body": "Another day, another idiot who has not read labor theory of value and does not know what use-value is. The game can have tens of billions of dollars in labor-value but if its use-value is garbage no one will buy it. This is literally the most fucking basic concept about LTV jesus christ.",
            "score": 62,
            "replies": []
        },
        {
            "author": "SnowSandRivers",
            "body": "1. My brother, read the theory first. \n2. Marx didn’t come up with the LTV. Adam Smith did. YOUR MAN. 😂 The LTV only became problematic among capitalists once Marx accepted and used it to criticize capitalism.",
            "score": 38,
            "replies": []
        },
        {
            "author": "lukethedukeisapuke",
            "body": "That's not how LTV works, merely putting a large amount of potentially collective labour into something does not mean it just has high value. As value is a social phenomenon labour must be socially necessary to add value, it is possible that not very much was done, therefore, the value and exchange value are low. Now usually people are only hired to do socially necessary labour but for game companies that is usually a projection as games take time, if they made a loss they did not predict the value correctly. But they are only one firm and will be corrrslondly punished by the market.",
            "score": 24,
            "replies": []
        },
        {
            "author": "None",
            "body": "Hey, random person on the Internet who thinks he knows how LTV works, you're making the case for Marx in Capital Volume I, Section I when he clearly states, \"Lastly nothing can have value without being an object of utility.  If the thing is useless, so is the labor contained in it; the labor does not count as labor and creates no value.\"\n\n\nTry again.",
            "score": 21,
            "replies": []
        },
        {
            "author": "comradekeyboard123",
            "body": "The labor theory of value doesn't suggest that just because you took a lot of time to make something, it will, no doubt, fetch a higher price than something that took you less time to make.",
            "score": 16,
            "replies": []
        },
        {
            "author": "EvanCarroll",
            "body": "lol. reddit is awesome: Burning Man involves tens of thousands of people laboring to make something. then it's burned down. it's not worth anything despite all the labor that went into making the ashes. CHECKMATE MARXISTS.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Themotionsickphoton",
            "body": "The revenue of an industry is correlated proportionally to the amount of labor input that the industry consumes. Assuming no monopoly or rent effects. \n\n\nThat's what the labor theory of value actually says.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Labor alone isn't what makes things have exchange value\n\nA commodity needs to have a use value (utility) before having an exchange value\n\nIf I made a pie out of mud, that doesn't mean it has an exchange value because there is no one demanding it",
            "score": 3,
            "replies": []
        },
        {
            "author": "BeautyDayinBC",
            "body": "All labour isn't inherently valuable- only socially necessary labour.\n\nLots of \"jobs\" in our society have little to no social value, but are done because they have market value: real estate, landlording, wealth management, Bticoin mining, etc etc.\n\nWith the state of our world, I'd say if in your job you don't work with your hands or take care of people who need help, your job is probably not socially necessary. Do we really need more apps and video games?",
            "score": 5,
            "replies": []
        }
    ]
}