{
    "title": "Sensitive topic!",
    "author": "Jao13822",
    "subreddit": "Marxism",
    "rank": 328,
    "score": 25,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Marxism/comments/1g2q5df/sensitive_topic/",
    "id": "1g2q5df",
    "selftext": "Well, I'm going to leave a trigger warning here, even though there's nothing much in the text, I think it's good to warn as a form of prevention.\n\n\nAre there any Marxists, psychoanalysts who study the reasons behind [pedophilia, rape, etc.]? Lately there has been popular discussion about an American elite where there is great degeneration, depravity (see the case of P Diddy) and this is in collusion with some Yankee politicians (Trump being friends with the billionaire from the sex trafficking islands). Is there some kind of relationship between the bourgeois way of living producing people with a retrograde, perverse, degenerate mind at the level of what we can see or not?",
    "comments": [
        {
            "author": "lurkhardur",
            "body": "Yes, sexual domination is a feature of all class societies including capitalism. This is spelled out already in the manifesto:\n\n> But you Communists would introduce community of women, screams the bourgeoisie in chorus.\nThe bourgeois sees his wife as a mere instrument of production. He hears that the instruments of production are to be exploited in common, and, naturally, can come to no other conclusion than that the lot of being common to all will likewise fall to the women.\nHe has not even a suspicion that the real point aimed at is to do away with the status of women as mere instruments of production.\nFor the rest, nothing is more ridiculous than the virtuous indignation of our bourgeois at the community of women which, they pretend, is to be openly and officially established by the Communists. The Communists have no need to introduce community of women; it has existed almost from time immemorial.\nOur bourgeois, not content with having wives and daughters of their proletarians at their disposal, not to speak of common prostitutes, take the greatest pleasure in seducing each other’s wives. \nBourgeois marriage is, in reality, a system of wives in common and thus, at the most, what the Communists might possibly be reproached with is that they desire to introduce, in substitution for a hypocritically concealed, an openly legalised community of women. For the rest, it is self-evident that the abolition of the present system of production must bring with it the abolition of the community of women springing from that system, i.e., of prostitution both public and private.",
            "score": 35,
            "replies": []
        },
        {
            "author": "CombStreet",
            "body": "Forms of social control, such as capitalism, centered on control and domination rather than collaboration (From each according to his ability, to each according to his needs) will make various forms of predation more common. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "None",
            "body": "Its simply a power thing.\nPeople seeking power over other people are depraved and will do the most hideous things to their fellow human beings.\n\nThe root of it is pathological insecurities and selfhatred.\n\nSolution is to end hierarchical power structures.",
            "score": 6,
            "replies": []
        },
        {
            "author": "phlegmpop",
            "body": "My understanding of it is that rapists/pedophiles are not a \"type of person\" that can be created or avoided. Rape and pedophilia are behaviors used to hurt and subjugate others, and *any* human has the potential to be violent. Abuse consistently becomes a problem in situations where there is an imbalance of power that allows certain individuals to have unchecked authority over others (eg. churches, schools, nursing homes, the nuclear family, the police, and so on). Extreme wealth is simply the most dramatic demonstration of this principle.",
            "score": 18,
            "replies": []
        },
        {
            "author": "wildbutlazy",
            "body": "when it comes to rape and pedophilia, its a way of showing power in many cases i believe. they find the domination over others to be validating. now pedophilia is a disease, there are people attracted to children that get assistance to make sure they do not act on their urges. but i do think a lot of the high profile cases of sex trafficking are more about validation of their superiority through sexual acts.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AbjectJouissance",
            "body": "Sigmund Freud discuss pedophilia briefly in his landmark *Three Essays on the Theory of Sexuality* (1904 edition, I'm not sure about other editions). Here he simply discusses how pedophiles go after young, impressionable boys/girls because of their failure in other areas. As if to compensate for a weakness. But I'm not sure this applies in the case you've posited, with very successful people like P Diddy or Epstein. \n\n\nNevertheless, the theories laid out by Freud, especially in the 1904 edition, on how sexuality emerges and why, I think, would probably give us a pretty good starting point to explain pedophilia.",
            "score": 4,
            "replies": [
                {
                    "author": "ApprehensiveWill1",
                    "body": "It’s much more complex than this. You’d have to include an analysis framing the evolution of social attitudes towards or against sexual interactions/relationships with children, of both hereditary descent and non-hereditary. There are criminological implications which need be addressed if to understand the power imbalances in the bourgeoisie and also a recognition that in Ancient Greece, there was such thing as the pederasty which was a mentorship between elder men and young boys who were thought of as possessing youthful beauty. It was common for elder men to take an eye to younger boys in their training grounds/gyms. When they engaged in a mentorship they often included sexual activity, all-but-withdrawing penetrative sex. Homosexuality and pedophilia were described in much different ascriptions compared to modern ascriptions of pedophilia. If you penetrated a young boy, you were homosexual and negative sanctions were placed against anyone engaging in penetrative sexual behaviors with young boys. \n\nThat was then, this is now. Now that sex trafficking is an international reality we must see pedophilia as more than just a sexual inclination and something which creates a demand for child trafficking. Sigmund Freud may have been correct in essence of some men preying on more vulnerable targets because they were themselves vulnerable, but being a psychoanalyst I don’t believe this explanation is sufficient. The bourgeoisie have two things: money and power to override authority in many cases. Any avenue of revenue is satiable for the bourgeoisie and eventually you’ll end up meeting others who hold enough power or wealth to streamline revenue in a diversification of ways—illegally of course. Just as was stated by Frederick Engels, there are only the morals of the bourgeoisie and the morals of the proletariat. These are the only two constant moralities of the modern society. The bourgeoisie often exchange through financial/political favors, with some bourgeoisie exchanging other services for political gain, such being, in some cases, the exchange of money, goods, hard-to-reach items for laxed regulations/policy changes, women, men, minors/young children, just as Joseph Smith is said to have done while pooling investments in the Church of Jesus Christ of Latter Day Saints. When there is an unlimited financial license and confidentiality there is boundless corruption and complicity. \n\nThe final factor driving child sex trafficking I’d like to mention is the absence of potential mates, but as an enforcement of work/deployment such as being UN personnel or overseas as part of the US Army. UN personnel will participate in sexual exchanges between children after such long deployments to other countries. Same is said for US Military.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "AbjectJouissance",
                            "body": "I pretty much agree with what you say, but I would still add that the very basic structure of sexual desire or sexuality overall is accurately marked out by Freud in his text.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GuyinBedok",
            "body": "Like what others have alr mentioned, it's a power game. Class would ultimately be used as leverage for power and influence and those of the upper class (the bourgeoise) would ultilise sex as a way to feel more powerful and belittle less privileged folks. Also, the victim would more often than not feel \"obligated\" to be submissive and be victimized since they would usually be in a more materially desperate situation , and would less likely want to publicly come forth with the fact that they have been sexually assaulted due to the influence the aggressor usually has.\n\nEDIT: not to mention that rapists and pedophiles don't really get as harsh of a sentence as they should in many capitalist countries unfortunately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "proletarianfire",
            "body": "This sort of depravity is much older and related primarily to patriarchy.\n\nIn general, the reason why any kind of abuse takes place, sexual or not, is because the abuser feels they can get away with it. Adults abuse children because they can manipulate the child into not reporting it, or they feel the child would not be believed anyway. In heterosexual marriages, the wife usually earns less or nothing when compared to their husband. This, along with the legal difficulties with getting divorced, is a major factor in why she will tolerate abuse for a very long time. In the extreme cases of serial murderers or rapists, they typically target those lowest in society; for example, Dahmer primarily targeted gay men of color. Others would target sex workers. What these different and often victimized groups have in common is that they are on the bottom from the viewpoint of patriarchy; women and children are property, gay men, trans people and sex workers threaten heterosexual marriage, etc. \n\nThere is more to say about the psychological effects of patriarchy, but I will leave that to further research on your part. In broad strokes, it is the inequality in power and wealth in our society which gives rise to these behaviors. People like Sean Combs (P. Diddy) or Harvey Weinstein engage in their abuse in the first place because of their social station. If they didn't have a ton of money to afford lawyers and a retinue, they would not have been able to engage in nearly as much abuse as they had.",
            "score": 1,
            "replies": []
        },
        {
            "author": "C_Plot",
            "body": "There is much to disentangle in this.\n\nSexual shame is a chief site where the authoritarians cultivate our authoritarian personality disorders. We must disentangle the sexual shame from the genuine harms involved. For example, take P Diddy. We have seen video that indicates Diddy has been very violent and brutal toward his intimate partners. These would clearly involve state charges for violations of state crimes. And Diddy should be condemned for such domestic violence. However, the FBI gets involved because the FBI, from its inception, is steeped in white supremacy, misogyny, fascism, and capitalist subversions of our constitution.\n\nWhen I hear these charges from the FBI, I hear arson, kidnapping, and, “forced labor” (which I had not heard was a crime, but if it is does that not preclude the unpaid labor portion of every day within capitalism?). These sound like serious charges and perhaps trigger federal enforcement to the extent they cross state lines. However, those charges are listed as almost afterthoughts amidst a litany of charges that involve sexual shame and vice crimes (where all the viciousness involved in vice crimes comes from those legislating, adjudicating, and enforcing such vice crimes). These vice crimes, exist solely through violations of the constitution in reigning over the private lives of persons in violation of the republican form of government guarantee and the Ninth Amendment.\n\nThe few legitimate crimes then are intwined with the vice crimes (intoxicants dispensed and used or sex work) as well as intwined with sexual “deviant” behaviors. This invokes a mob mentality that mistakes sexual conformism for being morally upstanding and virtuous from those witnessing and condemning the sex in a mob chorus. “I never engaged in an orgy like Diddy and his companions, and so that reflects my virtue” the mob thinks in unison. If the FBI merely said “we think Diddy committed arson and kidnapping” it would not warrant anything more than a headline buried deep on the news page. The sexual nature plays in long-standing white supremacist circles that those of African descent are sexually dangerous guides these indictments.\n\nThat is not to say that Diddy might not be dangerous to some. Arson and kidnapping are no joke. But they alone do not reinforce the myths of fascism that the wider inappropriate and counter-constitutional charges and tabloid condemnations reinforce.\n\nThe growing fervor over pedophilia is similarly situated: culminating in the mental breakdown of looking to murder the imaginary pedophiles  in the non-existent basement of a pizza parlor  in the DC suburbs. With authoritarianism, the line of consensual sex can be effectively blurred to serve the authoritarian agenda. A post pubescent minor cannot enter into a contract, though can have sexual desire: in other words could otherwise consent to sex. The age of consent has long been linked to such threshold of adolescence. Though that age of consent was traditionally more thought of as when marriage could begin, with the sexual revolution, it was clear that it meant an adolescent had reached the stage of adulthood where, at least regard to sexual matters, they had reached adulthood and must have autonomy to manage their own sexual affairs. It is society’s obligation to prepare the youth for the adolescent stage in education and rearing our young. Not only is sexual desire possible, but so too is pregnancy for those capable of pregnancy and their nascent bodily adulthood demands they enjoy the personal sovereignty and receive the requisite education of an adult in this intimate domain (why parental consent laws for abortion and contraception violate personal sovereignty; parents must instill the values into their offspring before reaching puberty, if they want any influence over their sovereign actions post puberty). \n\nJust as avarice becomes pathological without agapē, so too does sexual desire. The condemnation that we improperly locate in sexual shame is a displacement of the profound immorality of absent agapē (a sort of universal hate supplanting universal love—agapē). Agapē means we organize society through communism/socialism and do not allow capitalist exploiters to use workers as mere means to their own avaricious ends. Likewise, without deeply instilled agapē in sexual relations we will also see sexual activities that use others as mere means to their own ends. Universal love is the prerequisite for genuine romantic love which otherwise slips into a mere romantic love veil over pure lust, avarice,  malice, and capriciousness. The eminent Marxist psychologist Erich Fromm, in his _Art of Loving_ teaches us that love (agapē) is not a feeling. Rather love is located in our own conscious activity toward others. I would add that the opposite of agapē—a sort of universal hatred for lack of a better phrase—is also not a feeling. It is the way we act toward others in our avarice, malice, capriciousness, as well as unmitigated lust in sexual matters.\n\nFor millennia marriage was seen as a palliative to help ensure agapē within sexual matters. However, experience has shown us it is lousy in that capacity. Capitalism conditions us (as with prior exploitative social formations) to hold agapē in contempt: to hold genuine morality and Justice in contempt. Pervasive sexual shame provides a false substitute for agapē and genuine golden rule morality, where we come to think of our condemnation of the sexual behaviors of others represents our moral acts and our virtue. \n\nNow certainly those in positions of authority—parents, guardians, ministers, bosses, supervisors, teachers, mentors—might be prone to abuse their authority and coerce sexual relations in those relationships. We must be cautious with sexual relations involving such authority. Some inappropriately add elder to that list of “authority”, but that is not at all like the others. We might as well as height or weight to the list. Just because someone towers over another in height does not at all impart authority. Nor does age impart authority. Pre-puberty a child does not understand sexual desire and we could not even teach them what it is in a way they can appreciably understand (though we can prepare them to understand, as puberty approaches, and we can teach them how to handle inappropriate behaviors toward them pre-puberty). \n\nHowever, denial of consensual sexual activities to adolescents, even with those of different age, infantilizes adolescents and deprives them of their personal sovereignty. Those confusing sexual shaming with virtue find such deprivation of liberty as a mistaken glittering sign of their virtue. The same thing occurred formerly with gays and lesbians (and the fascist are trying to recover that false virtue). However with the gay marriage movement successes in the US and elsewhere, the sexism shaming was forced into a corner as an attack on adolescents and their consensual sexual activities. Many adolescents today do not want to engage in sexual activities, which is fine in and of itself. However, that change in adolescent proclivities also reflects the success of this authoritarianism to afflict the youth with a renewed authoritarianism that was waning in the face of the successes of the LGBTQ+ community.",
            "score": 1,
            "replies": []
        }
    ]
}