{
    "title": "Should I oppose welfare? ",
    "author": "Tiger-Jack",
    "subreddit": "Marxism",
    "rank": 327,
    "score": 0,
    "upvote_ratio": 0.45,
    "num_comments (reported by reddit)": 33,
    "url": "https://www.reddit.com/r/Marxism/comments/1g3lcot/should_i_oppose_welfare/",
    "id": "1g3lcot",
    "selftext": "Should I be opposed to welfare?\n\nHaving read the communist manifesto, Marx states that the fall of the bourgeoisie will be due to their inability to support the lives of the proletariat as the proletariat sink deeper into poverty. In which case, shouldn’t Marxist organisations be opposed to welfare, as this simply reduces the alienation of the proletariat from the bourgeoisie? At the same time, I do not understand how an organisation claiming to represent the interests of the working class could oppose things like universal healthcare and other workers rights. Can anyone explain this to me? ",
    "comments": [
        {
            "author": "LeftismIsRight",
            "body": "Opposing it would be a form of accelerationism. Marx was mostly descriptive rather than prescriptive of capitalism. He described the ways capitalism functioned and the contradictions it caused in his time. There were instances where he did favour accelationism, such as in the fact he supported free trade over protectionism. \n\nHowever, when it came to matters of aiding the working class, he was in favour of what ever you could get. He supported public education for children and a few other things like that in The French Worker’s Party Program.",
            "score": 63,
            "replies": [
                {
                    "author": "radd_racer",
                    "body": "This. We don’t need to accelerate anything and increase people’s suffering. Capitalism is already undoing itself, even as we increase safety nets. The bourgeois will resort to even more drastic measures as it’s forced to pay more into a welfare system, which fuels progress towards revolutionary desire.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "amishius",
                    "body": "I think you're dead on. \n\nPersonally, not an accelerationist, mostly as I've come to see that there are a lot of people who have their own lives to lead that would be harmed by those processes. That said, welfare is basically the capitalist system's way of making sure they don't get their heads lopped off :)",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "sstoneislandicedoutt",
                    "body": "(left-)acclerationism is definitely not \"making conditions worse so revolution will come faster.\" i don't know where this idea even came from, and nobody associated with l/acc (mark fisher, nick srnicek, etc.) has ever said such a thing.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "radd_racer",
                            "body": "It’s mainly associated with tankies, who secretly love authoritarian neoliberal fascists like Trump, and say things like “Killmala Harris,” and “DemonKKKrats.” Probably many of them are Russian plants or bots. People who willingly want to hurt those who are victimized by capitalism just to accelerate things are just far-right wingers in disguise.",
                            "score": -10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElEsDi_25",
            "body": "Workers in the richest country in the history of the world have Star Trek phones in their pockets but can’t make rent and have parks full of unhoused people.\n\nNo, we don’t have to worry about capitalism ever being too nice to us that class struggle stops.\n\nMarx was also clear that socialism is not automatic, that only class struggle is automatic. We will struggle, but winning is the subjective question - socialism or fascism are the ultimate options for capitalism. So things being bad won’t magically make workers able to run society collectively.\n\nI think as Marxists our only job is to help facilitate the self-liberation of the working class. Welfare does not hider working class ability to develop class consciousness, independent politics, or organization. In fact struggle for welfare can help us build consciousness and organization… welfare existing also take the pressure off of workers in terms of losing jobs. More people will fight against bad work policies if being fired is less of an immediate economic threat.",
            "score": 24,
            "replies": []
        },
        {
            "author": "JonnyBadFox",
            "body": "Most welfare systems originally came from mutual aid organizations of workers in the 19th century. Especially the German one. It was nationalized by Bismarck because he wanted to prevent revolution in Germany.",
            "score": 8,
            "replies": []
        },
        {
            "author": "DubstepJuggalo69",
            "body": "The accelerationist to right winger pipeline is real.\n\nIf you come up with abstruse theoretical reasons for supporting policies that hurt people in real life, you're a step away from sincerely believing that hurting people is good.\n\nJust say no to accelerationism.",
            "score": 15,
            "replies": []
        },
        {
            "author": "proletarianfire",
            "body": "Reforms, or the lack thereof, do not put us any closer to revolution. However, the fight for reforms *can* bring us closer to a revolution.\n\nMarxists view reform struggles as a form of training, practice and education for the working class. The purpose of fighting for welfare, or better housing, or opposing this or that racist cop, is to get workers interested in fighting for their interests. In the process, workers (including us!) organize, learn who our real enemies are, and get practiced in building movements, holding democratic spaces, and winning struggles against the bosses.\n\nIt is a mistake to think that there is any level of misery which people can't tolerate. While it is true that in times of crisis, people fight back, they only do so if they believe that there is a possibility for the fight to succeed. When a revolutionary crisis does eventually break out (and it will), we will want to be as practiced as possible in fighting the capitalists over hundreds, ideally thousands, of different reform struggles. That is the only way we will have a chance of actually winning a revolution.\n\nSo in summary, we should always support any reforms that make life better for workers. But more than that, we need to argue that they have to be fought for.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Nuke_A_Cola",
            "body": "No. Welfare is good actually. Welfare existing at all is from the wins of workers of the past engaged in the class struggle. Welfare being cut is what galvanises the workers movement (sometimes, you’d think with the neoliberal status quo that this did not happen but thankfully we have places like France, Bangladesh and Kenya to point to currently).",
            "score": 3,
            "replies": []
        },
        {
            "author": "m_se_",
            "body": "Opposing reform to increase radicalism so that you can then later have more reforms is ridiculous. Like it or not, a Marxist government must either possess a mandate from the masses or a monopoly over violence. If the goal of revolution is the creation of a better standard of living for the proletariat then personal and political freedom is non optional.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AffectionateStudy496",
            "body": "Welfare presupposes an economy that creates poverty as a necessity in the first place, and which the state then comes along and afterwards \"corrects\" time and time again. And the \"correction\" isn't exactly a good life, despite right-wing fairy tales about welfare kings and queens living better than Bill Gates. Communists seek to create an economy where welfare isn't necessary because poverty isn't produced in the first place.\n\nTwo excellent articles:\n\nhttps://www.ruthlesscriticism.com/welfare_state.htm\n\nhttps://www.ruthlesscriticism.com/dismantling.htm",
            "score": 2,
            "replies": []
        },
        {
            "author": "kayotik94",
            "body": "The point is not to be for or against welfarism.  The original socialists of Marx's day and of the second international would have been indifferent to these programs from the capitalist state. Sure maybe they benefit some lower class people in the short term but welfare programs are not socialist, they are bonapartist half measures to deal with the problems of capitalism in the absence of socialism. Marxists should be more focused on building towards socialism than protecting welfare programs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Galactus_Jones762",
            "body": "The welfare system can be seen as a form of communal ownership in action. We just need the floor to get even higher and also not penalize welfare recipients for working. But ideally Marx wanted a system that is largely driven by automation such that people can just work and live according to what they want to do. I believe that when he cited “each according to” he was in fact referring to automation and abundance. Welfare is the right idea but we need to raise the floor, include ALL the basics. Every child born should have a genuine option to live a stable, ascetic minimalist lifestyle without trading time for money in a free market economy. Those who want more can go compete. Many will. But some are just not cut out for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wrong-Song3724",
            "body": "No\n\nA properly done welfare system is one of the tipping points for the development of the material conditions in capitalism. \n\nA well-fed, healthy, and educated population is an excellent starting point to expose the contradictions of the current system. \n\nSocialism will not be achieved due to a starving population... That's reactionary. Dialetics is about going forward, not the destruction of the material conditions",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-External8155",
            "body": "Here's Stalin's work on it\nhttps://www.marxists.org/reference/archive/stalin/works/1924/09/20.htm\n\n\nTl;dr: DO be careful about the socdem. It's not about \"welfare\", that could be instantly rolled back when bourgeoisie decides it's liberalism time. ",
            "score": 1,
            "replies": []
        }
    ]
}