{
    "title": "What does everyone think about Gareth Stedman Jones' preface and notes in the Penguin Classics edition of the Communist Manifesto?",
    "author": "GreyWind_51",
    "subreddit": "Marxism",
    "rank": 324,
    "score": 5,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Marxism/comments/1g60ls5/what_does_everyone_think_about_gareth_stedman/",
    "id": "1g60ls5",
    "selftext": "I've never read the Communist Manifesto before, but I've been interested for a long time because of discussions and principles that come from Marx. I wanted to read from the source and educate myself further, and when I saw a copy of the manifesto while I was bookshopping, I grabbed it.\n\nI soon realised that most of the book is Gareth Jones' commentary and history of communism, and while it's interesting, it's very dense and doesn't feel like a great introduction. I only read on my work commute, so it's taking me a while to get through and most of the first 4 chapters haven't stuck with me at all.\n\nShould I skip to the end and read the manifesto first, and come back to this when I've developed more of an understanding and historical interest? Or is this a great introduction that just needs patience and commitment?",
    "comments": [
        {
            "author": "t_dahlia",
            "body": "I've slogged through it, and it's a decent overview of Marx-Engels/communism/etc., basically a long and dense Wikipedia article, but I recommend you skip to the actual content of the Manifesto. Nothing wrong with the preface, but I suspect it's only there to justify the cost of the volume - you can get vanilla versions of the Manifesto for a couple of bucks. The Haymarket edition edited by Phil Gasper is my preferred \"extra stuff\" version despite its stupid format.",
            "score": 4,
            "replies": [
                {
                    "author": "GreyWind_51",
                    "body": "That was exactly my issue, I felt like I was spending my commute reading a Wikipedia article. I'm somewhat disappointed because I'll probably finish the manifesto in a day, but if the preface isn't worthwhile then I'll gladly move onto my next read.\n\nI was hoping to find some interesting insights and interpretations, that would make the manifesto more valuable to me as a reader, but so far it seems more like 200 pages of historical context. There's only so much of that I can take in, before I'm not even processing the words anymore.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leogis",
            "body": "You shouldnt read the manifesto and instead should try to read regular Marx texts.\n\nAccording to Marx himself :\n\"In view of the gigantic strides of Modern Industry since 1848, and of the accompanying improved and extended organization of the working class, in view of the practical experience gained, first in the February Revolution, and then, still more, in the Paris Commune, where the proletariat for the first time held political power for two whole months, this programme has in some details been antiquated. One thing especially was proved by the Commune, viz., that “the working class cannot simply lay hold of the ready-made state machinery, and wield it for its own purposes.\"\n\nYou don't want to become the Guy that extrapolates from the manifesto only and ends up with views completely opposite to Marx's (wink Wink you know who i'm talking about)",
            "score": 2,
            "replies": [
                {
                    "author": "GreyWind_51",
                    "body": "I'll keep that in mind, but my primary motivation for reading it was just the amount of times it has been referenced and quoted. It seems to be the most influential and important of all political documents in leftist thought, it would be stupid not to have read it.\n\nI'd love recommendations for further reading though, and I'll definitely look more into Marx's later work",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leogis",
                            "body": "It doesnt need to be his later work, you just have to make sure your Idea of Marxism Comes from Marx himself, from his text. \n\nSadly a lot of people have remixed Marxism into something that contradicts what he stood for by using wordplay on the communist manifesto.\nEspecially the \"dictatorship of the proletariat\" part that some \"Marxists\" use as an excuse to justify totalitarian measures",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Shintozet_Communist",
                                    "body": "Marx himself never considered to be a marxist, because he disliked the dogmatism that comes with it. You should read Marx, engels, lenin and so on. But you realize that definitions change over time and practical use? So dictatorship of the proletariat can mean something different in times of marx and in times of lenin. This is basic marxism. Marx isnt a god and he can be wrong, its always trying to use the methods of marx to apply it to the material conditions youre living. \n\nJust an example. The word Imperialism means something different in times of Rome in comparison of today. Just because the whole economy is completely different. \n\nDont read marx like the bible.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Leogis",
                                            "body": ">But you realize that definitions change over time and practical use?\n\nYeah wich is why it's important to know what Marx ment by the words he used.\n\n>dictatorship of the proletariat can mean something different in times of marx and in times of lenin.\n\nYeah well if you take the evolved definition then you arent following Marx...\nMarx ment something very specific by this. And then later confirmed it after the paris commune.\nIt shouldnt be changed by someone else and presented as the same thing.\nOtherwise you're just manipulating information/ being dishonest.\nMarx was very concerned with the specific meaning behind words. \n\n>Marx himself never considered to be a marxist\n\nThis doesnt make sense, he was Marx, he is the most Marxist person by definition... Unless you admit that \"Marxism\" doesnt follow Marx.\n\n>Marx isnt a god and he can be wrong\n\nThat is true, however then Comes the question of why you would call yourself a Marxist if you don't follow his instructions",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Knarrenheinz666",
                            "body": "It's a very important document for anyone that wants to understand how Marx's thinking process evolved. If you compare it with Das Kapital you can almost not believe that it's the same author.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        }
    ]
}