{
    "title": "Was Marx \"against definitions\"",
    "author": "Enkidarr",
    "subreddit": "Marxism",
    "rank": 322,
    "score": 21,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/Marxism/comments/1g7gjh6/was_marx_against_definitions/",
    "id": "1g7gjh6",
    "selftext": "I've heard several times that Karl Marx did not believe in simple definitions, but I'm struggling to find any source on this or understand exactly what that means.\n\nFrom my understanding, Marx believed in describing processes, which inherently reveal a contradictory nature to them. Would rejecting definitions then mean asserting that one cannot holistically reveal the undergirding processes and contradictions within something through a simple sentence or two?",
    "comments": [
        {
            "author": "Ill-Software8713",
            "body": "My impression is that the tradition Marx draws from emphasizes the development of a thing rather than any static abstraction where one sees what fits into the category.\n\nIf you read Das Kapital, it’s the development of concepts starting with the simplest unit which contains qualities of the whole.\n\nhttps://www.marxists.org/archive/fromm/works/1961/man/ch05.htm\n“The thinkers of the eighteenth and nineteenth centuries criticized their age for its increasing rigidity, emptiness, and deadness. In Goethe’s thinking the very same concept of productivity that is central in Spinoza as well as in Hegel and Marx, was a cornerstone. “The divine,” he says, “is effective in that which is alive, but not in that which is dead. It is in that which is becoming and evolving, but not in that which is completed and rigid. That is why reason, in its tendency toward the divine, deals only with that which is becoming, and which is alive, while the intellect deals with that which is completed and rigid, in order to use it.” [61]\nWe find similar criticisms in Schiller and Fichte, and then in Hegel and in Marx, who makes a general criticism that in his time “truth is without passion, and passion is without truth.” [62]”\n\nI find a similar dislike for a definition in Ilyenkov when writing about dialectical logic.\nhttps://www.marxists.org/archive/ilyenkov/works/essays/essayint.htm\n“The concept ‘concept’ itself is also very closely allied with the concept of thought. To give a ‘definition’ of it here would be easy, but would it be of any use? If we, adhering to a certain tradition in Logic, tend to understand by ‘concept’ neither ‘sign’ nor ‘term defined through other terms’, and not simply a ‘reflection of the essential or intrinsic attributes of things’ (because here the meaning of the insidious words ‘essential’ and ‘intrinsic’ come to the fore), but the gist of the matter, then it would be more correct, it seems to us, to limit ourselves in relation to definition rather to what has been said, and to start to consider ‘the gist of the matter’, to begin with abstract, simple definitions accepted as far as possible by everyone. In order to arrive at the ‘concrete’, or in this case at a Marxist-Leninist understanding of the essence of Logic and its concretely developed ‘concept’.\nEverything we have said determines the design and plan of our book. At first glance it may seem that it is, if not wholly, then to a considerable degree, a study in the history of philosophy. But the ‘historical’ collisions of realising the ‘matter of Logic’ is not an end-in-itself for us, but only the factual material through which the clear outlines of the ‘logic of Matter’ gradually show through [See Marx’s Contribution to the Critique of Hegel’s Philosophy of Right], those very general outlines of dialectics as Logic which, critically corrected and materialistically rethought by Marx, Engels and Lenin, also characterise our understanding of this science.”\n\nIt’s a working through the material rather than proposing the framework before a task as if concepts are independent of analysis and may be selected arbitrarily.\n\nhttps://www.marxists.org/archive/pilling/works/capital/geoff2.htm\n“Engels characterises this method – this starting with so-called ‘principles’ or ‘laws’ which are tested against ‘the facts’ as ideological – as a method which inverts the true process by which knowledge develops.\nThe general results of the investigation of the world are obtained at the end of this investigation, hence are not principles, points of departure, but results, conclusions. To construct the latter in one’s head is ideology, an ideology which tainted every species of materialism hitherto existing. (Engels, Anti-Duhring)\nAnd Engels immediately points out the roots of this ideology: it rested on a lack of understanding of the origin of thought in definite historical-social conditions. ‘While in nature the relationship of thinking to being was certainly to some extent clear to materialism in history it was not, nor did materialism realise the dependence of all thought upon the historical material conditions obtaining at the particular time.’\nThis method of starting from principles (instead of abstracting them in the course of theoretical work) was essentially the same as starting from abstract definitions, into which the facts are then ‘fitted’.”",
            "score": 10,
            "replies": [
                {
                    "author": "Enkidarr",
                    "body": "Thank you for this, as well as linking sources!\n\nFrom my reading of Das Kapital, it seems that Marx himself is not immune to these static abstractions. For example, in chapter 10 his entire analysis of the working day in this section assumes A-B (value of labour power) to be constant throughout. Marx of course acknowledges this, for in chapter 12 he then assumes  that A-B is variable. Marx's tendency to abstract then seems to constantly get us closer to this unified whole at the end. I guess the difference here is that he does not stop at this static abstraction, but utilizes it to eventually synthesize processes in constant motion.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ill-Software8713",
                            "body": "Well any abstraction/thought necessarily isolates things from realty and thus isn’t in flux but the developmental approach of Marx and of Goethe’s romantic science/gentle empiricism means that one doesn’t just pose a concept to reality but tries to recreate the relations and dynamics of reality through a series of developing concepts.\n\nMarx begins with the commodity as a germ cell from which the rest of his analysis of capital unfolds. Indeed its only in volume 3 things get more dynamic but with the equation of value and exchange value Marx is able to illustrate concepts unnoticed in political economy.\n\nIt’s not a science of some operationalized definition an experiment and then conclusion of how the data fits the hypothesis. Rather he spent 25 years doing empirical research which he then presented in a sort of logical form which also reflects in some degree the historical development of capitalism not in specific facts but in its essential qualities, stripped of their actual history in large degree.\n\nI guess having an abstract definition may be useful in the beginning of learning a thing but knowing that Marx defines class based on a relationship to production while a great insight is different from reading capital and see how he develops the existence of class later on. He doesn’t presume class like Ricardo but shows its necessity within production. This for example would help shift focus from seeing everything as originating in class but that class conflict originates within the relations of production itself and is a more essential relation to keep in mind.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fugglenuts",
            "body": "Define money. Apply that definition to all societies that use money. And you will have a ‘bad abstraction.’ This is bc social form determines function. Money in the form of capital functions very differently than money functioning as a means of payment.",
            "score": 2,
            "replies": [
                {
                    "author": "Ill-Software8713",
                    "body": "And to emphasize an issue with definitions without to regard to their origins, Marx notes categories of how money is used in order to discuss how it reflects the changes in production relations. \n\nhttps://www.marxists.org/archive/pilling/works/capital/ch05.htm#5.1\n“For Marx, money fulfils the following functions:\n1 Measure of value\n2 Medium of commodity circulation\n3 Means of accumulation (hoarding)\n4 Means of payment\n5 World money\n\nRight from the start we should be careful to realize that Marx is not ‘defining’ money in any abstract sense. ‘It is not a question here of definitions which things must be made to fit. We are dealing here with definite functions which must be expressed in definite categories’ (11, p. 230). This point, which has considerable importance for \n\nMarx’s method as a whole, applies entirely to his notion of money. Marx, in his treatment of the functions of money, is actually pointing to the role which money, appearing as a thing, plays in the organization of the social relations of capitalist production. As with all his categories, the functions of money express production relations and the various functions represent the changes taking place in the production relations which the development of capitalism brings. This is stressed by Marx when he says,\n\nThe particular functions of money which it performs, either as the mere equivalent of commodities, or as a means of circulation or means of payment, as hoard, or as universal money, point, according to the extent or relative preponderance of the one function or another, to very different stages in the process of social production. (I, p. 170; author’s italics)\n\nHere once more is expressed the great gap separating Marx from vulgar political economy. Conventional economic thought contents itself with enumerating various types of money systems, some of which exist in reality, others merely in the imagination. Marx used to remark ironically how proud the economists were with the discovery that money was a commodity. But vulgar economy has forgotten even this discovery of its predecessors. For economic theory, especially since the collapse of the Gold Standard in the 1930s, the commodity is only one of a number of possible money-forms. On this view we seem to be offered a choice, as if we were able to select the most suitable money-type after considering all the advantages and disadvantages of the various possible alternatives. Needless to say, all such ‘theories’ are quite devoid of any historical sense. Neither money, nor any of the various functions it fills, are the result of ‘discoveries’; the various money systems did not arise because people consciously weighed their comparative advantages. They have all emerged out of definite social relations, or, more specifically, out of the contradictions of commodity production and circulation. For Marx, money reflects definite social relations, a point emphasized by Rubin when, in his discussion of the nature of fetishism, he deals with the various functions of money in the following way:\n\n1 If the transfer of goods from sellers to buyers and the inverse transfer are carried out simultaneously, then money assumes the function, acts as, a ‘medium of circulation’.\n\n2 if the transfer of goods precedes the transfer of money, and the relation between sellers and buyers is transformed into a relation between debtor and creditor, then money has now assumed the form of a ‘means of payment’.\n\n3 If the seller keeps the money which he receives from his sale, postponing the moment when he enters a new relationship as a purchaser, then money has acquired the function-form of a ‘hoard’.\n\n4 Once the emergence of capitalism takes place and a relationship between a commodity owner (capitalist) and a commodity owner (the worker selling his labour power) is established through the transfer of money, then money has become transformed into capital. The money which directly connects the capitalist with the worker plays the role, or takes the form of ‘variable capital’. But to establish the necessary relationship with the worker, the capitalist must of necessity possess means of production, or money with which to buy the means of production. In this form money plays the role of ‘constant capital’.\n\nHere are expressed the various ‘sides’ or ‘aspects’ of money, as they have actually come into being. Marx’s task (as with all the reified forms of bourgeois economy) was to grasp the historical character of the various functional forms of money, or its ‘conceptually determined forms of existence’, as the Grundrisse puts it. So the various functions of money cannot be reduced to a series of formal definitions, akin to those encountered in conventional textbooks of economics. The functions dealt with in Capital were the ones which money has actually played (and continues to play) in the evolution of bourgeois economy. The properties of money were abstracted from history. ”",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fugglenuts",
                            "body": "Those Pilling essays are excellent. It’s been years since I’ve read them. I need to go over them again. \n\nHere’s a short something I wrote on the topic (with other links if you’re super bored): https://www.quora.com/What-is-the-capitalist-mode-of-production-in-a-Marxist-point-of-view/answer/Marshall-Solomon?ch=17&oid=213564982&share=61ea413f&srid=uglqJ&target_type=answer\n\n“Capital as self-expanding value embraces not only class relations, a society of a definite character resting on the existence of labour in the form of wage-labour. It is a movement, a circuit-describing process going through various stages, which itself comprises three different forms of circuit-describing process. Therefore it can be understood only as a motion, not as a thing at rest. Those who regard the gaining by value of independent existence as a mere abstraction forget that the movement of industrial capital is this abstraction in actu.”\nCapital: Volume Two\n\nFor Marx, the capitalist mode of production is an expression of a social relation: capital exploiting wage labor. This understanding of capitalism cuts against the grain of our common conceptions and how we use ordinary language. For instance, in his critique of political economy, Marx calls the commodity a social relation, value a social relation, money a social relation, and capital a social relation. We typically think of these things as being nothing but static things, material objects; or, in the case of value, we think of it as a thing-like substance that somehow inheres in material objects (commodities). Marx was highly critical of this thing-like manner of thinking. He called it fetishism. And he believed the organization of capitalist society, its social relations, encouraged individuals to think in fetishistic ways…",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ill-Software8713",
                                    "body": "I am surprised with how accessible that Pilling text is.\nThat’s a good summary emphasizing how Marx draws attention to a social practice/process that underlies the way in which things gain their social character which is mistaken for natural properties.\n\nI especially like Ilyenkov’s approach to ideality for helping to understand this kind of social constructionism as not interactionism (interaction of individual subjects), but the objectivity of social practices upon material artefacts.\n\nhttps://www.marxists.org/archive/ilyenkov/works/ideal/ideal.htm\n\nhttps://www.marxists.org/archive/ilyenkov/works/essays/essay8.htm\n“The ideal, as the form of social man’s activity, exists where the process of the transformation of the body of nature into the object of man’s activity, into the object of labour, and then into the product of labour, takes place. The same thing can be expressed in another way, as follows: the form of the external. thing involved in the labour process is ‘sublated’ in the subjective form of objective activity (action on objects); the latter is objectively registered in the subject in the form of the mechanisms of higher nervous activity; and then there is the reverse sequence of these metamorphoses, namely the verbally expressed idea is transformed into a deed, and through the deed into the form of an external, sensuously perceived thing, into a thing. These two contrary series of metamorphoses form a closed cycle: thing—deed—word—deed—thing. Only in this cyclic movement, constantly renewed, does the ideal, the ideal image of the thing exist.”\n\nhttps://www.jhiblog.org/2023/11/20/evald-ilyenkovs-ecology-of-personality/\n“Collective thinking cannot be grasped by vulgar materialism; it is shaped by what Ilyenkov calls ideals. Ilyenkov compares the ideal to “the form of a jar growing under the hands of a potter.” This ideal is situated neither in the piece of clay nor the body of the potter. It arises from the activity of transforming the clay into a jar. Thinking does not occur “inside the head”—but through the interrelations of the hands, the clay, and the tools. Ilyenkov’s conception of transindividual thinking breaks up the divide between material and social.\n\nAccordingly, we do not see through our eyes but with a thinking body that is the totality of social activity. Ideals are “transplanted” into our bodies not through our senses but our interrelations.”\n\nIt was Ilyenkov (and Andy Blunden) that really helped me understand how objective ideality is because its not individual perception, but collective activity and relations that maintain the ideality of money and such.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "fugglenuts",
                                            "body": "Ilyenkov is a juggernaut. I tried to find a damn Hegel quote on ‘grasping’ but couldn’t pull it up. \n\nHolding this movement, which Ilyenkov refers to, in thought without solidifying it into a thing determined by individual perception is exceedingly difficult. Expressing this movement in language is perhaps even more difficult.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ill-Software8713",
                                                    "body": "I take it because language necessarily abstracts and reifies reality and so it can’t represent the movement or dynamism of reality. But I see in Marx, from Goethe’s romantic science through Hegel an attempt to represent movement through a logical development of a thing which seems fruitful but incredibly difficult.\n\nhttps://www.marxists.org/archive/fromm/works/1961/man/ch05.htm\nAlienation (or “estrangement”) means, for Marx, that man does not experience himself as the acting agent in his grasp of the world, but that the world (nature, others, and he himself) remain alien to him. They stand above and against him as objects, even though they may be objects of his own creation. Alienation is essentially experiencing the world and oneself passively, receptively, as the subject separated from the object.\n\nThe whole concept of alienation found its first expression in Western thought in the Old Testament concept of idolatry.[59] The essence of what the prophets call “idolatry” is not that man worships many gods instead of only one. It is that the idols are the work of man’s own hands — they are things, and man bows down and worships things; worships that which he has created himself. In doing so he transforms himself into a thing. He transfers to the things of his creation the attributes of his own life, and instead of experiencing himself as the creating person, he is in touch with himself only by the worship of the idol. \n\nHe has become estranged from his own life forces, from the wealth of his own potentialties, and is in touch with himself only in the indirect way of submission to life frozen in the idols. [60] The deadness and emptiness of the idol is expressed in the Old Testament: “Eyes they have and they do not see, ears they have and they do not hear,” etc. The more man transfers his own powers to the idols, the poorer he himself becomes, and the more dependent on the idols, so that they permit him to redeem a small part of what was originally his. The idols can be a godlike figure, the state, the church, a person, possessions. Idolatry changes its objects; it is by no means to be found only in those forms in which the idol has a socalled religious meaning. Idolatry is always the worship of something into which man has put his own creative powers, and to which he now submits, instead of experiencing himself in his creative act. Among the many forms of alienation, the most frequent one is alienation in language. If I express a feeling with a word, let us say, if I say “I love you,” the word is meant to be an indication of the reality which exists within myself, the power of my loving. \n\nThe word “love” is meant to be a symbol of the fact love, but as soon as it is spoken it tends to assume a life of its own, it becomes a reality. I am under the illusion that the saying of the word is the equivalent of the experience, and soon I say the word and feel nothing, except the thought of love which the word expresses. The alienation of language shows the whole complexity of alienation. Language is one of the most precious human achievements; to avoid alienation by not speaking would be foolish — yet one must be always aware of the danger of the spoken word, that it threatens to substitute itself for the living experience. The same holds true for all other achievements of man; ideas, art, any kind of man-made objects. They are man’s creations; they are valuable aids for life, yet each one of them is also a trap, a temptation to confuse life with things, experience with artifacts, feeling with surrender and submission.”\n\nWe must speak but be aware that words describe things and isn’t reality itself.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "fugglenuts",
                                                            "body": "Great passage. I love Fromm. Some thinkers shit on him (Adorno, Chomsky, et al), but his simplicity of thought often penetrates much deeper than the verbose who criticize him. \n\nThe inability of language to capture reality “all at once” contradicts our immediate experience of the “this, here, now.” The truth is the whole…but the whole must be developed bit by bit. Language tends to make us think the each and every “bit” is the whole, and thus the truth….if that makes sense.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Ill-Software8713",
                                                                    "body": "I agree, it seems to me Marx’s method is about recreating the concrete whole of reality in some specific area but in thought by using a starting point that contains qualities of the whole (he starts with the commodity, a given empirical thing.)\n\nIn Goethe, he calls it the Urphänomen.\nIn Hegel, this starts as the abstract notion but it is also a concrete universal. In Lev Vygotsky it is a basic unit of analysis.\n\nhttps://www.marxists.org/archive/ilyenkov/works/articles/universal.htm\n\nhttps://www.marxists.org/glossary/terms/chat/index.htm#unit\n\nVygotsky gives an apt analogy for this method: https://www.marxists.org/archive/vygotsky/works/words/ch01.htm\n“The first of these forms of analysis begins with the decomposition of the complex mental whole into its elements. This mode of analysis can be compared with a chemical analysis of water in which water is decomposed into hydrogen and oxygen. The essential feature of this form of analysis is that its products are of a different nature than the whole from which they were derived. The elements lack the characteristics inherent in the whole and they possess properties that it did not possess. When one approaches the problem of thinking and speech by decomposing it into its elements, one adopts the strategy of the man who resorts to the decomposition of water into hydrogen and oxygen in his search for a scientific explanation of the characteristics of water, its capacity to extinguish fire or its conformity to Archimedes law for example. This man will discover, to his chagrin, that hydrogen burns and oxygen sustains combustion. He will never succeed in explaining the characteristics of the whole by analysing the characteristics of its elements. Similarly, a psychology that decomposes verbal thinking into its elements in an attempt to explain its characteristics will search in vain for the unity that is characteristic of the whole. These characteristics are inherent in the phenomenon only as a unified whole. When the whole is analysed into its elements, these characteristics evaporate. In his attempt to reconstruct these characteristics, the investigator is left with no alternative but to search for external, mechanical forms of interaction between the elements.\nSince it results in products that have lost the characteristics of the whole, this process is not a form of analysis in the true sense of that word. At any rate, it is not “analysis” vis à vis the problem to which it was meant to he applied. In fact, with some justification, it can be considered the antithesis of true analysis. The chemical formula for water has a consistent relationship to all the characteristics of water. It applies to water in all its forms. It helps us to understand the characteristics of water as manifested in the great oceans or as manifested in a drop of rain. The decomposition of water into its elements cannot lead to an explanation of these characteristics.”\n\nOnce one begins from this concept, then one can build all the necessary relations that govern a thing rather than having a one sided abstraction that excludes some essential quality. One builds up a system of concepts and properly discerns the limits of those relationships.\nhttps://www.marxists.org/archive/vygotsky/works/1930/psychological-systems.htm\n“On the contrary, each attempt to solve the task consists of the formation of connections, and our knowledge of the object is enriched by the fact that we study it in connection with other objects.\n\nI will give an example. Let us compare the direct image of a nine, for example, the figures on playing cards, and the number 9. The group of nine on playing cards is richer and more concrete than our concept “9,” but the concept “9” involves a number of judgments which are not in the nine on the playing card; “9” is not divisible by even numbers, is divisible by 3, is 32, and the square root of 81; we connect “9” with the series of whole numbers, etc. Hence it is clear that psychologically speaking the process of concept formation resides in the discovery of the connections of the given object with a number of others, in finding the real whole. That is why a mature concept involves the whole totality of its relations, its place in the world, so to speak. “9” is a specific point in the whole theory of numbers with the possibility of infinite development and infinite combination which are always subject to a general law. Two aspects draw our attention: first, the concept is not a collective photograph. It does not develop by rubbing out individual traits of the object. It is the knowledge of the object in its relations, in its connections. Second, the object in the concept is not a modified image but, as contemporary psychological investigations demonstrate, a predisposition for quite a number of judgments. “When a person says ‘mammal,’ asks one of the psychologists, what does it mean psychologically speaking?” It means that the person can develop an idea and in the final analysis that he has a world view, for to determine the place of a mammal in the animal world and the place of the animal world in nature means to have an integral world view.\n\nWe see that the concept is a system of judgments brought into a certain lawful connection: the whole essence is that when we operate with each separate concept, we arc operating with the system as a whole.”\n\nSo I agree that the whole is the truth, it’s the journey in understanding each part of a thing in relation to everything else. To abstract a thing from those relations is part of the fetishism in political economy and modern economics. They confuse social relations with the material things because they don’t understand the development and relation of things due to one sided abstractions that preclude the objective relations that are a prerequisite for things to occur as they do in capitalism.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "voicelesswonder53",
            "body": "Marx worked to objectively define what was seen in the economy in order to elucidate a mechanism for how capital works. That is to say, to see the very complex relationships involved in order to give a nuanced critique of capitalism. \n\nThe social outcomes are part of a complex dynamical system of variables. You never go to market with just utility in hand to produce one sort of outcome. Market values are not just something that is determined by a transaction in a market. The definitions are not that simple. The definitions imply complexity and require a systems analysis.\n\nThink in terms simple linear relationship in a two variable equation vs complex relationships where multiple variables feed back into each other. For example, The way we have to interact with monopolies is not the same as the way two people barter in a market in order to get to a market valuation. The definition of market value is not a simple concept.\n\nWith this approach Marx was able to suggest that the accumulation of capital changes the dynamic negatively as well as positively. \n\nI think this is why Marx was cognizant that capitalism can get you part of the way towards what you want as a societal outcome and the workings of it eventually lead to the system cannibalizing itself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "no.  this line is from the anti-duhring from engels, which is about definitions not being necessarily helpful in the sciences.  as in, setting strict definitional bounds on what life is and isn't, isn't helping us understand life any better, and if anything is hurting our understanding.  \n\nthis is a strange line i've heard from twitter but it doesn't really make any sense and isn't even consistently followed",
            "score": 2,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "Marxists- Reds in general- have a tendency to use far more words than necessary to make a point. In aid of keeping statement, descriptions, and explanations accessible, I think definitions are desirable as long as those definitions are universally applied to one's organization.",
            "score": 1,
            "replies": []
        },
        {
            "author": "imissmobo",
            "body": "i can’t really answer this question, but i assume it’s because he’s a part of the continental philosophy tradition. continental philosophers typically speak around an issue, and you have to read quite a bit of their stuff before you can really understand what they are talking about in any given area. he was also a follower of hegel, whose work was largely perspectival, meaning he didn’t believe about confronting an issue all at once to deliver its “ultimate” meaning, but rather, he would approach it from many different angles to deliver the most nuanced picture",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "imissmobo",
                            "body": "“I openly avowed myself as the pupil of that mighty thinker Hegel.” Capital Postface.\n\nTrue, Marx’s system is very different than that of Hegel’s — but Hegel’s philosophy of history, dialectics, and conception of alienation, were all extraordinarily relevant for Marx. Marx, of course, grounded these philosophical conceptions in material reality, which represents his break with Hegel.\n\nIn his early life, he was very openly a member of the Young Hegelians, who he later came to fervently reject.\n\nHe most definitely was not a dogmatic follower of Hegel. It would be more accurate to say that Marx was inspired by Hegel.\n\nI totally agree with your second paragraph.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "niddemer",
            "body": "It's just the nature of dialectics. Static definitions do not reflect reality, which is a process of constant change and development. We can sum up concrete conditions to develop a concept to the point where we can practically engage with it, but we must always seek to reassess and refine our concepts through practice, which will allow our concepts to become richer and more correct over time.",
            "score": 1,
            "replies": [
                {
                    "author": "InternationalFig400",
                    "body": "the dialectical method = moving (in motion) from the simple and abstract (empty content) to the concrete and complex (filling in the concept's content which is reflected in the the unity of many differences and connexions)\n\nstatic definitions were useless to marx as it implied eternal \"fixity\". things are always in the process of coming into being and passing away.....",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}