{
    "title": "The example of a psychotherapist is one of the clearest illustrations of how surplus-value extraction works under capitalism.",
    "author": "Lastrevio",
    "subreddit": "Marxism",
    "rank": 321,
    "score": 29,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/Marxism/comments/1g8tsmy/the_example_of_a_psychotherapist_is_one_of_the/",
    "id": "1g8tsmy",
    "selftext": "A friend of mine is studying psychology and will soon become a therapist. I asked him whether he plans to open his own practice or work at a clinic. He said he prefers to open his own practice because, at a clinic, the clinic would take a portion of his earnings. For example, if a therapy session costs 200 EUR, as a self-employed therapist, he would keep the entire 200 EUR. However, if he worked at a private clinic, the clinic might take 50%, leaving him with only 100 EUR, paid indirectly through his salary.\n\nAt that moment, I pointed out that this principle applies broadly under capitalism, whenever there’s a choice between being self-employed and working for a private company. When you're self-employed, you keep all the value you produce. But when you're employed by a company, a portion of the value you create is taken by the CEO or shareholders, which Marx referred to as \"surplus-value.\"\n\nThe psychotherapist example is particularly useful for illustrating surplus-value extraction for two reasons. First, becoming a therapist requires minimal capital—aside from perhaps renting a space for your practice—so many therapists end up being self-employed. Second, it’s easy to calculate the value a therapist generates because their work isn’t tied to any pre-existing infrastructure. If a therapy session costs 200 EUR, the therapist directly generates 200 EUR of value in that session.\n\nTo clarify this further, let’s consider my situation. I work as a software engineer, and I frequently handle change requests that my company bills at certain rates. Sometimes, I make changes that are invoiced at 1,000 EUR, but that doesn’t mean I personally generate 1,000 EUR of value in that moment. The work I do relies on a pre-existing software infrastructure that was developed before I even joined the company. For me to make a change worth 1,000 EUR, the software itself needs to exist in a specific state beforehand. This makes it difficult to measure exactly how much value I’m producing as a software engineer, since my work builds on something that was already there. In contrast, a therapist’s work is much easier to quantify, which is why I believe the example of the psychotherapist is the simplest way to explain how capitalism works to someone unfamiliar with Marxist theory.",
    "comments": [
        {
            "author": "44moon",
            "body": "same thing in construction. all tradesmen own all the tools necessary for being self-employed, even when they work for someone else. the only difference between being self-employed and being waged is having a van and finding your own clients.\n\nmy favorite personal anecdote of this is my first foreman. he was working for our boss for $18/hr. quit because he started his own company. the boss literally immediately started subcontracting the same jobs back to my foreman, but this time he was making $35/hr. i don't even think he missed a day. on monday waged at $18/hr. on tuesday subbed out at $35/hr.\n\nthe interesting thing (not so much for marxists) is that the trades in which the primary capital is not labor but machinery, those trades pay the least. basically any trade where you need a workshop and machinery. those workers can't leave the reservation without a massive capital investment so they make literally half of what other trades earn.",
            "score": 12,
            "replies": [
                {
                    "author": "Lastrevio",
                    "body": "> he interesting thing (not so much for marxists) is that the trades in which the primary capital is not labor but machinery, those trades pay the least. basically any trade where you need a workshop and machinery. those workers can't leave the reservation without a massive capital investment so they make literally half of what other trades earn.\n\nThat's such an interesting point! Do you have other resources where I could read about this? Perhaps a study showing exemplifying that concept",
                    "score": 4,
                    "replies": [
                        {
                            "author": "44moon",
                            "body": "unfortunately it's just borne out of my experience. to elaborate, carpenters work on construction sites and millworkers (or cabinetmakers, also called joiners in the UK) work in workshops doing fabrication work. building cabinets, doors, countertops, retail displays, reception stations for hospitals etc. (this is my trade).\n\nin my union, the \"inside rate\" (meaning inside the shop) is $31/hr. whereas the outside rate is almost double, $51/hr. also true nonunion. millworkers will make $18-25/hr, but carpenters make $30-40.\n\nthere's no real skill difference. both jobs are equally as difficult, take about the same amount of time to learn. the only difference is that if you're a carpenter you can buy a van and take on your own clients whenever you want. but if you're a cabinetmaker it requires a ~$200,000 capital investment to be competitive. \n\nmarx alludes to this in value price and profit, in a way, when he talks about why wages in the US were so high compared to europe. in the US, if you felt you were underpaid you could just say fuck it and move out to the frontier, but workers in europe obviously were captive and landless. it's similar in the trades.\n\nback to my point, sheet metal and ironworkers also have \"shop\" crafts. i'm not sure what their wage rates are and if the pattern is the same. just an observation i've made on the shopfloor.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Towersofbeng",
                    "body": "you're so, so close to realizing that the waged laborer is actually being paid $35 / hr\n\n$18 /hr wages\n\n$2-4/hr payroll taxes\n\n$12/ hr workers comp\n\nyes! $12 - 20 / hr workers comp in the trades! similar to the wage itself!",
                    "score": -1,
                    "replies": [
                        {
                            "author": "44moon",
                            "body": "i understand that you're trolling, but you're saying that when a business hires a worker, they are making $0 profit on them. that's economically impossible. in your formulation, no money is being generated for the business or for the business owner. if this were true it would make no sense for a business to hire a worker, because all the money just goes right back to the wages and associated costs.\n\nthere has to be profit in there somewhere. and that profit is value that was produced by the labor of the worker that he didn't receive in the form of wages.\n\nwelcome to r/Marxism",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Towersofbeng",
                                    "body": "it's not a troll: i am in the industry! they are making the same profit off either worker: they're paying them the same. \n\nthis is an excellent view of actually existing socialism: we have a pooled risk in the shape of workers comp that all workers contribute to in dangerous professions, and the result is that they get take home less than the risk pool costs, and often end their careers by injuring themselves.\n\nit also shows how our actually existing socialist system works: we don't like capital controlling everyone so we make it more difficult to hire workers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TsarAleksanderIII",
            "body": "Yeah but it's not exactly the same as pure extraction of wealth. \n\nA clinic handles things that you would otherwise have to on your own: healthcare, retirement, owning and operating a physical location, paying for various kinds of insurance, tax paperwork, advertising or connecting with patients, support staff like administrators and secretaries, and perhaps other stuff. To be clear, these are all things that a business in the US would do; obviously, in other countries there would be different setups regarding healthcare. For that reason you'd expect a different cost-benefit analysis for each case. \n\nThe 'surplus' value is better understood as a fee the clinic charges to handle these things, a fee which both pays for the value of those things and pays for the people who perform those things. If you don't want to pay the 'fee' and would prefer to handle them yourself and keep the money, your can go the way of your friend.",
            "score": 6,
            "replies": [
                {
                    "author": "44moon",
                    "body": "I'm not sure this is a very Marxist interpretation of profit. Correct me if I'm wrong but surplus value does not pay into the fund which provides for the accounting and administrative work necessary to operate a business. That is included within the SNLT of a commodity.\n\nProfit is the unpaid labor of the worker, it's not a surcharge added onto the value of a commodity after the fact. To say that surplus value is a fee charged on top of the constituent labor contained within the commodity implies that commodities are sold above their actual value. Marx refutes this in Value, Price & Profit:\n\n> It is nonsense to suppose that [...] profits of different trades spring from the prices of commodities, or selling them at a price over and above their value.... To explain, therefore, the general nature of profits, you must start from the theorem that, on an average, commodities are sold at their real values, and that profits are derived from selling them at their values, that is, in proportion to the quantity of labour realized in them. If you cannot explain profit upon this supposition, you cannot explain it at all.\n\nI might not be understanding you correctly, totally open to hear your perspective.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "peanutist",
                            "body": "You’re correct, there isn’t a “fee” like the other commenter said. All those services the business provides are already included in the SNLT of the commodity. The clinic extracts the surplus value of his friend by simply paying him less than the value he produced during his work. I do think it’s tricky do directly define the value of a therapy session since the service being provided is so abstract, but there still is surplus value being extracted from the doctor, otherwise the clinic would go bankrupt.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "TsarAleksanderIII",
                            "body": "To start, I think whether or not the relationship between the clinic and the therapist is exploitative is dependant on the specifics, so there could be plenty cases either way from what I understand. \n\nMy point is just to say that a clinic does actually provide to the therapist services that cost money. Unlike a situation where worker gives up their labor in exchange for money, the therapist is giving up their labor in exchange for money, an office to provide patients with therapy, liability insurance, administrators, and a head office that can connect patients with therapists. These are all things that a therapist needs in order to actually perform his practice, so they would have to pay for them anyway. In these sense the therapist is just trading cash for those services to be organized and purchased by a third party, rather than organizing and paying for them himself. \n\nI could be wrong missing stuff but i think that's a good evaluation",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Blothorn",
                            "body": "The point is that “an hour of therapy time as a worker in someone else’s clinic” and “an hour of therapy time as an independent provider” are very different goods—the latter encompasses considerably more labor. You can argue that the  clinic’s *profit* is extracted surplus (although not all from the therapists), but the difference between the hourly fee to the customer and the hourly pay of the therapist is not all surplus—much of it is earned compensation for the labor of the clinic’s other workers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pointlessjihad",
            "body": "Yup, and at least in the US all those credential based fields like Doctors, engineers and lawyers (stuff that requires a degree) are being proletarianized as they are no longer low capital affairs. It takes a lot of money to get an education and it takes a lot of money to start your own practice. So most credentialed professionals are now ending up as workers where they were once petty bourgeois.",
            "score": 2,
            "replies": []
        },
        {
            "author": "duckipn",
            "body": "When one attends a therapy session, nothing is produced, yet somehow the value of said session is 200 EUR; the psychotherapist creates 200 EUR of surplus-value at the expense of the patient. The psychotherapist is able to do so not by owning any \"mean of production,\" but by existing in a society that has accepted psychotherapy as the preferable alternative to amicable interpersonal interactions. The psychotherapist is aware of this phenomenon, yet decides to exploit rather than better society to gain capital. Under capitalism, whether or not they are self-employed, the psychotherapist extracts surplus-value from society.",
            "score": 1,
            "replies": []
        },
        {
            "author": "voicelesswonder53",
            "body": "That's an example of extracting economic rents. As a dentist you can pay rent for an opportunity to work out of a clinic too. Everything that happens after that is in your profit equation. The valuation of opportunity is something that is bid and ask too-- as long as there isn't a monopoly in place it can be a competitive arena.\n\nCapitalism favors the creation of monopolies. Capital will seek to eliminate the competition. It will also make things so hard to profit from that you may not be able to get going without paying an opportunity cost in rent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Picture_me_this",
            "body": "I appreciate this logic comrade but it’s not right. I’m trying to find some quotes here but it’s taking too long so please indulge me in some recollection. Basically as I understand it, there are two problems with your logic. First, there is still some “self-exploitation” that happens in the case of your psychologist friend. He MUST self exploit or he will go out of business. For example, he must pay for his own office and business structure. This is in a sense WORSE than working for a capitalist as now, even the “job” of the capitalist has been outsourced to the petit-bourgeois. Secondly, he is still subject to the whims of the market. He may think he sets his own rates but in fact, those are set already. There is no “getting out” of the system entirely, and this is a problem. What your friend is doing though imo is a step in the right direction although comrades will disagree with me; they might say having a divided and siloed workforce is precisely what enables capitalism to continue.",
            "score": 1,
            "replies": [
                {
                    "author": "Lastrevio",
                    "body": "So how would a structure without any sort of exploitation look like? If you work in a worker cooperative, you're still subjected to the whims of the market and the administrative 'job of the capitalist' is now shared by all members of the coop. In a centrally-planned economy like the USSR's, regular capitalism is replaced by state capitalism where the state is a profit-generating machine that extracts surplus-value from its workers. What other alternatives are there where exploitation does not exist?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Picture_me_this",
                            "body": "This is the million dollar question to use a phrase. There’s nothing you can do in the short to intermediate time other than be aware of and minimize exploitation where you can (accelerationist comrades might say the opposite). Basically communism as we call it is what capitalists would call the [end of scarcity](https://thehill.com/opinion/finance/3670585-the-end-of-scarcity-a-silent-threat-to-us-well-being/amp/). Although the article implies we’re already there, I’d say we’re far from it on a larger scale. Widespread adoption of fusion power (ie free energy), mass work automation and something like a universal basic income is the best I can come up with that would resemble communism as I know it. Which goes to show the power of “It’s easier to imagine the end of the world as it is to imagine the end of capitalism”",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JeffieSandBags",
            "body": "Agencies often provide the services for people and communities that can't afford them from private practice. Therapists, in the US, make more in private practice because they charge good insurance companies the wealthier clients have. I think the surplus value argument starts to get messy for me when I think about the therapist working at a charity organization providing counseling to aslymn seekers or migrant groups. Those therapists make much less money (and I feel do a whole lot of good).",
            "score": 1,
            "replies": []
        }
    ]
}