{
    "title": "What even is \"accelerationism\"?",
    "author": "Icy-External8155",
    "subreddit": "Marxism",
    "rank": 317,
    "score": 43,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 52,
    "url": "https://www.reddit.com/r/Marxism/comments/1ga4469/what_even_is_accelerationism/",
    "id": "1ga4469",
    "selftext": "If you lack the power to do the revolution itself, or anyhow else fight for the proletariat, how could you  possibly \"accelerate capitalism\" more than the ruling class already does by naturally following their interests? \n\nSounds like a buzzword, made up by counter-revolutionary opportunism, or those who think that reforms can't be rolled back by the ruling class as easily as they're implemented. ",
    "comments": [
        {
            "author": "peanutist",
            "body": "Not a fan of accelerationism personally. If the workers of a country are not educated and don’t have class consciousness, the fall of capitalism will just result in fascism/barbarism. Our goal as communists at the current time is to educate the population and organize and not to accelerate the fall of the system, because the material conditions for a revolution are not ripe yet.",
            "score": 49,
            "replies": [
                {
                    "author": "Icy-External8155",
                    "body": "It's not exactly how fascism works. It IS a petty bourgeois movement, but it's always controlled by the large capital\n\n\n I'd like to encourage you reading Dimitrov, it's not that long https://www.marxists.org/reference/archive/dimitrov/works/1935/08_02.htm ",
                    "score": 14,
                    "replies": [
                        {
                            "author": "hrss95",
                            "body": "The link is 404ing. Thing is, I don’t disagree with the comrade above. It might not be the trigger to fascism, but the fall of socdem capitalism would more easily give way to the rise of socialism if there are high rates of organization and class consciousness among the masses, whereas capital would more easily steer those same masses to fight for fascism otherwise. In my view, accelerationism is not the having the power to accelerate things, but wanting for things (and by that I mean the degradation of the quality of life of the working class) to accelerate. So, I won’t use Harris and Trump as an example, but I’ll use the last bourgeois elections of my country as an example. Lula vs Bolsonaro. Lula is seen as a socdem that won’t do much to improve things, but won’t outright facilitate the stripping of workers rights, and the killing of minorities. Bolsonaro on the other hand, is clearly fascist and would do so if it depended on him. So, the accelerationist approach would be willing for Bolsonaro to have won the last elections (and maybe actively voting for it), so the quality of life of the working class would degrade faster, and thus people would revolt faster, and capitalism would end faster. That problem with that approach is that fascism thrives in chaos, and things would not go well without an organized working class.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "peanutist",
                                    "body": "r/suddenlycaralho kkkkkk\n\nMas sim, concordo com seu ponto em parte, se entendi ele corretamente. Eu pessoalmente não queria q o bolsonaro ganhasse justamente pelas condições materiais do nosso país. Claro, ele ia fuder o Brasil mais ainda, mas vê se o nosso país têm consciência de classe? Todo mundo viciado em fetichismo de commodity, idolatrando influencer burgues, o único sonho é ascender de classe e se tornar um próprio burguês/pequeno burguês. Se o capitalismo cair aqui tão rápido assim, o que vai acontecer é só geral tentando achar segurança em milícia, facção, organização independente, já que nem estado teria. Eventualmente apareceria um Marçal da vida prometendo qualquer bosta que a população quiser ouvir, de “retornar o brasil a antiga gloria”, “mais segurança” (prender e matar bandido (qualquer pessoa negra que olhar torto pra policia)). Esse maluco vai consolidar uma base forte e eventualmente chegar num nível de poder que será um pseudo-governo que controla tudo. Por isso sou muito contra o aceleracionismo (como crls escreve isso em português). Nem Brasil nem EUA têm condições materiais pra uma revolução comunista ainda.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hrss95",
                                            "body": "Hahaha, bom ver um camarada tupiniquim por aqui. Eu concordo completamente com você, tanto no primeiro comentário quando nesse. De qual parte do meu argumento você discorda?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "peanutist",
                                                    "body": "Relendo seu comentário acho que eu que entendi errado, achei que você estava concordando com a premissa de querer q o bolsonaro seja eleito pra acelerar as coisas, mas acho que você estava simplesmente descrevendo esse pensamento, né?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "hrss95",
                            "body": "One other thing. It’s easier to organize under social democracies than under fascism. It was easier for the radical left to organize under the Weimar Republic than under the nazis.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "myaltduh",
                                    "body": "At the very least it’s easier to do stuff like spread educational materials about left ideas. In socdem countries that’s at least legal. The state still suppresses labor, but it’s also not black-bagging dissidents.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "grandfamine",
                    "body": "To play devil's advocate here, you'll be waiting for \"the material conditions to be right\" literally forever. Revolution is not convenient, it is not pretty, and it is necessarily destructive. Thing is, we exist on borrowed time. Do you see how the Bourgeoisie salivates over the possibility of replacing the proletariat with AI and robots? With the way tech is advancing, there will come a time where the Bourgeoisie no longer requires the Proletariat, and at that point, we will see a mass genocide. Things like power, food, water, the means for survival, will be withheld and we will all die. Waiting for change to come without sacrifice will kill us all. I'd rather take my chances with barbarism.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dumpsterac1d",
            "body": "The idea that as conditions worsen for the working class it will trigger action/revolution.\n\n\nThe issue here is that there's no guarantee it will be a communist revolution and will most likely be reactionary.\n\n\nIt also gives a pass to not actually do any community organizing or building of any kind because the whole concept revolves around \"doing nothing\".\n\n\nI see it as an opposite to the \"harm reduction\" crowd, both generally pretty awful ideas from the \"anything but putting in organizational work\" crowd hellbent on voting",
            "score": 17,
            "replies": []
        },
        {
            "author": "TheCynicClinic",
            "body": "Accelerationism is the idea that exacerbating the poor conditions under a capitalist system (constant growth, instability, policies that go against the interests of the working class, etc.) will speed up the opportunity for a socialist/communist rupture.\n\nThis idea is actually contradictory to Marxism. Being pro-accelerationist is to be indifferent about the current struggles of the working class and going against their interests for some uncertain long-term outcome. Capitalism in and of itself will demonstrate its inadequacy through its inability to meet the increasing demands of the working class.",
            "score": 12,
            "replies": [
                {
                    "author": "myaltduh",
                    "body": "Nothing radicalizes liberals faster than watching liberal politicians utterly fail to meaningfully improve things. Eight years of Obama gave the US the rise of Bernie Sanders, while four years of Trump seemed to just make liberals desperate to “go back to brunch.” With conservatives or fascists in power, it’s possible to pretend that liberalism will fix things, but when liberals just uphold capital, people start wondering about other options.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Exotic_Magazine2908",
                            "body": "When liberals uphold capital, most people start wondering about Trump, again, with so much intensity that the liberal folk are too busy defending the liberal elite doing nothing. The full circle is closed. No one is improving anything.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tempestor_Prime",
            "body": "Marx described how corruption and inequality can fester in capitalist systems. The idea of \"accelerationism\" is to purposefully support capitalist systems and infrastructures to \"accelerate\" the growth of corruption and inequality to its societal breaking point. \nBasically, they are trying to rip the bandaid off rather than slowly peel it or wait for it to naturally fall off.",
            "score": 8,
            "replies": []
        },
        {
            "author": "None",
            "body": "Idk what accelerationism is exactly but there are leftists who think the worse things get the more revolutionary people will be. And that’s not a new idea but it’s always proven wrong. It goes against Lenin’s theory and practice. It goes against strategies the Comintern devised to fight fascism. \n\nSo many so-called Marxists want Trump to win because they think it shakes people into being politically active. Descending into fascism would kill any socialist movement. \n\nLeftists also fall into this trap that since we are against the liberal capitalist state, and so is the right, we can find common ground there. Or at least take advantage of them dismantling the state for us. But fascists are not going to dismantle the repressive apparatus, only those democratic aspects which benefit the working class. And it’s in our interest to preserve the state to do the things we want to do, e.g. nationalize industries.\n\nAnother aspect to this belief is an idealist understanding of how to organize. Socialists think if we just hold the right positions, and offer people the right ideas in times of crisis, that they’ll come flocking to us. Having the right ideas means nothing and holds no power to convince people. It is only through shared struggle and building relationships and connections that we can move people.\n\nThe way we build a revolutionary movement is by fighting with the working class for better conditions, even if they are meager reforms.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": "so \"accelerationism\" is generally just used as an insult for people who supposedly want to make things worse in the moment to hasten some new society forming. When people refer to accelerationists, they're implying someone who believes this. You can find specific people in specific places saying things that can be taken to mean this but there is not an \"accelerationist\" tendency or tradition in this sense. \n\nThere is a philosophical tradition that self-identifies as accelerationists that doesn't generally mean this. They take from the works of Deleuze and Guattari who have a philosphical concept of \"deterritorialization\" where certain events and eras are synonymous with the dissolving of traditions, social bonds, the old world and \"reterritorialization\" where things are reabsorbed back into society. Accelerationists advocate maximum deterritorialization in order to reach a new society. What this actually look like depends heavily on the specific thinker.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Nobody1000000",
            "body": "Perhaps look into Nick Land…\n\nFrom Land’s perspective, accelerationism is the idea that the best way to overcome or escape the problems of capitalism is not through resistance or reform, but by speeding up its inherent processes to the point where it collapses or transforms into something radically new. He believes that capitalism, particularly its technological and cybernetic elements, is a kind of unstoppable force that, if pushed to its extremes, will lead to the destruction of current social and economic structures, potentially paving the way for post-human futures dominated by artificial intelligence and advanced technological systems.\n\nIn his early work in the 1990s, Land wrote about how capitalism is an abstract machine, almost like a virus or an artificial intelligence, which increasingly erodes human agency. Rather than seeing this as a negative, he believed this collapse of traditional structures could accelerate the transition to a post-human world driven by technology and intelligence beyond human comprehension.\n\nThis view contrasts with the more left-leaning forms of accelerationism, which tend to seek the use of capitalist technologies to create more egalitarian or emancipatory futures.",
            "score": 3,
            "replies": [
                {
                    "author": "amhighlyregarded",
                    "body": "In recent years Land has actually gone as far as to assert he thinks capitalism *is* ontologically the same as artificial intelligence, that its an emergent property of humanity's social relations (the same way an ant's nest is an emergent system composed of individual ants guided by pheromones, which could be analogous to the way capital naturally organizes human activity increasingly towards technological innovation, and eventually true artificial general intelligence, in the pursuit of profit).\n\nIt's a bit out*land*\\-ish for me, but its a very interesting and somewhat compelling theory nonetheless...",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Nobody1000000",
                            "body": "Thanks for making me 😂! Most of Land’s takes seem out*land*ish at first, but maybe truth comes in the 3 stages Schopenhauer outlined: First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident.\n\nWhen one thinks about how much human activity is being shaped by profit-driven algorithms and automation, accelerationism starts to feel less like sci-fi and more like a possible trajectory. Whether or not you agree with him, Land’s theories definitely get you thinking!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "radd_racer",
            "body": "Accelerationism isn’t a thing, only a psychopath would want to amplify the suffering of the common proletarian to achieve a political aim. They say “lesser evilism” is evil, yet you want a fascist to win who has explicitly said he’ll target marginalized groups and go after communists? Well, maybe a fascist or a bot/plant who is trying to shift the election towards Trump, at least here in the States, is a fan of “accelerationism.”\n\nIf you think laissez-faire capitalism is bad, wait until you get a load of fascism.",
            "score": 3,
            "replies": [
                {
                    "author": "amhighlyregarded",
                    "body": "I think accelerationism as such, which I admit is the popular layman's conception of the argument which has been foolishly endorsed by many leftists, isn't accurate to the actual definition.   \n  \nAccelerationism isn't necessarily prescriptive (\"we ought to accelerate capitalism\") but rather descriptive, that capitalism is accelerating towards a technological singularity and that there's nothing we can do to stop it. I don't agree with the fatalism, though, and thinking that if we elect fascists maybe we'll get communism eventually is internet brainrot.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "radd_racer",
                            "body": "That makes a lot of sense. Modern technology is accelerating the demise of capitalism as human labor is being gradually replaced by machines to maximize profits of the bourgeois. Then, it’s not something we’re forcing to happen, it’s a natural consequence of current material conditions.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Organic-Walk5873",
            "body": "Something privileged tankoids post about from their gated community. Brutally nihilistic and feels comfortable throwing the most vulnerable under the bus so they can hopefully build socialism from the ashes of whatever falls.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Exotic_Magazine2908",
            "body": "I won't speak theory, but what I perceive to be the common reason for left people to reject or deride accelerationism.\n\nThe point is that left-wing people have become too complacent. They just wait for something good to spring out of nowhere or they just parrot the usual stuff about 'organizing' (even if no organizing is ever taking place anywhere). Some have things to lose in the current systems (think academics, people in corporate jobs, some have savings, etc). Because no one knows what to do and no one acts, I would prefer accelerationism. It is cynical ? Yes. It will hurt people ? Yes. But they are hurt or will be hurting anyway as the current system is getting worse and worse. That's why I take the most unpopular position on accelerationism. It may be bring a fascist revolution, not communist. But the fascism is coming for you either way. Just stupid libs think that voting for x, y candidate would prevent fascism, as if fascism is something that can come from one single party/candidate. No, it is a general system of oppression. It will come anyway even if the working people will no longer tolerate living in this system. Trump/fascist candidates are just symptoms of a system decaying into fascism, not causes themselves. That's why is stupid to vote liberal and hope for the best and parroting about 'organizing' (when you do nothing actually, just 'vote' and hope) thinking that this way you keep 'fascism' aside when it is this sort of political elite that caused people like Trump to actually become dangerous. I think they are doing it by design. The liberal elite is so rotten and out of touch with reality that fascism you get either way - you vote for them or for Trump directly.",
            "score": 1,
            "replies": [
                {
                    "author": "Middle_Ad8183",
                    "body": "This seems like a privileged take, from someone who's pretty confident that the harms caused by letting fascism run amok won't land at their doorstep. It also feels lazy and nihilistic. Organizing does happen. It's your choice not to be a part of any of it, but rather hope for collapse while you do nothing and assume everything will sort itself out somehow.\n\nYou're kind of proving the point that accelerationism is inherently a right wing reactionary posture. \n\nWhat is your end goal? You seem to stop at, \"may as well let the fascists win\".",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Exotic_Magazine2908",
                            "body": "I am pretty confident that it will land at my doorstep too. What do I have to lose ? Almost nothing. I will lose everything eight way if this rotten system is sustained too long on life support. We can lie to ourselves that voting for the candidate that will do everything to uphold the stability of the financial system just so we won't lose those pennies we have as 'savings' will somehow magically allow us to educate the masses into socialism/communism. Keep dreaming - it is exactly this extraction machine, the corruption of the establishment that brought Trump into the foreground in the first place. It is voting for a candidate just because it is lesser evil that allowed this critical events to unravel. And it will be even worse. The more we align to side with a party that polarizes the working class the more working class will associate us with them. Fascists are already IN. The war on Gaza demonstrates that to everyone which has eyes to see. You just encourage them to be ever more transparent by still voting for one of the oppressors.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "winter_strawberries",
            "body": "i got dumped by a guy who believes in accelerationism because i’m voting for harris (i want to avoid being put in a concentration camp). apparently i wasn’t “radical” enough for him. he said we should stay out of the election and if trump wins, all the better because things will get so bad the people will finally rise up and start a violent revolution 🙄\n\nwhat i want to know is why he and other accelerationists don’t just vote for trump. i feel like it’s all posturing and virtue signaling, which i have no use for since i’ve been a communist since the reagan era (before this guy was even born). if i believed trump’s victory would bring about the revolution, i wouldn’t just vote for him, i’d volunteer for his campaign and try to convince my friends and family to vote for him too. i just don’t see accelerationists doing that. what gives?",
            "score": 1,
            "replies": [
                {
                    "author": "Icy-External8155",
                    "body": "That's how I've seen the \"accelerationism\" thing mostly. I think that serves as a good response:  https://www.reddit.com/r/LateStageCapitalism/comments/1g8u461/we_are_in_favor_of_voting_discussing_voting_in_a/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Accelerationism on the left is basically about 'the productive forces', with the idea that capitalism will create the technology needed for a post scarcity communist society. Imo it is completely naive and counter revolutionary, but lures people in with esoteric language and cyberpunk imagery.\n\n\nThere's also right accelerationism which is even worse, basically the fascist fringe within Silicon Valley.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ruskihaxor",
            "body": "It's an extrapolation of what we saw during the industrial revolution. The idea that the cost of production will continue to reduce due to increased productivity.\n\nIt was inconceivable just 70 yrs ago that the average American would be able to have chicken in every family dinner. Now it's expected.\n\nWhile corporations increase profits they're styll typically maintained between 10-20%.\n\nOnce the cost of everything drops, more and more become available to most people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future-Physics-1924",
            "body": ">how could you possibly \"accelerate capitalism\" more than the ruling class already does by naturally following their interests\n\nBy trying to get people to prioritize economic growth above everything else. It's honestly a sympathetic position considering the degree to which it seems that there is no progress to be made on socialism right now, at least in the advanced economies.",
            "score": 1,
            "replies": [
                {
                    "author": "Icy-External8155",
                    "body": "Why \"trying to get people to\", if it's both done without your help, and you lack any power and influence in the first place?  \n Do you really suppose that capitalism is when people vote for it? ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Future-Physics-1924",
                            "body": ">Why \"trying to get people to\", if it's both done without your help, and you lack any power and influence in the first place?\n\nThe state generally tries to prioritize economic growth and at least a part of the ruling class besides does, but the attitudes of the public generally prove to be a significant obstacle to the enactment of policies that prioritize economic growth. I think there's more that could be done on this front on an individual level than could be done on an individual level in support of revolution.\n\n>Do you really suppose that capitalism is when people vote for it?\n\nWhat?\n\nEdit: well that was a pretty quick ban",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Icy-External8155",
                                    "body": "Attitudes of the public? You completely miss the point of what is class dictatorship. \n\n\n  https://www.cambridge.org/core/journals/perspectives-on-politics/article/testing-theories-of-american-politics-elites-interest-groups-and-average-citizens/62327F513959D0A304D4893B382B992B ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}