{
    "title": "The idea that religion is the opiates of the masses sort of explains the popularity of Trump",
    "author": "sufinomo",
    "subreddit": "Marxism",
    "rank": 285,
    "score": 92,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 69,
    "url": "https://www.reddit.com/r/Marxism/comments/1go4idw/the_idea_that_religion_is_the_opiates_of_the/",
    "id": "1go4idw",
    "selftext": "First of all in this context opiates means to numb the discomfort of lower income manual labor lifestyle. When the democratic party doesnt promote enough ideas related to easing the burden of being a lower income person, it creates a situation where people will prefer to use metaphysical beliefs to escape the discomfort. In some way the competition is between the metaphysical approach to dealing with discomfort vs the material approach. When people believe the material approach is not attainable theyll turn towards beliefs that give them emotional strength. It doesnt have to be a particular religion, but rather some sort of belief that gives people emotional willpower. Trump, fascism and general right wing ideology is foundationed upon beliefs that make people feel strong. ",
    "comments": [
        {
            "author": "Cptn_Melvin_Seahorse",
            "body": "Trump is an outlet for people's rage at the political system that has wronged them. \n\nPeople are suffering and the Democrats message was look at how great things are, while Trump said fuck the system.",
            "score": 12,
            "replies": [
                {
                    "author": "Axin_Saxon",
                    "body": "Which is hilarious because his policy is literally just a turbocharged version of the neoliberal privatization and corporate capture that got us here to begin with. His administration will only serve to cement that Thatcherite/Reaganomic model.\n\nHe’s an establishment candidate with an anti-establishment veneer. Proof that politics is style over substance.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "malershoe",
                    "body": "I disagree with this perspective. Maybe this was the case eight years ago, but trump has decisively shown himself to be \"just another president\", and the largest segment of his voter base isn't angsty teens, it's \"normal\", \"reasonable\" and not necessarily radical voters",
                    "score": 7,
                    "replies": [
                        {
                            "author": "radd_racer",
                            "body": "We know what you’re saying to be objectively true, yet Trump was able to sell low-information yet disgruntled voters a message that he can still “drain the swamp.” He effectively campaigned a populist message of changing the system, even though he’s likely going to change it for the worse. \n\nDemocrats sold the message of keeping things the same. Upon nuanced investigation, that isn’t 100% true, yet America consumes information in memes, biased bourgeois news media, sound bites, and of course, Reddit.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "1carcarah1",
                    "body": "I completely agree with you. This is the right path to go through. \n\nI don't understand why people who call themselves Marxists avoid analyzing the material conditions of people to create an analysis based on morality and other abstract concepts.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Patriclus",
                            "body": "It’s almost too neat an explanation though.\n\nI really do think disengaging with spirituality is detrimental to Marxism. \n\nIf we refuse to even understand and engage in the thought processes that dominate mainstream culture we might as well be yelling at a brick wall. Especially culturally, atheism is a practice that is most popular in former colonial superpowers. How is it not supposed to come off as chauvinism?\n\nMetaphysical properties are often (historically) physical properties that aren’t yet fully understood. I don’t think it’s as black and white as most of us marxists present it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "1carcarah1",
                                    "body": "It's because of the way religion, racism, xenophobia, misogyny, homophobia, and so on are expressed aren't inherent traits of workers but the consequence of their material conditions. Start engaging with their issues and organize workers toward a common goal to improve their material conditions, and the expression of such matters will improve.\n\nBut here I'm talking about society at large, not individuals. Do you want to experience spirituality in its most deep sense? Do it. There's no point for a Marxist to argue against it. Do you want to build a church to sell the ideology that life doesn't matter, only the afterlife does? Then we have a problem.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "fightdghhvxdr",
                                    "body": "Refuse to understand and engage in the thought processes that dominate mainstream culture? These thought processes are regularly being analyzed and matched to the material reality causing the social shifts. That’s not “refusing to understand” at all.\n\nHow exactly do you expect a flat materialist ideology which outright rejects spiritualist nonsense to “engage with it?” By going against our understanding of reality completely? \n\n\nYou don’t think what exactly is as black and white as marxists make it out to be? That Physics works based upon ironclad material rules, and not magic?\n\nI’m confused as to where you’re coming from with this. Religious institutions are inherently idealist and reactionary, there is no other way to cut it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Disinformation_Bot",
            "body": "One of the most powerful aspects of Abrahamic religion is that they act with a carrot and stick model.\nIf you forsake earthly pleasures, submit to your master, ignore your own needs, and worship God, you'll get eternal salvation in paradise. However, if you turn to pleasures of the flesh, earthly material, things, or seek a better life for yourself... then you're going to spend eternity burning in hell with Satan.\n\nI really think many Marxists would do well to read up on Gnostic traditions, which directly critique Abrahamic religions, albeit from a spiritual perspective. Gnostic analysis of an Abrahamic god (and I'm paraphrasing/simplifying) casts it as the \"demiurge,\" a selfish and false god who created religion to serve itself, and holds that the only divinity is the one-ness of the universe, and the path to enlightenment is to seek personal knowledge of the divine through transcendent experience. In my mind, there are some interesting parallels between Gnosticism in the spiritual realm and Marxism in the material realm.",
            "score": 21,
            "replies": [
                {
                    "author": "OtterinTrenchCoat",
                    "body": "The funny thing is that the development of hell as a punishment is a later phenomenon. Early Abrahamic literature tends to leave the conditions of the afterlife rather vague and focuses on material punishments; famine, invasion, destruction etc.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Capricancerous",
                            "body": "Indeed. In the Old Testament the big guy clearly takes an active role in unleashing plagues and ruining personal lives. Who needs hell when hell can be brought to the realm of earth swiftly and with great force. Divinely wrought \"tests\" of human goodness and faith were abounding.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "I wholeheartedly agree with your last paragraph. Gnosticism is the very thing that lead me into Marxism largely because both put such a positive emphasis on garnering knowledge for practical use. I honestly can’t believe I’d witness someone talking about Gnostic beliefs in a Marxist sub in a positive light. Makes me feel welcome to be here 🥰\n\nFrom a fellow Gnostic. Albeit, of the Luciferian kind 𓆩ꨄ︎𓆪",
                    "score": 9,
                    "replies": [
                        {
                            "author": "sufinomo",
                            "body": "There is some relationship between Marx and Gnosticism. Western Gnosticism is built on the foundation of Platos philosphy which is idealism. Marxism is based on Karl Marx's dialectical materialism which is meant to challenge Hegels dialectical idealism. Marx studied under one of Hegels pupils which is where he learned about Hegels idealism, and then formulated his own theory to oppose it. Marx also critisized Platos understanding of politics and society as too idealistic rather than materialistic.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Gnosticism as a philosophical position does predate Plato as well as western philosophy in general by quite a few millennia though, tbf. Hindus, for instance, believe in their own type of Gnostic traditions that go back quite a few thousand years but have a similar foundation of seeking enlightenment through personal knowledge through transcendence as well as the idea of an antagonistic demiurge being a cosmological mob boss. The cool thing about Gnostic traditions is that there is so much written about it from so many foundational schools of thoughts that you can safely ignore all of Plato’s writings and still have enough Gnostic knowledge to keep you busy in your spiritual practice for an entire lifetime.\n\nMe personally, though, the Gnosticism I follow isn’t of the Plato tradition and actually disagrees with some of the main aspects of it (even if it shares a couple philosophical concepts in a way) so anyone trying to actually use it to try and accuse my spirituality and political ideology as *’incompatible’* or whatever is engaged in a bit of a false premise from the get-go.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PWN57R",
                            "body": "Marxism actually led me to gnosticism, and to understanding why I abandoned my faith all those years ago.  It feels good to see other people make similar connections, even if they were in opposite directions.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Disinformation_Bot",
                            "body": "I'm a fairly new Gnostic; I, too, am surprised to see a fellow Gnostic in a Marxist space. If you have resources for getting oriented/some central Gnostic texts you could share, I would appreciate it very much!",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sufinomo",
                    "body": "I think Buddhism and Vedic religions also have a similar approach. I wish we had more surviving religions to understand what others believed, the problem is most of them were erased. I feel like reading about the pagan Greeks is not going to give me a full understanding as opposed to a living tradition. As far as I can find on it, the Greeks believed in locations such as Tartarus, Elysium and the underworld which all relate to good and evil people and their afterlifes.\n\n[https://en.wikipedia.org/wiki/Tartarus](https://en.wikipedia.org/wiki/Tartarus)\n\n  \n[https://en.wikipedia.org/wiki/Elysium](https://en.wikipedia.org/wiki/Elysium)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Minute_Jacket_4523",
                            "body": "There are a few of the old gnostic religions left, but they are very secretive, and for good reason: everyone, even Marxists(Using marxist to describe the ideologies pertinent to the situation in the same vein as abrahamic is used to describe Christianity, Islam, and Judaism), have beat the ever loving fuck out of them for various reasons. Two that come to mind for the sake of the discussion are manichaeism and Mandaeism.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gomrade",
                    "body": "Gnosticism was an elitist movement that despised those that later became the Orthodox for being \"too materialistic\" and... because they shared their wealth with each other (seeing how Christianity is now, this is pretty ironic). Believing that the Material world is inherently evil and corrupt and that salvation will come from some \"hidden\" realm that transcends it, from an unknowable God that doesn't interact with the real one, is a red flag (not the good kind) that these beliefs come from the Aristocracy/The Ancient Slave Owners. It's like, if the Platonic tendencies of Christianity were reinforced to the max. \n\nGnostics were also some of the first anti-semites, implying the Jewish god was the Devil, but their own version of made-up God was cool. Gnosticism might as well be the most undemocratic version of Christianity, right next to Prosperity Gospel White American Evangelism and Nazi \"Positive Christianity\".",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Disinformation_Bot",
                            "body": "Gnostic tradition encompasses a broad set of different philosophies and beliefs. Literally any other religious group you want to pick has some sordid history if you pick and choose. \n\nYour totalization is ahistorical and does not stand in contrast to any other religious tradition. Your lack of understanding of basic Gnostic concepts leads you to make false assumptions based on surface-level understanding.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "damagedproletarian",
                    "body": "I always saw the only rational purpose of religion was to give people a sense of moral integrity. The problem with Marxist materialism is that it rules out the existence of the spiritual world. While I prefer science over spiritualism and I'm sure most rational people do but we still need a sense of moral integrity lest we behave like animals.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Disinformation_Bot",
                            "body": "I don't think we necessarily need religion/spirituality to develop a \"moral code,\" a purely materialist interpretation would base pro-social tendencies in an evolutionary perspective rather than based on some imagined absolute code of moral conduct.\n\nRather, as a materialist and a skeptic, I think it is rather arrogant and uncritical (not you, I mean hardcore materialists who reject consideration of the immaterial outright) to believe we know all there is to know about materialism itself. If Gnosis can be achieved, i.e. if humans can gain personal knowledge of tangible divinity, then the contradiction between spiritual and material can be resolved.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "damagedproletarian",
                                    "body": "Well my take is that we need to understand the link between morality and economics. To do this we actually need a better understanding of nature and how living things establish reciprocity. Only then can we start to build a system that is no longer based on exploitation. While knowledge of divinity encompasses this sadly we are moving deeper and deeper in a more exploitative world with moral decay and such. \n\nIndigenous cultures may actually provide us with much needed guidance.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TechWormBoom",
            "body": "Personally, I subscribe to the anthropological explanation more than the Marxist axiom that religion is the opiate of the masses.\n\nFor instance, North American indigenous populations held very spiritual traditions marked by the specific landscapes and ecosystems they inhabited. And because there is a large oral tradition among indigenous religions, there was a flexibility in the transmission of those traditions rather than a rigid dogma. Cultures were more willing to accept new rituals depending on the community.\n\nIn contrast, Abrahamic religions require a strict dogma. Considering Islam, proximity to trade routes allowed for the ideas and religious beliefs to spread through North Africa and the Arabian Peninsula. Similarly, Christianity spread through Roman trade networks. The reason that Abrahamic religions require strict dogma is because they require the unification of very different populations and cultures and they need to adhere to specific principles in order to legitimize the political stability necessary to maintain the trade and economic networks that allowed them to spread in the first place. Monotheism allows a cohesive moral worldview that can unify peoples from across multiple continents.\n\nSimilarly, Trump offers a cohesive moral worldview that unifies through different ethnic groups with simple solutions.",
            "score": 6,
            "replies": [
                {
                    "author": "sufinomo",
                    "body": "I dont know if thats true because vedic religions are very wide spread but they have alot of different beliefs. Buddhism had reached across most of Asia. \n\nJudaism is a abrahamic and monothiestic religion yet it wasnt wide spread and it wasnt related to trade.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TechWormBoom",
                            "body": "What you said agrees with me. \n\nJudaism was not related to trade, it did serve to unify various amounts of people through universal principles. Which is what I am saying is an anthropological reason as to why religions persist rather than some “opiate of the masses”. “Successful” religions are able to unify vast amounts of people rather than be too local. There was not always a singular Jewish people. There were a myriad of tribes that served as minorities under various empires like the Babylonians and Roman Empires. It wasn’t until polytheistic religions began to subside that a unified Jewish people became to serve as an identity. But there were many tribes until that.\n\nVedic religions reinforced existing political orders. They reinforced a hierarchical social order through its emphasis on ritual purity and caste duties - much like Christianity/Islam require adherence to the political and social order to be legitimate.\n\nBuddhism fostered transnational networks through pilgrimage routes, trade connections, and monastic exchanges across Asia. It provided an alternative to the hierarchy Vedic religions, again relying on universal principles and morals. Buddhism is also very flexible - like American indigenous cultures - and were able to include local cultures while maintaining core teachings.\n\nThe trade comment only existed to justify how religions spread so rapidly. The fact that Judaism is not widespread supports what I said.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "grorgle",
            "body": "In several ways, very well said about at least one of the reasons Trump is able to garner so much support. That being said, I'm not certain the \"material\" approach of the Democrats really has the ability to ease the discomfort. It's a stopgap against making things much worse in the short term (truly better than the Republicans) while not in any way altering the ultimate dynamics of power or providing more meaningful and lasting empowerment (metaphysical or material). I like your analogy but suspect it gives the Democratic Party too much credit.",
            "score": 3,
            "replies": [
                {
                    "author": "sufinomo",
                    "body": "One thing I was meant to argue is that the democratic parties approach is too little to offer which is why it fails. A few crumbs of material support is not going to give people the same ease as a strong belief system.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Creepy_Orchid_9517",
                            "body": "Absolutely, someone *deep* into this wave of the faux Christianity have the innate sense that they're beyond the material existence, by being \"accepted\" into heaven at death no matter whay, they in turn, see social inequalities of minorities as just a *\"moral and ethical failure\"* on their part, financial failures are due to poor responsibility management, the education of progressive or remotely left leaning ideas are \"indoctrination\", and so on, they already have the sense of moral high ground, but more dangerously, they will be \"redeemed\" in death no matter what. An uncontrolled nationalist style religion is truly a drug that blinds people's natural moral and ethical compass, evaporating class consciousness and any compassion for those \"below them\" in the set system. idk this is just my take, the evaporation of any semblance of class consciousness today compared to say the 1970s is concerning for anyone that wants Marxist led progress.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Trump is literally a religious figure to many people at this point.  The populism has shifted into full blown messianism.  I can't explain it here on reddit because certain terms are banned and the comment will disappear.  So sadly, this is not a conversation that we can have.  Censorship remains a major barrier.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "Well religion isn’t so much the opiate of the masses anymore. \n\nNow we have designer Valium which can produce a better effect than Christianity ever could. \n\nModern Christianity really is just a pastiche of what it formerly was.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kidhideous2",
            "body": "I really think that it's important to put the blame on the Democrats for offering nothing rather than Trump and co for being shitbags or the people for voting Trump.\nIt's not like either are blameless, but I do believe that even in the context of the dumbass American elections a capable left wing candidate could clean up. The two main parties have no message at all, a thing that I noticed about Trump this time was that he was mostly boring as shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Wowzers the popularity of trump is explained by people writing utter bullshit like this and trying to sell it as truth.  Its not strength its safety and to miss this so entirely is amazingly thick of you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drdoctormusic",
            "body": "There is a reason that monotheistic religions are so synonymous with imperialism and empire: their morality is bestowed from the top down by a superior entity which makes it very easy for people to put themselves in that chair and speak for God.\n\nPolytheistic religions had many gods with conflicting views of morality and it was the job of humans to navigate this and create their own morality in a way that operated harmoniously with everyone in their tribe. It is a horizontal vs vertical approach to ethics that has sadly been lost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious_Share103",
            "body": "This is nonsense. Trump is popular because he’s saying out loud the exact same things his supporters have been saying to each other in private. That’s what a populist is. You don’t to have theorize and navel-gaze about it. It’s pretty clear.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Beginning-Shop-6731",
            "body": "Marxism has the same appeal as Trump; it’s an appeal to emotion. Humans get inspired by authoritarian savior figures- this is true to communism and fascism. Rational economic appeals to the mind never hit as hard as appeals to emotion. The Democrats are also outrageously arrogant, demanding that the working class vote for them, while at the same time disdaining them for being backwards and insufficiently socially enlightened. If your party disdains the traditional belief systems of the majority of the country, you cant’t expect them to win.\nI voted for Kamala, because I think the Republican party is openly anti-democratic and fascist now, but think the Democratic party has a losing platform in presidential elections for the foreseeable future. It’s beliefs are minority principles endorsed by an elite, for whom equality is mostly a parlor game to show off their expensive educations. It’s the party of condescending rich coastal elites now",
            "score": -1,
            "replies": []
        }
    ]
}