{
    "title": "3 minute action! Tell Biden and Congress: Send Humanitarian Aid and End Trump’s War on Cuba",
    "author": "None",
    "subreddit": "Marxism",
    "rank": 275,
    "score": 23,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Marxism/comments/1gtf3k6/3_minute_action_tell_biden_and_congress_send/",
    "id": "1gtf3k6",
    "selftext": "tl;dr: [Send a letter to President Biden and Congress urging them to Send humanitarian aid to Cuba and End restrictive sanctions](https://actionnetwork.org/letters/sendandend?source=reddit)\n\nCuba is in crisis. It's time for Biden to #SendAndEnd!\n\nThe island has been hit by two hurricanes, major earthquakes, and an energy shortage— a climate and humanitarian crisis all compounded by Trump-era sanctions and Cuba's designation on the State Sponsors of Terror list that blocks access to essential resources like trade, remittances, and financial support. Millions are suffering. U.S. sanctions are worsening Cuba’s hardship, cutting off critical resources needed for recovery and resilience. **With Trump set to return to office in 2025, there is a limited window for President Biden to act before these policies become even more entrenched.**\n\n[Use this tool to urge President Biden and Congress to Send humanitarian aid to Cuba and End restrictive sanctions](https://actionnetwork.org/letters/sendandend?source=reddit). Together, we can support the Cuban people in rebuilding and strengthening their future.\n\nTake Action:\n\n* [Send a Letter](https://actionnetwork.org/letters/sendandend?source=reddit): Use our tool to write to President Biden, VP Harris, and Congress.\n* Share on Social Media: Amplify this campaign with our [Social Media Toolkit](https://docs.google.com/document/d/e/2PACX-1vSCJTwGWQFadv7hngYIcQSv77GBYXHjvBItfVT7M2fYQmwPR6QkVmurBOxzZ50-Cfqz24vlZc0pdZFa/pub) for sample posts and graphics.\n* Get Involved: [Join DSA’s Cuba Solidarity campaign](https://actionnetwork.org/campaigns/dsa-for-cuba?source=sendandend)",
    "comments": [
        {
            "author": "AmazingRandini",
            "body": "The US has had sanctions on Cuba since the 60's. Every President has been part of it. Including Biden.\n\nCalling it \"Trump's war on Cuba\" is disingenuous.\n\nBiden increased sanctions in 2021 and said \"There will be more, unless there's some drastic change in Cuba, which I don't anticipate,\" Biden said during a meeting with Cuban-American leaders at the White House.",
            "score": 15,
            "replies": [
                {
                    "author": "marxistghostboi",
                    "body": "yeah Biden had continued Trump's policies of reversing the moderate gains made by the Obama administration. Biden has been one of the more anti-Cuban presidents, especially compared to Obama\n\n(not that Obama was all that great, but he at least loosened things re Cuba slightly)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "redditisnosey",
            "body": "Personally I advocate for an invasion of  Cuba.  I would like to see thousands and thousands of young Americans invade Cuba for Spring Break enhancing cultural exchange and infusing some cash, but that is a pipe dream.",
            "score": 1,
            "replies": []
        }
    ]
}