{
    "title": "Taxing the Rich",
    "author": "Many_Replacement_688",
    "subreddit": "Marxism",
    "rank": 272,
    "score": 32,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/Marxism/comments/1gut64x/taxing_the_rich/",
    "id": "1gut64x",
    "selftext": "I'm currently studying historical laws where ideas of marxism actually passed as a form of reform. I just learned that in the 30's, the US had a leftist party in Congress that was successful in passing the minimum wage law. This is a contradiction of the capital needs, which is to lower wages to achieve surplus labor. Having said that, in the present day, if we were to organize a political labor party and one of the ideas is to propose a bill that will tax the rich, what are your ideas for this bill that will actually pass Congress?",
    "comments": [
        {
            "author": "Hopeful_Vervain",
            "body": "Minimum wage laws indirectly contribute to capital needs though. The bourgeoisie doesn't want the proletariat to have a revolution, they need to make some concessions and pacify them, but those still technically increase the economic instabilities. Minimum wage laws cause industries to move production to less developed countries, and even if you manage to keep the employment rate the same, it still weakens the domestic petite bourgeoisie, which technically means more proletariat in the long run.\n\nNo political labour party will be able to achieve socialism through reforms like taxing the rich, they'd end up having to compromise with the bourgeois state and electoral system, rich people won't let you do anything substantial through the structures that were created to benefit them, so you'll just end up with some sort of class collaboration project.",
            "score": 48,
            "replies": [
                {
                    "author": "Bolshivik90",
                    "body": "This.\n\nWasn't it Chris Rock who said something like \"minimum wage just means that if your boss could pay you less, they would. But they're not allowed to.\"\n\nNow Rock isn't a Marxist as far as I know, but he had a far more marxian insight into labour-capital relations with this observation than most so-called social democrats.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bolshivik90",
            "body": "Marxists can support reforms which benefit the working class but we must also point out that nevertheless, no reform is guaranteed under bourgeois law. They might give the workers one reform one day and take it away the next. Marxists therefore need an independent class position.\n\nTo me, it is weak and pathetic grovelling as marxists to ask the rich to simply pay their taxes. As marxists, as *revolutionaries*, we should say \"No, don't tax the rich. Expropriate the rich. Nationalise their companies and capital *without compensation* (i.e., seize their assets, don't buy them off of them) and place them under democratic workers control.\"\n\n\"Tax the rich\" is for closet pro-capitalists like AOC.\n\nAs Marxists we may support it as a means to raise class consciousness, but we should never think that is the end goal and that taxing the rich will fundamentally change anything. It won't. They will just find ways to dodge the tax anyway with loopholes.\n\nThey deserve nothing less than their complete ruination and expropriation of their wealth. Not a pathetic \"tax\".",
            "score": 28,
            "replies": [
                {
                    "author": "marxistghostboi",
                    "body": ">\"Tax the rich\" is for closet pro-capitalists like AOC.\n\n\n\n\n>They deserve nothing less than their complete ruination and expropriation of their wealth. Not a pathetic \"tax\".\n\n\nexactly. a progressive reformer says Tax the Rich, we say, Abolish the Rich",
                    "score": 14,
                    "replies": [
                        {
                            "author": "radd_racer",
                            "body": "“Hey, why do we need this asshole at the top that does nothing but barks orders at us and skims the surplus value of our labor, yet doesn’t know how to operate this machine?”",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Anxious-Tadpole-2745",
                    "body": "Taxing the rich is like saying we need to fight obesity, not with a healthy diet and exercise, but a temporary diet so we can go back to eating a 2 full pizzas every dinner.\n\n\nWe are eating 2 full pizzas and it's making us sick and high taxes is saying we need another yo yo diet. \n\n\nNo, we need to cure the capital disease which ails us.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "radd_racer",
            "body": "All of these stopgaps created by neoliberals (both Conservatives and Liberal Democrats alike) just increase economic instability, including outsourcing of jobs overseas, where the USA just exploits cheaper labor. The USA has been effectively been de-industrialized via this process, and we’re in a real bad position now when it comes to competing with other nations. China is one nation in a good position to overtake us and bend us to their will. We’re also going to have a crisis of unemployment, as what gets left on the table is a glut of low-wage jobs in the service industry no one is willing to do for a low wage. Even those jobs will be eventually eliminated in favor of more profitable AI and machine implementations.\n\nNo true lasting reform can take place, until the proletariat takes control of the means of production and the government.",
            "score": 5,
            "replies": []
        },
        {
            "author": "adjective_noun_umber",
            "body": "Min wage is both a tool of the bourgeosie, at this point. Its also progressive ostenisbly\n\n\n\n\n Most workers argree that min wage needs to be pegged to cpi to adjust for constant inflation, otherwise min wage is already a nonstarter. \n\n\nIts a safety net to minimize exploitation, while contradictory, is also a tool used to keep pay low.",
            "score": 4,
            "replies": []
        },
        {
            "author": "EmuPsychological4222",
            "body": "If the USA continues on present course, our minimum wage statutes will not last long. Remember that they were considered unconstitutional when they first came out and only were considered constitutional in the early days of the Great Depression. The current court is unlikely to subscribe to that reasoning.\n\nAnd that's if it survives legislatively.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jezzetariat",
            "body": "Capitalism is rife with contradictions. One of which is regulation.\n\nWhat may be a small price to pay for big businesses is a ceiling on the ability of new petit-bourgeoisie start ups. Anti discrimination law, whilst good for workers, is also good for bourgeoisie who can easily afford ways around it, such as hiring from further afield and assisting people to move, less so for lesser bourgeoisie and petit-bourgeoisie.",
            "score": 3,
            "replies": []
        },
        {
            "author": "OrcOfDoom",
            "body": "When a loan is taken out on stock then it is a form of a realized gain and subject to capital gains taxes.  This isn't the same as loans taken on assets.\n\nInstitute some kind of Georgist land value tax.  It increases as the size of the land that you own increases.  Institute the same thing with total properties.\n\nI would also want to adjust patent law.  Move it back to 20 years from 95, but also add a caveat for maximum wealth generated from said patent.  If you make 200 million from the patent you can start working on new things.  You've extracted enough wealth.  That's public domain now.\n\nThis would ruin the process of selling of a patent.  If it sells for 200 million, that's the end of the patent. Public domain now.",
            "score": 2,
            "replies": [
                {
                    "author": "Many_Replacement_688",
                    "body": "These are excellent ideas. Here are some of mine. They are still wip, and are open to suggestions. These are mostly the means of production of big tech.\n\nLimit electricity input, These big-tech have server farms. This will limit their capacity to produce compute-cost to use-value data commodities.\n\nMake licensing cost per seat illegal. If the product is just a digital copy, it must be sold only at the cost of maintenance labor and other commodity value. Make tech more affordable so more people will have access to technology\n\nDistribution is like infrastructure, which should be owned by the proletariat. Banning big-tech software marketplaces like the App Store will allow direct-to-consumer distributions.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "OrcOfDoom",
                            "body": "I have an idea that is weird, and probably pro capitalist, and kinda a long shot.\n\nBasically, if a company or business is too big to fail, one of 3 things needs to happen - the business becomes community owned, the state starts a competing business, or enough competitors must exist in the market. \n\nBasically, I want to expand antitrust laws to be much more aggressive.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PerspectiveSouth4124",
            "body": "How should I respond to people that say it's more of a State spending problem?\n\nThey quote the fact that in fiscal year 2023, the United States federal government spent approximately $6.134 trillion, which equated to 22.8% of the nation's Gross Domestic Product (GDP).\n\nThey point out that since November 2024, the United States is home to approximately 809 billionaires, collectively holding a net worth of around $6.43 trillion.\n\nThey  say that if we confiscated the entire net worth of every billionaire in the United States it would barely sustain U.S. spending for a single year.\n\nHow should we respond?",
            "score": 2,
            "replies": []
        },
        {
            "author": "DustSea3983",
            "body": "For “tax the rich” to mean anything substantial, government spending structures would need to change first. Without a significant shift in how wealth is redistributed and public resources are allocated, taxing the rich risks becoming little more than a transfer of power to the liberal core of elites. The funds generated from higher taxes, rather than addressing systemic inequality or empowering marginalized communities, could easily be funneled into existing priorities like corporate subsidies, military expansion, or inefficient bureaucratic programs. This would only reinforce elite control rather than challenge the broader dynamics of wealth and power. Without structural reforms, such as redirecting spending toward universal public goods, curbing corporate influence, and ensuring participatory decision-making, “tax the rich” remains susceptible to co-option by neoliberal politicians. These actors often use progressive slogans to rebrand themselves while perpetuating the same systemic inequities. Unless paired with transformative economic changes, taxing the rich risks becoming performative, placating calls for justice while maintaining the underlying structures of inequality.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shankiz",
            "body": "IMO the most effective way to tax the rich is through estate/inheritance taxes. When the rich die, their children have to list their entire inheritance as taxable income. Honestly this isn’t even a Marxist idea, it’s just income tax.\n\nThe problem is that the ultra-rich have found ways of utilizing shell companies and trusts, which claim to be international/foreign institutions, to hide the actual ownership of their wealth. Thus, when wealth transfers to the younger generation it is not appropriately taxed. Actions need to be taken to make the rich people actually pay the taxes our system says they are supposed to. You don’t really need Marxism at all for this.\n\nSome efforts have been taken to pursue this undertaking already, such as legally requiring all trusts and corporations to name their “ultimate beneficiaries” - the individuals at the end of the stream who their money goes to.\n\nThere has also been some success in restructuring tax law to require taxes be paid based off of the physical location of the underlying assets, or the physical location of where the economic activities took place. This prevents corporations from claiming they are based in a tax haven country when all their business is done in the United States. It also prevents rich people from pretending to be citizens of the Cayman Islands when literally all of their wealth comes from U.S. or European assets.\n\nAgain, you don’t really even need Marxism at all for these policies. IMO with how anti-Marx modern politics is, it would be better to avoid using Marxist rhetoric or philosophy when trying to push these ideas. They’re just good ideas, regardless of which underlying philosophy you use to generate them. Rich people are simply cheating on their taxes, and it needs to be stopped.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Right-Week1745",
            "body": "Maybe we should instead take a look at how people get obscenely rich. If a person has more money than they could have earned through working every living moment of multiple human lifespans while $100/hour, then their wealth is probably not the result of hard work. They made that money by stealing the value that other people’s labor generated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "The rich will never allow their profits- or their profit streams- to be voted out of existence. Even if there were a sizable Left (a real Left, not the right-wing golem that passes for the Left today) it would have to be strong enough by itself to push through such a bill because everyone else in the room is going to oppose it tooth and nail. The way business is done these days, it might be possible to do such a thing, but you can bet your last rupee the moneyed class will have politicians bought and paid for who will find other ways to protect their interests. \n\nThe only way I see it happening is to be so strong you cannot be ignored, and so intimidating no one wants to test you. That's a nice house, Senator- it would be a shame if something were to happen to it.",
            "score": 1,
            "replies": []
        }
    ]
}