{
    "title": "Pre-history \n",
    "author": "vajrabear",
    "subreddit": "Marxism",
    "rank": 269,
    "score": 6,
    "upvote_ratio": 0.66,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Marxism/comments/1gwjp3m/prehistory/",
    "id": "1gwjp3m",
    "selftext": "I have a vague memory of Marxists from the early part of the 20th century using rhetoric about capitalism being part of a pre-history, and history int the sense of collectively willed striving for human flourishing only becoming possible after the revolution. Does this ring any bells with anyone? Looking for a citation.",
    "comments": [
        {
            "author": "HydrogeN3",
            "body": "Marx says as much in the often-quoted [intro to ‘Contribution to the Critique of Political Economy”](https://www.marxists.org/archive/marx/works/1859/critique-pol-economy/preface.htm) \n\nHere’s Marx: \n\n> The bourgeois mode of production is the last antagonistic form of the social process of production – antagonistic not in the sense of individual antagonism but of an antagonism that emanates from the individuals’ social conditions of existence – but the productive forces developing within bourgeois society create also the material conditions for a solution of this antagonism. The prehistory [Vorgeschichte] of human society accordingly closes with this social formation.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Bolshivik90",
            "body": "Trotsky.\n\nIn *Literature and Revolution* (1924), he writes a whole chapter about what communist society might look like and leans heavily on the idea that *true* human history will begin when classes and states have all been abolished and humanity flourishes under a communist world society.\n\n>It is difficult to predict the extent of self-government which the man of the future may reach or the heights to which he may carry his technique. Social construction and psycho-physical self-education will become two aspects of one and the same process. All the arts – literature, drama, painting, music and architecture will lend this process beautiful form. More correctly, the shell in which the cultural construction and self-education of Communist man will be enclosed, will develop all the vital elements of contemporary art to the highest point. Man will become immeasurably stronger, wiser and subtler; his body will become more harmonized, his movements more rhythmic, his voice more musical. The forms of life will become dynamically dramatic. The average human type will rise to the heights of an Aristotle, a Goethe, or a Marx. And above this ridge new peaks will rise.",
            "score": 6,
            "replies": [
                {
                    "author": "elvis_poop_explosion",
                    "body": "Is this all he said about how art would change? Not sure if I believe him entirely because suffering makes art or whatever, + financial incentive (even though it’s definitely proven that art production spikes during times of peace/prosperity)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bolshivik90",
                            "body": "No it's not all he wrote. Like I said there's an entire book. That's just one paragraph.\n\nAlso not sure what you mean that suffering and financial incentive are the only drivers of art?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}