{
    "title": "Dialectics of other facets of nature",
    "author": "jezzetariat",
    "subreddit": "Marxism",
    "rank": 262,
    "score": 4,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Marxism/comments/1gzeiun/dialectics_of_other_facets_of_nature/",
    "id": "1gzeiun",
    "selftext": "What value may there be in addressing aspects of nature not addressed by Engels in a dialectical and materialist manner? I know a lot of people see metaphysical philosophy as fruitless navel gazing, but why wouldn't a Marxist analysis of say, the passage of time, not enrich our understanding of the world around us? This particular point (time) is something I've been working on a short while now. Firstly, how it can be understood in a materialist perspective before how it can be understood dialectically.\n\nI know some will criticise such attempts of philosophy for Marxists. Personally, I see no problem with philosophy for its own sake, to say \"it doesn't change worker's conditions\" is firstly short sighted (how can we know what future physics will do for reduction of labour when studied through a different, more productive philosophical lens?) and secondly smacks of the very classism that meant labourers could only labour and not think, that thinking was not for them.",
    "comments": [
        {
            "author": "Canchito",
            "body": "Marxist philosophy is explicitly anti-metaphysical. This is also the whole point of Engel's book.\n\nPhilosophy is nothing but the most abstract and generalized conclusions drawn from the development of history and science. Philosophy is reduced to the history of philosophy, and inseparable from the concrete development of natural and social sciences. \n\nIf you want to know about the Marxist take on time, ask any decent physicist. That's not to say that there aren't constantly new philosophical questions brought up by the progress of science, but a Marxist would have to be very familiar with the actual science to answer them.",
            "score": 1,
            "replies": [
                {
                    "author": "jezzetariat",
                    "body": "What does it mean to \"anti-metaphysical\"?\n\n>Ask any decent physicist \n\nBeing a decent physicist doesn't provide an answer on this subject. Someone can be a good scientist whilst still using idealist philosophy to interpret the rest of the world they don't understand. If not, the question then is \"what makes a decent physicist\"?\n\nI also disagree that a Marxist would have to be very familiar with \"the actual science\", when there is no science that currently explains what time actually is.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Canchito",
                            "body": "As a true metaphysician you have displaced the question from one relating to the concrete movement and forms of matter, i.e. time, to one of an abstract category living inside your head.\n\nMetaphysics is the Greek derived word for \"outside of physics\". Materialists assert there is nothing outside of physics in the broadest sense of the word: matter and its evolution.\n\nYour point about physicists not knowing everything \"or the rest of world\" is irrelevant. The question was not about everything, but a concrete question relating to physics.\n\nThis means that although most scientists aren't conscious of it, to the extent that they follow the scientific method, and that their results reflect objective reality, they are practicing dialectical materialists. This is true, even if for everything else they do, they may be complete idealists.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jezzetariat",
                                    "body": "It has nothing to do with \"living inside [my] head\"\n\nMy very point is whether or not we can explain this concept on a material basis, so no, I am not a metaphysician and you appear to have misunderstood my question. I am not saying can Marxism be metaphysical, I'm asking if anyone attempts to answer questions usually left to metaphysics, which they needn't be, since they're questions about the material universe and therefore are not beyond the grasp of dialectical materialism.\n\nI would also disagree they are practicing dialectical materialism, which is why many theories become popular that end up endorsing nonsense like simulation theories. To suggest a real physicist is a dialectical materialist is a no true Scotsman fallacy, bourgeois philosophy may be bankrupt and leads people down wrong paths, but it's still philosophy. Marx said so himself, that the ruling ideas are the ideas of the ruling class, they're still ideas, even if they're reactionary. Equally, holding reactionary ideas doesn't stop them being scientists, it just leads them to misinterpret information.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Canchito",
                                            "body": "Your initial question (before you edited it) asked why we shouldn't do metaphysics. That's what I responded to. You may think this was just an unfortunate choice of words, but whether or not you used that word, I think I still would've wanted to introduce this discussion with an emphasis on that point.\n\nSo you ask what's wrong with approaching (natural) scientific questions through the lens of dialectical materialism, as Engels did. There's nothing wrong with that. To the contrary, it's necessary to the extent that it's possible.\n\nBut the philosophical conclusions flow from the science, and not vice versa. You can't impose a philosophy on scientists, and this is partly why dialectical materialism is radically opposed to all previous philosophy. It's the philosophy of science in the most literal sense.\n\nOnly a dialectical materialist, familiar with the history of philosophy within the framework of historical materialism, is able to truly appreciate the deep philosophical and historical significance of developments in science. But to do that, he or she also has to understand that science. This is not optional.\n\nLenin loved to repeat Hegel's saying that there's no such thing as abstract truth. Truth is always concrete.\n\nWhat does that mean in relation to your point about scientists holding reactionary ideas, still being scientists, and not practicing dialectical materialists?\n\nTo be a dialectical materialist is obviously a product of a conscious study in the history of ideas and science. But I didn't mean to say scientists are automatically conscious dialectical materialists. I said they are *practicing* dialectical materialists.\n\nWhat I meant to illustrate with this is that, to the extent that they work within the practical framework of constantly refining our theories for the objective reality they are meant to explain, they are doing nothing else for the natural world than what Marxist revolutionaries are doing for the social and political world.\n\nThe difference between them doesn't lie in their fundamental approach to reality within their particular field of activity (although it obviously takes very different forms), but flows from the differences in their respective fields. Physics for one, society and politics for the other.\n\nThe latter contains a conscious component, the former does not. What really distinguishes a Marxist from a capable natural scientist who may hold reactionary ideas, is that the Marxist has not just a scientific/materialist approach to unconscious phenomena of nature, but also to conscious (to different degrees) phenomena of society.\n\nWhen scientists let their ideological prejudices cloud their work or conclusions they may draw from it, they are deviating from the scientific method, and their results will not become part of the accumulated body of science in the long run. For example, Newton's alchemy and deism are not part of physics. Mach's and Einstein's idealism is not part of physics. etc.\n\nThis leads me to the last point that needs clarification. Marxism is not an ideology or philosophy (at least not merely a philosophy in the traditional sense of that word). Marxism is a science. It is the reflection in the brain of the laws of society, the same way that physics is the reflection in the brain of lawful processes of nature.\n\nIdeology is not the same. Ideology is an inverted or false perception of reality. Yes, Marxists in the past loosely used that word to mean world outlook, or synonymosly with holding socialist beliefs. But if we're going to be philosophically precise, we should make that distinction.\n\nTo conclude, I actually think there's something very healthy about the last remarks in your post. Yes, philosophical questions are important for the working class, but philosophy and science more broadly is instrumental to the working class, in a way in which it isn't anymore for the bourgeoisie.\n\nThis leads many people to the conclusion that philosophy should be practiced for its own sake, as a reaction against the vandals of the bourgeoisie who claim philosophy is useless.\n\nThe real question philosophers should ask is why and how is philosophy useful to the working class, and how can someone knowledgeable about philosophy contribute to the education of the working class in dialectical materialism, foster its independent world outlook, and help build its revolutionary party.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ListenMinute",
                                    "body": "You're bastardizing the term Metaphysics.\n\nIt means so much more than you're alluding to here.\n\n[https://plato.stanford.edu/entries/metaphysics/#SociMeta](https://plato.stanford.edu/entries/metaphysics/#SociMeta)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Canchito",
                                            "body": "Yes, metaphysics always claims there's so much more outside the objective movement of matter, yet they always fail to demonstrate this in practice, outside of elaborate, contorted, and mystical arguments they spin out of their confused minds.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ListenMinute",
                            "body": "He's bullshitting of course Marxism makes metaphysical claims.\n\nThe contradiction between bourgeoisie and proletariat isn't an ontological or ethical claim. It's metaphysical.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ListenMinute",
            "body": "There is precisely a work of philosophy on the very subject you raise here.\n\nHenri Lefebvre wrote A Critique of Everyday Life and I think that'll satisfy some of what you seek.\n\n[https://annas-archive.org/md5/3ac11f4e03b1cd04449c72998803237f](https://annas-archive.org/md5/3ac11f4e03b1cd04449c72998803237f)",
            "score": 1,
            "replies": []
        }
    ]
}