{
    "title": "What role or importance (if any) did Marx believe ideas have in driving society/culture/history?",
    "author": "zampano32",
    "subreddit": "Marxism",
    "rank": 239,
    "score": 12,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Marxism/comments/1h7k59j/what_role_or_importance_if_any_did_marx_believe/",
    "id": "1h7k59j",
    "selftext": "I was having a discussion with a Marxist friend. This friend told me ideas are irrelevant/unimportant and don’t really have a major effect on society or history. Everything has a material basis or cause like economic situations/ class struggles etc. including our personal beliefs. Essentially he was describing to me Marx’s dialectical materialism concept. \n\nI’ve since been doing research on this and I’ve seen many people say that Marx did indeed think ideas are important and impacted our world. But obviously he said ideas are influenced and created by the material conditions. \n\nSo I guess my question is what did Marx think the role of ideas are. Did he believe ideas could  change the world or influence people. Did he think writings or books or art or music could change the world in any significant way and inspire action. Did Marx think his writings and new way of looking at society could help spur the revolution. He wrote a lot about where our ideas and art come from which I agree with. But I’m interested in what he thought art or ideas actually do in the world. Do they change or affect society in any significant way. Or are they just a reflection of society. Thank you",
    "comments": [
        {
            "author": "DialecticalEcologist",
            "body": "Being a materialist does not mean you believe ideas are unimportant. It means you believe consciousness is shaped by material conditions.\n\nMarx discovered the laws governing historical development by giving Hegel’s dialectics a materialist orientation. But part of the Marxist project is raising the consciousness of the working class—revealing to the masses the material basis of social relations and showing them a way forward. You have to *learn* about this in order for it to be emancipatory. But then you must *act* or it’s for nothing.\n\nSo ideas are very important but they’re not the driving force of history. The character of any society is determined by its mode production. The realm of ideas develops out of this context.",
            "score": 30,
            "replies": []
        },
        {
            "author": "Counter-psych",
            "body": "Ideas can be incredibly important depending on the context. From Engels:\n\n“According to the materialist conception of history, the ultimately determining element in history is the production and reproduction of real life. Other than this neither Marx nor I have ever asserted. Hence if somebody twists this into saying that the economic element is the only determining one, he transforms that proposition into a meaningless, abstract, senseless phrase. The economic situation is the basis, but the various elements of the superstructure — political forms of the class struggle and its results, to wit: constitutions established by the victorious class after a successful battle, etc., juridical forms, and even the reflexes of all these actual struggles in the brains of the participants, political, juristic, philosophical theories, religious views and their further development into systems of dogmas — also exercise their influence upon the course of the historical struggles and in many cases preponderate in determining their form.”\n\n[read the full text for an answer](https://www.marxists.org/archive/marx/works/1890/letters/90_09_21.htm)",
            "score": 11,
            "replies": []
        },
        {
            "author": "RNagant",
            "body": "Your friend has a vulgar (mis)understanding of Marx if you've described their argument accurately.\n\nLike, youre right, Marx said ideas are very important! Specifically he said that \"theory becomes a material force as soon as it has gripped the masses\" -- i.e. ideas become significant when they influence behavior! Now, those ideas have to adequately correspond to reality, and will only arise, in the first place, in ones mind in a set of material conditions (rather than spontaneous generation in the mind of a great man), and will only be accepted by the masses, again, if conditions permit it so.\n\nAnother way to put it is that there are both objective and subjective conditions. Some objective conditions of revolution would be the development of industry and its complete victory over handicrafts, the conversion of the peasantry into proletarians necessitated thereby, their centralization in urban centers, etc. And it is only once the proletariat is a large, centralized class that it is able to organize itself into trades and unions and eventually into a political party -- only then does it become capable of class consciousness. But history is not an automatic process, it is carried out by people, and if they are not class conscious they may never go beyond fighting for reforms and concessions, or even if they are class conscious, they may make strategic and tactical errors. These are subjective factors: how conscious and organized is the working class? how willing is it to risk war and conflict at that moment?\n\n  \nDoes that answer the question?",
            "score": 4,
            "replies": [
                {
                    "author": "zampano32",
                    "body": "Yes it does. Thanks a lot. My friend eventually backtracked from the “ideas are irrelevant” statement. And stated that they don’t have the significance I presumed they have. Which i now agree with.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prestigious_Share103",
            "body": "There are 3 main explanation of history that I’m aware of. Great man theory, which says that historical change occurs via the actions of great and charismatic people. Then there’s emergent history, where the many small actions of the masses amount to great sweeps of change. Then there’s Marx, who believed that historical change is caused by material interactions between different productive classes of people in relations that cause the structures of society and thereby history. \n\nSo ideas are just one of the ingredients that goes into these different understandings of history. They can animate great men. They can cause everyday people to do things differently. And they change the relations of production. But in all three of these, ideas are relevant but not really the most powerful thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ListenMinute",
            "body": "Marx clearly believed in the power of ideas because he puts ideas to work in his work.\n\nThe idea use value vs exchange value. Surplus value. The Commodity fetish. Etc.\n\nAnd these ideas do indeed affect society significantly.\n\nAs we've seen historically what Marxism brought forth internationally in the 20th century.\n\nMarx studied Shakespeare and wrote poetry among other things.\n\n“A spider conducts operations that resemble those of a weaver, and a bee puts to shame many an architect in the construction of her cells. But what distinguishes the worst architect from the best of bees is this, that the architect raises his structure in imagination before he erects it in reality.” \n\n\\- Chapter 7 Capital",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tune-Senior",
            "body": "No it is not that only material moves history, but both material and ideas interplay in a back and forth movement.  Material being the primary shapes ideas, which then in turn shapes the material",
            "score": 1,
            "replies": []
        },
        {
            "author": "prodigalsoutherner",
            "body": "I could be completely wrong, but from my interpretation of what I have read, Marx was arguing against the idea that history is driven by the ideas of exceptional people shaping society with their brilliance.  Ideas don't appear from the vacuum of space, they arise from people responding to environmental pressures. If you are American and your high school history classes were anything like mine, we were kind of fed this lie about our \"founding fathers\" being somewhat flawed but fundamentally good men who wanted to throw off the tyranny of the British monarchy, when in reality they were more like 18th century analogues of Elon Musk / Jeff Bezos who really just wanted to keep more of their stolen wealth and ignore the treaties with Indigenous people that promised no more western expansion. There were ideas driving everything, but those ideas were a function of the material conditions that existed at the time..",
            "score": 1,
            "replies": []
        }
    ]
}