{
    "title": "Is Exchange Value Solely An Expression Of Value?",
    "author": "Night_Sky_Films",
    "subreddit": "Marxism",
    "rank": 226,
    "score": 10,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Marxism/comments/1hdiav9/is_exchange_value_solely_an_expression_of_value/",
    "id": "1hdiav9",
    "selftext": "Hello\n\nI'm sure you're all sick of questions relating to chapter 1 of Capital but I have a question that has been mostly answered via the search function with one detail I'm still not 100% on.\n\nIs exchange value solely an expression of value in the form of other commodoties or does exchange value take market forces into account (i.e. supply and demand)? I can hear you groaning, I know, I'm sorry. But I'm still just not 100% sure whether market forces become a factor only when we start talking about market value/price.\n\nThank you.",
    "comments": [
        {
            "author": "themillenialpleb",
            "body": "Kliman on Marx's Value Theory:\n\n> Marx distinguishes between price and value in two different ways. The two distinctions have nothing to do with one another, so it is important not to confuse or conflate them. One reason why his value theory is alleged to be internally inconsistent is precisely that prominent critics have indeed confused and conflated the two distinctions.\n\n> One distinction is between two ways of measuring value. Marx (1990a: 188) holds that value has two measures, money and labor-time. He generally measures commodities' values in terms of money, but he sometimes measures them in terms of labor-time, and occasionally he compares the two (see, e.g., Marx 1991a: 266). When measuring a commodity's value in money terms, he often calls it simply the \"value,\" while at other times he calls it the \"monetary expression of value\" or, equivalently, the price. \"Price, taken by itself, is only the monetary expression of value\" (Marx 1971: 35, emphasis omitted; cf. Marx 1990b: 1068). In this sense, then, \"price\" refers to value measured in terms of money rather than in terms of labor-time.\n\n> The other distinction between \"value\" and \"price\" is quantitative. In this context, if we are speaking of a firm's or industry's output, \"value\" refers to the sum of value produced within a firm or industry-the value transferred plus the new value added-while \"price\" refers to the sum of value received by the firm or industry. Similarly, if we are speaking of a single commodity, \"value\" refers to the commodity's actual value, determined by the labor-time needed to pro- duce it, while \"price\" refers to the sum of money that the commodity's owner can receive in exchange for it.\n\n> Note that we can meaningfully discuss these quantitative differences only if we are measuring price and value in the same units. It makes no sense, for example, to say that the $5400 a firm receives for its output is greater or less than the 100 hours of labor needed to produce that output. This shows that the two value-price distinctions are indeed wholly independent of one another.",
            "score": 4,
            "replies": []
        },
        {
            "author": "C_Plot",
            "body": "TL;DR: market forces do change exchange-value magnitudes (but market forces only change the value magnitude indirectly as those market forces alter the production conditions). \n\nIn an exchange, two commodities confront each other. Each commodity bears congealed SNLT as value. Let’s say commodity A bears $10 in SNLT and commodity B bears $20 in SNLT (dollars here as the monetary expression of labor time a.k.a. MELT). \n\nIf you sell a specimen of the commodity A species in exchange for commodity B specimen—in barter, then the value of commodity A is $10 and its exchange-value is $20 (in the vector of all commodities, a suitable quantity of each of those commodities can be deliberately made to equal $20 so that the exchange-value due to the material market conditions is expressed in any bartered commodity. If instead of barter, you sell commodity A in exchange for the money commodity (dollars in this example), then you sell commodity A for $20. The exchange-value in the money commodity Marx call price. \n\nThe magnitude of value for commodity A nevertheless remains $10. Only a change in the conditions of producing commodity A, in the latest batch turnover producing commodity A can change the value of commodity A by taking the mean average, writing the value of all of the specimens of commodity A already in circulation—cradle to grave, as in production to consumption—against the weighted congealed SNLT of commodity A from this new batch. The different prices paid for commodity A, as it goes from cradle to grave, do not change the value of commodity A. A merchant pays $11 for commodity A, then a speculator pays $14, the next speculator  $12 (as commodity A moves from one winds cellar warehouse to another). Then an arbitrage agent, buys commodity A for $15, complements commodity A with a transport commodity moving commodity A to a distant market, where through arbitrage someone pays $20 for commodity A. All through this process of circulation, the value of commodity A—its congealed SNLT—remains $10. This is Marx’s “law of value” which is Marx’s _conservation principle_, much like the conservation of motion for Newton, or the conservation of energy and matter together for Einstein. \n\nIf instead of $20, you sell commodity A for $10 in money, you have sold commodity A at what Marx calls its value-price. In the whirlwind of circulation value is flowing in two directions: to buyer and away from seller as well as to seller and away from buyer. However only in very peculiar circumstances does the value paid for a commodity equal the value borne by the same commodity. \n\nWhatever value is paid for a commodity—the value that the commodity commands in circulation—that different magnitude does nothing to change the value borne by the commodity. When you drink that bottle of wine (if that is what commodity A indeed is), you consume $10 of SNLT even if you paid $20 in SNLT to get the $10 in SNLT. You surrendered $20 in value as the use-value of the money commodity because you really wanted to drink some choice wine, though that wine bore only $10 in SNLT. \n\nWhen we look at the surplus, circulation does not change the magnitude of value of any species of commodity. The surplus is a performance of surplus labor, congealed in surplus commodities, those commodities bear a given value magnitude (given in production), that is therefore surplus value (the value of the surplus commodities), which commodities then go to the consumption fund of those other than the productive workers (productive worked who in the aggregate first perform necessary labor to produce necessary commodities for their own household consumption). In the circulation whirlwind, these surplus commodities (bearing congealed SNLT surplus labor as surplus value, conserved while circulating) go to:\n\n* the household consumption of unproductive workers\n* the household consumption of landlords, shareholders, financiers, speculators, and various other subsumed capitalists who provide the conditions of existence for the exploiting capitalist to continue their exploitation—solely in exchange for their cut of the surplus labor\n* the instruments of labor and raw materials consumed in unproductive labor processes, such as the cash register of the unproductive merchant laborer (such unproductive capital is different than productive capital in that its value is entirely consumed and destroyed in the unproductive labor process, in contrast to the productive labor process, where the value is not consumed but rather transferred to the newly produced commodity, as constant capital, in a process Marx calls “productive consumption”). \n\nI hope that clears it up and doesn’t merely raise new confusions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proletaricato",
            "body": "Yes, exchange value is solely an expression of value.\n\nMarx regards exchange-value as **the proportion in which one commodity is exchanged for other commodities**. For Marx, exchange-value is not identical to the money price of a commodity; it spans way beyond it.",
            "score": 1,
            "replies": []
        }
    ]
}