{
    "title": "Economic growth = capital accumulation?",
    "author": "ThatGarenJungleOG",
    "subreddit": "Marxism",
    "rank": 217,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Marxism/comments/1hgq8ce/economic_growth_capital_accumulation/",
    "id": "1hgq8ce",
    "selftext": "Hello, I have become very interested in degrowth, and have seen numerous scholars from that field equate economic growth to capital accumulation, albeit without in my searching, an exposition on the reasoning behind this, even economists i greatly admire (heterodox of course) such as Clive Spash, Jason Hickel and to some extent x Kallis and Parrique i believe has also equated them. \n\n  \nDo you agree or disagree? I'm aware it's certainly a \"matter of definitions\" at one level (thanks neoclassical economics trying to obfuscate everything with your own crap definitions of things (in this case \"capital\" to them a shorthand for a \"factor of production\" - which in turn they try to make everything into; most annoyingly nature). So it's been a bit of a difficult question to try to research via google as neoclassical definitions swarm any other. \n\nWould greatly appreciate an explanation and further reading if possible, thanks. (For context, i may be unfamiliar with some marxian definitions and that sort of thing, I have mostly read about him second hand, and have not read capital, so more basic texts also welcome, though oversimplification is not necessary.)",
    "comments": [
        {
            "author": "C_Plot",
            "body": "I’m having a hard time conceiving of economic growth without capital accumulation: at least within the capitalist mode of production and distribution. In other modes, I would think it would still typically involve increased means of production (instruments of labor and raw materials, including natural resources raw materials). Hard to imagine growth in consumption without growth in the means of producing for consumption, other than greater efficiency, greater durability, and  greater conservation in the use of means of production (which efficiency enhancements has its limits).\n\nUnsurprisingly, Marx mostly deals with capital and the capitalist mode of production (seldom dealing with means of production that do not take the form of capital). For capital specific means of production, you might look to [_Capital_v1, part 7 (ch. 23 – 25)](https://www.marxists.org/archive/marx/works/1867-c1/ch23.htm) and [_Capital_ v2 ch21](https://www.marxists.org/archive/marx/works/1867-c1/untermann/volume-2.pdf). \n\nIf you’re interested in degrowth, what’s your concern with a reduction in capital accumulation?\n\nThere is also the issue of unproductive capital and unproductive labor. With capitalism, such unproductive processes increase, especially as exchange-value-seeking (rent-seeking, and so forth) rises precipitously. More and more of the surplus labor and surplus resources of society get devoted to swindling, plundering, and defrauding an other productive segment of society (surveillance capital analytics, anti-civic lobbying and legalized bribery, patent trolling, tortious pursuits and false tort suits, and so forth). If we could find a way to eliminate all of these activities, we would still consume the same level without wasting so much and also without suffering the further collateral damage of these inherently anti-social pursuits.",
            "score": 3,
            "replies": [
                {
                    "author": "ThatGarenJungleOG",
                    "body": "Thanks for the reply! \n\nMe also, bar a few, irregular instances.\n\nFirstly, government deficits i believe would count as gdp, and contribute to the m-c-m’ cycle (which, i believe would be capital accumulation?), but might not be perfectly in sync with it (quantitative easing for example, it largely did not enter into or arrive in industrial capital or workers pockets).\n\nTheres also inflationary episodes where perhaps real gdp could fall while nominal accumulation happened. But these seem marginal.\n\nI should clarify that economic growth is to be understood as gdp within the degrowth literature, so, i suppose the question isn’t targetting a historical perspective, we are looking at “economic growth tm”- gdp. Rather than substantive measures.\n\nI have no concern with a reduction in capital accumulation, it will happen voluntarily or involuntarily, voluntarily being the good option. Degrowth is about finding a good life for all within planetary boundaries, specifically interested in establishing a system in which this is possible, its agreed upon that its incompatible with incessant gdp growth- thus most proponents, myself included see a capitalist form of degrowth as impossible, and even if possible, not helpful to the main goal. I am not talking about reduction in a neoclasaical concept of capital (natural, human etc) as that would be unnecessary and contrary to the whole aim.\n\nWhile unproductive capital and labour are substantive issues, they dont seem to provide an issue to degrowth (if thats what you’re driving at), since these have been increasing rapidly at the same time as co2 and resource usage more broadly. Removing these would not invalidate arguably degrowths central hypothesis that one cannot decouple co2 and resource usage in time to avoid catastrophic climate change. (Again, not saying we are fucked, but that we need a system that doesnt need compound gdp increases every year to stave off unemployment and wider crisis- we absolutely can grow the important stuff while not going extinct- apologies if this wasnt new to you just thought id clarify just in case).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "C_Plot",
                            "body": "A few issues come to mind:\n\n* M–C–M′ is not itself accumulation. M–C–M′ is merely the capital process. The surplus (M′ − M) can be used for all sorts of things other than accumulation. Accumulation involves the M′ deliberately distributed to the acquisition of additional means of production beyond the prior level of production. That prior level of production is maintained by the constant capital: C. \n\n* nominal GDP is largely irrelevant to growth and de-growth. If inflation is rising (large or small), it does not say anything about real production and consumption\n\n* GDP is a measure of commercial market activities. If we all got Star Trek replicators tomorrow in our communes, that could produce replicators for our households, GDP would plummet that very day to near zero, while production and consumption would rise incredibly, because the resources produced and consumed would not pass through any markets circulation. \n\n* unproductive activities should be at the forefront of de-growth—especially exchange-value-seeking activities that are anti-social but nevertheless require extraction, production and consumption to fulfill those anti-social activities. Those persons previously engaged in unproductive exchange-value-seeking labor still need their means of consumption, but all of the capital consumed to pursue the exchange-value-seeking anti-social activities is pure waste from a social point-of-view. If we are going to reduce consumption, that is the lowest hanging fruit. \n\n* GDP is largely a black box when it comes to greenhouse gas emissions. The commercial activity GDP measures (say $100 trillion) could be based on rampant exhaustible resource extraction and heavy pollution.  Or the same immense figure could be a measure of a gross product that is comprised entirely of renewable resources with zero greenhouse gas emissions. A substantial portion of GDP could even be expenditures/incomes/products devoted to cultivating and producing greenhouse gas sinks to address the accumulated stock of greenhouse gases from the last few centuries. In that instance, de-growth could actually interfere with addressing the climate catastrophe. \n\nMy view is that a socialist social formation would focus predominantly on renewable resources and only solid, liquid, and gaseous emissions that can be proposed by natural cycles without degrading the environment (including the oceans and atmosphere). If we at all allow consumption of non-renewable resources or renewable resources at a pace that is not renewable, that should be done only with a sober understanding that we deprive posterity of what we want to consume and only with super majoritarian institutional mechanisms approving the non-renewable extraction or non-renewable emissions (water and gypsum for concrete are good examples of non-renewable exhaustible repairs we might exempt from the general rule in the immediate future, but where we then seek to find substitutes for concrete in all of its uses).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bolshivik90",
            "body": "Degrowth is un-Marxian economics. Our point is to overthrow capitalism, not tinker with things like growth and think that'll solve capitalism's problems.\n\nPlus, under capitalism, \"degrowth\" exists and has existed as a part of capitalist development since the beginning: it's called a recession.\n\nSo long as capitalism exists, \"degrowth\" advocates are taking a reactionary position. Because who suffers and who pays in a recession? Certainly not the bourgeoisie. Degrowth would mean exactly what a recession means: job losses, workplace closures, bankruptcies, and austerity after the dust has settled.",
            "score": 3,
            "replies": [
                {
                    "author": "Allfunandgaymes",
                    "body": "A recession is not degrowth. A recession is a manufactured crisis of capitalism. You are likely confusing degrowth with deflation, which is a tool of capitalism and which can in fact trigger recession.\n\nDegrowth has a place in Marxist thought, especially from an ecological point of view. Continuous economic growth as an indicator of human progress is in part what has lead us to the exported extractivity and hyperconsumption of the global north which threatens the existence of all humanity via climate change and environmental collapse. I highly recommend Kohei Saito's works on the subject, particularly his \"Degrowth Manifesto\".",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Bolshivik90",
                            "body": "To describe a recession as \"manufactured\" makes it sound like it is consciously carried out by the capitalists. It isn't. It's inherent to capitalism and unavoidable, but it's not like capitalists *want* recessions, as it's obviously bad for their profits.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Allfunandgaymes",
                                    "body": "Capitalism's dominance is dependent on such crises occurring to keep the proletariat uneducated, disillusioned, distracted, and desperate. No, there is no Legion of Evil Capitalists sitting around a table deliberately planning the next recession. But I think you underestimate the capitalist class's tacit focus on their long game. Except in extreme circumstances, they are not the ones who suffer from recession, as was stated previously in the thread. The capitalist class can afford to simply let recession happen as a matter of course, even if it makes the numbers in their bank accounts stall or fall. Thus, it is not manufactured as much by design as it is by passive greed and apathy. \n\nI think you took my meaning a bit too literally. As well as missing my point about degrowth vs deflation.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Bolshivik90",
                                            "body": "Everything since 2008 has shown that capitalists are absolutely *not* focusing on the long game, but the short game. They have shown themselves to be a class which has completely outlived its historical role.\n\nLook at the war in Ukraine. The EU slapped sanctions on Russia which has hurt the EU more than Russia, and now Germany, the powerhouse of the EU, is being deindustrialised as a consequence. They literally destroyed the economic base of their own European Market on the *short term* idea that Europe should support Ukraine \"for as long as it takes\". If capitalists really were looking at the long game they'd have let Ukraine fall and given Russia a diplomatic slap on the wrists, whilst still being dependent on cheap Russian gas.\n\nAnd of course, climate change is as much proof as you can find that capitalists are not looking at the long game.\n\nEdit: And no, degrowth is a recession. It's the opposite of growth. Deflation isn't the opposite of growth, it's the opposite of inflation.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThatGarenJungleOG",
                    "body": "Uh not knowing what the hell youre saying is also non marxian, at least i hope.\n\nFew, arguably zero degrowthers think capitalism is a viable system to degrow.\n\nNo, capitaist recession is not degrowth. See any degrowth q and a for rectification? Maybe, as has been done to marxism countless times, dont take a half second look at the label and blather on about what you think it means and actually take a look?\n\nMinimal effort at least please?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Infinitemulch",
            "body": "I wouldn’t equate economic growth to capital accumulation. Economic growth is an increase in RGDP/capita. In advanced economies, this increase predominantly comes from productivity growth, or getting more output with less input. \n\n\nHuman capital is the first thing that comes to mind. And of course, activities like rewriting a line of code so it runs in less time and uses less computing power is an increase in economic growth. Similar activities are then repeated all over the economy (better housing, cleaner energy, more efficient manufacturing, etc.).",
            "score": 2,
            "replies": []
        },
        {
            "author": "brocker1234",
            "body": "the basic framework to prove the necessity of degrowth is based on \"ecological limits\". ecological limits are so far uncertain but existing natural limits beyond which organized human life would be in jeopardy. we should first criticize that notion, do \"ecological limits\" really exist and what do they imply in terms of the humans' relationship to nature?\n\necological limits presume that humans are external to and \"antagonistic\" towards nature. the function of the category of ecological limits is to restrict human behavior so that natural structures would have a wider space to operate on. these limits are so far only theoretical, we can't really know until we have passed one to see its effects. degrowth is the direct political outcome of this understanding. in order for nature to \"breathe freely\" the total effect of human activity must be reduced.   \n  \nthe theory of ecological limits is a squarely non dialectical one. a dialectical framework would accept from the outset that humans and \"nature\" shape each other continuously. humans are not outside but a part of nature. the reasonable aims of degrowth agenda, like shrinking the non productive sectors and doing away with arms manufacturing are also goals of class struggle. they must be attempted in any dictatorship of the proletariat.  redirecting resources to primary needs of the population is basic development even for a social democratic government. but then why group programs like these under the name \"degrowth\"? in fact a kind of degrowth is already occurring, large parts of the developed world has been deindustrializing for decades. consumption levels and birth rates have been dropping.   do we desire these developments?",
            "score": 1,
            "replies": []
        }
    ]
}