{
    "title": "Works on dialectics from Marx himself - where to begin?",
    "author": "OkGarage23",
    "subreddit": "Marxism",
    "rank": 186,
    "score": 20,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Marxism/comments/1hpu49b/works_on_dialectics_from_marx_himself_where_to/",
    "id": "1hpu49b",
    "selftext": "I've recently found [this](https://leftofwreckage.wordpress.com/2017/09/24/theory-review-maos-on-contradiction/) text on how Mao doesn't understand Marxist dialectics, which made me want to go to the source.\n\nSo I was wondering which parts or chapters of which books should I read in order to see what Marx himself said about dialectics?",
    "comments": [
        {
            "author": "C_Plot",
            "body": "Marx wanted to write a book on Hegel and dialectics throughout his career but never got around to doing it. This is Engels’ effort to write it himself after Marx passed: \n\n[Ludwig Feuerbach and the End of Classical German Philosophy](https://www.marxists.org/archive/marx/works/1886/ludwig-feuerbach/index.htm).",
            "score": 20,
            "replies": []
        },
        {
            "author": "RNagant",
            "body": "Well, as the author indicates, Marx's dialectical method (or description?) is employed most masterfully and obviously in Capital. As for works in which Marx addresses dialectics itself as a subject, there kinda isn't? There's a couple works in The German Ideology that goes over idealism and materialism, that expounds what would be better called historical materialism, and that rejects the mechanistic or vulgar materialism of feuerbach, but most of what could be called dialectics is implicit in his work AFAIK. I suppose dialectics does come up as a subject in Marx's criticism of Proudhon (both in Poverty of Philosophy and some letters), though.\n\nEngels, for one, did directly address the subject of dialectical materialism in Anti-Duhring/Socialism: Utopian and Scientific, but I gather that most people who disagree with Mao's understanding of dialectics also think Engels misunderstood.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Ill-Software8713",
            "body": "Well a good hint from Marx is in his Method of political economy: https://www.marxists.org/archive/marx/works/1857/grundrisse/ch01.htm#loc3\n\nFor a summary on this passage discussing concrete and abstract, see: https://www.ethicalpolitics.org/ablunden/works/abstract-and-concrete.htm\n\nAnd: https://www.marxists.org/glossary/terms/chat/index.htm\n\nAlso, Evald Ilyenkov is helpful and interesting in regard to Marx’s method: https://www.marxists.org/archive/ilyenkov/works/abstract/index.htm",
            "score": 4,
            "replies": []
        },
        {
            "author": "Phurbaz",
            "body": "For a great (and very readable) analysis on Marx's dialectics check out Bertell Ollman's Dance of the Dialectic - Steps in Marx's method. (You can find a free pdf...).\n\nProbably the best introduction to the topic and (Marx's) dialectics in general.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "interpellatedHegel",
            "body": "It is important to note that, for Marx, dialectics never received formalistic or ontological \"lawlike\" character. Instead, they were usually upheld as a methodological epistemology, a way of constructing knowledge by uncovering contradictions within social phenomena. Marx didn't prioritize his work on dialectics, because his method is pervasive throughout the body of his work. Indeed, the dialectic of concrete and abstract, as Ilyenkov observes, remains the core of Marx's method in the entirety of \"*The Capital\"*, which is a perfectly clear demonstration of the Marxist dialectic. \n\nRegarding what other Marxists theorize on the Marxist dialectic, I'd strongly recommend getting into Ilyenkov's theoretical project, which is articulated in \"*Dialectics of the Abstract & the Concrete in Marx’s Capital\".* Additionally, Althusser's texts on dialectics and the split between the Hegelian and the Marxist dialectic (in \"*For Marx\"* and \"*Philosophy for Non-philosophers\"*) are worth looking into.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Verndari2",
            "body": "Ah, I see you have found Antonio Wolf. Yeah, Mao's understanding of Dialectics is a bit different than Marx. But if you really want to understand Dialectical Thinking, don't read Marx but go back to the source - Hegel. Start with the Science of Logic, maybe up to the Concept of Infinity. Then switch to another work by Hegel (I read Philosophy of History) to get some application of the method. And I think at that point you can go back to any marxist text and see for yourself where it falls short.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marxist20",
            "body": "You can find some writings of Marx on philosophy in this book:\n https://marxist.com/book-the-revolutionary-philosophy-of-marxism.htm\n\nhttps://www.marxistbooks.com/products/the-revolutionary-philosophy-of-marxism",
            "score": 1,
            "replies": []
        }
    ]
}