{
    "title": "Hello r/Marxism, introducing ourselves, Kritikpunkt.com",
    "author": "Holiday-Ad8875",
    "subreddit": "Marxism",
    "rank": 182,
    "score": 90,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Marxism/comments/1hryctf/hello_rmarxism_introducing_ourselves/",
    "id": "1hryctf",
    "selftext": "  \nWe are a small magazine based in **Berlin** that is in the midst of establishing itself.  \nOver the past year, we’ve built up a small readership, which we now wish to **expand** with our **multilingual website** and social-media presence.\n\nWe are a fundamentally **critical** medium that opposes the prevailing understanding of economy, ideology and **class**.\n\nWe adopt a scientific approach and prioritise the **clarity** of our language, recognising the tough challenges in understanding Marxist material, which we perceive as a significant deficit in the **weakness** of Marxism in the west.  \nWe’ve written about basically everything; encompassing a wide range of subjects, including **Palestine**, **Syria**, our understanding of **China**, Marxist **theory**, the logical rise of **fascist** ideology in **Europe**, and numerous others.\n\nIn addressing each of these topics, we strive to employ **scientific**, **objective**, and **simplified** approaches to ensure clarity and comprehensibility.  \nEvery article of ours is available in **german**, **english and arabic** and can be switched by tapping the button in the bottom right of our website.\n\nOn our social media, every new post is uploaded in **english and german.**\n\nWe rely on **critique** to perfect our arguments, said critique gets published frequently.  \nYou can find us on[ instagram (@kritik\\_punkt)](https://www.instagram.com/kritik_punkt/), [twitter (@\\_kritikpunkt](https://x.com/_kritikpunkt)) and at [Kritikpunkt.com](http://Kritikpunkt.com)",
    "comments": [
        {
            "author": "ZaxOnTheBlock",
            "body": "Wow, that's pretty cool and amazing, Mexican marxist and software Engineer here, if you guys ever need someone to help you with a spanish versión on anything I'm willing to help and expand the info anyway I can. Cheers",
            "score": 12,
            "replies": []
        },
        {
            "author": "TheN4m3l3ss0ne",
            "body": "I find It cool,but if I may say an unrequested advice, i would have prioritized English posts on Instagram. I know you guys want to keep the german imprint on It, but in order to reach a broader population also by the algorithm it's necessary I think.",
            "score": 5,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "I can't find any assessment on your website of Stalinism.  Is this correct? \n\nOne article - [Part 2: Lenin in a double pack](https://kritikpunkt.com/2023/11/24/teil-2-lenin-im-doppelpack/) \\- has a number of questionable statemments \n\n# #1\n\n>As the first socialist state, the Soviet Communists found themselves in a situation in which they could practically not rely on the writings of Marx and Engels at many points in the socialist construction, since the starting point for socialism was now completely different.\n\nWhy couldn't they \"rely on the writings of Marx and Engels\"? Marx and Engels historical-materialist method was fundamental Lenin's and Trotksy's analyses.    \nREFS:  \n\n* [Lenin’s place in history - World Socialist Web Site](https://www.wsws.org/en/articles/2024/01/22/clch-j22.html) \n* [“Socialism in One Country” and the Soviet economic debates of the 1920s - World Socialist Web Site](https://www.wsws.org/en/articles/2009/05/nbp1-m04.html)\n\nIf they weren't relying on historical-materialism, what idealist conceptions were they using instead? \n\n# #2\n\n>Lenin did not live to see the end of NEP (1927), and in the course of the threat of fascist aggression, the Soviet Union was forced to resort to centralist methods for building up heavy industry. \n\nThere was no fascist threat in 1927.  The end of the NEP was forced on the Stalinist bureaucracy because farmers began withholding grain from the cities since there were being offered no goods worth trading for.  \n\nREF: [A magnificent account of Stalin’s opponents in the USSR - World Socialist Web Site](https://www.wsws.org/en/articles/2019/12/21/rogo-d21.html)\n\n# #3\n\n>The \"tactical retreat\" back to capitalism, as Lenin describes NEP, remains, in addition to its objective successes, a groundbreaking piece of Marxist theory (and practice) that prevented the near-economic collapse of the young USSR and gave the CPSU a sufficiently stable foundation to defend itself against Hitlerite fascism a few years later.\n\nI can find nothing on your website about the critical role the \"Third Period Line\" of Stalinism played in allowing Hitler to destroy the organisations of the Germany working class in 1933 without any opposition.  Mussolini established a fascist dictatorship in Italy in October 1926.  The danger posed by Hitler and the NSDAP was clear to anyone who cared to look. Yet the Stalinist KPD and the Comintern insisted the social democrats were \"social fascists\" (i.e. the SAME as fascists) and the main prop of capitalism.  Surely the critical question for Marxists is why Hitler got so far in the first place, why the Red Army leadership was decimated in the Great Terror, why the 1939 non-aggression pact was signed and its consequences and why the largest land invasion in history - 4 million soldiers - was a \"surprise\". \n\nFYI: You are probably aware of this but on 1 April 1933 the Comintern issued its first statement which praised the policies of the KPD \"before and at the time of the Hitler coup\" as \"quite correct\", and summoned the party \"to prepare the masses for decisive revolutionary battles, for the overthrow of capitalism and for the overthrow of the Fascist dictatorship by an armed rebellion and also claimed: \n\n>  “The establishment of an open Fascist dictatorship, which destroys all democratic illusions among the masses, and frees them from the influence of the social-democrats, will hasten Germany's progress towards the proletarian revolution.”  \n  \np. 90 [Twilight of the Comintern, 1930-1935 (Carr,1982)\\_\\[Free Borrow at Open Library\\]](https://archive.org/details/twilightofcomint00carr)",
            "score": 1,
            "replies": []
        }
    ]
}