{
    "title": "Kritikpunkt-Article: The foreigners contradiction, Musk is campaigning for the fascist AfD, while needing more migrant labour. Fascist ideology needs ‘the foreigner’ for legitimizing its existence, the state needs ‘the foreigner’ because its own labour force is no longer profitable enough.",
    "author": "Holiday-Ad8875",
    "subreddit": "Marxism",
    "rank": 172,
    "score": 32,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Marxism/comments/1huzdid/kritikpunktarticle_the_foreigners_contradiction/",
    "id": "1huzdid",
    "selftext": "Hello Comrades, we've written a new article!\n\n***Excerpt***:   \n“As in every other developed capitalist state, the domestic labour force cannot fulfil the wishes of the profit-making corporations - this is an unsolvable mechanism as long as the contradiction between capital and labour prevails.  \nAt the same time, those in power here and elsewhere rely on the ‘foreigners!’-card because this is the best way to conceal the fundamental contradictions underlying the material existence of the working people.   \nLike every other bourgeois ideology, the most reactionary of all, fascism, cannot explain the fundamental mechanisms of capitalism, and thus knowingly or unknowingly drives itself permanently into political and ideological contradictions and dead ends - like a dog chasing its own tail - loudly, frantically and without aim, then when it does catch it, it cries.”\n\n[Read the article here](https://kritikpunkt.com/2025/01/06/der-widerspruch-des-auslaenders/)  \n[Kritikpunkt-magazine on Instagram](https://www.instagram.com/kritik_punkt/)\n\nHope you enjoy our work comrades!",
    "comments": [
        {
            "author": "silverking12345",
            "body": "Read the article and it basically lays things out, explaining exactly why fascists need foreigners, both as a scapegoat for all the nation's ills but also as cheap labour. \n\nThe immigration issue is where these elements collide in spectacular fashion. Right wingers scream atop the hills about the threat of foreigners stealing jobs yet, at the same time, benefitting from the cheap labour they provide. This is one of just many of the insane logical incongruity of fascist thought.\n\nIt's just like the Nazis absolutely detesting the existence of Jews, yet, instead of exterminating them all, they decided to enslave a large number of them because, despite their beliefs regarding their degeneracy and inferiority, the labour they provide is nevertheless profitable.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Cute-University5283",
            "body": "You'll notice the fascist libertarians want \"visa\" immigrants; they want to create a subclass of labor that was raised and educated at another country's expense who they can work as hard as they want and at the same time undermine citizen labor. For profit capitalism always needs more labor and this is how the plan to get it.",
            "score": 4,
            "replies": []
        }
    ]
}