{
    "title": "What to read...",
    "author": "Dry_Fig_9549",
    "subreddit": "Marxism",
    "rank": 165,
    "score": 95,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 86,
    "url": "https://www.reddit.com/r/Marxism/comments/1hxjd0k/what_to_read/",
    "id": "1hxjd0k",
    "selftext": "I am, more or less, a conservative, but I think I ought to have a proper understanding of opposing world-views like Marxism. Many of the infantile right seem to be engaging only with poor versions of what Marxists really believe and I wouldn't to fall into the same trap, so I would ask you what someone like me should read to understand, or even be convinced by, Marxism / leftism in general.",
    "comments": [
        {
            "author": "StatisticianGloomy28",
            "body": "Why Marx Was Right by Terry Eagleton is a fairly short, very accessible read that covers a lot of the main controversies swirling around Marxism and brings a nice balanced response to them. Highly recommend.",
            "score": 54,
            "replies": [
                {
                    "author": "mymentor79",
                    "body": "This is the best answer.  To anyone whose only relationship to Marxism has been misinformation and strawmanning, Eagleton's book is the most concise repudiation.  It's a good place to start for anyone interested in challenging the received wisdom passed down from those interested in discrediting Marx and his work.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "sakodak",
            "body": "A lot of people are giving you pretty good suggestions, but it's a lot of hardcore theory (which you must read to fully internalize the vast array of socialist ideas.)\n\n\nI would suggest, however, maybe starting with something contemporary and accessible like \"Socialism, Seriously\" by Danny Katch.  It is (necessarily) simplified, but I think it gets across what regular people would get out of a socialist society.  Maybe even \"Why Socialism?\" by Albert Einstein (a little bit less accessible - it is Einstein - but it's short and understandable.)",
            "score": 16,
            "replies": []
        },
        {
            "author": "MrZebrowskisPenis",
            "body": "The one thing I’d absolutely read in your shoes is chapter 1 of Capital vol. 1. It’s not an easy read but it debunks a lot of those “poor versions” of Marxism you mentioned. Even the first five pages directly counter most of what conservatives still say about Marx’s version of the labor theory of value. If you find yourself struggling with it (which most people do) [watch David Harvey’s lecture on ch. 1](https://youtu.be/zwuMrd_Hgww?si=MSqq0jUveRtgzLCi) which helps clarify what Marx is saying.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Muuro",
            "body": "Principled of Communism by Engels.  \n\nSocialism: Utopian and Scientific by Engels.  \n\nOrigins of the Family, Private Property, and the State by Engels. \n\nThe Three Component Parts of Marxism by Lenin.  \n\nState & Revolution by Lenin. \n\n\nCapital (all three volumes) by Marx (this is preferable). \n\n\nor for an easier time. \n\nWage Labor & Capital by Marx.  \n\nValue, Price, & Profit by Marx",
            "score": 11,
            "replies": [
                {
                    "author": "Someslapdicknerd",
                    "body": "OP, seriously, just start with the last two.  Just understand that the rabbit hole for the average marxist is very, very deep and you'll likely quit before getting past intro to Das Kapital.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "SEA-DG83",
            "body": "“Socialism: Utopian & Scientific,” and “Origin of the Family, Private Property & the State”, both by Engels are good introductions. The former is concise and provides a pretty good explanation of dialectical materialism. The latter is longer, and a bit dated in places, but still makes a good case for understanding societies and their institutions as dynamic, not static things.\n\nAlso, Mao’s “On Practice” was pretty influential for me in becoming a Marxist and wanting to be active, rather than an armchair intellectual.",
            "score": 37,
            "replies": [
                {
                    "author": "xJapsRx",
                    "body": "Socialism: Utopian & Scientific is imo the best answer from the classical Marxists. That is, if you want to learn about dialectical materialism and fundamental ideas to economics in Marxism.\nThat said, I would never recommend Origin of the Family as an introductory work. It's an important piece of writing, with Engels really establishing Marxism as science by using Anthropology to illuminate historical materialism. But it's also quite dense, and as already said, at places somewhat dated. In addition, where Marx himself always stressed the dialectical progression of history, Engels (especially post-Marx' death) contributed to what we now often call \"vulgar Marxism\", or a mechanical -determinist- conception of history.\n\nWhat I find a better introduction to historical materialism, is The German Ideology by Karl Marx and Friedrich Engels. The important part is only the first half (ofc you can read the second if you're interested in philosophical debates in German history).\nThis is the first \"mature\" work from Marx, in which the main points from The Origin of the Family are expositioned together with ideas about ideology, law and the State that are fundamental to Marxism (and the first half is only about 70 pages long).\n\nTwo other short, but important works I would recommend are \"Value, Price and Profit\" and \"Wage, Labour, Capital\" both By Karl Marx. They concern Marxist economic basics. Both are under 40 pages.\n\nWith regards to Mao: he is an important and, of course, historically significant thinker. But you should not read Mao as an introduction to Marxism. His conception of dialectics is very specific and different from Karl Marx, Friedrich Engels, V.I. Lenin, etc.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Marxist20",
            "body": "Wage Labor and Capital by Marx \n\nSocialism Utopian and Scientific by Engels \n\nThe State and Revolution by Lenin",
            "score": 25,
            "replies": []
        },
        {
            "author": "UrememberFrank",
            "body": "If you want to understand him, situate Marx in world history in the context in which he is writing. Familiarize yourself with the bourgeois revolution(s) of the late 18th and 19th centuries in Europe.  \n\n\nMarx was writing in response to world history unfolding around him as a new form of freedom was emerging under industrial capitalism--the formal freedom to own and sell your own labor. Notice how these revolutions point to a kind of freedom beyond wage labor but the workers who push toward it are brutally crushed instead. \n\n\nWhen you read Marx think about freedom and what it would take to overcome the historical norm of some people's freedom being the result of others' enslavement. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "Own-Pause-5294",
            "body": "Read the manifesto first. It's a short read as it was meant to be read to factory workers. It covers basic points but doesn't contain the most detailed or more complex arguments, you would have to read capital for that, which is a much longer work.",
            "score": 24,
            "replies": [
                {
                    "author": "Disinformation_Bot",
                    "body": "I think the manifesto is not the bestplace to start. It is more of a polemic that doesn't really explain concepts well. A better place to start would be \"Principles of Communism\" and \"Value, Price, and Profit\"",
                    "score": 21,
                    "replies": [
                        {
                            "author": "tcmtwanderer",
                            "body": "Much agreed, the manifesto is written with workers in mind, but specifically mid-19th century workers in Europe, and a lot of the text deals with their particular social conditions, rather than expounding the principles of Marxism more generally as with the works you mentioned.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Callidonaut",
                    "body": "*Capital: A Critique of Political Economy* is obviously The Big One, but it's very hard work; the dense 19th century prose can be uncomfortable or intimidating to those unfamiliar with the typical writing style of that era, and Marx (or possibly his English translator?) is sometimes frustratingly sloppy in his terminology; in particular, the book recognises and defines three distinct kinds of value (use, labour and exchange), but sometimes uses the word in isolation without explicitly saying which of the three is meant, and you have to figure it out from context.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Supercollider9001",
            "body": "Feel free to ask questions here too as you read. \nMarx can be an entertaining read but it is very dense. Even the Manifesto is very dense and has many layers of understanding I feel but it is a good summary of Marxist ideas. \n\nI always tell people to start with Engels’s Socialism: Utopian and Scientific. \n\nBut first you have to start with reading history. We learn history from a conservative perspective. There is another perspective that you have to understand. It’s not less valid. The stories we learn erase the class struggle and the voices of the oppressed. And you have to understand these if you want to understand Marx. I would start with Howard Zinn’s People’s History of the United States. And A History of America in Ten Strikes by Eric Loomis. And a Brief History of Neoliberalism by David Harvey. \n\nLenin’s State and Revolution is also a good early read. He also has a little pamphlet called the three sources and component parts of Marxism which is a very short and simple summary of Marxist concepts.  \n\nReally you should be starting with Hegel. The dialectics and references to Hegel are key to understanding Marx, especially early Marx.\n\nSpeaking of early Marx, the part on Alienation called Estranged Labour is from the 1844 manuscripts is also a good introductory read.\n\nLooking into Frankfurt school and Althusser in particular for me is worth it. But actually read them or actual secondary sources not Jordan Peterson.\n\nIf you want actual news from a Marxist/communist perspective I would recommend reading People’s World. It is a small paper but it’s written for laypeople and it’s just the news. It gives you some perspective as to what are the stories and voices that matter to the left and working class folks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "silverking12345",
            "body": "https://marxist.com/what-is-marxism-book.htm\n\nI used this list to learn. It's pretty decent actually. If you want something more approachable, try looking around the website, it has shorter and more readable articles that give simplified explanations.\n\nIf you want first hand knowledge and gain a deep understanding of theory, you can try to read Das Kapital, but its pretty heavy if you aren't privy with this sort of text.\n\nAnd of course, if you want to discuss and ask questions, you can do so here.\n\nGood luck, hope you find something enlightening from this venture.\n\nEdit: if you wanna save a little time and get the basics down faster, YT is not that bad of an idea. You can check out Second Thought, Marxism Today and PhilosophyTube as a starter.",
            "score": 7,
            "replies": []
        },
        {
            "author": "giorno_giobama_",
            "body": "If you're looking for the philosophical aspect of Marxism, you should start with \"historical and dialectical materialism\" by stalin.\n\nFor the economic side you should read 2 pamphlets called \"wage labor and capital\" + \"value, price and profit\" both by Marx\n\nAnd for the basic introduction into communist theory you can read \"principles of communism\" by Friedrich Engels\n\n\"the communist manifesto\" is a good start too, but wouldn't recommend it over \"principles of communism\" because Engels wrote in an QnA style, which is really good to understand",
            "score": 8,
            "replies": []
        },
        {
            "author": "ElEsDi_25",
            "body": "Reading is not convincing.\n\nIf you like capitalism or the status quo, then nothing you read will change that. If reading and political argumentation was convincing… socialist would all be capitalists here as well since we’ve all read and absorbed more capitalist common sense than socialist theory or history.\n\nSo reading even a short punchy thing like the manifesto or whatever would be a slog for someone who isn’t already bothered by capitalism or actively involved in class struggle to some degree already.\n\nSo for gaining insight into why socialists believe what they do, I’d just go for basic introductory things meant for lay people and then ask follow up questions irl or online. \n\nYou’ll just need to understand that there are lots of different competing socialist traditions (just as liberalism is divided among social liberals, conservatives, libertarians, social democrats etc.) So there’s an ABC of socialism from an anarchist perspective and a more recent one from a democratic socialist (reformist Marxist) perspective. Different Marxist traditions have their own similar texts.\n\nFor me personally reading the [two souls of socialism](https://www.marxists.org/archive/draper/1966/twosouls/index.htm) was foundational to me because I read this shortly after the collapse of the USSR. It’s coming from a polemical place, but helped me wrap my head around all the different takes on socialism I was seeing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_cremling",
            "body": "I cannot understate how important Critique of the Gotha Programme is. it is essential to understand why leftism is fundamentally flawed and why common \"marxist\" ideas are wrong and falsified",
            "score": 4,
            "replies": []
        },
        {
            "author": "East_River",
            "body": "What you are looking for is a modern, recently written introduction that is very readable. For that, *[Understanding Marxism](https://www.goodreads.com/book/show/44403028-understanding-marxism)* by Richard Wolff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mildheortness",
            "body": "Read Marx’s Capital vol. 1 to start. most people have no clue what Marx really thought nor do they care to find out. Kudos to you for recognizing your lack of knowledge of your opponent.",
            "score": 3,
            "replies": [
                {
                    "author": "Enkidarr",
                    "body": "\"Oh you want an introduction to Marxism? Just read this dense 1000 page book, bro\"\n\nI love Capital, but suggesting it to people BRAND NEW? This is a great way to confuse people, as it is very much a mature text that doesn't even specifically outline the dialectical materialist method.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "olBillyBaroo",
            "body": "Just start with Capital Volume 1. in conjunction with a guide book, I personally recommend David Harvey’s companion guide. Utilize YouTube lectures for points that are particularly difficult. And understand that reading capital is a challenge that requires discipline which is why most people don’t even try.",
            "score": 2,
            "replies": []
        },
        {
            "author": "99luftmushrooms",
            "body": "I'd recommend Bukharin and Preobrazhenskii's 'ABC of Communism'. There's an English translation available on Google Books, and it's meant to explain basic Marxist concepts in accessible terms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EstablishmentBusy172",
            "body": "If u want an overall view (that does highlight a few criticisms of capitalism in relation to Marxism) that is fairly accessible I recommend hadas thier’s “A People’s guide to capitalism: An introduction to Marxist economics”.\n\nFor sure reading Captial would be a more holistic answer but if u want a succinct version with the key tenants explained in the modern vernacular with modern real world examples I think she does a really good job. And it does include a lot of quotation from Marx’s works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KermitIsDissapointed",
            "body": "Hey there. Did the same thing you’re doing with Austrian economics a few months back. If you would like my two cents, I’d recommend Principles of Communism by Engels. Haven’t read it in a year or two but it’s the best place to start in my own opinion. You can find free versions online and have it read in 40 minutes or less. If you can’t find it, Wage Labour and Capital is a pretty decent introduction.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asdf6967",
            "body": "I want to start by saying i respect the hell out of this question. I wish i knew more right wingers that could actually engage in a discussion of Marx and other leftist thinkers rather than those who are just parroting what others say about leftist thought. \n\nThere are a lot of books, most being recommended by others that will give you a surface level, decent understanding of left wing ideology. Most people aren't recommending Das Kapital, probably because most people haven't read it. And to be sure, it's a very, very hard book to read. But if you want to understand Marxism (and understand what capitalism actually is) there's really no substitute for it. It's the most cited book in the social sciences for a reason, because basically all political economy and sociology that has been done since is a footnote to Marx, and Das Kapital in particular. \n\nDon't expect it to be an easy read though. Expect to struggle with it a bit. Im guessing from reading your post that is something you'll be up to though. I would recommend finding a group to read it with, or using something like David Harvey's video series while you read it. But if you want to really understand Marxism, you have to use the primary source. \n\nHappy reading!",
            "score": 1,
            "replies": []
        },
        {
            "author": "tcmtwanderer",
            "body": "Check out this YouTube series: https://youtube.com/playlist?list=PLuzqoNvqVKydyRAMjDAHDikbVY9BDLC7V\n\nMarxism has been described as \"A combination and critique of British Economics (Adam Smith, David Ricardo, James Mill, Sismondi, etc), French Utopian Socialist Politics (Auguste Comte, Henri de Saint-Simon, Charles Fourier, Robert Owen, etc), and German Enlightenment Idealist Philosophy (David Hume, Immanuel Kant, Johann Fichte, Friedrich Schelling, Georg Hegel, etc), though Marx has been known to quote many other authors and works like Honoré de Balzac, Johann Goethe, Cervantes' Don Quixote, etc\n\nMarxism critiques the limitations of classical economics, questions idealist philosophy’s neglect of material conditions, and grounds its socialist vision in practical historical analysis rather than abstract utopian ideas.\n\n\nThe work that really got me into Marxism was [Socialism: Utopian and Scientific](https://youtu.be/F4_BiWhvVyA), where Engles describes how their Scientific Socialism differs from previous Utopian conceptions. Scientific socialism is essentially putting scientific sociological theory to test, where the test bench is history and society. Before this, I was an anarchist, and the work that got me into Anarchism was Mikhail Bakunin's \"[The Capitalist System](https://youtu.be/GDI0WP-f70g)\".\n\nGood luck in your studies, I'm glad to hear that you're partaking in studies outside of your normal domain of focus; I likewise find that several right-wing authors have very insightful analyses that inform my overall worldview as a communist.\n\nI'd recommend the late Michael Sugrue's and Darren Staloff's lectures on Hegel and Marx as a great introduction, available for free on YouTube: [[1](https://youtu.be/0F8REGux8qs)], [[2](https://youtu.be/_xbZzxet9Cs)], [[3](https://youtu.be/AujF0bbiP_8)], [[4](https://youtu.be/zDY5vuMW90s)], [[5](https://youtu.be/5VAs32jOsGs)]. Also worth looking into the [Frankfurt School](https://youtu.be/xX9EI8wEyuY), which heavily developed Marxist theory in the early to mid 20th century, and was heavily involved in university student radicalism in the 1960s. [This dialogue](https://youtu.be/U23Ho0m_Sv0) between Bryan Magee and Herbert Marcuse is a great start, also Bryan Mage's dialogues about [Hegel](https://youtu.be/iQeS6EH8bPw) and [Marx](https://youtu.be/G5v6U1SJdtU).\n\nIt's also worth looking into the history of various socialist experiments. Here's a few documentaries: [Soviet Russia Through the Eyes of an American](https://youtu.be/Pk2DJTAmwJ8), [Tsar to Lenin](https://archive.org/details/tsar-to-lenin-color), [How Yukong Moved the Mountains](https://youtube.com/playlist?list=PL3fsZgrmuTzdfPnyHdHL6YqPxcMSw2IfY), [USSR: A Society Without Crisis](https://youtu.be/_Ib4vM42fVo), [Socialist Albania](https://youtu.be/V_nlWEIWOJA), [Mission to Moscow](https://archive.org/details/missiontomoscow1943).\n\n[Bonus video](https://youtu.be/-e8rt8RGjCM)",
            "score": 1,
            "replies": []
        },
        {
            "author": "therocknrollbuddha",
            "body": "I applaud your open-mindedness to the others point of view. Try reading David Harvey's book called Reading Capital. I think he makes a pretty contemporary case for the relevance of Marxist thinking, and in particular of the book Das capital.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adjunct_trash",
            "body": "You might try Vivek Chibber's relatlively new, relatively concise book, *Confronting Capitalism* for some sense of what feels like it's at stake from the Left/Marxist perspective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DragonBitsRedux",
            "body": "It's great to read and learn about opposing views but it's even more important to realize Marxism has almost nothing to do with \"Liberals\" in America.\n\nI've met damaged folks on the left and right who are \"lazy\" or just want to use the system to their advantage. \n\nOTOH, have u met a lot of liberals who don't want jobs? Who don't want their kids to succeed? \n\nMany liberals tend to be what I'd call Small Business Capitalists who struggle with regulations and a playing field skewed toward laws engineered by both right and left wing Big Capital.\n\nI've worked with high integrity folks and low integrity folks on both sides of the aisle and deep experience with what ruins people on both sides:\n\nA grudge or grievance that says life isn't being fair to them *personally* \n\nA sense that lying, cheating and manipulation are *normal* and *required* and further justified because they are a (Christian or Social Justice) Warrior who is holier than thou! \n\nThat said? Read Marx. I'm not a Believer but I still read parts the Bible over again, have studied many other religions. \n\nI'm an oddball. I screwed up my integrity when I was younger, had an affair and lost the faith of my close peeps. I've fought hard since then to maintain my Word of Honor.\n\nOh, and if you hear someone on the news use the words or phrases free market, level playing field, invisible hand, etc? They are bullshit. \n\nYou can discuss policy without always bringing up ideology. \n\nIdeology is either inflexible, used as a blunt weapon or constantly changed to mean anything the weak-assed bully wants it to mean. \n\nI'm a Rural Liberal, fairly conservative financially, euthanized a deer with a fishing knife to the throat earlier this year after it was hit by a car, want balance in environmental laws for small farmers and adore my conservative neighbors. \n\nAnd, oddly? I'm my extended family tree, it has been those who felt butthurt who turned conservative, lived off someone else's money or shouted capitalism except when they were losing a business money and suddenly decided our family business was a charitable institution \"with no responsibility to the shareholders\" at a board meeting. Our accountant had a canary. \"You can't stay that!\"\n\nConservatism has some very good values. I just wish conservative politicians had spines and values .\n\nOh and the Democratic party is a herd of cats who could be in a locked room with a mouse and starve to death fighting over how to best divide it. Worst communicators ever. Nora Ephron in her top painful eternal truths listed \"the Democratic party will always be deeply disappointing!\"\n\nSo, skim Marx but realize no liberal of any sense \"hates capitalism\" or hates America, etc. Ugh \n\nAnd you sound like someone I'd love to chat with and learn from!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scary_Currency_5531",
            "body": "Why Socialism by Albert Einstein, Black shirts and the Reds, the Invisible Doctrine: Neoliberalism, and Technofeudalism. These are great books to get started as a conservative ( I was one, I voted Trump in the election before this one). I was very big into bootstrap policy and Martin Friedman but these were awesome. Gets into a lot of history of American economics and argues that we are actually extremely socialist for the 1 percent. Have fun man and challenge your view!",
            "score": 1,
            "replies": []
        },
        {
            "author": "pedmusmilkeyes",
            "body": "One of the other problems with just reading Marx is that conservative media has staged certain movements, like intersectionality, CRT, DEI, political correctness, and even globalism and corporate design as Marxist or crypto-Marxist movements, when really they are mostly the results of liberal navel-gazing or intervention by The Soviets. I don’t know of any books that tackle these ideas from a Marxist perspective, but I think it’s extremely important to decouple them from Marxism to understand where Marxism fits in. I’ve recommended Capital to conservatives, but they tend to get really bored by the lack of direct political engagement. Any book that touches on today’s political landscape from a Marxist perspective can be really useful to a curious conservative but unfortunately I don’t know any. Definitely ask plenty of questions, and Marxists can clear up incorrect information.",
            "score": 0,
            "replies": []
        },
        {
            "author": "jneedham2",
            "body": "Try some fiction about the dark sides of unfettered capitalism. Two good ones are The Jungle by Upton Sinclair and Grapes of Wrath by John Steinbeck.  The former is about immigrants on turn of the century Chicago,  the latter is about displaced farmers in the 1930s who go to California.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": "Marx changes a lot throughout his career. Because of this, it's helpful to either read things from both early and late in his career to see the difference or to rely on secondary literature. \n\nFor the former, I suggest reading Marx's Poverty of Philosophy, The Communist Manifesto, and 18th Brumaire of Louis Bonaparte. Oh and Engels's Socialism: Utopian and Scientific. \n\nFor the latter, I recommend Michael Heinrich's *An Introduction to the Three Volumes of Marx's Capital* which does a good job going through the relationship between Marx and Marxism and covering Marx's ideas. Simon Clarke's *Marx, Marginalism, and Modern Sociology* does a good job comparing Marx to modern economics and sociology but is also a little dense and theoretical. *Mute Compulsion* by Søren Mau is a good one for more modern non-soviet Marxism.",
            "score": 0,
            "replies": [
                {
                    "author": "Enkidarr",
                    "body": "Marx definitely matures in his thinking in his later life, but I don't think it's accurate to say he \"changes a lot throughout his career.\" There is undoubtably a cohesiveness to his thinking if you are to compare some of his earlier works to his later. In \"Estranged Labour\", Marx speaking of man's species-being (Gattungswessen) as labour-oriented and dependent on a constant intercourse with nature is very similar to how he talks about labour in chapter seven of Capital:\n\n>We presuppose labour in a form in which it is exclusively a human characteristic \\[...\\] Man not only effects a change of form in the materials of nature; he also realizes his own purposes in those materials. And this a purpose he is conscious of, it determines the mode of his activity with the rigidity of a law, and he must subordinate his will to it. (284, Penguins Classic version)\n\nI think this verse subtly pokes at a deep philosophical position in that Man is an attentive labour-being, which very much complements his earlier work in the Economic and Philosophic Manuscripts of 1844.\n\nI also disagree that anyone should ever rely on secondary literature. There is obviously merit to the countless books on Marx out there, but only once you have read the text yourself. There are vast opinions and interpretations of Marx that one must absolutely read the primary source first to develop an educated opinion on the matter.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Techno_Femme",
                            "body": ">Marx definitely matures in his thinking in his later life, but I don't think it's accurate to say he \"changes a lot throughout his career.\" There is undoubtably a cohesiveness to his thinking if you are to compare some of his earlier works to his later.\n\nI don't subscribe to the althusserian position of an epistemological break. I'm referring to Marx's changing positions on the state, technological optimism, his return to hegel in Capital, etc. There is a cohesive development with Marx often going back to old ideas with new eyes but that development involves a lot of changes. \n\n>I also disagree that anyone should ever rely on secondary literature.\n\nI think this is a silly position I see people have. Secondary literature is fine for introducing vocabulary and key concepts in a way that'll make engaging with the original texts easier. As long as you keep in mind that the author is always going to insert their own biases into the text, it's fine. Yes, there are some real stinkers in the introductions to Marx. I happen to believe the ones I recommended were pretty good, having read them and read Marx.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kid_Fiction",
            "body": "Jesus... the suggestions here will bleach your soul of anything approaching curiosity. Don't listen to these joyless apparatchicks ☠️☠️\n\nI would start on YouTube with Rick Roderick's lecture on Hagel (which is actually about Marx)... Beautifully simple, eloquent and immediately relevant to everyday life. Roderick is a West Texan talking to middle America at the end of the Cold War, he gets you.\n\nhttps://youtu.be/2MsNyR-epBM?si=f6qCkLed0r1nuiGz",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fun-Cricket-5187",
            "body": "Do not read Marx or any second international socialism FIRST. I guess you could read Kapital vol. 1 but it might be a little much, there is a lot of history to deal with. \n\nIf you find this small piece interesting, dm me and I will point you in the right direction.\n\nMax Horkheimer: *The Little Man and the Philosophy of Freedom*",
            "score": -6,
            "replies": []
        }
    ]
}