{
    "title": "Why did Marx start with the commodity?",
    "author": "Enkidarr",
    "subreddit": "Marxism",
    "rank": 164,
    "score": 44,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Marxism/comments/1hxs3ec/why_did_marx_start_with_the_commodity/",
    "id": "1hxs3ec",
    "selftext": "Marx famously starts his analysis of capitalism in Capital vol 1. dealing with the commodity, stating\n\n>The wealth of societies in which the capitalist mode of production prevails appears as an 'immense collection of commodities'; the individual commodity appears as its elementary form. Our investigation therefore begins with the analysis of the commodity.\n\nWhile the commodity is Marx's starting point, I have nonetheless heard it argued that one should instead read part eight on primitive accumulation first. Further, I've also heard it said that part one of Capital can be skipped entirely, as this section doesn't deal with the production of capital at all.\n\nA professor of mine argues for what he jokingly calls \"revelationary materialism\", that reading Capital in the order Marx had intended (as it is 'revealed') is a necessity, as his ordering of chapters follow a cohesive nature which gradually details capitalist production under a set logic.\n\nWhat do you think? Is the commodity the necessary starting point, or one which Marx arbitrarily choice?",
    "comments": [
        {
            "author": "DashtheRed",
            "body": "When Marx sits down to write Capital, he doesn't start by saying \"Right, so here is all of capitalism; let's deconstruct it and break it down into it's parts.\"  He does the exact opposite.  He says, look at this one thing, which is both seemingly simple yet deeply complex: the commodity.  This is the seed of capitalist production; the single-celled form of capitalism; the basis from which all of capitalism emerges and grows and permeates into all facets of human existence.  In the next chapter, Marx brings commodities to the market, where the process of exchange occurs (and where any object brought into contact with a market becomes a commodity), where the commodity form finds it's realization as an exchange value, and then goes on to examine how these things circulate and how money comes to function as the universal exchange commodity, and so on.  It keeps going for thirty more chapters because each one expands the scope of the analysis. Marx follows this path of the commodity, this path of capital as it spirals into larger and larger, and more and more complex systems, and how this logic goes to overwrite and dominate the entire process of human production, and by the end of the book Marx has arrived at all of human social existence.  And he does all this simply from beginning with this one thing -- the commodity -- by showing the conditions that create commodities and the conditions that bring them into existence. Commodities are the seeds of capitalism, and wherever they are allowed to germinate, they carry with them all of this same underlying logic of capitalist production, and if allowed to grow and multiply they ultimately reproduce all of capitalist society.",
            "score": 37,
            "replies": []
        },
        {
            "author": "prinzplagueorange",
            "body": "The first chapter of Vol 1 was the most heavily revised part of Capital. Marx started there for a reason. Michael Heinrich has an entire book dedicated to picking apart that chapter. One starts with the commodity because the mass production of commodities is one of the defining features of capitalist society. In fact, it's probably the best defense of the capitalist system: capitalism simply makes so much stuff. Unfortunately, that's bad news for the people who have to make that stuff.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Ill-Software8713",
            "body": "It was absolutely essential to his method because the starting point set the basis of one’s analysis/synthesis. From the commodity as a germ cell, the qualities of it necessarily lead to the basis of all other particulars under capitalism and the dominance of the commodity form over other pre-existing social formations.\n\nhttps://kapitalism101.wordpress.com/2014/07/21/abstraction-abstract-labor-and-ilyenkov/\n“If abstraction is just seen as the identification of general features then we have no choice but to be arbitrary in our abstractions. But if abstraction is seen differently, as identifying the essential nature of an object, as identifying the “relation within which this thing is this thing” as Ilenkov puts it, then we can be scientific about our abstractions.\nWhen we make an abstraction we want to select that aspect of the object which identifies its essence. Since the essence of things is in their relation to other things, we want to identify the essential relations which govern the object, abstracting away other non-essential aspects.\n…\nThis is a very different sense of abstraction that we are often used to. Here the abstraction ‘capital’ identifies the essential relation which makes all forms of capital possible, wether or not they share the same general features! The same is true with the basic abstract starting point of Marx’s theory: the commodity. As Ilenkov points out, Marx defines the commodity form very abstractly, even abstraction away money at first and just looking at the relation of one commodity to another. But this basic commodity-commodity relation is generative of the whole complex of social forms that exist in a capitalist economy. Even though some aspects of capitalism (credit default swaps for instance) are not the exchange of one product of labor for another this basic C-C relation is the logical and historical cell which is generative of the whole.\n\nThis way of abstracting gets us out of the arbitrary nature of old-logic where we chose whatever general features we wanted. Instead when we abstract we must identify the essential relation which defines an object, a relation that is generative of the class. This requires a very careful scientific approach to understanding how one form generates another, etc. “\n\nhttps://www.marxists.org/archive/pilling/works/capital/pilling4.htm#Pill5\n“Hegel objected to the Kantian method of arriving at concepts because it made it impossible to trace the connection between the individual and the particular. All objects not included in a class were set against those standing outside this class. Identity (conceived as a dull sameness) and opposition were placed into two rigidly opposed criteria of thought. The direction Hegel took in trying to overcome the limitations imposed by such rigidity of thinking led to far richer results, and it was a method which guided Marx throughout Capital.\nFor Hegel a concept was primarily a synonym for the real grasping of the essence of phenomena and was in no way limited simply to the expression of something general, of some abstract identity discernible by the senses in the objects concerned. A concept (if it was to be adequate) had to disclose the real nature of a thing and this it must do not merely by revealing what it held in common with other objects, but also its special nature, in short its peculiarity. The concept was a unity of universality and particularity. Hegel insisted that it was necessary to distinguish between a universality which preserved all the richness of the particulars within it and an abstract ‘dumb’ generality which was confined to the sameness of all objects of a given kind. Further, Hegel insisted, this truly universal concept was to be discovered by investigating the actual laws of the origin, development and disappearance of single things. (Even before we take the-discussion further, it should be clear that here lay the importance of Marx’s logical-historical investigation of the cell-form of bourgeois economy, the commodity.) Thought that was limited to registering or correlating empirically perceived common attributes was essentially sterile – it could never come anywhere near to grasping the law of development of phenomena. One crucial point followed from this which has direct and immediate importance for Capital. It was this: the real laws of phenomena do not and cannot appear directly on the surface of the phenomena under investigation in the form of simple identicalness. If concepts could be grasped merely by finding a common element within the phenomena concerned then this would be equivalent to saying that appearance and essence coincided, that there was no need for science.”\n\nhttps://www.marxists.org/glossary/terms/chat/index.htm#unit\n\nhttps://www.ethicalpolitics.org/ablunden/pdfs/The%20Germ%20Cell%20and%20the%20Unit%20of%20Analysis.pdf\n“So when Activity Theorists identify a relation or action or concept or artefact as the “germ cell” of a complex process, they mean that the relation is the simplest possible relation which will over time develop into the more complex process. It may be the first, historically, but not necessarily. The germ may not appear in pure form until later on, perhaps after a series of trials-and-errors. It is the simplest because it contains without any further addition the essential relation which will stimulate further development and stimulate interaction with other processes. Scientific discoveries are generally ‘germ cells’, but you never know right away that a given discovery is the germ cell.\n\nhttps://www.marxists.org/archive/ilyenkov/works/abstract/abstra1f.htm\n\nFinding the simplest unit that contains characteristics of the whole is necessary to a thorough and systematic study which will reveal new germ cells through logical necessity rather than arbitrary selection of traits.  Marx couldn’t reasonably find the concepts he employed if he began with something like unempircal/suprasenous as value or money, an appearance of value.",
            "score": 6,
            "replies": [
                {
                    "author": "fugglenuts",
                    "body": "A necessary distinction is between general (or analytical) abstractions and determinate abstractions. Wealth is a general abstraction; it is found in every society. Value is a determinate abstraction; it’s a social form that is historically specific. Conflating general and determinate abstractions leads to fetishism, eg thinking capital is wealth as such and thereby found in every society.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ill-Software8713",
                            "body": "Indeed, and this comes from only identifying abstract/general universals and not identifying what properly distinguishes a thing or makes it a particular thing.\nSo there is continuity between us and other apes having shared a common ancestor but if we don’t note essential differences, then we haven’t a concept of what is markedly human.\n\nThe commodity is interesting in having existed prior to capitalism but only becoming universal under capitalism.\n\nhttps://www.marxists.org/archive/ilyenkov/works/articles/universal.htm\n“The real case-history of economic (market) relations testifies, however, in favor of Marx who shows that the “form of value in general” has not at all times been the universal form of the organization of production. Historically, and for a rather long time, it remained a particular relation of people and things in production although occurring haphazardly. It was not until capitalism and the “free enterprise society” came into being that value (i.e., the market form of the product) became the general form of inter-relationships among the component parts of production.\n\nSimilar transitions, of the “individual and accidental” into the universal is not a rarity, but rather a rule in history. In history – yet not exclusively the history of humanity with its culture – it always so happens that a phenomenon which later becomes universal, is at first emergent precisely as a solitary exception “from the rule,” as an anomaly, as something particular and partial. Otherwise, hardly anything could ever be expected to turn up. History would have a rather mystical appearance, if all that is new in it emerged at once, as something “common” to all without exception, as an abruptly embodied “idea.””",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "fugglenuts",
                                    "body": "Patrick Murray’s “Marx’s Theory of Scientific Knowledge” is a good source on this topic, if you’re not already familiar. \n\nThere’s a nice section on vernunft and verstand thinking that you/Pilling allude to in the above comment. \n\nMurray’s book is out of print and hard/expensive to find. I haven’t been in touch with him in awhile but I think it’s supposed to be reprinted soon.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "spiralenator",
            "body": "I think your professor is right here. Marx very intentionally builds on prior concepts.   \n  \nThe very first paragraph explains this:   \n  \nThe wealth of those societies in which the capitalist mode of production prevails, presents itself as “an immense accumulation of commodities,”[^(\\[1\\])](https://www.marxists.org/archive/marx/works/1867-c1/ch01.htm#1) its unit being a single commodity. Our investigation must therefore begin with the analysis of a commodity.",
            "score": 8,
            "replies": []
        },
        {
            "author": "fecal_doodoo",
            "body": "Because its the one thing he knew needed to be abolished, the very basic building block of capitalism which his critique relied, as well as his theory of commodity fetishization and subsequently his theories of alienation tie in to this very nicely. No socialist experiment has really been able to abolish the commodity form. The relationship between commodities obscures the relationship between people.  It is a necessary step, one of the final steps to communism and so thats where marx starts.",
            "score": 3,
            "replies": []
        },
        {
            "author": "habitus_victim",
            "body": "People have answered your question about why it's so important that Marx starts with the commodity. Ernest Mandel explains it in his introduction to the penguin edition too. \n\nSo I'll talk about starting with part 8. \n\nAs far as I know, this comes from political economist Harry Cleaver. The idea behind it is to provide the historical context of the emergence of capitalism. In particular, it's to prime the reader not to forget, as they systematically come to understand the \"laws of motion\" in Capital, that the real capitalism in the world is always \"incomplete\", contested, and violently dispossessing people who invariably resist privatisation of the commons. \n\nI like Cleaver, but you can probably do without this approach especially if you already know the history (and indeed the present) of \"primitive\" accumulation. If you want to follow Cleaver's study guide, do as he suggests and start with part 8. If you want to start with part 8, at least be aware of Cleaver's study guide. It is unlikely to spoil the \"revelation\" because reading this part of vol1 first is a lot more like reading a separate historical preface than it is like skipping to the end.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JonnyBadFox",
            "body": "Hegel used pure *Being* as his starting point. If you read the first pages of his phenomenology (after the introduction) it sounds very similar to the first page of capital vol. 1. But don't ask me why Hegel used being as starting point, that's over my head😇",
            "score": 2,
            "replies": []
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "Karl Marx did not start with the commodity. \n\nHe started with the materials conception of history.\n\nYour real question is why did he start Capital (1867) with the commodity. Below is the best explanation I think you’ll find.\n\nWSWS\nTwo Hundred Years Since the Birth of Karl Marx\nNick Beams, 31 October 2018\nhttps://www.wsws.org/en/articles/2018/10/31/marx-o31.html\n\n… The materialist conception of history is concisely summed up in the famous Preface to the Critique of Political Economy written in 1859:\n\n“In the social production of their existence, men inevitably enter into definite social relations, which are independent of their will, namely relations of production appropriate to a given stage in the development of their material forces of production. … At a certain stage of development, the material productive forces of society come into conflict with the existing relations of production ... with the property relations within which they have operated hitherto. From forms of development of the productive forces these relations turn into their fetters. Then begins an era of social revolution.”\n\nHaving elaborated the materialist conception of history, the task was now to apply it to the capitalist economy, to discover the specific laws of its development. But such an analysis of this, the most complex of all forms of socio-economic organisation, presented great theoretical challenges.\n\nThese were concentrated in the question of where to begin. Should one start with technology and the development of the productive forces? Or population, or, breaking that down, with the classes into which the population was divided? Or, perhaps with capital, with money and finance? … The list goes on.\n\nMarx’s Grundrisse\n\nMarx discovered the starting point in the work he conducted in a matter of a few months during 1857-58. He was driven back to work on political economy by the eruption of a major economic crisis, which, he believed, would produce a new revolutionary upsurge after the defeat of the 1848 revolutions.\n\nIn order to try to prepare this movement, he worked frantically day and night. The results can be found in what is now called the Grundrisse, the rough draft for what was to become Capital.\n\nThis work is very much a voyage of discovery. The starting point of the Grundrisse is money. Marx, therefore, subjects the analysis made by the Proudhonists in France to a detailed critique. The Proudhonists advanced a form of petty-bourgeois socialism, based on small artisans and craftsmen, which held that the exploitation carried out under capitalism, as well as its crises, could be overcome by reforming the monetary system, while retaining commodity production, that is, the production of goods for the market.\n\nThere was, however, a fatal flaw in this approach. Money was not some kind of technical device that had been invented, and so could be replaced by another mechanism, or a reformed monetary system. It arose out of the system of commodity production itself, which the Proudhonists proposed to retain. To do away with the existing monetary system, while retaining commodity production, would be like getting rid of the Pope without abolishing the Catholic Church.\n\nAfter dealing with money, Marx examines the question of capital, and at the end of 880 pages of analysis arrives at the starting point.\n\n“The first category in which bourgeois wealth presents itself is that of the commodity.” This is preceded by a note: “This to be brought forward.” A short sentence, but a turning point in human understanding.\n\n…",
            "score": 2,
            "replies": []
        },
        {
            "author": "interpellatedHegel",
            "body": ">*\"It seems to be correct to begin with the real and the concrete, with the real precondition, thus to begin, in economics, with e.g. the population, which is the foundation and the subject of the entire social act of production. However, on closer examination this proves false. The population is an abstraction if I leave out, for example, the classes of which it is composed. These classes in turn are an empty phrase if I am not familiar with the elements on which they rest. E.g. wage labour, capital, etc. These latter in turn presuppose exchange, division of labour, prices, etc. For example, capital is nothing without wage labour, without value, money, price etc. Thus, if I were to begin with the population, this would be a chaotic conception of the whole, and I would then, by means of further determination, move analytically towards ever more simple concepts, from the imagined concrete towards ever thinner abstractions until I had arrived at the simplest determinations. From there the journey would have to be retraced until I had finally arrived at the population again, but this time not as the chaotic conception of a whole, but as a rich totality of many determinations and relations.\"*\n\n(*\"The Grundrisse\"* \\- Karl Marx)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Supremedingus420",
            "body": "Marx chooses to start with the commodity in chapter 1 because his analysis and argument about the nature of commodities in a capitalist society is the framework and structure to his argument for where surplus value is derived from. First you start with all commodities and what the have in common then you talk about the special unique commodity of labor through the same lens. I can’t imagine his argument on the origins of surplus value would make as much sense without the chapters preceding it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RestInThee3in1",
            "body": "Have you heard of the book from 2014 that argues that Marx's Capital is the materialist rendition of Hegel's Science of Logic? Hegel begins with pure begin, Marx begins with the irreducible magical concept of capitalism, the commodity. (Sorry, I forgot the title of the book.)",
            "score": 1,
            "replies": [
                {
                    "author": "Ill-Software8713",
                    "body": "[https://www.ethicalpolitics.org/ablunden/pdfs/hegels-theory-of-science.pdf](https://www.ethicalpolitics.org/ablunden/pdfs/hegels-theory-of-science.pdf)\n\n\"*Marxists have long recognised that Marx made use of Hegel’s Science of Logic in his political economic studies and the writing of Capital. However, none have been able to explain how Marx used the Logic in Capital, as I demonstrated in my 2025 Volume, The Capital / Logic Debate.*   \n  \n***The chief error of all these attempts generally was in presuming that Marx used the Logic as a metaphor or a model for political economy.*** *As a result they looked for a homology or “likeness” between parts of Capital and parts of the Logic. But logic is a science which has no positive content. That is why Hegel began the Logic from an empty concept, Being, ensuring that no content is smuggled into the logic either by way of axioms or unacknowledged content implicit in the starting point. Political Economy, however, like all the natural and human sciences, has a positive content. Both Hegel and Marx were well aware of this obvious fact. As Marx saw it, the content of Political Economy is abstract human labour. Human labour, whether abstract or concrete, is not nothing. The whole of Capital depends on how Marx formed a concept of abstract human labour.*\"\n\nThe method of Hegel is indispensable, but trying to apply the system he created in his logic to another subject matter is to misconstrue the applicability of what he was doing.\n\nLike trying to recreate a notation system with F# and Bb onto something other than the actual notes that they represent. Hegel finds logical categories for how human activity emerges and comes to know itself, but it isn't the same means of empirically investigating and critically appropriate concepts in a specific science.\n\n  \n[https://www.marxists.org/archive/vygotsky/works/comment/vygotsk1.htm](https://www.marxists.org/archive/vygotsky/works/comment/vygotsk1.htm)\n\n\"*In addressing the genesis of thought and language in human individuals, it would have been very tempting for an admirer of dialectics to seek a solution in some kind of reworking of Hegel’s genesis of the Notion in his Logic. But heeding Engels’ advice, Vygotsky utilised the dialectical method, and did so consistently materialistically. Whereas Hegel provided many insights in his analysis of the history of philosophy on the basis of the system of Logic, and his system continues to provide a valuable approach to the critique of philosophical method, the result of Vygotsky’s application of the dialectical method to the genesis of thought and language in the development of the individual human being is a series of concepts quite incommensurate with the stages of the Logical Idea which populate the pages of the Logic.*\n\n***And so it should be! Hegel advises that: “... this progress in knowing is not something provisional, or problematical and hypothetical; it must be determined by the nature of the subject matter itself and its content”****.*\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Relative_Arachnid413",
            "body": "Marx starts with the end, the wealth. He tries to analyse the wealth of nations. This is the ultimate goal. The starting point, the commodity has set its end point, the wealth. The whole capital the way to the wealth of nations, how it is constituted. Let’s not forget that Marx wanted to continue with Capital, to write a book about the state and world commerce. But he wasn’t able to do so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theInternetMessiah",
            "body": "Many years back I too asked this sub about why Marx chose the commodity as the starting point of his analysis from which to depart. I remember getting a lotta insights but no clear or definitive answer. The short answer is that nobody knows because Marx never explicitly told us but there’s a lot of good reading to do down this line of inquiry, so I hope you have fun :) \n\nRegarding the idea of skipping the first part of capital altogether, I’d strongly object. It may be a bit tedious at times but Marx put it there in the beginning on purpose lol. It forms the conceptual bedrock of the whole ensuing analysis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TryptaMagiciaN",
            "body": "Marx does a great job. And his works pairs well Schopenhauer. The basic commodity is will. That we experience or feel the commodifcation ourselves and others to be wrong is the love that frees it. It is in our associations through others in our work that gives rise to anything and everything worth discussion. That we have proceeded for so long to commodify one another is the reason his work is emancipatory. His articulation though so heavily focused in material in doing so brings the material to the level of divinty aka make materialism \"matter\" to people. He puts us in a meaningful context in our given environment that has real utility in freeing us quite literally. It was the commodity making, the turning of the world as matter into an idea. He wants to bring us back to matter, just like Schopenhauer is getting at in Will and Idea vol. 2 appendices 4 and 5 specifically but the whole book in general. Which is why I think Jung (not as most dinguses understand him and he shares this problem with Marx largely because readers of either seldom do their damn job and go read Kant and Schopenhauer but I digress), who is in many ways a therapeutic application of Schopenhauer can provide oneself with the access of will, the willpower, the sense of self, necessary to actually apply Marx. \n\nThe reason marxism worked so well in the east comparatively, as both Schop and Jung make quite clear, is that their culture's leant theirselves to the interdependence of all the object is the environment. They were closer to feelings that Marx has to work so hard to draw out in the western man and bring him to action so that he can free his will which has become so blindly wrapped up in. \nWe live in time and place where the religious life of humanity is wrapped up in an exchange of labor for currency or an \"idea\". We are wrapped up in an idealism as every people of every time are, and he want to take us beyond any given time and into the historical. Project us beyond the immediate so as to better understand what exactly is going on to get out of the idea and into the material. \n\nSo can Madonna say we are living in a material world and yet heaven is a place on other and we are material girls. Perhaps that is why woman has been left out of the constructed world of idea in our histories. Men of history so often take great pains to exclude the real cotributions of women. Why we commodified her and why, as they say prositution is the oldest profession. We even see currency exchange for sex in other primate lab experiments. In so many creatures this activity has reflections. But we aggrandize it like no other and terribly subjugate our fellow humans to our desire which to a clear mind is just another idea. How strange it is that the work of species continuation should include such euphoria in its act. What a strange damnation we were led too when we had no choice. Marx is a revolution that says let us finally open our eyes and assert our selves. And the most direct representation that everyone can immediately grasp in language is our place as the laborer or worker that produces all values within a system. The values that are later assigned in someway and lead to the first thing \"commodity\". But really the first thing is the psychogical attitude. To ask how such a book came to be we would have to ask Marx why he wrote it. Im sure he would provide all sorts of material events and circumstances but ultimately he would acknowledge that he felt/intuited that he must do so. It was Marx's personality, his psyche, his character which led him to act. So when we look around and wonder why we struggle to apply Marx we are ultimately looking for our answer in our own character. And Marx leads us no further than giving it it's external grounds. We have to meet his work and there isn't an established field of psychology that does this while maintaining a certain external vision. And it couldn't because it is focused on those inner blurs on the window through which we read the words Marx left us, to what extent we can feel Marx intended us to as a reflection of that what he himself was feeling. That is why people enjoy Marx, he leaves that task wholly to us as it is our own responsibility and focuses on what is within his limits to express. He knew he was not a psychotherapist. Here is the external solution, you all must find the internal one so that the effects can be realized here in the material world.",
            "score": -1,
            "replies": []
        }
    ]
}