{
    "title": "Would Marx Condemn Luigi Mangione?",
    "author": "Adventurous_Ad_2765",
    "subreddit": "Marxism",
    "rank": 157,
    "score": 76,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/Marxism/comments/1hzs0mr/would_marx_condemn_luigi_mangione/",
    "id": "1hzs0mr",
    "selftext": "Many know that Marx discouraged the 1971 Paris Commune from revolting before the revolution becauss he didnt think it would succeed. Yet he still supported it as a valuable revolutionary act by the proletariat when it happened anyway. Today, however, many leftists seem to reject similar actions that aren't \"perfect\" in favor of more ideologically pure strategies even after they've already been done, unlike Marx. For instance, solo acts like those of Luigi Mangione are often condemned, but Marx himself didn't hold to perfectionism when it came to revolutionary struggle. I even see some socialisra saying this which suprised me which is why I thought I'd ask: Why do you think modern leftists reject imperfect revolutionary actions despite Marx having embraced them?\n",
    "comments": [
        {
            "author": "linuxluser",
            "body": "Was Mangione part of an organized group and a plot to advance the interests of the working class? It doesn't seem so.\n\nThere's nothing to condemn or condone from the perspective of strategy. It was a spontaneous act by an individual who lashed out. That is to be expected and we should continue to expect more in the future.\n\nIf there was a working-class movement in the USA which was sufficiently organized and could take advantage of the moment, then the analysis changes. We would then discuss whether it is strategically in our interests to associate a random act of violence with an organized movement. Likely it wouldn't be.\n\nIt's not about being perfect. No struggle can be perfect, though I understand what you mean about some leftist tendencies being idealist in their formation. The general issue is that a true worker's struggle lasts a very long time and we have to be careful not to take strategies that seem good in the short term but are disastrous in the long term. And, generally, terrorism as a primary tactic is disastrous in the long term. The main reason is because a socialist revolution needs to be a mass revolution. And terrorism divides the working class and allows the state a golden opportunity to turn the masses against a revolution and clinger even more to the state for protection.\n\nIn short, if we were to promote the acts of Mangione and encourage more, we are committing the error of adventurism. And that's assuming we have such a platform that the workers pay attention to in the first place, which we don't yet in the USA.",
            "score": 115,
            "replies": [
                {
                    "author": "Strawberry_Not_Ok",
                    "body": "> And, generally, terrorism as a primary tactic is disastrous in the long term. The main reason is because a socialist revolution needs to be a mass revolution\n\nI disagree with this statement, but then again, different ethnic groups might respond to things differently. As a black person who grew up reading both Black and Western history, some major difference is that Westerners/ Europeans write history starting from the end, while in Black history, it starts from some unknown person. \n\nIf a history book is written about the Civil Rights Movement, for example, a Western writer would start the story with MLK. A Black writer would probably start with Mamie Till. So to you, a revolution starts towards the end, but you erase the history that led to the big event. \n\nAnother difference is that Western literature focuses on happy endings, and a win is seen as a win lose situation.  This might be why they erased the effort of the few who died before the revolution began. \n\nLastly,  Western protagonists have to be seen as pure, thus why you used terminology like terrorist because the idea of a hero being a terrorist is incomprehensible in the West. \n\nIn the 1980s, for example, there was a worldwide understanding that South African apartheid was wrong, but at the same time, Nelson Mandela was seen as a terrorist by the west.  I'm not sure if this is an ethnicity issue or a social control success story. \n\nAnyway, in high school we had to do a short story book where the authors were Muslims or Arabs on different social political issues.  The stories had no happy ending,  but they showed the impact that one person can have on future generations.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "linuxluser",
                            "body": "Thank you for bringing out a lot more of this discussion. And appologies for the length of this reply. It's not to defend myself. Rather, it's because I completely agree with you but feel that I have to be more explicit about how it is that I agree.\n\n---\n\nI was being pretty general in my response and I definitely glossed over many things. Among those was the term \"terrorism\".\n\nStrictly speaking, terrorism is simply a specific combat strategy, often employed by the side that has lesser resources available to it (usually the victims of colonialism or emperialism in the modern context). That is, the object isn't to out-right defeat the enemy in a military conflict because that's not possible, but to strike enough fear in the population that the enemy must protect in order to make things difficult politically for the enemy.\n\nTerrorism, in this strict definition, can be effective. The example I tend to use are the suffragettes in England in the late-19th-early-20th century, who bombed public areas, often killing many innocent people, to raise the level of seriousness of the movement. And they won! Women got the right to vote and several other rights. And today people of English think it is \"backwards\" to see women as non-equals in the sight of the law!\n\nAnd there are bunches of other examples.\n\nThere's another, newer, definition of \"terrorism\" now too. It's a definition created by the empiral core (the \"West\") because they desperately need to control the narrative. This definition can't be found in textbooks because it's extemely inconsistent. This definition, practically speaking, is just any military force that goes against the emperialists' wishes. That is, anybody who fights back against oppression.\n\nThe emperialists create underground factions and fund them to do crimes against humanity. It is only when those factions turn on the emperialists and go against their interests that they are, then, given the label \"terrorist organization\". Nothing actually changed in the group's make-up, strategy or even goals. The only thing that changed was whether or not they were useful to the empirialist forces.\n\nIn my answer above, I was not using the emperialist's definition of \"terrorism\". Mostly because that definition is complete nonsense and I couldn't use it seriously even if I wanted to due to its wild inconsistencies.\n\nBut here we have to be careful. Most \"normies\" aren't going to separate the two ideas. Most normies aren't going to have this awareness. Most normies are going to believe that whatever the state calls a \"terrorist organization\" is something that is \"bad\" (even if they can't articulate why). We are dealing with a very high level of propaganda and state-run narratives.\n\nWhat I'm saying is that a strategy that out-right disregards this factor (the state's manipulation of the facts) and goes ahead and does some ugly things anyway because they think they're right anyway is a losing strategy for the formation of a working-class mass movement.\n\nIn the Civil Rights movement, which you've brought up, for example, this was the reason for part of it being non-violent. It wasn't entirely non-violent, of course, but there was a strategic reason for the non-violent component. The movement needed a \"human side\" that white people would actually emphathize with. It needed victims and it needed white people to see those victims oppressed. What that did was force the contradictions of racisms within the white society to heighten, forcing the state to deal with it.\n\nIn the North, you had the terrorism tactic. You had Malcolm X and others. They were clear that if violence was the only language the systems of oppression understood and that they were ready to speak that language. But the Northern part of the Civil Rights movement and the Southern parts of it were not acting non-strategically. They knew what they were doing.\n\nWhite society got squeezed between the two. White society's contradictions got heightened so much so that they had to make a decision. And, importantly, that decision was already spelled out between the North and the South sides of the movement: either give in to the demands of the non-violent part or be ready to go to war with the violent part. It was clear from the very beginning which would be chosen.\n\n---\n\nTo be more clear, a communist movement should not be in the business of moralizing this or that strategy and picking out of that. This is pure idealism and something that is doomed to fail the movement. So I would not advocate that. A communist movement is to always analyze their context through dialectics to understand which contradictions of the state and power would best serve the interests of the working class when illuminated to full brightness. Strictly speaking, that means no strategy is off the table. What is more important is how something fulfills the larger strategy of advancing workers to power.\n\nSo my advice above to not use terrorism comes from my view on the current analysis of the working class within the empiral core. If the idea is to win over folks that are severely under-developed in their class consciousness, terrorism won't do that. It will always backfire. And in many places right now, this is what we're dealing with.\n\nIn some other context, say the exploited periphery of global capitalism (the \"global South\"), my argument likely breaks down. There you have the contradictions laid bare. There you have the enemies clearly outlined and the level of exploitation is great. There you would employ any and all methods that rally the masses together to fight off their oppressors.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "Thank you for your detailed explanation, I see your point. I assumed that anti-bourgeoisie terrorism was benificial as long as it didn't harm the civilian population because it pushed the Overton Window to the left and the bourgeoisie are essentially modern day lords so it doesn't count as a civilian death.\n\n I realize now that terrorism could also strike fear in the majority even it was unintended and hurt collective action rather than normalizing it. \n\nHowever, isn't it possible that the reason the Overton Window in the US has moved to the right is partially related to the fact that the left has been so careful not to be portrayed as \"extremists\" who will cause disorder? Meanwhile, the right is allowed to freely do so without fear. \n\nYou're right, we should avoid short term solutions. But isnt it possible to say that Luigi's solo action could have outbalanced the material he gave to the right to sow fear? Especially considering many companies changed their policies after the murder which showed the public that voting isn't the only option?\n\nIf not that's okay, that would explain why some condemn it.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "linuxluser",
                            "body": "The overtone window concept is not Marxist. It is, at best, a bad description of what Marxists would call \"consciousness\". Plausibly it's synonymous with the mass line.\n\nWe're not trying to push the masses left or right. We're trying to raise the level of consciousness of the working masses so they are aware of their position inside of the capitalist system. Sometimes that will mean pushing a \"left\" agenda but other times it will mean pushing a \"right\" agenda. That is, the struggle for socialism sometimes looks liberal and sometimes looks conservative. We have to reject these bourgeois concepts (though, confusingly, the terms \"left\" and \"right\" don't always refer to the bourgeois concepts of the terms and it depends on who you are reading ... but here, I really mean the most popular usages of the terms, such as in the overton window concept, which is bourgeois).\n\n>isn't it possible that the reason the Overton Window in the US has moved to the right is partially related to the fact that the left has been so careful not to be portrayed as \"extremists\" who will cause disorder? Meanwhile, the right is allowed to freely do so without fear.\n\nNot exactly. This is a very long discussion. But my short summary is that I would blame the leadership of communist/socialist orgs before anything else. If the historical task of a communist party is to lead the workers towards a revolutionary stance against their oppressors, we have to accept the fact that these communist parties have failed to do this. And we have to critically analyze why this was the case and correct it.\n\nThe right in the USA is free because the Democrats fight against any opposition from the left. The Democratic party is what plays defense to allow the Republicans the freedom from genuine opposite nary forces. They work as a team to ensure the fullest suppression of revolutionary forces.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aCultOfFiction",
            "body": "I think Marx would at least see his action as a validation of his ideas. As a symptom of the contradictions of capitalism and a small example of the kernel of class consciousness appearing in one's mind. The 'rejection' is only to the idea that this one, isolated action would hold any revolutionary potential for greater society. Just my opinion.",
            "score": 60,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "I see, that makes sense. I suppose that's fair, obviously Magione's act held less potential than the revolutions Marx spoke of and it can definitely be argued that it did not hold any. I assumed the argument before was that his actions did not hold potential just because they were solo; not that they didn't hold potential because the solo terrorism aspect outweighed the benefits. \n\n Thank you for the explanation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SisterPoet",
            "body": "Given Marx's critique of Bakunin for using these very same practices, he probably would not care. Likely making fun of it in passing to demonstrate how vulgar the current thought leaders are in their understanding of politics. \n\nYou should rethink your entire idea of \"revolutionary struggle\" if you think killing a CEO has any grander significance for the communist movement. Who cares about these murders? Former Bernie Sanders supporters and Trump supporters. Media heads then pretend to be \"shocked\" at the violation of public norms, creating a feedback loop that justifies mistrust and devaluing of former mainstream media for not knowing the common white person's struggles. \n\nYou should be at the stage where you're above caring about social media trends or at least be able to analyze basis of class sympathy for the act and what it says about current tech fascist movement and its ideology.",
            "score": 53,
            "replies": [
                {
                    "author": "NikiDeaf",
                    "body": "He criticized Bakunin but he also had a big soft spot for People’s Will (Narodnaya Volya) revolutionary organization. Hardly a youthful indiscretion either, People’s Will was active in late 1870s/early 1880s and Marx died in 1883.\n\nThe actions of one man with a gun ain’t gonna change shit when it comes to our healthcare system. Any reasonable person, regardless of political affiliation, could tell you as much. But the reason why such acts continue to garner attention & sympathy (if not outright support), even from those like Marx who usually look upon such “revolutionary gymnastics” with a great deal of skepticism, is because they represent injustice being ANSWERED, in however small, inconsequential or isolated a way it may be.\n\nAs much as many would prefer to believe that emphasizing the building of a class-consciousness worker’s movement & subsequent development of a revolutionary party, blah blah blah, should be enough to satisfy those who are angry at the private health insurance industry, painting the sidewalks red with the blood of CEOs will continue to have a certain enduring emotive appeal I think, no matter how pointless or even counter-productive it may be.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "When I said this, I didn't really think of it as social media trends since I don't use any and barely even used reddit until two weeks ago to connect to this sub reddit. I just assumed that the more the public hears that these things are possible, the more the Overton window is pushed. \n\nIm sorry if I came across as only focusing on superficial Marxism. I don't believe this is some super grand political-changing action; I believe it was a failure. However, if I could choose to make it happen or not happen if I had a time machine: I'd choose to not undo it despite it's miniscule influence.\n\n But I will do as you say and look more into analyzing the basis of class sympathy for the act as you said because I understand the harms of it are important to take into account when trying to create a balanced picture.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gertsky63",
                    "body": "I don't think he would make fun of a young man taking out his rage at a big corporation in a naive way. He would of course reserve his greatest sarcasm and irony for any political organisation trying to lionise an act of individual terror to cover up for its own failure to advance a revolutionary strategy. But there is a big difference there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "orpheusoedipus",
            "body": "I think Marx would be a materialist and look at our current conditions. This should not be our main strategy but this act has spurred the dormant population into talking about the current issues and has placed class into the mainstream. Marx wouldn’t say this is how we achieve revolution but would see the value in our current moment given how alienated people are from the class struggle itself. Luigi wasn’t a Marxist and didn’t do anything Marxist, he acted in an individualistic way in line with his petty bourgeois class. However, it would be seen as a net positive given our circumstances and outcome but heavily critiqued by Marx as an act of individual act of petty bourgeois violence rather than engaging in class struggle.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Own_Zone2242",
            "body": "The real question is: “should we?” \n\nThe answer is no, this single act has inspired more class consciousness than any other in the last decade. \n\nWe don’t need to wholeheartedly endorse or replicate his actions, but we should definitely strike while the iron is hot and radicalize as many people as possible with this.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mother_Hall_8650",
            "body": "People should stop assuming Luigi Mangione is guilty. Looking at details of the case & the history of the national security state, what the CIA & the FBI among other institutions have done in the past, as well as other recent events, it is possible that it is another op. Resembles a lot the Sirhan Sirhan case, recommend Lisa Pease book & interviews about the RFK plot.",
            "score": 9,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "I was thinking of that as I wrote this post, I'll look into those sources. When you say it is another op, do you mean that it was one of their artifical creations or another person who did the shooting.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Mother_Hall_8650",
                            "body": "The most likely scenario I see is that he is a patsy, I doubt he just decided to go after some random CEO, also doubt he is an asset or agent. There are inconsistencies with the timeline in the complaint document and clearly with the suspect pictures, among other weird details and coincidences.\n\nRecommend the multi episode conversation with Lisa Pease on NWJ podcast.\n\nOther important details are Brian Thompson lawsuits or the fact that he was not the main CEO because UHC is subsidiary of United Health Group and weirdly that day walked without security after supposedly receiving threats, according to his ex wife.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TwoFiveOnes",
                    "body": "I am more than open to the Sirhan Sirhan stuff, but I have a fundamental problem which is that I don’t believe that hypnotism is real. Maybe I’m wrong about that, and I do want to understand, but I really just can’t be brought to believe in it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mother_Hall_8650",
                            "body": "It is very real, I’ve firsthand corroborated that. Listen or read to Lisa Pease, particularly the multi episode conversation on NWJ podcast. She mentions some examples like a tv show based on a live show where a guy was set to shoot and the evidences in the Sirhan Sirhan case speak for themselves.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "scottishhistorian",
            "body": "Marx recognised that violence was an inevitable aspect of revolution. As a result, I think he would understand it and respect Luigi's choice. Luigi chose to sacrifice his own life to make a point. Luigi is an example of the alienation caused by a rampant capitalist society as he, a very intelligent individual, was reduced to a mere cog in a system. In taking this action, he may have saved some lives, as some healthcare insurance companies said they would make policy changes. However, this will only last while it's on the front pages. \n\nMarx would recognise the pointlessness of the act as a result. We are not ready or capable of Communist revolution right now. The capitalist system has too much control over everything. Therefore, this was a wasted sacrifice. He would probably say that Luigi could have made more of an impact if he had been a politician, activist, or teacher. He could have inspired others. He would not condemn him but would be saddened by the outcome. Luigi could have achieved so much more if he had channelled his rage in a more useful way. \n\nThe thing he would ask is, what did Luigi expect from this? Did he expect or want his act to inspire revolution? Is he a communist? Or was he just a guy who lost a family member because of some AI algorithm that decided they weren't worth saving? \n\nThere are millions, if not billions, of Luigis out there. Who have been ignored and alienated by systems that don't care about them. Marx knew this 180 years ago. He would have tipped his cap to one of the few brave ones that decided to do something about it. Even if it was a pointless act.\n\nEdit: \"Leftists\" are so fragmented right now. We don't know what we are fighting for and spend more time attacking one another than anything else. No wonder we can't decide what a revolutionary act is. I, personally,  don't know if this act was a revolutionary one. Whilst I think he wanted to make a point to the rest of us, I think this was a personal act of revenge.\n\nFurther, most leftists aren't Marxists, as they have been educated to reject Marxism. We are also too focused on our own grievances to put those aside and cooperate for a goal that might not immediately solve our individual problems.",
            "score": 3,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "Thank you for this explanation. I better understand the Marxist position now, and yes I noticed they are very fragmented. When I say leftists, I primarily am referring to those who are left of Bernie Sanders, who I'd argue should be considered center right since that appears to be the truth. \n\nI assumed Marxists would say it was to be condemned because Mangione didn't go through the proper measures regardless of how much revolutionary wider potential it spread because it was against Marxist methods. Now I understand that's not the case.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "scottishhistorian",
                            "body": "You're welcome! I can't pretend to be an expert, but I've read a decent amount, so I hope I've given a reasonable interpretation. It is really difficult to define what a \"leftist\" is these days. I've not kept up with Bernie's stuff recently, so that's disappointing to hear, I was impressed by him. \n\nWell, if you take the time to consider the likelihood of success or failure before acting, then you might lose the opportunity. So, if we knew that Luigi was a Marxist, we'd probably respect him for risking everything without knowing if it'd work out. If we look at historical events, lots of key revolutionary moments were spontaneous and extremely risky. \n\nFor example, Lenin's trip to Russia, from Finland, in 1917 after the February Revolution. He could have been imprisoned, killed, or worse. It nearly stopped the entire movement in its tracks because most people assumed he'd agreed to be a German spy. (The German Government gave him an armoured train.) Even some of his allies didn't trust him. However, he knew he had to take the risk, or it would definitely fail. Further, Lenin gave a speech after the October/November Revolution celebrating the fact that they'd lasted one day longer than the Paris Commune. They were certain that they would be defeated in the ongoing Civil War but kept going anyway. \n\nAttempting to inspire revolution is risky, and you've got to take the opportunities as they arrive, I'm hoping we get to find out what Luigi's motivations were for carrying out the assassination tbh but I don't know if we will.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EctomorphicShithead",
            "body": "> many leftists seem to reject similar actions that aren’t “perfect” in favor of more ideologically pure strategies \n\nIt isn’t a purity issue, it’s a basic organizing principle. Experience shows that assassinations only invite greater repression. We aren’t interested in gambling with the lives of our class, we are interested in building our organized power across it.\n\n> solo acts like those of Luigi Mangione are often condemned, but Marx himself didn’t hold to perfectionism when it came to revolutionary struggle. \n\nLuigi Mangione is a confused bourgeois scion. I’m not of the mind that one must be strictly proletarian in order to contribute to mass struggle, but this particular individual is not even in the universe of class solidarity. I will agree that his act struck a mass chord which is providing a useful reading on degrees of latent class consciousness, but there has been no new strategic development. It’s merely the latest instance of individualistic violence gesturing to a small part of what the broad spectrum of progressive thought has been saying for decades.\n\n> Why do you think modern leftists reject imperfect revolutionary actions despite Marx having embraced them?\n\nI think you need to keep reading, starting with Lenin in 1901.",
            "score": 9,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "Thank you, this makes sense. I assumed people condemned his actions strictly because they were solo; not because them being solo actually led to such low revolutionary potentional that it doesn't really matter to socialists. I never thought his actions would be super meaningful, just a smidge. I'll take your advice and read more Lenin after State and Revolution is done.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "EctomorphicShithead",
                            "body": "> I’ll take your advice and read more Lenin after State and Revolution is done.\n\nGlad to hear you’re already there! What makes his earlier works so valuable is the painstaking attention to analyzing conditions, to developing effective strategy and tactics in response to and in line with, social and historical processes as they are unfolding and evolving in response to conscious struggle, among the powerful currents of other social forces.\n\nThe various stages of social and political development in pre-revolutionary Russia offer a wealth of essential insights for those of us in modern pre-revolutionary societies; how and when to engage in and balance “illegal” (underground) action with “legal” (public) action, how to operate within compromised institutions, how to effectively conduct mass agitation, education and organization, when to move boldly, when to retreat, etc.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jrc_80",
            "body": "Marx would’ve see the act as individual & terroristic. Not conducive to building, effectuating and sustaining a class revolution. If the individual act; however, pushes the contradictions of the capitalist system to the fore of collective discourse & drives class consciousness, than of course it could be useful. More plainly, Marx wasn’t too keen on individuals doing anything individually.",
            "score": 2,
            "replies": []
        },
        {
            "author": "coolgobyfish",
            "body": "Luigi sounds like one of the Socialist Revolutionaries in Russia/Ukraine in 1900s.  They believed in personal terror and shot a lot of imperial officials.  Lenin and others were against this type of behavior.  While murdering these criminals is a good idea, it doesn't change the system. Another CEO will take his place.  P.S.  Personally, I think Luigi is a fall guy.  The real killer is clearly a professiona hitman (agent 47 type)",
            "score": 2,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "You're right, now that I thibk about it Lenin likely would. I saw Mangione's actions as a watered down Marxism, unrelated to him also being fairly similar to the social revolutionaries. But now that I know this behavior was also common to them, this makes more sense. Thank you.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DvSzil",
            "body": "Marx wouldn't \"condemn\" Mangione, just point out the limited outcomes of the approach, as others have haid. There's a short text by Trotsky which summarises the Marxist criticisms of this sort of solo actions: [Why Marxists Oppose Individual Terrorism](https://www.marxists.org/archive/trotsky/1911/11/tia09.htm)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gertsky63",
            "body": "https://www.marxists.org/archive/trotsky/1939/xx/grnszpan.htm\n\n\"It is clear to anyone even slightly acquainted with political history that the policy of the fascist gangsters directly and sometimes deliberately provokes terrorist acts. What is most astonishing is that so far there has been only one Grynszpan. Undoubtedly the number of such acts will increase.\n\nWe Marxists consider the tactic of individual terror inexpedient in the tasks of the liberating struggle of the proletariat as well as oppressed nationalities. A single isolated hero cannot replace the masses. But we understand only too clearly the inevitability of such convulsive acts of despair and vengeance. All our emotions, all our sympathies are with the self-sacrificing avengers even though they have been unable to discover the correct road. \n\nOur sympathy becomes intensified because Grynszpan is not a political militant but an inexperienced youth, almost a boy, whose only counselor was a feeling of indignation. \n\nTo tear Grynszpan out of the hands of capitalist justice, which is capable of chopping off his head to further serve capitalist diplomacy, is the elementary, immediate task of the international working class!\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "ReanimatedBlink",
            "body": "Marx probably wouldn't do either. If he referenced him at all, it would be point out how Luigi's \\[alleged\\] actions, and public reaction ranging from a general indifference to outright celebration, is proof of the theories he developed.\n\nIf a broader movement of political violence sprung up behind Mangione, we could expect to see him apply some judgement. Would be support or oppose? It would probably be nuanced depending on the specific actions and actors involved, the motives, their methods, and their targets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Atomicus-",
            "body": "It is a quantitative action which has brought class consciousness to a greater number of people, the act itself may be condemned but the qualitative action it may lead to is beneficial (it has already caused more quantitative action)\n\nMarx \"approved\" of the British colonising India, not because he was pro-colonisation but because he believed it would lead to revolution (which it did) \n\nThe exploited cannot exist without the exploiter,\nThe exploiter cannot exist without the means of exploitation,\nSocialism exists on the basis of removing the means of exploitation,\nBy 'removing' the exploiter you can cause a shift and damage to the means of exploitation.\n\nQuantitative action is necessary for qualitative action \n\nI don't think Marx would condemn or commend Luigi Mangione but rather hold a more nuanced belief while recognising that Luigi's actions had value which was beneficial for the workers",
            "score": 1,
            "replies": []
        },
        {
            "author": "MinutelyHipster",
            "body": "I think it's important to see the buzz around Mangione as a class consolidating act, while still recognising the actions themselves do not bring us closer to communism. Focus on the support he's received and the anger at the Healthcare industry and society at large the event prompts us to discuss. But the actions themselves are just kind of adventurism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cort0",
            "body": "Marx was not a moralist - he was more of a scientist. Communism is not a set of moral laws. I believe he would be absolutely interested not only in Luigi's actions but even more in the unfolding of the act in the popular sphere, etc. This story has a lot to say about any, many things. To only judge if something is revolutionary or not is a poor bynarism that to me doesn't seem to be very dialectical- much more interesting  is to understand this (very clearly) highly relevant moment of contemporary history and see what can we take from it that will help us in our objectives. At least that's my view - probably Marx would be mad that we're speculating his opinions like intelectual orphans to be honest 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBigSmoke420",
            "body": "He could do a lot more with this position, and do a lot more good.\n\nHe threw his life away for a largely pointless reason.\n\nRandom vigilante justice is counter-revolutionary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Most_Contribution741",
            "body": "Yes. Marx never said Kill the Capitalists and Steal all the Money! \n\nHe said: Seize the means of production. \n\nHe would have condemned him as a consequence of the situation. What he did was wrong but expected from an exploited class.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "As LM's action wasn't part of any larger protest or movement, his shooting of CEO can be seen only in terms of being an isolated incident. I do not believe it rises to the standard of 'terrorism', but it is nevertheless a criminal act. Marx may not have specifically endorsed it, but if it were part of the larger movement, I'm pretty sure Lenin would not have had a problem with it. The Revolution must be pushed forward by all means legal and illegal. In the end, only the results matter- not the method.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SiofraRiver",
            "body": "He'd write a snarky bit in Jacobin about how the bourgeoisie inevitably brings this down on themselves after texting \"lmao what a chad\" to Friedrich.\n\nDude was a total shitposter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "linuxluser",
            "body": "tl;dr It doesn't matter. Marxists today are focused on strategic organizing for the working class and supporting a random, right-wing lone terrorist is likely unhelpful to those ends.\n\nMy longer reply is [here](https://www.reddit.com/r/Marxism/s/pnPLWGJNAp).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kapitano72",
            "body": "\\> many leftists\n\nA few people of all political persuasions have always thought like that. You may as well ask why many people with green eyes have started drinking coffee without milk recently.",
            "score": 0,
            "replies": [
                {
                    "author": "Adventurous_Ad_2765",
                    "body": "You're right, it is unspecific I just wanted to know if it was a popular opinion among all socialists like the ones I spoke to. But now I realize I just misunderstood their arguments anyway and not every socialist even agrees.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}