{
    "title": "Are we too deep into late stage capitalism to turn around?",
    "author": "Cute-University5283",
    "subreddit": "Marxism",
    "rank": 151,
    "score": 83,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/Marxism/comments/1i0yqs9/are_we_too_deep_into_late_stage_capitalism_to/",
    "id": "1i0yqs9",
    "selftext": "As a project manager by trade, I keep thinking about exactly what would it take to achieve a socialism (let's say something like China's level of control of the economy) in the United states. I see soooo many obstacles where any one of these will derail the entire project. I'm looking for a feasible plan that gets us to the finish line in the most ethical way.\n\n(1) I see a major problem being proletariat cohesion the suburbanization and internet atomization of society has most people with few friends, belonging to no outside of work organizations that would ever discuss leftist politics, they have no understanding of Marxist theory or even acknowledge their working class status. Unless they have played a sport after grade school, they have probably almost no experience with organizing.\n\n(2) Then there is the overcoming the counterrevolutionary forces. I can't see any version of a transition where the wealthy accept losing a democratic vote and would surrender their weapons, yachts, and turn their mansions into apartments so getting armed and trained will need to happen. Assuming that this can be done, capitalist forces would certainly monitor and/or cut internet communications rendering coordination and the use of moderns devices very difficult. An armed revolt could expect to be met by drones and air strikes. Running out of oil would stop troop movements as well as food and medical assistance. Will they nuke us if we are doing too well? \n\n(3) Even if we can hold out and reach a treaty with the capitalists, all modern devices require some kind of subscription or have a product life of less than 2 years and we would be at their mercy through debt in about that much time. Do you try to peacefully coexist with the capitalists as they constantly threaten and deceive your people? Do you just stop with the closest capitalists or do you try to neutralize them all? \n\n(4) Then there is the issue of dealing with traitors (tempted by constant propaganda) and spies. What do you do with people who peacefully refuse to participate and keep trying to sabotage your society? Do we just expell them to where they think is better or jail then? What do we do to deal with our constant labor shortages? What do are we willing to trade with the capitalists for vital resources and technology?  \n\nSo I ask you Reddit, is there any scenario where we overcome all these issues? Give me reason to be at least theoretically optimistic",
    "comments": [
        {
            "author": "EctomorphicShithead",
            "body": "You owe it to your sanity to dive deep into some revolutionary history and theory.\n\nAll the listed issues are historical products of a presently cracking neoliberal facade which was brushed over a fundamentally neocolonial, western imperialist hegemony, in attempt to hide its barbarity.\n\nThe process of deteriorating neoliberal consensus has a long way to go but it has definitely begun, and as this process continues, humanity will witness and learn by experience, who and what can be trusted as legitimately representing our natural impulse of collective construction and progress, and who and what represent a step backward from that objective.\n\nWe can’t rush it, and we can’t snooze through it. You’re already on the right track, and I’ve seen this radicalization process continuing to grow for years. Don’t lose hope comrade. Join the communist party, educate yourself and keep your faith in the masses!",
            "score": 66,
            "replies": []
        },
        {
            "author": "Nuke_A_Cola",
            "body": "All of society runs on the production of the working class. In America you have you a much harder task for sure but how does America run itself when the majority has taken control of said production? Railways don’t work without workers. Petrol doesn’t get pumped or refined. Food doesn’t get harvested and processed and delivered. \n\nThe lifespan of the American military is probably a few years regardless due to their massive stockpiles but how do they fight when their regular soldiers refuse to do so? Or have actively joined the revolution? Only the right wing sections of the military and officer corps would back a counterrevolution. All of America’s strengths can be turned on its head. Because the world is run by workers. I would definitely be scared of nuclear weapons though, that’s a terrifying eventuality we will have to face. \n\nRevolution resolves the question of the capitalists. There is no coexistence once dual power is resolved. One side wins out. \n\nThe answer to the questions about dissidents. Prevent them from politically organising and getting their message out through repressing their freedom of speech. Only the working class has the right to a vote and a voice in the revolution. If the working class does not support you you’re fucked anyway and basically doing an adventurist coup which is not what Marxists support. When the 99% all support you politically that’s the time to strike. \n\nThen it’s time to spread the revolution. They can trade with other soviet republics. Hopefully they don’t have to trade with capitalists to survive as that would be a sign international revolution is not going as planned and an open door for capital to reassert itself like it did in Russia.",
            "score": 20,
            "replies": [
                {
                    "author": "SomeRightsReserved",
                    "body": "“Only the right wing section of the military and officer corps would back a counterrevolution.” \n\nWrong, people can be pushed to act against their class interests for literal breadcrumbs. In Algeria, up to 60 thousand ordinary Algerians fought for France against the FLN, and were among some of the most brutal forces in the war. Same with the Rhodesian forces in Zimbabwe who had almost as many black soldiers as white soldiers.\n\nAmericans traded union power and collective action for convenience and an entry way into the petty bourgeoisie a long time ago and now every generation since then is paying the price.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Nuke_A_Cola",
                            "body": "Only in non revolutionary times. Anti colonial bourgeoise national revolutions have a different character to proletarian revolutions against capitalism itself. Russia is a great example. Huge sections of the military defected to the Bolsheviks and would refuse to fire on workers. Even sections of the Cossacks defected to the Bolsheviks. The various minority groups hyperexploited by the tsar but elevated based on military participation play an analogous role I think and we saw them largely flip sides with only the most backwards section embracing the whites and reaction.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Traditional_Ease_476",
            "body": "Gaming it all out is very difficult and mostly besides the point, and the time and effort is mostly better spent organizing. I think we have to believe in the power of our ideas. Capitalism is a bane on humanity, and socialism is vastly better politically, economically, socially -- in every way. But we are seeking to end oppression itself, while living in and trying to get out from under this massively oppressive and shortsighted system. We need to look at the long term and commit ourselves to building small brick by small brick. Maybe I am wrong on the theory here but it seems like late-stage capitalism could last a very long time. Nothing is set in stone, and fascism or unending capitalism are not inevitable. The working class always has the ability to find class consciousness, unite, and fight.",
            "score": 8,
            "replies": []
        },
        {
            "author": "the_sad_socialist",
            "body": "Anything beyond your first listed point is sort of getting ahead of ourselves. The main problem right now is that the left-wing effectively doesn't exist in a lot of the developed world. We need to start organizing so that we are ready when material conditions change. This isn't anything that any of us are smart enough to solve on our own. There is a good chance most of us will be dead before there is an international communist revolution.",
            "score": 7,
            "replies": [
                {
                    "author": "Cute-University5283",
                    "body": "What inspired this post was listening to the history of slave rebellions (I would count the Soviet union as effectively a slave rebellion) and how they either never start or always fail due to the reasons I listed above. While it's both impossible and unwise to follow a plan without regard to changing conditions, I also think rebellions that lack any sort of idea of how to actually achieve victory are doomed to failure. And if you can't imagine how your hypothetical plan could possibly work, maybe it's time to reduce constraints or  change victory conditions.\n\nI just get so frustrated listening to leftist infighting and no one is ever talking about how to actually succeed",
                    "score": 3,
                    "replies": [
                        {
                            "author": "the_sad_socialist",
                            "body": "Each revolution has its lessons to be learned. Like for example, we could view the French revolution as a failure. Was it really though? We wouldn't even have the language and theory to discuss our current politics without it. Were these slave rebellions really a failure in the grand scheme of things? Slavery is at least seen as something that is contemptible by today's standards. The Soviet Union, despite its long-term failure, overcame odds that seemed unfathomable. It legitimized Marxism as a viable political ideology that can oppose imperial occupation. \n\n\nYour frustration is understandable. However, by the time we develop enough of a left-wing presence in the United States for change, the material conditions we be entirely different from the situation that currently exists.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Phurbaz",
            "body": "The thing that even many contemporary Marxists miss is that there is no turning back capitalism. It is fundamental to Lenin's analysis of Imperialism (i.e., monopoly/finance capitalism) that it is the \"highest state of capitalism\" - not because we must return to some lower state, but because we must transform society on the basis of the highest form of capitalism - and as such we can't be strictly anti-imperialist or anti-finance capital as Marxist as it heightens the contradictions of capitalism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "eze_4k",
            "body": "Here the thing, a revolution will happen. A revolution is inevitable. This is the fundamental belief of Marxism in a nutshell. This is dialectics in a nutshell. Change is inevitable. What matters is whether we are prepared for the revolution or not. It’s never too late to work towards turning society around.",
            "score": 7,
            "replies": [
                {
                    "author": "groogle2",
                    "body": "Marx's conception of revolution is not teleological. He only says that the contradictions of capitalism create the \\*possibility\\* of overcoming and sublating it through socialist revolution. We still need to act.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Themotionsickphoton",
                    "body": "\"Revolution\" is certainly inevitable (since present day capitalist society will never be able to overcome climate change), but the question of what comes after cannot be answered with inevitabilities. \n\n\nA collapse of capitalist society could most certainly look like a massive decline of the human population and some segments of the world turning towards fascism whiles other turn to socialism.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Nuke_A_Cola",
                    "body": "Revolution is not inevitable. It is made through the actions of people not simply due to the abstract historical forces and interests. Assuming it is inevitable I think is a mechanical materialist sin. Although you are right that we need to be ready to win it if and when it happens. But it’s not entirely spontaneous.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "eze_4k",
                            "body": "When I say revolution, I’m referring to the changing of something from one state to another. Capitalism will not last forever, this we know because absolutely nothing last forever. Dialectical materialism tells us that change WILL happen. I’m not saying it’s inevitable that people rise up and start a socialist revolution, I’m saying it’s inevitable that capitalism will at some point come to an end.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Significant_Note_659",
            "body": "There will be no revolution in the imperial core in the foreseeable future, we are too far gone in the belly of the beast. The only hope for revolution lies in the peripheral, the global south. \n\nWith that being said, the fact that capitalists are willing to sacrifice the entire planet and billions of people to climate collapse is all the proof you need that they will happily nuke the world to oblivion before they will ever forfeit their power. \n\nThe courageous path of the DPRK and other socialist states is the only glimmer of hope I see. I wish to somehow handicap the capitalists in some way, but I feel there is little we can do under the strength of our current regime. Still, we owe it to all the brave communists before us who have fought and died to not give up hope.",
            "score": 4,
            "replies": []
        },
        {
            "author": "carrotwax",
            "body": "There's no such thing as \"too deep\", except perhaps in saying it's gone too far to avoid what Russia experienced in the 90s for much of the population.  The more it's obvious the system isn't working, the more possibilities for organizing and mobilizing, even if it is simply helping the neighborhood.\n\nIf the question is about revolution vs incremental change, I'd say the current system and concentration of wealth and power prevent significant incremental changes.  There needs to be a major change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "voicelesswonder53",
            "body": "If you follow Yiannis Varoufakis' analysis, we' ve already shifted into Techno feudalism. In Techno feudalism it is all of capitalism that is made to pay rents to the techno Lords. The economy has shifted to paying rents to them for the use of their cloud real estate.  Any bit of success you will have in that system will be multiplied for the new land Lord. And that is saying nothing about the ability to influence that comes with it. They have your eyes and your ears and the ability to buy anything that stands in their way. What does a peasant's revolt look like when it trying to use the cloud platforms to send out the message and built up the movement? Entire conflicts are now being whitewashed, and we realize that we are being censored and groomed by armies of bots.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SadPandaFromHell",
            "body": "One idea Marx seemed to illustrate was the idea that late stage capitalism will lead to civil unrest, which will eventually cause the uprising of the working class.\n\n\nSo to be fair, the worst capitalism feels, the closer we are to a potential revolution. (But I'd rather try not to have it come to that.)\n\n\nCapitalism is guaranteed to fail eventually. The question is how.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NandoGando",
            "body": "Half of the United States does not even vote. 62% of Americans own shares. While there remains such disengagement and investment in the current order a socialist coup is unthinkable.",
            "score": 5,
            "replies": [
                {
                    "author": "DrmsRz",
                    "body": "I’m curious on your source(s) regarding “half of the United States does not even vote.” \n\n[According to just one](https://www.pewresearch.org/politics/2023/07/12/voter-turnout-2018-2022/) of many articles, “About two-thirds (66%) of the voting-eligible population turned out for the 2020 presidential election – the highest rate for any national election since 1900.” [Another article notes](https://www.usnews.com/news/national-news/articles/2024-11-15/how-many-people-didnt-vote-in-the-2024-election) that “approximately 245 million Americans were eligible to vote in the 2024 general election,” with “close to 90 million” not voting, equating to over 63% of the eligible voters who voted in 2024. There are many dozens of others similar stats.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OfTheAtom",
                            "body": "Then average that over a ten year cycle with the 5 election days in those ten years. Or 20 years with 10 events of voting. \n\n\nIf you only look at when a president of the entire united states is up you're going to skew the statistics. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lezbthrowaway",
                    "body": ">  These by no means exhaust the list of Euro-Amerikan private possessions. Stocks - one of every seven Euro-Amerikans owns at least some corporate stocks - vacation homes, land, hair dryers, motorcycles, exercise equipment, guns, boats, annual changes of clothing styles, and on and on. We have brought up these boring, almost mind-numbing lists of possessions to drive home the point that consuming is a disease among settlers, an infection that is dominant in that culture. Euro-Amerikan life is no longer centered around production but around consumption. This is the near-final stage of decadence.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AgeDisastrous7518",
            "body": "To actively turn it around, yes. Capitalism has to crumble on its own weight with the masses simply getting sick and tired of propping it up. What will replace capitalism is anyone's guess, but this can and will happen. I just doubt that it will active acts of Marxism that tear it down and replace it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoldStar73",
            "body": "There's a book, \"the people's republic of Walmart,\" that argues that mega corporations such as Walmart and Amazon already function as giant planned economies. Were they someday nationalized, we could switch over to something like communism without too much of a hitch. I think that policy which covers basic human needs is more workable than the abolition of private property (particularly given how abundant things like food are in modern economies), but maybe Marx would say that such half measures are somehow mystification (or, to be vulgar, some kind of ideological cope). \n\nIt's also somewhat telling to me that you linguistically frame the end of capitalism as \"turning around,\" when Marx held that the dialectical evolution of communism was somehow a necessary and inevitable progression. \n\nGranted the Hegelian dialectic isn't Whig history, it progresses by means of absorbing contradictions, basically... capitalism won't be defeated by turning around but by exploiting its contradictions, the  revolutionary potential that it generates... at least on Marx's classic picture",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interloper_11",
            "body": "We’d need to take total control -probably immediately- of the communication apparatus so all networks and network tech in America would have to be seized and handed to the people to operate and maintain. Tbh the internet should be public space anyways and should already be owned by the state.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nobody1000000",
            "body": "After reading some of the posts on r/Marxism regarding revolution, I kinda cringe inside. There’s not gonna be any revolution and besides, why would anyone risk dying for their beliefs? After all, they could be wrong….I’m also reminded of this Ligotti quote: \n\n>Composed of the same dross as all mortals, the pessimist cleaves to whatever seems to validate his thoughts and emotions. Scarce among us are those who not only want to think they are right, but also expect others to affirm their least notion as unassailable. Pessimists are no exception. But they are few and do not show up on the radar of our race. Immune to the blandishments of religions, countries, families, and everything else that puts both average and above-average citizens in the limelight, pessimists are sideliners in both history and the media. Without belief in gods or ghosts, unmotivated by a comprehensive delusion, they could never plant a bomb, plan a revolution, or shed blood for a cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad_Succotash9323",
            "body": "That's the thing tho, the bourgeoisie doesn't actually control any of that stuff. Workers do. We make up the military, we make the drones, we import the fuel, we manage communications, we do it all. 100% of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhatAreWeeee",
            "body": "The left refuses to rally because they fall for Russian propagandists every 4 years. It’s disheartening. I think the best way would be to unite under economic hardship, which I believe is bubbling to a boil as we type ",
            "score": 1,
            "replies": [
                {
                    "author": "mildheortness",
                    "body": "I agree. I attempt to bring matters of economics into as many conversations as possible. It is the difficulty of living well under a failing capitalism that I believe will motivate people to  make political change. However in the West there is so much wealth many people are still insulated from the most brutal symptoms of the economic decline. Even addressing a housing crisis is hardly articulable in many states.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}