{
    "title": "Got banned on r/TheDeprogram for being too dialectical ",
    "author": "Fun-Cricket-5187",
    "subreddit": "Marxism",
    "rank": 150,
    "score": 0,
    "upvote_ratio": 0.31,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Marxism/comments/1i21hf0/got_banned_on_rthedeprogram_for_being_too/",
    "id": "1i21hf0",
    "selftext": "My comment: \"I mean wouldn't that be nice, but capitalism is dialectical right? Of course the workers already own the means of production in one sense, but not so much in another. The marxist point is that production is in contradiction with social relations, right. So the point of socialism is to overcome workers councils, not them being an end in themselves, Maduro doesn't see it that way.\n\nThe workers kind of already own the means of production, that's why they are the revolutionary subject and object. The international working class does not seem sufficiently organized to pose new questions unfortunately.\"",
    "comments": [
        {
            "author": "newscumskates",
            "body": "In no way do the workers \"own the means of production\". I don't understand how you can see it this way.\n\nThey work to get paid, and they are at the mercy of the owners / management who can dispose of them on a whim.\n\nThey can't vote for what they work on. They can't vote to choose their hours. Whether they work in office or at home. What to make, where it gets sold, and they certainly aren't reaping the rewards from the value they produce and are absolutely being paid less than they're worth.\n\nWithout understanding the context of your comment, because your mad dialectical brain provided nothing, I think it's safe to say that Maduro knows more about socialism than you and you should let it go.",
            "score": 14,
            "replies": [
                {
                    "author": "Fun-Cricket-5187",
                    "body": "The workers get paid and are at the mercy of the owners, who are at the mercy of capital, the workers are also at the mercy capital. The mercy of capital, that is to say the mercy of capitalism, the mercy of society. The historical specificity of the proletariat drives the crisis capitalism, as it \"works behind their back.\" \n\nPrivate and collective ownership is an expression of social fragmentation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "newscumskates",
                            "body": "And that means the workers somehow own the means of production?\n\nHere, I got lazy and fed your convoluted mess of a response to ChatGPT and told it you're initial argument and how you think you're using dialectical reasoning and it spat this out.\n\nHere’s why the argument doesn’t hold up:\n\n1. Ownership Under Capitalism:\nUnder capitalism, workers do not own the means of production in any practical sense. They may operate the means of production, but ownership—and control—rests with the capitalist class.\n\n\n2. Misuse of Dialectics:\nDialectical reasoning often highlights contradictions, but to argue that workers \"own\" the means of production simply because they operate them conflates use with ownership. This isn’t a dialectical contradiction; it’s just a misunderstanding of the terms.\n\n\n3. Power Dynamics:\nTrue ownership implies control. Even if workers are essential to production, they lack decision-making power and control over surplus value, which is extracted by capitalists.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Fun-Cricket-5187",
                                    "body": "Ask it to tell you why it makes sense instead, maybe you'll learn something.\n\nNobody owns the means of production in capitalism, the class conflict is an expression of society in flux, the capitalist class don't control anything insomuch as they have no freedom to overcome the dictatorship of capital. Everybody owns the means of production in capitalism, capitalism one way or another responds to the economical needs of society however perverted. Why do these distinctions exist? Bourgeois society is in crisis ie. capitalism.\n\nI am not misusing dialectics. To argue the capitalists \"own\" the means of production simply because they operate them conflates use with ownership. The dialectic expressed here is the contradiction of social relations (bourgeois social relations) with historical conditions, namely industrialization. \n\nThe workers necessarily hold decision making power and control over surplus value which is extracted by capitalists insomuch as they have revolutionary potential. Generally the proletariat are in a better position to politically overcome capitalism than the capitalists are. \n\nGet used to convoluted messes if you want to learn about Marxism. It's been quite obscured by capitalism and the 20th century.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "studio_bob",
                                            "body": ">The workers necessarily hold decision making power and control over surplus value \n\nThey demonstrably do not, and their disempowerment is the hallmark of capitalist society (that's how come they are *exploited*). It is an abuse of language (to say nothing of Marxist theory) to insist they do merely because they have the *potential* to seize such power.\n\nIt seems like you are confusing the observation that capitalists are in their turn \"tools of capital\" with the real social relations of power and private property under capitalism. One could say the royal families of medieval Europe were likewise \"subjects\" of feudalism, but it would be absurd to then insist on that basis that the peasantry owned the land. As long as a given system endures, each is inescapably subject to their class position, but *as a class* the relation of ruler and ruled, oppressor and oppressed, exploiter and exploited remains.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Fun-Cricket-5187",
                                                    "body": "We're confusing feudalism and caste systems with modern bourgeois society which is classless, but in capitalism the class problem arises. What you are are articulating is bourgeois radicalism ie. seizing the aristocrats and shedding the yoke of the oppressor, capitalism is a deeper problem than exploiter and exploited unfortunately. Proletarian socialist revolution will necessarily be bourgeois in character, but capitalism points beyond this, keep these two ideas in our heads. \n\nIn feudalism the peasants didn't own the land, they weren't even individuals. In bourgeois society everyone (including the working class) are free commodities, the means of production are owned by no one. **This was the original idea and real phenomenon of bürgerliche Gesellschaft (bourgeois society or civil society) articulated by the likes of Hegel and bourgeois revolutionaries.** In capitalism, bourgeois society then breaks into class, expressing the old bourgeois crisis of the aristocrat exploiter owning the land due to the industrial conditions, as the idea of free commodities (individuals) that sell their labor is disintegrated. \n\nHowever even though there is this new class distinction where the old problems of the third estate rise to the surface, it is still bourgeois society, that's my point. Please tell me if this makes sense.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "studio_bob",
                                                            "body": ">modern bourgeois society which is classless\n\nBourgeois society emphatically is *not* classless. Even the very term \"bourgeois society\" implies the distinction between the bourgeoisie and proletarian classes.\n\nLikewise this:\n\n>In bourgeois society everyone (including the working class) are free commodities, the means of production are owned by no one. \n\n..is *nonsense.* The very word *bourgeoisie* refers to the class of *owners* of the means of production. It is because of that ownership, the private property relation which confers special rights, privileges, and powers on the bourgeoisie *as a class*, that proletarians, who do not enjoy that same rights, privileges, and powers conferred by ownership, are said to be exploited. But now I am just restating what I have said before.\n\nIt seems like you are attempting to deploy a, let's say, idiosyncratic definition of such terms (whereby \"bourgeois society\" could conceivably predate the bourgeoisie as a class counterposed to the proletariat and private property is not taken for granted? this, however, seems at best strictly idealist as well as ahistorical), but it is a mystery to me what positive purpose is served in doing so. It practically guarantees confusion and makes communication virtually impossible.  \n\nAt this point I just have to ask where you are getting such kooky ideas, because it is certainly nowhere in Marx. Is this just your own interpretation or what?\n\nAs for the \"confusion,\" *you* certainly are confused. I made an analogy to feudalism in an attempt to illuminate part of the nature your confusion. Apparently, it didn't work! Sorry for that.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Fun-Cricket-5187",
                                                                    "body": "The proletariat is a class of the bourgeoisie since capitalism. The word bourgeoisie is an term to point out it's contradictory implications, aren't we all in bourgeois society? Well yes, but it's crisis, that's the point, the bourgeoisie can no longer rule. This is all very much in Marx, some people misunderstand critique with political rhetoric. Also the word bourgeoisie is much more than a class of aristocrats. By the way I understand everything you're talking about, this is the democrat reading of Marxism my econ professor would preach. This is the kind of socialist politics Marx would critique. \n\nPlease engage with everything else I have there, I don't really feel like repeating myself. Maybe Marxism is too bourgeois for you, that's okay.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "offshoredawn",
                                                                            "body": "Classic misuse of dialectics to excuse capitalism. Capitalists do own the means of production, ownership is about structural control and profit, not personal freedom. \n\nAnd no, workers don’t already control surplus value just because they have revolutionary potential, that’s the whole point of exploitation. If you want to critique Marxism, start by understanding it.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Fun-Cricket-5187",
                                                                                    "body": "Marxism being the critique of socialism and bourgeois radicalism overcomes the exploiter, exploited dichotomy. The workers are the surplus value, labor is the surplus value. Marxism is also very much about personal freedom. How is anything you said dialectical? You are just role playing the revolt of the third estate.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "offshoredawn",
                                                                                            "body": "Yet another attempt to reduce Marxism to abstract idealism and cherry-picked slogans. I'll address the contradictions in your argument to help educate you.\n\nFirst, Marxism is not merely a \"critique of socialism and bourgeois radicalism.\" It is a scientific analysis of the material conditions of society, rooted in historical materialism. While it critiques certain forms of socialism (utopian socialism, for example) and bourgeois revolutionary ideology, its primary focus is on class struggle and the systemic contradictions of capitalism. Reducing it to a critique of bourgeois radicalism misrepresents its scope and purpose.\n\nSecond, your claim that “the workers are the surplus value” and “labor is the surplus value” conflates the distinction between labor power and the value it produces. Surplus value is the unpaid labor appropriated by the capitalist class, it’s not identical to the workers themselves. To collapse this distinction ignores the mechanics of exploitation that Marx meticulously outlined.\n\nThird, while Marxism certainly emphasizes personal freedom, it does so through the lens of collective emancipation. Freedom in Marxism is not individualistic but tied to the abolition of class society and the alienation inherent in capitalism. You’ve stripped the concept of its material basis and presented it as abstract individual liberty, which is antithetical to Marxist theory.\n\nLastly, accusing others of \"role-playing the revolt of the third estate\" reeks of projection. Marxism is rooted in the dialectical analysis of material conditions, not rhetorical one-liners. If you’re going to invoke dialectics, at least demonstrate an understanding of the material contradictions that drive historical change. Otherwise, you’re just playing at theory while ignoring its substance. Try again.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                    "body": "The primary focus of Marxism is a negative critique of capitalism, wherein socialism comes from, so yes Marxism is totally a critique of socialism. You don't need Marxism to do class analysis and capitalism critique. \n\nAlso I'd argue the mechanics of exploitation that Marx \"meticulously outlined\" makes the point that the \"mechanics of exploitation\" misses the point, it's an immanent critique, not an outline of how capitalism works, even if it's correct. Free labor is a commodity, it's accumulated capital, wherein the bourgeois subject/object of free labor is disintegrated, while contradictorily reproducing itself. Where Marx outlines this object of investigation it is sufficiently that. \n\nMarxism also does not take a side on the individual or the collective emancipation, Marxism says both! This is the bourgeois dialectic of society in crisis, expressing itself through this individual/collective distinction. Abstract individual liberty is not antithetical to Marxist theory, Marxism is very abstract right now. I'd argue individual liberty isn't very abstract, it's only abstract insofar as capitalism disintegrates it. \n\nThis materialism you preach is in German Idealism and Adam Smith. Stop pretending to be Marxist please.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "offshoredawn",
                                                                                                            "body": "Your critique conflates and misrepresents several key aspects of Marxism, so let’s clarify. Marxism is not primarily a critique of socialism; it is fundamentally a critique of capitalism as a mode of production and the material conditions it creates. While Marx does critique utopian socialism and other pre-Marxist frameworks, this is secondary to his central focus: analyzing capitalism’s contradictions and outlining how they give rise to the potential for socialism. To suggest that socialism is Marxism’s main target is to invert its priorities and misunderstand its historical materialist foundation.\n\nYour dismissal of Marx’s detailed analysis of exploitation as “missing the point” is misguided. Marx’s immanent critique of capitalism is both descriptive and transformative. His outline of the mechanics of exploitation—such as surplus value extraction—is not a mere technical exercise but a demonstration of capitalism’s internal contradictions. These contradictions reveal the system’s unsustainability and point toward revolutionary change. Ignoring these mechanics in favor of abstraction detaches Marxism from its practical relevance and weakens its ability to critique capitalism effectively.\n\nOn the question of individual and collective emancipation, your claim that Marxism “says both” misunderstands its position. Marxism recognizes the dialectical tension between individual and collective freedom as a product of capitalist alienation. Under capitalism, abstract individual liberty is constrained by private property and exploitation, making it hollow and incomplete. Marxism doesn’t merely accept this contradiction but seeks to resolve it by abolishing capitalism, enabling genuine individual freedom through collective emancipation. Abstract liberty under capitalism is not only insufficient; it is a cornerstone of Marx’s critique.\n\nFinally, the claim that Marx’s materialism is simply a continuation of German Idealism or Adam Smith’s ideas misunderstands his relationship with these traditions. While influenced by them, Marx explicitly breaks from their limitations. His historical materialism rejects the metaphysical assumptions of idealism, grounding analysis in real, material conditions. Similarly, while he engages with Smith’s political economy, Marx critiques its bourgeois assumptions and exposes the contradictions it cannot resolve. Conflating Marxist materialism with these antecedents overlooks the profound shifts Marx introduced in understanding society and history.\n\nIf Marxism seems “abstract” to you, it is likely because you are fixating on abstractions rather than engaging with its dialectical method, which moves fluidly between abstraction and concrete analysis. Marxism is not meant to remain in the realm of lofty ideals; it is a tool for understanding and changing the material world. Your argument, by contrast, seems content to obscure this purpose in a haze of philosophical gestures. Perhaps it’s time to engage with the material contradictions Marxism illuminates instead of mischaracterizing its foundations. Your purity test is tainted my dear.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                                    "body": "Under capitalism, individual liberty is constrained by a lack of private property. That second paragraph goes back to Marx's critique of Proudhon. Marx was firstly a critique of socialism because he wanted it to succeed. \n\nMarx's materialism is a continuation of German Idealism and Adam Smith insofar as his critique shows their limitations through historical development. Yeah he \"breaks\" with them in this sense, but in a way in which they necessarily are overcome. Marx doesn't really reject idealism, idealism is a real material condition of society that he engages with as a historical condition... see reification. These lofty ideals and abstractions you deem so heretic is necessarily a concrete analyses of society, through these lofty ideals Marx thinks through their recognition. \n\nMarx doesn't need to outline how capitalism gives rise to socialism, this isn't unique to him, capitalism necessarily produces socialism in this way when Marx arrives on the political scene. He merely points out how these socialists are recognizing capitalism--the negative. Yeah capitalism gives rise to socialism, you don't need Marxism for that, he takes that for granted.\n\nAgain, individual liberty is based on the society of labor, labor as private property, capitalism is the undermining of this social relation. Capitalism is a freedom problem primarily, not a exploitative mode of production, that is misrecognition through repeating the revolt of the third estate which abolishes parasitic aristocrats. This is why when Louis Bonaparte killed all the parasitic capitalists, capitalism prevailed, it's a deeper problem. \n\nI'm glad you see Marxism so clearly and concretely, immune to such abstract and lofty ideals. I concede to your sober materialist analysis, perhaps I should have taken the red pill like you. I will join you in your crusade for the welfare state and abolishing the individual, I will see you at the DNC in 2028 comrade. Silly are the utopian philosophical debates of those I do not understand upon first reading, for they are not as **based** as us. \n\nFor I now speak to the dirt as the most material condition of my life and if I listen closely enough it tells me socialism is coming. The collective yearns for communal farming.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "offshoredawn",
                                                                                                                            "body": "This comes across as cynicism dressed as critique. While your commentary revels in irony and playful condescension, it reflects a fundamental misunderstanding of Marx’s project and method, so let’s parse this with due rigor.\n\nFirst, the notion that “individual liberty is constrained by a lack of private property” misreads Marx entirely. For Marx, private property as it exists under capitalism is the primary constraint on individual liberty because it alienates the worker from the means of production, the product of their labor, and ultimately from themselves. The abolition of private property—specifically bourgeois private property—does not entail the negation of liberty but its realization in a form no longer mediated by exploitation. Your framing conflates freedom with possession, an assumption Marx explicitly critiques as rooted in bourgeois ideology.\n\nSecond, your insistence that Marx’s materialism merely continues German Idealism and Smith’s political economy fails to grasp the dialectical nature of his critique. Yes, Marx builds upon these traditions, but he does so by sublating them—preserving their insights while negating their limitations. This process, far from being a passive “continuation,” represents a fundamental transformation. Idealism, for Marx, is not simply a historical condition but a reflection of material relations mystified by ideology. To reduce his critique to a recognition of idealism as a “real material condition” is to miss its revolutionary intent: the demystification of these conditions and their practical overcoming.\n\nThird, your dismissal of Marx’s role in demonstrating how capitalism gives rise to socialism misunderstands his contribution. It is not enough to state that capitalism produces socialism in some deterministic fashion. Marx’s work uniquely reveals the contradictions within capitalism that create the conditions for its own transcendence. His critique is not a mere acknowledgment of socialism’s emergence but a detailed analysis of the material forces and social relations driving that process. To dismiss this as unoriginal is to ignore its methodological depth and explanatory power.\n\nFinally, your reductive framing of capitalism as a “freedom problem” rather than an exploitative mode of production ignores the dialectical relationship between freedom and exploitation. For Marx, the two are inseparable: capitalism’s promise of freedom—rooted in the formal equality of exchange—depends on the underlying reality of exploitation and alienation. Your romanticization of individual liberty as “labor as private property” overlooks how this very relation is undermined by capital’s need to accumulate and commodify.\n\nAs for your parting satire “speaking to the dirt” and invoking communal farming, this attempt to caricature Marxist materialism as crude reductionism betrays more about your own discomfort with its implications than about Marx’s analysis. The critique of lofty ideals and abstractions is not a dismissal of their importance but an effort to root them in material conditions, to strip away mystification and reveal their historical basis. Perhaps it is not materialism that you find unconvincing but the demands it places on thought and praxis.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                                                    "body": "Yeah the point is that labor as private property is undermined by capital production - hence the private property point he makes in his critique of Proudhon. Maybe the German idealism point is a semantic argument, that's all generally correct. Yeah idealism is an expression of historical condition, it's an expression of society, it's only through these forms of appearances in ideology that society can be illuminated. The abolition of private is the form of appearance taken up by Marx, the commodity form, through politically materializing and historically realizing private property it is thus abolished.\n\nCapitalism isn't a problem of exploitation, that is a mere recognition Marx runs with in his critique of socialism. It's a problem of self contradiction, societal self exploitation and self undermining of social relations.\n\nIn my satire I'm articulating your vulgar materialism that you dress up in property relations and class power relations. This isn't capitalism in the Marxist sense, it is an expression of bourgeois society in crisis which Marx takes up immanently. \n\nThe revolutionary part of taking idealism seriously is taking all ideology and philosophical articulations as expressing the crisis of capitalism.\n\nI actually think we agree some stuff here, maybe it's getting lost in translation. \n\n\"To reduce his critique to a recognition of idealism as a “real material condition” is to miss its revolutionary intent: the demystification of these conditions and their practical overcoming.\"\n\nIn this bit, me calling idealism a real material condition implies the revolutionary intent of driving it's, conditions of possibility, home. \n\nI think what you're missing is the distinction of bourgeois society and capitalism when you talk about capitalism promising freedom. Bourgeois society promises freedom, capitalism is the crisis of which that is self undermined. Freedom is in self contradiction.\n\n\"It is not enough to state that capitalism produces socialism in some deterministic fashion. Marx’s work uniquely reveals the contradictions within capitalism that create the conditions for its own transcendence. His critique is not a mere acknowledgment of socialism’s emergence but a detailed analysis of the material forces and social relations driving that process.\"\n\nYes, I think this is a proper reading. **I'd say Marx's unique contribution is taking this phenomena of the socialist movement in capitalism as expressing the necessity of the dictatorship of the proletariat.** Because there are already socialists before Marx saying that capitalism in itself has the possibility of it's self overcoming. The contribution of Marx is importantly political, through running with theory. I feared in your previous comment you were dismissing abstraction.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "offshoredawn",
                                                                                                                                            "body": "Your commentary raises several points worthy of serious engagement, but it appears to conflate certain distinctions in Marx’s critique and revolutionary framework while misapplying others. Let us address these systematically.\n\nThe assertion that capitalism is not a problem of exploitation but rather one of \"self-contradiction\" risks divorcing exploitation from the dialectical core of Marx’s analysis. Exploitation is not merely a \"recognition\" that Marx \"runs with\"; it is the material mechanism through which surplus value is extracted and class society perpetuates itself. While it is true that Marx critiques bourgeois society as a totality in crisis, this crisis is inseparable from the exploitative relations of production. Exploitation is not peripheral; it is the linchpin of capitalist contradictions. Capitalism’s \"self-contradiction\" manifests precisely through its reliance on the exploitation of labor to reproduce itself, thereby alienating and destabilizing the very conditions it depends upon. To treat exploitation as secondary is to misunderstand the dialectical interplay between capital's immediate operations and its broader systemic crisis.\n\nRegarding your invocation of idealism as a \"real material condition,\" you rightly note that Marx engages with ideological forms as expressions of historical and material conditions. However, your argument risks reducing this engagement to an affirmation of idealism’s \"reality\" rather than its mystification. Marx’s critique is not content merely to expose idealism as an ideological expression; it seeks to reveal the material basis for such ideology and to demystify its function within capitalist society. The \"real material condition\" of idealism is not its truth but its utility in obscuring the social relations of production. To collapse this distinction undermines Marx’s revolutionary intent, which is not to dwell on idealism but to transcend it through praxis.\n\nYour distinction between bourgeois society and capitalism, while valid, is applied unevenly. It is indeed bourgeois society that promises freedom, yet capitalism undermines this promise not through an abstract \"self-contradiction\" alone but through its concrete inability to reconcile the commodification of labor with the ideal of universal liberty. Freedom is not merely \"in self-contradiction\"; it is materially negated by the alienation inherent in capitalist production. The promise of freedom becomes a farce when labor is reduced to a commodity, as Marx painstakingly outlines in Capital. Bourgeois freedom is not merely undermined but revealed as contingent upon the unfreedom of the proletariat.\n\nYou correctly highlight that Marx’s contribution lies in articulating the necessity of the dictatorship of the proletariat. However, this does not diminish the theoretical rigor of his critique of socialism as it existed prior to him. Marx’s engagement with pre-existing socialist movements was not an endorsement of their assumptions but a radical reframing of their premises. Socialism, for Marx, is not an inevitable outgrowth of capitalism in some deterministic sense but a project of political struggle rooted in the contradictions of capital itself. To suggest that Marx \"runs with\" existing socialist notions misrepresents the originality of his analysis, which does not merely \"take up\" socialism but transforms it into a scientific and revolutionary framework.\n\nFinally, your satire, while attempting to critique \"vulgar materialism,\" ironically slips into its own form of abstraction. By divorcing concepts like exploitation and ideology from their material roots, your argument risks reifying the very categories Marx sought to historicize. The \"conditions of possibility\" of idealism are not autonomous but emerge from the concrete realities of class struggle. Any critique that neglects this grounding risks replicating the mystifications it claims to oppose.\n\nMarx’s work is neither a dismissal of abstraction nor a retreat into it. His method, grounded in dialectical materialism, seeks to illuminate the concrete totality of social relations, revealing the contradictions that both sustain and undermine capitalism. To misinterpret this method as a mere theoretical exercise is to overlook its practical, revolutionary intent. The task is not to simply \"run with theory\" but to integrate it with praxis, using the insights of Marxism to transform the world rather than merely interpret it.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                                                                    "body": "Exploitation—meaning labor as the means of freedom in bourgeois society, yeah totally that is central. I must be misreading your invocation of exploitation as exploitation in the Proudhonian sense, wherein every worker ought to be entitled to the full product of their labor. I think there’s a semantic misunderstanding there unless I'm interpreting you wrong. \n\nOn idealism. You posit that Marxism engages with idealism insofar is it seeks to \"reveal the material basis for such ideology and demystify its function within capitalist society.\" Yeah I'd agree with that. Only of course the material condition of idealism lies in its truth, and it's utility in obscuring social relations. In this sense we have to take all idealism being forms of capitalism. Nobody has an ideology because it is consciously useful to dupe themselves, it's a real expression of society that becomes part of capitalism. Marxism's revolutionary intent is to show what it's actually doing--the DSA isn't fighting fascism, they are shock troops for the democrats. In the face of mystification we ought to preserve reality. But of course the truth of my example is that every ideology is reacting to something real. Idealism doesn't obscure social relations in production--capitalism already did that--the truth in idealism is a window into the real possibilities of capitalism. This is Marx's Hegelianism.   \n\nThe concrete inability to realize labor as a commodity with universal freedom is the self contradiction. Despite societal liquidation in reproducing labor as a commodity, reproduction persists. The problem of capitalism isn't that labor is commodified, commodified labor is freedom; that is in contradiction, this is what's meant by freedom in self contradiction. It's by our initial freedom as laboring commodities, we are then alienated from ourselves through capital accumulation in the industrial revolution, not mere commodification. Bourgeois freedom is in crisis by the mere existence of the proletariat, it is in this spirit that the bourgeoisie can no longer rule.\n\nIn the fifth paragraph I think there is partly a misunderstanding on your part. I'm not saying Marx thinks socialism is inevitable--rather socialism as an aspiration is. This is to say that capitalism necessarily points beyond itself. My point about taking up socialism and self-consciously running with it, is the scientific character you pose onto Marx. \n\nI am not in anyway divorcing exploitation and ideology from society. But of course we necessarily have to self-consciously work within reification, that's the scientific part of Marxism. Reification becomes the material roots, that's how we access the material roots. I also don't know why you think I'm trying to divorce idealism from the actual. Also I don't necessarily oppose mystification, mystification is itself a form of recognizing capitalism. Again the whole point of reification is not to **stay based** it's self consciousness in and through self contradiction.\n\nInterpreting the world is how it's transformed via negativa. In this way history tasks us with socialism. Necessity through praxis and the demands history is how theory is integrated, not the other way around, lest we provide people with a new dogma.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "offshoredawn",
                                                                                                                                                            "body": "Your clarification opens a more precise avenue for discussion, but there remain points of contention that must be addressed. You seem to conflate Marx’s critique of exploitation with the Proudhonian framework, thereby misinterpreting the centrality of exploitation in Marx’s analysis of capitalism. Marx does not engage with exploitation merely to expose the disparity in the distribution of surplus value—an economic point that Proudhon fixates on—but to reveal how this dynamic is integral to the reproduction of capitalist social relations. For Marx, labor is not just the means of freedom in bourgeois society but the site of alienation and domination. The bourgeois claim that labor is freedom is revealed as ideological obfuscation, as the freedom of the worker exists only within the narrow confines of their commodification.\n\nOn the question of idealism, your assertion that its \"truth\" lies in its material condition requires closer scrutiny. You suggest that idealism is a \"real expression of society\" and therefore integral to capitalism, which is a point I would generally agree with. However, you seem to assign an almost intrinsic value to this \"truth,\" as if idealism holds within it an inherent revolutionary potential simply because it reacts to something real. This risks misapplying Marx’s method by privileging ideology itself rather than its demystification. The \"truth\" of idealism, in Marx’s framework, is not that it reflects reality but that it obscures it in ways that are materially grounded. Capitalism generates its own ideological forms, and while these forms are indeed expressive of real contradictions, they are not emancipatory in themselves. The revolutionary task is to reveal how these forms obscure the social relations of production and the conditions for their transcendence.\n\nYour claim that \"idealism doesn’t obscure social relations in production—capitalism already did that\" is an oversimplification. Capitalism obscures social relations through fetishism, as Marx details, but ideology plays a key role in sustaining this mystification. The fetish character of commodities and the ideological superstructure are not separate phenomena but deeply interrelated. To suggest that idealism merely reacts to real contradictions without further mystifying them is to underestimate its role in reinforcing bourgeois hegemony.\n\nYou further invoke Marx’s Hegelianism to argue that idealism is a window into the real possibilities of capitalism. This interpretation, while not without merit, risks overstating the case. Marx’s dialectical method indeed preserves the rational kernel of Hegel’s idealism, but it does so by turning it on its head. The \"real possibilities\" illuminated by idealism are not given but must be unearthed through a materialist critique that exposes their basis in the contradictions of capitalist production. To treat idealism as a \"window\" without emphasizing the active role of critique in smashing this window risks reifying the very ideological forms that Marx seeks to demystify.\n\nFinally, your example of the DSA as \"shock troops for the Democrats\" highlights an important point about the recuperation of political movements within the ideological apparatus of capitalism. However, this example functions more as a polemical aside than a rigorous engagement with Marxist theory. While I might agree with your critique of reformist tendencies, it is crucial to ground such critiques in a deeper understanding of the interplay between ideology and material conditions, rather than relying on rhetorical gestures.\n\nIn sum, your argument, while insightful, risks lapsing into an overestimation of the \"truth\" of idealism and a misapplication of Marx’s dialectical method. The revolutionary potential of Marxism lies not in affirming the ideological forms generated by capitalism but in exposing their contradictions and using that knowledge to guide transformative praxis.",
                                                                                                                                                            "score": 2,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                                                                                    "body": "For Marx labor is the means of freedom in bourgeois society–in capitalism, bourgeois society in crisis, labor is the site of alienation and domination. Bourgeois society does not naturalize labor is mere freedom, labor already exists, bourgeois society is the freedom of labor as a free commodity, this is not an obfuscation but a social nature. \n\nI wouldn’t say idealism is inherently revolutionary, but it points towards the expression of revolutionary necessity. Idealism reflects reality through obscurity, we can’t know material reality except from subjectivity critique and history. Ideological forms may or may not be emancipatory in themselves, though we can only know the political task from history and these ideological forms and how subjectivity is shaped by capitalism, there is no ai for reality. Marxism didn’t arrive from space, it exists in and through already existing conditions. Ideology plays a key role in identifying the social relations that are hitherto mystified–fuck, socialism and Marxism is ideology too. Marxism doesn’t strive to prove wrong ideology or explain scientifically why it’s wrong, it tries to show what they are actually doing in the historical process of capitalism as observed through taking ideology seriously, this is what I mean by running with contradiction to its logical conclusion. \n\nIn the spirit of Hegel and a thinker very important to me “accept everything and concede nothing” that is the politics of ideology critique. Marxism is polemic and rhetorical gestures are definitely not without substance, and I do not merely rely on them. I also definitely do not claim to separate commodity fetishism and ideology. Lastly there is no knowledge and revolutionary theory without practice, see Marx post-1848. I read the rest of your message but it’s just ideas I already responded to, everything you wrote I addressed in earlier messages. \n\nEdit: I'm sorry man I have to stop responding because this is taking a lot of my time. Thanks for the convo",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": []
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Fun-Cricket-5187",
                                                                                                    "body": "Let me just outline your politics as I understand them so I know what you're talking about.\n\nYou want a socialist revolution of working class which seize the means of production via the state. Get rid of all the capitalists and replenish society with the captured surplus rightly due to the oppressed. There is no rich or poor, but an emancipated community free of bourgeois parasites to free up their time and expend fruitful human energies in the new socialist reconstruction, working together collectively.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NineTowns",
            "body": "The labor movement is only useful inasmuch as it leads to socialism, in that sense worker councils are not the point. But also workers do not own the means of production in any way. Because they are attached to it directly however, they can exert power over it collectively if they choose to, that is why the proletariat is the revolutionary subject.",
            "score": 10,
            "replies": []
        },
        {
            "author": "chiksahlube",
            "body": "Dude, I got banned from r/latestagecapitalism for daring to suggest that Marxist-Leninism isn't the one true solution... That the Mensheviks were probably on to something...\n\nNobody hates Marxists like Marxists.",
            "score": 1,
            "replies": []
        }
    ]
}