{
    "title": "Theory of the capitalist class as superfluous?",
    "author": "ApplicationOk3455",
    "subreddit": "Marxism",
    "rank": 137,
    "score": 23,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Marxism/comments/1i31ulg/theory_of_the_capitalist_class_as_superfluous/",
    "id": "1i31ulg",
    "selftext": "I just learned that in his autobiography John Stuart Mill identified as a socialist, and that toward the end of his life he really emphasized the superfluous nature of the capitalist class. In other words, he thought there was nothing preventing workers from performing all the functions they are made to delegate to capitalists.\n\nNow, the question of Mills' socialism aside, I wonder if anyone here can suggest other political theorists and movements (isms?), historical or contemporary, that really emphasize this self-organizing capacity of the working class. In particular, I'm interested in visions that firmly reject the privitization of the means of production (i.e. it should be illegal for an individual to own a company) and advocate for legally-imposed socialization across all firms (i.e. all workers at every firm must be decision makers), even visions that leave little else changed about liberalism (i.e. a market economy composed of worker co-ops is ok).",
    "comments": [
        {
            "author": "PsychedeliaPoet",
            "body": "Especially from the Marxist approach, the characterization of the bourgeoisie as “superfluous” is one dimensional.\n\nThe capitalists transitioned from historical progression, when fighting for bourgeois democracy against feudal monarchy, for socialized production instead of patriarchal individual production, etc, into historical reaction when attempting to preserve those traits against the socialization of administration and distribution. \n\nAfter the fall of the monarchies, and since the first socialist attempts, they now are superfluous and increasingly reactionary - even the bourgeois liberals are conserving the status quo of private ownership.",
            "score": 13,
            "replies": [
                {
                    "author": "Any-Wrangler3975",
                    "body": "The book from a couple of years ago, citizens. Why it’s important and imperative for survival to see ourselves as citizens instead of consumers. Might not be what you’re after but it’s the building blocks to self organisation imo",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zandroe_",
            "body": "I think you are making a mistake in your analysis here. A capitalist is a social role in the production process; it denotes anyone who owns capital. A capitalist can be an individual, it can be a corporation, or the state acting as a collective capitalist. It can also be someone who works for the firm in question. As long as firms exist, the means of production are privatised (divided between private entities).\n\nMarx and Engels predicted that individual capitalists would rapidly become obsolete and their enterprises would be taken over by the capitalist state, with all functions of the capitalists being carried out by salaried employees, but they proved to be overly optimistic about the rationality of the capitalist system. But that's not really what you're looking for.",
            "score": 2,
            "replies": [
                {
                    "author": "ApplicationOk3455",
                    "body": "Interesting. As I understand it there are many differing views on what socialization of the means of production entails. I'm asking for recommendations of readings which see it as worker-ownership of the firm.\n\nWhile I follow your reasoning to the other extreme, where any form of ownership, whether concentrated in an individual or a group, implies a form of capitalism, I think this would qualify even the dictatorship of the proletariat as a form of capitalism. As long as humans are producing goods and services, and exchanging them, there is ownership as you are defining it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zandroe_",
                            "body": "Yes, as long as there is exchange there needs to be ownership. But exchange and production for exchange is what we stand opposed to; the point of socialism is to abolish commodity production and exchange. And the dictatorship of the proletariat is a transitional semi-state that presides over the destruction of capitalism. It is a period of transition where capitalism still exists globally but is being consciously destroyed by the working class. Once socialism has established itself, the dictatorship is no longer necessary.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}