{
    "title": "Carl Schmitt’s The Crisis of Parliamentary Democracy",
    "author": "JonnyBadFox",
    "subreddit": "Marxism",
    "rank": 126,
    "score": 5,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Marxism/comments/1i6vvrj/carl_schmitts_the_crisis_of_parliamentary/",
    "id": "1i6vvrj",
    "selftext": "Hi👋\nI just want to leave here a very nice critique and history of parliamentary democracy. \nSchmitt was a nazi lawyer, but we as the left can learn very much from his critique of liberalism and parlamentary democracy. The text is like 80 pages of pure destruction of it. Read it and learn the arguments. He critiques mostly the form of democracy during the Weimar Republic, but many points can be generalized to other forms in the west.\nHere’s the text:\n\nhttps://github.com/CesarShaffer45/Library/blob/main/Crisis%20of%20Parliamentary%20Democracy%20-%20Carl%20Schmitt.pdf\n\n(Why the downvote? The left finally has to learn from its enemies) ",
    "comments": [
        {
            "author": "Public_Utility_Salt",
            "body": "I'm reading through this currently, and so far I can't say I'm especially convinced. It really reads like a cliche of a lawyer trying to get his guilty client off the hook.\n\n>\" If for practical and technical reasons the representatives of the people can decide instead of the people themselves, then certainly a single trusted representative could also decide in the name of the same people. Without ceasing to be democratic, the argument would justify an antiparliamentary Caesarism.\"\n\nThis is some \"well actually...\" level of reasoning.",
            "score": 2,
            "replies": [
                {
                    "author": "Public_Utility_Salt",
                    "body": "That said, his point about reasoning in democracy as a facade for politics based on interests, is interesting. I think it's too one dimensional, but it's certainly not false either.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}