{
    "title": "Kritikpunkt-Article: \"Dimitrov's wet nightmare, Capitals last resort\" - Trump's inauguration is attended by a number of monopoly capitalists, one even loses his arm.\nWhy the American capital class is so openly turning to fascism.",
    "author": "Holiday-Ad8875",
    "subreddit": "Marxism",
    "rank": 121,
    "score": 23,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/Marxism/comments/1i7cfec/kritikpunktarticle_dimitrovs_wet_nightmare/",
    "id": "1i7cfec",
    "selftext": "*Hello Comrades,*   \nThe linked article is regarding the influx of american monopoly capitalists, especially big-tech, to fascism - and the reasons behind this. \n\n# An excerpt:\n\n  \n\"With the development of the **trade war** between the US and China on the one hand, and the intensification of the **material contradictions** that jeopardise the volume of profit internally on the other, US capital has chosen the currently most **reactionary representative** of US capital, **Donald Trump**, to continue its arch-reactionary economic and ideological course.\n\nThis is not a miracle, but a logical development of the **decay of the material basis** \\- the MAGA superstructure allows the representatives of US capital to take radical courses and at the same time decree them as consequences of **woke-ism and other spectres.**\n\nThe reactionary development of the prevailing ideology in the United States also allows the owners of capital to ensure that horrors like ‘**Occupy Wall Street**’ will not happen again for the time being - the focus is too fixed on the “**illegal immigrants” and the “culture war”**.  \n**Dimitrov lives.\"**\n\n**Read the article here:** [**https://kritikpunkt.com/2025/01/21/dimitroffs-feuchter-albtraum/**](https://kritikpunkt.com/2025/01/21/dimitroffs-feuchter-albtraum/)  \n**Support us on Instagram here:** [**https://www.instagram.com/kritik\\_punkt/**](https://www.instagram.com/kritik_punkt/)\n\n*Thank you for reading!* ",
    "comments": [
        {
            "author": "Blitzgar",
            "body": "To the extent that capitalists make themselves dependent on government and the rent seeking and regulatory capture that this parasitism of government brings about, fascism will follow. Fascism is an extreme distortion of free markets. It ultimately is anti-capitalist but that's usually not visible to the sad and sorry fools who fall for its camouflage. Eventually, every group becomes enslaved to the Party, or whatever specific fascist organization is pulling the strings. This happened in Germany and Italy, where capitalists found themselves free to do only what the party wanted them to do. Had the Third Reich continued long enough, there would have been no capitalists. There would have been Hermann Goering Works, subsuming everything. all run by and for the Party. This is pretty much like Stalinism, but with a different devil to hate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Trap_Ritual",
            "body": "I’d say fascism started in UsA when they began sending large amounts of jobs overseas and taking corporate buyout money. Basically it’s been a snowball effect and now, we are seeing the boulder coming. This and the media just spewing blatant propaganda constantly and voting in general being a complete joke. It’s been gradually getting worse for 25 years or so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coolgobyfish",
            "body": "I am going to argue that fascism was already here since Biden: big tech de-platforming people, extreme sensorship on social media and TV,  purposeful influx of illegals to provide slaves (cheap labor),  propping up nazi regime in Ukraine, promoting gay/gender ideology to take movement away from labor",
            "score": -1,
            "replies": [
                {
                    "author": "Bronze_Zebra",
                    "body": "Look I completely disagree with fascism being the dominant ideology of the ruling class, or even substantially influential at all. But if you do hold that view, I respect the fact you can see that it didn't start with Trump and it doesn't come with a political color.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "coolgobyfish",
                            "body": "When Biden was in charge, my posts on social media were sensored.  When I was going though a border at the airport, I was detained and my phone was forcefully taken away so they can document my social media accounts.  But these people are worried about Trump?    I was also forced to flee Ukraine, as Biden's cronies were literally murdering all left wing people there.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bronze_Zebra",
                                    "body": "You forgot to read the pre approved criticism for Biden.\n1. Gaza\n2. Being old \n3. Being white \n\nCan't mention anything else or you are a secret Trump supporting Nazi. Don't you know he is the most progressive president ever? \n\nDon't look at the expansion of government involvement with social media censorship, or them creating organizations to effectively and efficiently track down sources of \"misinformation\" and ban them. Also forget about the fact that Biden continued most of Trump's policies, the same ones they used in their campaign to scare voters into voting for Biden.\nLet's not forget the Pro democracy Democrats that ousted Bernie after he was gaining steam. Then hid Bidens deteriorating condition while literally shutting down primaries for other candidates. Then last minute threatened Biden to step down from the election or they would deem him unfit to lead, and placed a candidate that couldn't muster more than 2% vote share the last time she was in an election. \n\nAnd any time you point any of this out, it's always the same tired responses. You're just a Republican, trump is worse, what about x trump did/will do, what about y Biden did do/ tried to do. They cannot fathom a criticism of Dems not being right wing, nor realising both the political parties in the US are rightwing capitalist parties.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}