{
    "title": "What is the Marxist attitude towards the CPUSA?",
    "author": "Vast-Lime-8457",
    "subreddit": "Marxism",
    "rank": 112,
    "score": 64,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 84,
    "url": "https://www.reddit.com/r/Marxism/comments/1i9wzye/what_is_the_marxist_attitude_towards_the_cpusa/",
    "id": "1i9wzye",
    "selftext": "The Communist Party of the United States of America (CPUSA) is a communist party of the US formed in 1919 following the Russian Revolution. The CPUSA is still active, but was once more active when they contested in elections more frequently. The CPUSA hasn't contested in a presidential election since 1984 and has not ever wona large enough amount of seats or votes to have any real impact. \n\nI am curious to know what Marxists think of the party today. Are they really communist and do Marxists endorse them? ",
    "comments": [
        {
            "author": "Muuro",
            "body": "Bad. Revisionist. Controlled opposition. There might be good people on the local level, but the party platform is garbage and leadership is terrible. They are basically an extension of the Democratic party like DSA and have been for decades. This largely happened in the Browder era when the New Deal happened and has only gotten worse.",
            "score": 121,
            "replies": [
                {
                    "author": "ProletarianPride",
                    "body": "As someone that has been a member of both DSA and CPUSA, the DSA has actually shifted to the left of CPUSA and has genuine internal democracy. The last conventions of both show that. \n\nThe CPUSA convention showed all the same leadership reelected and the squashing of descent and the DSA convention showed Marxists and other far leftists gain a majority in leadership over the liberals and moderates.",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "sakodak",
                    "body": "I see a lot of people saying what organizations are bad, but there doesn't seem to be a consensus as to which groups are good.  Going by just membership the DSA seems the most promising for a movement, but I see a lot of people complaining about them for vague reasons. \n\n\nAs a newish leftist, and seeing as there seem to be a lot of people moving this direction:  who should we be putting our support behind? \n\n\nSo far I've been taking the advice of \"join anything,\" and since the DSA is in my area that's what I'm leaning towards putting my efforts into.  But if there's something better in open.  So, who? \n\n\nShit is happening now, and I'm frankly not interested in how many socialists can fit on the head of a pin theology nonsense, I want to put actual effort into something that can do some actual good.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "phyrigiancap",
                            "body": "Ask a Marxist which group is good and they'll say whichever group they're in the orbit of or a member of, ask which is bad and they'll say the rest.\n\nI'm no exception except that I don't even have faith in the particular group I am or was in orbit around. Their politics are good they uphold the political tradition of Orthodox Leninism, have a line through Cannon and Trotsky, but they don't seem to be particularly caring in growing their movement and feel at this point more an academic institution than a proletarian one.\n\n\nEvery group has down sides some more severe than others. My advice is don't join a group and adopt it's politics, read, form an opinion debate and grow into a group based on that. Joining a group just to join a group is more likely to land you in a pseudo cultlet or an ineffective hype squad than it is to do anything productive.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "giltgarbage",
                                    "body": "Get involved in the most Left active mobilization you can find--whether it is groups working against deportation or landlords or prisons or.....  Pick a battle that is real, not a non-profit boondoggle, and show up.  Learn by doing and having different networks open up.  Join membership orgs and Marxist reading groups, too.  There will be a lot of overlap.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "blkirishbastard",
                            "body": "Here's my experience: DSA is robust and very active but has some structural problems that often make it kind of impotent and tends to skew white and affluent.  PSL is a lot smaller but more radical, decisive, and diverse but has a top down structure akin to old M-L parties that may or may not be your thing and can often devolve into a culty atmosphere.  They also primarily receive their funding from a left-wing billionaire named Neville Roy Singham, as opposed to the dues-based structure of DSA.  The culture varies GREATLY by chapter in both cases.  \n\nDSA tends to prioritize the \"D\" over the \"S\", which means they have to hold a membership vote on nearly every decision that the group makes.  This can be paralyzing in my opinion, and makes locals often reticent to participate in local coalition work with other groups because they cannot offer their members the same level of democratic control.  So DSA tends to do a lot of its \"own thing\", often reinventing the wheel and going down blind alleys.  They do a lot of excellent labor support work but in my opinion have struggled to find their footing on other issues.\n\nPSL practices Democratic Centralism, which means that the national org basically decides what the priority campaigns are, although local votes are still held on some decisions.  Sometimes this works really well, as PSL was given the order to throw everything into supporting Palestinians on October 8th, and it shows.  They've been a key part of that movement in most cities.  I've never been a member of PSL like I have with DSA but part of that is that they require a 9-month \"onboarding\" to make sure that you are ideologically aligned with the chapter.  PSL also runs its own candidates whereas DSA tends to run people as Democrats, although not always.\n\nSo there are meaningful structural and ideological differences between the two, even if they tend to work in concert.  If you want an org that prioritizes direct democratic decision making and working within the framework of American bourgeois democracy to achieve wins for the worker's movement, go with DSA.  If you want a more old-school Communist style org that explicitly aims to overthrow and supplant the state but has a more authoritarian approach to decision making that assumes you're on board with Marxism-Leninism as an ideology, go with PSL.  Both have strengths and drawbacks that are structural and not just about the kinds of personalities they attract.  \n\nMostly you'll be flyering and going to reading groups with either one though and occasionally you'll get involved in good fights when things align.  My experience has been that issue-focused organizations are a lot more effective than the ideological ones in the US and are often anti-capitalist too depending on the issue.  Your mileage may vary.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "lofrothepirate",
                            "body": "DSA is the one and only left political organization in the US that has a realistic chance of wielding any kind of actual power in the foreseeable future. It sucks in a lot of ways! But it’s the only game in town if you are interested in actually accomplishing anything* beyond showing off moral or intellectual superiority. And there are just as many Marxist reading groups and theory discussions there as in any other left organization.\n\n*At least in terms of explicitly leftist, explicitly political power. You can of course do a lot by organizing a union at your workplace or being part of mutual aid networks in your community, even if those are not explicitly Marxist organizations.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "DumbestColt50",
                            "body": "Join an org that does Marxist theory and praxis. The DSA does not do that. They're just the left wing of the Democratic party. There might be Marxist wings, but they're not at all powerful enough, or 'marxist' enough. At the moment, the PSL seems to be the best option for any Marxist in the US, but even still it's not as good as it should be",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "sakodak",
                                    "body": "So, once again I'm being told to not join the biggest org, and the only other org you mention also \"isn't as good as it should be\" and no *positive* suggestions. \n\n\nYou see why this is a problem, right? \n\n\nAm I missing something? \n\n\nEveryone:  organize!\n\n\nMe:  ok!  Here? \n\n\nEveryone:  not that one! \n\n\nMe:  ok, which? \n\n\nEveryone:  just not that one!  Not that one either!\n\n\nMe:  ok, then what do I do? \n\n\nEveryone:  organize! \n\n\nThis is not a healthy political movement.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Intrepid_Layer_9826",
                                            "body": "I think that if you want to educate yourself more on marxist theory you should join any of these organisation (if they hold regular reading groups on marxist classics).\n\nBeing a big organisation doesn't necessarily mean they're revolutionary. The labour party in the uk is and has been the biggest, broadest leftist organisation in the country, and rank and file marxists have even organised under its banner for a time until they got purged, but it doesn't mean the leadership of the party is or was ever revolutionary. \n\nHow would you define a healthy political movement?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "sakodak",
                                                    "body": ">How would you define a healthy political movement?\n\n\nLet's just say that I consider myself to be a relatively smart person, but the main barrier to entry of getting involved with the left in the imperial core seems to be confusion inflicted by other leftists.  I get that there is a long and storied history of the fractal nature of leftist movements, but I think it would be good to do less Life-of-Brianing, especially around newbies.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "sirhanduran",
                                                            "body": "Here is the Marxist strategy in a nutshell:\n\n- Give up on electoral politics and reform. They are self-defeating wastes of energy. By all means vote with your conscience as an individual, be involved in local politics if it seems right - but know that the systemic problems we face will *never* be on the ballot, because capitalist democracy will never permit fundamental threats to capital to be up to the popular vote in *any* capacity. If your goal is socialism, electoral orgs will never get us there.\n\n- Also give up notions of terrorism and \"propaganda of the deed,\" and individualistic anarchism that recognizes the problems we face yet retreats into isolation, paranoia, and desperate violence. Marxism isn't merely about blowing things up, it's about organizing and building the future with intention. [\"If we oppose terrorist acts, it is only because individual revenge does not satisfy us. The account we have to settle with the capitalist system is too great to be presented to some functionary called a minister.\" (or a CEO)](https://www.marxists.org/archive/trotsky/1911/11/tia09.htm)\n\n- Instead, study Marx. Study his analysis of capitalism's strengths and weaknesses, how it built power historically and holds onto it now. Then study the men & women who took his teachings and applied it to the real world. See how only Marxist communists tend to actually complete their revolutionary program in *any* meaningful capacity (no, there has never been perfect revolution or communism immune from criticism; this entire project is hundreds of years in the making). See how the small number of non-Marxist popular socialist movements are uniformly crushed with police, military, money, and assassinations. See how mere violence in response does not create lasting victories or lasting power. Only Marxists tend to terrify capitalists, because Marxists can take the seat of power and *hold it*, using the forces of the entire working population, and intelligent, clear-eyed leadership.\n\n- Studying the history of 19th-20th c. revolutions, failed and successful, will clarify a few things for you. One of which is the *vital importance* of leftist infighting - or to put it another way, *the struggle for leadership*. We *need* to have a clarified program, strong mutual principles, an understanding of the strategies that will or won't work. The late 19th and early 20th centuries are absolutely littered with failed leftist movements, reversals and betrayals, but there is a reason Lenin is still so admirable all these years later. The key to Marxist revolution is creating class consciousness (we may never have been closer in the past 100 years of American history), organizing the newly awake & radicalized working classes under clear leadership, seizing control of the means of production across every industry (which in capitalist terms translates to \"grabbing the ruling class by the balls\"), and establishing new government. The decisions made along the way are not arrived at by emotion but careful logical reasoning and a firm understanding of how things stand. Sometimes it's the time for war, sometimes it's the time for peace, sometimes you regroup, sometimes you press ahead. We don't make these decisions blindly (if we can help it) but informed, with our eyes fixed on the goal.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Gertsky63",
                                                                    "body": "If you value Lenin and the experiences of the 20th century revolutions, perhaps it would be an idea to consider what they took great pains to teach future generations, literally in writing with worked examples from their own practice, about how they integrated flexible tactics with their revolutionary strategy. That included standing in elections, but doing so in a completely different way and with a completely different set of objectives than those adopted by parliamentarist and reformist parties. There is a whole book by Lenin on this.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "TheMicrologus",
                                                            "body": "Part of the issue is that we are in a Life-of-Brian era moment right now; part of it is you're asking about the topic on a Marxism forum when DSA isn't a very Marxist organization. The good news is there was never a perfect time or a perfect org, so I'd just say: pick one and go!\n\nGiven what you say about yourself, I'd say try one of two things:\n\n1. If you live in a big city or your small town DSA chapter seems robust, go to some DSA stuff. The bigger chapters are active and have a lot of internal debate, which is the best thing for feeling like there's real foment and possibility.\n\n2. If you are in a smaller town, see which org looks bigger and busiest. In small towns, DSA chapters are sometimes dominated by a smaller group, so they can be just as sectarian as your local People's Front of Judea. If the PFJ has more going on and their views/activities seem cool, try it.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DumbestColt50",
                                            "body": "I did say don't join the PSL. The PSL overall a good organization to join, and you should join it, but I just have some criticisms of the party, particularly about its organization. \n\nSo to be completely unambiguous, join the PSL. It's good for any Marxist to join it because they follow the theory of Dialectical Materialism, unlike the DSA.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EDRootsMusic",
                    "body": "Not so much controlled opposition as ignored opposition. The US government hasn't particularly cared about the CPUSA since the end of the Cold War, and maybe even since the 70s. They lost their influence even within the left when the New Left and the New Communist Movement arose.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "InLeague",
            "body": "I was a member. Leadership is either actively trying to sabotage attempts at meaningful organization or they are profoundly incompetent. If the results are indistinguishable, does it matter? \n\nMy experience is that it was primarily a book club focussing on theory, with the occasional group seminar focusing on progressive issues, though to be fair, this was during Covid.\n\nAt one point I stopped receiving as many e-mails and calls from anyone in national and reached out to state to ask if there were any issues - 4.5 months later I received a response that he could not find any indication of who I was or that I was ever even a member or applicant… yet I still had my membership card and had been participating with our local CPUSA group as a member in the meantime. Not only were my own dues paid, I had covered the dues for others a few times as well. My participation gradually slowed to a halt when it became apparent that there really wasn’t any drive to do much of anything and my attempts to interact with state yielded no results.  \n\nA few years later (this past July) I discovered that National/State had dissolved the entire local club I had been a member of (Austin) for prioritizing mutual aid (in addition to theory) and working with groups similar to the Black Panthers. Apparently after I stopped bothering someone else was more successful than I was in gaining some traction, and CPUSA could not tolerate it. They are an impediment to the left.",
            "score": 50,
            "replies": []
        },
        {
            "author": "Thanaterus",
            "body": "They're \"edgy\" democrats at best.  Middle class slobs with too much time on their hands.  They recently referred to the bougious US government as \"our democracy\", which should tell you everything you need to know",
            "score": 52,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -21,
                    "replies": [
                        {
                            "author": "Thanaterus",
                            "body": "They posted the \"our democracy\" thing on their Twitter account.  They aren't Marxist-Leninist.  They aren't \"communist party USA\".  They are \"menshevik party USA\"",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "I’d direct you to the CPUSA website and specifically this article: [Action steps to help build Resistance 2.0](https://cpusa.org/article/the-next-sixty-days-report-to-cpusa-national-board/). For one framing this movement as towards a revamp of the 2017 era Resistance is just asinine to me before we even get into the rest of the article. A Communist Party should be framing what is necessary as Revolution and building Revolution not Resistance. I’m not saying that the CPUSA should be launching a revolution today, rather I am saying that should be how they frame their goal not as simply just “Resistance”. \n\nNext, I turn towards this section which is so asinine it is unbelievable “Appoint Judges\nTell the Senate: Do Whatever It Takes to confirm the 47 judicial appointments pending before Trump takes office. The courts are already stacked with Trump appointees from his first term. This effort is being led by all the organizations and labor that mobilized for the elections.” Are you seriously telling me that a “Communist” Party’s second listed step in this all is that the Senate needs to confirm Democrat Judges? This comes in the list before taking Cuba off the state sponsor of terror list, or an arms embargo, or steps to oppose Trump’s mass deportations. Is this really what is more important to CPUSA, it being higher on the list would certainly imply that.\n\nThat’s just the beginning of it. As for your noting that they have fraternal links to orgs, ok? Like you list the CPC, which you know I personally think is funny to list as proof that the CPUSA is a Communist Party, but that’s not the larger point. Let’s look at who you didn’t list. Looking at the International Meeting of Communist and Workers’ Parties or the (IMCWP)’s website which is a major point of international connection you can find [this list](http://www.solidnet.org/links/communist-and-workers-parties/) of parties they have relations with. A lot of these parties are quite asinine imo, but I’ll list the ones which should be universally as reflecting revisionism and kinda tearing apart the idea they have bonafides on the international stage. One of the parties on the list is the Japanese (JCP) which is a flagrantly revisionist party which only cares about parliamentary participation. And I am pretty sure they openly abandoned Leninism like either at the time of the fall of the Soviet Union or right after. Another egregious example is the KPRF in Russia, which is flagrantly revisionist both in their participation in electoralism to the exception of everything else. But also in how they support the participation of the Russian government in the inter-imperialist conflict in Ukraine.\n\nI could go on and on about the flagrant revisionism of the CPUSA or its fraternal parties. But the point is clear, they are a joke who care more about basically the same things as the Democratic Party over what you would think would be more important such as support for Palestine or Cuba.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Joe Biden's administration spent the entire last year actively aiding and abetting a genocide, as well as doing such an impeccable job manufacturing consent for it by claiming Hamas ***'beheaded over 50 babies'*** even though there was no evidence whatsoever.\n\nThe Democrat Party is a fascist party. The difference between them and Republicans is that Democrats want to push it out to the third world whole Republicans want to bring it inward. Why should the poorest parts of the world suffer it more-so than the ones who are responsible for it uprising in the first place?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -18,
                    "replies": [
                        {
                            "author": "Thanaterus",
                            "body": "Objectively it isn't a \"democracy\" for anyone other than the bougeiouse.  Read Marx.  Or, as CPUSA says, \"read Lenin\".  But unlike balding, \"dad-bodes\" CPUSA members, actually do it.\n\n\"Democracy\" that is owned by zionists and corporations.  Menshevik party USA",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Thanaterus",
                                            "body": "Historical materialism motherfucker, do you know it?  Who forms the government, religion, philosophy, etc of a society?  Guess who doesn't do those things.  Guess who does\n\n\"Our democracy\". You people are a disgrace",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "EasyTumbleweed1114",
                                                    "body": "Primarily the elite yes, and the rich have disproportional power within our system. HOWEVER there are many parts of our society the rich hate, such as unions, the social welfare state, taxes, regulations etc. Yet why do they exist? Because on some level the people do have a say, because we are a democracy. You can admit that while also saying its flawed, and that communism would be far more democratic.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "Ok-Investigator1895",
                                                            "body": "Bro, do you think \"the rich\" are some monolith with the exact same interests?\n\nJust like the proletariat is divided without class consciousness, the bourgeoisie is divided on most things that do not directly involve their class relation to the means of production. \n\nHence, different members of the bourgeoisie and their representatives in Congress pitch different ideas on how to resist the tendency of the profit rate to fall. \n\nIn some cases, this takes the form of bourgeois support for unions.  In others, it takes the form of monetary policy meant to stimulate demand. (See: the New Deal) \n\nAll of these policies you appear to think were granted via \"democracy\" have also been overturned via \"democracy.\" To use unions as an example, the might of the working class forced concessions in the form of the NLRB, following this, the Taft Hartley act was passed. Directly repealing the most useful stipulations of the NLRB that actually would lead to change. \n\nSo to sum up, you have used instances where rights and privileges were fought and bled for, and then repealed in the democratic process, to argue that proletarians have a place in the democratic process as it exists under capitalism. \n\nLib.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "EasyTumbleweed1114",
                                                                    "body": "The rich have certain class interests, as do the poor, it does not suit the interests of the rich for unions to exist, the fact they do, even in a weakened form, shows an extent of democracy.\n\n>All of these policies you appear to think were granted via \"democracy\" have also been overturned via \"democracy.\"\n\nCorporate fuckers buying politicians to do their bidding isn't democracy it is the undermining of democracy, as I pointed out above our democracy is weak and doesn't go far enough, you seem to think I am one of those \"end of history\" types.\n\n\n> Hartley act was passed. Directly repealing the most useful stipulations of the NLRB that actually would lead to change. \n\nYes, the rich have disproportionate influence, it isn't accurate to say that unions and nlrb can't lead to positive changes to workers even when undermined, ask car factory workers who get paid 60k a year with strong benefits about how useless unions are. But anyway, the fact that unions have had to be slowly destroyed over many decades, rather than just outlawing them or whatever, shows a certain level of democracy. Every single business owner would gladly destroy unions, but they can't fully, because to an extent there is a democracy.\n\n\n>where rights and privileges were fought and bled for,\n\nI am aware of the history, I am also aware that we don't need to risk getting shot everytime we got on strike because of democratic concessions won.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pedmusmilkeyes",
                            "body": "I could see Marxist-Leninists siding with one of the bourgeois parties to preserve liberal values. But did CPUSA defend liberal values and Democracy when the federal government was gutting the Left through Cointelpro and The Patriot Act with the consent of both parties?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Muuro",
                            "body": "It's a democracy, and that's why it's bad. Calling it \"not a democracy\" because it isn't a parliamentary democracy is a difference that is not worth the time to discuss as a Marxist and a communist.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comrade_Corgo",
            "body": "I would take anything you read online with massive grains of salt. There are many who identify as communists online but have never actually tried being in an organization. There is probably a mix of state-sponsored propaganda out there (like maybe the US State department is trying to convince online communists that all the existing communist parties are terrible, so you shouldn't bother joining one nor try to make them better). Some parties have really good branches in some places but inactive and disorganized branches in other places.\n\nIf the only options you have are CPUSA or doing nothing, try it out. You can always leave it later if you are ready for a different, better option. Starting a new branch for even the best party out there is going to be difficult if you lack any organizing experience. I have no personal relationship nor reason to defend specifically CPUSA as a member of PSL, but I see a lot of comments online where people tell others that all of the existing parties suck, and the practical result of that is that people don't join any party and therefore those parties can't grow or evolve.\n\nThe main takeaway you should take from my response is to *do something rather than nothing.*",
            "score": 9,
            "replies": [
                {
                    "author": "artificial_itsu",
                    "body": "This is also my experience. The left desperately needs people to join any organization. In real life different orgs are often working on the same campaigns at the lowest levels, so this type of online discourse that provides only criticisms (however valid) harms the movement by discouraging people from doing anything (since valid criticisms exist of every organization)",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bolshivik90",
            "body": "They're a joke which has abandoned all pretences of being communists and Marxists.\n\nA party which tells workers to vote Democrat as the \"lesser evil\" - i.e. to vote for a bourgeois liberal party which *never* served the interests of the working class - is a party which history will justifiable forget about.\n\nThis would be like the Bolsheviks telling workers to vote Cadet.\n\nThe working class doesn't need the CPUSA.\n\nI wouldn't give those charlatans any further thoughts.",
            "score": 19,
            "replies": [
                {
                    "author": "RNagant",
                    "body": "In fact the Louisiana branch of the CPUSA lied and defended their position by arguing that *the Bolsheviks advocated for voting for cadets*, characterizing disagreement as \"Trotskyism.\"",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Bolshivik90",
                            "body": "Wait they really actually argued that? Unbelievable.\n\nIt's amazing that as a so-called Marxist party, they have completely failed to understand that it is *precisely people's disillusionment in the Democrats* and the lack of a genuine socialist alternative, that are major factors in Trump's ascendency, and tell people to vote for the very party most workers (rightly) hate.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jonna-seattle",
            "body": "The CPUSA has a tremendous history - good and bad. A key and fatal flaw is their strategy of aligning themselves with the \"progressive wing of the bourgeoisie\"... like in 2016 they at least initially supported Clinton over Sanders. Say what you want about Sanders being a social democrat (which I consider damning praise in the context of US politics) but in practice their tactics sabotage working class militancy and independence.\n\nThis is all the more egregious in union activism. They famously supported the \"no strike pledge\" in WWII, which alienated the CPUSA trade union activists from other union militants. This allowed the right wing collusion between union bureaucrats and corporations and government that drove the CPUSA out of the organized working class during McCarthyism because the mass of the workers in most unions didn't see the point in defending them (aside from a few unions like the ILWU and the UE). This (and the terrible and ongoing legacy of racism) is a major reason for the isolation of the radical left from working class politics in the US; it's far worse than other capitalist countries where the left still plays some role in unions and the working class.\n\nOld line CPUSA activists (whether older cadre or those who follow them) still repeat these mistakes; supporting or taking appointed positions in unions instead of only elected positions, which leaves them vulnerable to being silenced or removed from taking on reactionary leadership. Their practice may lead them to be good unionists in some circumstances, but loyalty to leadership instead of the rank and file is a fatal flaw. I've seen this in practice over the years. Tho if I ever do happen to meet a worker in the CPUSA I do my best to see them as an individual until they parrot the party line.  \n\n\nThe CPUSA can always point to some principled activsim and militants. They had comparatively good politics on race in the US for example.",
            "score": 11,
            "replies": []
        },
        {
            "author": "ProletarianPride",
            "body": "Was a member for a short time. The party lacks genuine democracy and is horridly revisionist. In my opinion, it needs to be allowed to die so it can get out of the way of whatever genuine party maybe trying to form.",
            "score": 6,
            "replies": []
        },
        {
            "author": "TrapaneseNYC",
            "body": "Not great, many issues. I'm glad they are trying something tho since sadly 90% of marxist is relegated to online debates. But they need a ground up rework to really be efficient and effective.  Outreach sucks too.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ultramisc29",
            "body": "The CPUSA is blatantly revisionist. They are essentially social democrats.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 5,
            "replies": []
        },
        {
            "author": "blkirishbastard",
            "body": "CPUSA was decimated during the McCarthy era, what remains is a shell of its former self that occasionally gets puppeted around by the Democratic Party.  DSA and PSL are the only really viable Marxist parties in the US at the moment and while they have their own issues, I definitely would not waste your time with CPUSA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "It is my opinion that while the CPUSA still has the potential to be a legitimate political force, it has stagnated into irrelevance at this time. The lack of true forward-thinking programs and policies, combined with essentially becoming water carriers for the Democratic Party, has wrecked its reputation and thus its ability to get anything substantial done for the people. \n\nWhat I think should be done is to remove the sitting CC and, for a period of time, manage the Party directly via the National Assembly. Revisit the Party Constitution and Program, and once those are approved implement them and enforce their rules and provisions consistently throughout the organization. Branches of the Party, from the local Club up to the National Assembly (and the forthcoming CC) must be completely on board; those individuals or Clubs that are not may be removed from the Party membership immediately. (TO BE CONTINUED)\n\nThe question is how to effect these changes? It is my thought that the Party needs new blood, new ideas, and a revitalized existing membership. It is through these that change may be brought about, not simply engaging in debate after debate with the entrenched current leadership nucleus. \n\nAll in all, I like the idea of an old-line Communist Party continuing the fight for the working class; I just don't think the current direction of the Party is helping to achieve that goal. The fight remains the same and to carry on that fight the Party needs to return to its roots. I don't say this from a reactionary perspective, only that of a member who sees the Party straying into Establishment roles and 'cancel' and 'woke' and and any other 'culture' that takes the focus off of it political and revolutionary purpose. \n\nWe can- and should- do better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "off_the_pigs",
            "body": "Revisionist, Democratic Party- tailists. The U.S. isn't at the stage where we are ready for a vanguard party; class consciousness is not there yet. Organization is the key right now, especially in forming a united front with other anti-imperialist groups that aren't necessarily \"communist.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "heroinAM",
            "body": "CPUSA is pretty much controlled opposition, but check out PSL, or even DSA. How radical and effective they are (especially in the case of the latter) highly seems to depend on which chapter, but both in my area do a lot of real world good work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -11,
            "replies": [
                {
                    "author": "DaringCatalyst",
                    "body": "Why do you tail the democrats and why do you expel militant members",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bolshivik90",
                    "body": "Why did/does your party tell workers to vote Democrat? There is zero justification for that from a Marxist standpoint. Absolutely zero.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ownthepibs",
                    "body": "CPUSA is a fucking joke and hasn’t been relevant since the 60s. Hasn’t had a correct political line since the 30s (maybe)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sirhanduran",
            "body": "Marxists largely don't bother running for office under capitalist \"democracy.\" It's kind of pointless, which observing the DSA can teach you: they don't even fundamentally threaten capital and they will *still* be sabotaged & stymied long before achieving any power, or those that slip into the system will have the unenviable choice between submission to the powers that be or total isolation (Bernie, AOC).\n\nThe point is that capitalists will never let us take power from them through the elections they oversee, nor interfere with their profits; that's why revolution is necessary. Actual communist organizations focus on unionizing first, turning the means of production against their masters, and using that leverage across all industries for general strike and general revolt.\n\nA communist running for president is at best a publicity stunt.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RNagant",
            "body": "They're neo-Browderite popular-frontists lead by liberal bureaucrats who make democratic struggle within the \"party\" and unfication of the broader revolutionary movement impossible. Likely the worst of the various sects, with the silver lining that they at least have radicalized their rank and file against their own leadership more effectively than perhaps any of the others. Likely careening towards self liquidation if nothing changes.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Partapparatchik",
            "body": "What do you mean by a Marxist attitude? You won't find any Marxists here, and apparently you don't want to actually read Marx to figure this out. They have nothing to do with the proletariat in any form, and they fail to even be a sect or even be pseudo-communists correctly; it's essentially a social club for losers.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Big_Rough_268",
            "body": "You people always think communism good capitalism bad. But don't provide real world examples of how you came to that conclusion. It's always ideological examples that don't hold their weight in the real world. Money matters to the human psych. It correlates psychologically to power and nobody handles power very well.",
            "score": -7,
            "replies": []
        }
    ]
}