{
    "title": "Books like Manufacturing Consent",
    "author": "daveid_music",
    "subreddit": "Marxism",
    "rank": 105,
    "score": 41,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 43,
    "url": "https://www.reddit.com/r/Marxism/comments/1ibn0c3/books_like_manufacturing_consent/",
    "id": "1ibn0c3",
    "selftext": "I really liked Chomsky and Herman's \"Manufacturing Consent\". It changed the way I think about foreign policy and mainstream media.\n\nDoes anyone have any suggestions for books that cover US History / World History from alternative-to-the-mainstream perspectives --- preferably from the marxist perspective? I am not a well read student of history; I would like to learn more about working class struggles and the problems caused by imperialism without accidentally indoctrinating myself with bourgeois narratives. \n\nA couple of other books in a similar vein I have read are \"Oil!\" And \"The Jungle\" by Upton Sinclair, as well as \"Homage to Catalonia\" by George Orwell, and \"You Cant Be Neutral On A Moving Train\" by Howard Zinn. Speaking of Zinn, I considered reading \"A People's History of The United States\", but someone told me it was outdated / irrelevant and not worth reading these days, so I moved it down my priority list. Should I give it a shot?\n\n",
    "comments": [
        {
            "author": "windy24",
            "body": "Inventing reality by Michael parenti\n\nCultural hegemony in the United States by Lee Artz\n\nThe Divide by Jason Hickel\n\nA People's History of the World by Chris Harman\n\nCapital and Imperialism by Utsa Patnaik",
            "score": 19,
            "replies": []
        },
        {
            "author": "Johnboogey",
            "body": "A people's history is a great book.  Outdated? I don't think so, just missing the last 20 years. \n\nInventing reality by Michael Parenti is manufacturing consents inspiration practically. Same concept but different and better author.",
            "score": 30,
            "replies": [
                {
                    "author": "yugoslav_communist",
                    "body": "parenti struggled with microphones in college halls so chomsky could calmly repeat his less abrasive points.\n\n  \nyes, i also recommend reading parenti. inventing reality and blackshirts and reds.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Skeeter_206",
                    "body": "I don't know if Parenti is a better author, more fun to read, sure, but Chomsky lays out far more sources to hammer home the point, which I think is necessary when trying to prove a point to liberals.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "jonna-seattle",
            "body": "the dirty deeds of imperialism:  \nHow Europe Underdeveloped Africa by Walter Rodney (marxist)\n\nOpen Veins of Latin America by Eduardo Galeano (not a marxist but compatible and a beautiful writer)\n\nthe better parts of the US labor movement:\n\nStrike! by Jeremy Brecher , general strikes in the US\n\nRank and File: Personal Histories of Working Class Organizers by Staughton and Alice Lynd",
            "score": 14,
            "replies": []
        },
        {
            "author": "HikmetLeGuin",
            "body": "Inventing Reality by Michael Parenti\n\nKilling Hope by William Blum\n\nThe Jakarta Method by Vincent Bevins\n\nA People's History of the United States by Howard Zinn\n\nAn Indigenous Peoples' History of the United States by Roxanne Dunbar-Ortiz\n\nHow Europe Underdeveloped Africa by Walter Rodney\n\nA People's History of the World by Chris Harman\n\nThe Darker Nations: A People's History of the Third World by Vijay Prashad\n\nOpen Veins of Latin America by Eduardo Galeano",
            "score": 9,
            "replies": []
        },
        {
            "author": "AmarantaRWS",
            "body": "Not only is a people's history really worth reading, hut many of the offshoot books are too even if they're not Zinn books. A people's history of the world was mentioned here, but I've also found a people's history of science by Clifford Conner and A people's history of the civil war by David Williams are both great. the study of history is as important as the study of theory, and I'd even say the two are extensions of the same school. Economics, philosophy, history, they're all connected.",
            "score": 6,
            "replies": []
        },
        {
            "author": "NolanR27",
            "body": "Did they say why they think *A People’s History of the United States* is outdated? On the contrary, it gets to the heart of American politics as the long quest of the ruling class to create some kind of social stake for white Anglos at the expense of others. For example, a huge reason native Americans groups were a threat to the social order, not only an object of conquest, was the high number of whites going native.\n\nAnd Parenti’s *Inventing Reality* is the superior book to Chomsky’s.",
            "score": 4,
            "replies": [
                {
                    "author": "daveid_music",
                    "body": "They said that they felt it was outdated because many of Zinn's new ideas had since been integrated into my public schools curriculum, and that I wouldnt find the book particularly innovative for this reason. (This conversation took place while I was still in highschool.)\n\nWhile not a marxist, the person I talked to had alot of respect for Zinn, and I very often took this person's opinions at face-value. Looking back, Im not sure how familiar the person was with Zinn's work, so Im not sure really what the basis of their claim was. \n\nThanks for the little taste there; it definitely piqued my interest.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ArminTamzarian10",
                            "body": "Were they a right-winger? I've heard this same talking point from conservatives a couple times, both regarding People's History, and other books. Because they don't read leftist texts and just regurgitate similar talking points they heard from other conservatives. They say things like this to discount leftist books in a non-ideological way, so you don't realize they're discouraging you purely for ulterior motives. They simply know it's a popular book, and believe American schools are leftist indoctrination (lol), and put two and two together without knowing what they're talking about",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Distinct-Menu-119",
            "body": "I just bought Inventing Reality, haven't read it yet but evidently it came out a few years before manufacturing consent, and MC is kind of suspiciously similar in some respects. Tbf they introduced the five filter model but that is more just spelling out the obvious. \n\nThe reason Chomsky books always do better than other left counterparts is because he dresses his work up with an appropriate amount of anti-communism that makes it tolerable to publishers and mainstream audiences.",
            "score": 4,
            "replies": [
                {
                    "author": "daveid_music",
                    "body": "This is the only Chomsky book im aware of to be honest. I know that he was also famous for a linguistic theory of universal grammar or something, but I dont know much about that. I first heard of him when I watched his debate with foucault on youtube, which inspired me to go read a bunch of foucault.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HikmetLeGuin",
                            "body": "Chomsky's *Hegemony or Survival* is worth checking out. There are a lot of good interviews and videos with him online, too. You might even want to check out the movie Manufacturing Consent, which is different than the book but explores some of the same themes.\n\nI will always appreciate Chomsky's analysis of US politics and imperialism. It helped get me into socialism.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sheerdropoff",
            "body": "- Simulacra and Simulation by Baudrillard \n- The Sublime Object of Ideology by Zizek\n- The Society of the Spectacle by Debord\n\nAll very essential readings that expand greatly upon ideas that you were introduced to in Manufacturing Consent",
            "score": 7,
            "replies": [
                {
                    "author": "Inside_Ship_1390",
                    "body": "I recommend Terry Eagleton's Ideology: An Introduction. I'd be interested in knowing what this sub thinks about Eagleton, who also wrote the witty and elegant Why Marx Was Right.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "daveid_music",
                    "body": "Im a big fan of Debord. Im pretty deep in my Hegel reading right now, so Ill definitely read Zizek once I feel comfortable with my understanding of Hegel, Freud, Lacan, and of course, Marx. \n\nAs for Baudrillard, I have two books on my desk Im planning to read eventually: system of objects and the mirror of value i think they are called respectively? Simulacra and Simulation sounds cool, might read it once i get through the two i already have access to.\n\nAlso, my big theory goal right now is Deleuze; not sure what most marxists think about him. Im fascinated by DnR, AO and ATP. I recently just borrowed a copy of Matter and Memory from a professor so I can read Bergsonism soon.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "AcidCommunist_AC",
                            "body": "HG Moeller, a philosopher and youtuber I cherish, has a playlist on various media theories including Chomsky, Debord and Baudrillard.\nhttps://www.youtube.com/playlist?list=PLM0AijAXbZKmRJLOHdzlHZQzoB5K_Gvos",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sheerdropoff",
                            "body": "Zizek is one of my favourites. But yeah should go without saying, keep heading along the track you’re currently heading. You’ve probably already read some of Gramsci but in the case you haven’t you should also bookmark the Prison Notebooks",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArcticFoxismyname",
            "body": "A People's History of the United States radicalized me at a young age. Fuck whoever said it is outdated. That is one of the most ridiculous things I have heard in a while. \n\nGreat text. Important. Required.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AcidCommunist_AC",
            "body": "Paul Cockshott's How the World Works is I believe the most up-to-date historical materialist work examining different modes of production and their transitions into each other. You won't find much dialectics in Cockshott though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D-A-C",
            "body": "Louis Althusser's famous essay Ideology and Ideological State Apparatuses, or if you have time, the now full published work it was taken from,  *On the Reproduction of Capitalism: Ideology and Ideological State Apparatuses*",
            "score": 1,
            "replies": []
        }
    ]
}