{
    "title": "Is Now The Time To Provide An On-Ramp for Liberals?",
    "author": "Svedgard",
    "subreddit": "Marxism",
    "rank": 70,
    "score": 218,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 109,
    "url": "https://www.reddit.com/r/Marxism/comments/1ijm47h/is_now_the_time_to_provide_an_onramp_for_liberals/",
    "id": "1ijm47h",
    "selftext": "I don’t mean the Donor Class obviously but the normal, average Liberal worker, farmer and soldier. As I’m sure most folks who started out would have described themselves as “Liberal” at one point or another and it was only through -Finding- education on the virtues of Leftist thought that they went further left. \n\nGiven the sudden shift of political climate pulling out the Working Class from the Liberal Donor Class appears to a more doable action on part of Leftist groups right now - in the face of open Fascisim and the anger at the Donor Class of the Democratic Party appearing to be doing very little nothing to push back against Trump. \n\n",
    "comments": [
        {
            "author": "Antithe-Sus",
            "body": "We should always work to provide an on-ramp for the masses. The question is, is it easier to radicalize and recruit libs now? I'm not sure the answer tbh, but I think that's the correct question.\n\n If I were to speculate I would say yes because the conditions are sharpening and it's pretty obvious to most people with eyes and brain cells that the Dems aren't interested in fighting, but I don't have anything to scientifically back that up, just an educated guess.",
            "score": 85,
            "replies": [
                {
                    "author": "cheezhead1252",
                    "body": "Funny enough, I think older liberals are open to it. They’ve seen it play out now for decades and many grew up in the 60s as well. My parents said all their  liberal friends have come to them to say they were right not to trust the Democratic Party with saving democracy. \n\nBut younger liberals, judging off of reddit, still dogmatically believe in centrism.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "sakodak",
                            "body": "I wasn't radicalized until my 50s, you may be right. \n\n\nThat said, I definitely don't mean to tell anyone to stop trying with younger folks.  We need to rebuild the left, and fast.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Oatmeal-Enjoyer69",
                            "body": "Those older democrats aren't embracing Marxism, however. They're embracing conservatism. \n\nI'm not even sure how you can pretend that young people aren't embracing the left. They overwhelmingly rejected the centrist candidate.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "cheezhead1252",
                                    "body": "I am not trying to pretend anything. It was just an observation about some of the older generation that I know and what I see of younger liberals, mostly on Reddit. The older folks were willing to admit the Democratic Party had fucked them and admit they were wrong for following them. But the younger folks on reddit celebrate the destruction of Gaza in leopards ate my face because the protest voters didn’t toe the line.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Oatmeal-Enjoyer69",
                                            "body": "If you go on liberal subreddits, you'll see liberals. I'm gen z and I have a pretty large network of friends, coworkers, classmates...etc. many of them are progressives and/or leftists, and many of them are conservatives and/or alt-right. I personally know very few people who are centrist democrats. That's not to say my personal experience is reflective of the generation as a whole, but I will point out that political polarization and the state of the country has pushed many young people to either end of the political spectrum",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Own_Tart_3900",
                            "body": "At one time, \"liberal\" meant bourgeois capitalist, individualistic, the main enemy of the working class.  As Phil Ochs sang- always wanting to be patted on the back and reassured.  What a pain.\n\nBut \"the final crisis\" predicted in The International has taken a long time arriving.  The gradations within the bourgeoisie have gotten more complex. Not all of them are rent seeking exploiters. Many members of the working class are now stockholders.\nThe strength of a super-rich reactionary elite grows. Expect increased use of the law and police against the working class movement's ability to organize and make its voice heard. We may be on the verge of a detour into authoritarianism or full-blown  fascism.\n\nProgressive forces need to recruit all the allies they can find to carry the struggle forward. As happened in the 1930's under the Popular Front, it's time for the working class movement to enter a coalition of the willing to defend democracy, human rights, human decency, and the hope for real progress for a future of freedom and justice.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Conscious-Wolf-6233",
                    "body": "I think it’s easier to talk to “conservatives” in the USA. They admit to themselves the government is corrupt and lying, Liberals really seem to love the idea giving all kinds of deadly power to it. They have this pie in sky fantasy and it’s just weird. I’m not saying I understand conservatives: for all they’re whining about no trusting the government, they still love cops and coups and shit. The whole thing is weird.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Antithe-Sus",
                            "body": "Idk, both are annoying for different reasons, but definitely conservatives have way better intuition than Dems. Like it's so funny they wanna destroy imperial soft-power projects such as the USAID, I think deep down they intuitively understand there's something evil about these institutions because it's weird that the US government is \"helping\" foreigners when it doesn't do shit for them, but they don't have class analysis to understand why, so they lean into a mystified version of reality where some group of evil clandestine actors is using those institutions to do white genocide or whatever.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "AlienInvasion4u",
                                    "body": "My understanding of the conservative opposition to USAID is just \"America First\"\n\nI'd like to believe you, but I just don't think that conservatives are innately against good-guy imperialism.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Antithe-Sus",
                                            "body": "I never claimed that they were, did you even read my post? I literally ended it by saying:\n\n\"they lean into a mystified version of reality where some group of evil clandestine actors is using those institutions to do white genocide or whatever.\"\n\nPlease actually read what you're critiquing.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "yellowcroc14",
                            "body": "I agree, I feel like conservatives come around to the idea that the US government isn’t there to help to working class a lot sooner before liberals do.\n\nThey just can’t wrap their head around that both parties work towards the same thing. Whether if that’s by action or inaction\n\nEdit: embarrassing typo",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "HumanistHuman",
                            "body": "In every example of an actual communist government that has existed, those governments have had a lot more control over their citizens than our government ever has. I think you are the one with “pie in the sky” fantasies. Marxism isn’t anti-big government.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Conscious-Wolf-6233",
                                    "body": "Is that right? I assume you saw the recent news about how USAID funds “news” from around the world. Do you ever wonder if maybe just about everything you “know” about other countries you’ve “learned” from carefully curated, pro-USA sources? The USA, where after ww2 Nazi fascists were taken in, given shelter, and used countless times to coup democratic countries, install dictators, etc. close to 200 times. The instances of communist governments you like to cite had to exist in a world dominated by the USA and its interests. What do you think the USA does when it comes across people trying to organize a society in a way counter to its ideology where a handful of people have all the money and power? Assange? Occupy Wall Street? MLK? Get real.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HumanistHuman",
                                            "body": "What are you even on about? Non of your examples are of government control over individual citizens. In the former Soviet Union for instance citizens needed government permission to move within the country, or travel abroad. That is an example of Big Government controlling people’s lives.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Conscious-Wolf-6233",
                                                    "body": "“Communism bad.”\n\n[https://x.com/spiritoflenin/status/1889368318500577283?s=46&t=wiplrVxi7PBDvAvJ5F3txQ](https://x.com/spiritoflenin/status/1889368318500577283?s=46&t=wiplrVxi7PBDvAvJ5F3txQ)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "harry6466",
                            "body": "So if you've decided to become a socialist politician who really wanted to make people better lives and you be strict principled. You're automatically part of the corrupt govt, the instance you work in it?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "It is objectively much easier now. Most of them just supported the status quo while not understanding it. Now that the status quo has drastically changed it opens them up to seeing necessary change as needed. And it is up to us to explain to them what that change should be.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slantio",
            "body": "Recruit the advanced. The people who are mobilizing for immigrants rights, for Palestine's liberation, to protect trans kids, etc, are all advanced. We must unite with the advanced and recruit them to Marxist-Leninism and revolutionary organization.\n\nIn my experience it's much easier to transform an active liberal into a revolutionary than it is to transform a keyboard communist into a revolutionary.",
            "score": 36,
            "replies": [
                {
                    "author": "myaltduh",
                    "body": "I think there’s unfortunately a class dimension to it too. It’s definitely easier to try to talk about stuff like class struggle to a liberal who is a member of the working class vs a liberal who is a “mom and pop” landlord or some other kind of petty bourgeois (I have attempted both personally). The latter group don’t like billionaires any more than anybody else, but they’re invested enough in the system that they don’t want truly disruptive change.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "slantio",
                            "body": "Yes, working class people are more receptive to revolutionary ideas. But the petty bouge can still be our allies, especially oppressed nationality petty b's. We shouldn't write them off, especially if they are active in the peoples movements.\n\nThat being said, the working class will always be the strongest pool of revolutionary potential.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "boyd_da-bod-ripley",
                                    "body": "But doesn’t the bourgeois have a pretty important part to play? The sans-culottes held most of their power because they could mobilize in Paris and directly pressure those in government… didn’t the bourgeois end up driving most of the revolution? They had the wealth/influence needed to sustain a movement.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ikokiwi",
            "body": "I don't think there's ever a time not to do that. It should be a permanent state of affairs. \n\nIf anyone wants a succinct definition of Liberal (which I think is Cory Doctorow)\n\n150 men rule the world. Liberals think that half of them should be women.",
            "score": 17,
            "replies": [
                {
                    "author": "NikiDeaf",
                    "body": "I agree with you and other commentators, in that yes, liberals (and other members of differing political ideologies) should always be given an “on ramp” if they take a good faith-interest in the cause and want to learn more about it. No way to build anything resembling a mass movement otherwise.\n\n(Elite) liberals have a kinder, gentler veneer, they will pretend to be your friend, but when push comes to shove with a real revolutionary movement that threatens their hold on power in an immediate & visceral way, all that “hey guys we’re just libs here, we care about the plight of marginalized communities too!” 🥺 gets dropped real quick.\n\nMembers of almost all political persuasions can be useful for the purposes of the left. I was reading about Smedley Butler recently, he’s a perfect example. He was a Republican, pretty conservative, also served as a hatchetman for American imperialism in like a thousand places as a Marine. Oh yeah, and he was a cop too lol.\n\nBut, when they asked him, hey Smedley, wanna do a fascism with us?, he said “nope” and exposed their asses. He also became very reflective about his own role in participating in the “rape” of other countries later in life and became a vocal critic of American imperialism.\n\nPeople are complex, I guess is my point, and shouldn’t simply be written off as a lost cause, there should almost always be a path for rehabilitation imo",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ikokiwi",
                            "body": "Yea - someone recently quoted this thing to me \"sometimes a hypocrite is no more than a man in the process of change\".\n\nOn-ramps etc. I think Niccolo Machiavelli once said something to the effect of \"if you want your men to fight to the death, destroy their off-ramps\".\n\nAnd that's kindof what \"an argument\" is. In my heart of hearts I just know that I'm doing this all wrong.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yaldylikebobobaldy",
            "body": "Call it what you want, i find the best way to raise class consciousness is patient, principled and respectful conversation with friends and colleagues. You will find it doesn't take long before they start seeing the contradictions in capitalism. \n\n\nObviously 'choose your battles' and conserve energy, but even those who trust in the so called organising forces of market dynamics quite quickly starting lagging when posed with simple questions about competition, for example. ",
            "score": 9,
            "replies": []
        },
        {
            "author": "Allfunandgaymes",
            "body": "I find that, upon interrogation, many working to middle class \"liberals\" call themselves as such without knowing exactly what that entails. Some don't realize that \"liberal\" in the classic, socioeconomic, capitalism-affirming sense is not what they think of when they use the term. Some think \"left\" and \"liberal\" are interchangeable.\n\nI'm starting to think the idea of \"social liberalism\" was a psy op meant to blur the line between classical economic liberalism and leftism to make it easier to tar the latter.",
            "score": 7,
            "replies": [
                {
                    "author": "AmarantaRWS",
                    "body": "In the west, and especially in the imperial core, most people of all political persuasions don't really understand what their labels entail. It's just like all of the liberals who think they are advocating for \"more socialism\" by advocating for a broadened social safety net, or when they call roads and the fire department socialist. \n\nAnd yeah I definitely agree. This lack of distinction is deliberate on the part of the ruling class because knowledge is one of the true ingredients to freedom, and so long as they keep people ignorant and confused they don't have to worry about revolutionary movements.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "carrotwax",
            "body": "I think there has never been more awareness that government and media lie so often, and that important topics are avoided.  As such, it's really important to develop trusted sources which do not lie and address important topics.  However, there has been so much propaganda and \"priming the pump\" such that any mention of Marxism or Communism will usually elicit a negative emotional reaction that makes people stop listening.\n\nI like having a bunch of sources that are essentially Marxist but not obviously so on first glance.  One example is Michael Hudson.  He addresses so much of the economy that's not talked about, but you'd have to listen to him for hours to understand  how much of his foundation is based on Marxist economics.  Likewise for inequality.  So many people are against extreme wealth inequality but are so unclear on what could actually address it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SvitlanaLeo",
            "body": "For me, liberalism is certainly the lesser evil compared to any conservatism (including non-American conservatisms).\n\nIn general, American Marxists should understand that there are few Marxists in the US now, and work to popularize Marxism. Right now is a very good time. Popularize Marxism.\n\nUse the resources that exist.",
            "score": 4,
            "replies": [
                {
                    "author": "myaltduh",
                    "body": "In my experience US liberals cause tons of harm but justify it to themselves as necessary evil to keep the world safe (it’s not) while conservatives get off on the suffering they cause.\n\nIt’s a spectrum though, of course. A lot of the “haha look at the faces getting eaten by leopards” liberals are waaaay too excited about seeing working class people suffer even if they’re still not on the level of Republicans actively joking about LGBT suicide rates.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BranSolo7460",
            "body": "Always leave an opening for Liberals. We're Socialist/Communist because of our compassion and love for humanity and know we are capable of better.\n\nBut as always, keep yourself safe and be smart about how you word things. It's easier to convince a stranger they deserve a better life than the just blurt out, \"TRY COMMUNISM.\" People still react with anger and violence at those words.",
            "score": 2,
            "replies": [
                {
                    "author": "Archarchery",
                    "body": "Liberal here: My question is, what safeguards would you implement this time to stop Marxism/Communism from going down the terrible authoritarian path that communist societies have gone down? \n\nThis is why most liberals react with revulsion (hopefully not violence) when you say “Try Communism” to them. They think you’re proposing switching our current, admittedly extremely flawed system, for one that is *even worse.*\n\nAlso, every single Tankie on the internet makes communism look bad. How would you separate your movement from these people, and keep them out? What makes your brand of communism inherently non-Tankie?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HawkFlimsy",
                            "body": "My question would be what specific terrible authoritarian policies are you referring to? The most prevalent socialist nations both in the past and the modern day are the USSR and the PRC both of which are/were an objective improvement over the former system and while certainly not without flaws(as any government has flaws) operated in ways vastly more ethical and beneficial to their citizens than our current government has ever operated. Much of the \"scary authoritarian communism\" rhetoric is simply red scare propaganda meant to elicit that exact reaction you're referring to\n\nAs far as \"tankies\" are concerned you'd again have to be more specific. \"Tankie\" is simply a pejorative used against certain communists and doesn't really have a defined political definition. Much like authoritarianism the term simply gets thrown around whenever a state that doesn't align with western interests does something we don't like. Anyone who supports that and doesn't toe the line of western hegemony is labelled a tankie",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Archarchery",
                                    "body": "The USSR and the PRC were/are not democracies. I also strongly disagree that they were more beneficial to their citizens than any capitalist democracy.\n\nYour answer tells me that you don't actually care about democracy, and actually see authoritarian government as fine, rather than a nightmare.\n\nThe stance of Marxists seems absurd to me. You allegedly do everything \"for the workers,\" the common people of a country, but you don't want the workers to have any political power! \n\nAnyway thanks for confirming that Marxism is still an authoritarian ideology.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HawkFlimsy",
                                            "body": "Thanks for confirming liberals still have no idea how anything works and just believe red scare nonsense whole cloth. Both of the countries are collective democracies(something even the CIA has admitted). Marxists not only want workers to have power. They want them to be the ONLY ones with power. Hence the term dictatorship of the proletariat(as opposed to dictatorship of the bourgeoisie under liberal capitalist rule). This is something liberal democracies don't offer since the political landscape is shaped by the interests of the corporate elite rather than the worker. It is an inherent contradiction in the supposed \"left\" wing of the capitalist patties\n\nThey were objectively more beneficial for their citizens. You can see this in the life expectancies and literacy rates of the Soviet Union. Modern day Russia STILL has not caught up to the soviets despite the advancements in medicine and technology. If capitalism was this resounding success liberals insisted it was we should have seen SOME measurable improvements post Soviet collapse. Instead shock therapy and recapitalization has been a demonstrable failure at every turn.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Archarchery",
                                                    "body": "Democracy or Authoritarianism. Pick one.\n\nAlso, to say that the USSR was better for its people than say, modern welfare-capitalist Sweden is laughable. Citizens of the USSR didn't even have the right to leave the country, the state acted like it owned them.\n\n>Modern day Russia STILL has not caught up to the soviets despite the advancements in medicine and technology. If capitalism was this resounding success liberals insisted it was we should have seen SOME measurable improvements post Soviet collapse. Instead shock therapy and recapitalization has been a demonstrable failure at every turn.\n\nI'm not a stalwart believer in capitalism, I'm a stalwart believer in democracy. Authoritarian capitalism can be just as horrific as any other form of authoritarianism. Russia has never been a stable democracy. And I agree that \"shock therapy\" was terrible for Russia and that the country was descended on by capitalist vultures when the USSR collapsed. It is a great pity.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HawkFlimsy",
                                                            "body": "They ARE democracies. You refusing to accept that doesn't make it untrue. Also yes an economy which relies on the extraction and plunder of resources from the global south yields better results in the short term than an industrializing agrarian peasant economy. That doesn't make it a better system and as we have seen historically welfare-capitalist states inevitably decay into fascism because capitalism itself is inherently unsustainable. This is what is currently happening in places like Germany and the US. Liberal capitalists have time and again proven they are at best completely incapable of fighting against fascism and at worst are actively willing to aid and abet fascists to fight against socialists and communists. Liberal ideology has been a demonstrable failure at EVERY turn",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Archarchery",
                                                                    "body": "\\>They ARE democracies. You refusing to accept that doesn't make it untrue. \n\nHow is it a democracy without free elections or the right to criticize the government? A one-party election where only candidates pre-approved by the ruling government can run isn’t democracy, it’s a farce. \n\n\\>Also yes an economy which relies on the extraction and plunder of resources from the global south yields better results in the short term than an industrializing agrarian peasant economy.\n\nTrading with the Global South under fair conditions doesn’t impoverish the Global South, it does the opposite. Famine as a result of crop failure has been virtually eradicated in Africa; famines there now only happen due to conflict in a few select regions. The reason for this is a general rise in wealth across the continent.\n\n\\>That doesn't make it a better system and as we have seen historically welfare-capitalist states inevitably decay into fascism because capitalism itself is inherently unsustainable. This is what is currently happening in places like Germany and the US.\n\nNeither the US nor Germany have actually turned fascist. You’re predicting the future, not describing the present. \n\nAnyway, the main point of my argument isn’t to try and say that the current capitalist democracies are so great, it’s than Marxism, apparently, does not allow for democracy, and Marxists as a whole think Authoritarianism is perfectly fine. IMO this makes all your rhetoric about fighting for the rights of the workers so much balderdash. Under a Communist system, the workers will not have power, all power will be held in the hands of a clique of unaccountable party higher-ups who the common people have no way of replacing.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HawkFlimsy",
                                                                            "body": "You are just repeating state department lines in a way that is honestly very boring and tiresome. If you want to actually elaborate on your cliches(for example define what SPECIFICALLY makes these authoritarian states that does not also apply to the US/the west) I'll be happy to discuss further otherwise I'm not going to continue debating your nonsense. Also prior to trump the US still hits almost all of the 14 characteristics of fascism so if we aren't fascist NOBODY is",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "percyjeandavenger",
            "body": "I used to THINK I was a liberal until someone told me to look up what it meant. All I had to do was read the Wikipedia entry defining it and my whole understanding of my own politics became unraveled. Without people like me, you are a tiny fringe effort. So called liberals are a huge portion of the population, and many of them would agree with most of what you said if you couched it without using terms that they don't really understand yet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Panduz",
            "body": "I’ve been saying leftists need a VERY simple phrase like “MAGA” to spread the message. The literacy rate in this country is unfortunately VERY low, and we need to boil down a lot of these populist ideas into terms the most illiterate among us can understand. It also needs to be framed in a way that doesn’t appeal to the preconceived notions of the left due to red scare propaganda. \n\n\nAlso, I think there needs to be some disruption on social media using a very specific color (neon orange maybe) on posts and things to grab people’s attention, and separate the ideas from the “red vs. blue” we’re used to. \n\n\n\nObviously this isn’t a fully fleshed out idea, but as an “on ramp” I think applying these ideas (just like how the other parties do) will help with awareness at least on social media. \n\n\nI think doing these things helps spread the grassroots because that’s the only way we will get anything done.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DragonBitsRedux",
            "body": "I worked for a liberal organization and they were politically clueless.  If I could get the attention of liberals in \\*blue\\* states which are still mostly \\*red\\* by land area, liberals need a Rural Strategy like Nixon had his Southern Strategy but less cynical.   \n\nI consider myself a Rural Liberal.  I appreciate that weapons are tools, keeping your books balanced is important, environmental regulations are needed but need to be \\*balanced\\* and most important:\n\nTrump is \\*destroying\\* the future for farmers right now, far worse even than the corporatization and emphasis on Big Farms over small farmers.  \n\nI \\*love\\* my conservative farmer neighbors.  Salt of the earth hard workers but they are \\*afraid\\* liberals will push further environmental laws and regulations that will make it  even harder for them to survive.  \n\nI have \\*never\\* seen worse, more deluded messaging than coming from Social Justice Liberals. I watched in \\*horror\\* as it seemed like this powerful political organization was clueless at how entitled, self absorbed and \\*white\\* these 'defenders of brown folks' seemed to behave, even if they were people of color! \n\nI was the only one of hundreds who thought Hillary \\*could\\* lose, though I didn't think it would happen.  All her cronies were so self-satisfied with \"having \\*won\\* the social justice wars\" and how America was going to be all milk, honey and love from here on out.  \n\n\"Conservatives\" will only change their mind, according to a paper on economics, if they are hit in their social status (\"Do I fit in\") or their wallet.  Right now, out of enthusiasm for over-simplified \"Government is always bad\" Fox News \"we need to lie to get our point across\" perspectives and peer-pressure and ridicule for breaking lock step from Approved Behavior (which they tout as retaining your individuality) that it is very difficult to break through the propaganda.  \n\nThe common wisdom is \"Don't message to the other side, it is a waste of time.  Get out the vote for those it is possible to convert.\"    That \\*failed\\* and is no longer sufficient.  (I even said this to a current young political operative and they had trouble grasping that you \\*need\\* outreach.) \n\nIf -- as a politician -- you never even visit rural folks to hear their concerns ... you are fukked.  Liberals are \\*naive\\* and incapable of banding together to fight for a single-cause without talking too much and trying to be \"honest\" in their messaging which usually means \"incomprehensible, longwinded, liberal-speak.\" \n\nBack in 2005 I wrote in my notebook,  something like \"A crisis of Democracy will likely happen in America because that is the place people will least expect it.\" \n\nIt turns out our Democracy was built, not on the laws that defend it, but 'unspoken rules of civility' which both sides followed out of habit and fear abuse of power on one side of the aisle would be permission to abuse on the other side.  \n\nNewt Gingrich -- while not the entire cause -- gave not just permission but marching orders to \\*never\\* admit you are wrong, \\*always\\* demonize the enemy, never compromise and the \\*only\\* thing is winning, even if there is no goal or strategy (other than make wealthy wealthier) behind this scorched earth policy.   The Republicans felt they could keep control ... but they empowered a Monster with no ethical boundaries, Roy Cohen of the McCarthy era as a mentor and ... he out scumbagged the scumbags! (\"Hi, Ted Cruz!\") \n\nSo ... wake up liberals.  Get a Rural Strategy, save the farmers.  Get their votes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sabrefudge",
            "body": "We’ve always provided an on-ramp for liberals, or anyone for that matter, who is open to learning.\n\nBut SO many of them are so deep in the capitalist propaganda that they just snap shut the moment anyone brings up the truth about… well… anything, but especially Marxism and the non-capitalist countries they’ve been brainwashed into thinking were/are nightmare dictatorships.\n\nThey need to be deprogrammed before they can learn, but they need to learn to be deprogrammed.  So it’s hard finding a way to crack that shell.  But I always encourage you to try.",
            "score": 2,
            "replies": [
                {
                    "author": "RelevantFilm2110",
                    "body": "I think that the 2020 primary in the US is a lesson here.  A lot of liberal voters were willing to back Sanders in the hopes of reform and social services, but as soon as they're given a cut-cloth liberal (Biden), they'll go back and toe the line.  Liberals will never turn socialist out of principle in any large numbers.  They'll need to have the worst of the system thrown right in their faces and have to feel its consequences in a direct way for the lesson to really take.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AloshaChosen",
            "body": "We need to provide an on ramp for liberals, yes, but we also need to make space for the MAGA types who will be looking for another community. \n\nWe should make a list of easy first readings that toe the line and won’t piss anyone off initially.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DewinterCor",
            "body": "As the resident lib who kinda stalks the sub cause I like talking about Marx and his works, I think you'll have more success now than any point in the last 30 years but not as much success as you'd like. \n\nThe fascists currently attempting to seize power are going to disenfranchise alot of less educated liberals. Like, my entire family are pretty heavy handed conservatives that are starting to panic because of the actions of the current government. They don't politics and voted for Trump because they like seeing the \"libs\" get owned. \n\nBut all of them are abhorred by the flagrant desecration of our republic and will likely feel politically homeless in the coming future. Which, imo, makes them the easiest targets for radicalization. \n\nIt's just whether you can get past the Red-Scare stigma that much of the liberal world still has.",
            "score": 1,
            "replies": []
        },
        {
            "author": "49DivineDayVacation",
            "body": "I’m a liberal, “pod save America” type 30 something who is finding myself more and more radicalized and open to these kind of ideas. To the point that I guess Reddit’s algorithm sent me here.\n\nSo anecdotally you’re probably on to something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Putrid_Race6357",
            "body": "IME they are still obsessed with being bluemaga. I still before everyone I can and drop interesting pieces and columns that are not overtly leftist (it doesn't have to be to be critical of our system) and keep hope. I'm also very Socratic when discussing with them things because preaching and lecturing is a negative interaction.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Final_Combination373",
            "body": "Yes, as long as you do warn them that much of the leftist, anti-liberal messaging is constistently twisted and amplified in targeted spaces by the Right Wing forces to influence elections, etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unsuccessful_War1914",
            "body": "In extraordinary times like this, we should keep in mind the saying: \"We cannot let perfection be the enemy of the good\". We need as many allies in the fight against Pumpkin Spice Palpatine as we can muster. Unless we can hold our proverbial noses and say \"the enemy of my enemy is my ally\", we will fall - one by one - to fascism. We need to work together to fight this common enemy now, otherwise it will take much bloodshed the longer we wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I don't think there is a point in being selective so long as certain parties can be receptive to Marxist talking points and mobilized. Plenty of liberals and conservatives can agree and come to our side based on many axioms. \n\nThe left is useless because not only do we not do this, we reject other leftists based on petty differences for a future that doesn't exist yet.\n\nAll that matters is numbers mobilizing under the banner of class struggle, no one small party or organization will have their way in a revolutionary scenario as they will be absorbed or abandoned by the actual mass revolutionary movement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AureliaFTC",
            "body": "Im liberal but…questioning?  The part about owning the means of production just doesn’t sound right to me. But the idea that when you produce value through your labor, someone else reaps the lions share of that value is obviously wrong. I suppose one would have to be blind to see the failure of liberalism to protect workers or in my example to protect worker’s share of the value of their labor.\n\nPlus it seems when the fighting starts liberals are fundamentally a bunch of weaklings and only the far left will stand up(and probably get shot down).",
            "score": 1,
            "replies": [
                {
                    "author": "CandleInTheDarkVoid",
                    "body": "Can you say more about why 'Workers owning the Means of Production' doesn't sound right to you ?\nMy interpretation of that idea is essentially Economic Democracy ... \n\nThe two ideas that you shared related to socialism seem linked to me. If the workers owned the means of production then they would democratically own the products of their labor and the lions share of value. \n\nIt would probably be a good idea for people to decide to invest some of that lions share to advance society in general and to benefit the majority of people and our Earth.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "munnin1977",
            "body": "Most of my ideologies are socialist but have no idea how to get involved in any kind of organized movement. I’ve always identified as a liberal Democrat because as a gay guy, they were pretty much the only people in my corner at all (visibly). I like local level democrats but so many of the national level establishment have sold out its pathetic. \n\nSo where does one start?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HumanistHuman",
            "body": "“On ramp” to what? Marxism has absolutely no political power at all in this country. Basically in the West Marxism is just a book club in the twenty first century. Sorry if the truth hurts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AviceReads",
            "body": "Why were you protesting Democrats but not Republicans if both parties are the same lol.\n\nYour actions speak differently than your words. Per usual.\n\nI'm done wasting time. Just know you've cemented that Marxists are not the answer lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sirhanduran",
            "body": "I don't disagree strongly with most of the other replies here but my take is... no, not especially. This is the time in which the failings of liberals are at their most obvious. Therefore you have the most leverage with those who are & have been dissatisfied with liberalism, those who have given up on Democrats & the charade of capitalist democracy, or who feel justified in apathy/anarchism yet dissatisfied that \"being moral/right but powerless\" is all they have to look forward to. Now is the time to present Marxism as the only valid way forward to these people, as the organized direction to face the problems we have head on, and don't hold your breath for liberals still married to electoral politics & \"respectable institutions\"; many of them will be the last to know that there's a revolution on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMicrologus",
            "body": "If you are talking about ordinary people who are seriously committed to Liberal thinking, right now signs point to no. But I think things could shift quickly depending on what happens politically.\n\nThe tenor of things seems to be doubling down on the failed tactics they've used historically such as finger wagging, culture warring, and overwrought Resistance-era scrutiny every time Trump/Musk/etc. do anything. The main message I've seen is \"we told you so.\" This is different from 2016, when it seemed that people were so stunned, they couldn't help but question things. Part of what hurts is that the Trump camp is really leaning into cartoonish culture war stuff. If one side is doing Nazi salutes, it makes it easier to see them as the bad guys and the Center-Left as the good guys. \n\nSome of this depends on how you define things. If you're talking about the average working person, recall that 90 million eligible voters did not vote, and many people who voted Republican or Democrat are not deeply committed to their parties. Those are the people we should target.  \n  \nBy the way, I know plenty of Marxists who had Reaganite parents and identified as right-of-center in their early lives. And lots of people who started as Democrats think radicalism means taking Liberalism and dialing it up to 10000%. Their default will always be to double-down on the Dems when the going gets tough. We should always avoid letting our assumptions follow from the blackmail offered by the US political system.",
            "score": 1,
            "replies": []
        },
        {
            "author": "guyintheparkinglot",
            "body": "We need to be actively starting another movement similar to occupy in spirit. There are more people than ever open to the idea of showing force.  Yall on rednote? Let's build",
            "score": 0,
            "replies": []
        },
        {
            "author": "AviceReads",
            "body": "Nope. Sorry. You cost us this election. And you miss the mark completely on how communism impacts women and always has. \n\nMarx is fine. You extremists are hurtful unfortunately. Willing to hear otherwise, but be warned that nastiest online trolling I ever had was from a male Marxist. So I'm starting hella far from ANY kind of on ramp.",
            "score": 0,
            "replies": [
                {
                    "author": "RelevantFilm2110",
                    "body": "Who is us?\n\nI'm possibly unconventional as far as Marxists go, but I'm right with those who see the parties as only superficially different.  If you're really committed to the Democratic party, you're in the wrong sub.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AviceReads",
                            "body": "I'm not in the sub, it prob popped up in my feed because of the OP.\n\nAnd you seeing the parties as only superficially different indicates the exact issues I pointed to RE: treatment of women.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RelevantFilm2110",
                                    "body": "Fair enough, but consider why you lost that election.  In the face of supporting genocide or winning an election, the Democratic leadership chose the latter and sent AOC on an errand to discuss a peace deal that didn't exist.  If you think Marxism is about misogyny, pick up a book.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AviceReads",
                                            "body": "And now we have a pres who is even more into genocide. Gross. Y'all literally gave it away to someone worse.\n\nI've picked up far too many books. Even Marx himself talks about women in the context of breeding (descent of families). And the use and abuse of women and children in labor. But they are the ones birthing the working class in his POV. \n\nIt's problematic to say the least.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RelevantFilm2110",
                                                    "body": "This discussion already occurred throughout the election, and it amounts to liberals arguing for \"acceptable\" levels of genocide.  In lieu of opposing it flat out, the most the Democratic Party was willing to offer was a little less.  Doesn't that say something?  That's just cowardice.  \n\nAnd on Marx, I have no idea what you're trying to get at, though I think you're actually talking about Engels, but wildly misunderstanding what he said.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ABigFatTomato",
                    "body": "if leftists are a large enough portion to cost democrats the election, then shouldnt they have tried to address their concerns, rather than repeatedly saying they didnt need their votes, while focusing on supporting genocide and catering to the right instead? \n\nin addition, communism is in no way inherently anti-woman (and especially not more anti-woman than capitalism is and has always been; capitalism will *never* fully bring our liberation as women), with communist theorists/scholars generally being vocally supportive of women’s liberation (such as kropotkin, for instance).",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}