{
    "title": "Is this essay idea good, or am I completely getting Marx wrong?",
    "author": "Loud-Lychee-7122",
    "subreddit": "Marxism",
    "rank": 68,
    "score": 30,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Marxism/comments/1ikm78f/is_this_essay_idea_good_or_am_i_completely/",
    "id": "1ikm78f",
    "selftext": "Hi, everyone! I am currently in a fourth year seminar course that is strictly about Marx. However, it is my first time really learning about Marx. So, I apologize in advance if this is a basic question.   \n  \nThe essay is supposed to touch on \"The Critique of Capitalism\" section. A majority is supposed to summarize key concepts. BTW, feel free to lmk if there are commonly missed key concepts other than:\n\n* **Wage Labor**\n* **Labor Value**\n* **Capital**\n* **Surplus Value**\n* **Exchange Value**\n* **Use Value**\n* **Commodity Fetishism**\n* **Primitive Accumulation**\n* **Reserve Army of Labor**\n* **Division of Labor**\n* **Alienation**\n\n1/4 of the essay is supposed to be a critique section. I was thinking of writing about how Marx’s ideas (wage labor, surplus value, exchange value) can apply to today’s tech-driven capitalism. Instead of factory owners, we have billionaires extracting wealth through data, platform monopolies, and algorithmic control—shifting from labor exploitation to digital rentier capitalism. Would this be a solid angle, or is there a better way to frame it? I had seen posts about how Marx's readings were outdated, and thus, irrelevant. On the contrary, I think his works are a fundamental piece of work in both econ and social sciences. My aim here would be to expand on Marx's definitions, updating them to our modern day reality? ",
    "comments": [
        {
            "author": "caisblogs",
            "body": "If you're going to be doing a contemporary analysis of Marx I'd certainly advise reading some contemporary Marxists so you're not walking well trodden paths.\n\nIt's been considered how the nature of labor has changed with the rise of technology and automation of traditional industry and how this has maybe fragmented the proletariat (and to some extent the bougoise).\n\nYour essay ideas sounds a tad unfocused though. \"switching from labour exploration to digital rentier capitalism\" would seem to imply rentier capitalism isn't wage exploitation, which capitalism definitionally is.\n\nIll ask the questions, and leave it to you who's studying this far more seriously than I,\n- Are we still in Marx's Capitalist dialectic?\n- If we're not, where are we? What revolution got us here?\n- If so, how are the superficial changes to the proletariat and bougoise not changes to their relationship to labor\n- Is communism still achievable and is the proletarian revolution inevitable?\n\nHope this helps, by no means am I critical of the job of trying to \"update\" Marx, he had the unfortunate pleasure of living only a few generations ago in an unimaginably different world",
            "score": 22,
            "replies": [
                {
                    "author": "Loud-Lychee-7122",
                    "body": "Wow! I was not expecting such nice and thoughtful posts. Thank you! I really appreciate this. These are excellent questions. Thank you for directing me towards the right direction.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "zanabanana19",
                            "body": "I'm new here so take my thoughts with a grain of salt as I'm by no means an expert. But the reason I came here was specifically to learn about Marx in modern day reality so I think your topic is great and much needed!\n\n Something to think about is who your audience is, and what's the objective of the essay? Are you speaking to folks who have a deep understanding of Marx already, or are you introducing Marx and then going on to expand to modern day implications? Are you trying to persuade or simply educate? It's easy to lose your plot in the details.\n\nI'd love to read your essay when you're done. Cheers!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ghosts-on-the-ohio",
            "body": "One thing i will point out.  While the digitil rent-seeking absolutely does exist, old fashioned exploitation of workers doing hands on labor absolutely exists too, and is still the majority of exploitation we see under capitalism.  Many people in the western world think this old critique of capitalism doesn't apply because they personally don't see plantation workers making 20 cents and hour growing cotton or children working 12 hours a day in textile mills or people dying in cobalt mines.  It happens to workers that are hidden from view for people in the mainstream western world.  It happens to undocumented immigrants, to prisoners, to the vast masses of people in the global south.  While the digital frontier has opened up new avenues of profits, the old forms of exploitation are alive and well and more brutal than they have ever been.",
            "score": 5,
            "replies": []
        },
        {
            "author": "InspectahJesus",
            "body": "I think your idea of a shifting to rentier style capitalism is good. Check out the works of Yanis Varoufakis he argues in favor of that very idea. But I wouldn’t say theres been a shift away from labor exploitation as it very much exists in both the imperial core and the periphery. Wage slavery continues to exist and the worst and most cruel exploitation exists primarily in the global south (neocolonialism). I think its better to frame it as an expansion of capital in order to replace falling profits.",
            "score": 8,
            "replies": []
        },
        {
            "author": "InternationalFig400",
            "body": "If you can get your hands on \"A Dictionary of Marxist Thought\", go for it--\\*very\\* helpful. Commodity fetishism is a special kind of alienation--as Perlman writes: \n\n\"This reified labor, this abstract labor which is crystallized, congealed in commodities, \"acquires a given social form\" in capitalist society, namely the form of value. Thus Marx \"makes the form of value\" the subject of his examination, namely value as the social form of the product of labor--the form which classical economists took for granted...\" (Rubin, p.112) Thus through the theory of commodity fetishism, the concept of reified labor becomes the link between the theory of alienation in the *Economic and Philosophical Manuscripts of 1844*, and the theory of value in *Capital*.\"\n\nitalics original\n\nFredy Perlman, \"Introduction: Commodity Fetishism\", in II Rubin: \"Essays on Marx's Theory of Value\", Montreal: Black Rose Books, 1973, pp.24.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TheMicrologus",
            "body": "If your question is about how to complete your paper, then I’d say your angle sounds solid enough to me.\n\nBut the story of tech stuff might be a bit weirder than you say, so if you’re interested in these ideas and want to go deeper, I’d recommend some caveats:\n\n1. We still have factory owners - tons of them. The amount of goods produced and exported has massively increased as a share of national GDP in the last 50 years. But you can still mention the expansion of tech/information/communication, which is definitely much bigger than it was in Marx’s lifetime. I think you can argue Marx’s ideas still apply AND we need to spend some time thinking about tech.\n\n2. The parts of Capital you probably read are only part of Marx’s ideas on the topic. He introduced many things to explain that capitalism is a mix of production of basic commodities and other stuff, including stuff that isn’t really productive at all or produces different kinds of things than physical consumer goods. Too big to wrestle with in your paper, but you should check it out if you’re still interested in these topic after you’re done.\n\n3. Lots of tech can be explained in the basic language of Marx. Recall that a commodity is a good or a service. A capitalist can start a transportation company and exploit workers who “produce” the service of transporting stuff - if I use that service to mail something or transport myself, I don’t have anything physical in my hand at the end, but I got what I paid for. Until tech stops making products or providing services, we shouldn’t be talking about algorithms replacing reality or whatever.\n\n4. Given #3, the concept of rentier capitalism might not be on point as a general claim. Here’s a good article for anyone interested in this topic; op, this might help support your idea that Marx’s ideas still apply. It’s academic, so might be a bit dense, but I’m happy to explain if you’re interested:\n\nhttps://www.triple-c.at/index.php/tripleC/article/view/1078/1279",
            "score": 3,
            "replies": []
        },
        {
            "author": "Barnicle_Boy1041",
            "body": "If you really want to blow the lid off of it and expand his ideas into the modern day write something about Marx and AI. AI is NOT doing what Marx originally thought technology would do, and in fact is taking it in a completely different direction. AI could easily create a better future, but instead it’s being utilized by the bourgeoisie to streamline production and fuck over the proletariat. ESPECIALLY in the case of the arts. We’re losing our soul to technology slowly, but being forced to keep all the shitty parts by the bourgeoisie. Shifts in education are happening as we speak back to trades because AI is making higher education in the arts obsolete.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bMAROd",
            "body": "I agree with other commenters’ suggesting you engage with contemporary thinkers who have done some of this updating for you. Some additional concepts I recommend engaging with regarding tech-capitalism: \n\n• Imperialism - how is the rise of tech-capital related to the financial exploitation of the global south? how has this rise facilitated (and, dialectically, been facilitated by) a rise in Western financial power and an outsourcing of the industrial capital you mention has disappeared? how does tech factor into proletarian praxis (theory + practice) within the imperial core (is the labor aristocracy stronger/weaker? what about proles? what about lumpen? so on) \n\n• The State - how has the (capitalist) State facilitated the rise of tech-capitalism? what is its role in the questions asked regarding imperialism? how is the State’s functioning different in the era of tech-capitalism (if at all)? \n\n• Tech Fetishism and Civilization (see Sylvia Wynter, and take note of concepts that are Capitalized) - what does the rise in this tech-capitalism tell us about the ideological fetishization of technology and “Progress” under capitalism? Also, being productively critical of Marx, how does he and his contemporaries (i.e. marxists) replicate this fetishization? how has the acceptance of the “Progress” narrative (e.g. that society has a historically progressive development over time, and that it is always generally moving toward better things like “Development”) and idealization of technology limited Marxist praxis? how has this limitation within Marxism facilitated the rise of tech-capitalism? how does this (and tech-capitalism more broadly) factor into white supremacy and Anti-Blackness? \n\nhope these are generative!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SandhogNinjaMoths",
            "body": "Why do you want to do that? It sounds like well-trodden path. I think pretty much every living Marxist writer has acknowledged the rise of big tech, new forms of labor, etc.\n\nWe know how the world works. The point is to change it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TraditionalRide6010",
            "body": "Wage Labor → AI Labor\n\nHuman labor is being replaced by AI, shifting exploitation from workers to algorithmic control and data ownership.\n\nLabor Value → Market Value\n\nValue is no longer determined by labor but by market dynamics, demand, and algorithmic price manipulation.\n\nIf capitalism adapts by shifting exploitation to AI and data, what is the relevance of an outdated theory that assumes human labor as the foundation of value?",
            "score": 0,
            "replies": [
                {
                    "author": "Dakios101",
                    "body": "This is a pretty poor understanding of Marx's work.\n\n>Wage Labor → AI Labor\n\n>Human labor is being replaced by AI, shifting exploitation from workers to algorithmic control and data ownership.\n\nThe process of human labor being transferred over to machines/automation is not new, and Marx talks about on numerous occasions. The shift from wage labor to automated labor is a shift from variable capital to fixed capital, with the goal of extracting more surplus value in the production process. I.E. more exploitation in general.\n\n>As long as the means of labour remains a means of labour in the proper sense of the term, such as it is directly, historically, adopted by capital and included in its realization process, it undergoes a merely formal modification, by appearing now as a means of labour not only in regard to its material side, but also at the same time as a particular mode of the presence of capital, determined by its total process – **as** ***fixed capital.*** **But, once adopted into the production process of capital, the means of labour passes through different metamorphoses, whose culmination is the** ***machine,*** **or rather, an** ***automatic system of machinery*** (system of machinery: the *automatic* one is merely its most complete, most adequate form, and alone transforms machinery into a system), set in motion by an automaton, a moving power that moves itself; this automaton consisting of numerous mechanical and intellectual organs, so that the workers themselves are cast merely as its conscious linkages. In the machine, and even more in machinery as an automatic system, the use value, i.e. the material quality of the means of labour, is transformed into an existence adequate to fixed capital and to capital as such; and the form in which it was adopted into the production process of capital, the direct means of labour, is superseded by a form posited by capital itself and corresponding to it.\n\n*Grundrisse*, Notebook VI.\n\n>In handicrafts and manufacture, the worker makes use of a tool; in the factory, the machine makes use of him. There the movements of the instrument of labor proceed from him, here it is the movements of the machine that he must follow. In manufacture the workers are parts of a living mechanism. In the factory we have a lifeless mechanism which is independent of the workers, who are incorporated into it as its living appendages.\n\nCapital, Vol. I, Ch. 15, Section 1.\n\n>The machine produces relative surplus-value, not only by directly depreciating the value of labor-power and by cheapening the commodities in which labor-power is reproduced, but also, indirectly, by transforming the worker's mode of labor and heightening his productivity.\n\nCapital, Vol. I, Ch. 15, Section 2.\n\n>In proportion as the machine system extends, the value of fixed capital increases, **that of variable capital declines, and consequently the rate of surplus-value increases** at the expense of the rate of profit\n\nCapital, Vol. III, Ch. 13.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dakios101",
                            "body": ">Labor Value → Market Value\n\n>Value is no longer determined by labor but by market dynamics, demand, and algorithmic price manipulation.\n\nPrice is not synonymous with value, nor is value contingent on supply and demand. So \"market dynamics, demand, algorithmic price manipulation\" are completely fine with his works.\n\n>But to consider matters more broadly: You would be altogether mistaken in fancying that the value of labour or any other commodity whatever is ultimately fixed by supply and demand. Supply and demand regulate nothing but the temporary *fluctuations* of market prices. They will explain to you why the market price of a commodity rises above or sinks below its *value*, but they can never account for the *value* itself. Suppose supply and demand to equilibrate, or, as the economists call it, to cover each other. Why, the very moment these opposite forces become equal they paralyze each other, and cease to work in the one or other direction. At the moment when supply and demand equilibrate each other, and therefore cease to act, the *market price* of a commodity coincides with its *real value*, with the standard price round which its market prices oscillate. In inquiring into the nature of that VALUE, we have therefore nothing at all to do with the temporary effects on market prices of supply and demand. The same holds true of wages and of the prices of all other commodities.\n\nValue, Price and Profit, IV. Supply and Demand.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Icy-Link304",
            "body": "The biggest practicing Marxist today is Donald Trump on his two biggest issues. One: which class should have control of the \"Means of Production\". Trump attacks the owner class for off-shoring manufacturing to the detriment of workers. Two: Marx pointed out that British imperialism over Ireland included importing cheap labor to work in Britain. This lowered wages for the British working class.",
            "score": -3,
            "replies": []
        }
    ]
}