{
    "title": "How is the working class supposed to rise to power in Germany where the majority of society is middle class?",
    "author": "alex7stringed",
    "subreddit": "Marxism",
    "rank": 49,
    "score": 38,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 88,
    "url": "https://www.reddit.com/r/Marxism/comments/1ir083o/how_is_the_working_class_supposed_to_rise_to/",
    "id": "1ir083o",
    "selftext": "Regarding the upcoming elections in Germany and their importance for the fate of Europe and the world I have some basic questions about Marxism. In Germany we see the trend of the petit-bourgeois voting for fascism repeating. The strongest party is the conservative right and the second strongest is the fascist Nazi party. Ultimately fascism was the middle classes reaction to their impending proletarisation in capitalism. \n\nI’m asking if Marx or other communists wrote about this topic. Some Marxist analysis would help me sort out theoretical questions. If the working class is the minority in a society, why should the majority of society be for revolution when it’s not in their economic interest? Advice would be appreciated thanks. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "pydry",
            "body": "Middle class is basically another way of saying \"comfortable working class\". The relationship to capital is usually identical. The \"middle classes\" are often no more than a few pay checks from poverty.\n\n\nAs for why AfD? Well, the internal contradictions of capitalism dont always result in something better, especially in a society with little to no class consciousness.\n\n\nI dont think AfD votes are all petit bourgeoisie. I suspect it's popular with the working classes who are fed up with the establishment which has been pitting them against immigrants to drive down wages for years and created economic environment where living standards have stagnated.\n\n\nWhat I AM sure of is that the establishment that claims to hate AfD so much would 1000x prefer them to the \"far left\" (people who want radical shit like decent wages) and will work harder to sabotage those parties who intend to mess with the country's capital superstructure.",
            "score": 78,
            "replies": [
                {
                    "author": "northseaview",
                    "body": "I agree with this summary. One additional difficulty with the atomization of the working class since the 1970s, is that it makes solidarity through industrial struggle much less accessable as a root to political class consciousness.\n\n\nThe skill and resources the ruling class has to manufacture consent both traditional and through shadow banning and targeted messaging on social media makes it a losing strategy to rely on these platforms for socialist organization and education. \n\n\nWe need still to grow mass political organizations, and develop social media platforms paid for and managed by the working class to enable education and propaganda, which can be promoted without so much sabotage.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "alex7stringed",
                    "body": "I agree with your assessment about the establishment and their refined marketing of fascism as anti-establishment. \n\nMy understanding was that the majority of society which is middle class (and petit-bourgeois)vote for fascism. But you’re saying the middle class doesn’t refer to petit-bourgeois but comfortable working class. I get that now. \n\nDoesnt that point to the incompetence of Left parties if the majority workers they claim to represent are turning to fascism? This situation is even more hopeless than I thought. \n\nHow can the middle class if they are working class support fascism? It is clear why the petit-bourgeois would support fascism but the workers? The class-consciousness must be nonexistent or the comfortable workers see themselves as petit-bourgeois and hope to climb the ranks? Christ that’s blackpilling",
                    "score": 0,
                    "replies": [
                        {
                            "author": "pydry",
                            "body": ">But you’re saying the middle class doesn’t refer to petit-bourgeois but comfortable working class.\n\n\nWell, and sometimes petit bourgeois too. Point being that there is not a clean mapping from a (specific) marxist conception of class to the fuzzy default societal definition.\n\n\n>Doesnt that point to the incompetence of Left parties if the majority workers they claim to represent are turning to fascism?\n\n\nSpeaking as somebody who was involved in them - it wasnt so much incompetence as it was being outgunned. The capitalist establishment hates the AfD for sure but they go go absolutely *nuclear* on parties who lean marxist in any way.\n\n\nThis combined with these parties being resource poor (no billionaires to prop them up) means they often wither and die.\n\n\n>This situation is even more hopeless than I thought.\n\n\nJoin the club.\n\n\n>How can the middle class if they are working class support fascism?\n\n\nFascism offers nice easy answers, a clear and obvious scapegoat and a path for the perpetually shamed to feel pride in who they are. Many within the working class crave these things and dont feel that they are on offer anywhere else.\n\n\n>The class-consciousness must be nonexistent\n\n\nPretty much. The working class have zero media representation. None. Therefore they cant talk to each other. Therefore they dont build class consciousness.\n\n\nEven the parts of the media that *look* left wing are actually capitalists wearing a left wing mask which they use to better manipulate the working class. This has all sorts of weird side effects like co-opting \"woke\" and changing it to mean \"more black lesbian CEOs\" and other such absurdities.\n\n\nThere's a reason our elites are so comfortable with democracy. They are *really* good at manipulating it.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "alex7stringed",
                                    "body": "The system is fucked. I sometimes think it’s a wonder the workers ever took power in Russia. Why can’t we have a revolutionary party calling for radical destruction of this system? The Left can also have easy answers and easy scapegoats. That’s all a matter of how you present the information, so it’s propaganda as is all politics. \n\nHow did Lenin manage to build class-consciousness among workers under brutal Tsarist rule but we can’t even do that under capitalistic social democracy?? \n\nI’m curious about the thing you said about the workers not talking to each other and therefore staying isolated. I think I read that in Marx too. We are the majority of society how can we stay isolated then and have no media representation? What would you do to build class consciousness?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "pydry",
                                            "body": "Russia 1917 was a bit of a special case. Things were way more fucked and the tsar was way more incompetent than anything we see right now. It also didnt exactly lead directly to paradise.\n\n\nThe left in the west has no structural base of support. Unions are mostly gone. The USSR is gone. Well meaning people arent enough to support the left. You need institutions with power and wealth.\n\n\nLenin built class consciousness with propaganda (newspapers) in an environment that was properly even more fucked than ours and where the tsar was shit at it.\n\n\n\n>What would you do to build class consciousness?\n\n\nBuild or expand media to channel radical left wing propaganda that is resistant to being co-opted or stifled.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "alex7stringed",
                                                    "body": "Yes we need mass propaganda on social media and newspapers. Organizations too you said unions are mostly gone now? Leftists of the past made the mistake of leaving „reformist“ and social democratic union. We need every union they are powerful organizations for the workers.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HawkFlimsy",
                                            "body": "In addition to what others said a big part of it is the more rural communal nature of Russia at the time. Both rural and early industrial societies were centered a lot more around the local community. That's why something like atomization or suburban sprawl is so insidious. It doesn't just have demonstrable negative impacts to human health and quality of life. It also serves as a subtle way in which capitalists disrupt left wing organization and class consciousness by further isolating members of the working class from one another and insulating them from real class consciousness. They intentionally keep us apart because they know we stand no chance on our own and that our power lies in our numbers and acting as a collective rather than as individuals",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zrakoplovvliegtuig",
                            "body": "The middle class was first coined to mean someone who owned a small business and owned some means of production. Most people considered middle class today are not like this, they work regular office jobs and own no means of production. The petit bourgeoisie has shifted towards people that we would consider upper middle class, like dentists or people that own a family business of some kind. Most middle class people are realistically just working class that no longer use their muscles but rather their brains in their job they need to live.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "newStatusquo",
                            "body": "You should read blackshirts and reds. It kinda talks about how fascism and communism often thrive in the same sociopolitical environments, with fascism co-opting the revolutionary potential by offering much simpler scape goats to the problems of capitalism (like immigrants or the Jews) making ppl more receptive to it then the more complex Marxism. It also has to do with the dominant classes of society (the capitalist) often promoting and siding with fascism giving it extra reach, they’d rather not lose their privileges within some kind of socialist system so they use their economic might to control dominate agenda and climates of opinion through like the media normalizing the rising fascism in the country ect. Those who still rly believe in the free market will also often side with fascism over socialism.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JollyJuniper1993",
                            "body": "Pointing to a supposed incompetence is futile, focus on the future. Instead of thinking about whose fault it is, think about what has to be done better and how. Always be constructive.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "chaatops",
                    "body": "I have been struggling with the “comfortable working class” designation in the US for some time. In racialized terms, the median assets of white workers is ~$300k USD, which could in principle could sustain someone for some years without having to work (yes, one would have to adjust from a bourgeoisie lifestyle - but I think having to sell one’s labor to live means being able to access shelter, food, and life sustaining resources). \n\nSo if one doesn’t really have to work (push come to shove), it seems one’s class allegiance is completely up for grabs - it seems more petite bourgeoisie than anything resembling proletariat.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "pydry",
                            "body": "I basically consider achieving /r/FIRE and /r/fatfire to be bourgeoisie, /r/coastfire and /r/leanfire to be petit bourgeoisie and everyone else who is reliant upon their labor to be proletariat.\n\n\nIt isnt a 100% clear cut definition but it's damned close.\n\n\n($300k is not coastfire or leanfire)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "adimwit",
            "body": "A lot of \"advanced\" capitalist countries have become what Lenin called \"Rentier\" Capitalists. They don't build wealth by exploiting the labor of workers, they build wealth through financing and indebting both workers and the middle classes in a wide variety of ways, but essentially through propaganda and mass consumerism.\n\nA fixed constant in Marxist analysis is that the workers and middle classes will follow whoever has a path to political power. If workers build up strong Democratic institutions (unions, parties, media, etc ) then the middle classes will follow them. But the modern Party and the party system forces workers to rally around moderate political organizations that appeal to middle classes. So the middle class organizations will always be far stronger and the workers will follow them.\n\nThe strong middle classes in Germany and the US means the workers will support reactionary policies and work to aid reactionaries secure power. This is the same problem Lenin had to deal with.\n\nLenin's solution was to initiate revolutionary struggle in colonial and semi-feudal countries (Russia, China, Vietnam, etc.). If you destabilize capitalism by liquidating their imperial assets, the middle class parties will fracture and the workers will lead again.\n\nIn the modern world, this means initiating revolutions in semi-feudal countries like the Arab monarchies.",
            "score": 8,
            "replies": [
                {
                    "author": "alex7stringed",
                    "body": "So basically the workers are too comfortable for revolution in developed countries. Only a crisis could move them to support communism. Didn’t Marx say though the first communist country must be a developed industrial one? Without industry socialism cannot enhance efficiency of production. Even Lenin knew that without revolution in Germany Russia is doomed.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Phurbaz",
                            "body": "Yes quite. Lenin was primarily focused on the revolution at the capitalist core. And the goal is not to wait for a political crisis - but rather, the working class organizing as a political force itself IS the political crisis. And yes - Marxism has aways been international, so a proletarian revolution revolution in the periphery/global south is already, due to the globalizing nature of capitalism, a revolution in the core.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "glpm",
            "body": "Why are you making this question?   \n\n\nYou're assuming:   \n1) Elections change something of note;  \n2) Marx's passing comments made over 100 years ago should be taken as prophecy;  \n3) The \"middle class\" (not a real class in the marxist sense) isn't the proletariat;  \n4) That \"fascism\" is somehow a middle class movement;  \n\n\nNo socialist revolution was undertaken by the majority of the society, let alone the majority of the working class.",
            "score": 10,
            "replies": [
                {
                    "author": "alex7stringed",
                    "body": "So you’re one of those ultra left boycotters of elections?You’re saying the middle class is the proletariat then? Why is it a different category then? Marx wrote about the petit-bourgeois and clearly states they are not on the workers side. \n\n„The lower middle class, the small manufacturer, the shopkeeper, the artisan, the peasant, all these fight against the bourgeoisie, to save from extinction their existence as fractions of the middle class. They are therefore not revolutionary, but conservative. Nay more, they are reactionary, for they try to roll back the wheel of history. If by chance, they are revolutionary, they are only so in view of their impending transfer into the proletariat; they thus defend not their present, but their future interests, they desert their own standpoint to place themselves at that of the proletariat.“",
                    "score": -7,
                    "replies": [
                        {
                            "author": "pointlessjihad",
                            "body": "“Middle class” is a meaningless term now, Marx may of used it to describe shopkeepers, artisans and peasants, but there aren’t enough artisans to be a social force and there are no peasants. The “middle class” today is made up of the Petty bourgeois and well paid proletariat (what some would call the professional managerial class or PMC.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "alex7stringed",
                                    "body": "So forget the term middle class I’m talking about the petit-bourgeois. They exist though right? Is their class interest not reactionary like Marx said? If not, then that means that not the petit-bourgeois support fascism in Germany but the working class. That’s why I’m confused",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "caisblogs",
                                            "body": "1. Petit Bourgeois and Middle class are not interchangable terms. Petit Bourgeois is a rapidly shrinking group of people that don't exist anything like the way they did when Marx wrote about them. Most of what we'd call the middle class are some form of proletariat. Petit Bourgeois implies some significant ownership of private property but not enough to be sustaining without performing their own labour, the term I find most useful these days is 'passive income'. Most 'middle class' people have little to no passive income.\n\n2. Even then, reactionary and non-revolutionary doens't necessarilly mean counter-revolutionary. You can't count on the petit bourgoeis to enact the revolution but you needn't expect them to get in your way. That's what Marx says abut them deserting their own standpoint.\n\n3. Most of the support of fascism *is* likely embodied in the working class, and probably in all strata from the poorest to the richest. This isn't a death bell for communism, and it doesn't mean \"the majority of workers are fascists\"",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "alex7stringed",
                                                    "body": "Thanks that makes sense. Yes so what Marx means when he says that the petit-bourgeoisie desert their own standpoint is that they will support the winning side in a class war and that could be fascists or it could also be communists. \n\nSo fascism has also support among the working class. My question is how that can be then. I read a lot of Trotskys analysis of fascism and he talks about the petit-bourgeoisie role in it a lot and how they betrayed the working class. Which is true because National Socialism was an ideology crafted by petit-bourgeois for petit-bourgeois.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "caisblogs",
                                                            "body": "There definitely two distinctions to be made in the follow up:\n\n1. The Fascista and the Nazis (the **specific** parties) were both fascist reigimes. They're not the only way to implement fascism (the idology), as best exemplified by how different the two were. Trotsky's analysis of fascism was of the Parties more than the ideologies - in no small part because the ideology was so new. While his writing is helpful in contemporary analysis it holds us back to assume that contemporary fasicsm **must** follow the same patterns.\n\n1a. Modern thinking on fascism is that the ideology has very little in the way of rigid structure and is relitively adaptive to the right situations.\n\n2. fasicsm (as an ideology) is not a resolution to Marxist class contradictions. In part this is why Marxist analysis of the ideology are either fairly vague or focus on specific instances. It is perfectly possible for the proletariat (any individual of which may be completely unaware or unconvinved by Marx, and who is primarlly interested in his own struggle) to take up fascism as the 'solution' to their problems, and for some great mass of workers to do the same.\n\n2a. Marxists would say that fascism is not revolutionary, it will tend towards late stage capitalism and the need for revolution will remain until it is eventually taken.\n\n2b. Communists and fascists (ideologically) are not opposite sides in a war, the 'left/right' dichotomy isn't all that useful here. From a dialectical materialist analysis fascism contains within it the same contradictions, perhaps formatted a little differently.\n\nTL;DR Trotsky's analysis of Fascists is incomplete, in no small part because it is 80 years old, the proletariat (against their best interests) can enact fascism",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "alex7stringed",
                                                                    "body": "Ultimately it is easier for fascists to take power because they only have to pretend to be anti-establishment like the weasels they are and don’t touch capitalist means of production. It’s so depressing the workers fall for it too. How could they fall for the worst troll National „Socialism“. The workers class consciousness really is nonexisting. We need a revolutionary party that organizes workers like an army.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "caisblogs",
                                                                            "body": "You sound misanthropic and that is rarely a good outlook.\n\nClass consciousness can't be forced, and it can be a difficult lesson to learn. For any given population of fascists you will find some group who are desparate for change, and who found fascism before communism - as an ideology it has an easier time advertising because it doesn't have strict parameters. To this end fascism may gain more members quickly on paper but communism remains superiour at holding dedicated cadres.\n\nMost importantly, if the section of the fascist movement who simply desire change is large enough then they can be considered to not be counter-revolutionary.\n\nTo be clear this does not mean they are revolutionary, nor that it is the duty of any communist to march with a self-proclaimed fascist (deluded or otherwise) just that, with the right circumstances, there is no particular need for the communists to fight the fascist ideology when they can instead attack the bourgeois.\n\n>We need a revolutionary party that organizes workers like an army. \n\nI'm not sure what you mean by this, but it feels misguided. The proletarian revolution will require some military of course, but assembling all workers to be an army ignore that the proletarian revolution also requires non-militarty.\n\nAll in all I would advise you to reel in your current feelings of doom, real or not they're not practical, and maybe read some more contemporary marxists.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "alex7stringed",
                                                                                    "body": "I don’t know how I’m misanthropic when fascists have taken power in America, fascists are in power in Italy and fascists could take power in Germany. When organizing the workers like an army I was referring to Lenin’s organization, organization, organization and Trotsky. The  Right is on the rise globally and the Left is barely relevant.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "caisblogs",
                                                                                            "body": "I've called you misanthropic because you seem to have reached the conclusion that the apparent rise in fascism is a result of people (particularly workers) as being either stupid, bad, or both. I reject this as being broadly untrue - instead that the mechanisms of capitalism may leave a person with little else to believe in - and more importantly not useful. If you believe that workers, without external influence, will (through stupidity or malice) seek their own exploitation then communism is a pipe dream and distinctly infeasible.\n\nDoomerism has little place in communism, the class conflict has many forms and we do best to understand and counter them materially.\n\nThere are militant revolutionary communists. If you've not interacted with them it's because that's a dangerous group to be announcing yourself as a member of publicly",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "alex7stringed",
                                                                                                    "body": "It’s a known fact that most people are stupid though. They support their own oppressors. That’s why fascism rises in the first place. Our task is to educate and lead the workers like an army with a vanguard to overthrow capitalism.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "caisblogs",
                                                                                                            "body": "That's the misanthropy and you're going to be very little use as a revolutionary until you reconsider.\n\nStupid ≠ Uninformed. Sensible, logical, intelligent, and kind people can be put into systems where they are incentivised to work against their own best interests.\n\nOur task is to not lead but steer, to understand the pitfalls of past revolutions and ensure that when the workers are ready they can complete a revolution to overthrow capitalism. The vanguard is not 'above' the regular man.\n\nIt is not a fact that most people are stupid. Believing that will cause you harm",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "pointlessjihad",
                                            "body": "I can’t speak for Germany, in the US the petty bourgeois is made up of about 30 million people. That’s a significant political force and they do tend to be right wing. \n\nAs for the working class over here they split in either direction because our politics are not based on anything material, it’s all culture war nonsense and the democrats feed into it as well. Just based on the news I see about Germany I imagine e you guys are heading in the same direction. \n\nIf there is no party willing to offer the working class some actual change then the working class splits into whatever cultural forms makes sense to them. If Germany is headed in that direction then I feel for you cause we’ve been trapped here since the USSR fell.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "alex7stringed",
                                                    "body": "Oh god yes unfortunately culture war nonsense is the main political „content“ of the country. And it’s encouraged by liberal spinelessness and ideological weakness like in the US. And liberals still don’t get that the reason people vote Trump is because he stands for something. We are cooked. \n\nI watched a video about the [Petit-bourgeois support for fascism](https://youtu.be/RqESHNvmP20?feature=shared) and the guy also said the fascist MAGA movement is made up out of petit-bourgeois anxiety.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Yin_20XX",
                            "body": "You should read marx and lenin. You can do so for free at [https://www.marxists.org/](https://www.marxists.org/) and for free audiobooks at [https://www.youtube.com/@SocialismForAll](https://www.youtube.com/@SocialismForAll)\n\nFeel free to ask questions at r/Socialism_101 they are very helpful",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "glpm",
                            "body": "Is that what I said? Not quite.  \nElections don't change anything fundamental in a capitalist society. That doesn't mean they are useless or are to be boycotted. That's hardly what I said.  \nThere's no such thing as middle class. If you depend on your own labour to earn a wage you're a proletarian.  \nLa petite bourgeoisie isn't \"middle-class\" in the sense you're trying to convey here. It's basically a stratum of the society that doesn't sell their labour force to a capitalist (therefore not a proletarian) but live off government stipends or as a liberal worker, like a lawyer, and even small employers who are always on the brink of becoming proletarians themselves (boulangers?).",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Excellent_Valuable92",
            "body": "The proletariat was far from the majority in late 19th century Germany, France or Britain, when Marx was there. It was far from the majority in early 20th century Russia. Most of Marx’s writing is about explaining why the have social weight disproportionate to their numbers. ",
            "score": 5,
            "replies": [
                {
                    "author": "CoysCircleJerk",
                    "body": "Can you explain a bit more what you mean here? Would early 20th century Russia not be composed primarily of proliferate because the peasant/nobility societal hierarchy still existed and the country had not meaningfully industrialized?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Withnogenes",
                            "body": "I think that comment should be disregarded. \nFirst point, there is no \"germany\" prior to 1871, what are you even talking about?\nSecond point, of course the working class was the majority, always has been. The reason for this mistaken statement could be a confusion between as what Marx defines the working class in capital as a technical term and the amount of people who describe themselves as workers, in short: confusion about the term proletariat and class consciousness.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Excellent_Valuable92",
                                    "body": "I was referring to Germany, as a region, not a country. I am not at all confused about terms. The proletariat was a minority in all the examples I gave. The peasantry was the majority. ",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Withnogenes",
                                            "body": "Why would Marx and Engels then as early as 1848 announce \"Proletarier aller Länder, vereinigt euch!\"? They didn't say peasants, \"Bauern\", no? \nWhy is capital addressed to the working class in 1867 which is clearly not about peasantry?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Excellent_Valuable92",
                                                    "body": "Because they were addressing the proletariat, obviously. They explain clearly why the proletariat is the revolutionary class, and that reason is not numerical superiority. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Excellent_Valuable92",
                                    "body": "It’s extremely offensive that you would tell OP to disregard my (correct) answer, rather than tell me what you thought was wrong.\nEspecially, since it is you who is completely wrong ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "prodigalsoutherner",
            "body": "People won't fight for change until the status quo becomes intolerable for the majority of people.  Support revolutionary movements that will result in cheap labor being taken away from the global north.  Once conditions deteriorate sufficiently in Europe and North America, communists will win.",
            "score": 4,
            "replies": [
                {
                    "author": "alex7stringed",
                    "body": "Isnt most of cheap labor already concentrated in the Global South by the bourgeoisie? And unfortunately insupportable conditions don’t guarantee communist victory as seen in Germany. That’s why I’m curious about the class differences",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Phurbaz",
                    "body": "No not this. Immiseration thesis in non marxist. The goal is not to have conditions deteriorate but building a working class movement on the promise of transforming capitalism into the fullfilment of the bourgeoise society.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "3corneredvoid",
            "body": "AfD pretty much gets more of the popular vote the further east you go, which in turn corresponds to increasing economic precarity.\n\nThis in turn is peculiarly correspondent to Poland east of Germany, where \"Poland B\" (those parts of Poland outside the historical border of the Westphalian border) is less prosperous than \"Poland A\" (the increasingly westernised or \"Germanised\" regions), and \"Poland B\" is also the main constituency of the Law and Order (PiS) party.\n\nThis is more or less the \"economic anxiety\" or \"relative downward mobility\" argument, that is to say, workers are anxious about being driven by economic changes towards changes in their conditions they perceive as decisive (depending on the circumstances, this might mean a different type of work, a mortgage default, a need to receive state benefits, etc).\n\nI can offer two Marxist reference points that might be interesting:\n\nWEB Du Bois, BLACK RECONSTRUCTION. Du Bois's discussion of the class position and psychopolitics of the \"poor whites\" is forever relevant.  \n  \nNot because of a need to introduce the historical formation of race into this discussion of Germany, but because it gives a concrete example of how a section of the proles can attach and detach itself ambiguously from the interests of (a section of) the bourgeoisie subject to changing perceptions of relative advantage.\n\n[PDF of the book](https://cominsitu.wordpress.com/wp-content/uploads/2019/02/w-e-b-du-bois-black-reconstruction-an-essay-toward-a-history-of-the-part-which-black-folk-played-in-the-attempt-to-reconstruct-democracy-2.pdf)\n\nThe other would be Bologna's \"Nazism and the working class\".\n\n[Article on Libcom](https://libcom.org/article/nazism-and-working-class-sergio-bologna)\n\nBologna makes one point I always find crushing, that in economically disastrous 1930s Germany, state welfare assistance became dependent on an increasingly narrow municipal patronage:\n\n> … during the Depression an increasing number of people fell out of the first two levels and ended up in the third, with the result that local councils found themselves having to cope with a demand for funds which hadn't previously existed. Thus unemployed people were receiving less and less money.\n\n> To phrase it differently, the unemployed were being turned into the assisted poor, and the judgement as to whether, and to what extent, they had the right to assistance was decided no longer by a ministerial bureaucracy but by a municipal bureaucracy which was in part unprepared, but which was also overwhelmed by the huge demands being made upon it.\n\n…\n\n> The result of driving the unemployed onto the system of municipal welfare was to create an army of people obliged to go asking for charity from a bureaucrat, who very often judged their needs solely on the basis of subjective impressions. The unemployed could receive social security only if they succeeded in convincing the benefits officer in a face-to-face interview. This led to the creation of a mass of millions of people who were open to blackmail. Furthermore - a fact which was important for the subsequent Nazi regime - the details of all these people were thoroughly documented.\n\n> But this was not all. As I said above, social security benefits paid by the municipal councils were expected to be repaid. Thus large numbers of people found themselves saddled with lifelong debts to their respective municipal authorities. (In a shrewd move, in 1935 Hitler issued a decree which cancelled all debts of welfare recipients to their respective councils.)\n\nMarxist analysis will point (in my view correctly) to fascism being an arrangement of class collaboration (between the bourgeoisie and a \"national\" power of the proletariat, usually but not necessarily a population majority). But this account doesn't necessarily make it clear the ways in which this collaboration can emerge, or even be compelled, by specific historical conditions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Intrepid_Layer_9826",
            "body": "The common sense definition of middle class (person earning a comfortable standard of living) isn't the same as the marxist definition of middle class(petty bourgeoisie). So I have to ask, which one are you referring to?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Yin_20XX",
            "body": "You are using \"class\" and \"petit-bourgeois\" wrong. Let's simplify this. \n\nUnder Capitalism, you either\n\nOwn capital, are therefore in the minority of the population, and use it to exploit labor,\n\nor\n\nYou do not own capital, are therefore the majority of the population, and your labor is exploited.",
            "score": 2,
            "replies": [
                {
                    "author": "alex7stringed",
                    "body": "Im referring to this Marx text: \n\n„The independent peasant or artisan is cut into two persons. ... As the owner of the means of production he is a capitalist, as a worker he is his own wage laborer. He thus pays himself his wages as a capitalist and draws his profit from his capital, i.e. he exploits himself as a wage laborer and pays himself the tribute that labor owes to capital in the surplus value.“\n\n„A certain degree of capitalist production implies that the capitalist can use all the time during which he functions as a capitalist ... can use all the time during which he functions as a capitalist to appropriate and therefore control the labor of others and to sell the products of this labor. ...\nThen the owner of money or commodities ... really becomes a capitalist. \nHowever, he himself, like his worker, can lend a hand directly in the production process, but is then also only a middle thing between capitalist and worker, a petty capitalist or **petty bourgeois**.“\n\nMarx is saying that the petit-bourgeois is a middle stage of both capitalist and worker that’s why I’m confused when people say you are either capitalist or worker.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TTTyrant",
                            "body": "He's saying the petit-bourgeoisie are a \"middle ground\" between entirely bourgeois or entirely proletarian. Since they are a hybrid...being both the owner of their means of production as well as participating in the production process with their own labor power.\n\n\"Middle class\" as its used in capitalism refers to income. Not your relationship to production. The petit-bourgeoisie are a distinct class in Marxism, tho.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "alex7stringed",
                                    "body": "I see now. So my question doesn’t make sense. But then if the workers are the comfortable middles class majority in Germany who vote for fascism our situation is even more hopeless. The majority of workers should vote in their class interest which is Left parties",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TTTyrant",
                                            "body": "They should. But there needs to be a genuine workers party based on class interests and liberal \"democracy\" would never allow one to exist or get to the point of threatening the existing order of bourgeois rule.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Phurbaz",
                                            "body": "The workers vote for fascism precisely \\*\\*because\\*\\* there is no working class movement. The rise of fascism is a symptom of the missing proletarian organization. And thus the solution to end fascism is the same as to combat capitalism: organize the socialist working class.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "alex7stringed",
                                    "body": "Yeah I see now. I somehow equated middle class to petit-bourgeoisie in Germany when it only refers to income. But yea makes sense in most countries to the workers are actually poor but Germany is rich. So the wealth of someone doesn’t determine their class but their relation to the capitalist mode of production. \n\nSo I guess now my question is how the relationship of the working class to the petit-bourgeoisie looks like in Germany. I mean the workers can’t be so stupid to vote with their petit-bourgeois and even the big bourgeoisie. Have they forgotten the betrayal of the petit-bourgeoisie  of workers in National Socialism?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sinnaj63",
                    "body": "I mean the petit bourgeoisie does exist. Obviously there are small business owners who own some capital but still have to work in their business themselves. And there's a sizable portion of the state apparatus(cops famously) who while they do technically do labour for wages have a privileged position of violent thugs for the ruling class.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JohnWilsonWSWS",
            "body": "What are you looking at that tells you \"the majority of \\[German\\] society is middle class\"?  Hasn't there been a process of proletarianisation?\n\nEven if they are \"middle class\", are their lives comfortable or going backwards?  Do any of the bourgeois parties have a program that addresses the regression in standard of living and financial insecurity?\n\nWhy has Germany led the way in the use of \"antisemitism\" (i.e. anti-criticism of Israel) laws to suppress freedom of speech?\n\nWhat did you think of the debate that was just held?\n\nFYI:\n\n[German federal elections: Social Democrats and Christian Democrats agree on all key issues - World Socialist Web Site](https://www.wsws.org/en/articles/2025/02/12/ybzd-f12.html)  \n12 February 2025\n\n>... Scholz and Merz agreed on all major issues and tried to outmanoeuvre each other from the right. **Issues affecting millions—rising prices and rents, increasing poverty and declining pensions, the education and healthcare crisis, mass layoffs in the automotive and supplier industries, and the climate crisis—were either not addressed at all or only touched upon briefly.**\n\n>Instead, the debate focused on inciting hatred against migrants, rearmament, and cuts in social provisions. While nearly a million people across Germany took to the streets for the second consecutive weekend to protest against the cooperation between the CDU and far-right Alternative for Germany (AfD), Merz and Scholz bragged about being even tougher on refugees than the right-wing extremists.\n\n[Sozialistische Gleichheitspartei certified to stand in German federal election - World Socialist Web Site](https://www.wsws.org/en/articles/2025/01/16/qkhd-j16.html)  \n15 January 2025\n\nIt is also worth nothing the anti-democratic laws that exist to keep parties off the ballot. The bourgeoisie doesn't like the competition against its major parties at the ballot box. Why? Because in Germany, as elsewhere, there is a  turn against them.\n\n>Many parties have been excluded from participating in the February election due to minor formal errors. In the case of the Marxist-Leninist Party of Germany (MLPD), a Maoist organisation, the Federal Electoral Committee initially decided, in an extraordinary session, that the party could not submit a valid notification of participation because, according to its statutes, it only elects its executive committee every four years and not every second calendar year as prescribed, and therefore did not have an “executive committee capable of acting.” As a result, the MLPD first had to elect a new leadership at a special party congress in order to be admitted to the February election.\n\n[Germany’s early elections: A conspiracy of all parties in favour of war and cuts - World Socialist Web Site](https://www.wsws.org/en/articles/2024/11/14/bfjv-n14.html)  \n13 November 2024\n\n>Perhaps the most important contribution to sealing off the election against the broad opposition to social cuts and social inequality was made by the IG Metall union on Monday night. Although more than 620,000 IG Metall members had previously demonstrated their willingness to fight through warning strikes, the union agreed to a lousy sell-out in contract negotiations covering the 3.9 million employees in the metal and electrical industries. This does not even cover the current level of inflation, let alone the massive wage losses of the past years, and, with a contract term of more than two years, protects the backs of the companies, which are planning mass layoffs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Qweedo420",
            "body": "I've done a lot of political activism among the lower class but I also work regularly with the petite-bourgeoisie, and let me tell you, most fascist voters are from the lower class\n\nIt could be a lack of education, poverty, exposure to bad neighborhoods and workplaces etc, but I've seen so many poor workers who got fooled by right-wing and racist propaganda\n\nOn the other hand, most petite-bourgeoisie that I know are extremely progressive and \"international\", we mostly work with people from other countries and it's probably this continuous contact with other cultures that removes prejudice\n\nNow, making a revolution is an entirely different matter and it requires a specialized vanguard party, being \"progressive\" is not enough, and generally speaking, those progressives are opposed to violence because it disrupts their livelihood\n\nTo answer your question, \"why should the majority be for the revolution\", I think they would be during a significant crisis e.g. a world war, when their lives are already so disrupted that pointing their guns toward their superior wouldn't make things worse, but they still need a party to guide them, otherwise they would just be deserters",
            "score": 2,
            "replies": [
                {
                    "author": "Phurbaz",
                    "body": "Well the reason for this is frankly that most voters of any movement are working class, because we live in capitalism where most people are working class. Petit bourgeoise, i.e. the most reactionary cohort of the class strata, are overly represented in movements such as fascism and Trumpism etc., this is borne out by the polling done on the subject. The reason why the working class supports fascism on the other hand is quite symptomatic; the working class movement has been defeated. This is a basic historic point.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GB10031",
            "body": "Are the majority of German adults small business owners,  farm owners, corporate executives  & independent self employed professioals?\n\n  \nOr are the majority of German adults production workers, skilled craft workers, service workers, nonsupervisory clerical workers and non managerial public employees?\n\n  \nI'm not as familiar with German society as I am with American, but if Germany is anything like America I'd assume the latter - that is Germany, like  America, is majority working class",
            "score": 1,
            "replies": []
        },
        {
            "author": "Born-Requirement2128",
            "body": "By violent revolution and tyranny of the minority, as happened in the Russian Empire, where the industrial working class was about 1% of the population (less than the 1.5% aristocracy that preceded it). ",
            "score": 1,
            "replies": []
        },
        {
            "author": "gizmodilla",
            "body": "Most of AFD voters are lower class / working class people now who have been captured by the propanda. The AFD has the biggest support in eastern germany which is still significantly less well of in the case of wealth and not very educated\n\nHere is an article from germany\n\n  \n[https://www.rnd.de/politik/afd-waehler-maennlich-wenig-gebildet-und-haeufig-arbeitslos-SZOFU4HNDJN2ZLIMAPVITYF3M4.html](https://www.rnd.de/politik/afd-waehler-maennlich-wenig-gebildet-und-haeufig-arbeitslos-SZOFU4HNDJN2ZLIMAPVITYF3M4.html)\n\nActually most people who vote for the left like the \"Linke\" or the \"Grüne\" (yes yes i know they had a hard shift to the right in the last years) are middle class or above",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oskarkf",
            "body": "Most of Germany is proletarian, and the make up of said proletariat is much more complicated than that of Marx's time.\n\nBut to answer your question, Trotsky wrote at length about it in the permanent revolution and his texts on fascism.",
            "score": -1,
            "replies": [
                {
                    "author": "alex7stringed",
                    "body": "My question is then if the middle class is different from the proletariat or if it’s only workers who attained wealth? Why did Marx call the middle class petit-bourgeois then if it’s the same",
                    "score": 1,
                    "replies": [
                        {
                            "author": "1playerpartygame",
                            "body": "Basically the nature of this section of the proletariat being relatively well paid and comfortable obscures their class interest. They may be a member of the proletarian class due to their relationship to the means of production, but if they're in a sector of the economy that would not exist in a socialist society (like a speculator providing liquidity to a capitalist market) or have a negative rate of exploitation (are paid more than the value they produce) they might immediately suffer from the socialist transformation of the economy, even if it's just for a short time.\n\nCollectivisation could threaten overpaid workers' status as a labour aristocracy since their wages might fall in line with their productivity. Members of the PMC might lose their employment if a workers' government decides to focus on self-management in the economy. Transitioning to a socialist economy is not an easy road, and won't immediately make every proletarian's life better. \n\nAll that contributes to why some sections of the working class might feel more attracted to Fascism as an attractive 'alternative' to Capitalism. Then the movement spreads false conciousness among more sections of the proletariat, and the bourgeoisie is very happy to appease Fascists as a ward against Communist and Socialists since Fascism doesn't fundamentally challenge the structure of the capitalist economy. It instead reinforces it by co-opting themes of struggle and revolution while stripping their class analysis away.\n\n(also it kinda sucks that the original commenter is getting downvoted just for mentioning Trotsky, I'm no Trot, I just think it's sad that the communist movement is like this)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Video9141",
            "body": "Countries with a median age over 40 don't do revolution. There no youthful vitality that makes revolutionary action viable. Germany has a median age of 45 meaning the largest cohort who exist are at the point where they either are retired, nearing retirement, or don't have the ability to do that.\n\n\nFurthermore, a whole section of the youth are under Islamist sway either because they are immigrants who got sent with such Imams and are consciously refusing to mix in with German society. Even without the age issue such a large cohort are not rebelling for socialism. They will do so for a Caliphate and their presence makes everyone else unwilling to go socialist if the fact the AfD and CDU are combined who the youth vote goes for.",
            "score": 0,
            "replies": []
        }
    ]
}