{
    "title": "The Soviets (worker councils) longevity",
    "author": "Breoran",
    "subreddit": "Marxism",
    "rank": 45,
    "score": 22,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Marxism/comments/1isjnbq/the_soviets_worker_councils_longevity/",
    "id": "1isjnbq",
    "selftext": "How long did the Soviets that started after the revolution last? Right until the fall of the soviet union, or did worker control end much earlier than that, and just remain some form of planned economy? \n\nWhat I've not understood about the various policies the government put in place during Stalin's leadership is that I was under the impression that it was for the Russian workers to decide ultimately what happened, say in agricultural practices, and the party would merely advise them on how to achieve it in a way that sustains the regulation, ie \"within a Marxist framework\". Have I misunderstood the role and authority of the soviets?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SvitlanaLeo",
            "body": "De jure until 1993, de facto already after the revolution researchers are mainly interested in what happened in the Central Committee and the Politburo and have little interest in what happened in the Soviets...\n\nHowever, it must be said that the powers of the party, and not the Soviets, grew with each new Soviet constitution. The 1977 Constitution prescribed the leading and guiding role of the party at the beginning of the Constitution and abolished the 1936 Constitution requirement for party members to be \"active and conscious citizens from the ranks working class, working peasants and working intelligentsia\".",
            "score": 9,
            "replies": []
        },
        {
            "author": "Comprehensive_Lead41",
            "body": "They stopped being relevant during the civil war and were formally abolished in 1936, when a new constitution introduced bodies that were still called soviets, but were more like bourgeois democratic communal councils",
            "score": 18,
            "replies": []
        },
        {
            "author": "1playerpartygame",
            "body": "The economy stayed planned for a long while but whether it was socialist is another question. \nSoviets were essentially neutered after the revolution first with the removal of the other parties who had been elected from the Soviets and then with the ban of party factions which essentially moved decision making power from the working class via the Soviets to the Party via the politburo and Central committee.\n\nIn the 1977 constitution there were some provisions for referendums giving the people some agency over their government, but the power of the Soviets didn’t come back.\n\nImo the sidelining of the Soviets was probably the worst mistake of the revolution, there was a chance to build a state that revolves around the planned economy and could effectively shut out right-wing deviations and capitalist roading while encouraging legitimate political opposition that doesn’t undermine the socialist economy. (In the same way that although bourgeois parties have different policies and platforms, no matter which is elected the capitalist base is never threatened)",
            "score": 9,
            "replies": [
                {
                    "author": "echtemendel",
                    "body": "While I agree this was a grave mistake, it's important to remember this happened during an incredibly bloody civil war, which could possibly defeat the revolution and reverse all its achievements. The goal was to minimize internal fighting and be able to move forward with minimal interruptions.\n\n\nSo while this isn't an excuse, in order to do better next time people should learn from this mistake and prepare accordingly (since there's no reason to think that Capitalist states would not try to defeat the revolution).",
                    "score": 6,
                    "replies": [
                        {
                            "author": "1playerpartygame",
                            "body": "Oh yes! I understand that at the time all those decisions were totally logical, Lenin and his revolutionary contemporaries  had no way of knowing that pragmatic decision made in the defense of a bold new revolutionary system would lead to such problems down the line.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}