{
    "title": "What work (or part of work) by Marx do you think is too rarely remembered by Marxists?",
    "author": "SvitlanaLeo",
    "subreddit": "Marxism",
    "rank": 34,
    "score": 33,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Marxism/comments/1iwh56o/what_work_or_part_of_work_by_marx_do_you_think_is/",
    "id": "1iwh56o",
    "selftext": "It seems to me that Marx is in principle a very selectively read author, despite the fact that Marxism has a history of demonstrative cult of his works. And do you think that there is some work of Marx, or part of his work (for example, some specific chapter of Das Kapital), that is often preferred to be bypassed or not remembered? It must be remembered that there are often heated debates among Marxists about what Marx actually believed.\n\nSo, is there any work (or part of work) of Marx's that you personally would prefer to be better known and quoted?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "oak_and_clover",
            "body": "Volume 2 of *Capital*, though it has stretches that are in my opinion very forgettable (the two chapters about Smith and Ricardo, especially), also has some of the most insightful ideas in all of his works. In particular, I’m thinking of the later chapters that deal with his economic modeling, how he tinkers with the idea of M-C-P-C’-M’, and the discussion of how it is only in the sphere of production where value is created (that last one has major implications for present day capitalism, where a country like the US has very little production of goods and services, and thus is built not on the production of value, but from appropriating value from the places where it is generated i.e. the global south).",
            "score": 29,
            "replies": []
        },
        {
            "author": "ElEsDi_25",
            "body": "Civil war in France is the basis of State and Rev but people hardly talk about it when it’s the only example of a DotP Marx was able to follow in real time and theorize about.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Zandroe_",
            "body": "German Ideology, the fragment on machines from the Grundrisse, Marx's marginal notes on A. Wagner, \"Private Property and Communism\" from the manuscripts of 1844, and although it's by Engels, Antiduhring.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Cybercommoner",
            "body": "Critique of the Gotha Programme--despite it being probably one of the most read of Marx's works, the points made in the Gotha Programme, that Marx incisively shreds, are revived all too often in various forms by Marxists. Makes one wonder whether Lassalle has had a larger influence over Marxism in the last century or so than Marx and Engels themselves!",
            "score": 19,
            "replies": [
                {
                    "author": "UndeadOrc",
                    "body": "That’s why it’s my favorite! It remains a consistent critique that one too many fail to internalize. I keep coming back to it just because exactly as you say, the points are revived all too often. I think there are a lot of Marxist who’d find themselves shocked to be subjected to his scorn and don’t see themselves as subject of the critique, when they probably should.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CalligrapherOwn4829",
            "body": "Honestly, *Grundrisse.* It clearly makes the connection between Marx's ethical project and humanist concerns on one hand and his analysis of capitalism on the other. I think it is the most useful text in terms of serving as a basis for critiquing numerous tendencies within the \"orthodox\" Marxisms of the 20th century.\n\nNot incidentally, Marx also has some words on the genesis of states and class that are in sharp contrast to the shamefully inadequate notions put forward in Lenin's *The State and Revolution*, as well as explicitly stating, \"[T]he idea held by some socialists that we need capital but not the capitalists is altogether wrong.\" Needless to say, the people who insist that state monopoly capitalism is socialism like to live in denial about this.",
            "score": 10,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary_Leek_1837",
            "body": "You raise some excellent points about Volume 2 of *Capital*. The sections you mentioned indeed delve into critical economic concepts, particularly the M-C-P-C’-M’ model, which illustrates the process of capital circulation and the transformation of commodities into money and back again.\n\nMarx's argument that value is primarily created in the sphere of production highlights the importance of labor and production processes in generating economic value. This perspective is particularly relevant today, as many economies, including the U.S., have shifted towards service-oriented models, often relying on global supply chains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turbulent_Book_1685",
            "body": "Marx's critique of capitalism is fire, but his ideas on worker self-management are often slept on. He believed workers should control the means of production, not just be wage slaves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Born-Requirement2128",
            "body": "Interesting to compare this point with selective quoting from the Bible or Quran by people promoting religions. There are many passages that would not attract new followers to those faiths!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Interesting-Tax8451",
            "body": "I don't know much works I know Marx's classic and my father gifted me Holly family by Marx and Engels and that was the first time I was met with it probably would have never known otherwise",
            "score": 0,
            "replies": []
        }
    ]
}