{
    "title": "Are we destined to be ruled by the rich?",
    "author": "AlphaC27",
    "subreddit": "Marxism",
    "rank": 16,
    "score": 32,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Marxism/comments/1j13p6p/are_we_destined_to_be_ruled_by_the_rich/",
    "id": "1j13p6p",
    "selftext": "First of all yes, I apologize if I make mistakes, English is my second language.\n\nDemocracies unfortunately have a historic trend of gravitating towards plutocracies, i.e. the rule of the wealthy, historically wealthy families in particular. Even in ancient city-states, power was concentrated in a handful of wealthy landowning families, while voting was simply a way to break stalemate in the noble assemblies. Even citizenship itself is engraved in the ownership in land. The USA today in particular has a strong cultural affinity towards land ownership. This was especially prominent in Rome where voting was done in descending succession according to class. This didn't change with the medieval merchant republics of Italy where merchant families held all practical power, such as the Medici in Firenze, Sforza and Visconti in Milano, Gonzaga in Mantua etc.\n\nEven today we see this trend clearly, where political power gravitates toward the wealthy. Early in a states development, certain actors, i.e. individuals, groups, organizations, parties, go through something called *Primitive accumulation of capital*. Basically, early on they get rich *somehow*. Usually in the chaos of the disintegration of the previous state. We see this most clearly in Eastern Europe, where those who accumulated power in previous socialist states and during their downfall, i.e. the *Nomenlkatura*, hold power and wealth today. Other wealth is older in origin, for instance in the West it comes from centuries of colonialism, slavery, royal ties etc. As the wealth of a state rises, it's inequality is less noticeable, however over time wealth stagnates and concentrates among a few. And I don't mean simply money and land, access to higher education, healthcare, business opportunities etc. It becomes *generational*, and also private as those new to wealth have trouble competing with those from old wealth.\n\nIt turns politics in to a rotating system closed of from the general public unless they want to play the petty games of the wealthy who only use this governing apparatus as a battlegrounds to push their own private interests. This is why today the highest state assemblies and magistrates seem so out of touch with the common people, legislation has **nothing** to do with popular opinion ( Princeton University in particular has some papers on this topic at least in US I can link), their agendas so alien and labyrinthine. And as was always the case you have two sides, as was in Athens between the democrats and oligarchs, as was in Rome with populates and optimates. On one side are plutocrats who seek to use the wider masses to help manipulate higher decision making by enacting smaller popular reforms to win over the public. And the conservative side seeking to appease the higher echelons of power and convince the masses to keep the status quo by appealing to their personal ethics and values. This is most clearly seen in the USA, between the \"left\" Democrats and \"right\" Republicans, even though they are the same people.\n\nThis is particularly troubling today, because unlike in the past and ancient democracies, this wealth is not concentrated in owning land, it's not even concentrated in owning physical money or holding political positions. This makes it harder to tax, in fact today the richer you are the easier it is to evade taxes, unlike in the past. This has reached a point where **evading taxes is considered a good thing** **culturally**. This means that the wealthy today, which are basically made up of corporations and wealthy individuals with stakes in these corporations, have little to no combined interests with the state. In fact, **the interests of corporations today more often than not are directly opposed to the interests of the state**. So the corporations push interests which oppose the state and the majority of those under it, that's us, the common schmuck, and our elected politicians battle over these interests in front of us. Worse yet they funnel dangerous ideas from the top to the bottom to rouse the common people, such as religion, ethnicity, nationality, race etc. So now you have a poor conservative christian farmer supporting massive international food conglomerates destroying his livelihood, to give an example. \n\nWe can see this blatant shift in modern liberal democracies experiencing an all to obvious concentration of not just capital, but political power in a handful of powerful actors whose main function is the international, suprastate generation of income and, accumulation and retention of capital.  Are all modern liberal democracies destined to mutate in to plutocratic corporatist republics? Where does that leave the third world?\n\nAm I on to something or just yapping? I would love to get some input and start some discussions. I would like to disclaim that I am not from the US, despite quoting it a lot. And I can provide resources and sources for anyone interested.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Marxism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "carrotwax",
            "body": "I've enjoyed Michael Hudson's recent books (a Marxist economist/historian) and he notes that every society that doesn't regularly redistribute wealth falls apart.  The jubilee year was incredibly important to preserve society.  This is saying that no society ruled exclusively by the rich is stable.  \n\nRight now the West is in a crisis of extreme wealth concentration and getting worse.  Unfortunately this concentration affects all aspects of life including science and history.  For many decades it's been known that to have a career in academia you have to say things that please who gives out grants and gatekeeps research journals, which mean economists that point this out are rare.  Both Michael Hudson and Richard Wolff describe economics in university in different ways. \n\nI say that because censorship and bullshit only lasts so long.  Few people trust economic indicators showing \"prosperity\" now given the real living experience of most people.  We're in a crisis of production and well into monopoly capitalism.  \n\nSo I'd say in the long term, no we're not destined to be ruled by the rich.  But it's very important to build up organizations such that when society falls apart, there's planning, theory, and support to make a transition.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Allfunandgaymes",
            "body": "In short, no.\n\nZoom out. The span of time in which humanity has been \"ruled\" by a handful of extremely wealthy people is a short blip in the span of time - hundreds of thousands of years by most recent reckoning - that anatomically modern humans have existed. We have relatively _only just begun_ amassing surplus and abundance (coinciding roughly with the advent of agriculture ~12k ya) and learning how to deal with that, as well as the intraspecies cheating that has come with it.\n\nAlmost certainly not in our lifetimes. Or in the lifetimes of our grandchildren. One day far off, yes. The rule of the wealthy will be broken. But not without substantial effort from us, now.",
            "score": 15,
            "replies": []
        },
        {
            "author": "_some_asshole",
            "body": "No. Oligarchic rule, unlike perhaps monarchy (divine right) has no fetters and no limits. It is inherently unstable and self destructive. Look at Russia, look at Elon. We will transition to something better, but first there will be a collapse which will not be fun to live through :/",
            "score": 7,
            "replies": []
        },
        {
            "author": "DefiantPhotograph808",
            "body": "This post is terribly long and is more like drunk rambling. Obviously, Marxism would never suggest that we are \"destined\" to be \"ruled by the rich\". The \"rich\" do not rule themselves because capital is autonomous, and the bourgeoisie are justs much a slave to it as we are.",
            "score": 11,
            "replies": []
        },
        {
            "author": "glpm",
            "body": "If we don't pull out a revolution to destroy the bourgeoisie as a class, yes. \n\nI find it funny some people here say \"no\" as if socialism and communism were a historical certainty. Historical certainties don't exist and to defend it is antimaterialist and antimarxist.\n\nWe as the proletariat need to organize and do the revolution. It won't happen out of nowhere.",
            "score": 6,
            "replies": []
        },
        {
            "author": "silverking12345",
            "body": "The whole premise of socialism and communism is the belief that there is an alternative. Libertarianism and liberalism is the complete opposite, it's the conceding of possibility due to the lack of vision.\n\nCapitalism will always lead to the concentration of power in the upper class. In capitalism, money IS power. Money is a representative of control over resources and goods, stuff that people need to survive on this Earth. Having more of it necessarily makes one more capable at influencing people and their decisions.\n\nThis is why democracy under capitalism is a farce. It is a system destined to always fall into oligarchy and fascism. If you observe it closely, you will inevitably come to the realization that there really is no egalitarianism in capitalism, and the so called \"democracy\" is a game of influence which the rich will always dominate.\n\nYou are right, but only in the circle of capitalism. Socialism and communism were formulated as an alternative that, althought not imperfect, will make the kind of class struggle you see in the current system a thing of the past.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Human_Mobile3788",
            "body": "read Marx...you put a lot of effort and energy into this post instead of reading the books and works that would have answered your question...please for the love of God people, exercise the tiniest modicum of curiosity about the world before deciding everyone needs to hear your thoughts",
            "score": 3,
            "replies": []
        },
        {
            "author": "ComprehensiveHold382",
            "body": "Human beings, are born to parents, and trained to obey somebody that has a higher authority then them. \n\nKings, Dictators, Religious ententes, and now rich people are seen as authorities, and humans have to fight against that training.",
            "score": 1,
            "replies": []
        },
        {
            "author": "usesnuusloosetooth",
            "body": "At least it seems to me that this is the one revolution that was more or less behind the idea of all attempted revolutions. And is however, also the one revolution that has never yet happened. Which is why I often say, that I don't think there has ever been a real revolution.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soar_Dev_Official",
            "body": "you're doing a *lot* of bad history here, so I'm going to only push back on one piece of it- the level of wealth equality that the West experienced in the mid-20th century was wholly anomalistic, and only happened because of a large-scale embracing of socialist values. it was a compromise by the ruling class with a socialist working class, and was only possible because of massive exploitation of the third world. in recent decades, the 3rd world has either been drained dry or has effectively consolidated power in such a way that further extraction is more challenging, so that compromise is no longer being honored.\n\nbig picture, more responding to your overall thrust: I know I'm going against the grain here, but imo, yes, largely our systems drive us towards wealth inequity and oligarchy. to this day, non-agrarian societies tend to be very strictly egalitarian, while agrarian societies trend towards hierarchy of one form or another. to me, this implies that the first injustice is that of the farmer- the original private ownership of the means of production, and the foundation that modern society is built on.\n\nI don't mean to imply that there's no way to live sedentary lives without some form of exploitation emerging. it's more to say that this appears, to me, to be the default way that systems emerge out of a sedentary lifestyle. if we're going to do it different, or do it better, it must be done with a degree of intentionality and control, and I think Marxism is a good model for how to make that happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shakedangle",
            "body": ">first injustice is that of the farmer- the original private ownership of the means of production\n\nSeconding this opinion. But I wouldn't really call it an injustice - it's more like an inevitability of social animals who have learned agriculture.\n\nJust as it is an inevitability that social systems trend towards oligopolies and concentrations of wealth. OP, I'm with you in your pessimism. The last major global disruption was WWII, and even there the wealth distribution (post-war European allies, Germany, Japan) was regional, and in some cases mandated by the winning side. Every major disruption since WWII has generally seen wealth and power consolidation (if occasionally changing hands) at the expense of smaller players.\n\nBeen reading up on [System Dynamics](https://www.stockholmresilience.org/publications/publications/2024-10-24-a-dynamic-network-model-of-societal-complexity-and-resilience-inspired-by-tainters-theory-of-collapse.html#:~:text=In%20this%20work%2C%20we%20abstract,via%20a%20self%2Dreinforcing%20feedback) to understand the long view of what's happening. It's not good. The gist is that as societies remain (relatively) stable, complexity increases - this complexity creates specialists who have rarified knowledge and control of the system - and they are coopted by those who accumulate resources. Those in power become entrenched, AND start to align with each other. This is OP's 2nd and 3rd paragraphs.\n\nSystem collapse occurs when the majority alignment no longer adequately addresses the purpose of the system due to changing external factors - take climate change for example. Alignment cannot change (course correct) because the complex web of inter-connected interests of the system reinforce the existing alignment. And destabilizing forces, things that a properly functioning system should address so that it can continue to exist, will eventually become unmanageable due to this inability to course-correct. \n\nOnce a system experiences collapse, a new order could take its place to address the misalignment. However. \n\nAs OP states,\n\n>This is why today the highest state assemblies and magistrates seem so out of touch with the common people, legislation has **nothing** to do with popular opinion\n\nthose in power are becoming less and less accountable to the majority. For resource accumulation, this is the goal AND method - the ability to extract, hold, and further accumulate resources without restriction from other elements of society. Automation and AI further widen the gap by devaluing human physical and intellectual labor.\n\nI'm afraid that we will no longer see a global collapse that will widely re-distribute wealth. I see no mechanism by which the interests of the majority can be enforced upon the resource owners. The last time that happened was WWII, through force, and it was regional. Climate change, if (big if) it does not cause a runaway effect, can be managed through resources. Wealth-hoarders are essentially immune from any societal backlash, and the more that becomes obvious, the more people will want to align with them.\n\nVery open to counter arguments. Or a slap in the face. Swear that's not a fetish (yet).",
            "score": 1,
            "replies": []
        }
    ]
}