{
    "title": "[HomDGCat 3.2v3] Apocalyptic Shadow Hoolay Mechanics",
    "author": "homdgcat3",
    "subreddit": "HonkaiStarRail_leaks",
    "rank": 11,
    "score": 942,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 220,
    "url": "https://www.reddit.com/gallery/1j9znv6",
    "id": "1j9znv6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Info_Potato22",
            "body": "Hoolay V4 is out before the playable's and his \"eidolon\" is already better than castorice's",
            "score": 804,
            "replies": [
                {
                    "author": "FanChance9539",
                    "body": "I think we have our first future proof dps, can't for his banner during 3.2",
                    "score": 295,
                    "replies": [
                        {
                            "author": "RentLast",
                            "body": "My Foxian characters trying their best to buff this war criminal who enslaved their entire species while trying not to scream. Huo Huo already passing out first",
                            "score": 154,
                            "replies": [
                                {
                                    "author": "stxrrynights240",
                                    "body": "HUOHUO MY CHILD NOOOOOO",
                                    "score": 60,
                                    "replies": [
                                        {
                                            "author": "RentLast",
                                            "body": "Don't worry tails got her back until she wakes up and passing out again",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "stxrrynights240",
                                                    "body": "No stop why did this remind me I had a stupid crackfic idea of Aventurine trying to babysit Huohuo",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "RentLast",
                                                            "body": "He definitely will try to help Huo2 get some self-confidence and Auntie Jade gonna be the teacher",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "stxrrynights240",
                                                                    "body": "He tries cheering her up after accidentally making her cry and then Tail makes him cry with her",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Random_Dreams",
                                    "body": "Bro used his Lupitoxin & accidentally cc'd Huohuo & Fugue before they could ult 💀",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "NeosFlatReflection",
                                    "body": "Who is going to win\n\n5k attack hwe hwe\nor\n5 billion attack Hoolay",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Diotheungreat",
                    "body": "What are the best teams for E0S1 hoolay?",
                    "score": 56,
                    "replies": [
                        {
                            "author": "SecondAegis",
                            "body": "Wolftropper is BIS, which is pretty good since it's a 4*",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "AppropriateWar6902",
                            "body": "E6 jingliu with heal set",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "AffectionateCity4312",
                            "body": "the best team is Hoolay / Jiaoqiu / Huohuo / Tingyun.  Jiaoqiu is BiS for him",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "mephyerst",
                                    "body": "Was a bit of a slap in the face that they are shilling JQ for Hoolay so much. Yea I get Hoolay multiples vul debuffs but bolting the two together as best team mates, but like that is just unfair the Hoolay. They just wanted to kill his synergy with def down characters.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "yuhattan",
                            "body": "I recommend Kafka as his BiS premium option because of her FUA whenever allies attack to help build Irate stacks for Moonhowl Lupus, the Dominated status make enemies less likely to decrease Irate stacks, and her AA for Hoolay to attack more often than he already does.\n\nOther recommended premium units would be Aventurine and Scarabaz because of their CC abilities and good sub DPS damage.\n\nFor F2P options, Aurumaton Gatekeeper is a strong sub DPS and CC option, and Wolftroopers for Hoolay's Bloodlust passive. Bronya can be used as a Kafka alternative since she has a similar kit to her but can also but used together with her since their AA and FUA stacks well.\n\nEdit: grammar and added more ideas bc i keep taking this joke too seriously much longer than i should",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Ryookoo",
                            "body": "Yeah, I heard Jingliu is his dedicated support ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Attorney-6033",
                    "body": "I've been wondering why hasn't anyone posted V3 gameplay on the sub yet? Is this a negative response to the global passive, or am I just overthinking this?",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Nycro_",
                            "body": "Showcases are all moved into a megathread so the sub isn't spammed endlessly with them.",
                            "score": 84,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gentlekrit",
                            "body": "Showcases have been banished to a megathread (yes, this was a terrible decision)",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "ChiiAruell",
                                    "body": "Very bad i really need 500 the same battles month before banner",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "No-Environment-3997",
                                            "body": "I know. I was wondering in what world they thought that was a terrible decision.",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "No-Attorney-6033",
                                    "body": "Thanks, but why would they do that, and when did they decide on this anyway.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Info_Potato22",
                                            "body": "When people started spamming poorly optimized showcases Just because they have access to the beta",
                                            "score": 80,
                                            "replies": [
                                                {
                                                    "author": "Sogeki42",
                                                    "body": "I for one loved watching all the terribly built Luochas /s",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Rollingplasma4",
                                    "body": "A fate worse than death",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ArtemisTheHarbinger",
                    "body": "The true powercreep has begun.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ConstellationEva",
                    "body": "Haha",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Some-Landscape-9563",
            "body": "I guess break team is still going to thrive here? 70 toughness is quite big though.\n\n\nYunli and Clara keep thriving... until Hoolay is broken I guess? Clara using skill to deal 100k DMG to him is not gonna be fun\n\n\nAlso if you are not running break I guess you'd want high ATK teammates like Robin and Luocha? That ATK combination is quite juicy.",
            "score": 193,
            "replies": [
                {
                    "author": "WakuWakuWa",
                    "body": "Boothill has one of the highest ST toughness dmg if not the highest,he is gonna demolish Hoolay in the duel then demolish Hoolay when its broken.",
                    "score": 196,
                    "replies": [
                        {
                            "author": "alebarco",
                            "body": "Pretty fitting the Fudging Cowboy would win a duel no?\n\nNot a Boothill Haver but  I'm willing to bet he's still gonna Be the Real Monster against Hoolay",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Only-Stress-5648",
                            "body": "I'm pretty sure he's unusable here especially in 2nd phase, bro will die instantly since hoolay moves four times ",
                            "score": -53,
                            "replies": [
                                {
                                    "author": "WakuWakuWa",
                                    "body": "During the duel the character dueling has hp equivalent to all your teammates hp combined, and Boothill most possibly needs only two turns to break Hoolay because how big his toughness damage is. Boothill can also be built extremely tanky due to not needing any main stat on chest and orb. So pretty sure he is very usable here lol. If he is unusable then 95% of the dps are",
                                    "score": 155,
                                    "replies": []
                                },
                                {
                                    "author": "Me_to_Dazai",
                                    "body": "Boothill is one of the few DPS' where you can build him for tanking and not lose damage, you can kinda literally use a HP% body on him. Plus this mechanic adds up all the characters' HP so with Boothill's best team (Sunday/Fugue/RM) he'd get a lot of HP from supports being tanky",
                                    "score": 38,
                                    "replies": []
                                },
                                {
                                    "author": "Supermini555",
                                    "body": "Hoolay’s SPD becomes our SPD, so it doesn’t matter too much anyways, so you can bring the hurt without issues",
                                    "score": 45,
                                    "replies": []
                                },
                                {
                                    "author": "Cunnysseur_ToT",
                                    "body": "IF IT'S BREAK, IT'S DEAD!\n\nRAHHHHHH 🦅🦅🦅🦅🦅 WHAT THE FUDGE IS KILOMETRES?! 🔥🔥🔥🔥🔥",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "AnalWithAnaxaglea",
                                    "body": "i ran him with fu xuan last time when hoolay did crazy damage. its not like boothill is tied to gallagher or lingsha",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Only-Stress-5648",
                                            "body": "Only this time, your in a 1v1, your fu xuan will be useless here as well",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "AnalWithAnaxaglea",
                                                    "body": "yeah and back then i heard the same thing. -1spd sunday/bronya will probably eat hoolay up while fugue take care of the mobs. as always",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KaedeP_22",
                    "body": "tbh the core of AS' entire gameplay is to break the boss first, so... I doubt the break team will ever go out of style in this gamemode.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Sexultan",
                            "body": "Hoyo is bypassing that by making toughness breakable only by means other than simply toughness damage\n\nAventurine: destroy a lot of dice before breaking\n\nScarabaz - has a ton of roughness. Better to just kill small mobs as they deal more toughness than any single attack\n\nBananacademic - toughness decreases at first by attack count. Then by attacking those broken already \n\nHoolay - break toughness by clearing small mobs. Then one on one confrontation with Hoolay",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "KaedeP_22",
                                    "body": "Yeah, I feel like those are actually helping non-break focused teams more that it tries to circumvent break focused teams.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "NoRestaurant2093",
                                            "body": "I don’t think it’s about break vs. non-break. AS, like MOC, just designs mechanics to shill whatever meta Hoyo wants to. It just happens that break was a major part of the meta for a good while, until 3.0. \n\nPeople get confused because the goal of AS is to break the boss, but you do that mainly via mechanics. Sometimes being able to deal a lot of direct toughness damage like break teams can is favored, but it’s not as dominant as it’s made out to be, especially not recently as the meta shifts.",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "Some-Landscape-9563",
                                            "body": "Well at some point we will see Bosses that lock weakness bar and the bar can only be reduced by killing mobs which also lock weakness bar for the first X turns. Break can still clear but it's probably with <3000 points.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Chill_dat_Fox",
                                                    "body": "Isn't that already a thing tho?\n\nKafka and Phantylia want you to break their adds, before opening their weaknesses.  \nAventurine needs you to get enough points in his game before his weaknesses get unblocked.  \nKinda the same thing with Scarabaz where you're better off killing minions that the boss directly.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "SectorApprehensive58",
                                                            "body": "I actually nearly broke Kafka before killing her summons with silver wolf physical implant before. Her fuas kept yunli spinning",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Some-Landscape-9563",
                                                            "body": "These mobs don't have their weakness locked though, which is what I'm talking about",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Chill_dat_Fox",
                                                                    "body": "Oh yeah, I see what you mean now. That would be rotten.\n\nSorry for misunderstanding.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DragonPeakEmperor",
                                                    "body": "People have been talking about this concept for months now and I still haven't seen it actually happen nor have they given any indication it will because it's a stupid idea. You're basically crippling every single DPS's clear time just to put break on an even playing field, and Hoyo is still shilling the archetype. Fugue came out not even that long ago.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ConohaConcordia",
                    "body": "I think my E6FF with supports can break it with a single E (thanks to E1 fugue and RM)\n\nIt should be possible to do it with a single E without E6 if you have both E1 Fugue and RM.\n\nBoothill could do it with just RM — one EBA is enough.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "SectorApprehensive58",
                    "body": "Well hoolay recovers from physical break very quickly anyways, hardly an issue",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "New_Ad4631",
            "body": "Yunli is gonna flatten this dog. The solo mechanic is super cool",
            "score": 86,
            "replies": [
                {
                    "author": "maemoedhz",
                    "body": "Yunli in lore: manages to hold Hoolay off with Yanqing \n\nYunli in game: eats Hoolay pancakes for breakfast, lunch and dinner",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Ok_Pattern_7511",
                            "body": "It's a crime Hoolay isn't weak to Ice when he lost to it twice",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Guiorno",
                                    "body": "That just shows how much of a beast Jingliu and YanKING is",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Starguardian_Ahri234",
            "body": "honestly this is the first time they actually changed up something in the battle mechanic and I love it, I just hope it is balanced and not impossible, but I guess mydei will have an easy run if not then I go FF or Clara",
            "score": 58,
            "replies": [
                {
                    "author": "Commercial-Street124",
                    "body": "Anaxa has been shown to do it np, so others will too",
                    "score": 7,
                    "replies": [
                        {
                            "author": "BloodLustX_",
                            "body": "Isn't that because of his double single target bounce absolutely shredding hoolays weakness tho 💀",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Commercial-Street124",
                                    "body": "Pretty much.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gentlekrit",
            "body": "Am I understanding the healing mechanic right, and \"15% HP\" here means 15% max HP?  Cuz if so, that's 75% max HP healed after every attack at max stacks\n\nYunli and Clara out there being Abominations of Abundance for real for real",
            "score": 208,
            "replies": [
                {
                    "author": "bafabonmain",
                    "body": "most likely 15% of the damage dealt",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Some-Landscape-9563",
                            "body": "That's a lot though, a weak 20k attack gives 3k HP already and it can be stacked. Bet it's 15% Max HP",
                            "score": 45,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pleasant_Network_479",
            "body": "hell yeah, 20k HP Blade time go brrrrrrr\n\nedit: just realised ironically blade will be the only one to benefit from both the combined ATK + HP because he scales off both 😭",
            "score": 130,
            "replies": [
                {
                    "author": "friedfishkji",
                    "body": "Watch him do 20k dmg too (buff my boy for the love of god)",
                    "score": 66,
                    "replies": [
                        {
                            "author": "Pleasant_Network_479",
                            "body": "stop the slander. this is the only chance for my boy to do 200 bladillion damage 😡",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "AdeptBuy9727",
                            "body": "I live for that hypothetical future Blade buff. :D",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Cheesenium",
                            "body": "Yea, I miss using my blade. He was voiced by the same actor who voiced Roy Mustang in Full Metal Alchemist so I love his lines.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Jazzprova",
                            "body": "\"Get fucked, pull Mydei\"\n\n-Da Wei",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tintinmdm",
                    "body": "Yasss",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Remarkable-Painter70",
                    "body": "300k might be reachable for him",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Msaleg",
            "body": "Robin in concerto + Huo Huo ult active + Sunday atk orb = 13k atk for Anaxa to shred the toughness bar of Hoolay lol.",
            "score": 127,
            "replies": [
                {
                    "author": "Sure-Instance640",
                    "body": "Thats gonna be my team but Yunli instead of Anaxa. The duel is gonna be legendary.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "Liaoju-0",
                    "body": "Yeah a lot of people are praising carry Anaxa for beating this boss fast without realizing he's essentially designed to clear this specific AS super fast",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "OzTheOtaku",
                    "body": "Reading your comment gives me the idea of using Firefly in the same slot. Normally Robin's atk buffs are useless for her but depending on how the atk merger is done, the break effect conversion may take place.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Winston7776",
                            "body": "The boost only takes place during the Going Solo Duel state anyway, and Firefly’s not really doing much damage there anyway. Unless you’re planning on building Crit Firefly?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Vermliilonfox",
                                    "body": "Toughness can be depleated in the duel. If buffs carry over, efficiency+atk% conversion from the others should escalate her break by quite the margin",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "FDP_Boota",
                                            "body": "Isn't Robin's Atk buff non-convertable?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Vermliilonfox",
                                                    "body": "No idea, but there are some",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "FDP_Boota",
                                                            "body": "Pretty sure all buffs that are directly converted from a characters stats (Robin & TY Atk buff, most Cdmg buffs) don't count for other conversions. Otherwise Bronya, Sparkle, Sunday and/or RMC would be able to infinitely loop their crit buffs.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OzTheOtaku",
                                    "body": "That's a good counterargument. Nah, I won't bother with Critfly since her multipliers were gutted in beta... A normal break teak with Lingsha should have enough atk pool to make a significant difference, there's the option of having Ruan Mei on Atk orb too... Else I'd just clear with a normal atk scaling crit hypercarry with decent multipliers and from the looks of it, memosprites should also contribute to the conversion making RMC a great option. Pretty hyped for this to come out!",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Nunu5617",
                            "body": "Just add Bronya in that case which will be much better",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fit-Application-1",
            "body": "Hoolay truly is the JY of enemies, he just keeps getting buffed every patch",
            "score": 17,
            "replies": []
        },
        {
            "author": "RamenPack1",
            "body": "“I venture forth to hunt”",
            "score": 69,
            "replies": [
                {
                    "author": "Commercial-Street124",
                    "body": "chills",
                    "score": 5,
                    "replies": [
                        {
                            "author": "RamenPack1",
                            "body": "She has that effect on people",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "That_Wallachia",
            "body": "I can see break characters feasting on this.",
            "score": 14,
            "replies": []
        },
        {
            "author": "PCBS01",
            "body": "Me and Anaxa with his glock: not my problem",
            "score": 52,
            "replies": []
        },
        {
            "author": "Adventurous_Cold4663",
            "body": "Glorious melee combat",
            "score": 11,
            "replies": []
        },
        {
            "author": "justK1n",
            "body": "Aight, time to build my E3 Clara",
            "score": 10,
            "replies": []
        },
        {
            "author": "Nacho_Hangover",
            "body": "Every day I feel more relieved that I used both my selectors for E1 Clara.",
            "score": 36,
            "replies": [
                {
                    "author": "FennlyXerxich",
                    "body": "Does Clara work in AS? What are you gonna do when you break the boss and it doesn't attack you anymore?",
                    "score": 24,
                    "replies": [
                        {
                            "author": "LordBottomTickler",
                            "body": "mark of savrog does decent damage for your skill.   but just like yunli, the majority of their power is their counter.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "casteddie",
                            "body": "Nothing, my E2 Clara is ass",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Nunu5617",
                                    "body": "😂",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WakuWakuWa",
                            "body": "Ngl i tried using Clara against AoE AS and it was okaaay, because of her AoE skill. But against ST like Hoolay...yeah Idk, she doesnt really do much dmg when enemies are weakness broken lol",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "th5virtuos0",
                            "body": "Her E1 makes her skill 200%. Not great but better than 100%",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Akyluz",
                    "body": "E1 Clara changes nothing in this scenario tho. Hoolay will always move after clara turn. so he will always attack and be marked with clara counter mark",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Winston7776",
                            "body": "Without the E1, Clara does like 0 damage after the enemy is broken. Not that her damage will be high without her counter (when the enemy is broken) anyway",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smol_Cheesecake",
            "body": "If only they buff their male characters the way they buff their genocidal furry fuck.",
            "score": 78,
            "replies": []
        },
        {
            "author": "Esdeath-0",
            "body": "bro Jingliu should get special buff against him or something cause lore accurate 😭😭",
            "score": 15,
            "replies": []
        },
        {
            "author": "BankingPotato",
            "body": "My plan is to just select Gallagher for the duel and break him as fast as possible. \n\n-- a person with no break dps and no other fire/wind/phys character",
            "score": 16,
            "replies": [
                {
                    "author": "mamania656",
                    "body": "no clara or yunli? I will try break Luka too",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BankingPotato",
                            "body": "Luka sounds hilarious with how fast Hoolay is.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ArtemisTheHarbinger",
                    "body": "Me hoping that getting everyone's HP and atk will actually make Blade usuable, because I have no fire, no phys (other than Clara) and no other wind dps.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ok-Bike-7327",
                    "body": "I don't have any break dps either and only a couple+ dps. That's why I got Feixiao for her rainbow break and aiming for Anaxa next. Been using 4 stars to break too",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BankingPotato",
                            "body": "I only have JY and DHIL haha. But that's not an issue, I can mow down the wolves with JY/Sunday/Tribbie or Robin/Gallagher and just slam Hoolay once broken.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "uwu-tao",
            "body": "Can’t wait to use my 𝓨𝓾𝓷𝓵𝓲",
            "score": 7,
            "replies": []
        },
        {
            "author": "jijiji07",
            "body": "Boothill, clara, Mydei, and specially Yunli will have a smooth ride with this one.",
            "score": 7,
            "replies": [
                {
                    "author": "Pusparaj_Mishra",
                    "body": "How about JL XD\n\nI mean I personally will definitely try as a main of her and see how it goes lol",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Late-Veterinarian544",
            "body": "I can take him",
            "score": 28,
            "replies": [
                {
                    "author": "EarlGreyPudding",
                    "body": "In a fight right? 😁",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Late-Veterinarian544",
                            "body": "( ͡° ͜ʖ ͡°)",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "EarlGreyPudding",
                                    "body": "Right? 🥵",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RevolutionaryMall428",
            "body": "Yunli",
            "score": 11,
            "replies": []
        },
        {
            "author": "SacarineSack",
            "body": "good thing fugue reruns next patch bh eating good",
            "score": 8,
            "replies": []
        },
        {
            "author": "OzTheOtaku",
            "body": "\"It's you and me\" ah buff",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fine_Run_5326",
            "body": "Hoolay is the real anniversary Char IMDEAD",
            "score": 3,
            "replies": []
        },
        {
            "author": "Stunning_Dealer_9211",
            "body": "they need to let hoolay go, its been awhile since his time in  Xianzhou bruh 💀",
            "score": 15,
            "replies": [
                {
                    "author": "Soggy-Dig-8446",
                    "body": "Hoolay feels much less spammed than bugs or trio of Order.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "NLAD02",
                    "body": "Both Hoolay and the Bananacademic boss need to quit being spammed. I swear Banana boss is just the new Past Present Eternal Show with how often it shows up.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "ichikafierrochase",
                            "body": "are yall forgetting about the the fukcing true sting its in every as and moc",
                            "score": 62,
                            "replies": [
                                {
                                    "author": "NLAD02",
                                    "body": "That's actually so true as well.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MissionSecurity5895",
                            "body": "Has Hoolay really been spammed that much? I feel like he has been on Like 3 or 4 MoCs. And this would be his first time in AS.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Hudson_Legend",
                                    "body": "He's only been in Moc 12 once and moc 10 for the current 3.0 rotation, I really don't know what people mean by he's getting spammed",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "AmberGaleroar",
                                    "body": "Ptsd does shit to people",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "NLAD02",
                                    "body": "Pretty sure he's only been in MoC twice?\nBut each time he's been an absolute drag to fight since they keep making him have more health.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "WakuWakuWa",
                                            "body": "Yeah and in MoC 12 only once. Never in AS",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skug4569",
            "body": "wolves have 70 toughness? sheesh they really wanna run firefly out of meta",
            "score": 15,
            "replies": [
                {
                    "author": "WakuWakuWa",
                    "body": "Boothill has 75 toughness damage on his EBA with RM, thankfully. Just enough 💀\n\nThe mobs having 70 toughness is crazy though",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Red_Trickster",
                            "body": "Boothill has +150 toughness reduction with three Pocket trickshots",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ALostIguana",
                    "body": "Hoyo gesturing at E1 Fugue.\n\nThat's the price to keep using Firefly it seems.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "IgnisXIII",
                            "body": "Then again... Anaxa + E1 Fugue + Ruan Mei is gonna be fun!",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mae_str",
                    "body": "I don’t think you understand how this boss work.Once you deal with a couple small wolfs which is going to be a breeze for full break team, bro is gonna get obliterated in a duel with Firefly who scales with the sum of all characters atk and consistent healing on enhanced e.Not to mention that Firefly’s speed in its enchanted state is one of the few that can match Hooley’s speed.If they wanted her out of the meta, they would remove fire weak from this guy and wolfs which would make it a bit problematic.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Skug4569",
                            "body": "I have E1 Fugue and RM, so I think I'm kinda ok, but everyone that needs  2 FF skills to break a normal enemy to eventually duel hoolay, to then break him will have a hard time. When the duel starts firefly is going to destroy him, but... almost every dps is the same, the key is: how fast can you get to duel him.  \nFugue/Lingsha/Gallangher can only help killing, the final blow will always be FF cause 70 toughness is a lot for them, and firefly has only  4 attacks per ult cycle, and she needs to kill 5 so the math isn't mathing\n\nMaybe there is a way of optmizing this, Lingsha skill/extra attack -> Lingsha ult -> Extra Attack -> Fugue Ult - FIrefly attacking middle. So she can kill two in one go, but it's hard to know without testing\n\nNo Fire weakness wouldn't be that much of a hassle, since for FF teams outside of pure fiction that only impacts dmg reduction (most of the times), and once the duel starts hoolay is doomed anyway.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Estelie",
                                    "body": "Where did you get that 5 wolves requirement from? It's a sum of his turns *plus* wolves killed that has to be 5. With his speed, you're looking at 2-3 wolves max, imo.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Skug4569",
                                            "body": "Oh, then firefly is going to steamroll him no problemo",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mae_str",
                                    "body": "You don’t need to kill 5 wolves to start the duel tho.Every time Hooley moves, the stack counts towards the duel count, so you only need to kill like 2 wolves to open his weakness.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "No_Pen_4661",
                                    "body": "F2p Firefly comp is gonna have a hard time with this",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KazuSatou",
                    "body": "eskill adjacent is 15 toughness. with buffs it becomes 30. fugue has 10 adjacent. You are killing two wolves in 2 turn most likely. killing 5 would take around 150 ish av or less (depends on how you use DDD/healers). Its not that bad.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Tyberius115",
                    "body": "More like they wanna run the non premium FF team out of meta\n\nFF/RM/Fugue/Lingsha is going to have cooked wolf for dinner",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok-Salamander-1980",
                    "body": "shh the fans will get you",
                    "score": -21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hotaru32",
            "body": "So basically in deul he gonna have hp equivalent to all character hp which mean all hp character are required to tank like it's perfect for castorice mydei tribbe and might be new healer , this team already surpasses 25k threshold easily ",
            "score": 5,
            "replies": []
        },
        {
            "author": "AliRixvi",
            "body": "Yunli's game mode",
            "score": 5,
            "replies": [
                {
                    "author": "Pusparaj_Mishra",
                    "body": "Me dueling him with Jingliu be like",
                    "score": -1,
                    "replies": [
                        {
                            "author": "WakuWakuWa",
                            "body": "Hoolay does not have ice weakness",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Crimdarath",
                                    "body": "And yet Jingliu was the one who defeated and captured him 700 years ago at his peak.\n\nHow very curious indeed.  \n( ⚆ \\_ ⚆ )",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Pusparaj_Mishra",
                                    "body": "Man.... that's such a missed opportunity",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Raj_kurosaki",
            "body": "Time for super break march 7th ig........",
            "score": 2,
            "replies": []
        },
        {
            "author": "Draconic_Legends",
            "body": "My E6 Clara pays for herself, especially after all those losses",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cold_Progress1323",
            "body": "It's kinda ironic how the enemy of the space China is the devs' favourite boss.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Blight__89",
            "body": "Holy Forkeroni, it's time to duel 😆",
            "score": 2,
            "replies": []
        },
        {
            "author": "PutCertain4597",
            "body": "Robin is salivating at the atk sum buff",
            "score": 2,
            "replies": [
                {
                    "author": "kolebro93",
                    "body": "I dare you to Duel Hoolay with Robin...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PutCertain4597",
                            "body": "I meant the atk buff from concerto would count into the sum for the character chosen to duel, though i have no doubt that our famous singing queen could leash that mutt",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lionnnheart",
            "body": "Oh well, it seems I didn’t need to pull yunli’s cone, by my girl is ready to destroy him 💪",
            "score": 2,
            "replies": []
        },
        {
            "author": "Final-Ad9938",
            "body": "Feixiao after getting buffed by robin now getting both robin and moze's ATK combined easily 15k   \nHoolay is getting a traumatic beatdown",
            "score": 2,
            "replies": []
        },
        {
            "author": "SectorApprehensive58",
            "body": "Time to switch my luocha back to full attack. Now I wonder how much atk my yunli would have with luocha/robin e6/moze",
            "score": 2,
            "replies": []
        },
        {
            "author": "PotatoBig3557",
            "body": "Just letting you all know one of the best teams for this is feixiao, robin, aventurine, and topaz bc if you activate robin ultimate before the standoff then your feixiao will easily beat him. I was able to 1 cycle the boss in beta thanks to her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "photaiplz",
            "body": "Finally blade can have some fun",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fubuky10",
            "body": "Finally we found the infamous 25K HP Mydei, it’s during this duel mechanic",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tintinmdm",
            "body": "My Blade is gonna do ok",
            "score": 2,
            "replies": []
        },
        {
            "author": "CourierIII",
            "body": "This feels like FGO Achilles Challenge quest and I'm all for it\n\nI just hope they don't pump up the numbers for the boss too much where only meta will pass the bare minimum",
            "score": 1,
            "replies": []
        },
        {
            "author": "ladyjinxy",
            "body": "We have Hoolay the Legion Commander before GTA6",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electronic_Concept63",
            "body": "Feixiao it is",
            "score": 1,
            "replies": [
                {
                    "author": "Pusparaj_Mishra",
                    "body": "I'm definitely gonna duel him with JL ngl",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Red_thepen",
            "body": "Ok that's kinda interesting tbh. Unless they crank the numbers to the point that only Mydei can compete(I can't tell without trying in game personally) , there's lots of options to try.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Pen_4661",
            "body": "Oh man we got powercreeped by counter mechanics",
            "score": 1,
            "replies": []
        },
        {
            "author": "jacobs0n",
            "body": "what happens if you use tribbie to duel with her giga hp",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hudson_Legend",
            "body": "We actually boutta be playing elden ring in hsr, might be the coolest apoc yet.",
            "score": 1,
            "replies": [
                {
                    "author": "Pusparaj_Mishra",
                    "body": "We r haven't had Hoolay in Apoc before?\n\nAnd was the Hoolay in MOC different? I kinda forgot",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ars_2000",
            "body": "Wait for it the return of Asta the goat. \nFinally someone in her family bribed Hoyoverse for a comeback.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Swordfish6703",
            "body": "Paradise is finally reachable for blade",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProjectRaehl",
            "body": "shoeless child victim",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneWater7191",
            "body": "I wonder if my e4s1 Clara can manage it... She's not exactly the best option for AS since she's pretty much useless during break times, but I don't really have any other option for Hoolay. No wind dps and no fire dps in my account ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯\nAnd unfortunately my e0s0 Blade can't do much. He's well built but unless you have eidolons and his lc it's hard to make him work these days...",
            "score": 1,
            "replies": [
                {
                    "author": "Pyros",
                    "body": "Clara should have no issue. Blade might also work even without fancy stuff.\n\nThe fight doesn't look bad at all, have to remember that speed won't matter during the duel(Hoolay has stupid high speed but you take a turn after every turn he does), survivability is only mildly concerning as long as you can kill adds before the duel(they give you a buff that will heal on hit) and so mostly what matters is toughness damage and having enough skill points before starting the duel(unless obviously you don't use skill points on that char like E1 firefly or blade with EBA).\n\nI think Hunt March might also demolish him, shifu someone of the right element(preferably the break shifu, like say Bronya, Tribbie, Robin, Gallagher, Lingsha and so on) and she'll probably melt Hoolay in the duel if you can start it with her EBA almost built. Hell Gallagher might also work him if you keep an ult charge before the duel so you can do a big punch > ult > big punch again. Lingsha might also be good cause he advances her pet every hit too so might add up decent toughness and no risk of dying.\n\nAS damage requirements tend to be pretty low once you can get into the break phase, so having \"deadweight\" chars wouldn't be an issue if you can still fit your core chars in.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "OneWater7191",
                            "body": "Ohhh I didn't think about using Hunt March! That's a great suggestion. I have her built but I never used her that much. Hower I was considering building Ratio for 3.2 moc (as both sides have Imaginary weakness and my DHIL will be busy against Castorice's pet, most likely) and she's almost a must for his team. I have plenty of time before the patch drop, so I'll fix a bit her build (as well as Clara's). \nHoolay somehow always terrifies me, I think I have too much PTSD from the first moc he was in (my Clara wasn't built and I rushed her SPECIFICALLY for him, but of course due to not making her a too good build I struggled a lot.) I'll get my revenge!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Saiyan_Z",
            "body": "Hoolay going to zero cycle us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whxskers",
            "body": "Hoping I can squeak by with Feixiao cuz my Clara is the opposite of built 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "HozukiMari",
            "body": "Huh. Blade stonks?",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeOlChum",
            "body": "Soooooooooooo.....the heavily doomposted anti break AS is actually super good for break?",
            "score": 1,
            "replies": [
                {
                    "author": "Shinkowantssalt",
                    "body": "Hoolay himself is partly a Break-team advocate. Because you want to break him before he do his combo. Besides FuA spam to beat his counter multiple times, Break teams can bruteforce the breaking yourself with Break teams.\n\nAnd as duel mode seems to disrupt FuA chains that FuA teams usually have, unless he locks his weakness, Break teams will work very well.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spffox",
            "body": "I'm not skipping his banner, that's for sure.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ligeia_E",
            "body": "Is it availability bias but this dude has had the most changes/additions to his kits across modes and most stat changes in beta than any other bosses by far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yggdrasil89",
            "body": "Oh great, reading the comments here seems like I don't have any recommended DPS to fight this piece of crap 💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kronman590",
            "body": "Hoolay 1v1 💀 thank god for hp scaling meta",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jallalo23",
            "body": "How do they keep finding ways to buff this one boss😂😂. Like bro",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rein_1708",
            "body": "That's it I'm building Robodad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seraf-Wang",
            "body": "Wait, is Moze effected by this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrShabazz",
            "body": "Blade: ...fukkit we ball.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zogo12",
            "body": "I'm cooked 😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "rikkikikki",
            "body": "what the fuck \nhoolay michelin chef to cook us all",
            "score": 1,
            "replies": []
        },
        {
            "author": "InfiniteAverage8943",
            "body": "70 toughness is just enough for boothill at 3 stacks with either rm or e1 fugue to 1 shot a wolf mob (and I have neither of these so need 2 shots with boothill 😢)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImUnderYourBeed",
            "body": "This mean it doesn't matter who's getting dueled",
            "score": 1,
            "replies": []
        },
        {
            "author": "KMW_KMW",
            "body": "We love em Hoolay buffs",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bulky_Baseball_2881",
            "body": "Noooo, Not Enough More ,I want moreeeee",
            "score": 1,
            "replies": []
        },
        {
            "author": "Percent234",
            "body": "boxx literlly for anaxa lol what a shill",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former_Pick4120",
            "body": "Boothill vs Hoolay?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imaginary-Tax-8437",
            "body": "Ngl its an interesting mechanic, tho idk if it can work fr",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnotherMikmik",
            "body": "Aight. Clara! I choose you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hhhhhBan",
            "body": "First it was 400% speed, now 400% atk on top of that? Game is ass smh",
            "score": -1,
            "replies": []
        },
        {
            "author": "Huffaloaf",
            "body": "I'm ready. \n\n[I've practiced my Hoolay 1v1s.](https://www.youtube.com/watch?v=QDL7xj9ctE0)",
            "score": 0,
            "replies": []
        },
        {
            "author": "lady_dmc",
            "body": "Hoolay is their favorite character xD",
            "score": 0,
            "replies": []
        },
        {
            "author": "acc_217",
            "body": "What the hell is this dogshit mechanic",
            "score": -3,
            "replies": []
        },
        {
            "author": "burningparadiseduck",
            "body": "They need to STOP buffing the enemies.",
            "score": -30,
            "replies": [
                {
                    "author": "Proper_Razzmatazz_36",
                    "body": "This doesn't look like buffing, more a changed fight....just like all the other as bosses",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "mamania656",
                    "body": "I don't know man, this seems like a interesting mechanic that actually favours the player, you like break? choose BH or FF and watch them shred him, you like counter, Yunli and Clara will carry, you like Feixiao? you're in luck because she will break him in no time",
                    "score": 12,
                    "replies": [
                        {
                            "author": "starswtt",
                            "body": "Idk if this fight is that good for a low cost firefly team, especially for the fugueless. The toughness looks like it'll be pretty tough to get through without eidolons (though shouldn't be too terrible with fugue + lingsha.) I wouldn't say it looks particularly difficult either though, if you're fine with your firefly without break blessings, this won't be any more difficult, but idt anyone already struggling with post break FF will find this fight easy\n\nAgree on the rest. Being single target with good element matchup (and triggering aventurine's fua) means feixiao and Bolthill are eating good (and toughness is *just* right for boothill), and the counter girls are ready to play wack a mole",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Relief1564",
                    "body": "Idk if you've actually seen the duel but it seems pretty player favoured",
                    "score": 30,
                    "replies": [
                        {
                            "author": "burningparadiseduck",
                            "body": "No I haven't seen the showcase yet.",
                            "score": -31,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Feeed3",
                    "body": "me when i dont understand the mechanics:",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Rollingplasma4",
                    "body": "Hoolay will not be denied his regularly scheduled buffs.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "AVENTURlNE",
            "body": "Do they play test the game they develop for?",
            "score": -1,
            "replies": []
        },
        {
            "author": "NonnoGino69",
            "body": "What if instead of global passives they add Majima everywhere but with Hoolay 🤯🤯🤯🤯",
            "score": 0,
            "replies": []
        },
        {
            "author": "fuyukkun_",
            "body": "It's all fine and dandy until he chooses the wrong character to Duel with and you're forced to reset",
            "score": -2,
            "replies": [
                {
                    "author": "WakuWakuWa",
                    "body": "You can choose the character to duel",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}