{
    "title": "Mydei Trailer — “Wrath of Man”",
    "author": "ImNotNex",
    "subreddit": "HonkaiStarRail_leaks",
    "rank": 9,
    "score": 1603,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 228,
    "url": "https://youtu.be/dywDrslYCJg",
    "id": "1javbje",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strong_thick_meme",
            "body": "His trailer being his trial for Nikador’s coreflame is pretty cool",
            "score": 522,
            "replies": [
                {
                    "author": "FrostyBoom",
                    "body": "It's like a mix between a Character Trailer and a Myriad Celestia.",
                    "score": 164,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 74,
                            "replies": [
                                {
                                    "author": "FrostyBoom",
                                    "body": ">FOR MEN\n\n\nIdk about that part, considering how many females and nonbinaries I've seen losing their shit for this on my feeds 😂 Peak like this trascends genders, I guess.\n\n\nBut I do agree Mydei is possibly the manliest character in HSR.",
                                    "score": 114,
                                    "replies": []
                                },
                                {
                                    "author": "Alex_The_Hamster15",
                                    "body": "SPARTANS WHAT IS YOUR PROFESSION ahh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ArtemisTheHarbinger",
                    "body": "I would have rather seen his trial in the game, rather than in his trailer, tbh.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Dankoregio",
                    "body": "Is it? It was a major plot point for two different patches that just got thoroughly offscreened for the sake of being included in a trailer.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Jennymystique",
                            "body": "Personally I was so relieved to not have to play it only because the quest was so long already",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Dankoregio",
                                    "body": "Fair enough in this instance, but looking at a certain other hoyo game (ZZZ) in which they literally just don't put lore and backstories in the game and expect you to watch trailers if you want the story, it's a bit of a yellow flag for me.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "-TSF-",
                                            "body": ">  in which they literally just don't put lore and backstories in the game\n\nThey do. Lots of it. They just expect you to *also* watch trailers for more of it, particularly major backstory details as the game mostly focused on information obtained from Phaethon's point of view.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Dankoregio",
                                                    "body": "> particularly major backstory details\n\nSo what you're saying is I'm right. Sure they put some backstory things, but some of the greatest driving forces behind the characters are locked behind the trailers. Miyabi's biggest story moment in the game so far literally has a brief flashback to a cutscene that's *not even in the game*. Expecting me to also watch trailers when I'm playing a game isn't good storytelling. If I'm playing a game I expect to have all of its story content within the game, not have to engage with whatever other media channels to get the full experience.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Thatoneminer",
                                                            "body": "this is in hsr and genshin aswell, always has been. Its simply cuz for MOST people we wont actually care about to complete in depth story of them. mydei already got lots of love. They give the option for you to learn more but if they force say every single chars story in the sotry completely alot wouldnt like it if they arent that interested in them.\n\n  \nimagine if every single character needed an aventurine / mydei amount of story telling, it would start getting stale",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Puzzleheaded-Loan-60",
                                                                    "body": "They had a good solution called companions’ quests which they butchered by adding PoV which are hit or miss but hey, saves Hoyo resources.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Thatoneminer",
                                            "body": "this isnt really new though, myriad celestias always added ALOT",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Thatoneminer",
                                    "body": "tbf you dont need to do the quest in one sitting, its designed to be done across multiple days cuz of chinese regulations",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ArchangelGoetia",
                            "body": "Being fair, we already knew how they trial was supposed to go, there's nothing new here that is being lost.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Desperate_Case4647",
            "body": "Holy damn visuals, oh my god.",
            "score": 184,
            "replies": [
                {
                    "author": "Novel-Editor4017",
                    "body": "He's probably the most badass male character in the game. I'm not sure how they'll top him and Phainon in the future.",
                    "score": 134,
                    "replies": [
                        {
                            "author": "etssuckshard",
                            "body": "Phainon will top him",
                            "score": 280,
                            "replies": [
                                {
                                    "author": "Petter1789",
                                    "body": "There is no word for bottom in the kremnoan language",
                                    "score": 164,
                                    "replies": [
                                        {
                                            "author": "etssuckshard",
                                            "body": "Hahahahahaha",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Otoriorae",
                                    "body": "In a fight, right?",
                                    "score": 118,
                                    "replies": [
                                        {
                                            "author": "etssuckshard",
                                            "body": ":)",
                                            "score": 112,
                                            "replies": []
                                        },
                                        {
                                            "author": "ThamRew",
                                            "body": "I guess...?",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Aeso3",
                            "body": "The only male character who could potentially top Phainon, THE expy of Kevin Kaslana, would be Diamond.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "magicarnival",
                                    "body": "What if Diamond is just another Kevin expy 🤯",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Aeso3",
                                            "body": "Even better.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FurinasTophat",
                    "body": "It's hilarious to me that they get (rightly) accused of half-assing the visuals in the actual game and then make trailers like this.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "zani1903",
                            "body": "Mydei is genuinely the biggest gap between story/aesthetic/promotion/acting and his actual gameplay in the entire game so far, and it isn't even close.\n\nHis character writing is RIDICULOUSLY strong. His arc is engaging, his interactions with other characters is believable and enjoyable, his trailer and presence in cutscenes is insanely dominant...\n\n...and then you get him in battle, and he just spends the entire battle punching the floor with some magical astrology crystals and you don't even get to control him. \n\nHe doesn't even look like he's the Demigod of Strife. You don't see the Lance of Fury. You don't see him summoning spears and weapons and shit. You don't hear that \"bloodlust\" sound that Nikador made us hear when we approached him in the story.\n\nI am so fucking pissed they put so little effort into making the actual game part of Mydei even half as much a success as his character. He's by far my favourite character in the entire game by a wide margin and I won't even be pulling for him I'm that disappointed.",
                            "score": 89,
                            "replies": [
                                {
                                    "author": "FrostyBoom",
                                    "body": "I found it lowkey amusing that they barely use any of kit's animations in the trailer. It's like they know they're not brutal enough for the theme he has.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "zani1903",
                                            "body": "Literally, all you see are his \"Vendetta entry\" animation and his Ultimate's first half. Not Kingslayer be King, not Godslayer be God, neither his Basic ATK nor his Skill, and not even his Ultimate's finishing animation—they cut to a custom trailer animation for it.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Desperate_Case4647",
                                                    "body": "Well, I mean, to be fair, they’ve kinda always done that. Boothill isn’t high-kicking anyone in his trailer and Feixiao technically only references her Ultimate, for example. \n\nThey’ve always really only consistently shown the Ultimate.\n\nAnd personally, imo, I like it better that way. More dynamic animations since they’re moving around more, since the Basic/Skills are more simple, when they could make it up with more unlimited and animated movement. Flows better.",
                                                    "score": 14,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "FrostyBoom",
                                                    "body": "They at least used the Fisticuffs move he used against Flame Reave in the story, which looked quite nice. ",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ArchangelGoetia",
                                            "body": "Funfact, this mostly stated happening after 1.7/8 when Ruan Mei had a kit that has 0 relevance to anything related to her in lore skillset. (There is an argument to say HuoHuo started, but misdirecting what she does is nowhere near not showing anything)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MeniteTom",
                                    "body": "Deyha lovers: First time?",
                                    "score": 18,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Radinax",
                    "body": "Trailer powercreep",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "EducationalCar2034",
            "body": "You can legit interpret this trailer as his Coreflame Trial in the MSQ. Pretty cool",
            "score": 272,
            "replies": [
                {
                    "author": "ResponsibleCoffee747",
                    "body": "Fr I'm pretty sure it might be cause that's the vibe I got from and I like the idea.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "yumzpasta",
                    "body": "That’s what I was thinking, too!",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "GothicOwl13",
            "body": "No Myriad. Expected but hurts regardless 😔",
            "score": 223,
            "replies": [
                {
                    "author": "KirbosWrath",
                    "body": "On the bright side, like Aventurine, most of his story was told in 3.1’s main plot, so there’s not much for a Myriad to cover, which I think is fair.\n\n…Then I remembered Huohuo got a Myriad Celestia that told us nothing. It is not fair I take back everything.",
                    "score": 343,
                    "replies": [
                        {
                            "author": "GothicOwl13",
                            "body": "yeah at least story did him justice",
                            "score": 91,
                            "replies": []
                        },
                        {
                            "author": "PCBS01",
                            "body": "yunli's told us nothing too",
                            "score": 80,
                            "replies": [
                                {
                                    "author": "jonathaxdx",
                                    "body": "Jingliu too iirc",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "airfry_nugget",
                            "body": "fr they did my king mydei dirty",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Rude-Designer7063",
                            "body": "Nothing's really fair, there's no rules for Myriad trailers",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "KirbosWrath",
                                    "body": "Actually there are. The rule is “first half absolutely gets one, second half gets one if Hoyo feels like you’re special enough”.",
                                    "score": 110,
                                    "replies": [
                                        {
                                            "author": "ImperialSun-Real",
                                            "body": "Funny thing is that some of the earliest Myriad Celestia feature 2nd banner characters like Jing Yuan and Kafka",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "AshesandCinder",
                                            "body": "I don't think Seele, SW, or Blade got one despite being first banner.",
                                            "score": 37,
                                            "replies": []
                                        },
                                        {
                                            "author": "Rude-Designer7063",
                                            "body": "So then there are no rules",
                                            "score": 27,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "luiszayel",
                    "body": "second phase characters usually dont get myriad, specially if its a male character",
                    "score": 58,
                    "replies": [
                        {
                            "author": "AshesandCinder",
                            "body": "Considering most of the male characters are also second half...\n\nOnly Blade, DHIL, and Sunday have been first half.",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "ArtemisTheHarbinger",
                                    "body": "And Blade didn't get a Myriad despite this.",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "SnarkyDucky",
                                            "body": "It's weird that Blade was ran first and then Kafka, not the other way around xd considering how they put the more important character first (could have been because of the story, but I dont remember how it played out exactly)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ArtemisTheHarbinger",
                                                    "body": "Probably they didn't have a \"most important character = first banner\" policy yet. There is also the fact that Blade was a popular character in his own right, and many people wanted to collect the whole Stellaron Hunters gang. And DHIL, another really anticipated character, was right after. My guess is that they were hoping people would start draining their free jades on Blade's banner, then drain all that was left + start spending on Kafka, and have absolutely nothing left for DHIL, who also conveniently happened to have the first real \"E2 bait\" of the game.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Cleigne143",
                            "body": "That \\*especially\\* hurts :(",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "G0ldsh0t",
                            "body": "We could get one after his banner starts like Jade did.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "miracle---3",
                    "body": "rn, aglaea has been treated the worst, 2 trailers and didnt get as much focus as tribbie and mydei in the quests. doesnt change the fact that males are lesser favored, not by the writers but everything else.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "FrostyBoom",
                            "body": "Aglaea still has quite a bit of a role to cover, unlike Mydei who will leave for some patches.",
                            "score": 103,
                            "replies": [
                                {
                                    "author": "ColdForce4303",
                                    "body": "It's going to be like Aventurine's isn't it? He got sole focus for awhile and then *poof*\n\nHoyo does this every time with their yaoi ship baiting ISTG",
                                    "score": 78,
                                    "replies": [
                                        {
                                            "author": "magicarnival",
                                            "body": "Mydei turns up 3 patches later hanging out with Argenti who taught him the beauty of strife off screen 🌹✨",
                                            "score": 118,
                                            "replies": [
                                                {
                                                    "author": "FrostyBoom",
                                                    "body": "Warburton-Off? Sign me up.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FrostyBoom",
                                            "body": "To be fair, in Mydei's case it's a bit more justified by story constraints,  since having a character that powerful available on our side either makes stuff easier or requires even crazier enemies. ",
                                            "score": 59,
                                            "replies": [
                                                {
                                                    "author": "LiliGlez14",
                                                    "body": "Yeah, writers definitely knew that they couldn't have him stay because every new conflict would be solved with his fists lol (or he would do nothing and people would be like \"if he's so strong why didn't he do x?\"). I'll miss him tho 😞",
                                                    "score": 45,
                                                    "replies": [
                                                        {
                                                            "author": "Substantial-Stardust",
                                                            "body": ">or he would do nothing and people would be like \"if he's so strong why didn't he do x?\"\n\nLiterally the most repeated complaint about DHIL in story (and Welt during Penacony)",
                                                            "score": 48,
                                                            "replies": [
                                                                {
                                                                    "author": "Me_to_Dazai",
                                                                    "body": "I kinda agree with the Dan Heng bit though. I don’t think he should be pulling out the dragon for EVERYTHING but it does seem a bit weird that even when his friends are in danger he resorts to the godamn spear instead of Imbibitor Lunae form",
                                                                    "score": 30,
                                                                    "replies": [
                                                                        {
                                                                            "author": "G0ldsh0t",
                                                                            "body": "The only argument I can see is that he is extremely traumatized by that from and literally can’t go into it unless forced to, basically nearly killing him.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Me_to_Dazai",
                                                                                    "body": "the problem with that theory is we literally see him using the dragon to clean the express in the room customisation event",
                                                                                    "score": 20,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "starswtt",
                                                                                            "body": "As they said, only if forced to. Cleaning is worse than death, so it makes sense to use the dhil form for it",
                                                                                            "score": 6,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "CEHOPTX",
                                                                                            "body": "I think there's maybe a difference for him between using it casually for small and harmless tasks and using it for fighting. Like I do agree with you overall, but to me it almost feels like he's learning to make it his power in a more psychological way and he's taking his time with it, if that makes sense?",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "i_will_let_you_know",
                                                                                                    "body": "Dragon form is more his ace in the hole. We should treat it like that so he can surprise his opponents instead of assuming he'll use it every fight. \n\nI'd rather not put arbitrary restrictions like \"only when he's close to be death\".",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "LiliGlez14",
                                                                    "body": "Lol yeah\nHonestly, I don't mind Dan Heng holding back in the story because they gotta shill their new characters, but at least make him say something along the lines of \"we can't intervene too much\" or \"I don't want to use these powers\" because he just seems like he would rather let someone die than use his IL powers.\n\nAnd Welt would be too op, if he can make black holes then I understand why he doesn't use them xD",
                                                                    "score": 19,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Talia_Black_Writes",
                                            "body": "At least Mydei's actually makes sense this time. \n\nHe's not just walking off into oblivion to Aeon's-knows-where. He's taking up Nikador's job of fighting the Black Tide in order to buy the Chrysos Heirs more time. He'll 100% be back in a bit.",
                                            "score": 81,
                                            "replies": [
                                                {
                                                    "author": "No-Environment-3997",
                                                    "body": "Hopefully, he finds my dad and that pack of cigarettes from about 23 years ago while he is out.",
                                                    "score": 36,
                                                    "replies": [
                                                        {
                                                            "author": "Msaleg",
                                                            "body": "Nope, he has to find my dad first, he is with a carton of milk for my cereal since 21 years ago.",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "author": "No-Environment-3997",
                                                                    "body": "Damn these dads need tracking devices installed. Or at least a better sense of direction.",
                                                                    "score": 11,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "starswtt",
                                                    "body": "I think the one problem with aventurine is that despite how well written it was in a vacuum, what he was doing was entirely unrelated to what we're in penacony for. If you removed that entire aventurine story, pretty much nothing changes. The pay off for the set up its theoretically doing is too far off for the amount of time it took and we don't even know if it will ever happen since the original penacony story is over. It wasn't really noticeable then bc there was still an opportunity for it to pay off and it's a mystery, but it kinda just didnt. Mydei doesn't have that problem, there's very little mystery, set up, or loose threads to pay off. He did his story quest and fucked off the kremnoa to fight the black tide. He doesn't even need another story appearance to justify his story relevance, he already changed the direction of the plot, the motivation of key characters, etc. So long he appears a few times (especially when we finally beat up the big bad), his story is already as complete as it has to be (though ofc I would love more mydei plots to open up.)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "chairmanxyz",
                                            "body": "He has two more story points in the magical book thing so I’m sure we’ll get a bit more of him. But they did wrap his story up very nicely which I’m grateful for. Aventurine is not even close to being a finished character…",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "G0ldsh0t",
                                                    "body": "Yep he will be back to get killed by Phainon. As he is the only one who know how to kill him. And I assume all the prophecies will come to pass",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Red_thepen",
                                            "body": "That's just most characters, dw. You just cant fit everyone in the polt if you release 2 chars per month, and new main plot ALWAYS has to sell new upcoming characters.\n\nI'm honestly not sure how they're supposed to resolve situation with Luocha for example, only way his story is getting continued, if a new char is released that's tied to him.\nWell i guess that's possible, since he's going to be judged by xainzhou alliance, some of his judges might be playable characters, or whatever's in his coffin might be made into a human form somehow.\n\nAnd for Aventurine and Dr. Ratio, we're only getting anything from them i guess only when next member of IPC is released, or perhaps some kind of conflict with genius society happens (again tied to a new char release).",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Substantial-Stardust",
                                                    "body": ">to resolve situation with Luocha for example\n\nThey always can release \"true form/identity\", same as happened with Dan Heng and Tingyun. Luocha isn't even his true name, so I'm sure this is exactly that they planned to do.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "yurilnw123",
                                                            "body": "I'm still coping the VA reveal.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "janeshep",
                                                    "body": ">Well i guess that's possible, since he's going to be judged by xainzhou alliance, some of his judges might be playable characters, or whatever's in his coffin might be made into a human form somehow.\n\nIf Fu Hua, the Xianzhou fleet admiral, intervenes during/after/about the trial, then she'd be the one.",
                                                    "score": 17,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "i_will_let_you_know",
                                                    "body": "There are still a lot of Xianzhou ships to explore and they could even add in more IPC or off world Xianzhou characters returning home kinda like Lingsha.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "PrinceKarmaa",
                                            "body": "spoilers tags man",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "HonkaiStarRail_leaks-ModTeam",
                                            "body": "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 7: Mark spoilers\n\n>Content containing story or major spoilers from current and future patches must be marked as such. Do not include spoilers in post titles. \n\n>Make sure to give context for the spoiler (e.g. Boss Spoilers \\>!spoiler here with no spaces on the ends!< or 2.3 spoiler/possible spoiler \\>!spoiler here with no space!<)\n\nPlease report this message if you have edited your submission to mark the spoiler accordingly.\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Katicflis1",
                    "body": "Yeah I'd take no myriad over a half hour of plot relevance + myriad(theherta)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Gold_Donkey_1283",
                    "body": "His entire 3.1 quest already his myriad maybe 😂\n\nWhat else you want to hear ....",
                    "score": -14,
                    "replies": [
                        {
                            "author": "GothicOwl13",
                            "body": "Yeah but we all know Castorice will get an animated short and myriad while having most of the 3.2 story to herself.\n\nI mean I wasn't expecting Myriad for him anyway given he is second half but still",
                            "score": 92,
                            "replies": [
                                {
                                    "author": "coinflip13",
                                    "body": "Yeah Castorice is going to get a Myriad, but who I am really expecting to get  a shit ton is Cyrene and Phainon. I am expecting both of them to get like a song dedicated to them along with Myriad, Animated PV and the normal stuff most characters get",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "ballzbleep69",
                                            "body": "Yea I’ll be surprised if Cyrene doesn’t get her own version of TruE",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Gold_Donkey_1283",
                                    "body": "To be honest.... We don't know much about castorice before and her getting trailer is expected. \n\nMydei story everything already been told nearly entirely in main story of 3.1 where he had the most screen time",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Aeso3",
                                            "body": "I mean Tribbie got a Myriad and a focus on the main story that told her story AGAIN.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "G0ldsh0t",
                                                    "body": "Yes but that was before 3.1 started.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Aeso3",
                                                            "body": "Nah, they did for Fugue too and she was on the second half of her banner.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GothicOwl13",
                                            "body": "It's almost as if the banner placement is on purpose, isn't it? lol",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Gold_Donkey_1283",
                                                    "body": "I mean Aggy also got the same treatment but worse.... She is sandwiched between Herta and Tribbie. \n\nUnlike Mydei..  She didn't got any meaningful backstory or development before her banner while Mydei got a whole-ass movie about him 😂",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "FrostyBoom",
                                                            "body": "Aglaea still is with us in an active role, unlike Mydei being sent to the Shadow Realm for the time being",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "Gold_Donkey_1283",
                                                                    "body": "Still the point is she wasn't got anything noteworthy before her banner",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kvasiraus",
                                                                            "body": "Exactly. I pulled for Aglaea, I think she's amazing but let's not pretend she has been treated anywhere near the other 3.0 characters at this moment. I love her animations but let's not pretend Herta and Mydei's didn't have more of a budget. This is despite the fact that she's the first limited Remembrance character.\n\nHerta, Mydei, and Tribbie all have gotten far more than Aglaea.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Frosty_Ratio_1306",
                                                            "body": "I hope she's get more fleshed out more as story goes on. I guess they're holding back on her story wise, saving it for something bigger (yes I'm coping) since she's the back bone of the Flame chaser. I'm not her die hard fan but her fans deserve more than what Hoyo gave for now.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GothicOwl13",
                                                            "body": "I didn't say anything about Aglaea. This isn't anything about her. Why are you trying to enlengthen the argument when I said I wasn't expecting a Myriad anyway\n\nShould I be grateful that Hoyo at least give proper characterization to a character in their game?",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Acceptable_Pop_6880",
                                            "body": "What is that kind of comparison bruh😭😭 we don't know much about castorice because her patch ( 3.2) isnt come, we know much about mydei because his patch already come",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Rude-Designer7063",
                                    "body": "Well, of course, she's the anniversary character, what'd you expect?",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Talia_Black_Writes",
                            "body": "Yeah, myriads are also supposed to give lore or backstory for a character that we don't really know a whole lot of yet (Acheron's and Firefly's comes to mind) or set up for future story (Tribbie's and Sunday's)\n\nI will say, this is still such a high quality trailer I'm not too upset.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Zombata",
                                    "body": "hell, we know more about Mydei than most other characters",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CoLdNeKoKiD",
            "body": "Lmao not them casually showing off Mydei ripping off Nikador's head 💀💀💀",
            "score": 74,
            "replies": []
        },
        {
            "author": "Background_Froyo3653",
            "body": "lord mydeimos more like lord spreadmylegimos ahahah",
            "score": 81,
            "replies": []
        },
        {
            "author": "cyanidecattt",
            "body": "Heavy metal suits Mydei well. Looking forward to this track on Spotify.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Layle7",
            "body": "Wrath of a man who is forced to be autoplayed.",
            "score": 223,
            "replies": [
                {
                    "author": "yumzpasta",
                    "body": "Hoyo made his kit autoplay so that players could submit to wrath just like him /j 😭 ",
                    "score": 67,
                    "replies": []
                }
            ]
        },
        {
            "author": "i_live_for_coffee",
            "body": "I love the kind of man that will actually just kill me.",
            "score": 12,
            "replies": []
        },
        {
            "author": "wobster109",
            "body": "Huh. He doesn’t strike me as being very wrathful. I think I get it though… it’s his trial of strife right? Even the prophecy of his demise is there.",
            "score": 39,
            "replies": [
                {
                    "author": "Key-Protection-6516",
                    "body": "More likely his trial. Strife does piss him off, but you're right.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "LadyEscadelia",
            "body": "Mydei you could have the worst kit ever created in this game and I would still pull for you, they could never make me hate you.",
            "score": 44,
            "replies": []
        },
        {
            "author": "bivampirical",
            "body": "hoyo is incredibly dedicated to making me simp harder every time i see mydei holy shit",
            "score": 30,
            "replies": []
        },
        {
            "author": "OneWater7191",
            "body": "While the lack of a Myriad makes me a bit sad, this trailer is majestic! I loved the visual and it looked so well done, so happy nonetheless ♥️",
            "score": 9,
            "replies": []
        },
        {
            "author": "sugarheartrevo",
            "body": "RAW PEAK FIRE GOAT KINO\n\nMy glorious king Mydeimos….I love that shot of him tearing the enemy’s head off and all the golden blood, he’s just too good. Why isn’t Lance of Fury his ult man 😭😭😭 I really do like the throne and crystals and how they’ve been utilized as part of his fighting style in cutscenes, but including the Lance of Fury would’ve made him seem like a demigod for real. We see it in in-game anyway so ? \n\nAlso some very interesting visuals here. It looks like there’s a flower crushed in his hand at the beginning which is pretty significant to his lore (one of his chapters in the book mentions the flowers that spring from his tears will be the “last beauty” of Amphoreus in its final day). The red sky is also similar to what Phainon mentioned Aedes Elysiae looked like when it was destroyed; the loop theory is getting more real by the day. \n\nOverall this feels like what his version of Nikador’s trial that we didn’t get to see was like, which is really cool",
            "score": 58,
            "replies": [
                {
                    "author": "itsB4Bee",
                    "body": "> Why isn’t Lance of Fury his ult man 😭😭😭 I really do like the throne and crystals and how they’ve been utilized as part of his fighting style in cutscenes, but including the Lance of Fury would’ve made him seem like a demigod for real. We see it in in-game anyway so ?\n\naint that a big fat spoiler? thats like asking to remove Trianne from all Tribbie's abilities because Trianne is canonically dead",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Elora_egg",
                            "body": "I'd say character death is a bigger spoiler than a powerup, and also far less necessary to reflect in a kit. \n\nIf a character gets new abilities in a patch, it seems obvious to have those abilities in gameplay. When Mydei's boyfriend comes out I'd be surprised if his kit isn't spoiler central based off of what we know of him, which would make it seem wrong that Mydei didn't get the same treatment.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yorokobe_Shounen",
            "body": "This literally looks like he's fighting off apostles in the eclipse lmao",
            "score": 7,
            "replies": []
        },
        {
            "author": "Agreeable-Till793",
            "body": "My man will grace my acoount soon I'm really out of patience rn",
            "score": 7,
            "replies": []
        },
        {
            "author": "crystxllizing",
            "body": "DELICIOUS, MAGNIFICENT, GONGEOUS ✨",
            "score": 23,
            "replies": [
                {
                    "author": "SaintAlmonds",
                    "body": "A wild gongeous detected",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Biskit_blob",
            "body": "I really like how gory it was and how it seems to reflect his >!own trial of strife!<. But I was also expecting something a bit different, music and direction wise… it didn’t hit that hard for me. not a fan of overly postproduced/edited visuals and no color progression. \n\nLoved the carnage though!",
            "score": 61,
            "replies": []
        },
        {
            "author": "WolfMJ13",
            "body": "Submit you say?",
            "score": 14,
            "replies": []
        },
        {
            "author": "LusterBlaze",
            "body": "how it feels to go to the grocery store after 5 pm",
            "score": 15,
            "replies": []
        },
        {
            "author": "Kir-chan",
            "body": "Mydei joining the ranks of Myriadless male characters, which is all of them except Jing Yuan, DHIL and Sunday. Ig they can only afford one Myriad per year for the guys and Sunday took that slot.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Percent234",
            "body": "man animations so good wth.\n\nits rival top notch anime D:",
            "score": 8,
            "replies": []
        },
        {
            "author": "Crownhonest",
            "body": "The shot of him with gold tears is soooooo hot",
            "score": 25,
            "replies": []
        },
        {
            "author": "Sugar_Spino023",
            "body": "Best character ever!!! Forced to be auto",
            "score": 12,
            "replies": []
        },
        {
            "author": "Dapper_Floor4793",
            "body": "visuals are insane ngl, very peak and I liked how they showcased the golden blood since I'm pretty sure the chrysos heirs have golden blood too.",
            "score": 13,
            "replies": [
                {
                    "author": "ImperialSun-Real",
                    "body": "Yeah, which is why I think Aglaea might die in a pool of her own blood",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "dont-touch-my-kokoro",
            "body": "Kratos who looks like Gilgamesh? Sign me up.",
            "score": 6,
            "replies": []
        },
        {
            "author": "No_Butterscotch7340",
            "body": "I bow to my king.\n\nA shame no Golden Epic, he truly is a second half man, but this is cool too. It went hard at least.",
            "score": 21,
            "replies": []
        },
        {
            "author": "femboy-kitten",
            "body": "If I said even 1/10th of the thirsty stuff I wanted to say about this man, I would be obliterated by the mods",
            "score": 22,
            "replies": []
        },
        {
            "author": "qxndubu",
            "body": "mydeimos my beloved!!",
            "score": 10,
            "replies": []
        },
        {
            "author": "Aserisk",
            "body": "the emanator of men",
            "score": 10,
            "replies": []
        },
        {
            "author": "Seiichirou_Uta",
            "body": "ngl I would play a spinoff that's only about his story",
            "score": 4,
            "replies": [
                {
                    "author": "FrostyBoom",
                    "body": "Tbf, Mydei has some of the most badass backstory. Lil guy was thrown to the Sea of Souls as an infant, survived and was strong enough that he was mistaken for a sea monster by folk yet he was still kind enough to still save sailors who had fallen prey to the Sea. After that it just goes even *more* badass somehow ",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Talia_Black_Writes",
            "body": "...\n\nJesus Christ. Just when I thought Hoyo couldn't outdo Sunday's.",
            "score": 46,
            "replies": [
                {
                    "author": "NoOne215",
                    "body": "That head rip though, how does a man make violence look so hot like he does?",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Wise_Consideration_3",
                    "body": "Sunday's was plagarized so they could definitely outdo him",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Sverrk",
                            "body": "Huh? I'm out of the loop, what do you mean by that?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Talia_Black_Writes",
                                    "body": "A scene from Sunday's trailer looked VERY similar to a trailer from another game. Hoyo was accused of plagiarism (But to be honest I think it was greatly overinflated because Sunday is one of the most divisive characters in the game).",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "Wise_Consideration_3",
                                    "body": "https://www.reddit.com/r/gachagaming/s/iQPV7xMMmu",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Weak_Lime_3407",
                    "body": "literally one of the most plagiarized PVs in all of Hoyo's histories lol",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Extra-Ad-249",
                            "body": "Naan,they did even worse.\nIn Honkai impact 3 v7.1 Griseo’s old PV is literally copy every pixel from Black clover op10, Mushoku tensei op2 and Frieren op.\n\nAnd this mydei one is obviously ‘’ inspired ‘’ by the eclipse from berserk.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "badmoonretro",
            "body": "hoyo cooked! the man served! and HE ATE",
            "score": 8,
            "replies": []
        },
        {
            "author": "CelestialRequiem09",
            "body": "God damn this was good and suits him so well",
            "score": 17,
            "replies": []
        },
        {
            "author": "NiceMeanInBetween",
            "body": "MY GOAT",
            "score": 18,
            "replies": []
        },
        {
            "author": "NiceMeanInBetween",
            "body": "MY GLORIOUS PRINCE MYDEI PLEASE KILL ME",
            "score": 19,
            "replies": []
        },
        {
            "author": "No_Campaign_9789",
            "body": "is it just me or does the music remind me of dantdm intro",
            "score": 8,
            "replies": []
        },
        {
            "author": "Downtown_Day_2188",
            "body": "\"What determines the fate of humanity in this world? Some kind of invisible being or law, like the hand of the Lord hovering over the world? At least it is true that man does not even control his will.\"\n\nLiterally the same vibe as Eclipse from Berserk, even some scenes had similar shots and angles. Not gonna be surprised if it was an inspiration for this trailer",
            "score": 7,
            "replies": []
        },
        {
            "author": "Sufficient_Simple199",
            "body": "Can't run away from the aslume",
            "score": 3,
            "replies": []
        },
        {
            "author": "CloverClubx",
            "body": "I know he got a huge focus on the quest but I really wanted a myriad for him, even if as a sorry for the stupid ass autoplay they slapped on him despite everyone saying that shit sucks",
            "score": 34,
            "replies": []
        },
        {
            "author": "Korur",
            "body": "Mydeimos, the man that you are 🙏🏻✨✨. So this was his own trial huh, amazing. Can't wait for the next week!",
            "score": 9,
            "replies": []
        },
        {
            "author": "merakikis",
            "body": "the nanook imagery in the beginning with the gold was so interesting I wonder when we'll get a confirmation on what the third path is in amphoreus or if we still have a long way to go with theorizing, this is definitely interpreted as his coreflame trial too for sure",
            "score": 6,
            "replies": [
                {
                    "author": "Tsukinohana",
                    "body": "Isn't that more so that titans in ampho are somewhat twisted versions of aeons (nikador, nanook or aquila, ena)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "merakikis",
                            "body": "yes for sure but also we have confirmation from black swan that there's three paths residing in amphoreus, one of them rememberance and the other erudition; it's the third aeon's presence that we're unaware of and there's mostly been speculation between aeons like nanook or voracity, some dabbled in mythos as well with fictionologists, the imagery they put on mydei's 2D art is incredibly reminiscent of nanook's in the very beginning of 1.0",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Tsukinohana",
                                    "body": "to throw my hat in the ring i think it'll be finality or permenance",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "merakikis",
                                            "body": "that's also a very interesting idea too, some mentioned equilibrium but I think ena might've had something to do in the past here as well, especially since in their background story both on wiki and in sim universe it's mentioned how ena used to bring order to lands yet after disappearance they dove to extinction hence the idea of amphoreus being frozen in time since all we're witnessing has already happened before once and it would make sense why the rememberance is hiding them in plain sight, or how mem is there to \"record our travels with us\", march's idea of taking photos to keep memories and how we ran out of storage space towards the end, which is also a huge premonition for the upcoming stories",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Background_Froyo3653",
            "body": "why is he standing in cocoa puffs",
            "score": 10,
            "replies": [
                {
                    "author": "Ok-Bike-7327",
                    "body": "I thought those were skulls O_o",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "embodiment_of_sloth",
            "body": "1:30 I wish that was me",
            "score": 3,
            "replies": []
        },
        {
            "author": "just-wicked",
            "body": "handsome  \nshirtless  \nprobably strong unit\n\nscrewd day one because imaginary instead of FIRE !!!!\n\nurgh =\\_=",
            "score": 3,
            "replies": []
        },
        {
            "author": "Either-Back5823",
            "body": "Allat just for him to be anti gameplay 🙏",
            "score": 27,
            "replies": [
                {
                    "author": "Hello_1234567_11",
                    "body": "Back in mydei, we can play with the characters we pulled",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hiarus234",
            "body": "Yooo they used the edgy 2000's font for his name lol",
            "score": 8,
            "replies": []
        },
        {
            "author": "VoltaicKnight",
            "body": "My headcanon at this point is that he became Imaginary because the Titan he follows is yellowish or the imaginary gameplay I will have once I rolled for him and see his berserk state",
            "score": 14,
            "replies": []
        },
        {
            "author": "SupaSensei1516",
            "body": "Is there any story spoilers in this?",
            "score": 5,
            "replies": [
                {
                    "author": "yumzpasta",
                    "body": "Yes, a little bit. I would finish 3.1 first",
                    "score": 16,
                    "replies": [
                        {
                            "author": "SupaSensei1516",
                            "body": "Alright thanks",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Butterscotch7340",
                    "body": "Imo nothing you couldn't kinda figure out based on set-up, but technically yeah kinda?",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Zombata",
                    "body": "if you haven't played the story since 3.0 then yes",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Key-Protection-6516",
            "body": "Nice Mydei. Now do this for whoever decided to give you auto.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "replies": [
                {
                    "author": "HonkaiStarRail_leaks-ModTeam",
                    "body": "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 4: No NSFW\n\n>Any NSFW submissions that contain nudity or sexual activities will be removed.\n\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "GrayTheBruh",
            "body": "is anyone have some clue about the symbol that appears at 1:04 of video? i've seen it before in mydei animation, and kinda wonder if this already be in the game",
            "score": 4,
            "replies": [
                {
                    "author": "popileviz",
                    "body": "Could it be the sigil of Castrum Kremnos?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "GrayTheBruh",
                            "body": "idk, and what sigil even means?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "popileviz",
                                    "body": "Official symbol of something",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "GrayTheBruh",
                                            "body": "well then it could be, but again i dont have anything to back it up so yeah",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adorable_Ad_3478",
            "body": "The wrath is going to be Mydei auto-attacking the wrong enemy :P",
            "score": 12,
            "replies": []
        },
        {
            "author": "huyphan93",
            "body": "Interesting character. Great animation. Yet...\n\n>img destruction dps\n\n>built-in auto",
            "score": 11,
            "replies": []
        },
        {
            "author": "Acceptable_Pop_6880",
            "body": "As of 3.1 we have 11 limited male and 22 limited female, yet the number of male and female characters that don't have any additional trailer is the same (6) 😭😭 you thought male character are only treated like shit in kit aspect?? They're treated like shit in promotion aspect too",
            "score": 11,
            "replies": [
                {
                    "author": "b5437713",
                    "body": "If it were just gender ratios it would be one thing but it's not and thats what makes being a fan of male characters in this game *so* frustrating. It's gender ratios and element and role distribution and the way kit and eidolons are handled and promotion. Even still, you're still at risk of being accused of overblowing the issue and/or having a \"victim complex\" if you point stuff like this out, lmao",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ImperialSun-Real",
                    "body": "So the same ratio as Genshin? (1/3rd)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Acceptable_Pop_6880",
                            "body": "Yes, the same ratio in 3.x too",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VTKajin",
            "body": "daddy daddy daddy-",
            "score": 6,
            "replies": []
        },
        {
            "author": "Timtimus007",
            "body": "NOOOO I STILL NEED TO GET TRIBBIE SCREW YOU HIMEKO YOU'LL PAY FOR MY 50/50 😭😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 4,
            "replies": [
                {
                    "author": "HonkaiStarRail_leaks-ModTeam",
                    "body": "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 4: No NSFW\n\n>Any NSFW submissions that contain nudity or sexual activities will be removed.\n\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThamRew",
            "body": "Lmao on the fact that everything else except Mydei's kit being great",
            "score": 4,
            "replies": []
        },
        {
            "author": "ThunderCrasH24",
            "body": " Sadly decided to skip because of his auto and his element and some questionable animation choices. Buuuut.. if I have some surplus from my Castorice fund, I will throw a few singles at his banner.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fit-Application-1",
            "body": "AGSJDJDH I HAVE NO WIFI I CANT WATCH VIDEOS AAAAAAAAA",
            "score": 3,
            "replies": []
        },
        {
            "author": "Radinax",
            "body": "Trailer powercreep.\n\nJesus this is fucking insanity my god this is good!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SirePuns",
            "body": "That trailer was too short.\n\nI need a full movie of Mydeimos ripping heads.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HumbleCatServant",
            "body": "How do I fast-forward IRL",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial_Exit_7710",
            "body": "W",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puvpelps",
            "body": "Is that a Berserker elicpse reference with the land and sky filled with skulls? That's insanely raw.",
            "score": 1,
            "replies": []
        },
        {
            "author": "South-Dragonfruit-96",
            "body": "Man I got 160 pulls rn, do yall think I can get both mydei and castorice? Maybe even both their sig lc if I’m lucky? I want both but lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eonsofgamin",
            "body": "Cool trailer",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sammoonryong",
            "body": "it just feels bad pulling for him after we know the 3.2 changes. Like If I fail 50/50. Or all the other fluff. Do we know if the failed 50/50 things about the currency is retrospective? I failed like almost every lightcone 75% I went for. WOuld be a bummer if I fail again and dont get that currency things they spoke about.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighlightDue6116",
            "body": "Wrath of Man???!!! \n\n\nEdit: Why did devs put Man in the trailer title and not show him, are they stupid?  0/10.",
            "score": 1,
            "replies": []
        },
        {
            "author": "matcha-candy",
            "body": "New Top#1 Trailer just dropped.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lylat97",
            "body": "Really debating whether I should pull for him, or just got for Castorice and Sunday rerun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Percepvt",
            "body": "Nikador blood is gold, next Phainon .. white",
            "score": 1,
            "replies": []
        },
        {
            "author": "apexodoggo",
            "body": "Why is Man wrathful, is he stupid?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Hankune",
            "body": "Ain't gonna lie that was super generic.",
            "score": -43,
            "replies": [
                {
                    "author": "Nanami-sann",
                    "body": "Lmao huh ??????",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "Zombata",
                    "body": "me when i lie",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Weak_Lime_3407",
                    "body": "yeah agree\n\nit was pretty okay overall, but its still just \"character fighting ghost of the past\"",
                    "score": -5,
                    "replies": []
                },
                {
                    "author": "Aless_Motta",
                    "body": "Its ok, not their Best honestly, but they have amazing ones so is pretty Hard to beat them, I just rewatched the fugue one and wow is even better than when i watched for the first time.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "NirnrootEnjoyer",
                    "body": "honestly agree, not much is shown and it's very short, bellow 2 minutes even. Very whelmed",
                    "score": -13,
                    "replies": []
                },
                {
                    "author": "Meltedsteelbeam",
                    "body": "Well he is Walmart Gilgamesh design wise",
                    "score": -25,
                    "replies": [
                        {
                            "author": "FrostyBoom",
                            "body": "All Gilgamesh has going for him is cool factor, frankly. His writing is... quite shallow.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "Nyx-Knight",
                                    "body": "I'm sorry are we talking about Gilgamesh from Stay Night or are we talking about Gilgamesh from like the entire Fate Series?\n\n\nBecause the former is shallow yes but the latter is a very good character.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TaleFantastic4115",
            "body": "Mid ey.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ConfidentPeanut18",
            "body": "What's with them reposting Mydei videos lately?",
            "score": -7,
            "replies": []
        },
        {
            "author": "PrinceKarmaa",
            "body": "so many reused animations and it feels super short. kinda meh tbh",
            "score": -13,
            "replies": []
        },
        {
            "author": "Rucaly",
            "body": "question: whats the difference between him and say, Blade or ice lady? What does he have ton make him last more than them? ",
            "score": -13,
            "replies": [
                {
                    "author": "VanitasMecka",
                    "body": "He is CC immune when he goes into that vendetta state. He had 4 revives, self healing and could be self sustain without a healer in some modes. Strong taunt as well.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "dont-touch-my-kokoro",
                    "body": "Better damage, better damage, better damage, immune to cc, cooler, self revive, and did i say better damage?\n\nCons: you cant control him.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hot-Assignment3332",
                    "body": "That feeling when you forget the Chinese name of a character and can't be bothered to google it, can relate 😭",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mrbluefrd",
            "body": "Wrath of shit",
            "score": -23,
            "replies": []
        }
    ]
}