{
    "title": "V4 Anaxa Changes via HomDGCat",
    "author": "ImNotNex",
    "subreddit": "HonkaiStarRail_leaks",
    "rank": 4,
    "score": 2174,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 501,
    "url": "https://i.redd.it/5z98dqic1dpe1.jpeg",
    "id": "1jduz7z",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please respond to this comment with a mirror link and source link. Failure to do so will result in post removal.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HonkaiStarRail_leaks) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "ImNotNex",
                    "body": "t.me/homdgcat/5174\n\nhttps://imgur.com/a/WZGrpj9",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "soggysandwich1290",
            "body": "How many times are they gonna flip between exposed nature and qualitative disclosure (still glad he's been buffed)",
            "score": 944,
            "replies": [
                {
                    "author": "jtrev23",
                    "body": "v5 is Exposed Disclosure, then v6: Qualitative Nature",
                    "score": 356,
                    "replies": [
                        {
                            "author": "GGABueno",
                            "body": "Live: Anaxa Slash",
                            "score": 169,
                            "replies": [
                                {
                                    "author": "darkfall71",
                                    "body": "God that's still so funny\n\n\nSkill: KAEDEHARA KAMIKAZE NORIOKU \n\n\nUltimate: kazuha slash",
                                    "score": 49,
                                    "replies": []
                                },
                                {
                                    "author": "gravesvasco",
                                    "body": "EMERALD SPLASH",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Elysteco",
                                    "body": "Anaxaful gorashine",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SouthernHelicopter79",
                                    "body": "Anaxa Gunshot",
                                    "score": 43,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RentLast",
                            "body": "Qualitive Nature sounds like he's talking about himself. Love it",
                            "score": 68,
                            "replies": []
                        },
                        {
                            "author": "Luminous_Hope8256",
                            "body": "Exposed Disclosure lowkey goes hard",
                            "score": 59,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TougherThanKnuckles",
                    "body": "Pretty sure V3 just had text errors where half the time they used V1 names but didn't use them the other half. I'm pretty sure Castorice's dragon had three different names in her V3 kit lol.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "zatenael",
                    "body": "frankly exposed nature feels better than qualitative disclosure",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Fabi_Alex",
                    "body": "Aparently they like taping that a lot. The same happens with Castorice’s dragon and one of her skills, they keep changing their names back and forth with every new version.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dankmemekovsky",
            "body": "BUFFS? in this economy? 😭",
            "score": 850,
            "replies": [
                {
                    "author": "miyahedi21",
                    "body": "W Blasphemous scholar\n\nAnaxamains are cheering right now!",
                    "score": 188,
                    "replies": []
                },
                {
                    "author": "swizzlad",
                    "body": "Who was gonna pull a male in this economy especially if he doesn't look future proof. Peeps rejoice when usnits come out weak but that just makes them power creepable with less effort",
                    "score": -64,
                    "replies": [
                        {
                            "author": "Professional_Air9935",
                            "body": "you’d be surprised at the amount of people swearing up and down that they’ll pull all the male characters (and it’s literally possible while being f2p with the amount of male characters being released)",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Fragrant_926",
                            "body": "Bro there are male pullers out there, i would absolutely pull him even if he heals enemies",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "ImperialSun-Real",
                                    "body": "And equal opportunity pullers like me.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JiaoqiuFirefox",
                            "body": "At least he's worth pulling now. Pre-buffs, who's gonna pull him if they already have Jade or Argenti?\n\nHe should feel OP for a 3 - 4 months until Hoyo inevitably comes out with a waifu version that powercreeps him. 😮‍💨\n\nLow-key disappointed they didn't buff his sig lightcone too. The art is fire.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Jaquemart",
                            "body": "Male? I see Erudition, I pull. It also got me some beautiful men, but that's coincidental.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pokebuzz123",
            "body": "TL;DR - Anaxa bros, we won\n\n**Minor Traces:** Wind DMG% +22.4%, DEF +22.5%, Crit Rate +6.7% -> Wind DMG +22.4%, Crit Rate +12%, HP +10%\n\n**Ult:** 150% -> 200%\n\n**Skill:** 60% -> 80% (300% -> 400% per skill, 600% -> 800% per double skill),   \n DMG% per enemy hit 15% -> 20% (75% -> 100% with 5 enemies)\n\n**Talent 2:** 2+ Erudition DMG% dealt 30% -> 40%\n\n**Talent 3:** DEF ignore per weakness type 3% -> 4% (21% -> 28%)\n\nName change for everything else\n\nEdit: Added full values to some of them, for those who don't want to do the math",
            "score": 1004,
            "replies": [
                {
                    "author": "Lazy_Hat_2294",
                    "body": "bless ewe",
                    "score": 80,
                    "replies": []
                },
                {
                    "author": "naocanyo",
                    "body": "With how much DEF ignore and reduction his kit and lightcone has now and the fact that he implants weaknesses, should I prepare a main DPS Quantum set for him or can stick with the high speed Wind set?",
                    "score": 45,
                    "replies": [
                        {
                            "author": "coolboy2984",
                            "body": "Wind set if you're running dual DPS erudition with THerta, DPS set if you're running him solo carry.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "naocanyo",
                                    "body": "Yeah, I am curious to see if he's viable as a solo carry now. Like, if he's still somewhat underperforming after all of the buffs and quantum sets than the other designated main DPS like THerta, Castorice and Mydei, then I may just not bother with getting DPS sets and always run him in dual carry with THerta.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Thatoneminer",
                                            "body": "imho i dont think its bad that he doesnt do AS high dmg as thertha, mydei etc. cuz he has the boon of being a sub dps, main dps, debuffer, buffer and speed controller in one character. he might legit be the kazuha of HSR",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Thatoneminer",
                                    "body": "im gonna give him my unused herta set for now cuz sure i know wind will be slightly better, but i just despise switching between sets ocnstantly",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EclairDawes",
                            "body": "Not sure if the extra 7% makes a difference but I did some basic calcs on his old kit. The thing with Anaxa is if you're looking at quantum you have to compare it to the scholar set that was made for him. It's hard to beat 20% damage buff to skill and Ult with 8% Crit when that's already basically everything he wants. \nSo what u discovered in the calcs:\n\nEOSO Scholar was better. \n\nE1S1 Scholar was still better.\n\nEOSO with Pela(resolution shines) quantum was better offering in the ballpark of a 40% damage increase from the 20% quantum defense shred because your getting 95-99% shred depending on your resolution shines superimpose. \n\nE1S1 or E0S1 or E1SO with Pela(resolution shines) scholar was better because in any of these scenarios your just over capping a lot of defense shred. Of course you could remove resolution shines to make up for E1 or S1. \n\nI'm guessing not much changes with the 7% other than he's now even better with scholar cause he's just getting more defense shred with it. Whereas quantum is still only going to be worth it while using Pela so now your just going to overlap defense shred even more. I could be wrong though. \n\nSo yeah I'd say either go with your high speed wind set up especially if your trying for a sustain Anaxa. Or go scholar for general purposes.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "naocanyo",
                                    "body": "Thanks for the detailed answer👍🏻",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "EclairDawes",
                                            "body": "Another niche scenario where quantum would likely be better is on a break team with E1 Runa Mei and Fugue(resolution). You can definitely get around 100% defense shred with some combination here.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "naocanyo",
                                                    "body": "Yeah I have E1S1 Ruan Mei so I didn’t pull for Tribbie and thus she’s definitely on the team😹her E1 hints the possibility of stacking DEF ignore, that’s why I thought quantum set could work",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EclairDawes",
                                                            "body": "Yeah. This is largely why I'm pulling Anaxa. That defense shred and weakness implant make him viable in a lot of team comps. I just love the variety. \n\nI double checked to make sure with the extra 7%. So at E1S1 with quantum not considering other character factors, the quantum set will give around a 25% damage increase. So thats roughly on par with scholar since it  20% plus Crit plus an extra 25% some of the time.\n\neES1 quantum plus E1 Ruan Mei I think gets you 95% defense shred so that would be very worth it. That's getting  you close to 40% damage buff from the extra 20% on quantum.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "naocanyo",
                                                                    "body": "Yeah, 28% from talent + 12% from lightcone + 20% from E1 Ruan Mei + 16% from his own E1 + 20% from quantum set is 96% DEF ignore. But his skill bounces so the coverage of this DEF ignore may be kinda iffy when there are like 4 or 5 enemies on the field or like Pure Fiction when multiple enemies continuously spawn. Also, his E2 is kinda busted so pulling and stopping at his E1 seems not optimal. I don’t know about it now, gotta wait and see how it goes later on lol 😂",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "EclairDawes",
                                                                            "body": "I don't remember what E2 does. I probably just didn't care cause I'm F2p and have never pulled Eidolons. Acheron I plan to make my first grabbing her E2 on rerun so she remains viable.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "naocanyo",
                                                                                    "body": "Acheron still going strong👍🏻 Anaxa’s E2 decreases All-Type RES of every enemy on the field by 20%",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "EclairDawes",
                                                                                            "body": "Yeah that's really good. Especially for multi DPS comps. I'd probably say E2S0 is better than E1S1 cause there are several ways to gain defense shred. Res pen is pretty rare.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SpecificDirt8342",
                            "body": "Reaches 48% def penetration with his lc",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jyusatsu",
                    "body": "Can't be super happy with this buff and cross finger they don't nerf him again. His numbers look more solid now both his personal damage and supportive utility.",
                    "score": 110,
                    "replies": []
                },
                {
                    "author": "swizzlad",
                    "body": "The def subs where illegal af anyways. I dont pull males and even i can see the blatant sabotage",
                    "score": 42,
                    "replies": [
                        {
                            "author": "janeshep",
                            "body": "What difference does it make to give him 10% HP? We only gained less than 6% CR (that's good, I'm not denying it) but we lost the DEF trace to gain a 10% HP trace...",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "HalalBread1427",
                                    "body": "Makes Tribbie do more damage.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "paradoxaxe",
                                    "body": "Well it's just the same as why Feixiao has 12.5% def trace",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "bleepingmeeping",
                                            "body": "Idk I'm grateful for the def because I run her with aven mostly, it helps with not letting the shield fall apart so soon. Fei can be quite fragile",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThatCreepyBaer",
                                    "body": "DEF% and HP% are effectively interchangeable stats unless the unit (or a unit in the same team) needs one over the other. In this case, because Tribbie exists, HP% is technically better than DEF% because it lets her do slightly more damage.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Telooor",
                                    "body": "3B",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Select_Soft",
                    "body": "Dang, now people are gonna cry about power creep lmao",
                    "score": 62,
                    "replies": [
                        {
                            "author": "miev_",
                            "body": "Tbf wasn't the general consensus that Anaxa will replace small herta or serval? Unless I'm mistaken Anaxa wasn't a huge upgrade so it kinda makes sense people wanted him to be an actual upgrade when he was replacing 4 stars. You are not wrong with what you said but in this case a buff isn't necessarily bad considering who he powercreeps (4 stars) atleast in a big Herta team",
                            "score": 92,
                            "replies": [
                                {
                                    "author": "Acceptable-Virus8920",
                                    "body": "Well I think since his role is that of an debuffer/sub dps the change i would have liked is for him to have a bit more speed somewhere in his kit. But to adress your statement Anaxa is currently balanced around Therta which feels like a jiaoqiu and archeron situation. The fear isnt just powercreep its concern for how usable the unit will be if you dont have the other.\n\nThat may be not true when he releases becouse at least Therta is right now spoiled for choices (Servaly; Small Herta; Argenti; Jade) but what about anaxa? If he is only truly shining in Therta teams but isnt even best in slot there then it would be such a waste of his character and design.\n\nTruth is People dont want to many buffs that force him into Therta teams while also dont want to many nerfs becouse in terms of other dps/sub dps options he is on the lower end of the spectrum\n\nregardless i will pull for him",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "janeshep",
                                            "body": ">But to adress your statement Anaxa is currently balanced around Therta which feels like a jiaoqiu and archeron situation.\n\nExcept his major buff (140% CDMG) gets activated only when THerta isn't in the team...",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Acceptable-Virus8920",
                                                    "body": "Lets do some simple maths \nAnaxa:asuming you have 100% Crit DmG crit rate base line and you only deal 100 points of dmg (i know he deals a ton more but just to simplify math)\n\nAnaxa gets 140% critDMG Solo \nThats 100 * 2.40 = 240 DMG\n\nIn a The Herta Teams (40% dmg +80 critdmg)\n100 * 1,4 *1.8 = 252 \n\nThat is really over simplified but he deals in this oversimpliefied scenario more dmg\nAnd to say the least most of his personal dmg increase he would get from a another harmony option if you werent playing the herta in his team gets ofset by the huge dmg the herta deals right now",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "inemnitable",
                                                            "body": "There's literally no way that 40% damage is actually gonna be multiplicative 40% though, it will be diluted at minimum by wind orb and scholar or wind set. Potentially more depending on what harmony you're running.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Acceptable-Virus8920",
                                                                    "body": "of course its not how the math in detail works. i should have been more clear about what i intend to say. My Point is the 140% are huge but having a mix of diffrent dmg buffs helps most o times more since crit dmg values can be gained from a lot of sources",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "LordGrohk",
                                                    "body": "I haven’t even read his kit thoroughly (since v1) and I know this is bullshit.\n\nHe literally just got what seems to be straight 25-30% multiplier buffs, you’re saying he’s now better than The Herta because of that? By what metric?\n\nYou’re claiming that 1 extra support + 140% CD > the entirety of The Herta’s kit + 40% damage boost for the ENTIRE team… with no other information about investment.\n\nIf there was ANY chance for him to be better solo, it was before these changes. I don’t know the exact details of course, he probably could come close in some scenarios as I know Herta can have SP trouble, and sustainless… but this buffed The Herta just as much as his solo teams when that is accounted for. This just comes off as a severe underestimation of Herta.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "Acceptable-Virus8920",
                                                            "body": "Thank You I also wont deny that he could be better in certain matchups further down the line but with the current changes and information i dont think that his best teams are the solo carry ones \nMaybe with high Investment but most dps clear the game at that stage even sustainless",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Acceptable-Virus8920",
                                                    "body": "Have you read my comment? Right now Hoyo is exploring his design as a jack of all traits master of none. A character that can sub dps/ dps, someone who has utility. They clearly have it in his kit an they buffed only the part of his passive that helps dual carry teams in a Herta team he gets 80% Crit and the 40% DMG buff sure 140% CritDMG is a lot but he isnt loosing out on to much but gains the insane dmg output of Herta, which may not raise his dmg but raises the overall dmg output from the team. Next Since the Hertas CritDMG buff is team wide supports like bronya sunday Sparkle RMC also gain even more buffing capabilitys. \n\nIn sense Anaxa and Herta are buffers for themselves in this Team and right now all his Solo Carry Teams i have seen  look Mid.\nAnd the Sustainless Argument is also invalid. I have seen sustainless Seele  0 and 1 Cycles that doesnt make Seele  the best dps. \nALMOST ALL DPS CHARACTER CAN GO SUSTAINLESS RIGHT NOW THATS JUST HOW BROKEN THE HARMONY UNITS AND DMG CELLINGS ARE RIGHT NOW. \n\nIts nothing special at a certain investment all can do that.\n\n\n And to speculate about an end of the AOE Meta anytime soon and him beeing better than the herta by then is cope\nIf that meta shift where to come both of them could already be powercreept \n\nI get that he isnt a Jiaoqiu but if they arent carefull with how they balance his kit (Like the previous beta versions where they nerfed his personal dmg) he could end up as half assed character and that is Something no one wants\nBecouse he is pretty and i will pull for him for that reason alone already.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "HonkaiStarRail_leaks-ModTeam",
                                                    "body": "**Hey Trailblazer, unfortunately, your submission has been removed from** /r/HonkaiStarRail_leaks:\n\n\n###Rule 1: Be respectful and civil\n\n>It is natural that people have different opinions. Please stick to basic discussion etiquette and refrain from insulting, harassing, or vagueposting about others.\n\n[subreddit rules](https://www.reddit.com/r/HonkaiStarRail_leaks/about/rules) | [reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette) | [reddit's rules](https://www.redditinc.com/policies/content-policy) | [new to reddit?](https://www.reddit.com/wiki/reddit_101)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ItsRainyNo",
                                    "body": "not a big upgrade over existing erudition on herta team",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Jaquemart",
                                    "body": "Who's Small Alert? \n\nFrom where I sit he's upgrading Silver Wolf, what with all the weaknesses he throws at everyone.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "miev_",
                                            "body": "Small herta, no idea why it autocorrected to small alert",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "darkandfullofhodors",
                            "body": "HSR audience really doesn't want to admit that they have no reason to pull for and use characters that aren't doing anything better than their already-built teams, and that powercreep is how gachas make money. Any time Hoyo is cautious about powercreep in a beta like this one, doomposting pushes them into big buffs anyway and the cycle repeats.",
                            "score": 188,
                            "replies": [
                                {
                                    "author": "gcmtk",
                                    "body": "HSR audience is large and diverse, with many disparate opinions.\n\nNot everyone pulls only to get stronger teams, but a lot of people do.\n\nBoth audiences need to accept that the other exists, whether or not they can agree.",
                                    "score": 116,
                                    "replies": []
                                },
                                {
                                    "author": "GGABueno",
                                    "body": "I keep saying this and I'll say it again. The real main problem is the HP inflation on the enemies.\n\nThe reason people *want* powercreep now is because they've grown to expect the units to become nearly unplayable after some months. If a new unit is on par with previous ones, then you skip it for those who can keep with with the constantly stronger enemies.",
                                    "score": 73,
                                    "replies": [
                                        {
                                            "author": "darkandfullofhodors",
                                            "body": "The enemies get stronger because the characters get stronger. The playerbase wants their numbers to get bigger, but if enemies don't get beefier to compensate, then suddenly everyone is 0 cycling at low investment, nobody has reason to pull eidolons or LCs and people get bored because the game is so easy and everything dies before it can do anything.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Commercial-Street124",
                                                    "body": "The solution to that is more game modes and more things to do casually",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "kamanami",
                                                            "body": "I'm already tired of 3 endgame PF modes.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ArtemisTheHarbinger",
                                                    "body": "There is no reason to pull Eidolons even now. A new E0 character ends up being stronger than older characters with Eidolon. The efficient thing to do is not to get fond of any character: no emotional attachment at all. Treat them as throwaway pixel dolls that will be replaced every six months at best, and NEVER pull on reruns unless it's an especially broken support.Trying to make an older character \"keep up\" with vertical investment is just a waste of money, since it will barely keep them on par with new E0 toys for a few months, and they will be crept again.\n\nAlso, don't pull on \"filler\" characters. It's far more likely hoyo will forget they exist and never give them anything.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Jellyfish_McSaveloy",
                                                            "body": "Filler characters like Topaz, Jade and Rappa are probably doing just as well if not better than a lot of hyped units.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ArtemisTheHarbinger",
                                                                    "body": "They'll last less then the shilled characters, because hoyo will be less likely to give them support, while having a harder time during their shelf life because hoyo is too busy shilling someone else. Not worth the risk.",
                                                                    "score": -4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "stuttufu",
                                                            "body": "I don't know. My e2s1 Acheron serves me well today in all game modes and my e2s1 THerta seems to be ready to do the same for quite a while.\n\nI expect Acheron to be future proof until 4.0 probably, and even there, to be viable.\n\nAnd this is talking about DPS. RM, Robin and Tribbie E1 are crazy good. They will last for many major patches.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "ArtemisTheHarbinger",
                                                                    "body": "An E2 limited character could cost 540 pulls at worst, 270 at best (unless you are insanely lucky). A new E0 character just as powerful as your E2 Acheron will cost 180 at worst. With the pulls you spent to keep your Acheron \"viable\" for one year, you could have gotten 3 new characters who are overall more suited to the meta hoyo wants to shill.\n\nSo, while I hope you have fun with your Acheron, you made the most inefficient choice.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "stuttufu",
                                                                            "body": "This would be true if, as you said, a new character is as strong as an E2.\n\nThis is true for DHIL and JL, even more strong probably.\n\nFor the moment, this is not true for Acheron. An E0S1 Algaea is not as strong as an Acheron E2S1 and, according to Prywden, an E0S0 Acheron is just 0.5 tier below Algaea (I disagree on this but whatever).\n\nAnd there is another important fallacy in your reasoning which is character build.\n\nI don't know how much you go far in building character, but main DPS requires extremely good builds which requires many months of farming. Having to roll 3 DPS will require you to extensively farm 3 caverns, which is a pain, you know.\n\nAnd finally, because of Hoyo bad behavior, we often see main DPS requiring their sign light cone.\n\nYour 3 cost vertical investment vs 3 cost horizontal investment quickly becomes 3+1 vs 3+3 (or at least 3+2).\n\nI am not a fan of any strategy in particular, but as a feedback, I brute forced all the break meta with Acheron e2. It was a joke.\n\nI also have the full break team built around FF but unfortunately, unless the meta favors her, she's benched where Acheron still goes strong.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Lower_Comfortable_44",
                                                                                    "body": "Also if you got that acheron when she came out and it last you to 4.0 that is less pulls spent than constantly pulling E0 dps's over and over through out that time.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ArtemisTheHarbinger",
                                                                                    "body": "There is fallacy in your reasoning too: newer character can get away with mid builds and even 3* LC due to how shilled they are. When DHIL was new, I was stuck with a terrible build for months due to bad luck, but he still destroyed everything with no effort, because the content favored him. He only started feeling weaker when 3.0 hit, and content started shilling Acheron instead. You also have to consider that a character can be powercrept even before you finish building them properly, like it happened go my Blade, and at that point, is it worth it to keep improving them? No matter how awesome my Blade's build is, he still sucks.\n\nIf we are talking about my idea of using them as tools, it would be to pull the strongest, give them the best choice you have that you can afford, exploit them as long as they can pull it off with the best build you manage to get, and then replace them. If you get, for instance, TheHerta and Castorice, with their one best support, they should pull through easily until the end of the 3.X cycle even if they are not perfect. At that point, they can safely be discarded and replaced, and it would be cheaper than trying to keep them afloat. I'm more iffy about someone like Phainon. While I'm sure he'll be very strong, he is releasing a little too late in the patch cycle for my tastes, meaning the meta will change in 4.X, and he might get left behind faster.\n\nBut people can do whatever they want with their jades, of course. I mean, there are whales who get everyone to E6, which is severely not needed. But I'm f2p and broke, so vertical investment is simply not an option. And since hoyo won't play fair with 5* power budget, I have to make my choices rationally.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "stuttufu",
                                                                                            "body": "If you are totally f2p, as you say, it's safer to just go for e0s0 and push for support eidolons if you have resources to spare. That way, even if you pull a weak DPS (as Blade, it was almost instantly powercrept by JL) it will be discarded soon.\n\nIt doesn't change the final result, it's betting on eidolons longevity VS meta shift. 3 cost vs 3 cost. The risk is if you are unlucky with an investment (Blade, Kafka because of dot meta, Dr Ratio because of blast meta) you have lost the gamble.\n\nBut to conclude, speaking about rational choices on a gacha game is how losers think! /j",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ArtemisTheHarbinger",
                                                                                                    "body": "The gamble is one of the reasons why I consider vertical investment an inefficient strategy in general even for supports. Take Sparkle, for instance. She has served me well for a long time, so I don't regret her, but if I pulled her Eidolons, I would most certainly regret them. And if the meta shifts in a direction your invested characters cannot follow... welp, it's done. If the game was balanced a little more fairly, the characters could become useful after the meta shifts again, but this is HSR, so who knows?\n\nAnd yeah, if we were entirely rational, we'd all say \"screw predatory gacha!\" and leave. But we are still here.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "stuttufu",
                                                                                                            "body": "At the same time, Robin E1 and now Tribbie E1 are the best investment you could have made. I don't have any of those, but I doubt they will fall short in the medium term.\n\nIf you want to be rational, the supports will carry your account.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Lower_Comfortable_44",
                                                                            "body": "\"most inefficient choice.\" well this NEVER mattered in the first place...  \nLike come on for what is that needed? moc 12 ? the thing that gives shit in return?   \nEven with \"most inefficient choice.\" you can play 95% of the game so pushing this shit is just insanity, more so cause its also playing into the devs hands so hard.  \nThe concept of \"falling behind\" is just pointless in a game like this, there is no pvp and as said before 95% is playable anyway plus will stay so.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ArtemisTheHarbinger",
                                                                                    "body": "If you are a casual that doesn't care about endgame, you can do whatever you want. If you actually care about the meta and clearing, yes, efficiency matters.\n\n>Even with \"most inefficient choice.\" you can play 95% of the game\n\nYeah, and what is 95% of the game? The story? You can finish it in 2 days tops even if you take it slowly. Exploration? It's non-existent. What else can I use my characters for? Farming calixes? Strolling around the map mindlessly with nothing to do? The game has no casual content: 70% of it is endgame.\n\nAlso, some people like *winning*. For instance, if I don't get 3 stars, it means I lost. Simple as that. And what prevents me from winning (or make it extremely hard) are *the characters I like* who have been powercrept and make every run a chore. And since new characters are always more powerful than even older characters with Eidolons and more suited for the current meta, trying to keep them up to par is worthless and more expensive. I don't want to go bankrupt, so pulling wisely is the only choice.\n\n>more so cause its also playing into the devs hands so hard.  \n\nSo what? Should I settle for an inferior product just to prove a point? It won't change anything. Every character costs the same, but it's blatant that hoyo put 10000000x more effort into Castorice than someone like Mydei. So pulling him feels like a trap. Doesn't matter if \"he's still good\", when she does everything he does but better, and is released right after him.\n\n>pushing this shit is just insanity\n\nI'm not the one pushing it. Just look around, and see that most non-casuals already follow this mindset. If anything, I fell in line later than most.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Think_Bath",
                                                                                            "body": "God this is so obnoxious, considering you -really- don't need meta to clear with 3 stars. Literally used March 7th and Moze into Nikador 3.0 MoC, completely ignoring his central mechanics. I don't know how we got to this point that we think we -need- the latest 5 stars to clear. To 0-cycle? Maybe. To clear? Absolutely fucking not. And I'm still using baby Herta and didn't pull for big Herta for PF. Am I getting 80k? No, but I still get 3 stars and I really couldn't give a fuck. I'm sorry but when you are saying things like \"most inefficient choice\" in a gacha game that doesn't even have PvP or leaderboards, it's incredibly fucking cringe.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ArtemisTheHarbinger",
                                                                                                    "body": "\"You don't need meta to 3*\" => mentions all of the meta 4*, all of which are stronger than some old 5*.\n\nOoookay? 🙄\n\nI never said you can't clear. I said it's hard, long, annoying, often RNG based and even more often a miserable experience. Eventually it WILL be impossible, because HP will keep going up. Also, hoyo can shut down any character and team they want whenever they want. Efficiency is the way to make sure to have the most comfortable clears possible with as little investment as possible, and getting a new character happens to be a lot less expensive than trying to keep an old one relevant. Blade, for instance, would need to be E6 to be *somewhat* comparable to E0 Therta (and she'd probably still win).\n\nIt's also about not settling for inferior products. If hoyo is not willing to put the same effort into all of their 5*, they either lower the cost of the \"not shilled\" ones, or I don't consider them worth pulling. That's it. The end.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Think_Bath",
                                                                                                            "body": "O-okay, now we're moving the goalposts and suddenly we have meta 4 stars now. 🥴 While yes they are good and Prydwen has them high rank (in artifical tiers imo and they wouldn't be anywhere near as high if they had to be judged against actual carry DPS, literally the only reason March is that high up is bc of Feixao), they are single target 4 stars going into a boss that completely revolves around AoE mechanics.The point wasn't that they're secretly broken meta crazy 5 stars-that-aren't. The point was that the content is doable. And funnily enough, Herta E6 and March 7th E6 are -completely free.- Just say you were trying to push the braindead agenda and be condescending over someone's pull choices in a completely PvE game where it really doesn't matter as long as you get the baseline.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ArtemisTheHarbinger",
                                                                                                                    "body": "Um... 4* can absolutely be meta? Whoever claimed otherwise? I certainly didn't. I use the same characters you do, you know? I use March, and I use mini-Herta as well, and they are absolutely meta, especially in their own niche. Gallagher is often the BiS in many teams as well. What's your point here? lol\n\nAnd I absolutely remain of my opinion: vertical investment is inefficient, because new characters are better (often massively better) and it's less expensive to just get a new one rather than force an old one to remain relevant. If someone loves their Acheron so much that they can't let go of her, and are willing to invest their body and soul into using her for another year... well, good for them. I commend their loyalty. But for someone like me who is broke and constantly forced to chase meta to have comfortable runs (so not being forced to reset 1000 times to get the perfect setup and rng so that my Hunt March + Mini-Herta with E0S0 supports can kill Nikador in time), efficiency matters. It's really that simple.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Lower_Comfortable_44",
                                                                                            "body": "No i mean 95% as in only thing you miss is like moc floor 12 and MAYBE one star of PF or AS. You can still do most of the endgame you call 70% with inefficient choices easily and as i said it will stay that way cause it is what hoyo's biggest target audiences are about. Changing that WILL instantly kill their games.\n\n\"Also, some people like *winning*\" let me be real with you. you win NOTHING in this game and the game goes actively AGAINTS it often if you define it as 3star Moc 12...  \nMoc 12 was made for the higher investment people at like E1S1 level or up, to begin with as those people found only floor 10 too easy to curb stomp back then.\n\nYour point at the start is funny cause i am a casual but also play all endgame content fine with mostly missing floor 12 of Moc which is cause as i said its a specific playground and i don't pull E1's or S1's pretty much at all.  \nIts also not a hard to do or anything like that.\n\nLastly the way you type makes it seem that personal enjoyment of winning is the big deal but that should just be kept to yourself and not used as a thing to be factual of \"efficiency\" when pulling a new 5 star just for floor 12 factually is a bad return in investment to begin with.(960 jades a year is what you get from that for using constantly around 28 800 at worst to get one five star.)",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ArtemisTheHarbinger",
                                                                                                    "body": "If you are a casual, then sorry, but you don't know what your are talking about.\n\nFirst thing first, MoC12 is NOT made for people with E1S1 at all. It's absolutely balanced with E0 in mind. Specifically, for newer-ish E0S0 characters, as long as they use synergistic team comps. Right now, it's balanced around TheHerta and Aglaea, so it's easy for them, doable with proper setups with 2.X characters, and very hard for 1.X characters (except for Jing Yuan, who somehow can't stop winning). Same for the other 2 modes. Everything that comes before the last floor is also so piss easy that it's not fun at all. MoC 11 is okay for casuals. But, for an invested player, this means that the \"95% of the game\" you mentioned is *a drag*. To me, it's as satisfying as farming calixes, and I feel no pride and no joy in \"being able to beat it\". Nor do I consider it a satisfying way to use my characters. And this applies to most endgame focused players.\n\nYou don't win anything by playing videogames in general, but we do it anyway, do we? I don't spend in the game, because I'm piss poor, so efficiency becomes the most important thing if I want to enjoy endgame. And it's a *mathematical fact* that trying to keep an older character afloat meta-wise is more expensive (and hence inefficient) in the long run. If the game were balanced differently (like in Genshin, for instance), Eidolons would actually be the most efficient choice, since they guarantee your character will be strong until basically EoS. But this is not the case in HSR due to powercreep. So if someone tells me that getting E2 Acheron was an efficient choice... well, it's not. It's a choice they made out of love, and I'm glad it works for them. But it's not efficient pull-wise, just like it's not efficient to get a dps on their rerun.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Lower_Comfortable_44",
                                                                                                            "body": "\"If you are a casual, then sorry, but you don't know what your are talking about.\"  \nOk there is 0 point going further since you are being an elitist piece of shit...   \nGood bye",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ArtemisTheHarbinger",
                                                                                                                    "body": "If you talk about MoC12 and its balancing while not doing it, you are are uninformed at best. It's not elitism, it's facts. You can't know about something you don't experience yourself. Case in point, you thought it was balanced around E1S1 characters and whale territory, which was never the case. But as you wish, good bye. There is 0 point further with someone who is not informed on the topic of the conversation.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "darkandfullofhodors",
                                                            "body": "I mean I agree about eidolons, I've never pulled a limited 5* eidolon. But whales will do it regardless of sense because they want the 0 cycle satisfaction, but if people can do that easily because enemies aren't keeping up with powercreep then the whales will start to back off too.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ArtemisTheHarbinger",
                                                                    "body": "You don't even need Eidolons to 0-cycle with new characters. There is already no point at all in getting them even for whales. Just throw away all of your account every six months at best (mind you, only with the supershilled characters!) and you are set. This is how worthless vertical investment is.\n\nAlso, a part of me wants the whales to back off. If the game starts crashing and burn, maybe hoyo will take better care of it.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pokebuzz123",
                                                            "body": ">Also, don't pull on \"filler\" characters. It's far more likely hoyo will forget they exist and never give them anything.\n\nWe don't have enough time to see it for 2.X characters, and even then we see that they are either on par or better than the shilled characters. Boothill and Rappa are performing well in their modes, while Firefly is their tier or dropping down. Fugue is also more of a support for them than Firefly. \n\nLess likely to get something, but, as it shows right now, it doesn't seem like being a \"filler\" character means much in the overall meta.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "ArtemisTheHarbinger",
                                                                    "body": "I'll copy and paste exactly what I answered someone else:\n\n\"They'll last less then the shilled characters, because hoyo will be less likely to give them support, while having a harder time during their shelf life because hoyo is too busy shilling someone else. Not worth the risk.\"\n\nIf their own creators sees them as second class characters and devote only one third of their efforts to them, why should I see them as something more than that?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "pokebuzz123",
                                                                            "body": "From a meta standpoint, they are still great characters to roll for. They aren't far off from the shilled or hyped unit they were right next to, and they still perform well. Why would you treat them as second class characters when they are meta at the end of the day with great scores? \n\nStory wise, yes, they will likely receive far less. Still, doesn't mean they won't be meta.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ArtemisTheHarbinger",
                                                                                    "body": "Because they ARE second class characters. Even from a meta standpoint, why would I pull for a character that is not the best? Especially if any \"buff\" or \"support\" they get is merely accidental and might not come at all? *It's not worth the risk*. Every character costs the same and lasts roughly the same, so I might as well get the one hoyo wants me to get. Why should I pull for Mydei, for instance, if Castorice is *right there* doing more damage, fully controllable, with full team utility, a global passive, animations that had 4 times more budget than his, and probably a shill-fest in content waiting for her? It doesn't matter if he's still good, she's *better* in his same role and comes right after him. Once you cut any emotional attachment, everything becomes very simple.\n\nFrom a story standpoint, it's not even worth talking about it. You said it yourself.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Strict-Bet5859",
                                            "body": "Exactly people saying character c powercreep character y \nWhen in reality the damage numbers is not that different but the issue is enemy hp/enemy shilling a character over the other and a character take advantage of the stage mechanic better than the other \nThat being said although anaxa did get buff it’s nothing compared to the amount of buffs another unit just got during beta \nI’m tired of hoyo playing favoritism ",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Alone-Swimmer",
                                            "body": "Most to be fair. I pulled a few just because I came back from 1.3 and found a few my dps from then being trash, though I am pulling castorice because I like her and everything about her even though I hear she is now with nerfs not a great pick ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Charlesiaw",
                                    "body": "bro thinks they take feed back from these posts..",
                                    "score": 95,
                                    "replies": [
                                        {
                                            "author": "janeshep",
                                            "body": "they take feedback from beta testers whose opinions I don't think are much different",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Foreign-Possible5499",
                                    "body": "Yep, HSR players cry about powercreep while begging for powercreep. Remember Herta who was obviously intended to be an AoE character and was inevitably going to get more support anyways, got doomed for doing mid ST damage.",
                                    "score": 93,
                                    "replies": [
                                        {
                                            "author": "nishikori_88",
                                            "body": "esp when it comes to their favorites :))",
                                            "score": 23,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "EmbarassedHistory1",
                                    "body": "I think youre a bit too quick to chastise the consumer base.  There is absolutely a desperation surrounding the power level of new characters but its manufactured by hoyo it doesnt come from nothing.  If the barrier for rewards wasnt ever increasing with hp inflation then people would be a lot more likely to value novelty over raw power in new units.  I can't comment on how gachas make money, but i err towards skepticism when someone tells me it has to be this way in order to be profitable.",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "author": "T8-TR",
                                            "body": "Considering Genshin has curbed powercreep for years and only just began, while still keeping plenty of old units super relevant, I'd say powercreep is only necessary when the dev deems it so. People obviously pull for mfs who are good but not great in Genshin, solely for the unit's appearance or story presence.\n\nZZZ is still too early to say for sure, but considering Zhu Yuan (a 1.0 Attack DPS in an Anomaly heavy meta) is still competitive and only Miyabi is head and shoulders above everyone (Evelyn comes close, but you have to try a lot harder to achieve what Miyabi does w/ ease), I'd say they're currently handling powercreep fairly well too.",
                                            "score": 42,
                                            "replies": [
                                                {
                                                    "author": "urusaitteba",
                                                    "body": "Powercreep comes in many shapes. It’s not just about raw numbers. For example Miyabi is hands down one of the easiest units to pilot with her sheer amount of iframes and her dash takes her halfway across the map.",
                                                    "score": 10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "July83",
                                                    "body": "It's just different ways to do live service unit design.\n\n\"Minimal power creep and sell units based on other factors\" and \"steady power creep and sell units based on power\" are both viable strategies for Gacha games, with lots of long running examples of each in the industry. It's more important for a game to be consistent in its approach and to be do it well than which one it chooses.",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Snoo-24768",
                                                    "body": "You're giving ZZZ too much slack bro, their powercreep problem is so much worse than early HSR. Ellen got powercrept by Miyabi harder than Acheron powercrept everyone.\n\nHSR powercreep only got worse when Acheron came out and that's in anniversary. ZZZ is easier to powercreep since it's like HI3.",
                                                    "score": 25,
                                                    "replies": [
                                                        {
                                                            "author": "T8-TR",
                                                            "body": "Again, we'll have to see, but so far, it's been one unit, and the subsequent units have all fallen back in line. Evelyn is only competitive w/ Miyabi if you can play her and utilize all her tech (vs button mashing on Miyabi), SAnby (a fan favourite character and the mascot of the game btw) is worse than Miyabi, and Hugo is looking to fall somewhere around SAnby, maybe even a bit behind her.\n\nMiyabi being broken, and therefore fucking annihiling not only Ice DPS characters, but ALL DPS characters, was a given.\n\nCompare this to DHIL, who people spoke as if it were new heights, then JL, who rivaled or pushed ahead of DHIL at E0, then into Acheron, who was a huge step up from those two, into FF, then into (Rappa) Feixiao. The fact that the only true casualty of ZZZ is Ellen (who I'm pretty sure had issues all the way back in 1.0) and everyone more or less sits around T0.5 is a win to me, at least until we have more units to work with.\n\nAnd I'm not saying powercreep will never come, btw. It'll always exist, but it really depends on how frequent it is and how bad it is. Again, everyone and their mom could see as far back as 1.0 that Miyabi was going to be a broken unit. These units just exist in gacha, whether we like it or not. And that's fine, as long as it's just those units and not those units and then every subsequent mfer there is. \n\nEDIT: Also, it's only easier to powercreep ZZZ if they opt to go the way of HI3rd. Powercreep is way easier in turn-based things than action-oriented games due to there just being a lot more skill expression in something like ZZZ to pull units back into the spotlight. In a turn-based game as simplistic as HSR, where we effectively have 2 buttons per turn w/ the occasional ult, at some point, MHY likely felt the need to sell XYZ until w/ numbers vs creativity. Unless you're doing no sustain zero cycles, there isn't much in the way of nail-biting skill expression here. Most units have gameplay that amounts to \"spam basic on turn\" or \"spam skill on turn\".",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Caerullean",
                                                            "body": "So far Miyabi fortunately does not seem like the norm, but yes, she should've never released at her current power level and ease of use.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Zeo_AkaiShuichi",
                                                                    "body": "shes an archon/emanator equivalent and the cash cow of the 1.x patch so i guess it was inevitable. maybe they could've held back but obviously they didnt.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Atoril",
                                                    "body": "Didnt genshin barelly had any endgame (and the little they had provided 0 challenge) for the majority of that time? \n\n\nIf yes then i would take powercreeping endgame over not having a endgame anytime lol. ",
                                                    "score": -5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "coolboy2984",
                                                    "body": "Genshin curbed powercreep by doing the exact opposite thing. They made every single thing mid as fuck compared to a lot of the release cast. There's a reason people always slot Fischl in over Yae, or Bennett/Xiangling/Xingqiu over anything else. They're straight up just better. Especially when they release 4 stars who entirely gimped without at least C2, and some even needing C6 just to compete.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "clocksy",
                                            "body": "Yeah, it feels very unfair to blame this on players just trying to keep up when the devs have always had the option to simply *not* inflate the HP of every endgame boss and make them more difficult most patches. If they kept endgame steady for 6 months or whatever then people would have been able to build teams based on other factors, simply from having favorite characters or playstyles. But the pressure is what causes people to feel like getting \"powercreep\" units to keep up. And if you invest in a unit that is mediocre to start with instead of just waiting for the next big powercreep unit then you're falling behind. \n\nThere are gachas that have a much slower rate of powercreep and more even balancing across the board. Hell you need not look beyond hoyo to find that Genshin for instance has been known to be rather flat for years compared to the trash cycle the HSR devs inflicted on everyone. Blaming the consumer is placing the blame in the wrong place.",
                                            "score": 43,
                                            "replies": []
                                        },
                                        {
                                            "author": "Lower_Comfortable_44",
                                            "body": "There is also the fact that rewards are pretty low for the highest end of hp enemies.  \nMoc 12 is the worst in this but only it gives 80(iirc) which is so little that no one should ever pull a full 5 star for it. And pf and as are mostly doable to full stars(if not then just one star missing)  \nMoc 12(11 to lesser degree) was also done more so as a playground for E1S1 or even a bit higher kinda stuff as those people before that were curb stomping floor 10 (i mean hell some E0S0 teams did as well)\n\nMain point being that no one should pull a 5star just to 3star moc 12. The same goes for PF and AS as the returns for it is not even close to worth (if you miss moc 12 for a full YEAR you lose 960 jades only... and if you miss all 3 last rewards its 2880 in a full year...)\n\nWhat i hope for Moc would be that they made the rewards the same format as the other 2 modes, where even one star gets you something and it wouldn't be 3 stars or nothing.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "leenaleecita",
                                    "body": "People would NOT be expecting that if the devs themselves didn't have a precedent of units becoming more and more obsolete with the massive HP inflation every single patch. People expect powercreep and simply hope that the unit they are pulling at least takes a little more time to be replaced in the future. A unit being underwhelming on release means they are more likely to be replaced faster in the future.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Lower_Comfortable_44",
                                            "body": "Why this mention of \"replace/replaced\"? Where is the need to do so in the first place, when Moc 12 is a E1S1(or even higher) kinda playground and was made to be that since the start of it and gives almost nothing for rewards either.(both AS and PF also feel easier than Moc)  \nI just don't get this self forced mentality. (that also plays right into the companies pockets)",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sharktos",
                                    "body": "I don't really mind how weak or strong a character is as long as they can clear endgame. Genshin did a wonderful job with that.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "001028",
                                    "body": "Except a gacha game can work without powercreep. Or rather, it can work with minimal levels of powercreep. You don't have to look further than Genshin to see that. Xingling and Bennet, four stars that were there since launch, are meta, everyone has them, and yet limited five stars still sell.\n\nI know it's not a 1:1 comparison because character kits are much more limited in HSR than in Genshin, considering HSR is turn based, but there's no reason HSR should have *this* much powercreep.\n\nThe thing about doomposting is (as someone who was asking for Anaxa to be buffed before v4) -- I'd have no issue with my favorite characters being average and having mid kits if that weren't a death sentence in endgame. But it is, because I know Hoyo won't stop the powercreep and HP inflation once and for all by making Anaxa (or any one unit) mid, it just means that said unit will be left behind. If I trusted Hoyo to plateau the powercreep for good (or slow down enough that an average-on-release unit had a shelf life of more than a mere few patches), I wouldn't mind my favorites being average. I just don't want them to stay behind while other units get exponentially more broken. We need consistency.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Deafnesss",
                            "body": "Yeah the buffs for both Castorice and Anaxa are a shame",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "HydroDragon612",
                                    "body": "Not gonna lie; castorice maybe, but Anaxa was lackluster. I dont want him to deal as much dmg as aglaea or mydei, but at least this way he wont fall behind in two patches.\n\nI'd say for the current state od the game he seems balanced",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Deafnesss",
                                            "body": "I think a buff was fine but no real reason to make him better than jade in every scenario. Feel like it'd be more healthy for them to both coexist and have their own situation where they are stronger.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Saiyan_Z",
                                                    "body": "Is he better than Jade? Therta/Jade/Tribbie almost go infinite without giving mobs a chance to attack in PF. The energy recharge is insane which keeps advancing Therta. I've auto'd 40k with two cycles to spare with this team on both sides of the current PF (with FuXuan as sustain). All E0S0 characters too.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Tigor-e",
                                                    "body": "He's still not better than Jade in her AoE niches, remember that you can't really even build him for damage in THerta teams so the multiiers increase are less relevant than you think",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FridgeFood",
                    "body": "800% mv with the extra skill when using skill, that's like Acheron single target level, there is no way he's struggling after this",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Alternative_Pen2318",
                    "body": "is he better for therta than e0s0 jade?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Scudman_Alpha",
                    "body": "My man's Erudition but does just as much if not more damage than Single Target Hunts.\n\nWhat the hell.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Yataro_Ibuza",
                    "body": "You should point out that talent 3 buff only applies to Anaxa's damage.\n\nUnless I read it wrong",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pokebuzz123",
                            "body": "You're right, it's only for him. I didn't specify it because it has always applied to him, so might as well keep the length short.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xDidddle",
                    "body": "Half of his DEF ignore should apply to ally. Currently he doesn't seem like a sub DPS at all. The only buff he brings to allies is 40% damage bonus.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Siana-chan",
                            "body": "Implanting weakness is hella strong too.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "janeshep",
                                    "body": "It's not. He doesn't shred RES, implanting weaknesses without shredding RES is just a random gimmick.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Siana-chan",
                                            "body": "Helps a lot in AS..",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ItsRainyNo",
            "body": "Nice buff overall\n\n1. Skill multiplier increase from 60x5 to 80x5, thats a 400% multiplier if ST\n\n2. Skill dmg bonus according to enemies in battlefield from 15% to 20%/enemy\n\n3. Ult multiplier increase from 150% to 200%\n\n4. Crit trace increase from 6,7% to 12%\n\n5. Dual dps trace dmg bonus buff from 30% to 40%\n\n6. Trace deff ignore 3%/stacks to 4%/stacks\n\nHoyo really prepared for hunt anaxa lol, with his lc its a 40% deff ignore/shred",
            "score": 164,
            "replies": [
                {
                    "author": "LefellowWeeb",
                    "body": "400% Multiplier in ST if you don't have 5 weaknesses on the enemy, else is 800% (cuz double skill at 5 weaknesses)",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Supermini555",
                            "body": "It's a straight up 33% damage increase to his entire kit, right?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "FreeGothitelle",
                                    "body": "More cos he gets more def shred and dmg bonus for more enemies on field",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Supermini555",
                                            "body": "Good for him then. Anaxa wanters will keep winning with each buff.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ItsRainyNo",
                            "body": "yeah",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BerrySomeimesTalks",
                    "body": "technically due to how the skill works it's 800%",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NiceMeanInBetween",
            "body": "DEF TRACE IS GONE EVERYONE CHEER",
            "score": 487,
            "replies": [
                {
                    "author": "Random_Bystander089",
                    "body": "Replaced with HP% sadly..\n\nEdit: seemed they made the Crit higher so pretty nice. Still wished they could've made it into an actually useful trace but oh well",
                    "score": 148,
                    "replies": [
                        {
                            "author": "Consistent_Stress946",
                            "body": "DOUBLE THE CRIT THO WE STILL WON",
                            "score": 222,
                            "replies": []
                        },
                        {
                            "author": "Luminous_Hope8256",
                            "body": "It's like the devs themselves lost on farming for better substats",
                            "score": 91,
                            "replies": []
                        },
                        {
                            "author": "GothicOwl13",
                            "body": "It's at least not the trace with the greatest weight anymore! That DEF trace had no meaning",
                            "score": 55,
                            "replies": []
                        },
                        {
                            "author": "Pure-Discussion-6504",
                            "body": "this is fine, better with tribbie",
                            "score": 89,
                            "replies": [
                                {
                                    "author": "G0ldsh0t",
                                    "body": "Wait no you’re actually correct.",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "FlounderNo7431",
                                    "body": "Yeah that’s what I thought. If Therta, 3b, Anaxa and sustain looks even better now",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jallalo23",
                            "body": "6% more crit. 2 extra rolls",
                            "score": 67,
                            "replies": []
                        },
                        {
                            "author": "CSTheng",
                            "body": "They at least allocated some of the weight to his Crit instead. That's still a win.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Ok_Marion",
                            "body": "But also extra crit at least!",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "pokebuzz123",
                            "body": "Most units in this game have defensive traces, so having them was inevitable",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Random_Bystander089",
                                    "body": "Mydei and Tribbie and Castorice recently had all useful traces but yeah, it's not too bad",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "luciluci5562",
                                            "body": "That's their perk being an HP scaler. Their defensive trace is also their offensive one as well.",
                                            "score": 60,
                                            "replies": [
                                                {
                                                    "author": "tanishajones",
                                                    "body": "Castorice has no HP trace, its 18% (!?) crit rate, 13 cdmg, 14 quantum…\n\nSome other characters with 3 busted traces: Herta, Rappa,  Acheron, Black Swan?\n\nTraces just feel like random bullshit lol, you could say Acheron and Herta are emanators, but Rappa’s a literal “who?” and some hoyo’s faves like FF and Feixiao still got the one defensive trace…\n\nALSO bonus special mention to my boy Blade, who’s an HP scaler but his traces are Crit, HP aaand… eff res.",
                                                    "score": 12,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Vyragami",
                                    "body": "Could've been Atk% or Spd if they don't want double crit traces to become the norm",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "apexodoggo",
                                            "body": "That’s still wholly beneficial, which Hoyo is evidently reluctant to do. Feixiao got her speed trace changed to defense, and basically any dps pre-Acheron (and most dps post-Acheron) have at least one lame stat trace.",
                                            "score": 18,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "StormSwampert",
                            "body": "The crit is higher now, though",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Mysterious-Credit471",
                            "body": "Half went to crit. GOOD ENOUGH WE WON",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "rokomotto",
                            "body": "Wish HP was crit damage instead, or even speed...",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "SsibalKiseki",
                            "body": "HP% makes him way better to pair with Tribbios\n\nAnd you’re gonna pair him in THerta team as a slave anyways",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jayakiroka",
            "body": "We thought it was Anaxover, but we are so Backxagoras.",
            "score": 184,
            "replies": []
        },
        {
            "author": "Competitive-Data-43",
            "body": "Yessss Anaxa buffs",
            "score": 86,
            "replies": []
        },
        {
            "author": "Diamann",
            "body": "Been a while since I saw straight up buffs.\n\nLooks like they're adamant on keeping his sub-DPS side on the same level. I wanted a team-wide RES down or at least DEF ignore to be applied to all allies, and more self ATK, but this looks okay.\n\nNow we wait for showcases... the numbers should visibly go up now I think.",
            "score": 116,
            "replies": [
                {
                    "author": "glium",
                    "body": "It's a straight-up over 40% damage increase on all his roles",
                    "score": 25,
                    "replies": [
                        {
                            "author": "i_will_let_you_know",
                            "body": "He does more damage overall but people wanted him to be more supportive so that he could fill the role of support dps (and possibly have a longer shelf life), not just subdps.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Tigor-e",
                                    "body": "Different people wanted different things for him",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Phase_Unicoder",
                                            "body": "This us why we need showcases because for him specifically like you said many people want him for different things. \n\nHave updated hypercarry video showcases and ones that pit him against Serval in the same scenarios to see how much of a premium replacement we're getting to those of us who want him for that specific thing.\n\nYou could be building him hypercarry but then the next person won't want to spend the same resources because his path opens him up to other distinct considerations for subbing.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ILoveMadamHerta",
                                    "body": "He still is a bit better at support, with 10% more damage and 7% more def shred + more damage himself which is great for teamwide DPS",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SummerBorn0207",
                    "body": "Just pull E1 and E2\n\n/s",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SexWithMamoru",
            "body": "Def went for HP which is uh\n\nBut more crit rate is nice!\n\nNice v4 for Anaxa~~goras~~",
            "score": 304,
            "replies": [
                {
                    "author": "shirodkuro",
                    "body": "90% of characters dont have 100% synergistic minor traces anyway, so this at least tracks, better than 3 whole traces into def anyway",
                    "score": 218,
                    "replies": [
                        {
                            "author": "TougherThanKnuckles",
                            "body": "Yeah it's almost always the case that characters have two offensive and one defensive minor trace. It got better in 2.X, but we still have things like Firefly having Effect RES and Feixiao having DEF.",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "kukiemanster",
                                    "body": "I cope that the reason FeiXiao has def trace is so that he \"works\" better for Aventurine's shield. Having higher def makes her shield \"take less\" damage, hence making shields more effective on her.\n\nFor firefly uhh, I don't know, since their sustains are healers and not shielders so hp is more appreciated?",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "ButterflySeeleSR",
                                            "body": "as for ff . she is destruction unit and gets taunt . effect res always good for her uptime against her cooldown",
                                            "score": 36,
                                            "replies": [
                                                {
                                                    "author": "kukiemanster",
                                                    "body": "Wait, FF on SAM giga mode can get CC'ed??",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "AshesandCinder",
                                                            "body": "She has 48% eff res at base with traces and talent active.",
                                                            "score": 15,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "apexodoggo",
                                            "body": "No it was definitely specifically a nerf (it didn’t matter because she was still incredibly fast and also the strongest dps in the game), it was just to bring her stat traces more in line with the rest of the cast.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "adistinctivesound",
                    "body": "Which is increased synergy with Tribbie, it's minuscule but I'll take what I can get",
                    "score": 112,
                    "replies": []
                },
                {
                    "author": "Ashamed_Adeptness_96",
                    "body": "For Tribbie I guess??",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "Luminous_Hope8256",
                    "body": "It's all ~~Robin's~~ Tribbie's world once again",
                    "score": 53,
                    "replies": [
                        {
                            "author": "0l_justlee",
                            "body": "Tribbie starts singing Robin's song when their Zone is active",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "RentLast",
                                    "body": "Tribbie and Robin casually throwing hands more than the DPS",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "baboon_ass_eater69",
                    "body": "Crit damage or attack trace would be better but better than nothing since now he has more crit rate and at least has little more synergy for Tribbie which was a good combo to begin with",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ILoveMadamHerta",
                    "body": "Actually, def being turned to HP is very nice as it slightly increases Tribbie's damage",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Msaleg",
            "body": "He got from 80 > 100% dmg bonus with 5 enemies on field now, so should help a bit more his AoE.\n\nHis ST 2 x skill now goes from 600 > 800 % of his atk which is pretty good, a 33% rise on his multipliers alone.\n\nThe def shred got from 21 > 28% which is a ~ 5% damage increase and should make quantum set even more viable on him (was already 2nd best with E1 Sunday).\n\nOverall he should be very solid if not meta, his ST damage was already around 80% of Fei in ST if Hunterkee calcs is anything to go by.\n\nNow should be almost as good.\n\nFor The Herta, a 10% extra damage bonus for the team.\n\nHe should outdps Jade now even against 5 targets with all the buffs.\n\nTl;dr: Straight up buffed, should be Fei Xiao level at ST, uncontested bis for The Herta.",
            "score": 262,
            "replies": [
                {
                    "author": "ExtensionFun7285",
                    "body": "Thats insane single target dmg while still being reallly good in aoe? Peak.",
                    "score": 100,
                    "replies": [
                        {
                            "author": "WakuWakuWa",
                            "body": "To be fair Fei's team is a FuA comp where she isnt the only damage dealer, she isn't really a hypercarry and her whole team contributes to damage. The reason why she is so good isnt because her single target damage is absolutely crazy (it is, but Boothill has quite a bit higher personal damage iirc) but because how well she can drive the whole FuA comp and how well she can divide damage between enemies making her good against AoE too, which makes her ceiling really high\n\nThat being said Anaxa looks great though, and he always looked good to me, even before the buff. A versatile character who is good in all 3 modes, what can I say, bounce type dmg really is the best kind of dmg",
                            "score": 142,
                            "replies": []
                        },
                        {
                            "author": "Sudden-Ad-307",
                            "body": "The only problem is that he needs to be in exclusively ST target, if there are 2 or 3 enemies on the field his ST falls of a cliff",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "ExtensionFun7285",
                                    "body": "Thats what my Therta is built for.",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Msaleg",
                            "body": "Yep, _very_ versatile although I would stick to ST/3 targets with his hypercarry teams.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "naocanyo",
                            "body": "I just figured out that comparing his ST damage with JY and Argenti would be brutal to them lol, in terms of ST damage, Anaxa can deal 800% at each turn, but JY's full 10 stacks of Lighting Lord is only 660% while Argenti's 180 cost ult is only 850%.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "minddetonator",
                    "body": "> He should outdps Jade now\n\nMy Jade hardly got usage and she's now powercrept. Oh joy.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Chromch",
                            "body": "She will always be usable in a pure fiction team with how often her follow up attacks trigger",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Sudoweedo",
                            "body": "Then why you crying if you didn't even use her lol",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "minddetonator",
                                    "body": "> hardly use\n\nvs\n\n> didn’t even use",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Secure-Line4760",
                            "body": "most f2p would either get tribbie or anaxa not both",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "davidam99",
                            "body": "As a regretful Sparkle owner, it could be worse.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "yuhattan",
                            "body": "Why not use them together? Especially since Anaxa will tend to skill twice, he can be a good driver for her too.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ScrewllumMainSoon",
                            "body": "Why don't you use her with Anaxa like what I'll do?? I dont have THerta but I'm more than happy to use Anaxa with Jade.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Telooor",
                    "body": "WE ARE SO BACK ✊",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Best_Refuse_6327",
            "body": "Wasn't expecting buffs so good thing they didn't completely neglect him. These are some decent changes. Now I'm waiting for the showcases.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Prior_Supermarket265",
            "body": "Yeah I'm keeping the dps build he deserves it",
            "score": 40,
            "replies": [
                {
                    "author": "crack_n_tea",
                    "body": "Agreed, hypercarry > subdps where he's just slotted into a therta slave role Argenti/serval could do just as well. Doesn't seem the best use of his kit",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Prior_Supermarket265",
                            "body": "I have Jade for Therta when I want to use him as main dps so yeah same.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Geoff_with_a_J",
                            "body": "pulling a limited 5 star to be an overkill upgrade over a very viable 4 star does seem wasteful",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prior_Supermarket265",
                    "body": "But why tf is his LC not buffed???",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "lezerman",
            "body": "Sizeable amount of buffs for his own damage",
            "score": 71,
            "replies": []
        },
        {
            "author": "d88w7wuedna1635",
            "body": "I'm not gonna pull for him or castrorice because tribbie took all my pulls, but GOD DAMNNNN! this sounds very good???? holy shit if he gets a rerun I'd definitely get him woah,\nso happy for y'all anaxa bros ❤️",
            "score": 18,
            "replies": []
        },
        {
            "author": "Aromatic-Tank-7289",
            "body": "Thanks goodness he's not only a Therta bot but also great at Hypercarry dps especially against single target bosses🥹🙏🏻. I don't have Therta, so I was afraid he'll be only good for her like JQ to Acheron.",
            "score": 37,
            "replies": []
        },
        {
            "author": "meowridan_ampora",
            "body": "Holy shit good riddance def traces",
            "score": 45,
            "replies": []
        },
        {
            "author": "56king56",
            "body": "Wait guys did we actually win?\n\nAm I coping or are these fantastic changes?",
            "score": 155,
            "replies": [
                {
                    "author": "Famous_Beautiful_228",
                    "body": "I don't know how big it actually is, but he straight up got buffed\n\nEdit: I assume it's pretty high. More 7% DEF ignore, 20% more scaling skill (with 5 hits means 100% more scaling),  50% more ult scaling, 5% to 25% DMG bonus on skill, and more 5%(?) CRIT rate",
                    "score": 98,
                    "replies": [
                        {
                            "author": "lezerman",
                            "body": "The multiplier buff is quite big, + def shred buff + bonus damage buff + ult buff.",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "Famous_Beautiful_228",
                                    "body": "Yeah, the skill scaling buffs means that he could do 800% ATK in one turn to one enemy",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "taejskskks",
                                            "body": "800? Where is it",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Famous_Beautiful_228",
                                                    "body": "He cast E 2 times when enemy has 5 weakness. So (80% × 5) × 2 = 800 in ST",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "ray314",
                                                            "body": "Didn't they change it to 5 weaknesses to trigger enhanced skill? Or was I hallucinating?",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Famous_Beautiful_228",
                                                                    "body": "Oh shit you're right, i always thought it was 7",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "taejskskks",
                                                            "body": "Rightt I forgot the x2. Thanks!",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Telooor",
                                                    "body": "It's 80% * 10 BCS of his bounce skill",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Secure-Network-578",
                                                    "body": "80% scaling per hit, 5 bounces, used twice.\n\n80x5x2=800",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ExtensionFun7285",
                                            "body": "Isnt that a whole feixiao ult?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Famous_Beautiful_228",
                                                    "body": "Scaling-wise, almost. Less 60% ATK. He's both hunt and erudition lol.\n\n\nEdit: i think i was wrong, he deals 100% MORE multipliers compare to Fei's ult in ST.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "astral_837",
                                                            "body": "feixiao's ult is only 700% ATK at max lol\n\n90*6 (6 individual hits) + 160 (final hit) = 700",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "Famous_Beautiful_228",
                                                                    "body": "Oh yeah i thought that 700% doesn't include her last hit, my bad.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "pbayne",
                                                            "body": "looking at multipliers in isolation is meaningless\n\nhe’s still no where close to feixiao in ST",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ExtensionFun7285",
                                                            "body": "Herta takes care of mobs and nukes and anaxa deals with single target, tribie buffs them and lingsha heals while providing energy and ults for herta and tribbie its gonna be so much fun and so broken.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "author": "LegendRedux2",
                                                                    "body": "Why put lingsha when u can slot rmc",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "NcRealms",
                                                            "body": "Not feixiao single target multiplier beaten by an erudition  🥹🥹🥹",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "euthan_asian",
                                                                    "body": "You can't really compare since she's attacking through the whole fight with follow ups and he won't be. I'd imagine they'd be pretty equal over the course of an entire fight with their correct teams though.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Due_Calligrapher_754",
                                            "body": "Assuming there are 5 enemies right?  \nAlso makes me think how awesome he would be with Sunday",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Secure-Network-578",
                                                    "body": "No, assuming there is one enemy. It's a bounce skill.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "Due_Calligrapher_754",
                                                            "body": "oh dumb me, but that in itself is very strong",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Luminous_Hope8256",
                    "body": "His ST dmg is much more terrifying now",
                    "score": 28,
                    "replies": [
                        {
                            "author": "PaulOwnzU",
                            "body": "I love how he is just both an erudition but also works great as a hunt",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "waktag",
                                    "body": "I mean aren't that just literally every limited Erudition characters minus Jade?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "PaulOwnzU",
                                            "body": "Eh argenti needs aoe to build up energy (but loves is his t2 ult kills the mini mobs to focus on boss)\n\nJing doesn't have a preference I guess, does good in both\n\nI dont know rappas kit lmao, i think she likes aoe to get charges fast?\n\nAnd herta also likes hitting alot of enemies for energy, but definitely still good single target\n\nAnaxa feels like he just works perfectly fine with both, no need to hit a bunch of enemies to ramp up",
                                            "score": 31,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Vyragami",
                    "body": "This is basically all buffs, zero nerf or rework, straight up numbers increase. So yes.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "dylandys",
            "body": "big for anaxagoras worshippers (me)",
            "score": 50,
            "replies": []
        },
        {
            "author": "UltraYZU",
            "body": "ANAXA BROS WE WON",
            "score": 88,
            "replies": [
                {
                    "author": "Reptilaseviper",
                    "body": "Now eidolon 1 & 2 buffs for v5 please 🛐",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Brilliant-Iron-3862",
                    "body": "Im so happy 😊",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "deerstop",
                    "body": "Anaxagoras!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PowerCore24",
            "body": "800% MV skill is diabolical",
            "score": 66,
            "replies": [
                {
                    "author": "itsarches",
                    "body": "For real. I was thinking they'd go the route of self-buffs cus his previous 600% MV is already pretty high, but now his skill has more MV than Feixiao's ult lmfao. With Sunday/Bronya it's 1600% MV every turn, it's mental.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Expert-Conflict8470",
            "body": "These buffs are massive, 33% multiplier increase alone, along with the other buffs we’re looking at 40%+ final damage increase from this. It’s huge.",
            "score": 22,
            "replies": [
                {
                    "author": "Litastpar",
                    "body": "You know what's else is huge?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "saturnian_catboy",
                            "body": "Doctor Ratio?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Chromch",
            "body": "Please don't nerf him he might be perfect now, more buffs are fine tho :)",
            "score": 8,
            "replies": []
        },
        {
            "author": "Lacirev",
            "body": "omg they FINALLY got rid of the def traces lmao",
            "score": 48,
            "replies": [
                {
                    "author": "Lawliette007",
                    "body": "And gave hp. Kinda the same thing. But more crit.rate is good.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ArtemisTheHarbinger",
                            "body": "Tribbie synergy is better now, I guess?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "janeshep",
                                    "body": "Just barely",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Luminous_Hope8256",
            "body": "Holy, hell, the amount of buffs AnaxaGOATras just received...",
            "score": 41,
            "replies": []
        },
        {
            "author": "Distinct_Surprise_40",
            "body": "800% MULTIPLIER ON THE SKILL IS FUCKING NASTY! I'm praying for no nerfs. What is this, like, a 33% increase to EVERYTHING across the board? And that's on top of an additional 5.3% crit rate from traces? ANAXABROS WE ATE GOOD AS HELL!",
            "score": 39,
            "replies": [
                {
                    "author": "PaulOwnzU",
                    "body": "He was already hitting like 200k a skill (so 400k with double up) with a really good team, this is now just going to be so damn fun\n\n  \nPlease anaxa save me from the fact i have no aoe lightning quantum or ice dps, this new wave of enemies is killing me",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Descendo2",
                            "body": "Tbh most showcases were with a cracked moc tribulance for him",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "agus_taee",
            "body": "great! now do something to his stun and animations PLEASE im giving you my newborn child PLEASE PLEASE PLEASE PLEASE",
            "score": 47,
            "replies": [
                {
                    "author": "Alternative_Race4516",
                    "body": "Wtf bruh.. even though it's a joke.. it's just ☠️",
                    "score": -32,
                    "replies": [
                        {
                            "author": "femboy-kitten",
                            "body": "teacher, you didn't give us homework ahh energy",
                            "score": 31,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PCBS01",
            "body": "THEY BUFFED HIS MODIFIERS\n\nTHEY BUFFED HIS ULT EFFECT? MAYBE?\n\nTHEY GOT RID OF HALF THOSE USELESS DEFENSE TRACES\n\nTHEY BUFFED HIS ERU PARTY MEMBER DMG BUFF\n\nTHEY BUFFED HIS TRACE 3 (they changed it back to the og trace 3? lmao)\n\n  \nWE WON",
            "score": 22,
            "replies": []
        },
        {
            "author": "Tintinmdm",
            "body": "I'm happy to skip Cascas and get Anaxa now.",
            "score": 23,
            "replies": []
        },
        {
            "author": "ajmiam",
            "body": "A flat-out 1/3 increase to his Skill and Ult multipliers?  This is not the direction I thought they'd go...I thought they'd improve his Sub-DPS capabilities and nerf his single-target damage because, oops, their so-called \"Erudition\" unit is basically Feixiao 2.0 against a single enemy.  Overall, a very pleasant surprise, given that I plan to use him in both roles.",
            "score": 15,
            "replies": []
        },
        {
            "author": "SpecialistSteppe",
            "body": "ANAXA IS SO BACK\nthe way I was ready to roll my eyes at the supposed ‘no changes’ but my man got buffed",
            "score": 13,
            "replies": []
        },
        {
            "author": "Talukita",
            "body": "* DEF trace changed into HP trace and move to tier 3, switch place with crit chance so he gains 6% crit.\n* Ult 150% mv into 200% mv\n* 60% mv x5 skill / 300% into 80% x5 / 400%. x1.33 damage buff. Also 15% damage per target into 20%\n* 30% damage buff aura into 40%\n* 3% def shred per weakness (21%) into 4% / 28%.\n\nSo yeah big damage buff all around from what I see, he should do solid damage both as hypercarry and sub now.",
            "score": 13,
            "replies": []
        },
        {
            "author": "stxrrynights240",
            "body": "FINALLY THE DEF TRACES ARE GONE",
            "score": 27,
            "replies": [
                {
                    "author": "iminsideluochacoffin",
                    "body": "its hp now",
                    "score": -1,
                    "replies": [
                        {
                            "author": "D00KIECAT",
                            "body": "and 5.3 extra CR 🔥🔥",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "stxrrynights240",
                            "body": "I mean at least he got more crit rate traces ig.\n\n  \nAlso based af username and flair",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Mikauren",
                            "body": "works for tribbie who he pairs nicely with anyways",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "alchymist78",
            "body": "Based on his much needed buffs. What are his best relics and planar?  Scholar is still viable ?",
            "score": 4,
            "replies": [
                {
                    "author": "Accomplished-Mix-136",
                    "body": "For now seems like same as herta's",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nightfire27",
            "body": "I’m curious about how well he might run with Himeko tbh, could be the slight boost my Eru PF team needs…\n\n…maybe",
            "score": 4,
            "replies": []
        },
        {
            "author": "Key-Protection-6516",
            "body": "Now please, buff his animations. Is like they gave him the bare \"ok\" in that department.",
            "score": 41,
            "replies": [
                {
                    "author": "agus_taee",
                    "body": "yeah at least a different animation for his enhanced skill",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "DaChosens1",
                    "body": "subjective but yes at least diff animation for secondary additional skill",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "LivesforOnlyOne",
                    "body": "His animations are great, especially his ult. He just doesn't compare to Castorice, but nobody really does. I can understand wanting more for a character you like though lol",
                    "score": 29,
                    "replies": [
                        {
                            "author": "JunQo",
                            "body": "They legit just replay his skill animation for an additional proc without any transition and he just awkwardly jerks back to repeat the animation. This isn't great.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "LivesforOnlyOne",
                                    "body": "Ah, so you would prefer he have a base skill animation, then a 3 stage animation for his extra skill proc? So Skill1 animation>transition animation>Skill 2 echo animation. Would he need two different transition animations for whether he's starting with a skill or a basic?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "i_will_let_you_know",
                                            "body": "I think just having a different animation for the second skill would be fine.",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "fuyukkun_",
                                    "body": "The thing is that why would they make a new animation when its exactly the same skill being used again. Mydei gets a new animation because his first enhanced and second enhanced skill are treated as two different things with two completely different names, same as everyone else with different animations.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Sharktos",
                                            "body": "It's more like, why would they not?",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PuzzleheadedSkill605",
                    "body": "A smoother transition for when he uses his skill again would be nice",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Avion49",
                    "body": "thats subjetive",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheCobraSlayer",
            "body": "I wasn't expecting him to get buffed across the board actually, wow, these seem like fantastic changes",
            "score": 15,
            "replies": []
        },
        {
            "author": "DucoLamia",
            "body": "Thoughts? I'm going all in E1S1. I feel way more confident with his base kit.\n\n\n>Def% traces finally got removed and replaced with a standardized DPS set (most DPS units have some minor HP/Def as a buffer--this is not an issue considering units like Feixiao clear regardless lol).\n\n>Multipliers are solid. His ST  DMG is actually really great now and even his Erudition capabilities while not being The Herta level is still going to be solid unit. That's all I want. I don't need every unit to be better than the last. Just give them something to work with.\n\n>Quantum is now more viable on him but his other sets now retain a bit more value. Due to not needing to worry about weaknesses anyways, he can pretty much take advantage of the most recent sets with ease (other than Poet of course). \n\n\nGood changes overall! I like this. \n\n\nEdit: Grammar/Spelling",
            "score": 13,
            "replies": [
                {
                    "author": "KingAlucard7",
                    "body": "Really Banger of a character. Can brute force all 3 endgame modes. Is great in both single target and AoE! Very strong unit.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "lell-ia",
            "body": "Decent buffs across the board, and this time it's an actual multiplier buff, at the very least it's finally something to eat. \n\nI wish they did something to his walmart imprisonment CC and ass Eidolons though.",
            "score": 9,
            "replies": []
        },
        {
            "author": "haechsuns",
            "body": "ANAXA NATION WE FUCKING WON",
            "score": 11,
            "replies": []
        },
        {
            "author": "Beier88",
            "body": "Let's see if there is any nerf hammer in v5, looks pretty good so far.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AKENO_UNDER_BLADE",
            "body": "pleasantly surprised with the changes but ill wait to see how it actually is in the showcases",
            "score": 3,
            "replies": []
        },
        {
            "author": "gottadash19",
            "body": "Honestly I've seen some people talk about his T3 being lackluster, but it actually seems extremely good, especially for a stat that the majority of characters can only get conditionally or higher vertical investment!\n\n\n----\n\n\n\n28% def ignore at full/7 stacks (and a conservative 20% at 5 stacks which is easy to maintain the whole battle). If you use his signature lc (+ ~~6%~~ 12%) and quantum set (+20%) that's a total of ~~54%~~ 60% def ignore. That doesn't even consider other ways you can get def ignore (or def pen) from teammates too!\n\n\nLike if Hylisens is a good DoT applier, you could even pair them together and have Anaxa use the Prisoner set for +6-18% def ignore and 12% attack for instance. Or just use Black Swan (who can also use the Penacony 2 set to boost Anaxa's wind damage) while using Prisoner.\n\n\nHis def ignore not being tied into certain attacks or is highly conditional(lower stacks still grants def ignore at lower amounts vs not activating entirely) is a huge bonus. It's on his base kit and frankly if it's something you care about he can use any of the 3 relic sets with def ignore and can drop his signature for the event LC with no problems.\n\n\nFor comparison, other characters with self defense ignore: \n* Black Swan - Talent (20% at 7 stacks if arcana)\n* Boothill - E1 (16%)\n* Firefly - E1(15%)\n* Ruan Mei - E1 (20% def ignore when field is active for all)\n* Rappa - E1 (15% in post ult state)\n\n\n+ a handful of others but they're all E2 or higher.\n\n\nWith their signature, Ratio (for followup), Fei Xiao (for ultimate), JingLiu (at 3 stacks), Jade (for ult+followup after a BA), Boothill (for break damage), and Black Swan (for DoT damage via Prophet stacks- only can get full 4 stacks with attacks against enemies afflicted with all 4 DoT types) have def ignore... but as you can see they're all more conditional (and requires getting the lightcone).\n\n\nOnly Black Swan exceeds this level of def ignore (with base kit + lc) while Jade and Ratio/Fei Xiao (on specific relics) come close to Anaxa. Def ignore scales well too by stacking it.\n\n\nI dunno just seems like a trace people are sleeping on is all!",
            "score": 3,
            "replies": [
                {
                    "author": "Duckfaith_",
                    "body": "His signature stacks twice for 12% Def ignore.\n\n\nCan also include his E1 16% ignore since you do compare early eidolons for other characters as well",
                    "score": 3,
                    "replies": [
                        {
                            "author": "gottadash19",
                            "body": "Oh forgot that the LC bonuses stack! Thank you for the clarification. \n\n\nAnd I was mostly using his E0 as a comparison to other characters E0S0/E0S1/E1S0 investment levels- that is to show that he can stack *a lot* more defense ignore at a lower investment that basically everyone *except* BS (which actually seems to be one of his niches in fact).... but definitely should include those calcs!\n\n\nRelic-wise at E1S1 he has for def ignore:\n* 56% (no def ignore relic set like Wind set)\n* 66-76% (1-2 stacks quantum set)\n* 62-74% (1-3 stacks prisoner set + 12% attack)\n* 56% gen def ignore + 10% weakness break def ignore + 15% superbreak def ignore (if you want to run a break Anaxa with Iron Cavalry)\n\n\nHe also enables the Forge Set for any teammate too which I think I maybe saw one showcase with V1 Anaxa in a break team using? \n\n\nDefinitely want to see more varied teams with him (both in general and especially now)! Ratio, Boothill Himeko, and Rappa could all end up wanting him as a BiS teammate (especially the last 3 against non-element weak enemies). Also want to see how anti-synergistic he truly is with characters like Mydei or Yunli/Clara who he seems to be worst for (especially if Phainon ends up being like Yunli/Clara like spme leakers have said).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sunny98989",
            "body": "OMG they've changed that trash DEF stat. That's a W.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Milky_Finger",
            "body": "Tempted to get him over Castorice as he feels more complete now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ToughMongoose6847",
            "body": "Anaxa mains: Today, is a happy day 😭",
            "score": 3,
            "replies": []
        },
        {
            "author": "KazuSatou",
            "body": "When i said i want trace change i did not mean like this.  \nOverall a buff.",
            "score": 14,
            "replies": []
        },
        {
            "author": "KingAlucard7",
            "body": "DPS Anaxa is SOOO BACK",
            "score": 12,
            "replies": []
        },
        {
            "author": "minmelgi",
            "body": "let's fucking gooo",
            "score": 6,
            "replies": []
        },
        {
            "author": "Sugar_Spino023",
            "body": "That better hoyo know your place for the newest best unit, now I better see global buff for him V5",
            "score": 6,
            "replies": []
        },
        {
            "author": "CountThick8532",
            "body": "Honestly, not bad. I'm going to play him as dps but his support capabilities are definitely more decent for therta",
            "score": 8,
            "replies": []
        },
        {
            "author": "zrn7441",
            "body": "in single target scenarios, that skill is doing a whopping 800% multiplier against one enemy, literally higher than feixiao lol",
            "score": 9,
            "replies": [
                {
                    "author": "PCBS01",
                    "body": "almost as high, but he can abuse the fuck out of sunday so probably more lol",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "pbayne",
                    "body": "but multipliers in a vacuum are meaningless\n\nhes no where even close to feixiao in ST since his base stats are still pretty low and he has no innate self attack buffs. Hes definitely better in ST than other eruditions but how often hes in scenarios to use that is another story.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Phase_Unicoder",
                            "body": "With Elites and higher it can be often enough in the endgame or boss battles, if he's with Herta the trash gets cleared out quick. With a support or two you can make up some of the baseline well enough. \n\nIt's actually a good thing if he doesn't particularly out damage Fox wife himself in every scenario because he is Erudition but in the context of the team he'll still at least have Herta coming in with good damage at ST adding to his.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "i_will_let_you_know",
                            "body": "Well it means he scales better with attack buffs like Robin.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mt-everer",
            "body": "Summary of changes:\n\nSkill MV per bounce changed from 60% to 80%  \nEach enemy damage buff on skill changed from 15% per stack to 20% per stack  \nUlt MV changed from 150% to 200%  \n2+ Erudition damage bonus buff changed from 30% to 40%  \nDef traces changed to crit chance traces, so 6.7% crit rate to 12% crit rate  \nCrit rate traces changed to hp traces, 10% hp (new)  \nT3 trace changed from 3% personal defense ignore per enemy weakness to 4% (21% max to 28% max)",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fit-Application-1",
            "body": "YAYYYYYYY ANAXA BUFFS WE TAKE IT \n\nI forgot v4 was today 😂😭",
            "score": 4,
            "replies": []
        },
        {
            "author": "snakecake5697",
            "body": "Himeko buff",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kamirukuken",
            "body": "Pretty good buffs, no?",
            "score": 3,
            "replies": []
        },
        {
            "author": "bivampirical",
            "body": "LETS GOOOOOOOO",
            "score": 3,
            "replies": [
                {
                    "author": "Micakuh",
                    "body": "the fact this got downvoted once is crazy to me, like how bitter can one be to go through the thread and downvote people being excited their character got buffed lmao. I put it into the positive again at least.\n\nAnd lastly: LET'S FCKING GOOOOOOOOOOOOOOO HE DESERVED THESE BUFFS",
                    "score": 5,
                    "replies": [
                        {
                            "author": "bivampirical",
                            "body": "YEAHHHHHHH 💪💪💪 (thanks for your support fellow anaxa truther 🙏)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Knight_Steve_",
            "body": "We got buffs",
            "score": 5,
            "replies": []
        },
        {
            "author": "Keeper919",
            "body": "That is quite a sizable buff to pretty much everything on his kit which is a bit more than I was expecting him to be buffed. \n\nThat’s good for him and now he fits in with the expected powercreep that new units in this game strive for.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vatality",
            "body": "Let me get this straight. Anaxa went from barely being as good as Jade to now being just as good as Jade? Am I missing something from the slight increase in numbers? \n\nOtherwise, his kit still suffers from the same issues that were brought up before, mainly his ultimate and follow-up?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Thatoneminer",
            "body": "lowkey he kinda feels like a char who wll be good at everything but not the best at it, which is really good pull value btw. u can get anaxa for main dps, later use him as sub dps, or as a nice buffer, or as a debuffer for new break characters etc he is usefull in LOTS of things, which makes me very hyped.   \nim planning to use him in rappa teams aswell as hypercarry and ofcourse herta",
            "score": 2,
            "replies": []
        },
        {
            "author": "Smol_Cheesecake",
            "body": "Is this a buff? In this economy?",
            "score": 9,
            "replies": []
        },
        {
            "author": "baboon_ass_eater69",
            "body": "So in The Herta/Tribbie team should I build him with The Herta's bis set too?",
            "score": 3,
            "replies": [
                {
                    "author": "kel584",
                    "body": "He wants either scholar or wind. From my testing (obv before V4) there wasn't that much of a difference.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Lawliette007",
                    "body": "Build him on eagle set and super fast. He's the first and only character who can completely use that set and it's also his BiS for the herta team.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pop-girlies",
            "body": "He survived!",
            "score": 4,
            "replies": []
        },
        {
            "author": "jeromekelvin",
            "body": "Basically just a plain numbers buff across the board huh. I think they can afford to bump the DMG buff a bit more since it's already a saturated stat on Therta anyway but otherwise I guess it looks fine\n\nI was hoping for a Trace change to give him debuffing capabilities but it seems it's not in the cards",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheFreshCoconut",
            "body": "The HP trace is not appreciated but otherwise a decent W",
            "score": 3,
            "replies": [
                {
                    "author": "crimsonhawk75",
                    "body": "Tribbie appreciates it if you run her with him.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "TenthOfChaos",
                            "body": "I would but my Tribbie is wind and has a gun for some reason",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Illustrious_Cheek461",
                                    "body": "Lmao Anaxa 0.5",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheFreshCoconut",
                            "body": "True if you run him with tribbie it’s solid. It’s something I half expected them to do but can’t get everything ig.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "raexi",
            "body": "Oh tg they got rid of the def trace",
            "score": 2,
            "replies": []
        },
        {
            "author": "StrangeTour9412",
            "body": "ANAXAGOAT",
            "score": 4,
            "replies": []
        },
        {
            "author": "obi2606",
            "body": "overall 30-40% total dmg buff, damn that's really something",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radinax",
            "body": "Anaxa wanters won today!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Flat-Series-1169",
            "body": "overall great for people who want to use him as hypercarry but i still think he's not a worth upgrade for the herta teams (instead of pulling him just pull eidolons for herta and tribbie, they're gonna be way more of an upgrade than anaxa, specially if you have lingsha and jade)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rixuxu",
            "body": "his T2 buff is nice but i want more ,also T3 kinda useless and wth is his E6 ? lol",
            "score": 2,
            "replies": [
                {
                    "author": "i_will_let_you_know",
                    "body": "Useless? It gives Anaxa 28% def ignore with ramp up time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bagel-Shotgun",
            "body": "WHO CALLED IT. SOME1 SAID HIS DEF WLD CHANGE TO HP 😭😭😭",
            "score": 2,
            "replies": [
                {
                    "author": "Fresh-Maize1936",
                    "body": "Not everyone, but many dps have this useless hp/def.\nFeixiao, for example. So it's okay.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "merakikis",
            "body": "HE REALLY GOT BUFFED?? I can't believe my eyes oh my god in this economy.. I used to dream of times like theze\n\nthe hp% trace switch is actually sending me though you know damn well it's so easy to make it spd or atk% that's crazy 😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "ibeeeeeechan",
            "body": "HOLY W FOR US ANAXA FANS",
            "score": 2,
            "replies": []
        },
        {
            "author": "LegendRedux2",
            "body": "Still slow as fuck",
            "score": 2,
            "replies": []
        },
        {
            "author": "a-millenial-kid",
            "body": "W across the board. Even the hp% trace is now useful if you play him with Tribbie.\nCan't wait to see the new gameplay 🙏",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Steak_165",
            "body": "Yes keep buffing my king xD",
            "score": 2,
            "replies": []
        },
        {
            "author": "greengreepes",
            "body": "Yipeeeee moment",
            "score": 4,
            "replies": []
        },
        {
            "author": "b5437713",
            "body": "I keep hearing praise about his ST but how is he for AoE being an Erudition unit and all? \n\nI'm glad for buffs but I already have Feixiao and I'm not sure I'll ever pull Herta so if I were to pull him it would be as an AoE hyper carry in wind but if he's basically just a Hunt unit with an Erudition wrapper/Therta DPS I can't really justify pulling him...",
            "score": 1,
            "replies": [
                {
                    "author": "Warm_Professor174",
                    "body": "Honestly if thats the case you shouldnt pull him, imo even with these buffs he still doent seem to be properly future proof, increasing his multipliers is just one way to delay him getting powercrept when the main issue is his kit design being really bad. If you dont have any interest in him now i doubt you'll find any uses for this guy anywhere else, even if you do decide to pull him and he'll just be a bench warmer since you're already playing feixiao and arent really interested with therta.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Lyar99",
                    "body": "there is really no point for you to pull him and I wouldn't if I were in your shoes, since you don't intent to pull Therta + you already have another wind dps in Feixiao.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fresh-Maize1936",
                    "body": "Sooner or later, you will have excellent dps of any element, and according to this logic, you will generally be allowed to skip everyone and not play the game.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "b5437713",
                            "body": "That's...quite the interpretation of my comment. \n\nI simply have a preference for filling missing roles on my account before pulling for units that overlap in roles. Since I still enjoy using Feixiao atm I don't see a reason to pull another ST DPS for the element rn hence my curiosity about his AoE. I can't speak for you or others but personally I want to get good use out the units I pull before moving on to something new.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fresh-Maize1936",
                                    "body": "My comment was that in this case, you should just pull your waifu and enjoy the plot.\nWhat justification can we talk about if sooner or later you will have characters of all the elements? The logical question is why are you playing this game at all. It's a game about characters, so even the damage will eventually lose its meaning.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KF-Sigurd",
            "body": "THerta gets even stronger.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Arkride212",
            "body": "Idk whats going on but everyone seems to be happy so..\n\nLETS GOOO!! HUGE W!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Key-Protection-6516",
            "body": "Oh, so that leakers can leak when is not Sunday or Castorice related. Good to know.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SayoHina320",
            "body": "Truly the process of elimination",
            "score": 1,
            "replies": []
        },
        {
            "author": "paradoxaxe",
            "body": "Ig the T2 talent still either give him 140 CDMG or Buff to Erudition, well at least the def trace is gone",
            "score": 1,
            "replies": []
        },
        {
            "author": "VTKajin",
            "body": "Those are some big numbers wow",
            "score": 1,
            "replies": []
        },
        {
            "author": "Avion49",
            "body": "LETS GO!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "scubagh0st",
            "body": "pretty damn good!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForWhatMan",
            "body": "now that's one hell of a buff",
            "score": 1,
            "replies": []
        },
        {
            "author": "kamanami",
            "body": "finetuned",
            "score": 1,
            "replies": []
        },
        {
            "author": "Average-GamerGuy",
            "body": "DEFENSE TRACE IS GONE! HE IS SAVED!!!111!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clarkey7163",
            "body": "This is the first patch where I think he’s finally earned the erudition path label lol\n\nWatching a therta/anaxa clear it’s easier to see what his role is now. With AoE attackers like tribbie and Lingsha he basically allows you to deal group toughness chip damage to any enemies \n\nThat + buffing therta (and the others), acting as a battery for interpretation stacks and dealing decent damage on his own I’m now defs gonna be pulling for him",
            "score": 1,
            "replies": [
                {
                    "author": "Saiyan_Z",
                    "body": "Toughness breaking isn't that useful unless you're struggling to survive or are playing a superbreak team. Your team gets less energy since enemies hit your characters less.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snoo-11776",
            "body": "Thats quite a high buff on numbers no? Im still going for Castorice... Don't blame me I only have THerta as a good dps.",
            "score": 1,
            "replies": [
                {
                    "author": "Equivalent_Scheme475",
                    "body": "Everyone should pull what they like!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Snoo-11776",
                            "body": "True, thats a line I always say!! 😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Renj13",
            "body": "They basically multiplied all his numbers by 1.33",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anto4ask",
            "body": "oooh now with 28 def shred old quantum looks even tastier, this one buff increased this combos damage by like 10 percent extra final damage. Massive actually",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sharktos",
            "body": "Nice buffs, as someone who wants to run him as main DPS, what would be his best team at the moment?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeeTiX",
            "body": "So he becomes really good ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Micakuh",
            "body": "Now Hoyo, do NOT nerf him again in V5 and we're good",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raitlo",
            "body": "His T2 gives him buff depend on number of eruditon char on team. If he has more than 2, will he get the 140 cdmg or only 40% dmg boost?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Readalie",
            "body": "Oooooh. I'm very tempted now. I've been building up Serval as a battery for BIG HERTA but her speed set would probably work fine for him for temporary relics... hm....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kaolyte",
            "body": "FINALLY! Now buff his animations",
            "score": 1,
            "replies": []
        },
        {
            "author": "BloatedBalloons",
            "body": "This is not enough! He's so mid omg! How the hell they release a mid char in 3.x! (I hope hoyo read this and add another buff to him, trust)",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_l-o-a-n",
            "body": "I'm pretty happy if they kept this (ill take more buff if they want to give them tho. But this is fine in the hope of it not getting nerfed). Personally I was wanting him as a sub dps rather then a main to play his weakness infl. Abilities in some varying team comps for fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seblakspicy",
            "body": "chat is this good",
            "score": 0,
            "replies": [
                {
                    "author": "D00KIECAT",
                    "body": "this is great :3",
                    "score": 5,
                    "replies": [
                        {
                            "author": "seblakspicy",
                            "body": "YIPPEEEEEEEE!!!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "luiszayel",
            "body": "tbh now he really seems like hes meant to be a hypercarry, so im happy as a husbando main, but sad that my herta still has to wait for a better erudition partner",
            "score": 0,
            "replies": [
                {
                    "author": "Tarean_YiMO",
                    "body": "this is buff to both Therta slavestyle and Hypercarry wdym? Technically a bigger buff to therta slave cause the damage increase with 2+ erudition went from 30% to 40% whereas 1 erudition is still 140% cd",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Tigor-e",
                            "body": "His multipliers literally do not matter for Herta Slave playstyle, they could've been cut in half and it would barely have made a dent. His damage \\*only\\* matters as a Hypercarry",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Superb_Highlight_681",
                    "body": "??? hes literally bis for herta lol",
                    "score": 11,
                    "replies": [
                        {
                            "author": "zatn",
                            "body": "The point is he's clearly still not good enough for herta that you'd pull him over e1 tribbie. Or go for e2 herta.\n\nHerta has so many ways to improve for future harmony/erudition/sustainers that I don't blame anyone for skipping current anaxa when he doesn't really bring anything new to the table.\n\nHe offers some def shred, slightly more damage, less ults, and fairly ordinary animations.\n\nI bet a speedy serval comp with e1 tribbie clears as fast as an e0s0 anaxa comp.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Phase_Unicoder",
                                    "body": "At this point I want to see comparisons now with a well built Serval vs a well built Anaxa for their roles in a herta team against brute forcing content and favourable environments just to see the extent of how much of a premium this is getting me if I had to replace my Serval rolling all the jades I get at that point.\n\nThat would actually give me a better idea where I will stand on this matter in a more personal capacity.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "losersapphic",
            "body": "SLAYYYYY",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoekoX16",
            "body": "CELEBRATING CHEERING STANDING AT THE EDGE OF THE MOUNTAINS",
            "score": 1,
            "replies": []
        },
        {
            "author": "shsluckymushroom",
            "body": "BUFFS WE WON!!! YOOOOOO",
            "score": 2,
            "replies": []
        },
        {
            "author": "Key-Protection-6516",
            "body": "It feels that now that Castorice is done, they can work on him. Good. Those are nice, needed buffs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thefluffyburrito",
            "body": "I'm still not convinced of Anaxa's worth in a Herta team where my Herta and Tribbie are both already slow and Anaxa would be a third slow member.",
            "score": -2,
            "replies": [
                {
                    "author": "magicarnival",
                    "body": "Just build him fast and slap eagle set on him 🦅💫",
                    "score": 10,
                    "replies": [
                        {
                            "author": "thefluffyburrito",
                            "body": "His base speed is pretty slow though.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "magicarnival",
                                    "body": "Sunday is even slower and mine has 160 speed. The grind never stops 💪",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Caminn",
                                            "body": "Sunday only wants speed and critdmg, 2 stats, and his BIS relic sad also has 6%+ speed. And even with that you still need almost all rolls to be on speed. \n\nAnaxas's bis set doesn't give speed and he wants, atk critrate critdmg speed and some hp to not be one shot.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lawliette007",
                    "body": "What do u mean slow member? U are supposed to build him to be very fast, as a sub-dps in the herta team at least. Like the fastest or 2nd fastest character in the team (after ur sustain of choice).",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Caminn",
                            "body": "He has one base speed more than tribbie, you really can't build him very fast without sacrificing a lot of dmg",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Phase_Unicoder",
                    "body": "We do need a proper comparison video showcase between him Serval imo. In different environments ideally as well.\n\nJust to see how far of a premium vs jades you'll get as a replacement.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Caminn",
                    "body": "he's not that big of a buff for slow herta at e0 but at e2 he's pretty good because you don't rely on getting so many ults with herta anymore, cause 1 ult = 2 stacks at e2\n\n~~but you shouldn't be doing slow herta at e0 I guess without an action advancer~~",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yulemyeon",
            "body": "YAAAAYYYYYYYY",
            "score": 0,
            "replies": []
        },
        {
            "author": "d88w7wuedna1635",
            "body": "maybe he was the anniversary character all along 😂😂😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "angie_in_the_sky",
            "body": "buffs!! huge W",
            "score": 1,
            "replies": []
        },
        {
            "author": "baboon_ass_eater69",
            "body": "Can someone tell me, does he have a 1 turn ult rotation like everyone was saying or does he need his LC for that",
            "score": 1,
            "replies": [
                {
                    "author": "Accomplished-Mix-136",
                    "body": "U need er rope if u dont have his lc. And its 2 turn ult",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SiIverclown",
            "body": "Is his best team still Therta?",
            "score": 1,
            "replies": [
                {
                    "author": "Phase_Unicoder",
                    "body": "Not exactly but he works fine it seems.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sandkillerpt",
            "body": "But does he kuru kuru the enemies??",
            "score": 1,
            "replies": []
        },
        {
            "author": "i_will_let_you_know",
            "body": "Huge personal damage buff but not much more interesting as a subdps buffer. Herta is still going to look for a more optimal partner eventually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FatuiSimp",
            "body": "YESSSSSS DELICIOUS",
            "score": 1,
            "replies": []
        },
        {
            "author": "shewolfbyshakira",
            "body": "I’m so excited for him his gameplay looks so fun",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imaginary-Tax-8437",
            "body": "We are so back ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oranjuicee",
            "body": "So….are we back?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seele4ndSin",
            "body": "Anaxa mains will be happy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hudashick",
            "body": "Now either buffs more or remains the same for v5 🙏",
            "score": 1,
            "replies": []
        },
        {
            "author": "iTzHaise",
            "body": "Ive been confused about his cdmg trace will he get both buff in a therta team or only get the 2nd one",
            "score": 1,
            "replies": [
                {
                    "author": "Hungry-Tax-3933",
                    "body": "Only the 2nd one",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "FearlessAbalone5813",
            "body": "both castorice and anaxa fans won so HARD 😭❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragrant_926",
            "body": "Nope hopefully they don't touch his kit in v5, i don't wanna hear any bad news there",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccurateAd476",
            "body": "Hello he got buffed that's actually huge",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Firefighter-7697",
            "body": "Oh boy they really want to keep the funny little global passive, don’t they?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fubuky10",
            "body": "Still not enough, multipliers are still low as fuck (it means he’s going to fall in the near future) and in general his problem is the kit. Bounce is a fucking mistake",
            "score": -1,
            "replies": []
        },
        {
            "author": "Lysander573",
            "body": "I still don’t really get the point of him at all. He’s like less interesting(kit wise) Welt with better numbers and no res pen weakness implant replacing the slow and def shred that makes welt fun.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Quick-Standard3202",
            "body": "We all cheered",
            "score": 0,
            "replies": []
        },
        {
            "author": "Robinwhoodie",
            "body": "E1S1 Anaxa break hybrid CR body and BE rope (E2 Fugue, HMC, E1S1 Linghsa/E1 Tribbie+S3DDD). Am I cooking something here or have I gone crazy from the buffs?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Daphrodyte",
            "body": "So they doubled Castorice’s scaling and gave him 20%? Also I think they got a little too focused on Castorice and forgot that he isn’t an hp scaler… nobody wants this hp trace.\n\nAlso can they stop changing names every beta cycle this is getting ridiculous.",
            "score": -20,
            "replies": [
                {
                    "author": "SGlace",
                    "body": "A lot of chars have defensive traces and all of his ratios were buffed by 33%, not 20. In addition to other minor buffs throughout the kit. These are great buffs…",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Secure-Network-578",
                    "body": "They only increased her multiplier on the dragon swipe, they also gave him 6% more CR in traces. The increases to  all his multipliers are really good too. This is a minor buff for Castorice and a very big win for Anaxa.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Daphrodyte",
                            "body": "But Anaxa was the worst dps of 3.x and late 2.x so I’m not sure what these buffs are for..? Make him better than Yunli and Firefly but remain worse than every other 3.x dps? Let’s not talk about his sub dps performance…",
                            "score": -30,
                            "replies": [
                                {
                                    "author": "Secure-Network-578",
                                    "body": "I'm sorry but I just don't know how to respond to this, you just hit me with the game design equivalent of:\n\n>A: God, I'm so hungry  \nB: Here, have this sandwich  \nA: Huh? But I'm hungry so I don't get what this food is for? Why would I eat it?",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Daphrodyte",
                                            "body": "But what would I do with one singular grain rice if I’m starving?",
                                            "score": -18,
                                            "replies": [
                                                {
                                                    "author": "Secure-Network-578",
                                                    "body": "You'd start eating it and realize that it is actually a full meal and you simply didn't have your glasses on. \n\nLike, objectively, these are the biggest buffs in the entire beta cycle. Nearly everything people asked for was addressed and he was majorly buffed. It should be a \\~40% personal performance buff which is a major buff for hypercarry and just kind of insane for a character that already was a sidegrade to the current best Therta subdps.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "zatn",
                                                    "body": "These changes reek of \"T0 in every game mode\" changes.\n\nThere is no world where they make him as strong as castorice who is the penultimate anniversary character.\n\nBut he's unarguably the strongest hyper carry in the game after these changes (assuming you don't consider therta dual erudition teams hyper carry).",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zonlul-simp69",
                    "body": "its a private beta, ridiculous whhat?",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "NcRealms",
            "body": "I kind of wanted another skill proc after ult to give more herta stacks but with these multipliers, I guess its ok. and with this buff adding that would be too overpowered",
            "score": 0,
            "replies": []
        },
        {
            "author": "Accomplished-Mix-136",
            "body": "Looks like hes busted now lmao",
            "score": -2,
            "replies": []
        },
        {
            "author": "asalene",
            "body": "Looks like they just return him to v1 state tbh",
            "score": -7,
            "replies": []
        },
        {
            "author": "ergothereafter",
            "body": "It’s minor, but it’s something.",
            "score": -22,
            "replies": [
                {
                    "author": "SGlace",
                    "body": "It’s not minor they buffed all his ratios by 33%",
                    "score": 26,
                    "replies": [
                        {
                            "author": "ergothereafter",
                            "body": "Really? That’s great then.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Secure-Network-578",
                    "body": "Minor? They increased like nearly *every* number in his kit by a substantial amount. His skill does a total of 800% damage now.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "pokebuzz123",
                    "body": "Going from 300% -> 400% per skill is a big change since he casts twice per turn. In a 2-turn ult rotation, he went from 1350% -> 1800% scaling. This alone makes him a good unit to pull, and then they also buffed his talents to further increase his value. \n\nWe'll have to see how it plays in practice, but I'd imagine he'll be blowing things up in single target. His eidolons still need some work, but that's a different issue.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Atoril",
                    "body": "All ratios buffed by 33%, extra 7% def shred, extra 6% cr. How is that minor lol. ",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ergothereafter",
                            "body": "I hadn’t considered the extra hits yet. And to be honest, I expected his T2 to be changed as well, because that would be a big buff for him in Dual DPS. 😭",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Starguardian_Ahri234",
            "body": "i just hope he turns out alright not op, not argenti level bad, just 3.x level",
            "score": -4,
            "replies": [
                {
                    "author": "yunsul",
                    "body": "\\>argenti level bad\n\nmy e0s0 argenti has been doing spectacularly, I would even go so far as to say he's been my best performing 1.X dps. He managed to net me 34k on auto this PF and 3.2k on auto this AS with just sunday and RMC as supports.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Tsukinohana",
                    "body": "He's pretty much on the same tier as other 3.X dps now",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AstrophysicalDecay",
            "body": "Wow, huge buff on the skill. Buffs across the board. I guess they felt he was underperforming.",
            "score": 0,
            "replies": []
        },
        {
            "author": "StringSudden6969",
            "body": "WE ARE SOOOOO FUCKING BACK",
            "score": 0,
            "replies": []
        },
        {
            "author": "rerorerorerp",
            "body": "Stupid question but does anaxa himself count as a character regarding his T2?",
            "score": 0,
            "replies": [
                {
                    "author": "JunQo",
                    "body": "He does, so he only gets extra CD if he's the only Erudition",
                    "score": 2,
                    "replies": [
                        {
                            "author": "rerorerorerp",
                            "body": "Tnx",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheCommonKoala",
            "body": "I have to believe he gets a v5 nerf. This is extreme powercreep.",
            "score": -8,
            "replies": []
        },
        {
            "author": "Ok_Pattern_7511",
            "body": "Hoyo show us E1 and E2 buffs for Castorice don't be shy",
            "score": -8,
            "replies": []
        },
        {
            "author": "CantarellaFisalia",
            "body": "That one 1% increase. So stingy. 😔",
            "score": -6,
            "replies": [
                {
                    "author": "Duckfaith_",
                    "body": "I assume you are talking about the def ignore trace:\n\nThis is such a disingenuous way of framing things.\n\n1. Going from 3% to 4% although an absolute change of 1% is a 33% buff or 1.33x increase relative\n2. The def ignore stacks up to 7 times, which is a 7% absolute increase.\n3. Def ignore has increasing returns, thus each 1% increase is more valuable than the last up to 100%",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheOnlyPomegranate",
            "body": "Was hoping 140 crit dmg buff would be applicable to Herta teams too, but any buffs are welcome I suppose!",
            "score": -4,
            "replies": []
        },
        {
            "author": "solarscopez",
            "body": "Lmao I like how happy people are for this constant powercreep we've been getting for new character releases, it's like watching a nest of mice running around back and forth in a room slowly being flooded with carbon monoxide. \n\nDeath is inevitable and everyone on the outside can see that it will happen, except for of course the mice scuttling around like carefree lunatics on the inside. Doing whatever it is that mice do I guess.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Atoril",
            "body": "Is something changed in a talent beside the name of the state? ",
            "score": -1,
            "replies": []
        },
        {
            "author": "GinJoestarR",
            "body": "Hmm",
            "score": -1,
            "replies": []
        },
        {
            "author": "Kira_Queen_97",
            "body": "they're really gonna keep buffing his numbers instead of the herta synergy 😭 hopefully it makes him more worthwhile in that team anyway",
            "score": -10,
            "replies": [
                {
                    "author": "Accomplished-Mix-136",
                    "body": "Bruh. He battery herta like crazy.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Kira_Queen_97",
                            "body": "without providing any offensive debuffs, only a very negligible buff. he's an upgrade, sure, but not worth the pulls",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Accomplished-Mix-136",
                                    "body": "U not looking at harmony or nihilty character here.\n\nHis own dmg is actually decent now",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Kira_Queen_97",
                                            "body": "yet topaz is a hunt unit with her main utility being her attack frequency + huge vulnerability debuff, not her personal damage. which is good since you want to amplify your main source of damage rather than have another slightly inferior or equal source of damage. anaxa should be the same to be worth pulling, but as it stands he's just not. especially for a high investment therta.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Accomplished-Mix-136",
                                                    "body": "Topaz dmg is ass compared to anaxa.\n\nStill e2 herta is better than pulling anaxa if u want higher investment",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Kira_Queen_97",
                                                            "body": "and she contributes more to her teams than anaxa, exactly because her focus is on offensive utility rather than raw damage??",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Tigor-e",
                                            "body": "Damage is still ass, you're gonna be building him full speed Wind Set. \\*Forget about the damage\\*",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tigor-e",
                            "body": "Ehhh, if it's just battery he's not that much better than Serval, and Jade+Linghsa still beat him in full AoE",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea_Angel05",
            "body": "ah, now THAT is a true Herta’s slave. 💜💚 I’m pulling",
            "score": -7,
            "replies": []
        },
        {
            "author": "nox1122002",
            "body": "Can anyone please provide a tldr in Razor language and tell me what are his best teams aside from Therta(sacrificed to get Boothill getting her on rerun), I want to use him as DPS and I have E0S1 Sunday and will probably skip Casto for him mostly out of spite ☺️☺️☺️",
            "score": -2,
            "replies": [
                {
                    "author": "Tsukinohana",
                    "body": "Sunday Tribbie HH",
                    "score": 2,
                    "replies": [
                        {
                            "author": "nox1122002",
                            "body": "Would Luocha or Aventurine work I don't have HH?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tsukinohana",
                                    "body": "sure they'll fine",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SprQ545",
            "body": "I can slap shitty relics with no crit substats on Anaxa, pair him with my The Herta and Tribbie and he's still gonna have 79.4/318 crit? What's the catch?",
            "score": -2,
            "replies": [
                {
                    "author": "JunQo",
                    "body": "The catch is you don't get the extra CDMG if he's not the only Erudition in the team",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Tigor-e",
                    "body": "You don't get 140 if he's on a team with THerta",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bringbackcayde7",
            "body": "He is still most likely going to just be a sidegrade of 4\\* units",
            "score": -36,
            "replies": [
                {
                    "author": "Quna_chan",
                    "body": "Just like lingsha will be Gallagher side grade",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "GothicOwl13",
                    "body": "We all know how this same statement aged for Jiaoqiu and Acheron lol",
                    "score": 10,
                    "replies": [
                        {
                            "author": "bringbackcayde7",
                            "body": "There is also Topaz who is just a sidegrade of March and Moze.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "GothicOwl13",
                                    "body": "Topaz was made before Feixiao in version 1.X, when arguably the kit designs were much more conservative in both damage and functionality, Anaxa is made after the Herta and is a 3.X unit. \n\nSince Topaz was much earlier than Feixiao and even Ratio, they didn't have her best team to actually tune her.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Starguardian_Ahri234",
            "body": "still worse then castorice with her buffs now there is no reason to pull him aside for theherta",
            "score": -17,
            "replies": []
        },
        {
            "author": "Curious_Mix559",
            "body": "Lol how they keep buffin this guy and not castorice lmao",
            "score": -20,
            "replies": []
        },
        {
            "author": "Advendra",
            "body": "At this moment, I think it is about time Anaxa in his team might actually replacing The Herta position, so Anaxa is going to be assisted by other Erudition rather than paired with The Herta.\n\nCmiiw",
            "score": -6,
            "replies": [
                {
                    "author": "Duckfaith_",
                    "body": "At that point, why wouldn't you just run him with another support rather than erudition as a hypercarry?  \n  \n  \nHe will get the 140% cdmg and additional benefit of extra buffs from the support  \n\n\nAnaxa's kit doesn't benefit from having another erudition unlike herta",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Advendra",
                            "body": "His T2 benefit from having 2 Erudition character in party",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Duckfaith_",
                                    "body": "He can only get either or, and 140% cdmg >>> 40% dmg",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Advendra",
                                            "body": "Oh you're right. I missed that.\nWelp, at this point, I think Anaxa probably gonna be better that Therta team hahaha...now I am thinking to skip the probably-overrated Castorice (based from doing story with her in this current version).",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "samin2020",
            "body": "They took away the 6% cr :(",
            "score": -22,
            "replies": [
                {
                    "author": "Radinax",
                    "body": "They buffed it to 12% crit rate.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "hanki-ki",
                    "body": "Wdym, it's 12% now",
                    "score": 9,
                    "replies": []
                }
            ]
        }
    ]
}