{
    "title": "I have no idea if this is a hot or cold take in the community, but Valentina’s Verve might be one of the worst emotes in the game",
    "author": "liminalb0y",
    "subreddit": "FortNiteBR",
    "rank": 3,
    "score": 771,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 192,
    "url": "https://i.redd.it/5pb8btouqgpe1.jpeg",
    "id": "1je72aa",
    "selftext": "",
    "comments": [
        {
            "author": "Thick_Tourist_2174",
            "body": "Compared to that Mr.bright side dance we got the other day it can’t be, dance doesn’t even match the song",
            "score": 445,
            "replies": [
                {
                    "author": "dusk2dark",
                    "body": "I saw the title, and the hype hit. Saw the actual dance and was very disappointed.",
                    "score": 181,
                    "replies": [
                        {
                            "author": "SassySquidSocks",
                            "body": "Same here, wasted potential.",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "sm12cj14",
                            "body": "Felt this way with lucid dreams",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Grouchy_Street_7413",
                            "body": "r/same, still bought it though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "g0remi",
                    "body": "I got so excited about the song that I bought it and after I couldn't return it anymore I realized \"wait.. this is ass\"",
                    "score": 35,
                    "replies": [
                        {
                            "author": "FabregDrek",
                            "body": "I bought it for the music only, the dance is terrible but at least the song completes a verse.\n\nI feel a bit dumb because Epic doesn't deserve sh1t in the state the game is right now but my love for the song made me fall for it.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EveryReaction3179",
                    "body": "I had to watch the Mr. Brightside one several times bc I couldn't believe how awful it was 😂",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "NumericZero",
                    "body": "This and be humble\n\nNo clue whose in charge of the dances that go with the emotes\n\nBut they need to be interviewed on what possessed them to make the most non-cohesive dance as possible to go with great songs",
                    "score": 18,
                    "replies": [
                        {
                            "author": "TigerKirby215",
                            "body": "It's so weird to me that icon emote have like an 80% chance of being complete ass and then the remaining 20% are usually absolute bangers.\n\n\nThe only consistent pattern I've seen is that if the icon emote is part of another collab (like Miku emotes, Mariah Carey, or Lucid Dreams) they're usually good (Shaq Shimmy excluded, and I'm still lowkey pissed Miku Miku Beam isn't the pose Miku does in MCLS). But when it's just a random music drop it feels like the emote goes to the intern.\n\n\nCarefree, Walkin' Pretty, and Interstellar Bass were good. And Reaper's Showtime: I have no idea who the hell cooked so hard for the freaking Hazbin Hotel fan song emote.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dusk2dark",
                    "body": "I saw the title, and the hype hit. Saw the actual dance and was very disappointed.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "LuckyHare87",
                    "body": "I got all excited at first seeing it cause I thought it was Mr. Blue Sky by ELO, then I was only disappointed by the song but also the dance.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Flameblast73",
                            "body": "If they fumble an emote to my favourite song, that's when I'll uninstall. I love Mr.blue sky it's such a happy and cheerful song",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LuckyHare87",
                                    "body": "It better be traversal and have the character walking along cheerfully dancing to the beat!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Least-Appearance-733",
                    "body": "When I seen the name I wanted to buy it soooo bad, I was so confused when i actually watched the emote. I swore it had to be a mess up",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ImmoderateAdversion",
                    "body": "Literally 😂😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OpathicaNAE",
                    "body": "I bought it because I really like the \"Jealousy!\" hopping around intro. You can then combo that into the banger 'humble.' because it goes \"Jealousy, sit down, be humble.\" and then I like to do a goofy flashy dance.\n\nAlso apparently everyone on this sub hates both of those emotes so it makes me lol a little bit more than it should.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FamousSession",
                    "body": "Jubi Slide says hi.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VictorFinger",
            "body": "Nothing can be worse than \"whats up brother\"",
            "score": 591,
            "replies": [
                {
                    "author": "rewNATION",
                    "body": "This! That emote makes me cringe every time. Don’t know who that person is and I don’t want to know.",
                    "score": 156,
                    "replies": [
                        {
                            "author": "i360Fantasy",
                            "body": "Ive seen people use that emote to rage bait lol",
                            "score": 96,
                            "replies": [
                                {
                                    "author": "rewNATION",
                                    "body": "And I bet it works! Lol",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "author": "ELA-METAL",
                                            "body": "it's got to point in some communities that everyone knows it's a ragebait but they play along anyway for the fun of it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TeeeeeeeeeeeeeeeeJay",
                                    "body": "That's exactly why I bought it.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "i360Fantasy",
                                            "body": "Im gonna get it because of that",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "that_1_cosplayer",
                            "body": "The \"what's up brother\" guy is one of CaseOh's friends called Sketch",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "necroglow",
                                    "body": "Who the fuck is CaseOh\n\nEDIT: lmao wait I watched this guy play some indie horror game a few weeks ago. Pretty entertaining actually",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "LoudBoiDragoon",
                                            "body": "It’s so funny watching online culture get so large that many of us just don’t get the references or names of anyone anymore",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "LADYBIRD_HILL",
                                                    "body": "Im Gen Z, and I've been on YouTube and reddit for over a decade, and I still don't know any of the streamers with skins in the game besides Ninja, who I only know because he's a moron and says really stupid shit lol.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HB_G4",
                                            "body": "A streamer who’s subject of a LOT of fat jokes.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "that_1_cosplayer",
                                            "body": "Blud doesn't know CaseOh💀💀💀",
                                            "score": -20,
                                            "replies": [
                                                {
                                                    "author": "whippycat",
                                                    "body": "why do you write like this",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "LookingAtAPhoto",
                                                            "body": "Bro is on a youtube shorts mindset fr 🗣️🗣️🔥🔥",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AffectionateWin9631",
                                    "body": "No wonder it’s called (sketch) what’s up brother 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LukeSkywalka2",
                            "body": "“Don’t want to know” geesh, give sketch a break.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Knight_Glint",
                    "body": "I only know one person that actually likes that emote.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "nugukweenie",
                    "body": "that emote gets on my nerves omg",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "etherealwing",
                    "body": "evil plan.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Nice_Combination_748",
                    "body": "New ragebait emote",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zombies8MyNeighborz",
                    "body": "Yeah I hate that one and the person it's associated to",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Knight_Glint",
            "body": "Probably a hot take, there's some dreadful emotes that exist, and this is nowhere close to those.",
            "score": 95,
            "replies": [
                {
                    "author": "Yellowsquid68",
                    "body": "I agree. Valentina’s Verve actually feels like a chapter 1 emote in a way.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Superyee492",
                            "body": "how? this shit is straight ass compared to even the worst ch1 emotes",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "robborrobborrobbor",
            "body": "Not even the worst in its own pass imo, outlaw strut is worse. Its not a strut and after slaming the money bag and giving a salute it goes into one of the most lifeless dances I have ever seen  only to loop in the most jank way possible",
            "score": 158,
            "replies": [
                {
                    "author": "TiramisuFan44",
                    "body": "I've always wanted to look like a horror movie's abstraction when resetting my limbs to a dancing position",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "sofullofsoda",
                    "body": "The way the music on it feels muted too?? I can’t tell what the songs saying whenever I see the emote lol",
                    "score": 9,
                    "replies": [
                        {
                            "author": "renraks0809",
                            "body": "There's a couple emotes that feel wayyy too quiet, Forget Me Not is another one that is crazy quiet",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "daydayb420",
                                    "body": "I have Ask Me and it’s super quiet too",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThatOneRacer",
                    "body": "The entire Keisha Cross part of this BP is not it.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "banjoface123",
            "body": "It's not great but we have far far worse",
            "score": 40,
            "replies": []
        },
        {
            "author": "RenoReddit03",
            "body": "It reminds me of ice spice for some reason",
            "score": 16,
            "replies": []
        },
        {
            "author": "No-Difference8545",
            "body": "I like it. Worst emote is just wrong. At least the dance is kinda unique with the finger guns.",
            "score": 32,
            "replies": []
        },
        {
            "author": "Commercial_Bag_8729",
            "body": "The only emote in the battle pass that I see myself using is Midas’s. The rest are dogshit. ",
            "score": 64,
            "replies": [
                {
                    "author": "GoddamnWizard385",
                    "body": "On the other hand Diva Fever from the OG pass might be one of the best imo",
                    "score": 64,
                    "replies": [
                        {
                            "author": "Commercial_Bag_8729",
                            "body": "If we’re counting the other passes then I’d use tragedy from Lego. That’s it. ",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "L3GlT_GAM3R",
                                    "body": "I’m like two levels away from unlocking it, you know this Lego pass is great skin music and emote wise. Aside from the last skin which is boring but still",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "XpMilker",
                                    "body": "Tragedy is so good 😭😭",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dipshit_Mcdoodles",
                            "body": "Is that the disco dance? The second I saw that I used almost exclusively that for almost a week.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "raewithane08",
                                    "body": "I love using it in Lego!",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "RayLiotaWithChantix",
                                    "body": "I still use it constantly. It's so good.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DillWithIt69",
                    "body": "The kane emote withe the seat of gold",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Commercial_Bag_8729",
                            "body": "We get so many sitting down emotes. It also doesn’t have the aura that the diamond throne emote has. From ch5 s1’s battle pass. ",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Eeveefan8823",
                                    "body": "Disagree, the cane spin gives it a lot of aura imo",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Commercial_Bag_8729",
                                            "body": "The picking the gold up and throwing it up and down has it loose all of it. ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ThatOneGuy-4434",
                                    "body": "Or the Dr. Doom built-in emote from C2S4! Granted, you can only use that one in the few seconds after a win, but it’s the only reason I main his skin.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Commercial_Bag_8729",
                                            "body": "That one has THE most aura in any sitting emote. ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EverGlow89",
                    "body": "The sitting on gold one is awesome.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "unnormalfox",
                    "body": "Dills",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Commercial_Bag_8729",
                            "body": "That shits cringe. \n\nI’m mostly joking, I’m just not a fan of it. ",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fox-booty",
                    "body": "Not even Sub Zero's MK11 Friendship?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NumericZero",
                    "body": "Kaine one of the gold raining down from the ceiling is pretty dope\n\nBut he is arguably the best skin in the current pass (Sub and Dill aside)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Purple_Telephone3483",
            "body": "I actually love it",
            "score": 50,
            "replies": [
                {
                    "author": "thebestninjaever",
                    "body": "Same lol I use it often",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Purple_Telephone3483",
                            "body": "Tbf I mostly use it because I've been using the Valentina skin, idk if I'd use it as much if I was using a different skin",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RoiVampire",
                    "body": "Same I use it a lot",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "tinverse",
            "body": "I think the Mr. Brightside emote is actually one of the worst. No hate on the song, but the emote is incredibly generic and doesn't match the song at all. I am fairly certain they somehow got the rights to the song and just threw it on some other generic emote they had lying around.",
            "score": 15,
            "replies": [
                {
                    "author": "Eeveefan8823",
                    "body": "To be fair, i don’t think it HAS a dance",
                    "score": 8,
                    "replies": [
                        {
                            "author": "tinverse",
                            "body": "The song doesn't have a dance, but it's pretty obvious the dance they put it on doesn't match the song. They could have done better.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KissKringle",
                                    "body": "They could've done some mosh or jumping esque dancing for it. Like Mr. Brightside is like KNOWN for being the poster child of a lot of alt subgroups.\n\nThe emote looks like they mashed some generic dancing together. It's so goofy compared to the song which is about being cheated on",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rewNATION",
            "body": "It’s definitely pretty lame.",
            "score": 26,
            "replies": []
        },
        {
            "author": "HoppyMcScragg",
            "body": "Can we agree that Mr. Brightside is worse?",
            "score": 16,
            "replies": []
        },
        {
            "author": "ciarabek",
            "body": "why? i think its pretty average",
            "score": 25,
            "replies": [
                {
                    "author": "Pixiehollowz",
                    "body": "I agree with you! Finally they added items with the female playerbase in mind first, so of course the male players are mad and bored",
                    "score": 10,
                    "replies": [
                        {
                            "author": "VideogamerDisliker",
                            "body": "There’s plenty of emotes and skins with the female player base in mind. At least in the item shop",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Pixiehollowz",
                                    "body": "Yes, there's plenty, but not the majority. Which is unfair, cause why isn't it 50/50? Probably because yall would make posts like this way more.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "VideogamerDisliker",
                                            "body": "Personally, I feel like my fiancé is always seeing skins and emotes she wants more than I do. There’s a lot of emotes with dances and songs that are popular among women. Plenty of “gender neutral” emotes as well. Maybe that’s just me though.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HottieMcNugget",
                            "body": "I’m a girl and I don’t like it either.. how is made for the girls anyway?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Pixiehollowz",
                                    "body": "Idk it's just feminine to me and I'm not the only one who thinks so",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mindinawe999",
                            "body": "this!!! we don't complain when everything is made with men in mind, but everyone's up in arms when something, for once, is made with women in mind",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Pixiehollowz",
                                    "body": "Exactly!! This is everyday for us",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ThatOneGuy-4434",
                            "body": "That’s actually why IMO. Such expressiveness feels out of place in a shooter. But now that I watched it with Big Dill (who absolutely would do that), I like it",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CheeseForLife",
                            "body": "I'm female and hate it also. I feel like there have been a lot of more female focused emotes lately, and way better than this one.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "liminalb0y",
                    "body": "Idk, I just think it’s really cringe",
                    "score": -13,
                    "replies": [
                        {
                            "author": "ciarabek",
                            "body": "its a feminine dance emote mixed with a hanna barbera wile coyote style sneak. thats why its pared with valentina. it gives off unstable girlie bandit pretty well. i like it, its not my favorite emote ever but its perfect for a bandit girl\n\nadd it to the list of emotes i wouldnt pair with a guy character tho!",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "HB_G4",
                                    "body": "“Hanna Barbara Wile Coyote style sneak” \n\nCould you elaborate on what you mean by this, because nothing about the dance or the music gives off Wile Coyote vibes.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ciarabek",
                                            "body": "i didnt necessarily mean wile coyote, you could just as easily supplement tom from tom and jerry and a number of other characters who sometimes sneak around. regardless its a movement from the slapstick era from approximately 0.02-0.04. the emote features a sneaky prance with a whisper at the end before going back into dancing.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "etherealwing",
            "body": "not even close. \n\n\nevil plan - worst, high pitched, shitty animation, bad song.\n\n\nlil whip - incredibly bad for several reasons (and here they claim game child friendly)\n\n\nblinded by the light emote (stupidly lazy animation without the song.)\n\n\nthe two strut traversals that caused a commotion over the bundle.\n\n\nalmost ALL emotes that are just them standing there.\n\n\nrecently was two really good songs getting stuck with \"expressive\" dances, both don't even match the song.\n\n\npoki distorts most avatar faces for the picture. (needs fixed)\n\n\nand thats not even the entire list but these are my biggest offenders so far. forget all the ones with just crappy songs.",
            "score": 32,
            "replies": [
                {
                    "author": "EverGlow89",
                    "body": "Lil Whip is one of the best emotes in the game, you're out of your mind.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Isaacfrompizzahut",
                            "body": "MMMMMM LIL WHIP LIL WHIP LIL WHIP",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "TiramisuFan44",
                            "body": "I agree, the dance is pretty expressive \\^^",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "EverGlow89",
                                    "body": "It's funny af and I think you're taking it a bit too seriously.",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "liminalb0y",
                    "body": "Omg I remember when Evil plan was added to the game. Honestly I think you’re right, it’s even worse than Valentina’s Verve 😭",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "the-autist-18",
                    "body": "Blinding Lights could have been fantastic. But they messed it up.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ThatOneGuy-4434",
                    "body": "Evil Plan is the one from C2OG’s pass, right?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "etherealwing",
                            "body": "no, it was in the shop like 3-5 days ago?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mistyoasis",
            "body": "This is my favourite emote because the 🤫 part seems to piss everyone off",
            "score": 10,
            "replies": []
        },
        {
            "author": "Soakaliz",
            "body": "It's a cold take, I've seen so many people complain about it, but also people defend it. It is a very divisive emote.\n\nI personally quite like it. I normally just every emote from battle passes, but I've kept that one.",
            "score": 8,
            "replies": []
        },
        {
            "author": "FuckElonMuskkk",
            "body": "I really like it. Now imma use it as my victory dance.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Alternativirus",
            "body": "I actually like this emote NGL, I like the sinister facial expression at the end. Looks great on some particular skins.",
            "score": 4,
            "replies": []
        },
        {
            "author": "mindinawe999",
            "body": "lmao, this was one of my most wanted cosmetics in the bp. I just love how she does the first part for some odd reason",
            "score": 7,
            "replies": [
                {
                    "author": "that-ninja-frog",
                    "body": "same lol. I was pretty tepid on Valentina' design, but this emote made me think, \"actually, she's pretty cute!\"",
                    "score": 7,
                    "replies": [
                        {
                            "author": "mindinawe999",
                            "body": "same here!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pinkkow",
            "body": "Nah its so funny to do with other contrasting skins",
            "score": 2,
            "replies": []
        },
        {
            "author": "Toastyyy_",
            "body": "Outlaw strut is pretty bad. Although there’s only like 2 emotes in this battlepass that are actually good, and one of them was pulled straight from mortal kombat so they couldn’t even mess it up. Then you have the outlaw Midas one. Emotes tend to be what I look forward to most in a battlepass, if it wasn’t for Midas, and sub zero. I probably would’ve skipped this battlepass too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EmoAqua",
            "body": "How sweet and what’s up brother are the absolute worst emotes in my opinion",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bilbo_McKitteh",
            "body": "sketch emotes are still #1 certified dogshit",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChurchOfDionysus",
            "body": "i really like this emote lolol. it’s on my quick emote wheel. :3",
            "score": 2,
            "replies": []
        },
        {
            "author": "Background_Ad9476",
            "body": "The humble emote is just as bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwawayxj10",
            "body": "Nah the money bag one doesn't even loop properly  lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "IrreverentCrawfish",
            "body": "Most of the emotes in this BP were trash",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgentDigits",
            "body": "I think all the emotes form this BP are kinda meh... but yeah, this ones probably the worst",
            "score": 1,
            "replies": [
                {
                    "author": "highkneesprain",
                    "body": "i was hoping we’d get another emote like Do The Split, but sadly we did not. only thing good about this season is Dill’s song",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "casino_run",
            "body": "Got second place and the person who eliminated me hit this emote and it pissed me off more than I already was",
            "score": 4,
            "replies": []
        },
        {
            "author": "OKgamer01",
            "body": "Not bad but not good either.",
            "score": 4,
            "replies": []
        },
        {
            "author": "SnooPaintings8183",
            "body": "Which sucks because she's an amazing looking skin",
            "score": 3,
            "replies": [
                {
                    "author": "necroglow",
                    "body": "Her default skin without the mask might be my favorite skin in the game. Love the colors and she’s pretty pretty.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Eeveefan8823",
                    "body": "Agreed, comboing super styles with her different hair colors was super fun. I made a discount Poison Ivy and a close Cinder Fall both.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "liminalb0y",
                    "body": "Yeah I’ll admit that the skin isn’t bad. I actually really like her loading screens too. I just don’t like the emote",
                    "score": -3,
                    "replies": [
                        {
                            "author": "SnooPaintings8183",
                            "body": "Oh the emotes garbage\nIt's like \"what?..\"",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MintyRed19",
            "body": "why",
            "score": 2,
            "replies": []
        },
        {
            "author": "squeakybuggy",
            "body": "it literally makes me so uncomfortable for some reason lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "Neither_Compote8655",
            "body": "I like it",
            "score": 1,
            "replies": []
        },
        {
            "author": "KevinsLunchbox",
            "body": "I like doing the beginning of it and then I stop the emote or swap to something else",
            "score": 1,
            "replies": []
        },
        {
            "author": "TeeeeeeeeeeeeeeeeJay",
            "body": "It's starting to grow on me a little.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zairanus",
            "body": "Most emotes are. Not enough clissical stuff",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chuomge",
            "body": "Thank god someone else said it. Not sure why but the emote triggers me more than any of the “toxic” emotes. So bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "t00thgr1nd3r",
            "body": "The only emote I've enjoyed in Amy of the passes this season is the Tragedy! one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_L_E_P_H",
            "body": "True",
            "score": 1,
            "replies": []
        },
        {
            "author": "InTheStuff",
            "body": "Still better than Kendrick's Humble emote\n\nThey fr butchered his song by adding some random ass moves that Kenny never did ☠️",
            "score": 1,
            "replies": []
        },
        {
            "author": "poweredbytofu713",
            "body": "I like it because when your character goes 🤫 one of their eyes is closed and on some characters like Felicity it’s absolute gold lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "pontestreet",
            "body": "it's not great but i'd say the outlaws strut emote in the exact same battlepass is worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pontifexioi",
            "body": "I actually really like that emote. There are way worse ones out there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative-Sky-2867",
            "body": "I like it and often use it with Cassidy who is my main this season.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuggernautGog",
            "body": "They have to put bad emotes in battle passes so they can sell the better ones for V-bucks. They are aware that most of the paying customers own a battle pass anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic-Eagle-890",
            "body": "This is so real",
            "score": 1,
            "replies": []
        },
        {
            "author": "Squackachu",
            "body": "Of all the one's in the pass keisha's is my favorite by far",
            "score": 1,
            "replies": []
        },
        {
            "author": "SassmasterSenpai",
            "body": "I don't know why, but that little skip and adding the \"Shh\" notion really grinds my gears",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Brush204",
            "body": "Idk I like it lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "AntonCigar",
            "body": "I like this emote and I like Val but this pass is complete garbage overall. Between that and how bad and fucking ratty this season is, I have no desire to grind",
            "score": 1,
            "replies": []
        },
        {
            "author": "dogesami",
            "body": "nah Outlaw's Strut more atrocious",
            "score": 1,
            "replies": []
        },
        {
            "author": "AstroLuffy123",
            "body": "It is so fucking bad🙂‍↕️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Individual-Ad4311",
            "body": "It's like they trained an AI to make an emote on tiktok dances. It's absolutely godawful",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salt721",
            "body": "I don't think it's one of the worst, it's just mid 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "I2ed3ye",
            "body": "I'm convinced some C-suite exec stumbled upon a backup drive of a bunch of work that never made its way to release and now they have everybody just slapping together a bunch of incongruent, cutting floor junk to slop out. It feels like this last couple of months I've seen the greatest number of new cosmetics ever, but most of it is just crap emotes with music thrown on top of it or existing assets Frankensteined together/uninspired reskins.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_venomiss",
            "body": "I love it. Hate Keisha’s though, weird and rigid",
            "score": 1,
            "replies": []
        },
        {
            "author": "wisho1926",
            "body": "I like the emote on some skins\n\nAurgubly the Money bag one is worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectionSalty6097",
            "body": "It'll never be the worst with Ska Stra Terrestrial around",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grat1234",
            "body": "Idk, I disagree tho. Just a 5-6/10 emote. Squabble up is the one you are looking for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "randomsquid101",
            "body": "It makes me cringe so hard but the Mr bright side emote is far worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Brief-8667",
            "body": "Wait I actually like Valentina’s emote.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Superyee492",
            "body": "All the battle pass emotes this season have be terrible. I've been playing the game since early-mid ch1 and this is hands down one of my least favorite bps (emotes especially, but I dislike 99% of this pass)",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrumpyGyaradosG",
            "body": "The verve is definitely among the worst in this game for sure.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ELA-METAL",
            "body": "I love it",
            "score": 1,
            "replies": []
        },
        {
            "author": "LasTHopE-Wolf",
            "body": "Not really a hot take it's kinda the truth",
            "score": 1,
            "replies": []
        },
        {
            "author": "Traditional-Drama-37",
            "body": "It’s useful as a cringe troll/ragebait emote",
            "score": 1,
            "replies": []
        },
        {
            "author": "nekolux",
            "body": "I like the dance but I think the song doesn't match it well",
            "score": 1,
            "replies": []
        },
        {
            "author": "druppeldruppel_",
            "body": "I'd agree with it being bad. However it's not the worst battle pass emote, since Outlaw's Strut exists, which is even worse that Valentina's shitty emote.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Green_Mikey",
            "body": "It honestly looks like someone just trying out moves in a mirror like \"Uhhh lesssee... would this be a cool tiktok move? Yeah... you pump bullets out like this, when you shoot, right? Yeah, this looks hood hard, yo!",
            "score": 1,
            "replies": []
        },
        {
            "author": "JNorJT",
            "body": "kinda hot tbh ;)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TigerKirby215",
            "body": "Glad I'm not the only one who archived that shit instantly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "highkneesprain",
            "body": "i like the finger guns of valentina verve but idk wtf the 2nd part of the dance is supposed to be",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lemon_n_Lime97",
            "body": "Sweet shot emote seems to me cringe, especially the first part of the music.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InvisibleChell",
            "body": "TBH Valentina as a whole is just very \"...Meh...\" to me. I don't care for her at all. Not my cup of tea, I suppose. Glad there are people who like her even if I personally just don't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katbat172",
            "body": "It's not for me personally. Some other people might like it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "watdisthing",
            "body": "“Whats up Sketch? (point)”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Michael_Swag",
            "body": "Get Griddy is right there man",
            "score": 1,
            "replies": [
                {
                    "author": "Sampy76",
                    "body": "The song attached to the Griddy is horrible.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "luciolencerr",
                    "body": "griddy is the best emote in the game wdym",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "Crimsonclaw111",
                    "body": "But griddy is classic\n\n![gif](giphy|HLMCyMhnaLYVn3QI7g)",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "IamAJobber",
            "body": "Facts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ObjectiveLittle6761",
            "body": "Nah, donkey laugh one is still the worst",
            "score": 1,
            "replies": []
        },
        {
            "author": "LycheePrevious7777",
            "body": "Her silver costume maskless is cool.We Lego for those.",
            "score": 1,
            "replies": []
        },
        {
            "author": "resident1fan2022",
            "body": "I thoroughly enjoy this emote. The gun cocks make it seem like I destroyed you and the shush means keep quiet about it. Great victory emote.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuckyHare87",
            "body": "I dunno, Peter Griffin's Bird is the Word still has a special place as the worst of the worst.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zombiosys",
            "body": "It’s a lazy battle pass emote. I can’t even remember the last time there was a truly great emote on a battle pass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Known_Mind_2077",
            "body": "LITERALLY the reason this season's battle pass is so awful",
            "score": 0,
            "replies": []
        },
        {
            "author": "ComfortableVolume217",
            "body": "First emote I’ve ever archived",
            "score": 0,
            "replies": []
        },
        {
            "author": "mistermenstrual",
            "body": "Pumpernickel",
            "score": -1,
            "replies": []
        },
        {
            "author": "zairanus",
            "body": "Most emotes are. Not enough clissical stuff",
            "score": -1,
            "replies": []
        },
        {
            "author": "Inevitable-Hippo-312",
            "body": "Every emote epic releases is awful because way too many exist. And you lovers keep buying them.",
            "score": -2,
            "replies": []
        }
    ]
}