{
    "title": "IF YOURE GOING TO LEAVE, PLAY SOLO!!! We need penalties.",
    "author": "Mr_NotParticipating",
    "subreddit": "FortNiteBR",
    "rank": 11,
    "score": 159,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/r/FortNiteBR/comments/1jebe29/if_youre_going_to_leave_play_solo_we_need/",
    "id": "1jebe29",
    "selftext": "I’m no saint, the game can be frustrating and while it’s pretty infrequently I’ve left games too. We need penalties, if you leave before your card times out, you get penalized. It’s literally like every single game.",
    "comments": [
        {
            "author": "TheLastHowl",
            "body": "I play squads mostly and a lot of the time my squad never gets a 4th player which is a big damn difference. The game shouldn't start until every squad is four players EPIC.",
            "score": 82,
            "replies": [
                {
                    "author": "wolfgang784",
                    "body": "Or at least give you an NPC. Better than nothing (unless its Ice Spice lolol)",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "Mr_NotParticipating",
                    "body": "Agreed. I mean for me, missing a player off the bat might happen 7-10% of the time but people leaving as soon as they’re down happens like 80-90% of the time. \n\nUsually I just play with my gf in duos, sometimes with our friend in trios but squads is my favorite so when they aren’t playing I just solo que squads but between starting with 3 players and people leaving, I get a solid game MAYBE 1 out of every 10 games.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "thatsmenessa",
                    "body": "Sometimes I load into duo fills and it doesn’t give me a partner in 100 player lobby and I’m like bro there’s no way they couldn’t find one person",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Viktorik",
            "body": "What about teams that purposely ignore your card? \n\nTeams that pick it up and then never intend to reboot?\n\nI get the sentiment and feel that leavers do need some form of punishment, but griefers can abuse your card way too easily with the current system and that would just be frustrating to be forced to sit through, even if rare.",
            "score": 56,
            "replies": [
                {
                    "author": "szcesTHRPS",
                    "body": "Yeah, it's just as common teammates will ignore your card as other teammates leaving before you get a chance to res them. Thems the breaks playing with randoms.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "waitmyhonor",
                    "body": "If epic had a better reporting feature versus a pic that can mean anything then this could easily be a non issue.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mr_NotParticipating",
                    "body": "Can’t say it happens to me too much but it is a dick move.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "God_in_my_Bed",
                    "body": "Ironic this happened to me for the first time two days ago. Two of us went down. One guy doubled back and gets the other dudes card. Mine was right next to his. He rebooted then the two jumped in a car and headed the opposite direction. I quit. I was pissed cuase I went down trying to save the first dude that got blasted. The 4th dude was AFK. First time in 3 years this happened though. Usually I'm the guy being carried, lol. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AnarchyWanderlust",
                    "body": "It's not that rare on my end.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mondfleck",
            "body": "My rule of thumb when it comes to online games: **play solo or with friends**. No exceptions.",
            "score": 28,
            "replies": [
                {
                    "author": "Darkmiroku",
                    "body": "This is my stance. I had my fill of fills lol. I'd say a solid 65%-75% of my matched had people leave, people rage and grief, or people not play as a team and think they were the main character. I only play the game if any of my friends are on.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mr_NotParticipating",
                            "body": "I don’t have enough friends that play squads.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "blaaa48",
                    "body": "Agreed",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BrolysFavoriteNephew",
            "body": "I only play teams with my kids or cousins. Tried groups when I 1st started and too many people quit as soon as they get downed or don't even move.",
            "score": 9,
            "replies": []
        },
        {
            "author": "mamadou-segpa",
            "body": "99% of people playing random are kids.\n\nPeople need to remember this game is geared toward kids.\n\nThey will never be super harsh in non ranked for that reason",
            "score": 8,
            "replies": []
        },
        {
            "author": "Accomplished_Cry_659",
            "body": "We need penalty 100% it's impossible to solo que this game.",
            "score": 5,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "Yeah, it’s at least 80% of games for me that one or more people will leave when downed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chimneysweeper18",
            "body": "What about if you lag out and it's not your fault at all? Heck, it happened to my cousin 3 times in one day. It would be hardly just to punish him and others like that for no fault of their own. I imagine Epic could figure out who quit themselves and who got lagged out, though, perhaps.",
            "score": 9,
            "replies": [
                {
                    "author": "Any_Plankton1268",
                    "body": "Yes it is unfair to the players who gets disconnected, but it's also equally unfair to those whose games are affected when an idiot intentionally leaves in the middle. Sucks more if it is a team gamemode.\n\nYes I'm sure epic could track if a player manually quits or gets disconnected due to network issues.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ColeWoah",
                    "body": "Not really an issue in this context - if someone is DCing regularly in a day, getting timed out so they can't subject anyone to their intermittency for a period of time is actually a good thing.\n\nGetting a temporary time out suspension from a game for genuinely having connection problems is literally a non-issue, that's literally the point of that type of suspension.  This user (for whatever reason) is currently DCing/leaving from games, so they would get timed out to prevent them from doing that more for a period of time.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Chimneysweeper18",
                            "body": "A lot of times, all one needs to do to fix his internet connection is to reset the router and or modem, however, literally just a few seconds needed, not hours.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ColeWoah",
                                    "body": "You wouldn't get a multiple hour long suspension for 1 or 2 DCs dude.  If all one needs to do is reset their modem/router, they can do that in the amount of the time one DC suspension would occur over and then be back online playing by the time their internet connection was restored completely.\n\nYou are worrying about people being punished in a way that simply doesn't occur in other games with this system.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thebestninjaever",
                    "body": "If you know you’re dropping due to lag, don’t subject a squad to your gameplay issues until they’re fixed or go play solo’s. Dropping a squad to less than 4 is frustrating for everyone and after the first person drops, the rest are likely to follow.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "unnormalfox",
                            "body": "Dawg they can play the game . They probably don't disconnect every game jeez",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "thebestninjaever",
                                    "body": "I understand that, but dropping 3 times in a day would indicate there’s an issue that needs resolving. Otherwise you’re going to do it again and would leave the squad to try and make up for the loss of a member. I’m not blaming or shaming but it’s something they should consider before going into a squad game. If a person drops cause of connection, it’s a bit more excusable than someone dropping after they get downed but bad for the squad either way.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "unnormalfox",
                                            "body": "\nYeah imo the 2 ways somebody is always excused is A:Their teammates either throw them around before reviving them B: a teammate is being toxic and ruining the game",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mr_NotParticipating",
                    "body": "Yeah, hopefully there would be a way to detect the difference. Idk if they would though because they handle Rocket League and when I get disconnected from that I still banned.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BonerDeploymentDude",
            "body": "I play solo duos and squads. It's fun.",
            "score": 2,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "It is fun, when everyone plays.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnarchyWanderlust",
            "body": "I fully agree but what do you do when your \"teammate\" is clearly not going to get your card? Just watch them drive away and leave your card on the other side of the map?",
            "score": 2,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "Yeah, until your card timer runs out. Just a couple minutes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AnarchyWanderlust",
                            "body": "Maybe it's just me but I'm not doing that. I'm not going to sit and watch someone actively be disrespectful to me as a teammate.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BuffWobbuffet",
            "body": "I wish there was some sort of system like skill based match making but instead pulls info of what players don’t quit early and stay if their reboot card is still active",
            "score": 1,
            "replies": []
        },
        {
            "author": "ALarkAscending",
            "body": "If I get knocked or carded, there is a short window when I look to see what my team mates are doing.  If they are making no effort to come towards me and/or to take out the enemy, then I am probably going to leave.  If we are playing as a squad, then that means prioritising the assist when your squad mates are being attacked.  This is especially true early game when you land with your squad and there is another squad in the same area.",
            "score": 1,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "Well I see no problem with waiting the couple minutes for the card timer to run out.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Revolutionary-Law239",
            "body": "My game crashed in a creative mode (happens a lot since the most recent update, sadly) and when I launched the game back up immediately after it gave me some weird warning in the lobby to rejoin the match or face a matchmaking penalty for that mode. Never saw it before and it wasn't even my fault. If they can do that to people who didn't even leave a match by choice, they can give penalties to quitters.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mydeargreatgolem",
            "body": "in the big25 playing fortnite ranked on fill",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreudianAccordian",
            "body": "![gif](giphy|V197tgUvQWGrzjMb3S|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeaBrush2217",
            "body": "If we ever play squad fills, we feel like we’ve won the lottery if we get an adult who actually has a mic and will communicate with us throughout the game. And agreed, it is annoying when people just leave.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheezymac2",
            "body": "If people don’t want to play with you, let them leave. Why try and force people to play with you? If you can’t handle other humans having free will and not playing the game how you want them to…YOU should play solos\n\n\n\n\nHolding them hostage with penalties wouldn’t work because they would just be bad teammates or go AFK if they don’t want to play with you",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForkFace69",
            "body": "I mean a lot of times you watch what your teammates are doing and it quickly becomes apparent that they have zero intentions towards rebooting you. Especially if your card is near the edge of the storm. That would suck to have to wait until you timed out and you were forced to watch some 7-year old drive around aimlessly on a motorcycle.",
            "score": 1,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "That’s why I said no penalty if your card timer runs out, it’s just a couple minutes and doesn’t change the game for anyone because you can’t be rebooted then anyway",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Own_Opinion_446",
            "body": "If you are going to complain about people leaving play solo. Bunch of yall dont ever reboot lmfao",
            "score": -2,
            "replies": [
                {
                    "author": "Mr_NotParticipating",
                    "body": "I prefer team game modes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RebelGrin",
            "body": "ELI5 please why this is an issue? Genuine question.",
            "score": 0,
            "replies": []
        },
        {
            "author": "gnawp",
            "body": "That's what you get for playing with randoms, deal with it",
            "score": -1,
            "replies": []
        },
        {
            "author": "National-Ad630",
            "body": "I've gotten an absurd amount of notifications saying that a report made against a leaver worked. Just report people, their system does punish.",
            "score": -2,
            "replies": []
        }
    ]
}