{
    "title": "Malcolm Gladwell’s Media Empire Is Being Torn Apart",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 358,
    "score": 84,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.thedailybeast.com/malcolm-gladwells-media-empire-is-being-torn-apart",
    "id": "17v0q9h",
    "selftext": "",
    "comments": [
        {
            "author": "BitterOldPunk",
            "body": "That’s ok, in a few years Gladwell can write a book about how the destruction of his penny-ante media empire was a good thing, actually, citing a few loosely-related anecdotes as data",
            "score": 71,
            "replies": [
                {
                    "author": "OrangeVoxel",
                    "body": "Did you know you can be an expert in anything if you spend 10,000 hours learning it? Yes, every skill takes 10,000 hours to learn",
                    "score": 32,
                    "replies": [
                        {
                            "author": "dgapa",
                            "body": "I'm pretty sure it was perfecting not learning, which are very different things.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "alaricus",
                                    "body": "It wasn't \"perfection,\" it was \"expertise.\" Which is different, but still a high standard.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "dgapa",
                                            "body": "Right thank you! Not sure why I got down voted by people lol.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "alaricus",
                                                    "body": "People don't understand how downvotes work, and it ruins this site, tbh. Best advice is not to worry about internet points.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "dgapa",
                                                            "body": "Very true!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mf-TOM-HANK",
            "body": "Can it really be called a \"media empire\" if they barely got their pants on to begin with?",
            "score": 42,
            "replies": []
        },
        {
            "author": "er-day",
            "body": "When Malcolm became a Koch brothers apologist all because they sponsored his show I realized it wasn’t for me. Had seen some concerning content published but that was the final straw for me.",
            "score": 52,
            "replies": []
        },
        {
            "author": "ricochetblue",
            "body": ">The event took an especially uncomfortable turn, staffers told Confider, when Gladwell was asked for an update on the company’s diversity goals.  \n  \n>  \n>“My definition of diversity might be different from other people, but that’s part of diversity—allowing Malcolm to have a different definition of diversity than everyone else,” he said. When asked what diversity meant to him, Gladwell replied: “Here’s a question: If you’re a Republican, raise your hand.” When no one raised their hand, Gladwell remarked, “I would think that a diverse company should have some Republicans in it.”\n\n🙄",
            "score": 37,
            "replies": [
                {
                    "author": "Oldschoolhollywood",
                    "body": "Lol what a fucking douche",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "RedditApothecary",
            "body": "\"I'm black, therefore my otherwise entirely white leadership team is diverse,\" is definitely a position. For a crazy person. But a position.",
            "score": 5,
            "replies": []
        }
    ]
}