{
    "title": "Raw data: The number of abortions in the US",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 303,
    "score": 24,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 2,
    "url": "https://jabberwocking.com/raw-data-the-number-of-abortions-in-the-us/",
    "id": "18wpm5q",
    "selftext": "",
    "comments": [
        {
            "author": "disdkatster",
            "body": "Comments on the article were closed which kept me from responding to the comment \"civiltwilightOctober 24, 2023 – 7:30 pm atA civilization that does not value new life is a civilisation in decline.\"\n\nThat this may be true but it is not abortion which is 'not valuing new life' but it is not allowing women the right to health care which is not valuing new life.  I don't know how to educate these nut jobs that late term abortions are not happening because the woman does not want a child. This is a heart breaking situation for that woman and her family. Talk about insult to injury.",
            "score": 12,
            "replies": [
                {
                    "author": "retroslik",
                    "body": "Educating nutjobs is a daily struggle in America. I'm not a fan of organized Christianity in the US, but I like this quote about the unborn\n\n\"“The unborn” are a convenient group of people to advocate for. They never make demands of you; they are morally uncomplicated, unlike the incarcerated, addicted, or the chronically poor; they don’t resent your condescension or complain that you are not politically correct; unlike widows, they don’t ask you to question patriarchy; unlike orphans, they don’t need money, education, or childcare; unlike aliens, they don’t bring all that racial, cultural, and religious baggage that you dislike; they allow you to feel good about yourself without any work at creating or maintaining relationships; and when they are born, you can forget about them, because they cease to be unborn. You can love the unborn and advocate for them without substantially challenging your own wealth, power, or privilege, without re-imagining social structures, apologizing, or making reparations to anyone. They are, in short, the perfect people to love if you want to claim you love Jesus, but actually dislike people who breathe. Prisoners? Immigrants? The sick? The poor? Widows? Orphans? All the groups that are specifically mentioned in the Bible? They all get thrown under the bus for the unborn.\"\n\n\nMethodist Pastor David Barnhart",
                    "score": 12,
                    "replies": []
                }
            ]
        }
    ]
}