{
    "title": "I forgot to take my meds in the morning and popped my blackheads for 2 hours before showering…",
    "author": "No_Investigator5909",
    "subreddit": "ADHD",
    "rank": 407,
    "score": 2536,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 97,
    "url": "https://www.reddit.com/r/ADHD/comments/1j1e7gv/i_forgot_to_take_my_meds_in_the_morning_and/",
    "id": "1j1e7gv",
    "selftext": "I woke up this morning thinking today was going to be productive and as I was about to shower I realized I had a small black head on my nose. When I squeezed it, I realized how satisfying it was to pop it so I began looking for more and more. I feel so upset for wasting so much time and losing track. At least I feel more assured that maybe the medication does help me with my impulses more than I thought, because usually when I wake up I take my meds right away. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/No_Investigator5909 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "msmenken",
            "body": "Been there, even with the thoughts of “stop doing this” as my hands were magnetized to my face and the shower ran cold in the background. Sorry you lost part of your Saturday 💔",
            "score": 1525,
            "replies": [
                {
                    "author": "thatguykeith",
                    "body": "…as my hands were magnetized to the Reddit app.",
                    "score": 127,
                    "replies": [
                        {
                            "author": "fragglet",
                            "body": "…as my hands *are* magnetized to the Reddit app.\n\n\nWriting this comment at 3am",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "justlurkingnjudging",
                    "body": "I’ve done this so many times",
                    "score": 143,
                    "replies": []
                },
                {
                    "author": "Shayyy24sxx",
                    "body": "This is exactly it & it makes me so mad! 😭 I know better. The “stop doing this” thoughts are present but just doesn’t manifest into reality.",
                    "score": 69,
                    "replies": []
                },
                {
                    "author": "iceprincessvo",
                    "body": "Im a massive skin picker and what helps me with this is to close my eyes and quickly move away from the mirror/position I’m in. Also somewhat works for doomscrolling ",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "namnoog",
            "body": "I didn't realize this was an ADHD thing. I use to spend hours picking at my arms and legs. I would get neck pain. I'm so insecure about the scars on my face from picking too.",
            "score": 685,
            "replies": [
                {
                    "author": "Haldoldreams",
                    "body": "Body focused repetitive behaviors, they are called! ",
                    "score": 366,
                    "replies": [
                        {
                            "author": "valiantjedi",
                            "body": "I didn't know that's what they were called. My son's psychiatrist just labeled it a skin picking disorder. Thank you!",
                            "score": 79,
                            "replies": []
                        },
                        {
                            "author": "Chris_O_Matic",
                            "body": "I have a shaved head and I notice that I kind rub my head when I’m speaking with someone and maybe have a little anxiety. It happens at work on a regular basis. I’ll have to see if this would be considered a body focused repetitive behavior. I really would like to stop as I’m sure it looks odd. But I think it somehow soothes me when I do it. Obviously I need to look at better strategies if that is the case.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "GVirus1984",
                                    "body": "I do this with my beard.. started in school and is here to this day.\n\nBut stimagz or other fidget toys help!",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "heythxvoo",
                                            "body": "What are stimagz?  Going to google too ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GVirus1984",
                                                    "body": "Fidget magnets of very high quality:\n\nhttps://stimara.com/\n\nHonestly best fidget tool i ever had. Very versatile because of the different shapes you can do with them. Not cheap, but worth it!",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "heythxvoo",
                                                            "body": "Thank you! Do you have quiet or clicky? How many do you generally fidget with?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "GVirus1984",
                                                                    "body": "I backed the quiet series 2 and have 2 sets with 12 pieces (wanted the glow in the dark ones lol).\n\nAlso have 12 clicky old ones (they are out of print and they don‘t make them anymore!).\n\nI like both! The series 2 are better in quiet environments (though they still make some noise, had one time where a participant in a meeting was bothered by them) and are bigger in form, also softer to the touch.\nBecause they are bigger i can use them with one hand and don‘t need to look at them.\n\nThe 2 sets are great, i have one at home at my couch to use when i watch videos or other stuff and one set in a case in my backpack for meetings, my therapie sessions and other occasions.\n\nThe clicky ones are only for home use, because they are really loud (louder than a ballpoint pen). They have a more plastic feel to it and are smaller.\nI still like them when i am alone and i do something quiet, the clicks then are a second stimulant for me.\n\nSo they have different uses for different scenarios. The same goes for how many you use.\nMost of the time i use 6 pieces, because that‘s the sweet spot for one hand use for me. But sometimes i use 8 or all 12.\n\nIn the box is a qr code that sends you to their youtube channel and they show you some figurations and forms you can use 6/8/12 of them!\n\nAnd i recently ordered 12 new ones from the new gemstone collection (because why not 😅) and black clicky ones before they are out of print. Just to have more of them. 😄",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "heythxvoo",
                                                                            "body": "Can’t thank yo enough to typing this all out.  Think I’m gonna get the classics bc they are on sale and the series 2 so I can use in public setting.  I’ll come back here when I get them. 🙏",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "heythxvoo",
                                                                            "body": "Do they ever mess with your watch if you wear one?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "heythxvoo",
                                                                            "body": "Ordered them right after our exchange here.  They showed up over night. I was so excited this morning to get them.  Something didn’t feel right w the package.  Opened the package (untampered with) and then pulled out the product package and it was empty. 😭😭😭",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GVirus1984",
                                                                                    "body": "Damn i‘m sorry :(\nHope their support can fix it right away and send you a replacement!\n\nAnd hope mine don‘t have that problem. I‘m in europe and paid lots of taxes and shipping fee‘s on top. 😅",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "heythxvoo",
                                                                                            "body": "Haha thanks. I ordered from their Amazon store bc of the super fast shipping.  Looks like an ADHD clepto packed my box!   I already ordered another, should be here tonight or tomorrow morning.  And filed a return for the first order. ",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "coffeegirl2277",
                    "body": "For me, I did have untreated eczema and acne but the worst part was my anxiety was so high that I couldn’t/can’t control the picking although I’m much better. If you can, go see a dermatologist and if you take meds, tell your med manager/psychiatrist.",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "Cultural_Iron2372",
                    "body": "Same. It tortured me as a kid, I got so bullied for it but always made to think I was “crazy.” 😢😢Thanks parents💀. I could NOT stop. I struggled so badly with it and I still have scars as an adult.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Celtic5055",
                            "body": "It sucks that we struggled but we can't really blame them for what they didn't know. My parents were clueless about a whole host of things and I guess I can't hate them for it anymore than I'd hate on people who are illiterate or how people used to smoke in hospitals back then. Its just ignorance...that's how I've made my peace with it. \n\n\nNow if they do know and they're just being dicks that's a different story",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "basketma12",
                    "body": "I highly recommend tretinoin ( retin A) for that. Yes,  it's more known as a wrinkles reducer but it was originally for acne. It helps scars too. A gel, or cream.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "AcheeCat",
                    "body": "I pick at scabs.  And peeling skin from sunburns. I never realized that was potentially ADHD related till now.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Eeneranig",
                            "body": "Wow, I had no idea peeling skin from a sunburn was ADHD related or picking my chapped lips to peel the skin off…I am just diagnosed 6 months ago at 50. My family knows I love peeling sunburned skin. It really gets out of hand some summers 😐",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SK83r-Ninja",
                    "body": "I have scars on my face, hands, chest, and back from it lol",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Petraretrograde",
            "body": "I dont allow myself to keep tweezers in the house bc there is NOTHING more satisfying than tweezing out ingrown hairs one by one.",
            "score": 237,
            "replies": [
                {
                    "author": "illicit-discharge",
                    "body": "Every boyfriend I've ever had (2) has just accepted that any time, any place I find an ingrown hair on them, it's gotta come out. It's like a gold mine when I find one that they've let harden and heal on its own (???howtheydothat?) because it just dislodges this satisfying package of follicle log",
                    "score": 137,
                    "replies": []
                },
                {
                    "author": "surrepTRISHious",
                    "body": "I'M NOT ALONE!",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Petraretrograde",
                            "body": "How many infections have you caused? I have a few scars, that's why I no longer keep tweezers",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Still_Bottle_5732",
                    "body": "Especially when they have those big goopy roots.",
                    "score": 82,
                    "replies": []
                },
                {
                    "author": "rotweb",
                    "body": "this takes up 3hrs of my non-medicated days and removing tweezers from the bathroom is the only solution for me 💀💀",
                    "score": 25,
                    "replies": [
                        {
                            "author": "heythxvoo",
                            "body": "What medication are you on?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Noneofyourbusiness70",
            "body": "Yall. If it weren’t for the adhd subreddits im apart of, I would believe im crazy. For real. Every doctor I have had, physical or psychological, has been baffled by my skin picking. One therapist called it self harm, another wondered if I had OCD. The way ADHD is portrayed to this day infuriates me. \n\nAnyways. No advice, but obviously, I’ve been there.",
            "score": 356,
            "replies": []
        },
        {
            "author": "breadmakerquaker",
            "body": "It’s so hard to get into a time-black hole and suddenly realize how much has passed.",
            "score": 126,
            "replies": []
        },
        {
            "author": "Defiant_Locksmith190",
            "body": "Oh so this is what it is! I’ve been doing it for decades, especially when going to school and having to study for a test or something. Instead of studying or when anxious I’d skin pick or cut my split hair ends one by one. I had no idea I’m not alone 🥺",
            "score": 76,
            "replies": [
                {
                    "author": "isellseashells",
                    "body": "Dude omg me too and I have never heard of other people doing this.. but there's tons in this thread. I also never clocked this as being related to behaviors like skin picking, for example, but it makes total sense.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Defiant_Locksmith190",
                            "body": "It’s almost like some sort of stimming",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jabberwockxeno",
            "body": "What meds do you have that STOPS you from doing this?\n\nAll the ADHD meds i've been on *make* me hyperfocus in on one task for hours, it arguably makes it harder for me to shift from task to task productively",
            "score": 78,
            "replies": [
                {
                    "author": "han_brolo14",
                    "body": "I have this issue with my meds too. They work super well once they kick in but I gotta make sure I’m doing the thing I need to be doing, otherwise I get locked into whatever thing I was doing while waiting for them to kick in and “five more minutes”ing my entire day away",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "miniZuben",
                    "body": "Might want to speak with your doc about changing your meds or dosage. Medication should give you the ability to choose your focus and make you less susceptible to the whim of your impulses. It doesn't sound like yours help with executive dysfunction much, if at all. ",
                    "score": 18,
                    "replies": [
                        {
                            "author": "jabberwockxeno",
                            "body": "I've never been on ADHD meds that have done that, they all either have really done nothing, or made me hyperfocus on one task once they've kicked in\n\nAnd I have tried a lot, hence me wondering what OP is taking, since having one that does that would be helpful",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rigabamboo",
                    "body": "My ADHD medication doesn’t help with this, but I have noticed that I don’t engage in skin picking behaviors when I’m on an antidepressant. ",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Significant-Bake-409",
            "body": "Ugh I did this yesterday but on my meds, as they hit🥲only lasted about 30mins thank GOD but I got so mad at myself when I stepped back and looked in the mirror at the spots I had made worse and the redness I caused. I’ve been really good the past 2 weeks for not picking my face, my skin was actually really chill, I just thought it would be a good time to go in for some non irritated clogged pores and blackheads🥲 The Japanese Lion Pair acne cream is great for this though",
            "score": 48,
            "replies": [
                {
                    "author": "AdRegular1647",
                    "body": "The little silicone patches are magical they work so well. Slap them on before bed and marvel at how they clear pimples and blackheads up.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "SunshinePrincess_",
            "body": "HEY YALL LISTEN TO ME!!!      \nThis happened to me. Then I felt I couldn’t get them good enough so I got one of those metal tools for it. I now have a permanent red spot on the front of my fkn nose because apparently you can push too hard and .. do this I guess !! I’m telling you it’s been years and the mark is still there. Be careful!",
            "score": 40,
            "replies": []
        },
        {
            "author": "Dazeofthephoenix",
            "body": "Oh god, this is me with trimming split ends with nail scissors.",
            "score": 35,
            "replies": [
                {
                    "author": "shadowfax024",
                    "body": "Omg me too I can’t even let myself look at my hair anymore",
                    "score": 16,
                    "replies": [
                        {
                            "author": "isellseashells",
                            "body": "Ugh same",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Visible-Row-3920",
                    "body": "Wow I never realized this was an adhd thing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ptheresadactyl",
            "body": "I am normally a religious showerer. I have showered every day without fail for all of my adult life (I only wash my hair every couple days though). The idea of running errands unshowered repulsed me. But lately I've been so fucking spent. I brushed my teeth, pulled on jeans and a toque and ran out to grab cat food and return an item today.\n\nSometimes, shit just happens dude",
            "score": 30,
            "replies": []
        },
        {
            "author": "Liberty32319",
            "body": "Sometimes my meds kick in and I do this anyways lol I will search for something to pop",
            "score": 20,
            "replies": []
        },
        {
            "author": "MsScrewup",
            "body": "I do this medicated. I can spend 2+ hours on my nails alone. Other favourites include face, forearm bumps, and ingrown hairs downstairs. It's been a lifelong habit and I think it's gotten worse medicated (8 months in)",
            "score": 23,
            "replies": []
        },
        {
            "author": "Double-Character74",
            "body": "The single blackhead popping turning into a whole session is something I know well too, I completely understand how it feels. \n\nI have a little routine in place for myself now when I’ve accidentally spent two hours decimating my face:\nWash my face with a cleanser, rinse with cold water to reduce any redness/swelling, pat my face dry, cover any spots I’ve popped with a thin layer of benzoyl peroxide gel and then put some of those spot stickers over them. Really helps to reduce inflammation and make sure they don’t get infected/spread.\n\nI also make a conscious effort to not look in magnified mirrors or stand too closely to the mirror when getting ready. Obviously sometimes I still do end up in popping sessions but they occur way less frequently than they used to!",
            "score": 20,
            "replies": []
        },
        {
            "author": "shadowfax024",
            "body": "I have fallen into time and space more times than I’d like to admit, and it doesn’t feel great when you realize you don’t know where the time went. :(",
            "score": 18,
            "replies": []
        },
        {
            "author": "Sea-Inflation5329",
            "body": "Throwback to me spending an allnighter pulling my hair instead of cramming for an exam that I legitimately needed to study desperately  🫡 i fear i related too hard to this",
            "score": 11,
            "replies": [
                {
                    "author": "han_brolo14",
                    "body": "Literally did this with my split ends three nights in a row this week. I’m so exhausted and my hair is looking miserable 😭",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lamour_de_Dieu",
            "body": "This is literally my life, meds or not.",
            "score": 15,
            "replies": []
        },
        {
            "author": "GorillaTrainer",
            "body": "Ugh, me with the tweezers and my brows 😭 or when I need a bang “trim”",
            "score": 8,
            "replies": [
                {
                    "author": "Effective-Bug3638",
                    "body": "Me too. Most days I couldn’t care less about whether or not I have neatly plucked eyebrows, but if I happen to see a stray brow hair and decide to pull out the tweezers to get, time immediately disappears to the task.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "reactiveseltzer",
            "body": "Most relatable post of the day",
            "score": 8,
            "replies": []
        },
        {
            "author": "Mytsic",
            "body": "I always called this \"getting stuck\" 😭",
            "score": 8,
            "replies": []
        },
        {
            "author": "Significant-Point98",
            "body": "So freaking real. This happens to me all the time. I’m in treatment for my BFRBs (body focused repetitive behaviors) and I’d definitely recommend doing some research and talking to a therapist about strategies for mitigating.",
            "score": 6,
            "replies": []
        },
        {
            "author": "lemetellyousomething",
            "body": "What does it mean when I take my meds every day and still spend 2 hours picking at my face?  \n\nAre my meds not working? Are they working too well? I need to not have a magnifying mirror…\n\nEdit: OMG I just read all the other comments and I am relieved that I am not the only one!!! \n\nI will watch hours of pimple popping and tweezing videos on YouTube. I once had my work computer signed into my gmail and IT was remotely controlling my computer to fix something when they opened YouTube to show me something and the suggested videos were all thumbnails of exaggerated pimple popping stills. I was so embarrassed, it might as well have been pornography.",
            "score": 8,
            "replies": []
        },
        {
            "author": "No_Affect_1579",
            "body": "I do this most nights after my meds have worn off. \n\n39m diagnosed about a year ago...just realizing that I've done this ever since I can remember, even as a teen🤔",
            "score": 6,
            "replies": []
        },
        {
            "author": "psycheledic_vegano",
            "body": "I thought I would take my Saturday morning medication later. I forgot to take it altogether. It’s now Sunday afternoon and I took the medication. I’ve been lying on the couch for two days, doing nothing. Luckily I took the medication now. I’m going to wash up and go out.",
            "score": 6,
            "replies": []
        },
        {
            "author": "PissyMillennial",
            "body": "Lucky y’all, when I don’t take my meds I just pass out whenever I lay down.",
            "score": 6,
            "replies": []
        },
        {
            "author": "rebeccalul",
            "body": "I’m feeling called out 😭🤌",
            "score": 3,
            "replies": []
        },
        {
            "author": "CampaignFresh5315",
            "body": "There was a time when I had to cover every mirror in my house with a towel because I knew the moment I saw my face I would pick at it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "crisscrossed",
            "body": "Not me seeing this mid pre-shower pop",
            "score": 3,
            "replies": []
        },
        {
            "author": "BritBrat_123",
            "body": "Today I sat down and had 1 hour to do 15 min of makeup and if traffic were any worse I’d have been late to work🙃",
            "score": 2,
            "replies": []
        },
        {
            "author": "PsychologicalMilk904",
            "body": "Can’t decide which is worse: this, or watching 2 hours of videos of other people popping blackheads and cysts. I’ve done both.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ratkween",
            "body": "I ended up doing some OCD treatment based therapies with my therapist. Helped to curb a lot of the fixation behaviors I was having. Not perfect, but I've done way less damage to my hair skin and nails 😖",
            "score": 2,
            "replies": []
        },
        {
            "author": "Front-Bat580",
            "body": "Just learnt something new about myself lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pearlsandmilk",
            "body": "God I feel so seen😏😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rude_Needleworker_98",
            "body": "i do this often and had no clue it was an ADHD symptom lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sadiep144",
            "body": "Most relatable post ever",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chemical_Afternoon25",
            "body": "Omg are you me?!??! You are not alone I have done this sooo many times",
            "score": 2,
            "replies": []
        },
        {
            "author": "fluffypotato",
            "body": "I once locked myself in my bathroom as a kid and proceeded to tear a large section the textured wallpaper off the wall-small piece by piece. Ended up exposing a large 2x2 section of the wall.",
            "score": 2,
            "replies": []
        },
        {
            "author": "anxiouscaterpillar87",
            "body": "This is unfortunately a daily occurrence for me and takes so much time out of my day. It has caused me to be late on assignments. It SUCKS. I'm so sorry you deal with this too and I share your frustration. Hoping it gets easier for both of us one day.",
            "score": 2,
            "replies": []
        },
        {
            "author": "new2bay",
            "body": "Look at it this way: at least you didn't get stuck in a rabbit hole of Youtube pimple popping videos. 😂",
            "score": 5,
            "replies": []
        },
        {
            "author": "fartoofrai",
            "body": "Fucked up cause I would get bored at work (wfh), and wait for my meds to kick in JUST so I could pop. Once you pop, you can’t stop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable_Gold7210",
            "body": "this is so real",
            "score": 1,
            "replies": []
        },
        {
            "author": "electric_shocks",
            "body": "Shouldn't you do that after showering?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thinkingtoast",
            "body": "Been there! On the plus side if I’m very careful about it and take care of my skin after I have blackhead free nose flesh for a bit",
            "score": 1,
            "replies": []
        },
        {
            "author": "rosiegal75",
            "body": "Omg, I had a sore under my pony tail for 3 yrs cos I couldn't leave it alone",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jenafur1986",
            "body": "Omgggggg I do the same thing!! it makes me feel better that there’s other people out there that can do that for so long and just get lost in the mirror doing it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive-Half135",
            "body": "Yeah I do that too sometimes. Kinda sucks when your 28 and have scabs all over your face because you got distracted in the mirror and popped anything that would pop",
            "score": 1,
            "replies": []
        },
        {
            "author": "flowerandpetals",
            "body": "I used to do this. But now I still skin pick, just not while the shower runs in the background. I also used to pick in the shower as well, but thankfully I’ve found a solution that works for me: I try to shower with the lights off. I also try to not turn on my bathroom light at all so I can’t see my face enough to find things to pick at. I have a nightlight in my bathroom to see enough to function, and sometimes I light a candle to provide a little more light while I shower. This works because I usually shower at night, but I still sometimes turn on the light for whatever reason and end up picking for a long time before I can get myself to stop. Once the damage has been done, clean the area and keep it moist to help with healing and scarring! Vaseline slugging seemed to break me out more, so I use pimple patches and they reallyyy help.\n\nSide note: I want a shower clock to help with time blindness in the shower, but I also want the lights off to keep me from picking. So, I will look for a shower clock with a light for the face of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "woozietina",
            "body": "pls tell me what meds these are ive been doing this every day for the past 5 years i cant function they tried to give me prozac for it LMAO",
            "score": 1,
            "replies": []
        }
    ]
}