{
    "title": "Shoes! I find my executive function is so much better when I put on shoes?",
    "author": "My_reddit_strawman",
    "subreddit": "ADHD",
    "rank": 430,
    "score": 61,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/ADHD/comments/1j1vhp6/shoes_i_find_my_executive_function_is_so_much/",
    "id": "1j1vhp6",
    "selftext": "Is this true for anyone else? Suppose it’s Saturday morning and you know there’s a bunch of stuff you ought to do around the house. You’re wearing flip flops or slides or slippers and just can’t motivate. You put on a good pair of sneakers and well fitting socks and boom all of a sudden can start doing. Anyone or is it just me ?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/My_reddit_strawman and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdImmediate9569",
            "body": "Pants for me. Like pants v sweats",
            "score": 21,
            "replies": [
                {
                    "author": "sonorakit11",
                    "body": "Omg YES. Tight pants for business. Loose pants for chillin.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "AdImmediate9569",
                            "body": "Work medium \nPlay medium\n\n😎",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "cheese_incarnate",
                                    "body": "I need this on a bumper sticker or motivational poster or something.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Edfin1",
                    "body": "pants & shoes is the ultimate combo, that's why I got a pair of slippers that feel like actually shoes to walk around my house",
                    "score": 6,
                    "replies": [
                        {
                            "author": "AdImmediate9569",
                            "body": "May try that!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Edfin1",
                                    "body": "works like a charm!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gene100001",
                    "body": "Unfortunately for me I have a very anxious cat at home and whenever I put on pants he gets really stressed (I think he's used to me walking around in my undies). He's a bit of a weirdo but I love him.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "42tooth_sprocket",
                            "body": "lmao surely he'd get used to it?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "gene100001",
                                    "body": "He's slowly getting better but he'll still usually go and hide when I put on pants lol. I got him as a rescue a few years ago when he was around 2 years old and I think he must've had quite a traumatic life before I got him. I literally couldn't touch him for about 6 months. He would hide under the bed and I'd bring him food there, then he would use the litter box while I was asleep. \n\nHe's getting a lot better though. Usually he's very cuddly with me. Helping him trust again has been a really rewarding experience. He just gets triggered by random changes from what he's used to (like me wearing pants lol).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AdImmediate9569",
                                            "body": "Is it not that he thinks you’re leaving when you put on pants? \n\nMy dog loses it when he sees me getting ready to leave",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "gene100001",
                                                    "body": "I'm not sure, because he also does it when I come home wearing pants. For a long time I thought it was because he would forget who I was while I was away but now I'm really starting to think it's the pants thing, even though it doesn't make much sense",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "42tooth_sprocket",
                                            "body": "poor guy",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "gene100001",
                                                    "body": "Yeah, I'm trying to give him a good life to make up for his past. These days he's a lazy chubby cat who's living the good life and sleeping most of the time",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HellaMadScientist",
                    "body": "Came here to say just this!! I WFH and if i don't out on my \"work\" pants in the morning, im not going to get work done.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnimalKaleidoscope",
            "body": "I’ve noticed this too. Especially on work from home days, I’ll walk my dog and if I leave my shoes on, it’s like magic and I knock out a bunch of stuff. If I take them off, I rot on the couch.",
            "score": 7,
            "replies": [
                {
                    "author": "Edfin1",
                    "body": "I genuinely wish I understood why this is so relatable",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WishboneEnough3160",
            "body": "100%! The trick is getting fully dressed, shoes on, hair and makeup done (if you regularly do this).\n\nThe worst thing for executive function is just laying around, unkempt, doom-scrolling.",
            "score": 6,
            "replies": []
        },
        {
            "author": "BadMawma",
            "body": "I bought a pair of clearance Skechers to wear only inside the house for this reason!! I hate shoes inside the house, so this was a great compromise.",
            "score": 6,
            "replies": [
                {
                    "author": "DewyintheDesert",
                    "body": "I did this too! I have inside tennis shoes when I’m cleaning. I do not wear them outside the house.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BadMawma",
                            "body": "We are hacking life! Even on days off, I get into real clothes immediately. The nicer sweats lol. This also helps. What else do you do? I love these threads for the ideas.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DewyintheDesert",
                                    "body": "We sure are! Getting fully dressed and ready for the day will absolutely make or break my day. If I get ready, I’ll run errands that I’ve put off. I use the mantras “If I sits I quit” and “don’t put it down, put it away.” They help a lot.   \n\nSometimes when I’m struggling to get started on tasks, I’ll pick something small that gives me instant gratification. For example, I’ll put in a load of wash, sweep the floors and vacuum the living room rug. Then switch the wash last. It’s quick, the house looks crisp and one load of laundry is done. \n\nFinishing one room at a time is a big one. It is very hard for me to do. I bounce around the house putting things away as I see them. By the end of the day, it looks like I didn’t complete much even though I never stopped moving. \n\nI need more tips too. This community is incredible! 🙃",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AKAEnigma",
            "body": "I was just reading about this.\n\nRead a guide to keeping your house clean that is built around habits.\n\nOne of those habits is wearing shoes that lace up. It's harder to veg out on the couch when you're wearing shoes. \n\nBeen thinking lately that my habits improve when I shave regularly, wear 'hard' pants (jeans, not sweats), do my hair, etc.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Reality_Concentrate",
            "body": "This is probably true, but I do not wear my shoes inside the house. It’s gross. Maybe I could buy a pair of shoes to wear inside, but never outside the house.",
            "score": 3,
            "replies": [
                {
                    "author": "iAmSpAKkaHearMeROAR",
                    "body": "I have shoes that I wear in the house and I also have slippers that feel more like shoes than slippers. Some days I have to change my shoes and socks mid day to keep them from feeling cold and icky. ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DewyintheDesert",
                    "body": "I have one pair of cleaning tennis shoes that do not leave the house. We do not wear shoes in the house either.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pztch",
            "body": "I bet it’s to do with “discomfort”. Not quite pain, just discomfort.\n\nThe discomfort of not having shoes on is just enough to stop us doing anything that is absolutely necessary, but, we can get over the discomfort for something that is not work, or chores, or necessary. Things like getting up off the sofa to get a cup of tea is very possible without shoes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "cheese_incarnate",
            "body": "I work from home so it's really, really easy to just not get 'dressed' everyday and work in PJs but I've found that when I DO get dressed, it tricks my brain into being in business mode a little more.\n\n\nSame for weekends, first thing in the morning. If I force myself to get ready at the bare minimum...put on fresh, clean and matching clothes (even if they're still comfy clothes) and just a little hair & makeup, it helps. That way I don't fall into this paralyzing trap of 'I have to go run an errand but I have to get ready first UGH'. I'm already ready.",
            "score": 3,
            "replies": []
        },
        {
            "author": "intuitive999empath",
            "body": "we are so very sensitive to our environments😭 the days where everything feels wrong no matter what u wear are the worst loollllll 😩😂 no clue how to be less sensitive",
            "score": 2,
            "replies": []
        },
        {
            "author": "petrparkour",
            "body": "Totally! For me I need either shoes on. Or jeans. One or the other to be productive. If I have sweatpants and shoes on, I can stay productive. If I have jeans and socks on, also good. But I stay in sweatpants and socks, game over.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Blackcat0123",
            "body": "I pretty much live in my gym gear, because if I'm already wearing active wear, then I might as well be active.",
            "score": 2,
            "replies": []
        },
        {
            "author": "saandinista",
            "body": "When I'm unmotivated to do my daily workout, I just put my shorts on so then I have no choice but to do it. Same when I want to go cycling but can't decide if I should go or not. Sometimes my body just switches to auto pilot mode when I'm overwhelmed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_your_face",
            "body": "In general it’s snug well fitting stuff. It’s like little hugs all over your body to help manage stress and distraction. Like those stress jackets for dogs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "UnclePuffy",
            "body": "As someone who had struggled with untreated ADHD, anxiety, and depression for my entire life, I thought I hit the jackpot when I started working from home 12 years ago. Sure, it was nice for the first year or two, but then I realized that going to work used to be one of my only social activities. I used to have to take a shower and get dressed for work every day, but working from home, I obviously didn't, which led to some really bad habits of not taking care of myself, and everything got a *lot* worse. Finally, I started taking my ADHD seriously last year, which helped immensely with the anxiety & depression, and one really big thing that really helped was instead of showering a couple of times a week like I had been, I started getting up every day and taking a shower and getting dressed as if I were going into the office. It's been a real life saver.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OllieKloze",
            "body": "I need to be wearing jeans or I can't do computer work",
            "score": 1,
            "replies": []
        },
        {
            "author": "grlie9",
            "body": "for me its a bra",
            "score": 1,
            "replies": []
        },
        {
            "author": "lillythenorwegian",
            "body": "Also for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual_Hand_3324",
            "body": "I have to get dressed for the occasion. I was raised by TV. If I don't, I sort of flair about looking for my \"build\" for the day/occasion...maybe I was raised by games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldStorage9925",
            "body": "yeah not as many distracting sensations with shoes on",
            "score": 1,
            "replies": []
        },
        {
            "author": "whatisitcousin",
            "body": "That's a good idea. I think I do start getting more things done when I put on shoes too. I think I'm gonna put them on right now!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medullan",
            "body": "Ugh I hate how true this is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DewyintheDesert",
            "body": "I feel like I could have written this myself!",
            "score": 1,
            "replies": []
        },
        {
            "author": "l00ky_here",
            "body": "Shower and clothes for me. As a stay at home, live alone, nudist, no clothes means not opening blinds to let light in to show off lovely mess. No clothes means no taking out trash. No shower means cant be in public.\n\nDo any of the above (shower, get dressed) and if I took meds?..stuff gets done!",
            "score": 1,
            "replies": []
        },
        {
            "author": "superjen",
            "body": "The FLY Lady system of housekeeping you can look up online works by building little habits and routines - getting dressed including shoes every morning is one of the first steps included. \n\nIt really is a good system if your house is a wreck all the time even though it's a really corny website aimed at stay at home moms for the most part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weird_Positive_3256",
            "body": "Lace up shoes are super helpful for me. They keep me from settling in on the couch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aquatic-dreams",
            "body": "Absolutely, If I need to get shit done, when I wake up, I get dressed and put my shoes on.\n\nWearing shoes means it's work time.",
            "score": 1,
            "replies": []
        }
    ]
}