{
    "title": "Minor inconvenience: body care",
    "author": "MarySaoirse",
    "subreddit": "ADHD",
    "rank": 458,
    "score": 16,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j206ne/minor_inconvenience_body_care/",
    "id": "1j206ne",
    "selftext": "31 year old man here who quite recently discovered he has ADHD and is now looking at every aspect of his life and going: “AHHH… of course…”\n\nOne minor inconvenience I’ve always encountered is body care. I manage to take care of the basics, the bare minimum: wash myself, take care of my teeth and not smell bad, so that’s good. However, I struggle with all the “extra’s”: my hair is always slightly too long, I like a clean shaven face but I always have a stubble or a beard, my nails are always slightly too long, I don’t take proper care of my skin, my clothes are slightly damaged et cetera.\n\nIt’s probably only me who has a problem with this: I don’t think other people see me as “that one smelly/bad looking/messy guy”. But still, I’d love to put some more love into my overall appearance and my body, because I deserve that (flips hair back). How do you people go about it? Where do you find the time and focus to do this? Any tips for a basic routine or different ways to approach this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/MarySaoirse and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wonderful-Count-7228",
            "body": "I'm the same way. I either hyperfocus on body care or completely ignore it. I mean beyond the basics",
            "score": 11,
            "replies": []
        },
        {
            "author": "TheJackFactor",
            "body": "Habit stacking is one of the easiest ways to introduce something. Since you are already diligent about showering, keep your nail clippers in the bathroom in a visible place so you can clip them right out of the shower while they're soft.",
            "score": 4,
            "replies": [
                {
                    "author": "sexchoc",
                    "body": "I never thought about this. I keep my clippers at work because I work with my hands, so that's when I notice they're long.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Cartographer_6086",
            "body": "The solution is to stop what you're doing at 4pm every day and spend one hour on stretching, some cardio, then shower and self care for one hour every day.  \n\nI've never ever succeeded in doing this even once but I think about it every day and it sounds like a great idea. :)",
            "score": 5,
            "replies": [
                {
                    "author": "SubjectOrange",
                    "body": "😂 this is the most perfect comment ever. I feel like I have all the answers but none of the follow-through. Maybe, if we start with an alarm at 9pm and spend 15min washing our face and, in my case, plucking? I've had it last a week or 2 at a time but never forever.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}