{
    "title": "Feeling jealous of people who can do more",
    "author": "SnooOwls6520",
    "subreddit": "ADHD",
    "rank": 417,
    "score": 4,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2fsrl/feeling_jealous_of_people_who_can_do_more/",
    "id": "1j2fsrl",
    "selftext": "Hi, I was just wondering if anyone feels the same way I do when it comes to other people whom have ADHD. - this turned into a kind of rant I’m sorry\n\nI see so many social media influencers and people in my real life who have ADHD but then go on to do amazing things and seem to not actually struggle through life? For example there’s a doctor whom I watch on YouTube and they have ADHD, work full time as a doctor and post a new video every week which they edit themselves, they’ve ran a marathon recently and are constantly talking about self-care but with what time? As someone who is severely impacted by my ADHD I cannot even comprehend that this is possible for someone with ADHD, this kind of lifestyle is surely not suited to someone whom struggles with executive dysfunction and just making sure I’ve showered and eaten that day is a huge task.\n\nThis is not me putting them down at all, it’s amazing that they can do that, but even people without ADHD would find this lifestyle unbearable to keep up with. Maybe I’m completely wrong and people who have ADHD can do this, I have other co-morbidities so I guess that would impact me too but idk. I think I’m just a little jealous that people who are ‘like me’ can manage that well and I then feel like the whole ADHD diagnosis is pointless because isn’t the whole point that it has to be bad enough to impact your life? \n\nAnyway, I just hoped that someone else would feel the same way and I’m not completely alone in this feeling😆",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/SnooOwls6520 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sakikome",
            "body": "I feel the same way. \n\nRationally, I know people have different symptoms, different severity of symptoms, different comorbidities and different circumstances in their life, different support systems. Also, especially with online content, people appear more put together and perfect because that's what appeals to viewers. It's not that their ADHD doesn't impact them - you just don't see how it does. \n\nHowever, emotionally? I hate how I didn't get diagnosed until I was in my early 30s, I messed so many things up in my life because of it, and even now with treatment I just waste away half the time and I'm so sick of having to fight through every single day, it does lead to me resenting people who ~struggle with ADHD~ while having good relationships, a job, a future they look forward to. I realize that while the place those emotions come from is valid, it's not exactly constructive to indulge in these thoughts.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DatoVanSmurf",
            "body": "I think having people that work in a field where you see them is skewing your image. Everybody is different and has different abilities. You see these people becaude they have the ability to do these jobs. \nMost of my friend have adhd and are barely able to survive on their own. I'm \"too disabled to work\" because of my AuDHD. And because I have a secure life, living with my mum and getting money from the state, I am able to do things where my friends who have to work with all they have, think are insane tasks that they couldn't do. Not seeing that i couldn't do shit if i had to work the same amount they do (or even less).",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mediocre-Special6659",
            "body": "I think this post has a good point and this type of stuff isn't brought up enough. How do these successful people get to this point? I would be curious to know that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Intelligent_Ask4660",
            "body": "Even with myself there were times when I did things which at the time were no big deal but in hindsight (66 years old) I guess I'm jealous that those times are long gone. At the same time I'm able to look at things in a much more balanced way. I could never see the big picture when I was younger. Time steals away so much but since nature abhors a vacuum one just needs to   appreciate the trade off. Maybe a little off topic. I need a nap",
            "score": 1,
            "replies": []
        }
    ]
}