{
    "title": "Symptoms feels worse since you acknowledge ADHD ?",
    "author": "Pozpy",
    "subreddit": "ADHD",
    "rank": 320,
    "score": 67,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2gkug/symptoms_feels_worse_since_you_acknowledge_adhd/",
    "id": "1j2gkug",
    "selftext": "\n\nI have this feeling that as soon as i got to acknowledge my adhd symptoms got worse or just that i never realized how hard it was. Like all of a sudden I actually NOTICE that I just can't concentrate, that I developed coping mechanism in order to try not to forget anything (i still do or can't bring myself to do the thing), I struggle sooooo much with executive dysfunction and its not just that I don't want it's my brain !!!! It all get like SO real like I'm not just lazy or distracted or yk, it's actually above me and it feels soooo weird. Not to mention the hyperactivity part bc I always thought i was i lazy \"do nothing\" while my brain is like in constant \"movement\", i stim so much i never realized, I get so frustrated when its slow and everything like you know what do you mean in the end i'm not just a drama queen ???\n\nDid you guys went through the same thing ? :')",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Pozpy and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontTrustTheDead",
            "body": "You ever have one of your friends or relatives buy a make and/or model of car that you’ve never seen before? And then you see them everywhere? It was a lot like that for me. It took me a while to realize I just had my eyes a little more open now, and I knew what to look for, but at first it felt like I was screwing things up a lot more. It was sobering to realize I always had been!",
            "score": 20,
            "replies": []
        },
        {
            "author": "DatoVanSmurf",
            "body": "Yep, that's perfectly normal. I was diagnosed with autism first and afzer that i felt like i had unlearned how to be a human. Your brain is now rewiring, because it has found something that is connecting all the things. And the brain is also extremely good in recognizing a pattern after it has been seen. Like when you lesrn about a soecific type of car for the first time and suddenly you see them everywhere. They've always been there, you just weren't aware of it. Try to just let your brain do all the rewiring while also trying not to worry about it too much. Knowing what symptoms you have will allow you to better work with them in the future. And i think it's also crucial to understand and allow yourself to acceot that there are things that can't be changed and to not work against them.\nFor me for example one of the things that has asways drained me the most was sensory processing. I realised that rhere's no \"just fighting tgrought it\" and no exposure therapy that can help, so i listen more to my body when i am actually out of energy and then i can decide to not go do that social thing, even if i want to, brcause i know it will leave me exhausted for multiple days.",
            "score": 13,
            "replies": []
        },
        {
            "author": "FearlessCloud01",
            "body": "Still going through it.\n\nIn my case, I found out about the possibility and things started clicking in place. The months between my realisation and the official diagnosis were miserable. I knew it to be the case and really wanted it to be the case but I was filled with paranoia. And self-hate. Because my brain knew something was actually wrong and was freaking out but since it wasn't confirmed, neither me nor my brain knew what to do. Cue extra potent symptoms and an increased self-hate as a result.\n\nAfter the diagnosis, I really wanted to talk and joke about it with friends and family. But a lot of the older generation kind of shut that down due to fear over prevalent misconceptions.\n\nNevertheless, I found that giving myself a wider berth helps a bit. Like, I know that my ADHD's gonna act up so I've learnt to accept more of my issues as something out of my control. This has significantly reduced my self-hate. (Some amount still lingers but it's significantly less than pre-diagnosis)\n\nIt does get a smidge annoying once in a while now that I know about it. But I've found that just letting yourself free to make mistakes helps a lot.\n\nAt least, now I don't react negatively to things unless it's a constant and repeated issue that's really messing with my head.",
            "score": 5,
            "replies": []
        },
        {
            "author": "shurker_lurker",
            "body": "I feel similar and I started actively pushing the analysis of ADHD out of my head. I was spending a lot of time trying to understand how much about me was ADHD and I was feeling like it was amplified and crippling.\n\nAnd I try to get my 11 year old to not rely on it to expect to not have to take on age appropriate responsibilities (especially since we're both battling with executive functioning shit so she needs to manage her shit while I manage mine).\n\nIt's a lot...it's not the end",
            "score": 4,
            "replies": []
        },
        {
            "author": "SkidsOToole",
            "body": "I feel like Bruce Willis at the end of The Sixth Sense, where he starts to realize it was always that way all along.",
            "score": 5,
            "replies": [
                {
                    "author": "Pozpy",
                    "body": "It's giving \"Agatha all along\" vibes (the song in Wanda vision)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SkidsOToole",
                            "body": "That too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Liploxxx",
            "body": "Hopefully it brightens up for you, me finding out about having adhd helped me tremendously. Clarified a lot of things that I thought negatively about myself, helped me understand why I did/do the things I do/did. I understand it can feel like an overwhelming burden but I hope it will shed light, clarity and be a peace with that. Xx",
            "score": 3,
            "replies": []
        },
        {
            "author": "silentprotagon1st",
            "body": "A diagnosis makes the brain feel safer. we have been overcompensating and blaming ourselves. it’s not strange that the brain takes a well earned break and lets its guard down once we realize it was never our fault",
            "score": 3,
            "replies": []
        },
        {
            "author": "FnEddieDingle",
            "body": "Diagnosed at 55...Explains my entire life.. It's great to finally have some answers, but it really sucks at the same time",
            "score": 3,
            "replies": []
        },
        {
            "author": "SilverstarTBS",
            "body": "Yep, going through this right now. Just got put on meds, which made me realize just how much I need them. They're not working the best right now but I'm on the lowest dose so that's expected. I never realized how unfocused and unmotivated I am at work until now. I knew about the issues in my home life but I thought I was fine at work. Apparently not!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ItsChinatownJake101",
            "body": "It’s ok! This happens! The first 2 years I was worse and adhd/ trauma was my whole personality as I was coming to terms!!! I’m sure it was frustrating for a few people but that’s where I needed to be! Go at the pace you need! Take your time, it’s a huge shift in understanding yourself, honoring your limits and redefining your relationships, and grieving the past. Learning about adhd, connecting and venting online literally got me through the last two years! I needed to have the same angry drama queen meltdown conversation 40 times! A lot of feelings needed to be acknowledged and released. And the internet gave me space to do that lol. The energy has to be purged! Do what you need to do for you 🤍",
            "score": 3,
            "replies": []
        },
        {
            "author": "Golintaim",
            "body": "This is why I'm trying to get my diagnosis, it feels like until there's paper saying yes you have it, I can move forward with it. The seeming worse is 100 percent the case for me which doubles the frustration because I didn't report it to my docs because it's my norm.",
            "score": 2,
            "replies": [
                {
                    "author": "Pozpy",
                    "body": "Yes I relate so much !!!! I never reported it because I thought it was \"normal\". I still had some doubts but I mostly thought about bpd or bipolar disorders, but something always felt off. The relieve I have from knowing in the end it's REAL like i'm not a drama queen and everything",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Golintaim",
                            "body": "My Ahah!Moment was listen to an adhd video describing the difference between normal people and adhd people experei very thing and I was like wait, other people DON'T know the terror of being verbally told something?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "irgendjemand-",
            "body": "Same here, just had the exact same thoughts on my way home from work 😅 I've had a very ADHD-ish day and feel a little bit embarrassed about it because I think I really annoyed my coworkers today. So I was just thinking about why I can't seem to get it together lately and how I even managed all those years before my diagnosis!",
            "score": 2,
            "replies": [
                {
                    "author": "Pozpy",
                    "body": "I know right!! Some days I absolutely shut down from everybody (classmates, friends if I can call them that, professors)(I'm studying graphic design:) ) and I know it seems so freaking rude but hey just trying to get through my day lol :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "irgendjemand-",
                            "body": "That's so me! Especially at work, I often shut down from people because I just try to survive the day 🥲",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Serazene",
            "body": "It was like realizing I'd been in a cage my whole life and every time I noticed symptoms afterwards, I was now slamming into the walls of the cage, willing myself to stop being distracted, finish one task at a time, start cleaning my office, etc etc and this time realizing it was just not going to happen.\n\n\nFelt like I was coming to terms with an illusion of self control and agency in my day-to-day and that I was no longer in control. \n\n\nThat feeling slowly got better as I made peace with myself. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "m77win",
            "body": "I just went to the doctor today. \n\nI’m 47 years old.  I just got a prescription and I’m still not sure if I’m happy I finally figured it out or upset that I didn’t see it all along.  \n\nBut it explains so much.  I’ve been acknowledging it for the past week and it’s helped me a few times, but sometimes I’m still unable to do things like not cutting off someone  mid sentence.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dimmaz88",
            "body": "Same for me. I then started to think maybe I don't have certain symptoms, I just think I do because I've just learnt about it. It's an endless battle at the moment, hopefully it'll calm down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cat-kuring-chat",
            "body": "Yup and now I’m dependent on meds. -_-",
            "score": 1,
            "replies": []
        }
    ]
}