{
    "title": "Executive dysfunction dilemma!",
    "author": "Delicious_Volume7183",
    "subreddit": "ADHD",
    "rank": 422,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2if88/executive_dysfunction_dilemma/",
    "id": "1j2if88",
    "selftext": "Does anyone have any advice on dealing with executive dysfunction?\n\nI'm in my final year of uni and I'm struggling! I've been doing okay so far but I feel I've hit a slump and I'm just not managing to get any uni work done. \nI have the motivation, I want to do it. Hell I thoroughly enjoy what I'm doing but I just find myself stuck and no matter how hard I try to get myself started on my coursework I can't\n\nI've wasted 2 weeks like this now and I've got all my deadlines coming up this month and have barely made any progress. I think the stress now of the looming deadlines is making things worse as I just feel awful but still have the paralysis.\n\nHas anyone experienced similar? And if so was there anything you could do to help get through it? \n\nI've already got a study support advisor through uni and all my tasks are broken down, I just...can't start them no matter how hard I try.\n\nAny advice would be greatly appreciated 😭🙏🙏",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Delicious_Volume7183 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Federal_Past167",
            "body": "Meds.",
            "score": 1,
            "replies": [
                {
                    "author": "Delicious_Volume7183",
                    "body": "I am already on a fairly high dosage of meds. I'm considering booking a medication review to see if upping the dose further would be beneficial",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Federal_Past167",
                            "body": "Have you tried any supplements?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Delicious_Volume7183",
                                    "body": "I'm on dietary supplements but that's about it. Not heard about anything else tho",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}