{
    "title": "Medication seems less affective as time goes on despite dose and medication changes",
    "author": "Dfeeds",
    "subreddit": "ADHD",
    "rank": 399,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2lxec/medication_seems_less_affective_as_time_goes_on/",
    "id": "1j2lxec",
    "selftext": "Some quick background. My dad is adhd/bipolar, my mother has schizoaffective disorder, and my brother is OCD. It's a wonderful gene pool. I was diagnosed with adhd at 18 and have been medicated for 15 years. No idea what variant. \n\nMy issue is that the meds worked for the first 5-10 years quite well (54mg initially then 36mg later) Now the meds seem to make my adhd symptoms worse, cause irritability, anxiety, and time blindness. I've tried new meds, dosages, and adding other meds to combat anxiety (adderall, vyvanse, concerta, straterra, intuniv, zoloft, dexedrine). After talking to my dr, she recommended taking a break and see how I do. I'm currently at the year mark of no medication.\n\nMy girlfriend (living together for 3 years) thinks I'm much more calm and less forgetful. My memory does seem better, I can work through things better in my head, and I make less mistakes. Interestingly enough, I find myself interested in a lot of hobbies I enjoyed as a kid that I thought I grew out of and I now find myself getting excited for upcoming things for often. \n\nMy biggest issue now, though, seems to be motivation. I now feel so mentally tired. This is especially true during the work week (maybe related to not wanting to do something). \n\nI've tried taking my meds to see if they help and at 5mg dextroamphetine I feel less tired, but it only helps to do things I want to do. It's still hard to start something I don't want to do at all. At 10 mg (normal dose) I feel too amped up. I'm getting everything done, but I hyper focus and everything is turned up to 11.\n\nMy psychiatrist, however, is convinced 5mg at my weight (170 lbs, male) should basically be a placebo. So she isn't sure what to make of it at the moment, especially because my initial dose was always so high.\n\nCan anyone relate on meds just not being effective anymore? Could it be a misdiagnosis (something else)? My psychiatrist is very open to new ideas. So I'm interested in any other similar experiences and outcomes.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Dfeeds and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Federal_Past167",
            "body": "It could be depression or it could a rebound affect from stopping the drugs or it could be that you are burn out from taking stimulants for many years. You may want to get a second opinion from another psychiatrist.",
            "score": 2,
            "replies": [
                {
                    "author": "Dfeeds",
                    "body": "I set up an appointment with the same psychiatrist my brother and dad see (old insurance didn't cover same practice) but the appointment isn't until May. Good thoughts! I was wondering about the burn out but there's very little information about long term stim affects, at least that I can find. \n\n\nAlthough it has been a year since I stopped so I would think it's not a rebound affect. ",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}