{
    "title": "PSA: Consistent functioning with ADHD requires outside accountability/motivation.",
    "author": "AmuuboHunt",
    "subreddit": "ADHD",
    "rank": 162,
    "score": 1622,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 102,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2nfsb/psa_consistent_functioning_with_adhd_requires/",
    "id": "1j2nfsb",
    "selftext": "Saw a post about being home alone makes them \"regress\" or do nothing. I thought it was common knowledge that one of ADHD's core struggles is executive dysfunction, aka you need someone/something other than yourself in charge.\n\nYou may notice this in ways like brushing your teeth/showering when you have to leave the house compared to when you don't. Or when you have a deadline impending vs a task with no deadline. When someone is home that is expecting chores to be done vs when you're home alone.\n\nYes, it's not impossible to self motivate, but it's inconsistent at best. So any possible way you can outsource consequences or expectations of your behavior, goals, or tasks should be taken if you're wanting to see more consistent functioning.\n\nUnderstanding ADHD is half the battle! The more you understand how your brain works, the more you can work with it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/AmuuboHunt and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "melanthius",
            "body": "Wondering how universal this is. I definitely do better with a catalyst of external influence, but on occasion find some motivation from something really bothering me. \n\nExecuting a fix for that \"something really bothering me\" is really hard at convenient times. It only seems to happen to procrastinate something else.",
            "score": 450,
            "replies": [
                {
                    "author": "Schwa-de-vivre",
                    "body": "Outside of having accountabillybuddys, I work off of a tipping point system. Everything in my life has a state of I can deal with it until xyz.\n\nI will live in clutter for weeks and then enough is enough and my brain takes over and I will deep clean the house.\n\nI will put off watching tv shows and then suddenly it’s the tipping point and I spend four days binging",
                    "score": 195,
                    "replies": [
                        {
                            "author": "melanthius",
                            "body": "Same here, but it's stressful for myself and others to live this way",
                            "score": 64,
                            "replies": [
                                {
                                    "author": "rqeron",
                                    "body": "I used to (back when I didn't know much about ADHD) call it my depression cycle.  Things would be clean, I'd be happy.  Slowly the dishes would pile up because I'm incapable of even considering doing them at this point, and my mood would get progressively worse.  Eventually the dishes would get to a point where I didn't even have any serving bowls left to use as a makeshift plate; simultaneously I'd withdraw and not leave the house for a bit, until at some point I manage to summon a desperate spark of inspiration and actually do the dishes.  Then suddenly I'd feel like a functional human being again, my mood would improve, and we start the cycle again.\n\nThis was all before I had a dishwasher, so it's somewhat less terrible now than it was before when everything had to be hand-wadhed, although it still happens to some extent with pots and pans",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "author": "Stihlkt",
                                            "body": "I always compared it to coasting on my bike then pedaling super fast, getting tired, coast again and repeat",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "Nefarious_Alpaca",
                                            "body": "I very much reccomend at the end of the day just putting earphones in with some podcast Or smth on that will entertain your brain while you do your chores. It makes transitioning into cleaning mode a lot easier and cleaning itself not so boring, almost fun. And thanks to this you just keep your house at a steady level of tidyness, without going into this cycle",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "manafount",
                            "body": "I definitely have improved in this area (by necessity). Learning to hold yourself accountabillabuddyable without also developing an unhealthy sense of shame/self-criticism can be a tricky line to walk, though.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "deadcelebrities",
                                    "body": "One thing I try to do is treat tasks as gift or favors I do for myself rather than necessities I’m failing at. Then if I don’t do the dishes it’s more of an “oh well” than a “you suck” and if I do it’s more of a “wow thanks” than an “ugh finally.”",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "snarkitall",
                                            "body": "Yeah we're so used to being mean to ourselves for not getting things done or forgetting things that training ourselves to speak kindly and give compliments can be a real challenge. ",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Much_Safe_6024",
                                    "body": "Is this a new thing people are saying? \"accountabillybuddy\" \"accountabillabuddyable\". I've never seen Accountability Partner re-spelled like this.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "manafount",
                                            "body": "It’s a reference to a South Park episode from almost 20 years ago. They quoted it, so I thought I’d have fun and keep on with the reference in my reply to them :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FroyoBaskins",
                    "body": "Its like all things related to ADHD - we have the ability to tackle big problems all in one go when it becomes absolutely necessary and even do it faster and more effeciently than non-ADHD people if we are particularly motivated.\n\nBut if the problem or \"thing thats really bothering me\" requires some sort of consistent routine, habitual action, or sustained motivation over a longer period of time, I really need some sort of outside structure to make it feasible.",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "Stephenie_Dedalus",
                    "body": "My issue is autism and adhd. So if I try to work a job, I mask until I have some kind of mental breakdown, then end up with a medical crisis and get fired. I'm trying my hand at self-employment, but the lack of structure is def bad. Anyone else in this situation?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "PunkRockCapitalist",
                            "body": "AuDHD and went through the same. I'm not self employed but with my job structure, I may as well be. I very much try to break up the work as much as I can, honestly. I spend 2-3 hours at a time working and spend the in between (usually 1-4 hours depending on mental health) doing either fun things or whatever chores I can convince myself to do before my partner gets home. \n\nIt doesn't matter *when* the work gets done, as long as it does. I'm also very lucky to have a partner to remind me that it's okay to not do the exact same amount every day. \n\nSometimes I'll have a hyperfocus-on-work day and work 6-8 hours straight with literally not even a snack break. I don't bank on those days and they aren't very fun. I take the whole day off the day after lol \n\nI will say, it does help that I only sleep 5 or 6 hours a night. I have many hours in a day.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Stephenie_Dedalus",
                                    "body": "Man, you must have the gene that lets people do that. I need 9 lol. But yeah... guess I could take a crack at just treating it like college",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fragrant_Procedure48",
                            "body": "I'm planning to do self-employed too after getting fired recently, but this is exactly what I'm worried about (with ADHD and autism)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lazy_Cupcake_7681",
                    "body": "This, i need some type of external pressure or anxiety about it",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CMJunkAddict",
            "body": " Outside accountability, leads to me anticipating that accountability. Then when I can’t meet that expectation, I slide into depression & try to find what I did wrong , shooting my anxiety through the roof.  I need to be accountable to me for my own sanity.",
            "score": 136,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "I would say knowing your limits in what you can deliver with the right environment are important here.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "nautilacea",
            "body": "yeah, this is definitely true for me. It’s not always 100% - too much outside pressure also paralyses me - but having to meet expectations really does help. That’s why only working from home didn’t work for me, and now that I go into the office at least a few days a week helps me be much more productive and especially consistent.",
            "score": 30,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "My bf is doing the same thing of going in office more often. Too much stress is absolutely counterproductive. Stress is like a bell curve in how well it motivates you. Aiming for moderate/manageable stress known as \"eustress\" is ideal!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "rqeron",
                    "body": "I'm doing the same thing too!  My work allows me to do 100% from home, but I have made it an expectation/pattern that I'm in the office 3 days a week.  It's not a big deal if I don't make it to those three days - there's no specific consequences or anything, but there's a vague expectation there which is enough to get me there 90% of the time.\n\nI also find myself significantly more stressed when I actually skip my office days - because I notice I fall behind much more easily, and so I get added work stress... it's just a bit of an annoyance that the added work stress makes it harder for me to motivate myself to go into the office.  I had a 3 week period recently of not being able to go to the office which has left me with ....... quite a bit of work to do now, but I'm getting back on track now\n\nI had a job back in 2018 for a foreign company and thus 100% wfh (they were actually in the process of organising work visas and everything).............. I lasted about 2 months and then ended up ghosting them (it's not my proudest moment...)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "kittyconetail",
            "body": "Nothing makes me struggle to do a task or plain makes me avoid a task more than expectations and consequences lmao",
            "score": 125,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "Does perfectionism play a role in that? Alternatively, would you say you don't avoid tasks with no pressures or expectations?",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Ssspaaace",
                            "body": "I grew up being naturally good at a lot of things that most people aren't, but this resulted in me finding myself an adult with adult problems that I struggle to get through because the moment I start to self-doubt, it's over. I have no grit. I feel like any failure or bump in the road is because I'm stupid, not because hard things are supposed to result in failure while you get better at them. Expectations from other people can turn that flighty instinct up to 11.",
                            "score": 47,
                            "replies": []
                        },
                        {
                            "author": "kittyconetail",
                            "body": "Started there and snowballed. Or flipped? Idk. Never been allowed to do things my ADHD way. Even small stuff like not being allowed to pace while reading. I'm still not. Doing important tasks the publicly desired way is hard and is never sustainable. Doing things the ADHD way is incompatible with the world and brings criticism/'help'. \n\n\"I need to do this right\" is still there... but I also feel like there is no way to access it. So I avoid. The more I need to do something right, the more aware I am of the gap between what I could do and what I'm able/allowed to do. Plus, it means there's greater consequences to failure...which feels inevitable. It crushes me before I can begin.\n\nNah to the no pressure. I can do lots of things if expectations are loose and no one is breathing down my neck.\n\n(Terms like fail are used loosely, been talking about this in therapy for months lol)",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pretend_Corgi_9937",
            "body": "Meh, I think it depends on the person. Having external pressure makes me procrastinate and cancel plans (which then tends to trigger RSD). It’s easier for me to do things \"for my own good\". Not saying it’s bad advice, it’s just not universal.",
            "score": 123,
            "replies": [
                {
                    "author": "Ssspaaace",
                    "body": "I would be inclined to agree with you. I hate feeling made to do anything \\*I\\* don't want to do, almost to a childish extent, but when I want it (like when I want to be a functional and healthy person), I find a way for myself. If/until that doesn't work, then I find another way.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "marionsunshine",
                            "body": "As soon as someone *instructs* me to do something I was planning to do, it just fell to the bottom of my list. \n\nI have to check myself and understand the request. Was it a veiled reminder, was there urgency, or is there something more? \n\nI'm talking about work stuff mostly.",
                            "score": 28,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "antpile11",
                    "body": "Demand avoidance.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "we_are_sex_bobomb",
            "body": "More broadly I’ve discovered I simply need external stimulae to do basically anything. I have a giant clock on my work desk and tons of timers/alarms that go off throughout the day reminding me when I need to do stuff.",
            "score": 24,
            "replies": [
                {
                    "author": "asshat123",
                    "body": "I've definitely had much more success with externalizing my internal motivators than with having someone looking over my shoulder. Similar to the giant clock, I got a big whiteboard and I write down shit I want to do today so I can see it easily. I start the day thinking of what I want or need to get done, and I pop that up on the board. Any time I've finished something and I'm feeling ready for another task, instead of waiting for someone else to tell me what to do next, I just look at the list I already wrote. I'm telling me what to do next, but I don't have to burn energy on figuring out what's next in the moment because I already did that.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "0hgurl",
            "body": "Mind blown. I have never connected the dots on this one but it fits me so well.  \n Everytime I'm left to my own devices for a moment of time I enter what I in my mind to refer to as \"little critter mode\" where I am a little critter eating junk in my nest of old clothes scrolling my phone endlessly. But when my partner is home I am more functional and I am always going to my work/appointments etc because I don't want to disappoint people around me.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Spicy2ShotChai",
            "body": "ok so how does one do this. i live alone and have a freelance job. i can barely function day to day",
            "score": 15,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "Sounds like my dad. Very rough cycle to watch. If pressure from clients isn't viable (hit or miss for my dad), I would recommend building a support system whether that be friends or family you trust, a therapist, or possibly bringing in coworkers?",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrazyProudMom25",
            "body": "I do better home alone than with people in the house tbh or at least awake. Yes, external factors are important but after growing up with family that got upset when I did things imperfectly and would often just redo it rather than showing me how to do better… I have a hard time doing things in front of other people so body doubling only works if I’m playing someone’s twitch stream in the background. \n\nSo my most productive chore and exercise times are the two and a half hours my four year old is at preschool three days a week or after 10pm when everyone else is asleep. Next most productive is before 6 year old gets home from school, even when her sister is home. Kids can’t judge if I’m doing it right or not, but 6 year old is a lot so I can’t get much done with her at home. \n\nTo be clear, spouse doesn’t judge and has helped me learn, it’s just a mental block and anxiety that just isn’t worth dealing with most of the time.",
            "score": 13,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "Absolutely agree! I could clean the whole house when my roommates weren't home due to the lack of being perceived or feeling judged. Similarly, I would feel definitely paralysis and shame if my professors *knew* how I wait till the last second/stay up late doing all my assignments.\n\nPersonally, I just need the expectation set then space to get it done my way without judgement.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CrazyProudMom25",
                            "body": "Yep. The only reason I haven’t put away laundry is I sat down for a bit to check something on my laptop and my cat came and fell asleep in my lap so now I’m trapped. I better get up and do it soon though, six year old is due home in thirty minutes.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AmuuboHunt",
                                    "body": "External accountability: six year old impending in 30 mins lol. Good luck!",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "CrazyProudMom25",
                                            "body": "Unfortunately, time blindness got me. Fortunately, 6 year old decided to be helpful and hung up all the kids’ dresses for me",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theseventyones",
            "body": "Thanks for this. People don't seem to believe me when I tell them my level of internal motivation is basically zero.",
            "score": 12,
            "replies": []
        },
        {
            "author": "SadRegular",
            "body": "Jokes on you, I'm not doing anything someone tells me to or pressures me to do. XD including myself... wait fml",
            "score": 9,
            "replies": []
        },
        {
            "author": "TubeNoobed",
            "body": "100%! Unmanaged ADHD is at its worst when it makes one so overwhelmed with thoughts, there is no clear path forward. Akin to being a lost puppy who needs a leash and guidance….”Someone please tell me what I need to do next.”",
            "score": 9,
            "replies": []
        },
        {
            "author": "posixUncompliant",
            "body": "> Yes, it's not impossible to self motivate, but it's inconsistent at best. So any possible way you can outsource consequences or expectations of your behavior, goals, or tasks should be taken if you're wanting to see more consistent functioning.\n\nKnowing what you will do under what conditions is a vital part of managing life with ADHD. I will do research if I can make up the least excuse to do so. I will avoid cleaning up clutter to the point of not seeing it.\n\nAs long as it's not my personal space (bedroom, home office, workspace) I will clean up any space I'm in if I'm talking to someone (which I figured out is my way of being able to pace around in socially acceptable way).\n\nI do work best with tasks that have final steps that I don't have perform. I hate being done. I've set up all kinds of processes in my time that always mean I'm not the person who closes the ticket, or fills in the last check boxes. \n\nBut the biggest thing is if I can feel helpful and competent. That's the best motivator I've had.",
            "score": 9,
            "replies": [
                {
                    "author": "asshat123",
                    "body": "> Knowing what you will do under what conditions is a vital part of managing life with ADHD.\n\nThis is a very helpful thing for me. Honestly, these \"ADHD pro-tips\" that give a blanket, definitive answer, to me, are ultimately insufficient. In this case, the core issue is motivation. Yes, having another person to hold you accountable *can* help, but to me, that's not a viable long-term solution. I can't constantly be dependent on another person sitting next to me while I work. Instead, I've focused on my own behavior and environment. What conditions help me to focus? Maybe putting on a podcast is better for my productivity than sitting in silence, or maybe music is better than a podcast. When it's time to sit and focus, I try to set up my surroundings to give me the environment I need. Knowing your own patterns is part of it too. For instance, maybe I know I'm most able to sit and look at my computer for an extended period of time after lunch, so I should schedule my meetings, which are more actively engaging, in the mornings. And hey, maybe I can only really sit and focus on Excel sheets for 3 hours in a day no matter when those hours happen. If I recognize that, I can plan around it. \n\nAlso, literally everyone with ADHD can tell you that external accountability is not in any way a requirement for getting shit done. We've all accidentally spent 6 hours working on something because we got sucked into it. Reframing the kind of shit I don't want to do as something that I do want to do for whatever reason, as lame as that sounds, is helpful. This also helps find places where we're holding ourselves to standards of others just because we think we're supposed to do that. This is where acknowledging the limits we have because of ADHD comes in handy. There are plenty of tasks that take way more energy for me than they do for someone without executive dysfunction, so why should I expect myself to get the same stuff done? Why should I hold myself to arbitrary external standards if they don't mean anything to me? And if they *do* mean something to me, then it's much easier to keep myself motivated. Thinking this way has been really helpful for me to build long-term sustainable habits. Finding better medication has also helped a ton.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Federal_Past167",
            "body": "That means that we need to have a person in our lives willing to babysit us and that is not easy to find nor we should rely on another person for basic functions.",
            "score": 21,
            "replies": [
                {
                    "author": "meeps1142",
                    "body": "Not necessarily, although it helps. I find it helpful on the weekend to have some sort of plans earlier in the day -- this could be getting coffee with a friend, signing up for a fitness class, etc. There's lots of options, just gotta get creative.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "AmuuboHunt",
                            "body": "Creativity is key here, because yeah, it's not feasible to have one designated babysitter (I do want one sometimes lol). \n\nBut there's plenty of people or scenarios you could outsource small chunks of accountability to establish consistent structure for things that are important.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TJ_Rowe",
                    "body": "When I was a SAHM, my toddler was actually really good for this - he wanted snacks so often that I couldn't forget to eat!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "nirmalspeed",
                    "body": "They're not for babysitting you, they're to serve as a reference point for what you should be doing as an adult.\n\nEx: I live alone and there is absolutely zero reason for me to do the dishes the same day, take my clothes out of the dryer, go to the gym regularly, etc.\n\nBut when you have roommates/housemates, you see them going to the gym/leaving the house and it reminds you that you haven't worked out in a while. Or when they need to do laundry, you remember to take your stuff out, etc. \n\nI think of it as a way to assign a deadline to things that don't inherently have one and also as a reminder to do things at a regular schedule. Ex: When you do laundry, there is no deadline whatsoever if you live alone. But with roommates, the deadline will be before they need to do their laundry. Or if you see them going to the grocery store, you go too versus forgetting to get groceries and getting delivery",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "PomPomGrenade",
            "body": "I subconsciously pulled my partner in as a live-in body double and a reason and motivation to cook and have the place liveable. Alone, the place doesn't get nasty but it's not presentable either. No reason to cook if it's just me. I also offloaded the management of social obligations squarely on his shoulders. Wasn't quite aware I was doing that until I learned of my ADHD.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Keddlin",
            "body": "Don't forget about adhd discords if you need accountabilibuddies folks, I did a body doubling session with someone in one and it was lovely.",
            "score": 7,
            "replies": [
                {
                    "author": "panduhlover",
                    "body": "Where can one find these discords ?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vivid_Prior7371",
            "body": "I did great in college bc of deadlines. Most of the time now i'm not getting much done, but I love my life and I have a great time.",
            "score": 4,
            "replies": []
        },
        {
            "author": "StillWerewolf1292",
            "body": "I’ve never thought of it this way.  This makes a lot of sense to me as I could use a constant nudge to keep me on track.  When I’m left alone is when I struggle.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dylpleted",
            "body": "Eh, I'm much more efficient as a person without someone holding me accountable. Not having someone pulling you side to side helps me not get distracted in an already distracted life lol",
            "score": 4,
            "replies": []
        },
        {
            "author": "Prof-Rock",
            "body": "I can use randomization to trick myself into this.  I put all of my tasks on a list and have Alexa pick a number, or I use one of the random wheel apps and spin.  My brain still accepts that I have to do the task right then no matter how much I don't want to because the wheel told me to.  It isn't 100% reliable, but it helps.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sfdsquid",
            "body": "If I am not beholden to someone else and/or have externally-imposed deadlines, I get fuck all done. That's how I functioned in school. I parented someone too, that helped. Working helped too. But I haven't done any of those things in years.",
            "score": 4,
            "replies": []
        },
        {
            "author": "how_do_you_username",
            "body": "I always have an appointment with my physio on the books, even if it’s a few months away - it’s the only way I can make myself do my exercises. My physio also has made a google sheets chart for me to tick off when I exercise so he can see it. Even when I have the tools (know what exercises to do when stuff gets bad), I can’t make myself start again so back to the physio. He gets it and me now. But yeah, point of this is I am one of the external motivation is my jam sorta people 😅",
            "score": 5,
            "replies": []
        },
        {
            "author": "Rainydayday",
            "body": "Yeeeeeeep. The only time I get stuff done is when I'm expecting my boyfriend to come over. Then it's 3 days of cleaning and taking care of myself so I can be presentable when I see him again...",
            "score": 4,
            "replies": []
        },
        {
            "author": "QuintusMaximus",
            "body": "100,000% Whenever I'm going out with my \"surround yourself with who you wanna be\" friends or doing them a favor, I'm on that shit pronto. Or things for my niece and nephew.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RickSanchez_C145",
            "body": "This is random but using things 3 app and Obsidian for note taking has greatly improved my memory and function to do tasks.",
            "score": 4,
            "replies": [
                {
                    "author": "Thin_Letterhead_9195",
                    "body": "How do u do it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RickSanchez_C145",
                            "body": "Do what?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PiesAteMyFace",
            "body": "Mmmh... That hasn't been my experience at all, but I am pretty sure I'm AuADHD. The ASD part is basically an internalized stickler-to-the-plan. I actually function better when I set my own schedule.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SkiingAway",
            "body": "I think it's a worthwhile thing to try and I'm sure it's effective for some people.\n\nI don't find it to work for me beyond the very short term.\n\nThat outside person/thing will become something to resent or just create even more, new layers of anxiety once the novelty of it wears off.\n\n---------\n\nThe best I've found for me is that, much as I resent it as well and am not always perfect at it - even *attempting* to stick to certain routines/patterns of behavior structured to avoid distraction + reduce the task initiation paralysis, does help.",
            "score": 3,
            "replies": []
        },
        {
            "author": "andrenery",
            "body": "I'm the complete opposite. \n\n\nI work much much better when I am home alone.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lordravenxx",
            "body": "Been alone since 2018. I can't get anything done and all I do is work, go grocery shopping, eat (sometimes) and sleep.  It's so boring but days just flash by with nothing done.  I wish I could get a body double or something but that is just probably not going to happen like everything else.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kuhneel",
            "body": "My whole daily schedule is built around getting stuff done before the kids get up, before they leave, before they come home from school, cooking and cleaning for them, etc. \n\nI really hope I can maintain this after they've finished growing up.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Thin_Letterhead_9195",
            "body": "I hate it though. I love flexibility but i am so bad at holding myself accountable. God i hate this",
            "score": 3,
            "replies": []
        },
        {
            "author": "EmperorPinguin",
            "body": "100% true for me and i hate it.\n\nI know the person that micromanages is usually an asshole, but i probably need to be micro managed. So on principle, i have to side with the people that hate micro management. But for my sanity, that guy will always have a job.",
            "score": 3,
            "replies": []
        },
        {
            "author": "killjoymoon",
            "body": "Well, I’ve been trying outside motivation but what I keep running into is that when I seek it, it works for a few weeks, then my defiance kicks in and I hate the outside accountability, and want to flee from it. So not sure this is 100% the answer at least for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "quietgrrrlriot",
            "body": "I'm a lot better with external supports... because I will inevitably forget my house keys or lock my keys in my car at some point. It doesn't happen too often anymore. Knowing someone lives with me helps me to be a bit tidier. I'm more likely to re-locate my belongings to appropriate places (even if it's not right away). My working memory sucks, but it's easy enough for my gf to let me know if I took my meds or just thought about it (short of getting a pill container, which I have procrastinated since losing my last). My gf also helps to gently bring me out of looping, or talk some sense into me when I start scheming up a project I don't have enough time for.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kaiserpathos",
            "body": "Several issues (co-morbidities, and the controversial \"RSD\" phenomena that is not in the DSM yet) have been a challenge for me on this.   Oppositional Defiant Disorder makes it very difficult for some ADHD and AuDHD people to take the accountability exercise -- and have had more success body-doubling.   Accountability is usually easier to do, though (body-doubling requires someone available to \"work around\" us which isn't always feasible -- even with online tools for this). \n\nI have had to learn to hold myself accountable, and have self-compassion when I fall short.   Because of Executive Function issues, I have to at my brain at a different angle of ownership of outcomes.  Despite time blindness and all the other bullsh\\*t -- if I can imagine \"what done looks like\" as an outcome, and then make myself own however that outcome transpires --- that works better for me (internally) than having an accountability partner.   \n\nThat AA accountability partner stuff doesn't always work on people with ODD.  And, with loved-ones, if you are at-risk for RSD moments --- definitely not.    You have to find a way to do it yourself, despite the Exec Function issues",
            "score": 3,
            "replies": []
        },
        {
            "author": "EmbodiedUncleMother",
            "body": "My God I love this thank you",
            "score": 5,
            "replies": []
        },
        {
            "author": "biskino",
            "body": "I’m sorry but that’s just a profoundly disempowering position to take. \n\nExecutive dysfunction doesn’t ’equal you need someone else in charge’. It means we need to learn different ways to manage ourselves. It’s entirely possible to live a meaningful, indépendant life with ADHD. I’m proof of that. \n\nImagining you need to be in an utterly dependant relationship with someone else just to function is wrong and tragic. \n\nAnd who volunteers for that kind of relationship (other than an abuser)?",
            "score": 5,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "You missed the \"or something\". There's plenty of things that can serve as external motivators that doesn't include being an invalid or abusing someone's want to help.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "biskino",
                            "body": "External motivation, like accountability, can be good whether it comes from someone or something. But ‘you need someone, something else in charge’ isn’t accountability, it’s surrender to helplessness. \n\n‘More consistent functioning’ isn’t worth deciding that you’re incapable of controlling your own life. (And it isn’t actually help the functioning either). \n\nHave you got someone in your life who’s telling you this stuff? Maybe watch out for them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AmuuboHunt",
                                    "body": "I recommend reading the abundant and easily accessible literature on ADHD.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "biskino",
                                            "body": "I guess I missed that part in the ADHD literature that says our executive dysfunction means we can’t cope on our own and need someone else in charge? Please share! Maybe it’ll make me as happy as it’s making you? \n\nDo they talk about the dynamics of these relationships much? Where someone is ‘in charge’ of another adult? What’s it like for the person who has to be in charge of everything? Unless they’re a highly controlling person I’d imagine it sucks. And if they are someone who enjoys it, yikes for the person with adhd.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KindBear99",
            "body": "Ugh. I don't know if I have ADHD but I do know this post is true for me. It sucks because I was able to be productive and maintain a sort of normal sleep schedule when I lived with my parents but my mental health took a nose dive. Now I'm living alone again and really stressing about keeping up the tenuous habits I had kept when I had my parents as peer pressure. It sucks because in one situation I am able to keep up with commitments but be a mess internally, in the other, I'm better off mentally but falling apart with everything else.   \n  \nThank you for reminding me that I'm not the only one that struggles with this!",
            "score": 4,
            "replies": [
                {
                    "author": "rqeron",
                    "body": "this is an interesting one - and I think it's something that I've also noticed about myself.  I absolutely need someone there to motivate me to actually do any household chores / etc, but I also get ... stressed, i guess? with the constant expectation being there, which might be a reason I tend to sleep late - a kind of revenge bedtime procrastination if you will, but specifically because I need a certain amount of time to myself where I *don't* have these expectations.  And sometimes the bedtime procrastination gets a bit out of hand when I'm living with someone\n\nit's a tricky thing to balance and I genuinely don't know how to do it yet either.  Living by myself I slip very easily into self-neglect, but living with someone I then feel stressed all the time, unless I get enough time to myself, in which case I'm constantly sleep-deprived.  It's a bit of a \"choose the least worst option\" game I guess, where all roads lead to depression (yay)\n\nat least with work I can go to the office, have that external motivation, and then go home and disconnect.  I can't do that with my personal/day-to-day life tho...",
                    "score": 4,
                    "replies": [
                        {
                            "author": "KindBear99",
                            "body": "Yes, you're spot on. I also stayed up late just to get a little alone time after my parents went to bed. But then I still felt obligated to wake up at a sort of normal time due to worrying about them judging me. You're right, ideally there would be a happy medium... sigh",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tough-Judge-3855",
            "body": "real",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tough-Judge-3855",
            "body": "this is so bleak",
            "score": 2,
            "replies": []
        },
        {
            "author": "Narciiii",
            "body": "Ah this makes so much sense. Thank you for putting it this way.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lil_Hamo19",
            "body": "Yup!! So true! Anybody got any external accountability/motivation tips? My internal motivation just doesn't cut it 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Senko_Kaminari",
            "body": "Ugh the minute I start to do something I feel demotivated.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jozuhito",
            "body": "Yep this is how it is for me a lot of the times. Sometimes I am lucky if I self set a deadline and instead of it not getting done, it gets done just after the deadline. If I am lucky.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Xrisx-83",
            "body": "What if you live alone? no one there for you to be accountable. not even friends or family.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Immediate_Cup_9021",
            "body": "Finding you reason why/the things that you value and bring meaning in your life will motivate you internally to get shit done.!",
            "score": 2,
            "replies": []
        },
        {
            "author": "desertfractal",
            "body": "I think ADHD is different for everyone, this post might be helpful to some people but it’s actually the opposite for me. If someone is home expecting chores to be done, they’re not getting done. If someone is telling me that I have to finish something, its not getting finished. If I’m home alone and there are no eyes on me or expectations, suddenly my day goes the way I need it to go. Of course, there’s days where it doesn’t, but overall having a watching eye is absolutely detrimental to my productivity.",
            "score": 3,
            "replies": [
                {
                    "author": "AmuuboHunt",
                    "body": "Being accountable to someone/something is different from being watched. I can't function being watched either. But set the expectations and leave me to it, and I'll have a much easier time than trying to motivate myself.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "wlexxx2",
            "body": "that is only partial functioning",
            "score": 1,
            "replies": []
        },
        {
            "author": "mirabelle7",
            "body": "This is so helpful. I always forget this. Thank you!!!",
            "score": 1,
            "replies": []
        }
    ]
}