{
    "title": "Nurses with ADHD is there something that I am doing wrong?",
    "author": "QualityEvening4802",
    "subreddit": "ADHD",
    "rank": 415,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2pa56/nurses_with_adhd_is_there_something_that_i_am/",
    "id": "1j2pa56",
    "selftext": "I returned to work after taking a temporary leave of absence. Due to my needs I needed a part time job and it caused me to have to resign from my old position. I took a job in community health nursing and it has been especially challenging for me. The organization and time management piece is especially hard for me to do. I also commute an hour to work and commute back home another hour. I go home feeling absolutely drained and on my days off I just end up sleeping. I was struggling so much that I had to ask my doctor to allow me to take 3 weeks off because my anxiety levels were so high that I constantly felt like I was in distress. I want to work but it just seems like things are just not working out for me. I had success working in med surg before with no issues but my psychiatrist doesn't want me working nights. I need to provide medical to the disability team but I don't know what to tell them. Should I quit or try to find a new area?\nThanks in advance.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/QualityEvening4802 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key-Course2507",
            "body": "the benefit and impact of unions is undeniable, and the need for good leadership in healthcare and government regulation is vital, we all know this.\n\n given how nurses are heroes and often exhausted and often sleeping on floors in breaks or between double shifts, i think highly of nurses, and of citizens who care about them, and independent organizers and leaders including educated people from different classes and students who have ideals and want to practice solidarity.\n\n it isnt so helpful for me to say - start unionizing! i know that it’s hard. are you in a union? you struggle with loving your work and caring for patients and wanting conditions you deserve but are denied, and having this commute and financial challenges. \n\ni prefer to evade the conclusion that our problems are too vast because it seems hopeless or that  political action might not be successful.\n\n i think a well rounded approach of speaking to managers and seeking medical accommodations is a good route to take, but i know there’s politics in all workplaces and that the nurse may be deemed the little guy and management may be harsh, following protocols that are unfair. \n\n i still like to mention unions and advocating because i think about history and how progress had been made by people through unions such as the struggle for paid maternity leave; first won in canada after organizing and collective bargaining by postal workers i heard.  i know that as nurses who’ve studied to be nurses that you may not be familiar with this type of labour history ;\n\n if nursing school included a humanities class this could be empowering, and help when and if nurses join the college of nurses and become healthcare workers and union members. \n\nensuring that practical programs don’t overlook socialism seems like a good idea. and electing and being good leaders and challenging conservativism and cutting costs and private medicine and greed \n\nwe love and appreciate nurses! your work matters. ",
            "score": 2,
            "replies": []
        }
    ]
}