{
    "title": "What are some ways you deal with hypersensitivity?",
    "author": "Lazy_Strawberry07",
    "subreddit": "ADHD",
    "rank": 197,
    "score": 117,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 49,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2zgsl/what_are_some_ways_you_deal_with_hypersensitivity/",
    "id": "1j2zgsl",
    "selftext": "It’s the most difficult symptom of ADHD I deal with on a daily basis. The tiniest things can set me off. Regular things most people can brush off and forget about, I’ll think about it for DAYS. I’m very bad at regulating my emotions, I act on impulse constantly, and I definitely have a bad habit of keeping grudges over the smallest things. And it honestly makes me feel really guilty. \n\nAnd it gets very annoying also. My mood constantly switching from happy, to annoyed, to angry, to sad, to embarrassed, etc. in the span of like.. 10 minutes and it takes a toll on me. \n\nI’ve definitely tried things like going on walks, or distracting myself playing video games, and it works, sometimes. I’m curious what you guys do though, and I’m definitely interested in trying new things to better myself. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Lazy_Strawberry07 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Label_Maker",
            "body": "Building empathy is what helped me the most. When someone does something \"against\" me, I try to step back and recognize the ways it isn't about me at all and how it might not even be about whatever is happening in the moment. \n\nI try to imagine a situation where I was in the other person's position and did the same thing, because none of us are perfect. A good example is road rage - it is easy to be upset when someone cuts me off or makes some mistake, but then I remember the times I've made a mistake or cut someone off and I give both of us a little grace/forgiveness.",
            "score": 55,
            "replies": [
                {
                    "author": "Round_Structure_2735",
                    "body": "This is really important if you have kids. It is hard to remember that they are acting with the best intentions and are bound to make mistakes. I try to extend this to the world at large (although there are a lot of straight up assholes out there).\n\nSSRIs help also.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "mick_park",
                            "body": "Plussing both of these points, specifically meds. For me it was a little over two years of working w my Dr, trying different combinations of things and dosages. The positive result for me is emotional regulation.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Mysterious_Jury_7995",
                            "body": "What is an \"SSRI\"?\n\nI have yet to be diagnosed with having ADHD but I do fly off the handle at minial stuff (but some things irritate me so bad) boyfriend says he is afraid to come stay with me. Maybe I am better off alone.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Round_Structure_2735",
                                    "body": "Selective serotonin reuptake inhibitor. It is a type of antidepressant, and can help with that \"on-edge\" feeling that can cause you to blow up.\n\nYou are not better off alone, but there is work you can do to help keep yourself in check. Therapy and mindfulness meditation can help as well.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LordBonktheChonk",
                    "body": "Really underrated comment here, might seem cheesy but this is very true and helpful.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Lazy_Strawberry07",
                    "body": "This is really good advice, thank you so much.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Quiet-Ad-4264",
            "body": "A wise friend introduced me to the concept of leading with curiosity rather than judgment. I fail at that often, but usually think about it when I reflect on my reaction to social interaction.\n\nI started taking Lamotrigine as a mood stabilizer (in addition to an anti-depressant and Vyvanse). Not sure if it’s effective, but I’m dealing with intense depression and executive function issues and I’ll try anything at this point.",
            "score": 22,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "That’s really helpful, and makes a lot of sense. I’ll try doing that more often!\n\nAnd I’m sorry to hear that, I wish I could offer some advice on medication but I haven’t taken Methylphenidate since I was a kid. And I’ve been rawdogging it since haha. I saw someone else say something about Vyvanse, do you think it’s helped you at all with ADHD in general? I’m thinking of getting back on some sort of medication honestly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kinetic_skink",
                            "body": "I posted in the main thread about BPD, but this extra information makes it more likely. Being raised in an e vironment with a narcissist mother also increases the risk of developing BPD.\n\nPutting my therapist hat on - narcissistic mums in particular make it more likely someone retains the early developmental psychological defense mechanism of splitting. So as a child you can retain a positive view of your mother to survive. Unfortunately that can somewhat inherently snowball in to BPD",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Quiet-Ad-4264",
                            "body": "I’m not sure if ADHD medication helps me much lately. My therapist thinks it makes sense that I don’t feel much difference going from 20 mg to 50 mg of Vyvanse because my most pressing problem is burnout and depression, which stimulant meds aren’t addressing. It makes a lot of sense to me.\n\nAre you familiar with the concept of the Highly Sensitive Person? I haven’t read the book, and I don’t think the framework was developed with any connection to ADHD. But I find it helpful. There’s a quiz available online. Sensitivity hurts us sometimes, but it can also be a valuable skill as we can recognize things others don’t see and can extend deep empathy to others.\n\nI have very little figured out but one way I cope with hypersensitivity is remembering that I am very sensitive. Whatever I’m perceiving in others or feeling hurt by may not be real, or might be much less serious than I think it is. I can’t always see this in the moment, but I’m working on taking things less personally. I’m realizing that it has less to do with how I interact with others and more to do with how I relate to myself.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tgrinne",
            "body": "Following this one really, really closely. In the same boat.",
            "score": 14,
            "replies": [
                {
                    "author": "freedom_unhithered",
                    "body": "Same",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "LordBonktheChonk",
            "body": "Dealt with this my entire life, exacerbated by a less than stellar home life growing up so I trigger rather easily sometimes but Vyvanse is the only thing in my entire life that I have done or taken that has made me feel like I’m at a place of stability when I have those moments. So rather than feeling like I’m starting at a six, I’m at like a 2 or 3 and have more control of my response. Idk if this is relatable in the way you would like it to be but I sure hope it helps.",
            "score": 5,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "Yeah me too. Mom was a full blown narcissist who took drugs. So I totally feel you on that. \n\nAnd it is helpful thank you! Someone else mentioned Vyvanse, and I never heard of it till now. I haven’t taken medication since I was a kid and now I’m definitely thinking getting back on it. Did you specifically ask for Vyvanse or was it just prescribed to you automatically?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LordBonktheChonk",
                            "body": "My mother in law mentioned it a few times and I’ve had such a hard time the last couple years in general and finally “gave in” and just said I’ve gotta do it and see and it’s been amazing. Huge difference even on day one.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "StarryNightNinja",
                            "body": "Yesterday my father told me my mother was calling around looking for me, she abused me throughout my entire childhood, and he tried to be ominous with it, especially his tone. I hate these people, this set me on a spiral yesterday and today im just going to hide in my room to not be noticed. I was feeling good yesterday, no suicidal thoughts",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DownUnderLich",
            "body": "Just in case you’re unaware - like I was - you may have Rejection Sensitivity Dysphoria. It’s very common in ADHD’ers. This is a really good article: https://chadd.org/wp-content/uploads/2016/10/ATTN_10_16_EmotionalRegulation.pdf\n\nAs far as managing it, it’s tough. I agree with the empathy approach above. Also trying to be grateful can be helpful (what am I grateful right now). I think being aware of your thoughts and feelings is the most helpful. Once you’re aware of how you’re feeling, you can take steps to reduce the impact: is this justified? Take some deep breaths or try the excellent Emotional Freedom tapping techniques. They can really help lessen the effects of strong, overwhelming emotions (check YouTube).",
            "score": 12,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "Thank you so much!! This is really helpful",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lordravenxx",
            "body": "Probably not the best... but I just quit caring about anything. Now I just say, it is what it is. If I can't do it how someone wants or whatever no amount of telling me to just do it will change that. You can't make a strawberry turn into a grape no matter how hard you want it to.",
            "score": 5,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "That’s honestly pretty helpful! It’s very true.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Regular-Dragonfly-",
                    "body": "This has helped me a lot as well.  I think, though I'm not sure, that this would qualify as a form of cognitive behavioral therapy.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive-Half135",
            "body": "Are you open to medication? Clonidine .3 mg and dextroamphetamine er 10mg help me alot. I didn't take meds until I was out of high school and having issues. Tried a bunch of therapy and stuff but my adhd was causing issues that led to depression and anxiety. This combo works good for me. The Clonidine helps with staying calm and more even tempered and the dextroamphetamine helps me be productive and helps with my \"temper tantrums\" as I call them 😂 certain things sometimes just make me lose it. But the 2 together work better than anything else I have been on and not alot of side effects ",
            "score": 4,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "Ooooh thank you! I actually have been thinking about getting back on medication. I took Methylphenidate as a kid and I didn’t like how it messed with my appetite, so I stopped. So I’m definitely open to something new. Thank you so much again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Vermicelli2327",
            "body": "Handling hypersensitivity is still definitely a work in progress for me, one thing I read recently on a different post in this subreddit (sorry I really want to tag/give credit to the redditor but I can't find the original post....it was during a big rabbit hole scroll...), was the 10 rule.\n\n  \nI've only just started implementing this myself. When something triggers me, my \"knee-jerk\" reaction is usually to feel frustrated or shut down, once I've cooled off a bit I ask myself:\n\n  \nWill this matter to me in 10 minutes/days/weeks/months/years? I go down the list and put things into persepctive.\n\n\n\nIt has helped me half the time, the other half of the time I resort to screaming into a pillow, going really hard at the gym or sending a video/voice note on snapchat to my close friends with ADHD about the minor inconvenience. The good thing about my friends is that they understand that it is frustrating and they tend to respond with something that set them off recently. Them replying with an anecdote and following up with how they are now fine afterwards gives me reassurance that the horrible feelings will go away and that they're not temporary even if it feels like that in the moment.\n\nOne thing that I constantly forget about but does help when I actually do it is recording voice notes or writing about the triggering event as it happens in the moment, and the next time another triggering event happens I first write how I feel about the previous event to put things into perspective. It helps me realise that the event I initially felt so intensely negative towards now doesn't affect me, so it gives me reassurance that the feelings caused by the current event at hand will fade away eventually. One thing to keep in mind is to potentially simplify the event into 3 concise points, e.g.\n\n1. What happened\n\n2. How I currently feel about the situation\n\n3. How long do I feel I will be upset for (just so in the future I can compare how long I was actually upset for, usually I overestimate it which provides more reassurance)\n\nIf I don't do this my voice recording will not make much sense as I jump back and fourth between points, and trying to write down what happened also won't result in sentences that make sense.\n\n  \nHope at least some of this makes sense, good luck!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Senko_Kaminari",
            "body": "I usually listen to music",
            "score": 3,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "That’s a good one too. Somehow listening to heavy metal tends to calm me down haha",
                    "score": 1,
                    "replies": [
                        {
                            "author": "alicat0818",
                            "body": "Yeah. I would listen to Offspring to calm down when I was raging. Sometimes, I listen to music that makes me feel even better when I'm okay to try to shift my mood.\n\nI've tried to be a lot more mindful of how I'm reacting. It helps unless I get overwhelmed by triggers.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kinetic_skink",
            "body": "ADHD has a lot of comorbidity with other mental health issues.\n\nWhile emotional regulation is a big issue with ADHD, what you describe your experience with emotional regulation potentially fits better with Borderline Personality Disorder (BPD)\n\nI'd suggest having a read up on it. See if it relates.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Conversation_9998",
            "body": "Really feeling this today. I just think about all the times that I’ve felt that way and it ended up being nothing, because that’s usually the case—it’s all in my head. \nOthers have mentioned rejection sensitivity, and I agree that you might want to look into that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Seeker_Asker",
            "body": "I carry ear buds that block out sound",
            "score": 3,
            "replies": []
        },
        {
            "author": "fryeesaucee",
            "body": "Today I literally was at a stop light to make a left turn and it was red forever and no one was coming. I almost ran the red light. I do this all the time. I’m actually going to call myself out, I HAVE run a red light because I get so annoyed and impatient after 20 seconds of waiting it to turn green.\n\nI always get upset and freak out at people over dumb stuff all the time because I can’t seem to act normal half the damn time lol. \n\nI know how you feel! \n\nI don’t have the best advice because I struggle too…but just know you’re not alone!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ezra502",
            "body": "have you learned anything about dialectical behavioral therapy? it’s a framework that is very evidence based and effective for lots of different things. it mainly helps with overwhelming emotions, but it’s laid the groundwork for most of the interpersonal and intrapersonal skills i have now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Interesting-Fan4543",
            "body": "Hey! I wish I had more advice, but I relate so much to this! Although I don't tend to get outwardly irritable, I switch from insecurity and embarrassed to depressed to panicked to happy to frustrated to super hyper really frequently, and like you said, it's often reality small things. It's exhausting for me and I know for my husband too (though he is really supportive!) \n\nI also use video games, and I feel that they can be really helpful catharsis/escapism! Idk what games you like but I'm all about the RPGs, my favorite is Baldur's Gate 3 for me and it's definitely good at distracting me. 😊 maybe too well sometimes though, lol. \n \nSomething I've been trying, though it's difficult, is trying to stop doing things that I know are going to trigger really strong emotions. For me that's could be not listening to music that I know makes me feel sad or even that reminds me too much of a certain situation or memory that could trigger me, even though I'm often wanting to find things that match my emotions. Maybe there's something like this you could try? \n\nI'm not sure if you've ever tried or looked up DBT, but I've found that quite helpful before!! It's usually used for BPD but also works for lots of other situations. Also, possibly bring it up a professional, if it feels safe- a psychiatrist (who was not great, but this one part was helpful) told me that I probably had \"BPD-like\", whether I actually have it or not, which she wouldn't tell me when I asked about it. \n\nI hope something in this might help a bit!! 💖 You're absolutely not alone",
            "score": 2,
            "replies": []
        },
        {
            "author": "monsieur_lulu",
            "body": "At the moment not at all, but I'm trying to work towards achieving (my own bastardized version of) Buddhistic non-attachment.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Basiacadabra",
            "body": "Therapy, mindfulness, medication, rest, podcast,walks",
            "score": 2,
            "replies": []
        },
        {
            "author": "wookiee1807",
            "body": "When shit that I don't like happens, I've taught myself to discern whether it happened TO/AT me, or whether I just happen to be in proximity to what happened.\n\n\nLike.. I have a coworker who has health issues (not disabled, just gets sick easy). I don't get sick as easily, so I'm often covering for them when they're out.\n\nSometimes (I have bipolar 2, as well) I'm on a low swing, and I'm pissed that I'm the only one ever being called in. \n\nI then remember that there are only two of us + they're not sick AT me, they just have more to contend with that keeps them out of work. That's life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jennievh",
            "body": "I wonder if DBT might help you. It's a lot, but it's a good program and gives you tools.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jsllls",
            "body": "Philosophically, zen and stoicism helps. Pharmacologically guanfacine (similar but more narrow transmitter target to Clonidine) has helped me. My adhd management meds are: vyvanse in the morning, guanfacine at night, and adderal as needed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PsychicFoxWithSpoons",
            "body": "Depending on how closely your mood shifts correspond to outside stimulus, you might have a comorbid disorder like BPD. ",
            "score": 2,
            "replies": [
                {
                    "author": "Lazy_Strawberry07",
                    "body": "It would be a good idea to get reevaluated. I’ve been diagnosed since I was a kid, but it doesn’t hurt to see if I might be struggling with something else. Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strange_Hat9354",
            "body": "It does the opposite for me. I notice pain less. I'm not as easily distracted. My hyperfocus becomes good focus. And I can make the right decisions. Impulse control goes up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Struukduuker",
            "body": "Firstly, it starts by realizing you're wrong. Now you got that out of the way, maybe try meditation. Separate yourself from yourself. Or when it happens try to stay in the feeling without acting on it, analyzing the origin and question yourself if it even makes sense to explode like that. Hope this helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Jury_7995",
            "body": "What kind of therapy?",
            "score": 1,
            "replies": []
        },
        {
            "author": "spider_queen13",
            "body": "genuinely one of the hardest things I struggle with, even after years of learning to better manage my emotions, sometimes a rough period happens and triggers an awful reaction, I hate it",
            "score": 1,
            "replies": []
        }
    ]
}