{
    "title": "Accommodations?",
    "author": "Downtown-Delay-6462",
    "subreddit": "ADHD",
    "rank": 329,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3040a/accommodations/",
    "id": "1j3040a",
    "selftext": "Do teachers usually give accommodations for ADHD students? Its not like i didnt want to do my math homework, i literally could not remember that i had anything to do. I wasnt just not doing it, ive told my teachers this, with a doctors note and they still dont give me an extension. They say i had time to do it in class, but i cant focus in loud environments like that. Is it a law somewhere that i get accommodations for it??",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Downtown-Delay-6462 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lawrence_Fletcher",
            "body": "What country and grade are you in?",
            "score": 1,
            "replies": []
        },
        {
            "author": "froggynojumping",
            "body": "Yeah where I live we have IEP’s (individual education plans) that follow throughout all schooling up to college/uni that provide numerous accommodations",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad_Injury_7600",
            "body": "So when I was diagnosed with ADD (in 1992) and struggled through school. My teacher gave me access to a resource room. It was a room with teachers in it where I could take my test in (without any distractions) and they would help teach the subjects I was struggling with. it helped me tremendously. My grades improved so much that they were going to kick me out of it. My teacher knew it helped me out so he would smug my grades a little so I could stay in it. That was in 4th grade. In my high school they had classes that accommodated kids with learning disabilities. I’m in the US. You should ask your teacher and or counselor to see if there are any resources they can recommend. I hope this helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hazazelle",
            "body": "Yeah like others have said, the best way would be to go through whatever the schools IEP/504 plan or equivalent. You’ll definitely need a diagnosis and a list of specific things your doctor recommends that would make your schooling easier. Best things to explicitly state in the plan (if allowed) would be extensions on turned-in work and supervised alternate/alone testing usually held in the guidance office or somewhere else. Heads up tho, they’ll most likely have some type of screening process where you’ll be vetted to some degree. My 504 allowed me to actually graduate high school with a decent gpa, so I highly recommend if that’s available to you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "KatTheKonqueror",
            "body": "Assuming you're in the US, then yes, they are required by law to give you reasonable accomidations for your disability. You or your parents need to make the request though. Your parents and your teachers should meet, possibly with your guidance counselor to come up with an Individual Education Plan based on your specific needs.\n\nUnfortunately, after my diagnosis, my parents were like \"ok, go tell your teachers,\" and then nothing happened. So, I don't actually know much about how the process is *supposed* to work, other than not the way I did it.",
            "score": 1,
            "replies": []
        }
    ]
}