{
    "title": "Hack to take your morning meds",
    "author": "lla008",
    "subreddit": "ADHD",
    "rank": 267,
    "score": 13,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j32nzt/hack_to_take_your_morning_meds/",
    "id": "1j32nzt",
    "selftext": "Not sure if this will work for everyone, especially if you don't have a large bed. \n\nI have a king size bed and I sleep with drinks and morning meds in my bed. So first thing I see in the morning are my meds with something to drink. So before I even roll out of bed to pee, I know I am taking my meds. \n\nThis has worked better than setting alarms or having a pill box for the morning. It has worked better than getting up, going to the bathroom, and then getting distracted by the 1000s of things running amok in our brains. \n\nLots of people in this forum have said they will take their meds and then sleep a bit more to wake up refreshed. This has definitely been true for me. If I wake up before my alarm, I just take my morning pills and go back to sleep. When I wake up I'm ready to go. \n\nAn alternative to this would be keeping meds on your nightstand...but that didn't work for me 🙈 I actually have to sleep with them to remember them. \n\nTo go off on a tangent, there's an old tradition where I'm from. If you need to learn something or want to manifest something you put it under your pillow and literally sleep on it. This has worked for me when I had to study for school or prepare for a job interview. I would put my notes under my pillow and sleep. \n\n\nHope this helps someone out there 💙 thanks for coming to my Ted talk 🧸",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/lla008 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "foobarbizbaz",
            "body": "My hack was to start using a day-of-the-week pill case/organizer all the time, not just when I’m traveling. Biggest issue for me wasn’t forgetting to take meds as much as forgetting *whether* I had already taken them. Bonus is that it forces me to inventory my meds each week so I know when I need a refill.",
            "score": 3,
            "replies": [
                {
                    "author": "ladyxhyper",
                    "body": "this is working incredibly well for me! i basically did the same thing and then jazzed up the outside of the case with stickers. each day of the week is a different color and i have it split into 3 tabs: AM noon PM. the visual really helps me it seems. 🥹",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "grimeandreason",
            "body": "I have a written note taped to the front door.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stirbmehr",
            "body": "Glad it works for you, but ngl im sure by doing that I'll still would forget it, or somehow manage to lose meds on bed.\n\nPersonally used another trick with reminders, bit more brute force one - instead of alarm on phone which can be turned off almost unconsciously, i used that horrendously loud ikea analogue alarm clock. Which deliberately was placed on another side of room, so i *had to* walk to it and take meds. This hellish thing so loud that you won't fall asleep even if you want after.   \nMajor downside - absolutely not an option if you living with someone.\n\nEither way it's kinda bandaid, imo, cause biggest help in the end is right dosage, strict scheduling, and specifically fixed sleep schedule - biggest game changer that one can achieve after getting on meds and kinda get themselves under control. Cause if everything chosen right you won't have such problem with remembering in first place.   \nTho it can take a lot of time to iron out details. And for sure there's corner cases of people who have more difficult circumstances or additional symptoms from other traits. \n~~Also there whole microcosm of Strattera and its generics, which demand own borderline rituals at times to make it work~~",
            "score": 1,
            "replies": []
        },
        {
            "author": "TkwvzPjrAzL",
            "body": "my issue is my exec dysfunction can be so bad that i don’t even roll to the side of my bed to take my meds. but it’s the least bad system i have",
            "score": 1,
            "replies": []
        }
    ]
}