{
    "title": "I forgot the name of someone I’ve known for 7 years and I want to die",
    "author": "AussieSpender",
    "subreddit": "ADHD",
    "rank": 116,
    "score": 221,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 61,
    "url": "https://www.reddit.com/r/ADHD/comments/1j38pwp/i_forgot_the_name_of_someone_ive_known_for_7/",
    "id": "1j38pwp",
    "selftext": "I feel so bad about this, I literally just blanked and was put on the spot.\n\nI’m in my first year of uni for context.\n\nSo we were in a small group of 3 of us for a short group task and I was adding in my group mates to the excel sheet when I asked the one who I didn’t know to put in he email. When I asked my other group mate to put in her email, she said “you already know my name, we went to high school together” and I just blanked. She know because I instantly went red and said sorry. She made abit of a deal out of it like “dude how don’t you know we literally went to Highschool together and were in a few of the same classes” and what not.\n\nI just feel REALLY bad because we’ve known each other from year 7 to year 12 and now we’re in the same uni class. It’s not like it’s even been ages since we’ve last seen each other, which was in November for our graduation dinner.\n\nAnyways, off to cry now and never show up for that class again.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/AussieSpender and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "garipimus28",
            "body": "People forget the name of their mothers or spouses in weddings. It should come as funny. But I totally get you, it feels like a failure. But it is not. You are not a computer and even they can glitch. So nothing to worry about. It is human and you were distracted. Remind yourself.",
            "score": 138,
            "replies": [
                {
                    "author": "clammyanton",
                    "body": "Exactly. It’s totally human to forget names, even of people close to you, in stressful or distracting situations. Everyone has their moments, and it’s not a failure it’s just part of being human. Sometimes the more pressure we feel, the more our brains can freeze up, but it’s just a minor blip. You’re not a robot, and even they make mistakes too.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "nidoowlah",
            "body": "I too forget peoples names often. It’s not that I don’t know the name as much as my brain glitches when I go to look for the info in the moment I need it.",
            "score": 39,
            "replies": [
                {
                    "author": "Blurghblagh",
                    "body": "I like to call them brain farts.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "LastSpite7",
            "body": "I forgot my own baby’s name if it makes you feel better. I was taking my second baby to his 8 week checkup and the nurse said “congratulations! What did you end up naming him?” And my mind went completely fucking blank and I had to admit I couldn’t remember. So weird and embarrassing (I’m sure I was very very sleep deprived).",
            "score": 32,
            "replies": []
        },
        {
            "author": "BitOrdinaryBloke",
            "body": "You know the reason why it happened and happens and it's not because you're a bad person. I don't know how open you are about your ADHD status but ever since my diagnosis 2 years ago, I've been quite honest about it and how it can hinder me in multiple ways. If you had the ability in that moment to remember, you would have. It's not your fault, so don't put unwarranted guilt or shame on yourself.",
            "score": 18,
            "replies": []
        },
        {
            "author": "itsalonghotsummer",
            "body": "I forget the names of people I've known for years sometimes, you're not alone.",
            "score": 13,
            "replies": []
        },
        {
            "author": "ChipMajestic7756",
            "body": "I forgot my uncle in laws name when I was talking to his daughter and I called him 'um old mate' and she just goes my dad?? It was fucked I try to forgot about it",
            "score": 10,
            "replies": [
                {
                    "author": "wmm09",
                    "body": "That’s like when all of nephews and niece are in the same room/house.  We either call them by their birth order (which we somehow remember easily) or rattle off a bunch of different names until we get it right.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "wmm09",
            "body": "I’ve done that so many times.  This particular time happened before I was diagnosed. I had just spent two months with someone new at work, and then ran into him in an entirely different location and could not for the life of me figure out who I was talking to.  I tried to keep up the conversation until I finally just let him know that I had no idea who he was. He looked genuinely concerned and I just told him I’ve been so stressed out that my mind couldn’t place him out of context, I just completely blanked. Once he reminded me I was able to rattle off a few things, but it was really embarrassing. \n\nAnother time I ran into someone in the grocery store who kept talking about the party we had recently attended and asked about my husband, and our mutual friends. I kept up the conversation and went home to tell my husband that I’m going to get kidnapped one day because I don’t want to be rude to someone… 😂",
            "score": 8,
            "replies": []
        },
        {
            "author": "billymillerstyle",
            "body": "I forget people's names all the time. I forget people's names the second sentence after using them. I've forgotten the names of relatives and close friends for hours at a time. It happens so much I'm not embarrassed just annoyed.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Synn1982",
            "body": "You couldn't have used this trick in this situation, but this has saved me many times. Running in to someone that I know but I forgot their name, I will ask: what's your name again? They answer: Waldo. Me (with a but of a chuckle): yeah this I know, I meant your last name. ",
            "score": 5,
            "replies": [
                {
                    "author": "gamesk8er",
                    "body": "I do something similar. I ask what their last name is, which usually connects the dots in my brain to their first name.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dragon-Guy2",
            "body": "I kinda often forget the name of my mother, doubt it's a memory failure as much as a distracted thoughts issue, one can only hope the people around them understand when this happens xD",
            "score": 3,
            "replies": [
                {
                    "author": "fluffypotato",
                    "body": "It probably shouldn't be that hard to remember that her name is Mom. 🤣",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CallPuzzleheaded5871",
                    "body": "Makes sense. I doubt you call her by name.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Golintaim",
            "body": "This is why I tell almost everyone I meet that I will probably forget their name multiple times. I have no control over it, and me remembering for years doesn't mean tomorrow I won't forget. Wouldn't have helped in this case, but it's also the reason I rarely use names when I talk and mainly use pronouns.\nThe worst thing is I'll remember a face for decades but it's really hard for me to get a describe from the perfect image I have in my head, like I can't describe faces but I can recall them perfectly.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Blurghblagh",
            "body": "That is normal and people should not take offense or be embarrassed. Happens to me sometimes. It's there on the tip of my tongue but just can't quite grasp it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chance-Outside7051",
            "body": "I once forgot a coworkers name. I had worked with them for 3 years.  I had used their name THAT SAME morning when saying hello.  Then it was just… gone.  I had to ask their name again.  When they said it, i had not one spark of recognition.",
            "score": 2,
            "replies": [
                {
                    "author": "AussieSpender",
                    "body": "I did the same thing. I sat down at our table and said Hey “name”, how are you?\n\nAnd not 15 minutes later I do that.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "argumentativepigeon",
            "body": "Ive mind blanked on my own brother’s name before lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Soulessblur",
            "body": "If someone is the type of person to get upset over a name being forgotten, they're not the type of person whose name is worth remembering.",
            "score": 2,
            "replies": [
                {
                    "author": "Aggressive-Problem65",
                    "body": "I will say this works for general stuff but not always\n\nIs it hypocritical of me to be upset when my name is forgotten? Esp on a day where I'm already dysregulated and feeling rejected by society? I mean, after the initial moment I'll move on but in that moment, I feel worthless\n\nThere's also issues surrounding trauma, especially racial trauma, for some people. Some days you're just not in the mood to explain your name all over again",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kenda1l",
            "body": "In 7th grade we were doing one of those \"get to know you\" games where the first person at the front says their name, then the next person says that person's name and theirs, and then the next person says the other two and their name, on and on until someone messes up and you have to start over. I was near the end of a 30 person class and I was working so so hard to remember everyone's names. I was confident! I had them all! \n\nI did not have them all. I got about 20 names in and then came to my best friend. My brain went blank. I hadn't included her in my frantic repeating of names in my head because I already knew her, so why would I? I stared at her, mouth agape and slowly turning redder and redder until the teacher finally took pity on me. The class, however, was not so kind, because now we had to start over from the beginning. My friends never let me live it down.\n\nSeriously though, what kind of monster makes a kid remember and repeat 30 names in order, while another kid only had to remember their own?",
            "score": 2,
            "replies": []
        },
        {
            "author": "cloudmountainio",
            "body": "I genuinely can’t remember my kids middle names sometimes and I named them 😆 \n\nAlso, if I’m calling for one the kids for dinner I usually call out at least 2 other names (including the dogs) before I get to the correct name. \n\nHonestly don’t worry about it. It happens.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FinalFatality",
            "body": "The person i met in middle school (who became my best friend later on) and I were a grade apart. They went to high school and then a year later I followed.\n\nFor like SIX MONTHS I avoided saying their name because I literally could not remember.\nEventually, I heard someone say it and proceeded to call them by name which then prompted them to admit they did not remember my name.\n\nGranted, we're both ADHD, but it's been 15 years since and i still laugh that we avoided saying each other's name AND avoided admiting it for six whole months. We literally talked daily during those six months.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aggressive-Problem65",
            "body": "I know it's usually a joke for most people\n\nBut I literally forget my own name when people ask me",
            "score": 2,
            "replies": []
        },
        {
            "author": "ForestOfDoubt",
            "body": "At this point in my life, I am just extremely forthright about asking people to remind me of their names.",
            "score": 2,
            "replies": []
        },
        {
            "author": "zestybi",
            "body": "I once blanked out on my own name while filling a form",
            "score": 2,
            "replies": []
        },
        {
            "author": "matbrummitt1",
            "body": "When put on the spot I forget everyone’s names. When captaining our tennis team i’d suddenly be asked for everyone’s names and just go blank.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific-Gain5710",
            "body": "This happens to me, I’ll forget someone’s name that I’ve known for 8/9 years and have to run through every name I can think of until I figure it out. Quite frustrating",
            "score": 1,
            "replies": []
        },
        {
            "author": "VermelhoRojo",
            "body": "lol I feel you!!!! I have a script when I meet people that includes how terrible I am with names, don’t take it personally, etc etc. I also have one for when someone asks me out of nowhere the name of another person - it goes like “I have this thing that when popped for someone’s name I forget it on the spot, but it will come back to me. Usually at 3am when I’m sleeping. Do you want me to let you know if that happens?” and smile.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slight_Respond6160",
            "body": "I never expect anyone to remember my name, I really don’t care. It’s not that important",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flippinsushi",
            "body": "I forget where I live, as in a basic fact about myself. I have given the wrong address a few times in the last few years, but the absolute worst was the time I went through customs and gave the wrong state, a state I hadn’t lived in for many many years at that point. Nerves!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CallPuzzleheaded5871",
            "body": "Aww. Tell her you have dimential or something...\n\nOr say you are stressed out goign through stuff and blanked.\n\nOr say ADHD, what is the big deal!?\n\nIn future try to check facebook or other socials if you can\\`t remember ![gif](emote|free_emotes_pack|wink)",
            "score": 1,
            "replies": []
        },
        {
            "author": "fluffypotato",
            "body": "If it makes you feel better, I forgot my spouse's name a few months into our marriage. Just for a second but long enough that I blanked and called out for \"babe\" instead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NSMike",
            "body": "I sat next to a freshman girl for an entire semester of a class in my senior year of high school, and we were chatty and friends the whole time.  I saw her like 4 years later at a party, and I completely forgot her name.  To be fair, her parents liked odd names and I don't think her name was very standard, whereas mine was basically the most common boys name of my generation, but yeah.  It happens.  And I can't remember it now, either, although now that span is 20 years since I've last seen her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suprman21",
            "body": "Happens to me all the time, i usually just call everyone buddy to make it not awkward",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flowy_Aerie_77",
            "body": "Weird that she was super sensitive about it. People forget even obvious things all the time. It's not that serious.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xMend22",
            "body": "It definitely happens and shame on them for being so weird about it.\n\nIf it helps - one time I was just chilling making small talk with a few friends. I have known my buddy - we’ll call him George - for a couple of years at this point and see him nearly every day at work. I went to call him by name to say something to him and I looked him dead in the face and said “Hey, Greg…”\n\nI froze and was trying to figure out how my brain did that without finishing my thought and they busted my chops for the rest of the week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gvarsity",
            "body": "I forgot the name of my then girlfriend when introducing her. She introduced herself without blinking. She understood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "richhomiekod",
            "body": "Laugh at yourself buddy. It's the best diffuser and best for your mental. You forgot someone's name you've known forever, you know you're an idiot. Own up to it and let everyone else know you think you're an idiot. Apologize and bring her a coffee or something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilentHuntah",
            "body": "It's only because of this damn sub I feel less shitty for such things. And yes. There's a dude in my group of I wanna say about 12 whose name I learned then forgot for months. I don't talk to him a ton except for the usual 5 minute small talk, but damn I felt bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Maeng_Doom",
            "body": "I ask how it's spelled or if they want a nickname. Avoids this pretty tactfully generally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TransATL",
            "body": "I feel you, OP. I wish we could all have a Gary to our Selina",
            "score": 1,
            "replies": []
        },
        {
            "author": "nabilsultani",
            "body": "I even forget my own name sometimes. Please don't cry",
            "score": 1,
            "replies": []
        },
        {
            "author": "zph0eniz",
            "body": "Ive forgotten names of people like that too.  It happens.\n\nSay it wasnt intentional, just brain goes blank with anything really.  \n\nAdmit to it, say sorry, explain that mind just takes a moment sometimes and just has a hiccup at times, people will usually be understanding once they understand the situation.  \n\nPeople usually think from there own perspectives.  They likely dont understand how your life and thinking is like and cant mind read.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CafeTeo",
            "body": "on 3 separate occasions I completely forgot names of friends I knew for years. And in 2 situations I forgot the name of the girl I had been dating for months.  \n\n1 of these cases was my future wife, we had been dating for a year. And I had suddenly completely forgot her name. And it took 2 weeks of me masking and not saying it before someone else said her name and I re-learned it.  \n\nIt has not happened to be in 17+ years with anyone now. That time was the last incident. But OMFG how freaking weird and scary.  \n\nI feel for ya.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_idiot_kid_",
            "body": "One time I literally forgot my favorite cousin's name. Who I'd seen many many times throughout my life. It took me WEEKS to remember, until one day it randomly popped in my mind. Nobody knows but I was still so embarrassed. Well, now somebody knows lol\n\nIt's really crazy how bad I am with names. I don't even bother asking people for their names because I know I'm going to forget it anyways so might as well not bring attention to the topic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrEnter",
            "body": "I forget my son's name from time to time.\n\nI forgot my sister's name a few days ago.  \"Hey... sister-person...\"\n\nThe worst part is I normally don't have ADHD-related memory issues.  I have an excellent memory.  But names just never seem to get filed right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jorrylee",
            "body": "Same, introducing a close friend of twenty years to another friend, blanked in the name, and so I just said “and now I’ve forgotten your name so please introduce yourself.” And now I have a story I can tell people to not feel bad if I’ve met them twice and cannot remember their name, because these things happen. Don’t fake it, just be honest and say you forgot…again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea-Network-8640",
            "body": "Yeah forget all names all the time. Even worse when there are nicknames too. Can literally have been using their name 5 seconds before and it can be gone. \nSame with pin numbers. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "spicewoman",
            "body": "I was once filling coworkers names out on a sheet with a coworker telling me who to put in what section... then the coworker said \"And I'm in #3\" or whatever and I just \"....\" O_O I'd worked fairly closely with that coworker for *years*.\n\nLuckily she decided it was because I didn't know how to *spell* her name, and very offendedly spelled it for me to make sure I \"got it right.\"\n\nI fairly often glitch out on names (to the point where I just call most people by nicknames or generic addresses like \"hey man\" and \"hi hon!\"). When names are gone for me, they're *gone*. Dunno if it's long or short, common or uncommon, or even what letter it starts with. It could be literally any name in existence. The only thing I've found to help recall in the moment is to quickly run through the alphabet in my head.\n\nFor some reason, as soon as I get to the \"right\" letter, I can instantly find the name in that brain-file. It's not fast enough for many situations (especially if they have a late letter), but it helps with some.",
            "score": 1,
            "replies": []
        },
        {
            "author": "warm_kitchenette",
            "body": "When you know the person well, is this an ADHD symptom?  The frustrating part for me is that these lapses can appear at literally any time, and I know *everything else* about the person. Their face, their laugh, that movie we talked about. \n\nWhen I don't know the person well, I definitely miss names all the time, which I do see as related.",
            "score": 1,
            "replies": []
        },
        {
            "author": "konnanussija",
            "body": "Everyone who knows me is well aware that I don't remember shit. From my experience, it's pointless to fight it, just make sure they know that it's nothing personal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheChalotte",
            "body": "I forgot my collegues' name despite working with them everyday and we are actually very close.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theorangeblonde",
            "body": "I regularly introduce myself to people I've met multiple times before. Sometimes they're irritated, then they realize it's not intentional and they usually laugh it off. Depression is a bitch, I've had so much memory loss because of it! Hopefully your friend will get over it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordQuorad",
            "body": "Yesterday, I forgot the address of my own house that I've lived in for several years. It happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Mixture5264",
            "body": "I met someone at my college reunion who I DO NOT REMEMBER. Turns out we were the same major, in classes together, and in the same building doing projects for four years. STILL can't remember her or her name. It was humiliating and she was hurt.",
            "score": 0,
            "replies": []
        }
    ]
}