{
    "title": "I know no one cares but",
    "author": "Important-Tonight-71",
    "subreddit": "ADHD",
    "rank": 104,
    "score": 14,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3un6t/i_know_no_one_cares_but/",
    "id": "1j3un6t",
    "selftext": "I recently got back on D-amphetamine and I don’t know what it is but I feel so much better in my day to day life. Of course, I still experience a lot of symptoms, but I’m also more in control of myself and my emotions. Maybe it’s the amphetamine or maybe it’s the feeling of impending doom if I don’t succeed, but I’ve been able to motivate myself to keep a consistent schedule. As of now, I’m super proud of how far I’ve come, knowing how much of a wreck I was in my freshman year of college. I really hope it stays this way, even if I one day decide to lean off the meds. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Important-Tonight-71 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "doneb1957",
            "body": "I just joined and have made a few posts. I’m getting to the end in my life because I’m old, late 60’s. Most of my life has been a complete mess. I tell people the reason I graduated high school is my teachers felt sorry for me. They didn’t look for things like this back then. I can look back and see how things could have been different if I were on the right meds, O well, too late now. What has helped me is I now know why. That alone has changed how I see myself, and judge myself. Getting late here, but the best advice I could give you, don’t look at the past if it going to cause you pain, look to today and the future and decide to do better, too be better. Good luck my friend",
            "score": 5,
            "replies": [
                {
                    "author": "Important-Tonight-71",
                    "body": "thank you so much, and i hope you truly do get the happiness you deserve, even if you feel like it’s too late.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ADHDOCDFML",
                    "body": "You can still give your life meaning by sharing your experiences like this! I hope knowing why you've struggled in the past brings you solace and self-compassion you deserve.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LongjumpingAffect451",
            "body": "Yay! Good for you!",
            "score": 4,
            "replies": [
                {
                    "author": "Important-Tonight-71",
                    "body": "Thank you! I hope everyone gets the help they deserve :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strange_Hat9354",
            "body": "It blows my mind younger people than me (31m) are having similar experiences, ailments, disturbances, and hormonal activity. I think there's outstanding evidence to show our environments, depressive-economical state, and medication refills have been altered. In a unsavory way. I hear the newcomers saying it's the turn-around. Understandably. The drug is considered a crutch by a lot of unforgiving parties. Your lucky to wrestle the sensitivity around being judged. Nearly escaping a 10 year tenure myself. It's never going to be a light-hearted adventure. I don't believe in happy-ending with these drugs. Especially for people like myself who were forced initially. Also weaponized against me later in life. \n\nNo one is prepared to psychologically come off these drugs. People are cruel with the shortages. Offering no cut and dry solutions here in America or anywhere in the world. \n\n  \nAnyways if you read any of this. I don't think your side-effects are your fault alone. I suspect there's forces at bay causing most people abnormalities.",
            "score": 3,
            "replies": [
                {
                    "author": "Important-Tonight-71",
                    "body": "I actually think the drugs have helped me a substantial amount, but I do understand that a lot of people struggle with them. My friend was on them and he told me it was horrible for him, he was always sad and mellow.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ADHDOCDFML",
                    "body": "Hmmmm, that's a bleak outlook in life, with no judgment as I don't know what you've been through.\n\nI genuinely wish you all the best with all that you're going through.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Strange_Hat9354",
                            "body": "Not the first. Not the last",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}