{
    "title": "Philosophical- or ADHD issue?",
    "author": "Substantial_Gear6791",
    "subreddit": "ADHD",
    "rank": 91,
    "score": 7,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3yvhe/philosophical_or_adhd_issue/",
    "id": "1j3yvhe",
    "selftext": "Lately I have noticed how my conscious is less intelligent than my subconscious. I mean: I can hear myself say really smart things that connects matters in really advanced and intelligent ways, but I feel as if though my conscious has almost nothing to do with it; as if *I* am not the main force *actively* thinking (the conscious is busy thinking about navigating eye contact \"just right\" or something, hah). I passively observe myself thinking and obidiently to my mind happily acts accordingly to what is says, sometimes using words I have never heard before. Difficult and advanced questions *usually* dont require any *real* effort as a result of this. Sometimes I don't even understand what I have said/ written fully. But I get an A on my essay and get on with life... As if my brain is smart, but *I* possess merely 20% of that intelligence *myself*.\n\nIs this an epistemological (philosophical) matter or an ADHD matter? Curious to hear your insights, and if you relate. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Substantial_Gear6791 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "squats_n_oatz",
            "body": ">but I feel as if though my conscious has almost nothing to do with it; as if I am not the main force actively thinking\n\nBecause you're not. I've never thought a thought in my life, and no one else has either. If you pay attention to thoughts, for example in what is sometimes called meditation, observing where they come from, where they go, it quickly becomes apparent you have no real control over how they arise or which thoughts appear.\n\nThe most you can do is to focus on some thoughts and not others. Thoughts you focus on stick around. Trying to fight a thought, judge it, or stigmatize it is also a form of focus (perhaps even the strongest kind) and will only cause the thought to persist. Instead, you can just observe, and like all phenomena, the thought will dissipate. Quicker than you think: when you watch your thoughts without judgement, you will notice that most thoughts (defined broadly, i.e. including feelings/emotions) are extremely short lived unless you latch on to them.\n\nUnderstanding this is liberating. You don't have to believe your thoughts. You really shouldn't believe most of them, actually.\n\nNot to get all Jehovah's Witness on you, but you may be interested in Buddhism, though I don't think this is the only path that teaches this insight.",
            "score": 3,
            "replies": [
                {
                    "author": "Substantial_Gear6791",
                    "body": "That is an interesting theory and I have read a lot about it. Could you express your views on where *active* thinking lies in that? Actively testing theories within your mind, trying to find your way towards an understanding, etc. We are not passive passengers of our minds in fleshy bodies, I mean.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ScientificSoup",
            "body": "I hereby diagnose you with split brain syndrome.\n\n(Jokes aside, I’ve no clue but it sounds very interesting!)",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChipMajestic7756",
            "body": "Omg YES, I do this exactly.",
            "score": 1,
            "replies": [
                {
                    "author": "ChipMajestic7756",
                    "body": "I have my main dialog and then my big screaming dumb dialog then a quiet (smartest) conversation-like dialog in the background! I started catapres and now only have my main dialog, it's much calmer and I find it easier to sleep now!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bennymc123",
            "body": "Yep, I get this too!\n\nIt's like my subconscious works out a complex issue immediately and executes an emotional response, then it's down to my conscious to work out what happened. The same happens in other ways too, for instance, I will one day suddenly feel very anxious then spend all day trying to work out why like a detective - it's usually because I missed an appointment or something that my subconscious knew about and my conscious didn't.\n\nA definite disconnect going on there somewhere!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Struukduuker",
            "body": "You are not your thoughts or memories.",
            "score": 1,
            "replies": [
                {
                    "author": "Substantial_Gear6791",
                    "body": "Yes, I agree. However that is a separate matter. When I write *I* or *myself* I am aiming at my most immediate thought processes (my conscious ones) – arguing that it is within the conscious our sense of self lies, not that it is the same thing.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}