{
    "title": "My sensitivity to justice always backfires, and now I feel ashamed",
    "author": "lexicona",
    "subreddit": "ADHD",
    "rank": 107,
    "score": 3,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j41gbu/my_sensitivity_to_justice_always_backfires_and/",
    "id": "1j41gbu",
    "selftext": "Many of you can probably relate. I'm usually very non-confrontational, but sometimes I see things that I just can't let go of. Unfortunately, it seems like the times I do speak up about something, I end up misinterpreting the situation completely or am just wrong. Well, I just did it again. I'm a member of some local Facebook pages where people post properties for rent, and I've seen some posts recently that seem suspicious, but today I actually looked into it. A couple posts from this business page advertised rental properties and included a link for you to apply. I went to the page's profile and red flags began to appear. There was no number listed and I could not find any information about the business when I googled it. On top of that most of the reviews on their page were fake/bot reviews that had nothing to do with the business itself. I googled the address and found a different management company had posted the listing. I called the company and asked if they worked with them and the person I spoke to told me they did not.\n\nWell then I sprung into action. I replied to the post I saw telling people it was a scam. Then I made a post to the group to warn others. This page replied and stated they are working with that company. Then I used our state website to see who the owner of the property was and I saw the company name.\n\nNow I feel bad for accusing this person but I really genuinely thought it was a scam and that I was protecting people. I’m currently planning my next steps but I was just hoping maybe you all could relate/commisserate.\n\nGeez it makes it so much harder to stand up for myself when you feel like you can’t trust your judgement of a situation.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/lexicona and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreenJedi",
            "body": "Your motivations were pure\n\n\n> and the person I spoke to told me they did not.\n\n\n\nAnd don't you think that's exactly what a scammer would say?",
            "score": 2,
            "replies": []
        }
    ]
}