{
    "title": "ADHD and Physical Symptoms form Anxiety (Starting Vyvanse)",
    "author": "Mysterious_Self2707",
    "subreddit": "ADHD",
    "rank": 112,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j481av/adhd_and_physical_symptoms_form_anxiety_starting/",
    "id": "1j481av",
    "selftext": "Hey all, \n\nSo I've been struggling with mental health issues for the last 6+ years. Instead of making this long winded, my biggest issues are and have always been physical symptoms of anxiety. I've tried 10-15 different SSRI/SNRI with little to no relief from theae symptoms. \n\nMedically I've had about every test possible. I've worked with numerous health care providers and currently still working with Psychiatrist and Physiologist. \n\nRecently had an assessment for ADHD. I was prescribed Ridalin which I tried for the week and almost ended up in the hospital due to the severity of physical symptoms. \n\nI've recently started Vyvanse. 10mg been on it for 4 days. I had a co worker who has numerous physical symptoms who was off work and took this medication and within a day he was feeling normal. \n\nI know lots of people see results fairly quickly but has anyone ever been in a situation similar to myself where you tried mental health meds and switched to ADHD medication and had results? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Mysterious_Self2707 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Human_Local3519",
            "body": "Yes it’s a very real phenomenon",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Self2707",
            "body": "I'm on day 4 and I'm honestly unsure if I notice anything other than increased physical symptoms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weird-Mall-1072",
            "body": "I am in a very similar situation with meds. For some people adhd meds help anxiety but I can’t tolerate them because of physical anxiety symptoms. It can go either way I understand.\nPregabalin was the only medication that helped my anxiety except benzos on which you cannot be regularly. Then again, pregabalin stopped working after first 3-4 months, on it for 2.5 yrs now and I really wanna taper off. I did some decrease a year ago but will try for more",
            "score": 1,
            "replies": [
                {
                    "author": "Mysterious_Self2707",
                    "body": "Wow you sound like me. Pregabalin is the next drug I'm going to try. Benzos are also the only thing that worked for me. \n\nDid it work well for those 3-4 months? Is it still working a little bit or are all the symptoms back?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Weird-Mall-1072",
                            "body": "It did but I don’t think its worth it if you can just not. I went as high as 225 mg per day but tolerance builds and the moment I tried 250 mg per day it was making me so depressed and slow that I had to roll back to 225, for the last year I am on 150 mg per day. After initial 3-4 months, they stopped working mostly, I feel like I am taking them just to be like how I used to be when I didn’t take them. I also have fibro for like 3-4 years but they never helped my pain. Btw I think they made the memory and attention parts of my ADHD worse.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}