{
    "title": "Alcohol change in personality - ADHD",
    "author": "Remarkable_Lecture_5",
    "subreddit": "ADHD",
    "rank": 63,
    "score": 1,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4aco6/alcohol_change_in_personality_adhd/",
    "id": "1j4aco6",
    "selftext": "30/m - recently diagnosed\n\nI don't know if anyone else has experienced this or is similar but I'm a bit stuck with what to do next.\n\nIt's been a thing where when I drink quite a lot my personality changes and I either offend someone or do something stupid. For example, I went out and made someone feel uncomfortable or I fell asleep at my doorstep. I've been drinking less and less, however when I do this seems to happen. I'm unmedicated but am considering it, also I've been feeling quite anxious recently with, work, life and isolation etc. I do exercise  everyday, eat healthy, generally look after myself too but don't really seem to have any long term improvements.\n\nI am feeling quite lost with it all and don't really know what to do, any advice would be welcomed.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Remarkable_Lecture_5 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "alteredpilot",
            "body": "Some people can drink, everyone else shouldn't. You can't. Stop drinking. You don't know what your baseline normal if you're drinking even sporadically. Get a clear head and proceed with life.",
            "score": 12,
            "replies": []
        },
        {
            "author": "ermacia",
            "body": "Yeah, dude, that's not an ADHD thing. Some people's inhibitions go away when drinking, and some react in the worst way. If you don't like what you become when drinking, just don't. I've given up drinking, except for Bayley's - I was heavy party drinker in my 20s - and I'm doing fine.",
            "score": 7,
            "replies": []
        },
        {
            "author": "spaceseas",
            "body": "This is a common issue with alcohol, and nothing to do with ADHD. I've never gotten the charm of drinking beyond a pint or two occasionally as \"social lubricant\" anyway, but if you don't react well to drinking, then you shouldn't be drinking.\n\nAlso meds are a very different thing from alcohol if that's the worry (and most shouldn't be combined with drinking anyhow).",
            "score": 5,
            "replies": []
        },
        {
            "author": "ThisIsMyCouchAccount",
            "body": "I disagree with the comments so far. They are saying it's not related to ADHD. I think it is.\n\nI wasn't diagnosed until I was 29. So I had all those prime drinking years and college where I had no idea. Now that I do - it explains a lot.\n\nI was kind of an asshole. In that I would follow any impulse. I would push buttons. Act out. Cause trouble. Anything to make the situations more \"exciting\". Anything to make it more stimulating.\n\nI don't think it was the typical \"I'm blank out drunk and acting crazy\". Because I started way before that. And it carried on past college when you're just out at a bar with a few people.\n\nGet medicated. It helps in so many ways. It's usually only talked about in the context of productivity. But it's stuff like this where it really can be a life saver. \n\nYou should also probably stop drinking like you do. At least until you get things sorted out. Grab a nice six pack and stay home. Try and find other ways to enjoy your time off. Which was a lot of it for me. I didn't really know what else to do. Most my friends were drinkers that went out.",
            "score": 4,
            "replies": []
        },
        {
            "author": "cselisondo",
            "body": "Different people's nervous systems react differently to alcohol. Some people get a little sleepy, some a little chatty, some people start engaging in completely unhinged antisocial behavior. If that's you, not your fault, but the way you're wired sounds incompatible with alcohol. Me personally, I don't really engage in too much problematic behavior when drunk, the only thing is that the lowered inhibitions make it hard to stop drinking after just one or two so I have to keep a pretty strict lid on it / switch to non-alcoholic after my second drink.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Turbulent-T",
            "body": "Quit drinking and you won't have that problem anymore.  Your self esteem will improve massively",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twentie5",
            "body": "im an alcoholic, sober... when i would first drink many years ago it drop me down..... i would fixat on that it would cure me.\n\n  \nmuch older now alcohol now get me so fucking hyper i can run thru walls, doctor just said yup. I can turn into an entirely hyper nutty person with no limits, impulsive out of control. \n\nit basically amplifies all my traits past 11  \n\n\nyeah, i need to stay away from that stuff. you should too.",
            "score": 1,
            "replies": []
        }
    ]
}