{
    "title": "Caffeine Withdrawal & Adderall",
    "author": "JakeMontouro17",
    "subreddit": "ADHD",
    "rank": 93,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4bn89/caffeine_withdrawal_adderall/",
    "id": "1j4bn89",
    "selftext": "Hello! I’m new to this group and figured I’d ask a question because of something that just happened. I was recently prescribed Adderall XR (20 mg) last week after previously taking Methylphenidate XR (36 mg) for almost a year. The reason for the change is because my insurance would not cover an increase in dosage unless I tried and failed with an array of other stimulants, Adderall included.\n\nMy psych put me on Adderall and I’m currently on Day 9 and it’s been great so far. However, I recently decided to quit drinking caffeine (I used to drink two 12 oz Red Bulls a day). I went down to one Red Bull a day and yesterday stopped drinking them completely in order to let my meds do its work in the best way and to mitigate any potential health risks.\n\nToday, I woke up extremely early at 5:30 AM and couldn’t go back to sleep. I just kept tossing and turning. I managed to sleep for maybe half an hour more (a little more than half a REM cycle) before my alarm went off. I also woke up with a bad headache that went away after about an hour. I felt incredibly lethargic and run down today which has been a drastic turn from how I felt previously after waking up. Throughout the day, my mind has not been in the right place, overthinking if the meds are working, feeling a bit depressed and unmotivated. I still managed to get some tasks done today but begrudgingly. I noticed less focus (inattentive ADHD), less quiet in my mind, and overall more overthinking and anxiety. This has pretty much been today and a little bit of yesterday too.\n\nI’m inclined to think that the reason I’m suddenly feeling like this is caffeine withdrawal. Again, I used to drink Red Bull every day and if I wasn’t drinking Red Bull, it would be a cup of coffee. I am a bit scared about the meds not working although I’m hoping it’s just withdrawal symptoms setting in and overall being stronger than the meds. Has anyone else felt like this before or gone through this before? Does it get better or more manageable?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/JakeMontouro17 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minimum-Option-9387",
            "body": "Yep. You’ll hate life for a few days but once your body stops jonesing for caffeine you’ll be fine. Just stock up on Tylenol and ride the wave.",
            "score": 3,
            "replies": [
                {
                    "author": "JakeMontouro17",
                    "body": "I’m an ibuprofen guy myself haha. I figured it would be the withdrawal symptoms but you never know. Thanks again!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cx_hxnnxn",
            "body": "I suggest getting caffeine pills ,, they sell them on amazon,, very inexpensive relative to canned energy drinks ,, they make them in a few different doses ,, You should be able to find 50mg pills ,, The pills are much easier to “taper” off of because you can be precise w/ the dosing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yawara25",
            "body": "I used to drink 200mg caffeine a day, I also quit when I started adderall, to go easy on my body.  \nThe withdrawals suck and last a few days but after that you'll be fine. For me it was mostly just really bad headaches.",
            "score": 1,
            "replies": [
                {
                    "author": "JakeMontouro17",
                    "body": "Yeah I definitely got the headaches and a little nausea. Other than that it was some overthinking and not sure if I was feeling the meds but that could be a product of overthinking haha. I did get protein shakes because I read that it’s useful when taking Adderall",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}