{
    "title": "I have hope again.",
    "author": "Lizrd_demon",
    "subreddit": "Anarchism",
    "rank": 462,
    "score": 174,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 39,
    "url": "https://www.reddit.com/r/Anarchism/comments/1i9dp0x/i_have_hope_again/",
    "id": "1i9dp0x",
    "selftext": "After years of hopelessness and retreat, the youtuber anark cohesively pieced together every critique I have ever had of society. Every exploration. All my research. De-colonial thought. Total pessimism. Every criticism of much of the western anarchist movement itself.\n\nYet when laid out into such a cohesive picture, a path emerges in front of you.\n\nBuilt on the back of systems analysis, meta-science, and indiginous critique of the machine.\n\nA new future presents itself.\n\nNot only anarchist. But practical. Supremely practical. Arguably more practical than our current system.\n\nYou can find it here:\n\n* [As a video](https://www.youtube.com/playlist?list=PLvwoHdNGq9wVweGZ5bj5ZxFYulL_Xll_z)\n* [As a paper](https://theanarchistlibrary.org/library/anark-a-modern-anarchism)\n\nI'm floored.\n\nFor the first time, I see a future.  \nBeyond death.  \nBeyond apocalypse.  \nBeyond retreat.\n\nNot some abstract theory.  \nBut a meta-structure that could truely be the next eon of humanity.\n\nMaybe I'm playing it a bit up. But I'm really emotional right now. I haven't had hope for so long. But spotting that light in the distance makes me see a potential future. Where we escape the machine.",
    "comments": [
        {
            "author": "a-friendly_guy",
            "body": "I was looking for a resource to help me get started. It'll take me a little bit to see it all, but I'll give this series a shot.",
            "score": 34,
            "replies": [
                {
                    "author": "NoGoodAtIncognito",
                    "body": "Take your time. I think I listened to it maybe when I was too fresh. I was confused a lot of the time. But it is beautifully written and is ultimately an amazing analysis. His \"Anark Abridged\" videos are much better suited for intro stuff. And if you are truly new, Andrewism is a great jumping off point.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Foronerd",
                            "body": "Highly recommend Anark and Andrewism\n\nAnark especially for introductory stuff and organizing and Andrewism for discussions of specific ideas",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "a-friendly_guy",
                            "body": "Commenting now because I've seen the first episode, and half of the second episode.\n\n\nIt's a dense video series - but packed with so much meanginful, thoroughly researched info. It's truly a master class for starting to understand the core pieces of anarchist thought.\n\n\nThanks for the great recommendation - would have never watched a 2 hour video on my own! \n\n\n(also, I know of andrewism, have seen a few videos and enjoyed)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kotukutuku",
            "body": "I agree. I find academic language really hard to parse, and YouTube is great for me. I research these pretty regularly and like you a clear praxis has emerged for me that I hope i can share here soon.",
            "score": 12,
            "replies": []
        },
        {
            "author": "TCCogidubnus",
            "body": "Still working through reading it, but it is reminding me of the book that actually ended with me starting to research anarchism - Emergent Strategy, by Adrienne Maree Brown. That book gave me some hope when I was starting to feel like there was no path forwards, by proposing practical ways to collaborate with the people nearest us to make things better. Potentially worth a look if you want to keep up this kind of energy.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Lizrd_demon",
            "body": "This is a 3 part series which unites the fractured fronts of contemporary anarchism, into a unified whole, which, when viewed in full, shows a possible future where we escape the machine.\n\n>*The anarchist conception must be synthetic: it must seek to become the great living synthesis of the different elements of life, established by scientific analysis and rendered fruitful by the synthesis of our ideas, our aspirations and the bits of truth that we have succeeded in discovering; it must do it if it wishes to be that precursor of truth, that true and undistorted factor, not bankrupting of human liberation and progress, which the dozens of sullen, narrow and fossilized ‘isms’ obviously cannot become.*\n\n\\- Voline\n\nI have shifted from a true pessimist in a world of decay, to a hopeful optimist for a liberated future.\n\nI am no longer a insurrectionist fighting into the night as I succumb to the machine, but someone with hope. With motivation to help my community.\n\nFight, grow, love, resist, and perpetuate to the whole world.\n\nAs the Zapatistas say in their letter \"[A Zapatista Response to “The EZLN Is NOT Anarchist](https://theanarchistlibrary.org/library/ejercito-zapatista-de-liberacion-nacional-a-zapatista-response-to-the-ezln-is-not-anarchist)\":\n\n>Colonialism is one of the many enemies we are fighting in this world and so long as North Americans reinforce colonial thought patterns in their “revolutionary” struggles, they will never be on the side of any anti-colonial struggle anywhere. We in the Zapatista struggle have never asked anyone for unflinching, uncritical support. What we have asked the world to do is respect the historical context we are in and think about the actions we do to pull ourselves from under the boots of oppression. **At the same time, you should be looking at your own struggles in your own country and seeing the commonalties we have between us. This is the only way we have to make a global Revolution.**\n\n>...\n\n>Of course, the social struggles of exploited and oppressed people cannot be expected to conform to some abstract anarchist ideal. These struggles arise in particular situations, sparked by specific events.\n\n>**The question of revolutionary solidarity in these struggles is, therefore, the question of how to intervene in a way that is fitting with one’s aims, in a way that moves one’s revolutionary anarchist project forward.** But in order to do this, one must have clear aims and a clear concept of one’s project.\n\n>In other words, one must be pursuing one’s own daily struggle against the present reality with lucidity and determination. **Uncritical support of any of the struggles described above is indicative of a lack of clarity about what an anarchist revolutionary project might be, and such support is most certainly not revolutionary solidarity.**\n\n>Each of our struggles springs from our own lives and our own experiences of domination and exploitation. **When we go into these battles with full awareness of the nature of the state and capital, of the institutions by which this civilization controls our existence, it becomes obvious that only certain methods and practices can lead toward the end we desire**.\n\n>With this knowledge, **we can clarify our own projects and make our awareness of the struggles around the world into a tool for honing our own struggle against the present social order. Revolutionary solidarity is precisely fighting against the totality of an existence based on exploitation, domination and alienation wherever one finds oneself.**\n\n>**In this light, revolutionary solidarity needs to take up the weapon of unflinching, merciless critique of all reformist, nationalist, hierarchical, authoritarian, democratic or class collaborationist tendencies that could undermine the autonomy and self-activity of those in struggle and channel the struggle into negotiation and compromise with the present order.**\n\n>This critique must be based in a lucid conception of the world we must destroy and the means necessary to accomplish this destruction.\n\nThe Zapatistas present an alternate paradigm of revolution, and a deconstruction of anarchism. Rendering it into its purest, most universal form. Where the decolonial process is indistinguishable from the anarchic project - as the liberation of all people and peoples from the machine. Into a liberated future on all fronts.\n\nThis is what anarchism must become.",
            "score": 22,
            "replies": [
                {
                    "author": "NoGoodAtIncognito",
                    "body": "I believe he is working on a part 4",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "commitme",
            "body": "I just found his channel recently as well and the videos are great. He'd be very happy to see this post",
            "score": 6,
            "replies": []
        },
        {
            "author": "Foronerd",
            "body": "Someone else may have mentioned this, but Anark has a video (and pdf version) essay literally titled Hope that might be helpful to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DreamDue7801",
            "body": "Maybe if they weren't such a bully and a douche to neuro divergent people (and also, opposed to any individual change and veganism)",
            "score": 1,
            "replies": [
                {
                    "author": "MysticalPotatoTE",
                    "body": "How is he a bully or anti neurodivergent? I'm pretty sure Daniel is neurodivergent (which of course doesn't preclude him from spreading bigoted ideas despite being part of the ND community himself but I haven't heard him say anything that degrades ND people)\n\nAs far as individual change and veganism, Daniel says that he agrees with veganism as a philosophy but thinks that individual veganism is ineffective (which for the record I think is a bad take, I am a vegan anarchist and I was disappointed to hear him say this)\n\nBut I am curious about the first half of your comment?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DreamDue7801",
                            "body": "I don't fucking know it's all over twitter. Some shit about discord.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Lizrd_demon",
                                    "body": "NGL this is the exact type of discourse that is undermining liberation. It's exactly why I have almost entirely abandoned the western left as \"unrecoverable\" and why I look to indigenous and de-colonial action abroad, rather than festering in the individulist moral rot of the modern western left.\n\nOh I didn't mean to step on your pure feet and disturb your pure white cleanliness, I'm just a lowly poor from appalachia that never could begin to understand your enlightened morality.\n\nThis form of moral purity is just the phenomenology of liberalism taken to it's extreme. It's not leftism and it never will be.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "author": "OwlingBishop",
                    "body": ">He is an advocate of RULES. And rules, once enacted, mean that breaking them equals excommunication - removal of the individual and punishment.\n\nAnarchy is order, a __relationship__ , a __society model__ where rules are __adhered__ to and most importantly __collectively elaborated__ in a context where no one has authority over anyone, not devised by a few and enforced on \"the masses\".\n\nAnarchy is about forming community/commons. \n\nIf you don't like some rule you challenge it by offering a better alternative that __might be adopted__ in substitution, it takes work to advocate for change. If you choose to stay in the community you abide the rules, if you can't willingly abide for any reason, you're __free to leave__ the community and no one will judge you. \n\nIf you simply can't adhere to rules willingly (because you understand that they have a just purpose and are not in conflict with who you are) .. then you definitely are what you are : a lazy house cat pretending to be independent.\n\nIf you can't live with others and accept a set of rules there's no point in calling yourself an anarchist, just go off the grid, live alone like an hermite, or be like most far right libertarians refusing any rules while profiteering on society : just a predator or a parasite.\n\nAnarchy is not about being nice to predators or parasites, if you want to eat your cake and have it too at the expenses of others you will be removed.\n\nThat's that simple.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "OwlingBishop",
                    "body": ">Just as God stands alone, so does a true anarchist. \n\nYou definitely are a lunatic 🥹",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "OwlingBishop",
                                    "body": "So, let me understand,\n\n_You_ know what a _true_ anarchist is, contrary to anyone in this sub, and it is a person that stands _alone_ like GOD and doesn't abide to _any rule_, and everyone else is a [counterfeit anarchist](https://www.reddit.com/r/Anarchism/s/y9U0qbXJUc) for thinking otherwise while not being in prison, am I correct ?\n\nBut _you_'re not the one that tries to enforce their bogus opinions on others, and negating their thoughts and knowledge while being so fucking wrong, am I right ?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lizrd_demon",
                    "body": "I think you misunderstand his fundamental argument. Have you seen part 2? He lays out how egoisim is in line with social anarchisim, in so far as it is a union of egoists.\n\nThis is not a blind effort of hope, but a uniting of all the the histories of anarchisim into one unified tapestry of revolutionary analysis.\n\nI don't think you understand what a system is either. A system is that of a \"complex system\", not a regulatory system. The goal of systems anarchism, is thus to create a system which self-perpetuates, such that a complex higher orders emerge and perpetuate themselves, such that the entire world social ecology is transformed from the bottom level, and complex and layered patterns emerge out of the chaos, just as you yourself emerge out of the chaos of biological systems.\n\nSystems theory is the study of chaos, and the unconquerable and transcendent patterns that form within that chaos.\n\nSystems anarchy presents a potential world where the complex patterns of the world fully embrace, and emerge out of the unique and its own - such that whatever order and higher order emerges, is transcendent, emergent, and organic, just as people themselves are.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Lizrd_demon",
                                    "body": "That is a very surface level critique then, purely the aesthetics of the first overview. I highly recommend you look at part 2 where he discusses egoisim.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Call it whatever you want. I don’t care.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Lizrd_demon",
                                                    "body": "I care about how to maximize the freedom and liberation of the unique and it's own. And if you do not care about this, then you should question if you really have your own freedom in mind. Or if your views are purely reactionary.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lizrd_demon",
                                                                    "body": "It's not my job to get you to read the theory, or understand what I'm saying, but you don't have a critique without doing so. No critique can be based on Aesthetics alone.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HK_1030",
                                                                            "body": "(you are offering an invitation to thoughtful dialogue to someone engaged in monologue)",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "commitme",
                                                                                    "body": "From someone who claims to be vehemently against negation, y'all ",
                                                                                    "score": 5,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Lizrd_demon",
                                    "body": "There are no rules in systems analysis. Only chaos and emergence.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Showy_Boneyard",
                                                    "body": "Chaos, at least mathematically, is very different from randomness. That's a major point of chaos theory, that things that may appear to be disordered can actually have an underlying order.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Lizrd_demon",
                                                    "body": "Then I guess nature is not chaotic, for it is nothing but emergent patterns. \n\nI guess Human individuals acting to their own will are also not chaotic, for they too follow complex emergent patterns. \n\nThe only think that is chaotic must be raw entropy, but even that is at least comprehensible and understandable.  \n\nSo where is this chaos you speak of? Cause I certainly can't find it.\n\nI'mma be real, it itself sounds like a phantasm in just the same way any other abstract to be worshiped is. Only this is a reactionary phantasm to previous socially acceptable phantasms.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Time-Young-8990",
                    "body": "Without rules, what are you going to do about people who commit assault, rape or murder? There needs to be social prohibitions against these things and consequences for breaking them, aka rules.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}