{
    "title": "self defense/being physically fit",
    "author": "frog_shiz",
    "subreddit": "Anarchism",
    "rank": 470,
    "score": 35,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Anarchism/comments/1i9dcub/self_defensebeing_physically_fit/",
    "id": "1i9dcub",
    "selftext": "i already lift weights and am fairly active, i could do more cardio but im in pretty good shape. \n\nhowever if i were to ever get into a fight i’d probably be fucked. \n\ni think about that quote saying, “a fascist worked out today, did you?” a lot but in what way is best. in regards to being confident in my ability to fend for myself and others as much as possible. \n\nalso i am not in a position to be armed, even though i know punching someone with a gun isnt gonna do shit. \n\nso what should be my priority? and if upu have any resources (videos,podcasts, articles, etc) id appreciate it if you shared it. ",
    "comments": [
        {
            "author": "comix_corp",
            "body": "In my opinion you should think more about what you're aiming to do – if your aim is anti-fascism then combat training is only useful up to a point. I have a friend who got super into this sort of thing and then when he finally got his chance, he was in a scrum of dozens of cops, anti fascists and fascists, and all he managed to do was bonk one of the Nazis on the head with a traffic cone.\n\nBy all means learn martial arts – it's a good thing to do irrespective of political reasons – but ultimately what makes this sort of anti fascism successful is numbers and preparation, not individual fighting skills. Things like the Battle of Cable Street were successful because the anti fascists out mobilized the fascists, not because anti fascists were exceptionally talented fighters.",
            "score": 24,
            "replies": []
        },
        {
            "author": "oricthedamned",
            "body": "Being able to run is some of the best self defense there is",
            "score": 17,
            "replies": []
        },
        {
            "author": "petgame-enjoyer",
            "body": "its always good to get in shape. not discouraging that at all. but no amount of muscle can stop bullets and tear gas. get good at running. and wear a mask 😷",
            "score": 14,
            "replies": []
        },
        {
            "author": "Jordanisnothing",
            "body": "Only way is by doing it. Would sign up to a gym that offers either MMA, BJJ, Muay Thai/Kickboxing or boxing.\n- I think an able bodied person with 3 months- 1 year of BJJ experience is able to beat the vast majority of other people (Of the same gender & similar strength level) in a fight. Simply because most people don’t know anything about grappling\n- Muay Thai or Boxing will definitely help you feel more confident in a fight. Most people’s biggest fear is getting punched, so exposure to that goes a long way\n- I recommend going to an mma gym & getting exposed to both some striking & grappling; within a year of training a couple times a week you should feel much more confident in defending yourself \n\nSource: Pro fighter & coach",
            "score": 15,
            "replies": [
                {
                    "author": "frog_shiz",
                    "body": "do you think i could get close to the same benefit doing an online course or with youtube videos? i know it lacks the whole having a person to actually work with but im not a big fan of the people in my area.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Jordanisnothing",
                            "body": "Not even close to comparable, sadly. \nIt’s hard to simulate having a person in front of you. But if you are trying to find an online option, check out FIGHTtips . I’m also down to send you some quick instructionals / check out your form via video if you want",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "frog_shiz",
                                    "body": "im in the midst of getting a car so my transportation options are limited but im going to check out fighttips and i may get back to you on that offer. i appreciate it",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThereIsRiotInMyPants",
                    "body": "what does gender have to do with your biology and ability to fight?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Subversing",
            "body": "Fitness is just a component. Develop a skill that will make you useful. It's pretty straightforward.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Wizard_john10",
            "body": "I’ve been taking mixed martial arts since the first grade. I’ve also taken 4 different classes on firearms use. I do own guns, and maybe I should give them up, but I think I’m gonna hold on to them for another 4 years.",
            "score": 5,
            "replies": [
                {
                    "author": "Wizard_john10",
                    "body": "Also, if you want to stay sober, root beer is flammable :)",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Upset_Inspection1951",
            "body": "I recommend you doing MMA or Brazilian jiu jitsu, but if you don't want to spend a lot of the time touching sweaty guys, you can do Muay Thai, also a great option for self defence.\nIdk what country you are from, probably US, so if you want to be safe, I recommend you getting a gun. \nIf you're not from the US, you can get a BB gun, they're legal and they hurt but without serious damages. Also you can get any self defence shit, like taser or pepper spray",
            "score": 4,
            "replies": [
                {
                    "author": "According_Site_397",
                    "body": "It does depend where you live, but I would not agree with the last part of that.  If you're lucky enough to live in a place where people generally don't have guns then don't start running around with a BB gun.  The cops will think it's real and shoot you.  The minimal self defence benefit is not worth it.  If you live in a place where tasers and pepper spray are illegal then don't get them.  The legal consequences of being caught with them is not worth the minimal self defence benefit.  The first sentence is good advice.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Upset_Inspection1951",
                            "body": "I also agree with the last part about legal and illegal self defence gadgets. Also you're not going to point or even show a BB gun to an officer, also you can see to the naked eye they don't look a lot like real guns. I have some and, without using them for self defence, I like to play gun fights with a friend, they hurt a lot, but without damage in the long-term, but they are easy to recharge and shoot",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "According_Site_397",
                                    "body": "Fair enough, I have no issue with people doing airsoft for fun.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Upset_Inspection1951",
                                            "body": "The only safety measures we have are sunglasses and long sleeves ahahah",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Caterpillerneepnops",
            "body": "Not a helpful comment. But I had the same realization and started doing a boxers regimen. I have horrible stamina and never really focused on cardio. About a decade ago I used to spar and honestly fighting is so immediately physically exhausting I knew my biggest gain would come from focusing on resistance training and running. When I did self defense I knew I could “fight dirty” if it meant my life but the energy to keep swinging is so valuable",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Learn to throw a correct punch and take one. Most people go to their first fight at a disadvantage because they are fearful of what it feels like as they don’t know what to expect so they arnt thinking of being on offense but more defensive to tend to the unknown.   Everything. Heals.   honestly if you never punched in the face it’ll humble  you.     You’ll understand what I mean once you take a few.   You’ll see how some people act and think to yourself “ yeah they never been punched in the face before because they carry an arrogance.   Not to say that cures pipe of being an asshole but it’ll  make sense down the road what this means.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 5,
            "replies": []
        },
        {
            "author": "LizardCleric",
            "body": "Stamina, situational awareness, small group tactics, and disarming/escape techniques. Learn to use pepper spray (and when). I hold the belief that anything resembling a full-on fight isn’t worth it. Keeping your cool if you get hit and repositioning to safety will be more important in the long term. Chances are if you’re not with a bunch of people defending each other, you’re better off running anyway.",
            "score": 2,
            "replies": []
        },
        {
            "author": "UndoneCrystal",
            "body": "Related to op's question, Is it too late to start learning at 14? I have no idea where to start and how to even do it but with everything the way it is I feel like I need to have defense.",
            "score": 2,
            "replies": [
                {
                    "author": "frog_shiz",
                    "body": "never too late. do cardio, lift weights, take a boxing or mma class if you can. as of now i only do the first two but just getting good at running helps. i also think having muscle makes people less likely to target you, it at least makes me feel safer. \n\ndepending on the amount of equipment you have access to look up workout routines. if you don’t have access to anything i like burpees, pushups by themselves, crunches, russian twists, and squats. you can use a variety of things as weights like a backpack for rows, bicep curls, and lateral raises. im probably missing something but this is a good starting point if you have zero equipment. and find some sort of cardio you tolerate",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}