{
    "title": "Deradicalizing a Friend",
    "author": "Hydr0g3n_I0dide",
    "subreddit": "Anarchism",
    "rank": 454,
    "score": 47,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/r/Anarchism/comments/1i9ymzu/deradicalizing_a_friend/",
    "id": "1i9ymzu",
    "selftext": "So I have a coworker/friend I'm looking to deradicalize. Due to the nature of our work relationship, I'd rather avoid punching/shaming/disassociating with him since he'd likely be unaffected and/or confirm his 4chan views. He's recently shared with me some views of his that are antisemitic and some that are ethnonationalist or at the very least ethnonationalist adjacent.\n\nThese are some resources I'm using to prep in approach. If any one has any video essays or research to help prep material wise, it'd be greatly appreciated.\n\nI'll post a list of videos which I'm using to prep my approach in the comments. Analysis/critique of my sources would be appreciated but not my main request.\n\nEdit: Further clarification - He's esposed \n1. Conspiracy theories about Jews controlling media, politics, and \"Global Finance\"\n2. Fence sitting about \"13% of the population, 50% of the crimes\"\n3. Free speech absolutism (and explicitly defending hate speech)\n4. Articulated that Japan is betfer than the US because of cultural homogeneity\n\nHe's a frequent user of 4Chan and so I suspect he's got more beliefs adjacent to ethnonationalism, antisemitism, capitalism, and more. Real Alt-Right type stuff. I'm not really very deep in the debunking of these subjects as I listen more to MLs, demsocs, ancoms, libsocs talk about case studies of economic theory than specifically debunking ethnonationalist and anti-semitic views.",
    "comments": [
        {
            "author": "ShroedingersCatgirl",
            "body": "Radicalization always takes place within a community, and teaches people to separate themselves from their own humanity in the interest of becoming a political symbol.\n\nSo deradicalization must also be done within a community, and must start and end with treating someone like a human being, instead of the political symbol that radicalization encourages them to be. \n\nBasically, you can't do this on your own, and bringing up politics is only going to cement their beliefs even further.",
            "score": 73,
            "replies": [
                {
                    "author": "Lizrd_demon",
                    "body": "Its exactly the failure of the modern left as a movement based on a moral competition of aesthetics.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Excittone",
                            "body": "This is so true lol\n\n\nThere is a right-wing YouTuber who I enjoy watching who made a whole video about how aesthetics beat argument, or if want to get more technical how romanticism beats rationalism",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Excittone",
                    "body": "I don't agree with this tbh\n\n\nDue to my circumstances and witnessing my surroundings, I radicalized and deradicalized myself from the alt-right towards the left\n\n\nThis process was initiated by myself and only myself and my current views would put me at odds with my community ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Javisel101",
            "body": "I've deradicalized people by just being friendly with them and challenging their views without making it an attack. Figure out what the underlying emotional investment in a view is and work that out. Most right wing views stem from fear, for example.",
            "score": 39,
            "replies": [
                {
                    "author": "Acrobatic_Art404",
                    "body": "This is really similar to something I saw by a guy who was in the moonies, got out, and works on helping people leave cults. \n\nBasically he suggested caring about the person, asking them questions, helping encourage them to think for themselves instead of repeating their group think. The guy's name is Steven Hassan if you want to learn more about what he suggests.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FrontRow4TheShitShow",
            "body": "Food for thought, and this may be an unpopular opinion on here...but just my ten cents that other commenters are giving what IMO is fairly reasonable advice, but whatever you do with it, however you proceed, for what it's worth I would tread very, very carefully. You can be friendly with coworkers, but coworkers are not your friends. And depending on where you are in the world, now more than ever. The r / antiwork sub has lots of good information on this.\n\nAs an aside, I'm not sure why you even consider yourself friends with someone whose values and treatment of others misalign so starkly with your own?",
            "score": 17,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hi, u/Hydr0g3n_I0dide. Just a friendly reminder that phrases like \"terminally online\" and \"touch grass\" are ableist and help to perpetuate the harmful idea that one's value and contribution to anarchism and anarchist praxis is centered solely on \"meatspace\" interactions. We recognize that in-person organizing is important, and we encourage it, but our disabled comrades are valuable, as are their contributions regardless of their ability to go outside.\n\nWe highly recommend [this video](https://youtube.com/watch?v=iGFSJ3gv1kY) ([watch on Invidious](https://redirect.invidious.io/watch?v=iGFSJ3gv1kY)) for further explanation. \n\nThis may also be a great time for you to take a moment to review our [Anti-Oppression Policy](https://reddit.com/r/anarchism/wiki/aop) to see how and why we try create and maintain a safe space for marginalized people to hang out without seeing mirrors of their oppression and language used to degrade them based on their marginalized identities.\n\nThank you for your understanding and cooperation!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LeenMachine3371",
            "body": "In my experience it can happen but it’s a long project.\n\nIt involves being in their life consistently, usually and most helpfully as a member of one of the groups they disparage. Having other friends they like helps, getting them away from whoever radicalized them or whatever connections to the far right world helps too. My experience was best served not engaging with them unless they came to me with honest, good faith questions about who I am and what I believed. I would answer their questions and explain my thought process. Otherwise I would often entertain their statements as if it were a bad joke. The goal of when they sprout their inane garbage is to offend you. Make clear how ignorant they sound and you steal the power away from those beliefs. Sometimes this process involved light ribbing, other times (usually when someone was directly hurt by what they said) this process involved direct confrontations.\n\nNone of this works unless you’re someone they respect and like.\n\nIt could be months, it could be years, and no one is and should be under the obligation to do it. I think it’s remarkably good for someone to want to deradicalize someone. It’s a lot of work and putting up with bullshit in the meantime.",
            "score": 12,
            "replies": [
                {
                    "author": "PM-me-in-100-years",
                    "body": "This and u/ShroedingersCatgirl 's reply are basically the answer. \n\n\nI'll just add that your intentions don't need to be secret. You can be open about what you disagree with and what actions you're willing to take to resolve those disagreements.\n\n\n\"From what I can tell, you're being radicalized by right wing internet forums. I'm willing to try to talk you out of some of those ideas, and talk you out of spending time in those spaces. If that doesn't work, I'm going to talk to everyone that we both know about you, and see what other people want to do about it with me. I like you as a person, and I'd like to be friends with you and work with you, but friends don't let friends become Neonazis.\"",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LeenMachine3371",
                            "body": "I personally wouldn’t outright say you’re attempting to deradicalize them from the outset. Proscriptions like “I can see you’ve been radicalized by Internet forums” will just make them dig in their heels and get more stubborn. \n\nThat being said, I wouldn’t say keep the intentions secret, just don’t treat every conversation like a moment to deradicalize. Things like that happen bit by bit as you help them deconstruct their ignorant biases.\n\nSaying stuff like the end of your comment is something I’d more say towards the end of their process while they’re open to accepting new things, by the time they functionally aren’t Neo-Nazis anymore imo",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "PM-me-in-100-years",
                                    "body": "Yeah, it's very contextual. I'm basically describing one extreme of transparency, but the best approach is completely contingent on the relationship of the two people.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LostInIndigo",
                            "body": "Seconding u/leenmachine3371 -\n\nGotta say I definitely wouldn’t tell someone you’re turning them into a project-not only is that mad disrespectful (who appointed you to fix me? who says *you* don’t need fixing instead?) etc but also just encourages pointless political arguments where they’re not going to show up as themselves. \n\nDefinitely don’t call them a fuckin Neo Nazi to their face lol\n\nCan’t really think of a situation where condescending to somebody about their beliefs and how you’re willing to do the *heavy lift* to take time out of your very important life to fix them is going to go over well. I know that’s not how it’s intended, but I promise you that’s how it’s going to look from their end - like, reread what you said and replace “NeoNazi” with “brainwashed woket@rd” or something. See what I mean?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "PM-me-in-100-years",
                                    "body": "Just saying that it's contextual and it depends who you are as much as who they are.\n\n\nHow much time are you going to dedicate to building a relationship with this person? \n\n\nIf the answer is \"not a huge amount\", then for me that points towards being more honest. At least be the one person that they can think back to that was extremely explicit about what they were doing wrong, and the one person that offered to help, if they ever find their way out of the alt right over time.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LostInIndigo",
            "body": "Seeing some ok answers in here, but I don’t see a ton of functional advice, and I want to point something out that I think didn’t get touched on:\n\nIt is good to want to deradicalize people, but I think it’s important to not let that mission take priority over protecting people around that person. You want to be very intentional about how you spend time with this person and how you show up when it comes to holding them accountable for things they say around other people.\n\nThat “holding them accountable” piece is important-you can’t let stuff slide just because you are trying to maintain a friendship with them to “deradicalize them” because that just becomes a situation where you get to have an easy relationship with them while you are enabling them running around, saying fucked up shit to/about other people. “Treating people like a human being” does not mean “let them say and do whatever they want”\n\n(I also know a few too many folks whose entire social circle is “people they are trying to deradicalize” and instead it becomes them just wanting to hang out with folks they feel morally superior to, where nobody calls them on their own shitty beliefs…but then they call it activism)\n\nThe secret is definitely avoiding arguing about their political beliefs directly (they want that), and making it more about how they show up in the day to day. I’ve had success being blunt with people-ie “You should probably be careful saying that out loud, because if you hurt people’s feelings, it’s going to cause a bunch of drama”. The intent vs impact convo is helpful too-“I know you’re not talking about this person individually or intending to hurt their feelings, but it’s going to hurt their feelings when you say something like that regardless”.\n\nYou want to maintain the type of relationship with this person where you can have good boundaries with them and hold them accountable, but you don’t spend a lot of time arguing about political stuff. That doesn’t mean never disagree, but it means disagreeing in ways that focus on the goal-getting them to be socially normal/functional enough to bring out in public.\n\nI say this as someone who helped deradicalize a good handful of people, and one of my best (and most radical) lefty friends is someone I met when they were in college prepping to be a cop.\n\nAt first, it’s going to take a lot of one on one time to figure out the core problems behind their beliefs and check some of the more fucked up stuff that comes out of their mouth. I recommend finding ways to do this in less public spaces. You want to be careful to not just make this about allowing them to become codependent on you or building some kind of unhealthy relationship that’s about performing how well you get along despite your differing beliefs. Be empathetic but don’t turn this into a savior complex-they’re a person, not a project for your ego.\n\nAs you spend time with them, you will naturally figure out what the root issues are that are leading to them feeling the need to be combative and contrarian, and you can start working on that from an emotional standpoint with them as well as just encouraging them to develop interests and hobbies outside of performing being a contrarian asshole.\n\nIf you can get people to stop constantly spewing combative bullshit, and start being able to show up in social situations normally, that’s the first step. And then you can start taking them into spaces where they are exposed to more different types of people and ideas. Encourage hobbies and low-stakes social activities. From there, you’re out of the danger zone and it just takes a little bit of nurturing and good boundaries to avoid backsliding. \n\nThe last big thing to remember is that you can’t be so emotionally attached to successfully deradicalizing them that you are incapable of recognizing if/when you need to walk away/someone maybe isn’t capable of being pulled back.\n\nDoes that make sense? Sorry it’s a little messy-I just woke up.",
            "score": 10,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "This is very actionable advice, thank you very much.\n\n>holding them accountable for things they say around other people.\n\nMaybe my goal is misguided then? He hasn't talked about these beliefs outside of private conversations and is merely a kinda chill, sarcastic person when in public. \n\n>Be empathetic but don’t turn this into a savior complex-they’re a person, not a project for your ego.\n\nI'll try to keep this in mind. I know I might be susceptible to this at times.\n\n>From there, you’re out of the danger zone and it just takes a little bit of nurturing and good boundaries to avoid backsliding. \n\nI think he's already at this point. He has some awful beliefs inside but knows to keep them locked up in public. I want to engage (as opposed to cutting ties or ignoring it) because I think there's potential to sway him toward a more positive politics or at least away from the more conspiratorial views.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "LostInIndigo",
                            "body": "Ooooh ok he may actually be EARLIER in the cycle then - usually there’s a progression:\n\n1. Kinda normal/ignorant/privileged \n\n2. Starts being exposed to/absorbing harmful beliefs\n\n3. Starts repeating/believing kinda weird stuff, but quietly \n\n—>YOU ARE HERE<—-\n4. Into the wackier shit but still knows to keep it under wraps until around “like minded” / trusted people. People can stay here for a very long time, and it usually takes something happening to move them to the next phase. (ie a divorce, getting laid off, etc)\n\nUsually things progress from here towards isolation (self-imposed at first, then caused by their big mouths) and eventually more and more extreme beliefs til they hit a sort of critical mass where they become constantly openly combative/insufferable and hit a “rock bottom”\n\nWhat is his social circle like? Does he have a gf, roommates, etc? Definitely encouraging social hobbies that can instill pride/confidence based on him/his talents as an individual while interacting with diverse groups of people is a good way to go at this point. \n\nI know that bit about him as an individual sounds counterintuitive but we’re trying to get him out of needing to identify as part of an aggrieved class-to be proud of himself and his personal qualities as opposed to his identity being based in this narrative about where he exists in society.\n\nYou want to keep him surrounded by healthy social context so it’s harder for him to feel validated in his extreme beliefs, and help him build out a community/support network so that he can’t get sucked into the isolation/victim complex spiral.\n\nAlso you’re welcome to DM if thats easier-this stuff can get pretty tricky and subtle and be very individualized and I don’t wanna make you just be posting walls of text on the thread lol",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "marxistghostboi",
            "body": "honestly I'd stay away. if he knows he can spout such racist stuff and even an anarchist will go along being friends with him and debating him, them he gets everything he wants \n\n\nit's really hard though. i have a friend who I thought had the same values as me but I learned a few months ago he's a Zionist and despite everything I've said he just says that he's 'uncomfortable diluting the word genocide by calling the Palestinian genocide a genocide' and says we just don't know enough yet to decide. that's not the kind of person I want to surround myself with.",
            "score": 18,
            "replies": []
        },
        {
            "author": "KaiserWillysLeftArm",
            "body": "Not to distract from the other great suggestions here, but if you are already close enough with them to let them be honest and maybe even vulnerable about their controversial opinions, then use that to determine where the \"truth\" of their feelings lie and work from there.\n\nIf, for example, their anti-semetic fear of media elites and their free speech absolutism stem from genuine, albeit misdirected, feelings of the real repression and manipulation through the power of state and capital, use that to validate legitimate portions of their concerns and then provide the resources to rebut and debunk the hateful misdirection. The motivations which drive people away from the status quo are not usually deeply ingrained prejudice; rather, right-wing communities radicalize new members by providing hateful explanations for legitimate issues they observe or experience within society.\n\nIf the core of their ideology is truly hate, and these expressions are just outgrowths, then this method would likely fail.",
            "score": 4,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "This is what I suspect is the case for him. This sounds very similar to the advice in the the that dang dad video. I think redirecting the emotional source of his views towards the real sources of the repression he feels/sees in society is the most reasonable goal",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hydr0g3n_I0dide",
            "body": "[The Plague of People who are Half-Right](https://youtu.be/2XBakI4WZw4?si=1vUyQGfY35TXdYeu) - by that dang dad\n\n[The Alt-Right Playbook](https://youtube.com/playlist?list=PLJA_jUddXvY7v0VkYRbANnTnzkA_HMFtQ&si=7ExIJU6garN849WC) - Innuendo Studios\n\n[How to Fall Down the Anti-SJW Rabbit Hole](https://youtu.be/69obN625Fjs?si=BONd3wLTLlHdxK2R) - Three Arrows\n\n[How to Fail at Criticism](https://youtu.be/6z5Pv2WZrho?si=TohyqlTPL-LqN6jy) - Pillar of Garbage",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 4,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "I think I know which video you are referring to, thanks for the reminder :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "You have to build trust without him feeling like you’re just out to change his views. If you haven’t shared that youre an anarchist, then I’d avoid it as the term is so heavily misunderstood. You gently change his ideas under his radar he comes to trust your opinions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aggressive-Tale6363",
            "body": "don’t talk about your philosophy/politics *too often*, give him some space to breathe and express himself without judgment. that way he doesn’t form the impression that *you’re* the “radical,” an annoying person whose politics make up their whole personality\n\nyou want him to see that you’re a normal human being, not some brainwashed dummy",
            "score": 2,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "But my politics are my whole personality 😔\n\n/j",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Hi, u/Aggressive-Tale6363. Just a friendly reminder that phrases like \"terminally online\" and \"touch grass\" are ableist and help to perpetuate the harmful idea that one's value and contribution to anarchism and anarchist praxis is centered solely on \"meatspace\" interactions. We recognize that in-person organizing is important, and we encourage it, but our disabled comrades are valuable, as are their contributions regardless of their ability to go outside.\n\nWe highly recommend [this video](https://youtube.com/watch?v=iGFSJ3gv1kY) ([watch on Invidious](https://redirect.invidious.io/watch?v=iGFSJ3gv1kY)) for further explanation. \n\nThis may also be a great time for you to take a moment to review our [Anti-Oppression Policy](https://reddit.com/r/anarchism/wiki/aop) to see how and why we try create and maintain a safe space for marginalized people to hang out without seeing mirrors of their oppression and language used to degrade them based on their marginalized identities.\n\nThank you for your understanding and cooperation!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/LeenMachine3371 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/LeenMachine3371 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Scary_Painter_ - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Sinnz_ - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FinancialSubstance16",
            "body": "This video should offer some insight: [https://www.youtube.com/watch?v=xMabpBvtXr4&t](https://www.youtube.com/watch?v=xMabpBvtXr4&t)",
            "score": 1,
            "replies": []
        },
        {
            "author": "martin_girard",
            "body": "Get ready to lose friends because rational arguments have never deradicalised anybody.",
            "score": 1,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "I don't believe you. Education can radicalize and deradicalize very effectively. So too can conversations with educational attitude. I used to be a right libertarian until ironically my conservative/liberal dad rationally discussed with me how free markets can't self regulate on safety standards without killing many people in the process.\n\nAside: ironic since I'm now left libertarian or anarchist these days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scary_Painter_",
            "body": "Free speech is good though. I don't want to live in a society where people are unable to express their ideas. One thing 4chan is faaar superior to reddit in is its commitment to free speech (apart from the cringe memeword filters)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Remote-Remote-3848",
            "body": "Hard nut to crack.  Maybe its driven by anxiety. He finds comfort in knowing someone(the Jews) has control. Maybe you could tell him that.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Master-Fig1",
            "body": "Just reassure him that 20% of Hollywood movies are not directed by jewish directors. And 30% of music labels aren't owned by jewish people. At least 5% of banks also aren't run by jewish people!",
            "score": -1,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "Bot or Fed ^^^ ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Master-Fig1",
                            "body": "If you find info troubling, must it always come from a bot or a fed? Is you coworker a bot or a fed?\n\nAt something like 2% of the US population, jewish people being 30% of billionaires is really quite astounding. Up to 70% of studio heads in Hollywood too. Maybe also check how many current world leaders are jewish or are married to someone jewish. The odds of this happening for a demographic that is 0.2% of world population is astronomicaly low and cannot be accounted for by them supposedly having a couple of extra IQ points. \n\nThese are statistocally significant outcomes. Why do you think this has happened, then? Why does every western nation fund israel? Is there perhaps a conspiracy afoot?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Hydr0g3n_I0dide",
                                    "body": "Its not the info, its the conspiratorial thinking plus being like 1 day old and deleted from r\\uk",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Master-Fig1",
                                            "body": "If I am a bot or a fed what do you think my agenda is",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SilentPrancer",
            "body": "Im curious what your intention is? \n\nAs an anarchist, I like to respect everyone’s right to be who they want and believe what they want. I don’t want others using power over me to change me, and don’t like to do it to others. Hence the question.",
            "score": -3,
            "replies": [
                {
                    "author": "Hydr0g3n_I0dide",
                    "body": "1) Changing people's minds isn't exerting power over them.\n\n2) Multiple motivations:\n-if fewer people hold conspiratorial far right voews, the world would be safer\n-having conspiratorial right wing views damages individual's lives, relationships, and communities\n-I don't want rightoid friends. But because he's a human being I can talk to, I'd rather change his mind than burn bridges",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SilentPrancer",
                            "body": "I guess I see trying to change other people as coercive. The way I understand power is that you have to have power to influence someone, to change their mind. Your social capital, their trust in your or your competence, knowledge or perhaps expertise are examples of things that enable your ability to influence. \n\nAh. I see. You want them to believe what you believe. I get that motivation. I suspect they might say all the things you’ve said but reversed.  I don’t mean it as a criticism, but just to point out they may likely believe their desires in society are strategies to meet the same needs. For example you both want safety or security but the way you believe you get it is different.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}