{
    "title": "We Are More Than Cogs; We Are the Revolution",
    "author": "Advanced-Hat2338",
    "subreddit": "Anarchism",
    "rank": 444,
    "score": 40,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iax498/we_are_more_than_cogs_we_are_the_revolution/",
    "id": "1iax498",
    "selftext": "For too long, we’ve been fed a lie. A lie that we’re free, that this system works for us, that if we just work hard enough, we’ll achieve the dream. But look closer—the dream is a mirage, designed to keep us chasing while they reap the rewards. The few, those at the top, have declared themselves gods, ruling over us as though they own not just the wealth but the very air we breathe.\n\nThe truth is harsh, but it must be said: we are nothing more than cogs in their machine, spinning endlessly to make the rich richer, the powerful more powerful. But if we can’t live free, the system can’t stand.\n\nWe’ve been told that scarcity is the reason for our struggle. That there aren’t enough resources, so we must compete, fight, and claw for scraps. But that’s another lie. Think about this: there are over 333 million people in America alone—and the reality is, we have the resources to stop the constant churn of mass production, to live sustainably, and still thrive. There’s enough land, food, energy, and technology to create a society that ensures every single person’s survival and dignity.\n\nSo why don’t we? Because this system thrives on greed. Corporations would rather let food rot in warehouses than give it to the hungry. They’d rather pollute rivers and destroy forests than lose a dollar of profit. They’d rather exploit our personal data, manipulate us with marketing, and push endless consumerism than admit the truth: this isn’t about meeting our needs; it’s about feeding their power.\n\nThey sell us the illusion of choice while using psychological manipulation to control our desires. They’ve turned our lives into commodities, our data into currency, and our labor into fuel for their machine. The system wasn’t built to serve us—it was built to enslave us. But our unity, their downfall.\n\nHistory shows us the truth. From the Gilded Age of robber barons to the billionaires of today, the system has always been rigged. Corporations crush workers to cut costs. Politicians sell their souls to the highest bidder. Wars are waged to protect profits, not people. Many voices, one movement is their greatest fear.\n\nBut here’s the thing—they only win if we stay divided. They’ve spent decades pitting us against each other. Left vs. right. Rural vs. urban. Black vs. white. It’s a strategy straight out of Orwell’s 1984. They want us too distracted fighting one another to see the real enemy. Because they know the truth: we are more than cogs in their machine; we are the revolution.\n\nThink about the power we hold. Together, we outnumber them a thousand to one. Together, we are unstoppable. They control the wealth, the media, and the laws, but none of that matters if we refuse to comply. If we unite, resist, and rebuild, we can create a system that works for all of us, not just the privileged few. The time is now: unite, resist, rebuild.\n\nThis isn’t just about tearing down their machine. It’s about building something better. A future where no one is exploited for a paycheck, where no child goes hungry, where no voice is silenced because it challenges the status quo. It’s about reclaiming the dream they’ve stolen from us. Rise as one, reclaim the future.\n\nWe are done begging for scraps from their table. We’re done watching as they strip our communities of opportunity while lining their pockets. We’re done believing the lie that this is just the way things are. No gods, no masters—only freedom.\n\nThey want you to feel small. Powerless. But remember this: their power comes from us. Every hour we work. Every dollar we spend. Every time we stay silent. Fight the few, empower the many. If we withdraw that power, their system crumbles.\n\nWe stand at a crossroads. On one side is the broken system they want us to accept. On the other is a future we can build together. A future where we’re no longer cogs in their machine but the architects of our destiny. The choice is clear: their system, our power, one reckoning.\n\nI’ll leave you with the words of Thomas Jefferson: \"When injustice becomes law, resistance becomes duty.\"\n\nLet this be our duty. Let this be our spark. Let this be the moment we reclaim what is ours.\n\n",
    "comments": [
        {
            "author": "Brilliant-Rise-1525",
            "body": "AI Bot ? For what purpose? :/ Ill bite: So what new organizational technique are you promoting ?",
            "score": 5,
            "replies": [
                {
                    "author": "spinelionateli",
                    "body": "*waiting",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Brilliant-Rise-1525",
                            "body": "I wouldn't hold your breath . I'm not sure what this is about :/",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "spinelionateli",
                                    "body": "The revolution! I’m in the European side but the far right is catching up here too",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Brilliant-Rise-1525",
                                            "body": "Rise of fascism is taking off everywhere pushed by accelerationist tech bros :( This post was made by a bot .... possibly, well it looks like it is . I'm in UK. Its pretty fucked here to . \n\nI and nobody else have any strategy for an instant revolution . I don't think this poster/bot does either.\n... but you never know! Let's see if they reply :/",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AutoModerator",
                                                            "body": "Hi u/spinelionateli - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DiogenesD0g",
            "body": "The American Dream is dead. Stop watching the shows featuring the lifestyles of the rich and famous believing that could be you if you simply pay your dues. It is not how hard you work, it is who you know.  Don’t be a team-player. As soon as you get old or injured or accrue too much vacation time you will get benched. As the AI bot wrote, refuse to comply. Also steal something from work as often as you can, especially time because it will be compensation for when they put you out to pasture.",
            "score": 2,
            "replies": [
                {
                    "author": "Brilliant-Rise-1525",
                    "body": "Those shows are a very important peice of properganda . I've organized with peeps from Eastern Europe and from what they say it's integral to the colonial mind fuck over there.... combined with targeted properganda we've got our work cut out dispelling it. I think Chomsky goes into depth on this.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DiogenesD0g",
                            "body": "Does Chomsky mention this somewhere?  I would like to see what he has to say on it. Do you know where to find it?  We all need to boycott those shows—the Bachelor, Cribs, Desperate Housewives, Yellowstone, and others along those lines. Even the home-decorating shows give viewers unreasonable expectations.  (I am in for it whenever my wife watches one of those shows.) I liked watching shows like Below Decks, not for the crew romances or because I think someday I will go yachting, but to see how asinine and demanding the clients will act. But ever since getting rid of cable I haven’t seen it and can’t say I miss it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Brilliant-Rise-1525",
                                    "body": "He goes into it in a number of question and answer sessions and of course in the seminal Manufacturing Consent:\n\n\\>The mass media serve as a system for communicating messages and symbols to the general populace. It is their function to amuse, entertain, and inform, and to inculcate individuals with the values, beliefs, and codes of behavior that will integrate them into the institutional structures of the larger society. In a world of concentrated wealth and major conflicts of class interest, to fulfill this role requires systematic propaganda.\n\n\n\nA quick search brought up this Z Mag article which broadly covers it :\n\n[https://chomsky.info/199710\\_\\_/](https://chomsky.info/199710__/)\n\nAnd yes. those aspirational home programs are a bastard.... together with all the shite on tv where nobody has any real problems, works tough jobs and everybody lives in highly stylized pads that would cost millions.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "subrail",
            "body": "freedom from their claims of ownership over all our lives.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thick_Bandicoot_6728",
            "body": "nice screed. you still, however, won't do any outreach to conservatives i'm sure. most of you would gasp in horror at the thought of doing anything but preaching to the choir and then nitpicking each other. \n\nit's so easy to get conservative liberals suspicious of government to agree with our basic idea if you drop the rhetoric and talk to them about anarchism from a place of trying to actually understand each other. it works. \n\nas soon as you get the democrat party rhetoric bullshit out of your head and see them as simple proletarians who are being as fucked by the state as you are... well. not many leftists can do that these days, and that's why we'll keep losing ground.\n\nand don't try to sass me about how \"dangerous\" it is for you. It isn't. How do I know? Because I'm not a heterosexual white guy. your idpol bullshit won't work on me. I've lived it harder than most, and I know what the boot actually fucking looks like. I think the problem a lot of you have is that you just don't actually talk to people who are different from you. I do. I go out of my way to. I think it's a good thing.\n\nbut yeah. anyway, please, continue begging for a revolution from people who think an expectation of effort is oppressive",
            "score": 0,
            "replies": []
        }
    ]
}