{
    "title": "Uhhh",
    "author": "No_Silver_8933",
    "subreddit": "Anarchism",
    "rank": 367,
    "score": 119,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/Anarchism/comments/1if3qgn/uhhh/",
    "id": "1if3qgn",
    "selftext": "Uhhh shouldn’t we be out there marching and fighting for what’s right, like right now? \n\nWhy we all just on our phones watching it all burn",
    "comments": [
        {
            "author": "comic_moving-36",
            "body": "The work that needs to be done is mostly slow and quiet.\n\n\nMarching in circles in the major cities rarely changes anything. Fighting requires organizing and preparation. \n\n\nI recommend picking one thing you are really passionate about, let's say stopping deportations. Set a certain amount of time per week to work on it. Let's say 6 hours, so 3 days a week you spend 2 hours learning as much as possible. The history of the boarder, which airports are used for flights, how I've tactics have evolved, what groups have been doing good support work, etc.\n\n\nLink up with other like minded people. Join a rapid response phone tree. Actually dig into the complicated world of organizing. We're not all just on our phones, but until it needs to be seen it won't be and that keeps us safe.\n\n\nSome resources that MIGHT be helpful. May seem kinda random, but all useful in different ways.\n\n\n\nhttps://www.sproutdistro.com/catalog/zines/organizing/\n\n\nhttps://rebelsteps.com/\n\n\nhttps://workersdefensealliance.org/resources/salute-alerta-mnemonics-actionable-information\n\n\nhttps://uprisingsupport.org/further-resources/\n\n\nhttps://thefinalstrawradio.noblogs.org/\n\n\n\nhttps://www.reddit.com/r/AntifascistsofReddit/comments/1i87778/comment/m8vaajh/\n\n\n*Edit-* you can also go through my post history for a lot of other useful links, including to local/regional anarchist websites.",
            "score": 190,
            "replies": [
                {
                    "author": "hangnail-six-bucks",
                    "body": "This is such an important perspective ",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "comic_moving-36",
                    "body": "Also some examples of people fighting recently. I could go on and on.\n\n\n\nhttps://www.anarchistfederation.net/city-owned-bulldozer-burned-in-honor-of-cornelius-taylor-atlanta-ga/\n\n\nhttps://www.anarchistfederation.net/this-month-were-launching-the-anti-fascist-action-of-the-month-challenge-where-we-call-on-you-to/\n\n\nhttps://www.anarchistfederation.net/students-shut-down-pro-ice-neo-nazi-demonstration-on-asu-campus/\n\n\nhttps://www.anarchistfederation.net/a-setback-in-the-alex-stokes-case-appeal-denied/\n\n\nhttps://www.anarchistfederation.net/speed-cameras-sabotaged-washington-dc/\n\n\nhttps://www.anarchistfederation.net/protests-and-student-walkouts-against-ice-spread-across-the-us/",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "NomadicPolarBear",
                    "body": "This is literally the first actual advice I’ve seen on how to fight this. They only othe advice I’ve seen is people saying “get organized where you live” but nobody really knows what that means. Thanks for putting it in perspective",
                    "score": 12,
                    "replies": [
                        {
                            "author": "comic_moving-36",
                            "body": "Yeah, it's frustrating. I wish people would put a little bit more effort into their responses with an eye to being helpful. \n\n\nAlso, a lot of people on this subreddit seem to mostly be unaware that there is an actual anarchist movement. Anarchism isn't just people writing about stuff.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Living_Papaya_7793",
                    "body": "I'm taking agriculture and equal food access!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Castle_Crystals",
                    "body": "Fighting also requires fighting",
                    "score": 5,
                    "replies": [
                        {
                            "author": "comic_moving-36",
                            "body": "Definitely agree, but fighting without preparation almost always means losing. Sometimes that is what has to happen, but if it can be helped it should be avoided.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Castle_Crystals",
                                    "body": "So when do we start? I'm willing to lay my life on the line. We need more with that mindset. We need more action, direct action. The fascists are winning and no one seems to be doing a damn thing about it. They are just blatantly doing whatever tf they want because they know no one is going to do anything. What needs to happen is we need to flood the streets with millions of people and shut this country down. That's about the only thing I believe the oligarchs who control this country will respond to. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "comic_moving-36",
                                            "body": "The George Floyd Rebellion was less than 5 years ago. We need to be more organized. I appreciate the energy, but if people don't know what the local vulnerabilities are what are they going to attack?\n\n\nPeople are already starting if you saw some of the other links I shared. Some anarchists think working in small temporary groups based on affinity works well for targeted attacks. I assume to build the skills and capacity necessary for larger actions. That is not what I'm trying to do, but those people are quiet about it otherwise they go to prison.\n\n\nI personally focus more on social struggle and support for those who have taken action. I have found this website useful for that.\n\n\n\nhttps://uprisingsupport.org/further-resources/",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Castle_Crystals",
                                                    "body": "Well, I don't feel comfortable talking about this on the internet anymore. I barely use this horrid website these days. Hmu if u ever need direct action in FL. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AliTheFloof",
            "body": "Alright then, do something!\n\nSeriously, I see so many of these posts that do nothing but complain about doing nothing. GO ORGANIZE A PROTEST THEN! IDENTIFY NEEDS IN YOUR COMMUNITY AND FUCKING FILL THEM! GET OFF REDDIT AND DO SOMETHING!!",
            "score": 64,
            "replies": [
                {
                    "author": "AmarissaBhaneboar",
                    "body": ">IDENTIFY NEEDS IN YOUR COMMUNITY AND FUCKING FILL THEM!\n\n\n\nThis is such a fun and usually pretty easy way to get things done. In my area, we've now organized monthly clothing swaps to clothe people. There were always clothing swaps, but they were small and the word never really got out about them. But now, we've made them huge! :D I've already heard from several parents that it helped them get winter clothes for their children, several trans people that it helped them get gender affirming clothes, and houseless people that they were able to find winter gear! I love clothes, and fashion, and upcycling, and mending, and so this was the perfect thing to get involved with! Find something you love, are passionate about, enjoy doing and go out and do it. \n\n\nSome things to think about are clothing swaps, repair cafes, pull over prevention clinics, immigration help, covid safety help, food banks and soup kitchens, the list goes on!",
                    "score": 24,
                    "replies": [
                        {
                            "author": "AliTheFloof",
                            "body": "This is it! This is resistance! Thank you for leading by example! Let's fucking spread this attitude! 💜",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "AmarissaBhaneboar",
                                    "body": "It's so rewarding and fun! I get to meet cool people and we get to help our community! It takes a bit to build up too, so don't get discouraged anyone who's reading this. There will be tripping stones on the path, but keep persisting. Those who came before us and fought for our futures kept persisting. We can do it too!",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ThereIsRiotInMyPants",
                                            "body": "if mutual aid is considered liberal, maybe you were never an anarchist?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Mutual aid is great, I never said mutual aid is liberal. But mutual aid will do almost zilch to stop a fascist regime. It would help people during a fascist regime, and is important, but it won't help end the fascism.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ThereIsRiotInMyPants",
                                                            "body": "I agree, however fascism has always been the status quo in the USA. it's gonna take years of organizing to fight against a movement that's had a headstart",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Heard those American comrades are already organizing mutual aid and protest organizations. Privately. ",
            "score": 28,
            "replies": []
        },
        {
            "author": "jxtarr",
            "body": "Marching and protesting should be the culmination, and often a single superficial expression, of organized efforts, not the gateway.",
            "score": 21,
            "replies": []
        },
        {
            "author": "DirtyPenPalDoug",
            "body": "Organization  is happening. You don't blindly jump into fire",
            "score": 19,
            "replies": []
        },
        {
            "author": "fookofuhtool",
            "body": "Do you not know folks IRL? If not, I'd start there.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Matstele",
            "body": "Marching and protesting puts a target on your back and only works within a liberal democratic paradigm. We left that paradigm a month ago. \n\nTaking action will _always_ be necessary and important, but consider your means and ends; identify small problems and gather people to discuss and help solve those problems. That’s prefiguration. That’s praxis.",
            "score": 8,
            "replies": []
        },
        {
            "author": "axotrax",
            "body": "Marching?  You wanna get shot?  You can't march against fascism.  \n\n1.  Get on Signal  \n2. find local comrades  \n3.  plan local actions  \n4.  shhhhhhhhh and don't post about it on Reddit",
            "score": 23,
            "replies": [
                {
                    "author": "Thick_Bandicoot_6728",
                    "body": "1) expressing your impotent rage through violence will help no one except the feds\n\n2) mutual aid and agitprop are where we are right now, if you actually want to do something to help.\n\n3) fascism hasn't come yet, if it ever comes. this is still just the ugly face of liberalism. *if* it comes, both parties have an equal chance to birth it. it is, however, unlikely that we will see anything like euro fascism in the US. if anything, a totalitarianism that rises here will be a unique syncretic movement.",
                    "score": -13,
                    "replies": []
                }
            ]
        },
        {
            "author": "WildAutonomy",
            "body": "There are many crews out there taking autonomous actions. Just not much \"mass\" action yet",
            "score": 7,
            "replies": []
        },
        {
            "author": "eclipsingangel",
            "body": "I know it feels like we're just sitting on our hands right now, but we're not. A lot of people are actually putting in a lot of work right now, and it can all start with building community.\n\nGo see what you can do to be a part of your local volunteer work, see if you can donate your time to a foodbank, a shelter, soup kitchen, etc. Get into crafting, sewing, even just simply making the cut and tie blankets to donate to shelters is doing something for the people in need.",
            "score": 7,
            "replies": []
        },
        {
            "author": "holysirsalad",
            "body": "What, EXACTLY, do you plan to accomplish? Lobbying legislators? Getting public attention?\n\nRead this: https://www.whitehouse.gov/presidential-actions/2025/01/celebrating-americas-250th-birthday/\n\nThen read Executive Order 13933. \n\nIf you want to organize a protest (which absolutely do happen, they’re just poorly reported - hmm I wonder why?) think VERY FUCKING CAREFULLY about what that is going to look like, and how you can ensure that you will love to fight another day. \n\nEver heard the story of Anne Frank? That’s the sort of organizing that’s needed. ",
            "score": 10,
            "replies": []
        },
        {
            "author": "underground__ghoul",
            "body": "There's so many people on my local FB (fck meta, but there's a lot of people in my city who refuse to and it's the easiest way to organize for them) who are so aggressively against marching or physical protesting. \"Just post on social media, it'll gain 10k views in a minute\" except it does nothing to help the community and show the elected officials we mean business. \n\nIt's gotten to the point I truly believe they are plants meant to disrupt local communities the way they are fighting tooth and nail to discourage people from gathering.",
            "score": 10,
            "replies": []
        },
        {
            "author": "o6ijuan",
            "body": "I tried to organize but everyone was doing something. They didn't like it when I said let's meet for coffee in the concentration camp.\n\nI don't think people think it's as bad as it is yet because they don't feel the ramifications of Trump's doing yet.",
            "score": 4,
            "replies": []
        },
        {
            "author": "meowwmeow1",
            "body": "Not marching 😩😩😩",
            "score": 2,
            "replies": []
        },
        {
            "author": "Charming-Score7015",
            "body": "We need a bigger number of people to make the change.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unfounddoor6584",
            "body": "I think creating safe social spaces and networks is vital now.\n\nInstead of starting the revolution the play is focus on providing resources and help to the people most victimized by what's coming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PairPrestigious7452",
            "body": "Take a look in Mpls, they're already on the case. Also, remember DA is always an option. You don't need a big crowd for that, just tight lips. The theater of the deed is very much part of our history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoEpicShit",
            "body": "Speak for yourself. I hit up an ice facility protest and then an Emma Goldman book fair. Polished it off with making some protest music with an old friend. Get out there",
            "score": 1,
            "replies": []
        },
        {
            "author": "SixGunZen",
            "body": "The simple sad fuckin fact is the time to protest has passed, and now it's time to take next steps, the steps that get taken when protesting doesn't work. The second sad fact is, not many leftists have the guts to make the personal sacfrifice. People who take the next steps are usually people who have nothing to lose, and we haven't reached that point yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepy_din0saur",
            "body": "It will happen eventually. Organizing takes time.",
            "score": 0,
            "replies": []
        },
        {
            "author": "No_Silver_8933",
            "body": "Deportation.. “Fascist” theocracy.. Emo maga nazi.. and more but are we waiting for more? \n\nWhy aren’t we moving.",
            "score": -14,
            "replies": [
                {
                    "author": "OwlHeart108",
                    "body": "Are you sure we're not? Movement isn't always obvious.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "KeithFromAccounting",
                    "body": "Plenty of people are, why don’t you go and join them?",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "MightyKrakyn",
                    "body": "Are you asking why we’re not sharing all of our decentralized plans on the centralized fascist techno-oligarch owned data-gathering platforms?",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Sargon-of-ACAB",
                    "body": "Why aren't you?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MotherJess",
                    "body": "Are you organizing a protest, if that’s what you think will help right now? Or did you post this because you want others to do the work for you?\n\nAs someone who has organized protests, I don’t personally think that’s the best use of our power right now, but I am sick to death of people shouting “why aren’t we protesting?!?”. If it’s important to you, fucking do that. It’s not my job to do it for you.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}