{
    "title": "You're arguing about the collapse, I'm collecting wild grown grains to prepare, we are not the same.",
    "author": "EndTimesBeUponYe",
    "subreddit": "Anarchism",
    "rank": 359,
    "score": 305,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 53,
    "url": "https://www.reddit.com/gallery/1ifbp5s",
    "id": "1ifbp5s",
    "selftext": "Troll post obviously, but in all seriousness learn your local wild grown foods, it may help you in the coming bad times.",
    "comments": [
        {
            "author": "Platform_collapse",
            "body": "Help each other with whatever you have and be ready to love radically in the coming days. May you always find enough to eat.",
            "score": 94,
            "replies": [
                {
                    "author": "justmeagainik",
                    "body": "thats the mood im going for",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ElysiaDarkmoor",
                    "body": "Together, we can create a community of care and resilience.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "KelbyTheWriter",
            "body": "\"Brother, I require your oats\"  \n\\-that one pig(real depicted pig, not a cop.)",
            "score": 70,
            "replies": [
                {
                    "author": "Fun-Loquat-1197",
                    "body": "NO BROTHER",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "Alone_Regular_4713",
                    "body": "Napoleon?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "KelbyTheWriter",
                            "body": "Ohhhhhhh, that sweet-sweet pig.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PyteOak",
                    "body": "I AM STARVING, BROTHER!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "drkabysss",
                    "body": "other brainrotted anarchists, nice",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SalaryIllustrious988",
            "body": "Inland Sea Oats? I dunno that those are going to make very good food.",
            "score": 23,
            "replies": [
                {
                    "author": "Archknits",
                    "body": "Probably very little calorie effectiveness and much less nutritious than modern grains",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "partiallygayboi69",
                    "body": "Yep, this is just part of a tendency that a lot of leftists but particularly anarchists have of trying to pretend that their hobbies are political action.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Deboche",
                            "body": "A lot of anarchists have decided farming has revolutionary potential and they're not wrong. But the tone of this post does stink of what you described",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "major_calgar",
                            "body": "Also a human tendency to believe the apocalypse is happening during their own life time.\n\nWe’ve seen significantly less developed countries than the US collapse totally in the past century (Yugoslavia and a depressing amount of the African continent come to mind). We will not need to harvest wild grains from the side of the road to survive.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EndTimesBeUponYe",
                    "body": "They're mountain oats and no I don't really think I'll eat these. It was more as a plan of spreading them in the empty lots around my house so there may be more later. As for nutrition I'm aware they aren't great but hey free is free when you're not in a breadbasket territory",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SheaGardens",
            "body": "tw: gross, prions, likely death\n\ntotally agree with finding your local natives and learning to harvest/cultivate/prepare them, and what i’m about to say pertains to hunting more but i’d say it’s still important to know. \n\ntonight, i was driving home from the grocery store in rural maine, and came across a weirdly acting whitetail deer in the middle of the road. flashed my lights and honked at it a few times, before it finally looked towards me. half of it’s face was rotted away. it slowly walked off the road and walked into the woods. we’ve had reports of CWD for awhile now, but this was my first time seeing it in person. i don’t think i’ll ever eat deer meat again after that.\n\nthat said, be careful about where you’re sourcing native plants, as well as local meat from. every level of our ecosystem is actively dying, and as much as i hate the modern food production system, it seems the wilds/forgeables aren’t safe anymore.",
            "score": 33,
            "replies": [
                {
                    "author": "lucyditeaa",
                    "body": "Wild thing about CWD, it can survive forest fires.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "justababydontbemean",
                    "body": "[chronic wasting disease](https://wildlife.ca.gov/Conservation/Laboratories/Wildlife-Health/Monitoring/CWD#:~:text=What%20is%20chronic%20wasting%20disease,examples%20of%20TSEs%20in%20humans)",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Old_Harry7",
                    "body": "What does CWD stand for?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SheaGardens",
                            "body": "chronic wasting disease",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Old_Harry7",
                                    "body": "Thanks.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ToxicAvenger161",
                    "body": "\"i hate the modern food production system, it seems the wilds/forgeables aren’t safe anymore.\"\n\nThis is such a wild take 👀",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Joan_sleepless",
                            "body": "Water that flows over the street outside your home becomes toxic. The air we breathe is still full of lead from the gasoline our cars use/used. We've tracked species all over the globe and made once localized animals take over the globe. Previous generations fucked over the planet and there isn't much we can do but be careful.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "ToxicAvenger161",
                                    "body": "I don't see how that wouldn't affect the food you get from groceries. They grow in the same air and use the same groundwater reservoirs.\n\nEven if you don't have experience of eating food from nature, it doesn't mean rest of the world are as alienated.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SheaGardens",
                            "body": "it’s the reality. historically, you could escape modern food productions with “grown at home” being the easiest way to do so. now, it’s not as safe to do that as it’s always been due to a ton of factors",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ToxicAvenger161",
                                    "body": "To me this just sounds as being totally alienated from your surroundings. I don't know what a toxic wasteland rural maine is as I havent been there, but your depiction of wild food not being safe anymore (unlike groceries) is definitely not the reality for many of us.\n\nI can go to the nearest lake to fish, and it's perfectly good fish. I can go to nearest forest and pick berries and those are healthy and good nutrition. I wouldn't pick mushrooms close to roads, but go a little bit deeper in the forest and there's no problem. I don't have experience of game, but it shouldn't be a problem either.\n\nI live in a city of around 220 000 people. I dunno, maybe it's something with you being from the states, but I don't think I know a single person that wouldn't find that opinion is ludicrous.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SheaGardens",
                                            "body": "sorry, do you not have pfas contamination wherever you live? we certainly do here! also, half of the counties in maine have “do not eat” orders on the wild deer population because of cwd.. maybe this is you not paying attention to how much our natural world is struggling?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ToxicAvenger161",
                                                    "body": "You get pfas from groceries also. I live in eu, where the regulations and monitoring of pfas seem to be on higher level than in the US.\n\nWhat comes to CWD there seems to be 3 known cases of CWD where I live and apparently those cases have been \"inborn\" cases and not transmissable cases.\n\nAnd the nature is obviously struggling, no one is denying that. It's just the idea that nature = dangerous, supermarket = safe, that I find very detached.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JetoCalihan",
            "body": "The wild ones are the exact ones that will be there when a collapse happens. If anything you're just stealing the resources from the future by harvesting them now when you don't need them and preventing those seeds from sprouting new plants. If you want to encourage survival you should be discussing post collapse societal strategy, not encouraging everyone to jump on foraging (which will just collapse the ecosystem as well as the economy at current pops). \n\nGardening, community land usage agreements, food libraries, and skill shares.",
            "score": 27,
            "replies": [
                {
                    "author": "LunarGiantNeil",
                    "body": "You can also keep heirloom seeds around and learn how to propagate them. Keep your own little disaster seed bank!",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "EndTimesBeUponYe",
                    "body": "I picked these specifically to go plant around my neighborhood, and the plants I got them from are from a house for sale that will most likely cut them down when bought, so if anything I'm only helping propagate them further!",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ghost_of_Durruti",
            "body": "This post would be appropriate in so many other subs.  From bushcraft to taoism to preppers lol.  I like it.\n\n  \nThere's an old quote: \"If I can shoot a rabbit, I can shoot a fascist.\"  What can one do if they learn to nourish themselves?",
            "score": 10,
            "replies": []
        },
        {
            "author": "GoWest1223",
            "body": "Can you send me some oatmeal?  :).  I agree.",
            "score": 5,
            "replies": []
        },
        {
            "author": "-hey-ben-",
            "body": "Reminder that every season is foraging season if you know where to look. Ima go look for hickory nuts tomorrow",
            "score": 5,
            "replies": []
        },
        {
            "author": "MR422",
            "body": "As someone who has vegetable gardened for several years, I heavily recommend Jerusalem artichokes/sunchokes. Practically indestructible.",
            "score": 5,
            "replies": [
                {
                    "author": "EndTimesBeUponYe",
                    "body": "That's great info, thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "geographys",
            "body": "I’m collecting wild grains too - we are the same!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "germwarfare72",
            "body": "Always wondered if river oats were edible. They spread hella fast so this could be a decent source of calories of you had the space.",
            "score": 5,
            "replies": [
                {
                    "author": "EndTimesBeUponYe",
                    "body": "They are! These are wood oats, a close relative. Neither are technically oats, but they can both be ground down into flour!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "germwarfare72",
                            "body": "Are they still Chasmanthium spp? Wondering how closely related they are - either way, very useful!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "EndTimesBeUponYe",
                                    "body": "Yeah the wood oats are also chasmanthium",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Mushrooms grow fast and can be grown indoors with minimal intervention by humans. It wouldn't be all the nutrients we need but it would cover quite a lot of them. You can use waste materials and even woodchips to grow perfectly tasty meals, with some like chicken of the woods actually being deep friable and tasting like fried chicken.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shamoorti",
            "body": "We'll all be dead in the time span between sowing these seeds and harvesting edible food. That is if one is even lucky enough to be in an area where dry farming these grains is actually viable.\n\nWe need to get organized and do something now before it comes to this.",
            "score": 7,
            "replies": [
                {
                    "author": "KelbyTheWriter",
                    "body": "the US is a breadbasket that has been tossed to the ground. There is food EVERYWHERE; indigenous folks saw to that hundreds of years ago. Acorns, PawPaws, wild grains, wild rice, wild onions, etc. We don't have to die.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Shamoorti",
                            "body": "Millions of people trapped in cities facing famine aren't going to be able to forage for acrons realistically.\n\nMaybe it's not as bleak as my comment makes it sound, but I'd rather not take my chances on having to survive the hunger and desperation of millions of other people if I can try to do something now.\n\nIt's good to take precautions and try to have enough supplies and equipment on hand to survive emergencies and catastrophes, but I just don't see any individualist \"prepper\" types surviving much longer than anyone else. Not saying that's you.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KelbyTheWriter",
                    "body": "not to say we do not need to organize, sorry! I'm all over the place rn.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "counterhero666",
            "body": "That’s the ticket!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordPuam",
            "body": "Your camera quality is insane.",
            "score": 1,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "Here in Austin there are a few community gardens, but they have no openings because they've been taken over by rich hippies. I can't, so get bent. This is not the cool intro you thought it was.",
            "score": 1,
            "replies": [
                {
                    "author": "EndTimesBeUponYe",
                    "body": "No need to be rude. I literally picked these out of a rich hippies yard in Hyde Park lol. They grow like weeds and I plan on spreading them around the green belt and empty lots in my neighborhood. Also it says on your profile you live in New Hampshire so why are you digging me about ATX?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "am_az_on",
            "body": "Preppers skew disproportionately right-wing. Analyze that, figure out what it says about things.",
            "score": 1,
            "replies": [
                {
                    "author": "Flabbergasted_____",
                    "body": "There’s nothing wrong with prepping. It’s a part of life for plenty of people (blizzard, hurricane, fire, etc prone areas). The thing is that the reichwingers feed off of fear, so businesses have popped up to capitalize on their stress and have made prepping seem like a paranoid hermit activity to shill shitty overpriced food buckets.\n\nIt does kinda show that they’re accelerationists that are paradoxically afraid of what they’re causing though.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "partiallygayboi69",
                    "body": "Its because its mostly an individualistic fantasy of how the preppers super special skills (hobbies) will allow them to survive (it probably won't).",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}