{
    "title": "Witholding as a form of protest",
    "author": "split1221",
    "subreddit": "Anarchism",
    "rank": 330,
    "score": 33,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Anarchism/comments/1igta6w/witholding_as_a_form_of_protest/",
    "id": "1igta6w",
    "selftext": "I was wondering what ways could really get back at the top 1%, whithout causing much harm to those involved. I think its easy to call for mass General strikes, but that takes a lot of planning and people would experience real harm by being out of work for what would likely need to be a multiple week strike. \n\n  \nMy proposal is this. Any left leaning person who has a mortgage should simply stop paying it. \n\n  \nThat's the elevator pitch, but more realistically the sudden loss of thousands of mortgage payments would cripple these banks. And its something that can be sustained for multiple months by the witholder. Month 1, you save $X amount of dollars. By month 2, they'll start making calls etc... Now you have $2x cash in your savings. MAYBE by month 3 they'll start making motions like they'll go to court. Maybe send a demand letter, it will be different in each state. But All in all, across each of the states, you'll likely have 3-6 months of being able to save up your mortgage payment, before they even get the courts involved. \n\n  \nNow here we are at month 6, this has become a movement (1000 people per state could be enough, but obviously more is better), banks are really feeling the pain of not having the cash, and now you all are sitting on 6 months of mortgage that you can keep as cash, (or likely will use it to help with any varrying emergencies that will spring up in the next few months of the Regime). They start moving to foreclose on these homes. Depending on your state, you could be looking at an additional 6 months to upto and beyone 24 months. Especially since we'll now be clogging the already strained court system with all of these foreclosure cases. (Most firms handling foreclosure have lowered staffing levels since the 2008-2012 US mortgage crisis, it would likely take them 1-2 years to fire back up to 2010 levels to now match the demand to even file the cases). \n\nSo, they blink. Then hey, no harm no foul, you've got the 6 months in the bank you can just bring everything current and we've had our demands met. If they don't, then as you can see, likely anyone who is fortunate to be in this situation would likely have 1-2 years to be able to weather this storm so it would likely be the Banks that crumble first. Only took about 2 weeks of witheld labor during the pandemic to realize that could make them cow. \n\n  \nWilling to workshop, but I think this could be an avenue to put pressure on the top from the middle. ",
    "comments": [
        {
            "author": "Sargon-of-ACAB",
            "body": "This sort of thing has the huge problem that it only works if a lot of people do it but it's very hard to either ensure or confirm lots of people are doing it.\n\nPlus it's risking people's housing. Probably the only form of capital they'll ever have access to *and* (more importantly) a basic human need. You're assuming banks and the state will play fair\n\nYou can theorycraft the effectiveness all you want but people are going to be understandably hesitant start doing this with no assurances about the effectvness. Also 1000 people per state means you need several times that number to do eviction defense. And because this is gonna be incredibly geographically dispersed you'll need to ensure those people are willing and able to travel swiftly and on short notice.",
            "score": 37,
            "replies": [
                {
                    "author": "split1221",
                    "body": "Thanks for the feedback, that's why I'm throwing it out there to get responses to see if there are holes in my argument. I appriciate the opportunity to further refine my argument. \n\n  \nI would argue couldn't we solve for that with some type of, may sound childish, but like a sign up sheet, where in we all say ok, starting March 1st we all start. And people can be girded by seeing others signing up (annonomously somehow). And then their friends tell their friends, and then their friends tell their friends... \n\n  \nAs to the risk for people's housing, I fully understand. I wouldn't want anyone going into this type of agreement that was already on shaky ground. I'm not sure how to counter that argument other than I fully believe that due to the bureaucracy still existing both within the banks infrastructures, and put into place at the municipal level, that anyone that agrees to this would likely have at least 6 months before anyone would even come close to being able to legally remove you from the premesis. And my thesis is, if enough people join up, it would never have to get to the 6th month, they'd cave at the lack of capital around month 3. Not to mention, the more people who are in for the long haul, the more the court system is log jammed, further delaying the process. In the previous mortgage crisis, they were litigating in 2011 people who hadn't paid a mortgage since 2008. There are also all sorts of Pro Se responses a homeowner could file to clog up the works even further delaying. I think I guess my point is those that can, gum up the works as long as possible, for the gears to break and they relent.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "pean-",
            "body": "I feel like the state would use tax dollars to bail out the banks and then police force to evict delinquent mortgage holders. Striking at capital with capital seems a bit counterintuitive to me personally.",
            "score": 10,
            "replies": [
                {
                    "author": "No-Scarcity2379",
                    "body": "I mean, it literally already happened exactly that way in 2008, and there is also now a class of corporations with basically limitless pockets who will happily snap up all those foreclosure sale homes and then rent them back to the now unhoused for a good bit more than the mortgage. ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "am_az_on",
                            "body": "The position that they don't have enough sheriffs and other enforcers of foreclosures and won't be able to ramp up to fix that problem may be a bit optimistic too.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Beneficial-Tea8990",
            "body": "Great idea. Check out debt collective if you haven't already. Personally I only have student debt so I can't join in on the mortgage actions.",
            "score": 5,
            "replies": []
        },
        {
            "author": "AustmosisJones",
            "body": "Since January I've lost my job, so I'm already kind of doing this 😂\n\nNow I can do it with intent 😜",
            "score": 5,
            "replies": []
        },
        {
            "author": "sickpete1984",
            "body": "People need to get over the fear of what will happen if they resist. If we all resist and are willing to stand strong and help each other out with food, figting for our shelter, and defending our communities, we could go a lot further.",
            "score": 3,
            "replies": [
                {
                    "author": "am_az_on",
                    "body": "It only counts if you do it offline.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sickpete1984",
                            "body": "That is a mindset that benefits those in power.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "am_az_on",
                                    "body": "If you're helping people with food but the food doesn't make it offline, then it doesn't benefit the person who needs to eat the food non-virtually.\n\nI think it benefits the people in authority if the masses of people get massively \"socially\" sidetracked onto screens instead of doing things offline.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sickpete1984",
                                            "body": "Sorry, I misread what you said. I saw online at first, not offline.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "am_az_on",
            "body": "If it's hard to mobilize a general strike it's hard to mobilize a don't-pay-your-mortgage-and-hope-you-don't-lose-your-house. The first 6 months might go okay but after that what if they don't blink like you hope they do?\n\nLesson: How did the mass rent strike go from the start of the pandemic?",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Upstairs_Ad_4018 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DiogenesD0g",
            "body": "My mortgage holder wouldn’t care. They would just keep tacking on late fees and be happy with that. \nPlus how do I know everyone else is doing it at the same time so I don’t feel like a patsy?",
            "score": 1,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "This is only applicable to the bourgeois class.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legitimate-Ask5987",
            "body": "Insurance companies and banks have endless wealth at their disposal to wait us out til the federal gov gives them what they want by garnishing, refusing to issue government loans, etc. The only way to collapse the capitalist system imo is to refuse to work. Though you'll see scabs or consequences, the fear it puts in the hearts of capitalists when ppl aren't working is the most satisfying feeling. Just teleworking through covid this country almost collapsed. ",
            "score": 1,
            "replies": []
        }
    ]
}