{
    "title": "How do you find and get involved in local protests?",
    "author": "femboysRlife72",
    "subreddit": "Anarchism",
    "rank": 163,
    "score": 107,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iqxlp0/how_do_you_find_and_get_involved_in_local_protests/",
    "id": "1iqxlp0",
    "selftext": "I'm ashamed to admit that I've never attended a protest before. With everything that's going on in the world today I feel I have no right to just sit back and watch as fascism is slowly becoming a potent and powerful force in our daily lives. I want to get off my ass and get involved in direct action and participate in all the protests that have been going on. There aren't any in my community though because I live somewhere very rural. If there was a demonstration nearby I'd be more than willing to travel to get there, but the problem is I'm not sure how or where to find out where people are meeting. How exactly do you find out where and when protests will be held so you can join? I'd appreciate some advice. Thanks in advance for your reply.",
    "comments": [
        {
            "author": "dashibid",
            "body": "Others in this thread can be purists about it, but joining a local DSA chapter or getting involved with “mainstream” LGBT, feminist or racial justice groups or even just a progressive church can be a good way to meet other folks and get on the types of email chains that know when local protests pop up.",
            "score": 56,
            "replies": [
                {
                    "author": "NothingAndTrash",
                    "body": "Yeah, I’m in my local DSA chapter with a couple of others who hold anarchist ideas. Our chapter is focusing on political education and mutual aid. Not saying the org is perfect but it’s the largest and most realistic point of contact to leftist politics for many",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "PublicUniversalNat",
                    "body": "What if I live nowhere near a major city? Philly is a two and a half hour drive from me.  Would it make sense to join an organization that distance away?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dashibid",
                            "body": "You’ll have to do some research- there’s stuff going on in unexpected places. Or find a local issue group. Or, sure, join the email list just to stay in the loop. Only you know what’s worth it to you.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "NothingAndTrash",
                            "body": "If you’re in PA, there’s quite a few DSA chapters",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Dirty_Clown_Boxers",
                            "body": "Start one!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dashibid",
                    "body": "Forgot to add … there are valid criticisms of them obvs, but SURJ has a pretty good presence in some smaller cities and their email list and social media often focus on spreading the word about other organizing happening. If you’re looking for low-risk actions where you can stand around with a sign and meet people, they are a good in. “Protests”/rallys might not always be the most powerful form of action but they are even less powerful when people don’t go to them, so I try not to discourage folks from joining in, if that’s what you want to do right now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LostInIndigo",
            "body": "Honestly? I don’t think protesting is a great use of time.\n\nI say this as someone who has been involved in anarchism basically my entire life, got started with food not bombs when I was 14 and lived in a punk house with a lot of anarchist activity when I was young as well. I have worked as a professional organizer and I have orchestrated successful, long-term rent strikes, and things like that. I say all that to say, I have a good bit of experience in this stuff lol\n\nIf you really want to “get off your ass” and make a difference, I think pre-figurative work and mutual aid is going to be the most rewarding, and the place where it’s most helpful to apply your time. \n\nThe left doesn’t need more protestors lol-we got the “agitation” in our AEIOUs down.\n\nPeople love to do the “sexy“ stuff like protests because they are high visibility and you get a lot of positive feedback, but the true work is going to be building out mutual aid structures and community care, and maybe community defense.\n\nEspecially going into the current situation we are in, they want you to protest so they can put you in jail lol. Everyone is aware there’s a problem and aware that people aren’t happy about it, so protests have minimal value unless they have a very specific goal like blocking a certain thing or intimidating a certain person. And even then, the risk is usually not worth the reward and there are ways to handle it that do not end up with everybody being on the news and in jail.\n\nIf you want to get involved in local organizing that’s actually meaningful, I recommend looking for local labor organizing, local tenant organizing, or something like that with a concrete material, but less highly visible goal. \n\nAny of these organizations that are perpetually putting together protests is only going to burn you out and put you on whatever list your local government is keeping. \n\nAlso avoid the DSA and PSL like the plague.\n\nYou could also form your own direct action pod. Direct action is high risk and I don’t recommend doing it with folks that you don’t know and trust with your life. It might be better for you to find a couple other like-minded people and start your own as opposed to trying to plug-in with strangers. You want to be with people that you know will do their best to dearrest you, or stay around to use their stop the bleed training if something happens to you, as opposed to running away.\n\nETA: to evaluate if a group of people is worth spending your time on, you want to look and see if they have a very explicitly and directly articulated goal-ie “ our organization provides free legal resources and kyr training to tenants facing eviction” or “ our organization helps organize childcare pods in underserved neighborhoods” - you want to look for concrete material things that the organization is providing and proof that it is doing it well. \n\nAnd you want to make sure it’s happening in a mutual aid/sustainable/solidarity way that actually gives more training/autonomy to the people it’s helping, not just a charity thing where they throw some canned food at people once a month and call that helping.\n\nStay away from any organization that has liberal word soup in their goals, vision, etc: ie “We aim to legitimize the ideas of identity politics and DEI to create a sustainable space where we spread joy through acts of self-care, because self-care is resistance“\n\nThey literally just said jack shit right there about what they actually do, and I bet they don’t actually do jack shit",
            "score": 54,
            "replies": [
                {
                    "author": "RunningOnATreadmill",
                    "body": "This is gold. I've been going to lib protests and it's the biggest waste of time and is eroding my faith in humanity.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "AcadianViking",
                            "body": "Salting is a thing, but it definitely takes a certain kind of temperament to do effectively.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "RunningOnATreadmill",
                                    "body": "what is salting",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AcadianViking",
                                            "body": "Salting is going to general assembly protests to specifically spread anarchist views and recruit people for local initiatives. Think handing out anarchist zines or flyers for local organizations in need of volunteers. \n\nMany who attend these protests do so because they feel powerless and are specifically looking to get involved. So the idea is to be there and point these people in the right direction.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "LostInIndigo",
                                                    "body": "I think salting is great, but if you are new to anarchism and direct action yourself, you’re not going to be able to have those conversations very effectively IMO. \n\nSo I think for folks like OP who are trying to get more involved themselves, it’s best that they just move away from the protest space for a while until they have really concrete political education around what things should functionally look like.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "AcadianViking",
                                                            "body": "Which is why I originally said in a previous comment that doing so requires a certain type of temperament. \n\nSince I believe there is a miscommunication here, I feel the need to clarify that the \"folk who are trying to get more involved\" are the targets of those doing the salting, not the ones doing the salting themselves. \n\nIt is a fact that protests are magnets for people looking to get involved, and salting is the method to recruit those individuals to a cause or planting the seeds of anarchist thought. \n\nIf this wasn't a misunderstanding, then sorry for assuming.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "LostInIndigo",
                                                                    "body": "Idk that I am disagreeing or there’s a miscommunication-I am just reiterating that specifically in OP’s case they shouldn’t be worried about that since that was the original thread topic and I don’t want them to think we’re encouraging them to go out and salt lol",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AcadianViking",
                                                                            "body": "Okay. I didn't think of that, I was simply answering the other comment's question as to what salting was. I forgot the context of the post and didn't understand the point of your response.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Yunzer2000",
                            "body": "That's odd, becasue all the mass protests back in the Bush War days back in my city (Pittsburgh) and even in DC had very strong anarchist presence.  Anarchists, for a while, even had majority of the membership of the 60's style left-Catholic pacifist Thomas Merton Center.  Those were the days when Diversity of Tactics was the guiding principle. The most popular song at them was \"Bella Ciao\" (Italian and Chumbawumba versions.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Daringdumbass",
                    "body": "I was going to make a post asking almost exactly what OP just posted and this is extremely helpful advice so thank you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jxtarr",
            "body": "If you have to travel far, then you aren't solving the right problems. Start at home. Protests have become fundraisers for the state anyway. They don't do much, and have no clear goals. If you live anywhere in the US, I guarantee that you have enough local issues to tackle that will be more important than any march or rally.",
            "score": 13,
            "replies": []
        },
        {
            "author": "anarcho-slut",
            "body": "r/ProtestfinderUSA\n\nLook for local mutual aid groups\n\nUnion organizing",
            "score": 11,
            "replies": []
        },
        {
            "author": "Waste_Junket1953",
            "body": "I joined a trade union and started going to meetings.",
            "score": 11,
            "replies": []
        },
        {
            "author": "the_umbrellaest_red",
            "body": "Protests are very rarely direct action. The “direct” means the action is taking place directly where the harm is taking place, or where the decision to do harm is being made. Most protests are just in a big public place/city street. \n\nAs far as how to get involved in direct action, you’re going to need to connect up with other people. Take a look for leftist organizers near you. Political organizers or cause-based organizers. I would check out a meeting if possible rather than a big action, although a public facing action might be easier to join.",
            "score": 8,
            "replies": []
        },
        {
            "author": "MacondoSpy",
            "body": "Find a cause(s) that you’re passionate about and join groups on social media. They usually post about upcoming protests.",
            "score": 3,
            "replies": []
        },
        {
            "author": "KapindhoAlternativa",
            "body": "I can't really say anything because I was from different country which have it's own unique features but my main source of protesting information is anarchist affinity in Instagram tbh",
            "score": 2,
            "replies": []
        },
        {
            "author": "GlassAd4132",
            "body": "For larger, less likely to get pepper sprayed by the cops protests, your state or local subreddit isnt a bad place. The subs for here in Maine are pretty good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Julian_1_2_3_4_5",
            "body": "just got to anything that seems like it goes even a little bit in that direction, like normal protests, maybe an even where sb of the radical left speaks, local critical book faires, communal cinemas. Also if you are in a bigger city, you can probably find squatted buildings that usally have a lot of scene",
            "score": 2,
            "replies": []
        },
        {
            "author": "herefornowzz",
            "body": "Yeah, I wouldn't waste my time if it's just standing with some lib's for a couple hours. And then there are always those tankie tables. They are like a late 80's infomercial of a cancer on activity and tabling.",
            "score": 4,
            "replies": [
                {
                    "author": "LostInIndigo",
                    "body": "You don’t love when you go to a protest for an actually good cause and someone tries to get you to pay them two dollars for a newspaper full of NK propaganda?\n\n(Sarcasm)",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zarach93",
            "body": "Nice try FBI.",
            "score": 1,
            "replies": [
                {
                    "author": "femboysRlife72",
                    "body": "I promise I'm not a bot. This is just an alt I created specifically to post on political subreddits because I use my main account for uhm... other stuff 🙈",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zarach93",
                            "body": "Ok, I’ll give you the benefit of the doubt. Carry on.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lastonelater",
            "body": "I had this same problem for a long time! Last weekend I happened to drive by a protest at a time when I didn't really have to be anywhere. So I put what I was doing on pause and joined in. I met a DSA organizer and she's been helping me keep up since. I've only done one more protest since then but it's only been like 4 days. \n\nI'm not a Democrat or a communist because I'll work with them happily to obtain a better world. \n\nYou could also try doing it yourself. At one I got so frustrated never hearing about protest until after that I made a protest sign and marched by myself up and down the busiest road in my small conservative city. The sign said \"it's ok to punch nazi\" and I think i did a good job making it. \n\nOf course I understand that no everyone can do that. But if you're like me, so constantly anxious that embarrassment no longer exist, that could be an option for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "matt_mckenna3742",
            "body": "Just show up, be helpful and friendly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cronopi_O",
            "body": "My local plataformist/specifist group usually is involved in the horizontal preparations of the different demonstrations, like the Womens Day the 8 of March or the Workers Day the 1th of May.\nAnd try to push for a more radical stance and try to for a radical block with other political and organizations.\nIn the other side we try to foment union power also and try to promote for their fights and help workers join their struggle, like a students and professors strike that is being created now in my country.\nAlso we try to promote those struggles even if we don't participate if we think that they are cool demands, like our current tenants union are creating a confederation and we are part of the process of debates and trying to bring new people and more tenant unions inside.\nSo participating in a federal anarchist organization that tries to participate in mass movements, both are essential.\nWe are anarchists are we are also workers, so we need to be together both ways.\n\n\nWe also try to fight the different authoritarian leftists and socialdemocrats that are part of this movements, because if we don't participe we are going to be a group of really radicalised anarchist that are not participating in any real struggle and isolated from the working class. So the best strategy is to try to join this \"reformist\" struggles and try to promote a more radical stance while you help them to gain little demands.\nThis strategy is really talked a lot from historical anarchists like Malatesta and some anarchosyndicalist groups like \"Los amigos de Durruti\".",
            "score": 1,
            "replies": [
                {
                    "author": "Cronopi_O",
                    "body": "Please don't join socialdemocrat groups like the DSA, try to join an specific anarchist group and if there is not one around you participate in a grassroot movement and try to find other anarchists like you to try to form this groups.\nBut is better to participate in the struggles and then create anarchist specifist groups, not the other way. That way you now how horizontal organizations works, how to participate in those spaces and how to to detect entrism from authoritarian communist.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AwayExternal609",
            "body": "unitarian church, go to your local political party office and ask what's going on, start your own.50501. Once you start connecting you will find there are all kinds of groups. It would be much harder if you are rural though. A group of women in my community called \"women in action\" started before the election. They just wrote postcards for candidates. This morning they wrote a letter demanding a town hall meeting with their federal representative, tried to set an appointment to deliver it. They wouldn't agree to appt but we delivered letter along with marching and protesting at his local office. It was pretty effective and made the news",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwayExternal609",
            "body": "Look for those old gray headed women in your town.  Or the next larger town over. They know things",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwayExternal609",
            "body": "Sierra club and things like that are usually fighting locally almost everywhere.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AwayExternal609",
            "body": "feed the hungry, tutor kids who are struggling.. grow food (that would be a really good thing and gets you off the grid from the corporations).Better yet if you live in a rural area work with local growers. Put in a greenhouse and start working at local farmers market. the farmers are tapped in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kerrystpete",
            "body": "I am a senior citizen and I am very familiar with protesting I was very active back at during the Vietnam war I protested many times at Berkeley.",
            "score": 1,
            "replies": []
        }
    ]
}