{
    "title": "Influencer who snatched wombat joey has visa reviewed",
    "author": "freakingtaco",
    "subreddit": "ImTheMainCharacter",
    "rank": 18,
    "score": 2765,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 105,
    "url": "https://www.reddit.com/r/ImTheMainCharacter/comments/1jakpuh/influencer_who_snatched_wombat_joey_has_visa/",
    "id": "1jakpuh",
    "selftext": "https://amp.abc.net.au/article/105047538",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "## Thank you for posting here. Please make sure your post contains a clearly identifiable main character. Otherwise, it will be removed.\n\n**Main Character (abbreviated as MC):** *Deliberate attention-seeking behavior, entitlement, or individuals thinking they are more privileged.*\n\n**Questions to consider:**\n- Is it easy to tell who the MC is?\n- Does the MC show entitlement and/or attention seeking behavior?\n- Is the MC very inconsiderate of the people around them?\n- If your post is about parking, does it show the blatant disregard of parking rules?\n  \nSee any violating comments? **Report them.** This is a massive community, so moderators don't have time to scroll through all the comments of every individual post. Instead, we use the queue to moderate. By using the report feature, we can see the flagged content in the queue and therefore moderate faster.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ImTheMainCharacter) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "bidhopper",
            "body": "She clearly failed her finals. There’s no way she’s a wildlife biologist and environmental scientist. Moron at best.",
            "score": 914,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 95,
                    "replies": [
                        {
                            "author": "bidhopper",
                            "body": "Wanna bet that she’ll soon be unemployed?",
                            "score": 150,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -79,
                            "replies": [
                                {
                                    "author": "mimosaholdtheoj",
                                    "body": "It’s 2025. Let’s move away from the “r word” shall we please?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Lara-El",
                                            "body": "Why are you being downvoted for not wanting people to use \"retard\"? For years people have been advocating against it as its basically a slur for mentally challenged people.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "mimosaholdtheoj",
                                                    "body": "Cuz people are upset I called them out for being rude, outdated, and just plain wrong. Thank you for knowing the fight and standing strong!",
                                                    "score": 14,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Savage_Batmanuel",
                                            "body": "![gif](giphy|3ov9jLsBqPh6rjuHuM|downsized)",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "mimosaholdtheoj",
                                                    "body": "Sad. But it reflects on who you are as a person so go ahead and keep letting others know so they can avoid you.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "mimosaholdtheoj",
                                                                    "body": "Yea, say that to someone who has a mental handicap. You can't harm one group and preach protection for another.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Suitable-Job2166",
                                                                            "body": "Don't be obtuse. If we were talking to someone with a mental disability, then yes, absolutely that would be harmful. \n\nBut we are talking about a woman who went out of her way to grab a Joey Wombat away from their mother. What she did was objectively/incredibly stupid and irresponsible.\n\nAka what she did, her actions, were indeed retarded. \n\nAlso, who am I preaching protection for?",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mimosaholdtheoj",
                                                                                    "body": "Yea and I’m all for protecting the Joey. I’m a huge animal person. But why use a word there when you don’t need to?? It lessens your argument and makes you sound like a petulant child so no one listens. I met the kids who made the original, “don’t say it” videos way back in the day. Their sibling faced mental challenges and the siblings stood up for them. They were incredible. Ran into them in line at Disney. I’m not going to back down. I stand firmly on what I said.",
                                                                                    "score": 10,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Suitable-Job2166",
                                                                                            "body": "How do you deem if a word is necessary or not? How are you the arbiter of how people speak? You say that it makes me sound like a child, and yet here you are. Arguing with multiple people who, at the end of the day, don't want to listen to you either. How I speak may not vibe with you, and that is fine. \n\nBut what you're not going to do is tell me how to speak. I can do that myself. \n\nAlso I never heard of that video. Whats is the channel name? I also never been to Disney, is it nice?",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "mimosaholdtheoj",
                                                                                                    "body": "I’m not the arbiter of how people speak. But it doesn’t take more than a split second to speak nicely and not further marginalize an already marginalized group of people. Why be hurtful when another word is right there? Disney is fun but crowded and expensive. Great for young kids!",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Suitable-Job2166",
                                                                                                            "body": "All I'll say is I'll think keep that in mind. \n\nPlus, did you go to Disney California or Florida? I'm thinking about going to one with the family. Didn't have a chance to go as a kid, so I'm planning now. Also, I hear their cruise line is nice~",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "mimosaholdtheoj",
                                                                                                                    "body": "It’s much appreciated! I did Florida! Never been to Disney land. I’ve heard their cruise line is ideal for kids! I think Disney is awesome if you like rides, the characters, and don’t mind a little patience. I hope you get to go!",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Savage_Batmanuel",
                                                            "body": "If you’re worried more about words than intent, most of us could care less. People like you are boring nitwits that suck all the fun out of life because of your fake chivalrous attitude.\n\nUpdate: Retard is a funny word. Words can have multiple meanings. Grow up and focus on real problems.",
                                                            "score": -13,
                                                            "replies": [
                                                                {
                                                                    "author": "TheReal50Kent",
                                                                    "body": "Please, for the love of god, it is “COULDN’T care less” not could",
                                                                    "score": 33,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Savage_Batmanuel",
                                                                            "body": "You missed the period at the end of your sentence.",
                                                                            "score": -16,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TheReal50Kent",
                                                                                    "body": "Okay? I’m not talking about grammar, I’m talking about constantly seeing “could care less” be used when it’s just plainly incorrect.",
                                                                                    "score": 18,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "JustScratchinMaBallz",
                                                                            "body": "God should be capitalized.\n\nEdit: it’s cool, heathens, God believes in you and loves you.",
                                                                            "score": -22,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SpicyMcBeard",
                                                                                    "body": "ALL HAIL ZEUS! KING OF THE GODS!!! ⚡️⚡️⚡️",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JustScratchinMaBallz",
                                                                                            "body": "This guy gets it!",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "TheReal50Kent",
                                                                                    "body": "Okay buddy",
                                                                                    "score": 9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "JustScratchinMaBallz",
                                                                                            "body": "You could capitalize Buddy too.  If you wanted to, I guess.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "mimosaholdtheoj",
                                                                    "body": "I do understand the sentiment, but I think there are classier ways to convey frustration. Knocking down and ostracizing one group of people while also trying to stand up for some other cause is just as harmful.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -11,
                                                            "replies": [
                                                                {
                                                                    "author": "mimosaholdtheoj",
                                                                    "body": "Sorry I'm standing up for people who may not be able to stand up for themselves. If being an asshole is wrong, I don't want to be right.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bookhouseboygeorge",
                                                                            "body": "keep fighting the good fight, mimosa.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "mimosaholdtheoj",
                                                                                    "body": "Thanks, friend. It’s a small thing but no one should feel ostracized, especially for something they have no control over.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Icy-Revolution1706",
                                    "body": "No it isn't. \n\nRetard is really bloody offensive in the UK. Please do not tell people that we use that word here and its ok, its fucking not.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Objective-Seesaw-649",
                                            "body": "God. Are we still banging on about this? It was a joke. Chill the fuck out.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Icy-Revolution1706",
                                                    "body": "Jokes are funny. Saying something offensive and then claiming it was a joke is pathetic. Grow the fuck up.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "taisynn",
            "body": "You wouldn’t kidnap a baby from a mother if it was human. \n\nWhat makes it any better doing it to an animal? You not think that baby animal wasn’t scared as all hell after watching his Mother be shooed away as her Joey is taken? \n\nDespicable.",
            "score": 876,
            "replies": [
                {
                    "author": "megapoliwhirl",
                    "body": ">You wouldn’t kidnap a baby from a mother if it was human.\n\nAre you familiar with this board?  Half the people in the videos posted here would absolutely kidnap a human baby and then return it explaining 'it's a prank'",
                    "score": 259,
                    "replies": []
                },
                {
                    "author": "LittleRedCorvette2",
                    "body": "Well actually that IS exactly what the Australian government did to the Aboriginal kids and adopted them into white families....\nBut I digress.",
                    "score": 81,
                    "replies": []
                },
                {
                    "author": "iskie19",
                    "body": "There are people who will if the mother and child have different skin colors.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "ImpactFlaky9609",
                    "body": "I fully agree that it despicable and glad these morons get pubished but that argument is very weak.  If that chain of thought worked we'd all be vegans",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "sadkinz",
                    "body": "ICE seems to like doing just that",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PutThatOnYourPlate",
                    "body": "If you agree with this, stop buying diary.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "hot_egg",
                            "body": "But how will I know when things are?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "wstrfrg65",
                                    "body": "Just buy a PDA like the rest of us",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "taisynn",
                            "body": "Beat you to it. I’ve been allergic to dairy for my whole life.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smilemoreoften424",
            "body": "That video was absolutely heartbreaking, I hope they throw her in jail before the visa is even revoked.",
            "score": 328,
            "replies": [
                {
                    "author": "Big_b00bs_Cold_Heart",
                    "body": "That video stressed me out SO bad",
                    "score": 103,
                    "replies": [
                        {
                            "author": "frevaljee",
                            "body": "The dairy industry does the exact same thing on an industrial scale",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "zhico",
                                    "body": "And the tech industry.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SatanicRiddle",
                    "body": "Funny, considering australias national hero is a guy who manhandled animals for views... and he fucked around so much till he found out.\n\nAnd now people start clutching pearls that an animal was grabbed for a minute...",
                    "score": -155,
                    "replies": [
                        {
                            "author": "Chirpy_locket",
                            "body": "Reddit is so depressing. When did Irwin get the axe? That dude made a generation of kids interested in nature, his passion was contagious. He was going into the outback to  “manhandle” them regardless of views. Add in the conservation benefits of the attention he was bringing to issues around the world, this just seems like a lazy attempt to tarnish a good name.",
                            "score": 96,
                            "replies": [
                                {
                                    "author": "SatanicRiddle",
                                    "body": ">That dude made a generation of kids interested in nature\n\nI have no doubt there are kids out there dead or gravely injured because they wanted to act like him.\n\nAnd maybe its the case of *\"have to live in that time\"*, but seeing him from modern perspective - bothering animals beyond observing.. its what we see on youtube and tiktok main characters do for views. I guess at that time it was less obvious that what he was doing was for attention.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "Chirpy_locket",
                                            "body": "So Jane Goodall, Corwin, Attenborough, Darwin, the list goes on. You put them on the same level as a guy with a TikTok channel grabbing turtles for views?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "SatanicRiddle",
                                                    "body": "Did they go and manhandled animals as their go to thing to do on camera? No? Then no.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Chirpy_locket",
                                                            "body": "But they did handle and interact with the wildlife they were studying. Hell Darwin removed many large tortoises from their native islands, way worse than “manhandling” correct?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "astral_immo",
                            "body": "you suck.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "rye_domaine",
                            "body": "Yeah shitty behaviour from the influencer but Steve Irwin's only real difference was he did it for TV. You can probably make an argument that he was a bit more educated on wildlife but it's a pretty basic rule in wildlife research that you don't touch the animals unless you absolutely have to.",
                            "score": -71,
                            "replies": [
                                {
                                    "author": "Garchompisbestboi",
                                    "body": "He definitely didn't have to touch that stingray and the rest is history",
                                    "score": -66,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EitherChannel4874",
            "body": "Put her in jail.",
            "score": 482,
            "replies": [
                {
                    "author": "Gorthebon",
                    "body": "Nah, put her in a zoo for a few weeks.",
                    "score": 190,
                    "replies": [
                        {
                            "author": "taisynn",
                            "body": "Make her clean the zoo for a few weeks. Maybe the elephant, giraffe, and zebra cages. I know they’re great for leaving massive turds. She’ll fit right in.",
                            "score": 92,
                            "replies": []
                        },
                        {
                            "author": "ObiWan-Cannabis",
                            "body": "Nah, put her out of her misery.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Garchompisbestboi",
                    "body": "I just saw an article saying she fled the country like the coward she is.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Extension-Lab-6963",
                    "body": "Jail and cancel visa",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "NovocaineAU",
                    "body": "Put her back in America. That’s punishment enough. I don’t want to spend tax dollars on her upkeep.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Beer2Bear",
                            "body": "Americans: we don't want her!",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "EitherChannel4874",
                            "body": "That's just pure evil.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WIAttacker",
            "body": "She JUST released a public statement on her IG.\n\nYes, it's as bad as you think it is. She claims that the wombat was not moving and she thought it was hit by car.\n\nYou know, because if you are super concerned that you have just found a hurt animal, what you do is skimp over to it and snatch it, while whoever is recording you says \"She just got a baby wombat!\" and then laugh his ass off.",
            "score": 71,
            "replies": [
                {
                    "author": "Pretty-Interest5713",
                    "body": "Well that's a blatant lie",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "suejaymostly",
            "body": "That little joey's cries were so pitiful. She's a monster. I hope *redacted because, reddit*",
            "score": 152,
            "replies": [
                {
                    "author": "nursepenelope",
                    "body": "And the awful friend laughing because the mother was chasing her to try to save it baby. Ban both of them!",
                    "score": 79,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheTesticler",
            "body": "Please deport her please",
            "score": 99,
            "replies": []
        },
        {
            "author": "stuffwiththing",
            "body": "I'm with our Prime Minister, feed her to the Crocs.",
            "score": 133,
            "replies": [
                {
                    "author": "taisynn",
                    "body": "That’s not fair to the crocs. They shouldn’t have to eat garbage.",
                    "score": 71,
                    "replies": []
                },
                {
                    "author": "Sad_Egg_5176",
                    "body": "Can we switch PMs? In Canada, ours would probably cut her a check to make up for all the mean comments she had to see",
                    "score": -66,
                    "replies": [
                        {
                            "author": "Nemesis0408",
                            "body": "In Canada we spell it “cheque”, bud.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Sad_Egg_5176",
                                    "body": "Cool story, bud. You trying to say I don’t live in Canada? Who the hell would lie about that 😂",
                                    "score": -62,
                                    "replies": [
                                        {
                                            "author": "Maskers_Theodolite",
                                            "body": "Idk but an egg that's sad is up on the list of suspects. Unless the egg is happy.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheBlackDwight",
                            "body": "You must be pretty sad that this is Trudeau's last day in office and you won't be able to shoehorn him into every conversation from now on, eh?",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "Sad_Egg_5176",
                                    "body": "Nope, I’m actually ecstatic I won’t have to see that asshole’s face anymore. Thanks for asking though",
                                    "score": -55,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 31,
            "replies": [
                {
                    "author": "Glampire1107",
                    "body": "On Facebook, Bowman Consulting has said she is no longer employed by them 🥰",
                    "score": 82,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alarming-Situation-4",
            "body": "I will not feel sorry when she is in prison.",
            "score": 81,
            "replies": []
        },
        {
            "author": "KlatuuBarradaNicto",
            "body": "This was horrifying. She belongs in a prison cell.",
            "score": 64,
            "replies": []
        },
        {
            "author": "BigFella52",
            "body": "We haven't had the boot out since that Simpson kid in '95 but it was appropriate to be used here again",
            "score": 17,
            "replies": []
        },
        {
            "author": "BikeMazowski",
            "body": "Fuck this bitch.",
            "score": 43,
            "replies": []
        },
        {
            "author": "Major-Check-1953",
            "body": "She belongs in prison.",
            "score": 32,
            "replies": []
        },
        {
            "author": "WillartforfoodMI",
            "body": "Should be in jail for animal cruelty",
            "score": 9,
            "replies": []
        },
        {
            "author": "AmputatorBot",
            "body": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot).\n\nMaybe check out **the canonical page** instead: **[https://www.abc.net.au/news/2025-03-13/us-influencer-wombat-video-visa-under-review/105047538](https://www.abc.net.au/news/2025-03-13/us-influencer-wombat-video-visa-under-review/105047538)**\n\n*****\n\n ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
            "score": 14,
            "replies": []
        },
        {
            "author": "Yung_Edamame",
            "body": "I like the quote from the foreign minister “but really, leave the wombat alone” makes it sound like the press is harassing the mother and child",
            "score": 8,
            "replies": []
        },
        {
            "author": "FL981S",
            "body": "Good news!",
            "score": 5,
            "replies": []
        },
        {
            "author": "AntonMaximal",
            "body": "I am totally in with the hate for this bitch. But the quote from Albanese:\n\n>Take a baby crocodile from its mother and see how you go there.\n\nI think he could have picked a better example. Crocks have zero maternal behaviour. If they ever see them after laying eggs, they more likely to eat them than defend.",
            "score": 17,
            "replies": [
                {
                    "author": "tutbutfut",
                    "body": "What are you even talking about. Crocodilians are well known for not only protecting their nests, but also carry their nestlings to the water AND protecting them afterwards…",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Polyzero",
                    "body": "Probably referring to their initial hatching where they will scoop them up with *some* maternal behavior.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thunderbird_12_",
            "body": "The natural tendency for a certain group of people to believe that they are entitled to own/control other living beings really needs to be studied.\n\n![gif](giphy|uVQT9S7AwVmwAXhasg)",
            "score": 23,
            "replies": [
                {
                    "author": "MiddleSir7104",
                    "body": "\"Influencers\"? \n\nI agree!!!!",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "somnia_ferum",
                    "body": "do you mean everyone?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wapiti__",
            "body": "worse is, as like her, I'm also a hunter and outdoorsman, and her sickening act has now even more ruined our public perception for an already polarizing topic. I couldn't fathom doing what she did and am repulsed by it. She is no true hunter or outdoors(wo)man",
            "score": 13,
            "replies": [
                {
                    "author": "Huckleberry_Hound93",
                    "body": "Hell yeah Elk, I fully agree! This dumb C makes us all look bad just because she is a horrible person. Makes me sick.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Aggravating_Speed665",
                    "body": "Good. One less 'hunter' in the modern world. Let's hope you all get shunned eventually.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Wapiti__",
                            "body": "0/10 rage bait",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IT_techsupport",
            "body": "Wth, Its crap like this why North Americans get a bad rep in the world.",
            "score": 6,
            "replies": []
        },
        {
            "author": "RoyallyOakie",
            "body": "It used to be enough just to spot wildlife, but everyone needs their video moment now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Luditas",
            "body": "https://i.redd.it/95d3bih3jmoe1.gif",
            "score": 1,
            "replies": []
        },
        {
            "author": "FewLibrarian959",
            "body": "[ Removed by Reddit ]",
            "score": 1,
            "replies": []
        },
        {
            "author": "dogfit34",
            "body": "Death penalty",
            "score": -3,
            "replies": []
        }
    ]
}