{
    "title": "Dumbass pranksters harassing store employees and taking over a store",
    "author": "blue2002222",
    "subreddit": "ImTheMainCharacter",
    "rank": 17,
    "score": 491,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 185,
    "url": "https://v.redd.it/7o24mmqisroe1",
    "id": "1jblv7r",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "## Thank you for posting here. Please make sure your post contains a clearly identifiable main character. Otherwise, it will be removed.\n\n**Main Character (abbreviated as MC):** *Deliberate attention-seeking behavior, entitlement, or individuals thinking they are more privileged.*\n\n**Questions to consider:**\n- Is it easy to tell who the MC is?\n- Does the MC show entitlement and/or attention seeking behavior?\n- Is the MC very inconsiderate of the people around them?\n- If your post is about parking, does it show the blatant disregard of parking rules?\n  \nSee any violating comments? **Report them.** This is a massive community, so moderators don't have time to scroll through all the comments of every individual post. Instead, we use the queue to moderate. By using the report feature, we can see the flagged content in the queue and therefore moderate faster.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ImTheMainCharacter) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "HenryInRoom302",
            "body": "\"Our work here is done, boys\".\n\nWhat work?  Being a fucking spectacle and adding absolutely nothing positive to society?",
            "score": 189,
            "replies": [
                {
                    "author": "Saifaa",
                    "body": "So it appears",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Weelki",
                    "body": "His work is inspiring the next generation of clout chasers... smh... it's a never-ending circle of shittiness...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Chillax420x",
                    "body": "Not surprise, thats prob the most \"wOrK\" he ever done.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Japanesewillow",
            "body": "I hate the losers that do this. It’s not funny.",
            "score": 388,
            "replies": [
                {
                    "author": "AbbreviationsSea2516",
                    "body": "Hustling to pay bills and you have to put up with this nonsense smh",
                    "score": 95,
                    "replies": [
                        {
                            "author": "UsayNOPE_IsayMOAR",
                            "body": "Hustling to pay bills and you decide to do *this*? Earning clout with a circle jerk just sucks, fuck blood money, that’s cringe money.",
                            "score": -60,
                            "replies": [
                                {
                                    "author": "5narebear",
                                    "body": "Dude... He's referring to the worker...",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "UsayNOPE_IsayMOAR",
                                            "body": "Yeah, I got that, and I was referring to the idiot with the megaphone. In morning retrospect, that was not clear at all, and appeared an attack on the guy I relied to. Instead of doing anything productive, this was his big idea. Planned it all out with his idiot friends to just ruin so many peoples’ day.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "nekomamushu",
                                    "body": "Dude you are so lost",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "UsayNOPE_IsayMOAR",
                                            "body": "I was talking about the dude making this video and screaming into the megaphone, not any of the commenters. I guess I just lost everybody reading.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "nekomamushu",
                                                    "body": "Ok buddy",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "FlaxFox",
                                    "body": "Not sure why you're down voted when it's obvious you're talking about the shirtless loser.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AcanthisittaEvery237",
                    "body": "Agreed. It's just stupid",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Responsible_Cod_1453",
                    "body": "Don't hate them they are no one, but they are losers.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "broi8yourmom",
                    "body": "The worst part is this creator found Jesus and is still on his stupid grind",
                    "score": 6,
                    "replies": [
                        {
                            "author": "StanLiamNeeson",
                            "body": "He catches PDFs now",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "broi8yourmom",
                                    "body": "Ahh well at least that’s good",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "weabooGodly",
                            "body": "So you’re just hating Christianity In general?",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Turakamu",
                                    "body": "It sounds more like they are hating the grifter",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "turboiv",
                    "body": "Imagine how everyone getting fucked by DOGE feels right now. This is the *exact same thing*.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheSmokingLamp",
                    "body": "These are the type of people you make a call to the police about and say you feel threatened by them. Let the law run its course good or bad whatever the outcome.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Telkk2",
                    "body": "I work in retail and this would have me rolling. Trust me. It could be 1000 times worse. I get kids unloading shaving cream all over aisles just for a few upvotes. \n\nFuck that, dude. If you're gonna do shit like this, don't default to being an asshole. Actually be funny like this dude. As long as people do that and they're not making my job any harder by harassing, threatening,  or destroying things, and its temporary, Idgaf.",
                    "score": -88,
                    "replies": [
                        {
                            "author": "kingkong381",
                            "body": "Nah, as a retail worker, I just want a quiet, straightforward shift at work. Kids messing up the store and this shit are on the same tier of bullshit as far as I'm concerned and always has me wishing a car accident on the culprit and cancer on all their loved ones. Besides, who has to clean up the mess these cretins will inevitably cause? The retail workers, that's who.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "AbbreviationsSea2516",
                                    "body": "They all look able bodied and have a clear schedule. Have Zelenskyy send the van, off to Ukraine boys, enjoy",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kookymungi",
                            "body": "Funny? This was about as witty as dog crap.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Ash_Tray420",
                            "body": "r/asablackman",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "PainAccomplished3506",
                            "body": "that... wasnt funny at all... I work full time at a grocery store and Id be so annoyed at these idiots, like I got a lot of shit to do bro lol",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Crazy-Path-7929",
            "body": "I dont know what's more pathetic, him doing this and getting am army to do the same, or that there's so many idiots who would follow him and do it.",
            "score": 100,
            "replies": [
                {
                    "author": "isemonger",
                    "body": "I have no interest in it, but every now and then I have twitch or livestream things pop up on YouTube. I honestly have no fucking idea who or why anyone would watch these miserable cunts be said miserable cunts. And even moreso why they’d then go do the same thing.\n\nIs there actually this many people watching these idiots, assuming the majority of them wouldn’t show up in person to do this I can only assume there are thousands of mouth breathers watching one person be a cunt. And somehow being inspired by that?",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "MijnheerIJsThee",
            "body": "Social media is a cancer upon society. I hate that it gives every knobhead a podium.",
            "score": 41,
            "replies": []
        },
        {
            "author": "MegatonsSon",
            "body": "I Sincerely hope the whole lot of them were trespassed from that store.",
            "score": 82,
            "replies": [
                {
                    "author": "PsychologicalDebts",
                    "body": "I was going for inciting a riot for main character.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "filthy_sandwich",
                    "body": "Is that a synonym for jettisoned into the sun?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Drakeadrong",
            "body": "It’s bullying. This is just bullying with a camera.",
            "score": 58,
            "replies": [
                {
                    "author": "VanillaCreamyCustard",
                    "body": "🎯🎯",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "bing-bong-forever",
            "body": "Like… why?",
            "score": 49,
            "replies": [
                {
                    "author": "cheeseplatesuperman",
                    "body": "Money",
                    "score": 18,
                    "replies": [
                        {
                            "author": "bing-bong-forever",
                            "body": "How and why? Fucking hell. What a shit world we live in here in America.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Ram2145",
                                    "body": "and its getting worse by the second.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "cheeseplatesuperman",
                                    "body": "He has like 10 million subscribers\n\nY’all downvoting me for answering a question",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "bing-bong-forever",
                                            "body": "10 million morons I suppose. But this isn’t happening in a vacuum. American society is objectively fucked.",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Uncl3Slumpy",
                            "body": "Missing a K",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rays_LiquorSauce",
                    "body": "So it could get reposted here for years and years. Rage bait is a commodity ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Marmaluuuude",
                    "body": "Cause fuckin with people is fun sometimes",
                    "score": -4,
                    "replies": [
                        {
                            "author": "bing-bong-forever",
                            "body": "These are people who are just doing their jobs. Wtf do you mean fun? Fuck these assholes.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "dirtyword",
                            "body": "Only if you’re stupid!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "imadork1970",
            "body": "dickhead for clicks",
            "score": 43,
            "replies": [
                {
                    "author": "cheapdrinks",
                    "body": "But like who tf actually watches this shit and subs to their channels and thinks to themselves after watching it \"yup this shit is peak\"",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Tumblrrito",
                            "body": "Same generation that brought us so called \"devious licks\" that led to weird vandalism of school bathrooms and shit",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Czar_Petrovich",
                            "body": "Gen Z",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WrightAnythingHere",
            "body": "Why can't these fucking people just be normal? The employees are out here just trying to get through the day, get paid and go home, they don't deserve to deal with this shit.",
            "score": 17,
            "replies": []
        },
        {
            "author": "EnragedBadger9197",
            "body": "I just can’t believe grown toddlers is becoming a thing",
            "score": 17,
            "replies": []
        },
        {
            "author": "Ziegelphilie",
            "body": "*criminals, not pranksters. Harassment and vandalism is a crime, stop normalizing this bullshit",
            "score": 12,
            "replies": [
                {
                    "author": "VanillaCreamyCustard",
                    "body": "🎯🎯",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "opturtlezerg5002",
                    "body": "\"stop normalizing this bullshit\".\n\nWho's normalising this?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "3NDC",
            "body": "At that point, just kick him out of the store.",
            "score": 26,
            "replies": []
        },
        {
            "author": "Local-Explanation-20",
            "body": "Went from not funny to horribly embarrassingly cringe",
            "score": 24,
            "replies": []
        },
        {
            "author": "VaWeedFarmer",
            "body": "Maybe you should show him where the bra's are?  Boy got some puffies",
            "score": 34,
            "replies": [
                {
                    "author": "MyDishwasherLasagna",
                    "body": "He's got bigger tits than I do.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "iyakonboats",
                    "body": "He's a professional raw dogger, brotha be taking some footlongs up his ass",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kirilw",
            "body": "Where did he find that army of dumbsters, lmao",
            "score": 8,
            "replies": []
        },
        {
            "author": "suckitdavidcameron",
            "body": "This cunt needs a punch in the face so badly.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Tyrant_Nemesis",
            "body": "These are some of the shittest people in society. People are just doing jobs, getting paid way less than they fuckin deserve and then morons come in and do this shit. Some people really don't understand the level of absolute absurdity and trashy people we have to deal with retail that make the job not worth the damn pay, but how the hell else are you gonna keep a roof over your head and feed yourself in the modern society that humanity has created.\n\nI've never dealt with this specific thing, but we've dealt with people shitting on the floor, >!masturbating!<, just being trashy people in general, shoplifting then creating a scene when confronted and saying that we're invading their privacy etc.",
            "score": 7,
            "replies": []
        },
        {
            "author": "TazzyUK",
            "body": "\"I can't f&%king stand dudes like that..\"\n\nHow ironic!\n\n![gif](giphy|QxwDfOV4sAfounkNsG)",
            "score": 13,
            "replies": []
        },
        {
            "author": "Few-Acanthaceae-5527",
            "body": "This angers me.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Schoolquitproducer",
            "body": "when doing nothing funny but filming and harassing others' business is your whole life achievements and job skill. congrats brainrots!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Hot-Nefariousness187",
            "body": "Imagine if they actually rallied behind something productive for society. We are so cooked",
            "score": 11,
            "replies": [
                {
                    "author": "Iamnotheattack",
                    "body": "🍳",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReduceReuseReuse",
            "body": "lol nothing in our society is going to work in thirty years is it",
            "score": 4,
            "replies": []
        },
        {
            "author": "nolongerbanned99",
            "body": "These level have serious issues. They need help.",
            "score": 5,
            "replies": []
        },
        {
            "author": "tehtris",
            "body": "I believe this is jidion. If it makes y'all feel better he has actually evolved his content and doesn't do prank videos like this anymore. He has shifted into doing weirdish documentaries.",
            "score": 6,
            "replies": [
                {
                    "author": "GoldenGlobeWinnerRDJ",
                    "body": "Yea that’s what I was about to say. This looked a lot like JiDion and after recently watching his video with Tom I didn’t know this is what he used to do. Kinda disappointed ngl…",
                    "score": 2,
                    "replies": [
                        {
                            "author": "onFilm",
                            "body": "These people are trash inside and out. The majority of people doing the content he does now are. Pretending to be Chris Hansen... Fucking idiots.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lsuhifi",
                    "body": "Dude, he’s been banned for pranks as recently as 2023. Did he actually evolve? Or did he just get cut out of so many prank opportunities and avenues that he had no where else to fucking go? People like this don’t actually evolve/change if they don’t put in the work.\n\nThe sad part of it all is that if he can mobilize that number of people in that little time (from what I read it was hours) then he’s wasting his fucking skill set. Imagine doing this to people who are actual trash humans instead of a dude making no more than $16-18/hour at Best Buy. That tells me all I need to know.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "tehtris",
                            "body": "What about the leader of the kkk? Would that be a valid target?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "lsuhifi",
                                    "body": "It’s pathetic to give air time to someone that vile, honestly. \n\nAlso, more consequences for his actions that result in nothing but clout chasing for his profit. He don’t give a fu about catching predators or holding anyone accountable, just the like, comments, and subscribes.\n\n[https://www.reddit.com/r/ImTheMainCharacter/s/RU7Sbgw58I](https://www.reddit.com/r/ImTheMainCharacter/s/RU7Sbgw58I)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hawkeye2024",
            "body": "What a loser",
            "score": 3,
            "replies": []
        },
        {
            "author": "VanillaCreamyCustard",
            "body": "Call their Probation Officers.",
            "score": 3,
            "replies": []
        },
        {
            "author": "exgiexpcv",
            "body": "Damn, fools, get out of here with your juvenile gynecomastia.",
            "score": 7,
            "replies": []
        },
        {
            "author": "R7a1s2",
            "body": "Fuck these \"people\"",
            "score": 6,
            "replies": [
                {
                    "author": "Redditmau5",
                    "body": "![gif](giphy|EtogbOL6Y7aOQ)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Confident-Damage-530",
            "body": "Is that JiDion?",
            "score": 6,
            "replies": [
                {
                    "author": "Glass_Ad_1490",
                    "body": "Yeah. He doesn't do stuff like this anymore, this video is years old.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Confident-Damage-530",
                            "body": "Ah ok thanks, I thought so he just looked younger.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "lsuhifi",
                                    "body": "To be clear, looks to be less than 4 years old. People ITT talking like this dude has aged and matured and it’s been less than 4 years. He is literally still young enough that he’s still in brain development years (24).\n\n*edit, was off by one year",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "7_11_Nation_Army",
            "body": "What a poop stain.\n\nAnd the brainless scum that came with him the second time are just a waste of oxygen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KawaDoobie",
            "body": "tell me you got NOTHIN goin on in life wo telling me",
            "score": 2,
            "replies": []
        },
        {
            "author": "dben89x",
            "body": "I'm just imagining the vast majority of people he went up to called him and his minions out for being such losers. And they just walk past like \"ah well you won't make the final cut\". And then they finally find one person to say \"free the nipple\". And they put him in the video, while the other 10 told him to get fucked. Just so they could create the illusion that the people are on his side and don't find him and his loser friends annoying. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Useless_advice69",
            "body": "Man retail employees put up with too much shit",
            "score": 2,
            "replies": []
        },
        {
            "author": "TekkenSoftSubsidzs",
            "body": "Bro is just letting them titties haaaang all out 😂 ew!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Brave-Expression-736",
            "body": "The man boobs are hypnotic...I...can't...look...away.",
            "score": 4,
            "replies": []
        },
        {
            "author": "xChopsx1989x",
            "body": "We need to find a way to channel this energy into more useful endeavors.\n\nLike, \"What’s up YouTube? Today, we're taking old school with some good old-fashioned prank calls. But to take things up a notch, I bought a bunch of prepaid phones, and I'm going to challenge my friends to see who can make the most prank calls. What's the catch? We're all calling the same number. ^It's ^the ^ICE ^tip ^line The winner gets a Mr. Beast Bar.\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "clandestineVexation",
            "body": "OP you realize that posting this video everywhere and as much exposure as possible is what these people want right? By perpetuating it you’re supporting them",
            "score": 2,
            "replies": []
        },
        {
            "author": "zubairhamed",
            "body": "This is america",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cuck-In-Chief",
            "body": "Little wangs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkAssignment6163",
            "body": "Best response. Call the books and hit them with trespassing. Don't say anything to these idiots. Just call the cops.",
            "score": 1,
            "replies": []
        },
        {
            "author": "moonbucket",
            "body": "That man needs to put his man-titties away.\n\nEww.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothMarx",
            "body": "\"I can't stand people that don't play into my unsolicited pranks!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cyberzombi",
            "body": "All those flappy man titties need bras.",
            "score": 1,
            "replies": []
        },
        {
            "author": "moses1er",
            "body": "how is this funny? who likes this shit? really?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Living_Astronomer_97",
            "body": "Who the fuck has time for this shit.   Gentlemen get a job and leave people who do have jobs alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OpenTheBobs",
            "body": "Andrew walked up to him and asked him very politely several times to put on his shirt. This fool pushed back to get a reaction and created the problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NYlogistics",
            "body": "Why are the employees so polite? This would never happen in Sweden!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NYCstraphanger",
            "body": "People are such a$$holes. So annoying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "S4r4hlou",
            "body": "Andrews not paid enough for that shit! I worked in a similar looking shop years ago, the tantrums from grown adults i witnessed on multiple occasions - shameful! And gen Z wonders why they have become THE most irritating generation ever!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "iyakonboats",
            "body": "Give home boy a bra",
            "score": 1,
            "replies": []
        },
        {
            "author": "x_x--anon",
            "body": "How did he get so many dumbasses to join him?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thetubhairtrap",
            "body": "The P90X comment was pretty funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flashy_Chemist154",
            "body": "The trash called social media",
            "score": 1,
            "replies": []
        },
        {
            "author": "that-one-meme-guy-69",
            "body": "I’m happ Jidions career ended taking a more serious turn, still doing content but is now known for predator catching, a series called EDP Watch",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldenGlobeWinnerRDJ",
            "body": "Is this JiDion? It sounds a lot like him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heretic_81",
            "body": "Barf 😑",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaedrX",
            "body": "Awww he got his feelings hurt that Andrew wasn’t buying his dumbass act.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fmartins84",
            "body": "Do stores still have a panic button?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stmrjunior",
            "body": "Maybe don’t act like a cunt for clout?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious-Slice-91",
            "body": "Honestly when I was younger, this was funny. Now, it's like wtf dude are you doing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Different_Ease_8645",
            "body": "Once he gets hit in the face hopefully he changes his stupid attitude",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kikkeli-Disko",
            "body": "What a bunch of muppets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CityCaptains",
            "body": "Fucking trash",
            "score": 1,
            "replies": []
        },
        {
            "author": "badboudy",
            "body": "Yea soo how is that funny? Do people actually enjoy these type of videos?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental_Ad3964",
            "body": "He’s mad because he set his boundaries in an appropriate way",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShnoobShnoob",
            "body": "he’s a different dude nowadays.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alarming-Tradition40",
            "body": "And most people cant stand dudes like you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackjaguar191",
            "body": "Blows my mind when I see bums who have so much time on their hands yet don’t know what to do with it. Instead of putting energy and time into something creative and useful they do this kinda dumb shit then you see the other idiots who follow. That’s what should worry us the way society is getting lost",
            "score": 1,
            "replies": []
        },
        {
            "author": "TimelyBlacksmith92",
            "body": "Gotta just start calling cops right away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shakuryon",
            "body": "I wanna be fair to the main guy in this clip, Jidion, who is still a popular YouTuber. This is a very old video, and yes he was a major douche in this video and he does have a lot of annoying anger-bait content that he was known for.\n\nLike around 1 year and a half ago, he made a big video about denouncing this type of content and never returned to it. Basically calling himself a loser for this type of content, and he wanted to do better. Even deleted all these videos that reflected this nature. He became more focused with God, and is now about more ACTUAL content that is not harrassing other people in public.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hentairedz",
            "body": "Nice tits bro.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far_Ad_8688",
            "body": "wtf is wrong with these people",
            "score": 1,
            "replies": []
        },
        {
            "author": "MurderBot-999",
            "body": "Dude fucking leave customer service workers alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Error_887",
            "body": "Damn I have always been self conscious about my body but I never had no titties like that!",
            "score": 1,
            "replies": []
        },
        {
            "author": "qwertitties",
            "body": "this is like a chappelle show sketch",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial-Ad6485",
            "body": "I love Jidion 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "idfkdudeguy",
            "body": "Seeing an awful lack of comments mentioning how he doesn't do this anymore and regrets it and now is catching pedos and not beating them up like other dumb yt people and actually puts them in jail. Not saying to not hate him just know he changed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minimum-South-9568",
            "body": "Sad",
            "score": 1,
            "replies": []
        },
        {
            "author": "dr_toze",
            "body": "If he'd just asked me to put the shirt on I would have...umm no, you very clearly wouldn't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "M3gamanX89",
            "body": "This dumbass insecure oxygen thief 😅. He was so mad he came BACK the next day. Andrew you won.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1998ChevyTaHoe",
            "body": "Police immediately lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "JCakes-Trini",
            "body": "Why he don’t put those breasticles in a bra?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutomaticFun3470",
            "body": "It’s simple call the cops",
            "score": 1,
            "replies": []
        },
        {
            "author": "peach-whisky",
            "body": "I'd be calling the police in a heartbeat",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigWilly526",
            "body": "Go to security cams and ban them from the store, if they try it again call cops and trespass them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate-Shock306",
            "body": "Dumbest generation of all time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Watt_Knot",
            "body": "This but it’s a trick and the store doors close and turns into a gas chamber",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedEye-55",
            "body": "The fact he was the sperm that survived. Lord have mercy",
            "score": 1,
            "replies": [
                {
                    "author": "FunSubstance8033",
                    "body": "He was not, it was only half of his DNA, the other half was an EGG that survived",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lovelife0011",
            "body": "lol who settled for Dr strange?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighwayBrilliant",
            "body": "That guy might actually be embarrassed about getting in trouble because of the way he's talking. Like he really can't let it go. He is playing up to the camera, acting all tough but there has to be at least one part of him that is embarrassed. That's what I used to do when I was a teen and got in trouble. I would get super defensive and after the person leaves I would kind of obsess over the topic for a little. But that's when I was a kid this dude looks well into his late 20s, 30s maybe.\n\nEdit: he might not even be one bit embarrassed and just is extremely immature but I was just saying from personal experiences. Side note I really do not like this guy. Leave Andrew alone 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apple2727",
            "body": "Where are all the mass shooters when you need them?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Zamatos73",
            "body": "This is fucked up and nobody should do this but this did get a bit of a chuckle out of me lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "n3k0___",
            "body": "It's only funny when jidion does it to preds",
            "score": 0,
            "replies": []
        },
        {
            "author": "PunchiDHunt",
            "body": "That was kinda funny",
            "score": -12,
            "replies": []
        },
        {
            "author": "Jaded_Frosting7770",
            "body": "Murican classics",
            "score": -1,
            "replies": []
        },
        {
            "author": "JnRx03",
            "body": "This is old, now Jidion has turned his life to god, and mostly makes predator catcher vids along with videos about his faith, not even joking.",
            "score": -7,
            "replies": []
        },
        {
            "author": "softwaredev20_22",
            "body": "look at those juicy tits",
            "score": -5,
            "replies": []
        },
        {
            "author": "BlackHazeRus",
            "body": "USA is such a strange place. On the one hand it is a total shithole, on another — a great place with lots of opportunities.",
            "score": 0,
            "replies": [
                {
                    "author": "7_11_Nation_Army",
                    "body": "You need to take a good look at the second hand again, please.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BlackHazeRus",
                            "body": "I mean it cannot be that bad, right? Sure, we (non-USA people) bash the country and its people a lot for being stupid, strange, and so on, but I bet the place is actually great and it just varies a lot — some places are nice, some others are not at all. Yeah, the good ones have dickheads too, but, just maybe, they do not represent the country as a whole, you know.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "7_11_Nation_Army",
                                    "body": "Yeah, you are right, but with the current Nazi regime it becomes increasingly difficult to imagine there is something good going between the rightwing sociopath warmongers, the illiterate hillbillies, and the tiktok attention whores.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Francesca_N_Furter",
            "body": "Someone needs to tell this guy that if he was wearing a shirt, the clumping white anti-persperant wouldn't be so grossly visible.  \n\nShirts required, sir, in your case, is a good thing.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Dramos1975",
            "body": "Know how to fix this..call the police that you have an unruly crowd of guys that might be high inside the store..but dont tell the assholes that you are calling the police..just call as soon as they enter",
            "score": 0,
            "replies": []
        },
        {
            "author": "Reasonable_Goose",
            "body": "They need to focus on getting the dummy behind the camera out first.. just grab the camera and chuck it out the store. These idiots whole life is meaningless unless it’s being filmed for some kind of validation.",
            "score": 0,
            "replies": []
        },
        {
            "author": "pleathershorts",
            "body": "This is the guy who showed up to the Civil War reenactment dressed a slave. That was absolutely hilarious. This is gutter content. Sad to see",
            "score": 0,
            "replies": []
        },
        {
            "author": "Poentje_wierie",
            "body": "Marcus Cousin the third aka Jidion is actually funny. But yeah, seeing this out of context is pretty stupid",
            "score": 0,
            "replies": []
        },
        {
            "author": "hacx21",
            "body": "Id find his info and leak it LMFAO 🤣 laugh it off in that moment.",
            "score": -1,
            "replies": []
        },
        {
            "author": "RashidMBey",
            "body": "Both are insufferable.",
            "score": -7,
            "replies": []
        },
        {
            "author": "jororeddit",
            "body": "Always this color",
            "score": -1,
            "replies": []
        },
        {
            "author": "BananaSplit1209",
            "body": "Damn, JiDion was still relatively in shape compared to now. \nBy the way, guy is doing a lot better for himself now in terms of videos. He's doing predator catches, and not those where they are basically unleashing their anger and assaulting the predators (which I'm not totally against for one) but making sure they get actual criminal records and charges pressed. Say what you will about JiDion, but I can respect any person who is putting up a fight against those vile people. \n\nSidenote: he still does it in his own trolling manner, but he has changed his content around for a while and has bettered himself. Also the argument could be made his pranks never actually hurt someone, albeit they were a huge pain in the ass",
            "score": -10,
            "replies": [
                {
                    "author": "ChanceImagination456",
                    "body": "No one cares about this guy or his physique. He goes around acting like an immature obnoxious moron harassing store employees for content. This garbage is lame and not funny.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "NeutralKarmaCarl",
                    "body": "Did he catch this predator exposing himself to kids at Best Buy in this video? Oh you're talking about the creep in this video?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "7_11_Nation_Army",
                    "body": "I hope the predators catch him.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "BananaSplit1209",
                            "body": "Boo hoo pussy",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "7_11_Nation_Army",
                                    "body": "I just realized your stupid comment didn't have enough downvotes. Here is one from me.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BananaSplit1209",
                                            "body": "Dont give af about internet points, but FBI gotta check your phone for you sticking up for preds weird btch",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "7_11_Nation_Army",
                                                    "body": "You should worry then, because they would find a whole lot of embarrassing pictures of your momma.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Chevy_Traverse",
                    "body": "whats with the downvoting? Jidion was an asshole to workers but honestly he was pretty tame. And he puts pedo’s in jail, so hes cool now",
                    "score": -3,
                    "replies": [
                        {
                            "author": "BananaSplit1209",
                            "body": "That's Reddit for ya. And we are on the maincharacter subreddit so I guess I kinda understand why he doesnt get the praise",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "k10storm",
            "body": "my GOD y’all need to lighten up\n\n“tHeSe gUys aRe lOsErS” 🤓🤓 SHUT THE FUCK UP y’all have no bitches whatsoever",
            "score": -20,
            "replies": []
        },
        {
            "author": "SylasWindrunner",
            "body": "Soon they will trying to infiltrate the White House again.",
            "score": -4,
            "replies": []
        },
        {
            "author": "alan-penrose",
            "body": "lol the goofy on or out thing the target guy did\n\nThat started all this 😂",
            "score": -15,
            "replies": []
        }
    ]
}