{
    "title": "\"You've been banned from PovertyFinance\"",
    "author": "rassmann",
    "subreddit": "povertyfinance",
    "rank": 0,
    "score": 845,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/povertyfinance/comments/157vje4/youve_been_banned_from_povertyfinance/",
    "id": "157vje4",
    "selftext": "Four months ago I posted the following message on this subreddit due to an increase of shitty people who have not read the rules or the community guidelines:  [https://www.reddit.com/r/povertyfinance/comments/11vwilh/special\\_enforcement\\_period/](https://www.reddit.com/r/povertyfinance/comments/11vwilh/special_enforcement_period/)\n\n&#x200B;\n\nThings have not improved significantly.  As such, these policies are no longer temporary.\n\n&#x200B;\n\nSo here is how it is going to be.  Any infraction can (and most likely will) incur a temp ban.  This is to drive home the point that this shit isn't negotiable.  Duration to be determined by the severity of the infraction, but ranging from 1 to 30 days.\n\nA second offense of the same penalty, or getting numerous offenses across different rules will yield longer temp bans with every infraction.  Users who demonstrate that their offenses are innate or deliberate, rather than accidental or incidental will get a full ban.\n\nParticularly shitty people will get a 365 day ban out the gate.  We believe people can change, but we're going to give them lots of time for it.\n\nOvertly evil people, troll accounts, or bad faith people will be banned outright without warning explanation.\n\n&#x200B;\n\nAs always, all actions can be appealed if you believe they are unfair.  HOWEVER, we expect you to review what you said first, and review the rules as well.  If you think we misinterpreted something, got the wrong guy, or whatever, please appeal on those grounds and we will review it.  If you make a bad-faith appeal, whatever ban you have will be extended.  If you come into modmail asking \"why was I banned\" for an obvious infraction you will get an extension.  And please note that saying \"Other kids were doing it too mom\" is not a valid appeal.  If you think other people need to have action taken on them, report their comments as well.\n\n&#x200B;\n\nWe are a small team.  We can't see everything posted here.  But we sure as hell see all the reports.\n\n&#x200B;\n\n**Edit 1:** Intent matters.  Coming here trying to help and breaking a rule will be viewed very differently than coming here with cruel intentions even if the violation is a soft-ball.  \n\n**Edit 2:** Please understand this is still reddit, an anonymous message board filled with sad, miserable, SMALL people.  We won't be able to prevent shitty people wandering in.  We can see them to the door as quickly as they arrive.  **TAKE AN ACTIVE ROLE IN REPORTING SHITTY COMMENTS.**  That's how we get these bastards, when you point them out to us.  Also, if you see something shitty, report it and move on.  Don't fight with an idiot, because they will lower you to their level, defeat you with experience, and get both of you banned in the process! ",
    "comments": []
}