{
    "title": "Feeling deeply depressed over the cost of extensive dental work",
    "author": "Tall-Advance2523",
    "subreddit": "povertyfinance",
    "rank": 17,
    "score": 214,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 70,
    "url": "https://www.reddit.com/r/povertyfinance/comments/1jdngis/feeling_deeply_depressed_over_the_cost_of/",
    "id": "1jdngis",
    "selftext": "I have an autoimmune disease that absolutely wrecked my teeth over the past decade (dry mouth, which I now have managed). I've spent around $30,000 in that time, basically just putting out fires. I've had dozens of fillings, five root canals, two crowns, one extraction (plus my wisdom teeth). \n\nI went to a few different specialists this year for consultations, and two general dentists as well and they all said I should crown all my teeth. My gums are healthy, my roots are healthy -- but I've had so much work done to my teeth that they're more filling than tooth, and there is still a ton of decay.   \n  \nI was quoted $80,000 by one specialist, $50,000 by another and $38,000 by a dentist without experience in full mouth restorations. I'm in my 30's, so everyone I've talked to doesn't want to extract my teeth - especially because the roots are healthy. \n\nI've also looked into dental tourism -- I'm in Canada, but I found some promising clinics in Mexico that would cost $24,000 at the most for me and my partner to spend a two weeks at an all inclusive and get all that work done. But even that's SO much money, and I've read so many horror stories. One highly recommended place looked at my x-rays and told me I needed 15 root canals, which none of the dentists I've talked to here agree with (I might need a few though).  I'm terrified I'm going to spend that money and need a ton of fixes when I get back home, or no dentist here will be willing to touch my teeth if I need help. \n\nI put my name in with the local university, but even that seems so daunting -- they require you go to 3+ hour appointments a few times a week until they finish the process - probably 2-3 months. It's about an hour away from where I live, which adds to my anxiety. \n\nOn my good days constantly in mild-moderate pain, can't eat properly, and have to take ibuprofen constantly. I just feel so deeply depressed and hopeless about my options, and for any hope of improving this. I've had a crown fail and need an extraction in the past and so I'm picturing that happening to all my crowns after I spend tens of thousands of dollars. \n\nIf anyone has been through anything like this and found some light at the end of the awful dental tunnel please let me know, or if you're currently going through it. \n\n ",
    "comments": [
        {
            "author": "nip9",
            "body": "Realistically if you aren't earning an above average income then extraction & dentures would be the affordable solution. Yes, dentists will try to point you a different way as they would prefer to save the teeth or replace them with implants but unfortunately that ideal treatment plan is often cost prohibitive. I have multiple relatives had full dentures in their 20s & 30s because it was the only workable option.",
            "score": 94,
            "replies": [
                {
                    "author": "ExistingPosition5742",
                    "body": "What this man said. You're going to lose them anyway tbh. \n\n\nSecond option is the dental school, in my opinion.\n\n\nI wouldn't go overseas.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Letsglitchit",
                    "body": "Been considering this as I’m in the similar boat as OP. Would it have any negative health effects getting them so young though? Heck might be worth it even if so, can’t imagine what it would do for my confidence to be able to smile again.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "nip9",
                            "body": "Yes, there are negative health impacts; mostly because your jawbone starts to slowly deteriorate once there are no teeth to support. Long-term your jaw will shrink a bit and you may have extra wrinkles on your face as the skin sags.\n\nImplants can avoid most of that but are easily 5-10X the cost. Might have to consider the health impact of all the stress, overtime hours, and other sacrifices required to pay that big amount compared to other ways you could use the cost difference to make yourself healthy in other ways. Dentures plus money to spare for a better diet or gym membership, and maybe eventually in a decade or two fillers/botox to    tighten any facial sagging could be the better option for both health and finances.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tallpaulmass",
            "body": "I am sad just reading this, but I am rooting for you! Good luck",
            "score": 64,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "Thank you, kind stranger. I appreciate that!",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "PocketSpaghettios",
            "body": "Try to hold out for the university. My mom had severe periodontal disease and several missing/loose teeth. She also got quoted tens of thousands of dollars to have her mouth restored by private dentists.\n\nToday she got her first surgery done at a dental school in preparation for full dentures. It's going to cost less than half of what the private periodontist would have cost. The care is also very personalized. She basically had a team of dentists working in tandem to come up with a care plan. Because cost wasn't as much of a factor they were able to focus on the treatment that would be most likely to succeed instead of what she could afford",
            "score": 46,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "That's actually very comforting to hear -- I submitted my case to the dental school last week, and I'm crossing my fingers I get in with them. \n\nI hope your mom's surgery went well!",
                    "score": 23,
                    "replies": [
                        {
                            "author": "EagleLize",
                            "body": "Go for the dentures. It's what a friend of mine decided to do. I think she had most of the work done at our local dental school. She's very happy with them. There was a little pain while adjusting but she said it was nothing compared to the everyday pain of her teeth before. She looks great. I can't believe the difference. It's not JUST the dentures. It's her whole face. Not to mention she's so much happier and it shows.\n\nI so hope you can get them. \n\nI had the option of getting a root canal and crown or having a tooth pulled. My insurance covered an extraction but not the root canal and crown.  I wanted to save the damn tooth. So I paid the $$$. A year later the crown and most of my tooth came out. The rest had to be extracted. Such a freaking waste. \n\nI think the smart and safer choice is dentures. Good luck!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "humpy",
            "body": "The fact that dental work is not a part of health insurance is complete horse shit.",
            "score": 21,
            "replies": [
                {
                    "author": "Nickslife89",
                    "body": "Dental insurance cost me 35 a month and I do get 2500 in work for free a year on that. Its not that bad but the 2500 goes quick because I always need work for some reason.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "FrankandSammy",
            "body": "Dont crown them! \n\nI have scleroderma and had to get all my teeth extracted (I was mid 30s.) I opted for implants and dentures.\n\nIt cost around $30,000. But I was tired of the small fires and never forever fixes.\n\nFor three years, I just signed up for 0% apr balance transfer cards and paid it until it was paid off.",
            "score": 18,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "That's my exact fear getting all crowns, especially since one failed already and needed to be extracted! \n\nWhat kind of implants did you get -- and how has your experience been with them?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "FrankandSammy",
                            "body": "I got Permanent Dentures. They screwed things in my jaw and then set the dentures in over the course of a year. Its been about five years now and I havent had any problems at all. I wish I would have done them sooner!",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Tall-Advance2523",
                                    "body": "Thanks so much for sharing that -- I can't even imagine what life is like not going into the dentist twice a month for emergency fixes. I'm going to look into some local places and see what the cost is here.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wanna_make_cash",
            "body": "Teeth are rich people bones if you have bad genetics or other issues, unfortunately. My mother's teeth were gone by her late 30s and she had to get dentures. My father's teeth are almost all gone in his 50s",
            "score": 38,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "povertyfinance-ModTeam",
                            "body": "Your post has been removed for the following reason(s):\n\nRule 2: Generally Unhelpful and / or Off-Topic\n\nYour comment has been removed for one or more of the following reasons:\n\nIt was not primarily asking or discussing financial questions related to poverty.\n\nIt was generally unhelpful or in poor taste.\n\nIt was confusing or badly written.\n\nIt failed to add to the discussion.\n\nPlease read our [subreddit rules](https://www.reddit.com/r/povertyfinance/wiki/rules). The rules may also be found on the sidebar if the link is broken. If after doing so, you feel this was in error, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fpovertyfinance).\n\nDo not reach out to a moderator personally, and do not reply to this message as a comment.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "thesaltiestchick",
            "body": "My sister flew to Turkey for dental work. It was way cheaper for implants. I’m missing two teeth in my smile line and I’m saving up to go.",
            "score": 12,
            "replies": []
        },
        {
            "author": "morbie5",
            "body": "> I'm in Canada\n\nI thought dental was covered by the government in Canada...\n\nA lot of Americans go to Mexico to get work done.\n\nhttps://www.molarcity.com/",
            "score": 6,
            "replies": []
        },
        {
            "author": "OKHuggins1",
            "body": "I spent tons of money to save my teeth. Dentists  got a lot of money. But , finally found a dentist who was honest with me and I got dentures. Best decision i ever made. No regrets. Maybe consider dentures.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Controls_Man",
            "body": "I’m not an expert but if you need 15 root canals I feel like you would be better off getting permanent implants or dentures?",
            "score": 5,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "I don't think that number is correct - that was quoted to me a dentist in Mexico who only reviewed my x-rays (no exam). I've had a few different exams in the last several months with local dentists to see what my cost options are and I've only bene told I have 1-2 teeth that may become root canals, but nothing is for sure.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crazy-Cat-Lady-1975",
            "body": "Go the university dental clinic route.  This is a lot of work and will be done incrementally, with follow up appointments for aftercare.  They may decide to extract your teeth and give you dentures.  Do not go abroad in an attempt to save money.  You will be shortchanging yourself out of care.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Triordie",
            "body": "Which auto immune condition do you have?",
            "score": 9,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "Graves Disease (hyperthyroidism). It's easy to treat, but it went undiagnosed for three years, and then I didn't have a specialist to help me for the next two years after that. That was more than enough time for it to make a significant impact on my teeth, unfortunately.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Triordie",
                            "body": "Sorry to hear that. Have never had a patient with graves. Only recommendation would be to think about metal or gold crowns at that the back of your mouth. They need a lot less tooth structure remove so preserve the remaining structure of the teeth’s and are less damaging on the opposite teeth if they are not crowned.  Try to use a high fluoride content tooth paste. In UK we have Duraphat. Also just try to cut frequency of sugar down rather than amount of sugar. Hope you can find an answer that is affordable.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shayshay4jz",
                    "body": "Most likely Sjogrens syndrome.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Entire_Dog_5874",
            "body": "I’m so sorry. Sadly, you’re only likely options are with a nearby dental school or going outside the country as a number of posters here have suggested.",
            "score": 4,
            "replies": []
        },
        {
            "author": "-moneymaker33-",
            "body": "Depending on where you live, viable option may also be getting your work done out of country. Specifically Mexico- message me I can give you info. My mom got new set of dentures for under $1,000 with a dentist in Mexico who is vetted and approved by US insurance companies. Has been the best experience yet even from her previous provider in the states. I’m getting 2 new implants for $8k, in payments. Just a thought, sharing our experience, don’t need hate. Best of luck to you.",
            "score": 4,
            "replies": [
                {
                    "author": "Zebras_And_Giraffes",
                    "body": "How dis your mom find a dentist that is approved by US insurance companies? I want to have some dental work done in Los Algodones, but I don't know how to locate a good dentist.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "-moneymaker33-",
                            "body": "I think it depends on the insurance broker, and the plans that they offer. Either way for us it was just more cost effective to take her to get her new dentures done in Juarez. We have several family members that also travel in to get dental work, after travel expenses, it’s still less expensive to get work done over here.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Icy_Skirt_8167",
            "body": "I live in Northern California, and I started my dental work journey last June 2024, I’m getting my first crown implant for a full cost of $1600 dollars per implant, plus 4 implants tomorrow and hopefully get a total of 5 implants in Playas de Tijuana Mexico with Doctor Juan Rios.  Mexico has a bad reputation but is really not that bad and the savings are upwards of 70 to 80% for the dental work. I’m at a Airbnb at about $60 per night, plus great Mexican food as a perk. I was quoted $17,000 per implant in the USA, the total cost of my dental work is going to be $10,100 including 3 extractions and bone graft procedure to replace bone loss to create a strong foundation for my dental implants. I’m happy to put you in contact with Doctor Rios he works I San Diego part-time so he speaks English and because he is in Playas a suburb of Tijuana the dental work is more affordable. After almost 15 years of a missing front tooth, I’m super excited I will share a photos of my first tooth tomorrow",
            "score": 4,
            "replies": []
        },
        {
            "author": "violetascension",
            "body": "I had similar problems with my teeth years ago. I'm not sure if my recommendation is going to definitely work for you, but honestly consider getting dental work done in Argentina. I live in UY and I had a bunch of dental work done the first year I moved here and it was comical how overpriced the US is. They use the same medical equipment, lasers and all that. I also wound up doing Invisalign and even the boxes they came in were from the US manufacturer, just at a fraction of the cost. Ridiculous.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tricky-Maize-1261",
            "body": "Check out dental and medical tourism in Mexico.  I was amazed at the quality and savings when I had surgery there",
            "score": 3,
            "replies": []
        },
        {
            "author": "LeapinLizards27",
            "body": "I wouldn't bother with fixing them at this point - I'd do implants. My spouses just did a whole-mouth of implants and he has had no complications. He loves them. They were expensive, but worth it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Graduate202",
            "body": "I'm so sorry I know the feeling dental work is expensive and you can struggle take it from someone who has 2 different insurances.. have you thought of getting a payment plan",
            "score": 2,
            "replies": []
        },
        {
            "author": "brandiinindy",
            "body": "I'd wait to see what the dental school says. I did this two years ago and went every week for 2 months for the most urgent issues and then monthly for about a year to get all the work I needed done. It cost 1/3 of what it would elsewhere (in the US). They also aren't there to upcharge. For example, some things another dentist had said would be a more complex procedure, just needed a filling. The students work with dentists with decades of experience so you get the best of both worlds. \n\nThey were also the kindest dentists I've ever been to. My students were also pretty experienced. My regular student dentist had been a dental assistant for 15 years so fillings were something she did regularly. My endodontist was a general dentist of a decade going into a specialty and had done plenty of root canals.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Secure_Spend5933",
            "body": "I would advocate for care from a trusted professional close to home.\n\n\nThe total ticket might be quite a high number but the work will be in phases.\n\n\nAs you consider your potential annual contribution, are there any Canadian tax benefits? Do you have anything like an HSA? \n\n\nI had adult braces, a jaw surgery and an implant, most was not covered by my insurance. The total cost was quite high but the full treatment plan took a few years. I'm so thankful to my trusted providers and to my past self for being brave and saying yes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Caffeine_Induced",
            "body": "My husband got a lot of dental work done in Mexico. Thankfully we live a few hours away from the border and we speak Spanish, so it was pretty easy for us. I know a lot of people doing the same thing, don't be afraid of using Mexican dentists, try to talk to someone who has seen the particular doctor you want to use, and see if they recommend them.\n\nGood luck!",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdhesivenessFew7443",
            "body": "I completely understand what you’re going through because my mom went through a very similar situation. She struggled with dental issues for years, just trying to keep everything together. Every time she fixed one problem, another one would come up. We spent thousands of dollars, but it always felt like a temporary solution.\n\nEventually, she was told she needed a full-mouth restoration with implants and everithing, but the prices in the U.S. were just insane. We started looking into other options until a friend of her recomended a place in Colombia. At first, I was very hesitant about her going abroad for it, but after doing some research, she convinced me and she decided to go for it. Sadly I coulden't travel with her but luckly everything went great.\n\nShe got the All-on-4, and it completely changed her life. The quality of care was incredible, and the team made the entire process so easy. I think she ended up paying like 12,000 usd including the hotel stay and evrything.\n\nI know how overwhelming this all feels, but I promise there’s a light at the end of the tunnel. If you want, I can help connect you with them so you can get a second opinion and see if they can help you too",
            "score": 2,
            "replies": []
        },
        {
            "author": "Edgimos",
            "body": "Have you thought about dentures? I mean at that point if it’s every tooth maybe you have to just replace the whole thing. \n\nAlso you said you’re in Canada? Don’t you guys have NHI? Like why’s it charging you? Also there’s a city in mexico where the entire city near the border of arizona is known for dental tourism and lost if ppl go there. There was even a documentary about it. (Don’t remember the city name sorry) \n\nBest of luck op",
            "score": 3,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "Dental isn't covered in Canada, except in very specific instances (elderly people and extremely low income people without insurance). \n\nThank you for the suggestion, I will look that up!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ok-Alarm-5476",
                    "body": "Los Algodones, entrance is actually in California. You're right though about so many people traveling there to get dental work. 400+ dentists work there, many optometrists too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kit0000033",
            "body": "I also have an autoimmune disease and dry mouth... Took me arguing with the dentist for about twenty minutes to get them to agree to extract my full top arch... Which were all broken and cavity filled... They wanted to do partials and only agreed because I stressed I didn't have that kind of money... Took them three hours to extract all my top teeth and about four weeks of eating soft foods before I could eat again. Cost my insurance $2500 and me $2.80.",
            "score": 2,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "I'm so glad you got to make that decision. I might see if I can start with one arch too, my bottom is a lot worse than my top.    \n  \nAll my dentists are pushing crowns/more fillings instead of extractions, big time. One even said \"Are you married? Would your husband really like to see you in dentures?\". It's awful, especially after putting so much time, effort and money into trying to save my teeth.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kit0000033",
                            "body": "People are really weird about dentures in other people... My gf had a car accident she was lucky to survive and ended up with no teeth at a young age. She doesn't like her dentures so doesn't wear them. She had a medical doctor at a regular doctor appointment once ask her if she wanted to be accepted by society or not because she wasn't wearing them. She was speechless and came out of that office crying. We're just lucky I wasn't in that appointment with her or I'd have been arrested.\n\nAnyways, the dentists are just looking for their 80k payday, not looking at what is best for you. My autoimmune makes it so implants aren't feasible, but that other person talking about how good their implants are makes me kinda jealous.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "smalltownmama33",
            "body": "I was quoted 6 g to root canal three teeth and crown/ bridge. I had the teeth pulled and a partial for about 1800. And I haven’t had issues since. I’m not sure why dentists try soooooo hard to save teeth, especially to the tune of 10’s of thousands",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefiantDriver7484",
            "body": "Can't you travel to India since you are already considering Mexico? It's lot cheaper.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkFaithlessness3729",
            "body": "Not sure your details, but there is an amazingly supportive women’s group on Facebook about dentures & implants.  They have so much helpful information on options, costs, etc.  DM if you want more info.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpiritualWarrior1844",
            "body": "OP, is this something you can space out over time ? For instance do a few implants per year or does it not work that way and has to be all done at once ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Preparation_3069",
            "body": "I have sjogrens disease, and it is a daily battle with my teeth.  Sorry you are going through this, and that the american healthcare system is such hot garbage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ROBOTCATMOM420",
            "body": "Yeah I have to agree with the dental school too. The time put in there is probably about the same you’d have to use to go to another country.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hillydanger",
            "body": "Crowns could be covered up to 50% with insurance. Have you inquired with insurance? \n\nI was in a similar situation, but always assumed insurance wouldn't cover it. They actually covered like 80% of the cost for me.",
            "score": 1,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "My insurance caps out at $2000/year -- and I've already used it with fillings. I wish it was more, it's such a small amount compared to how much dentist visits cost.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Clean_Deer_8566",
            "body": "dentures cost me $2500 and thats them pullin my rotten teeth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jjscraze",
            "body": "Teeth suck so bad… \n\nNever, ever get this type of work done by a dentist that’s not recommended to you. Especially abroad. \n\nThere’s no way for us to know whether you really need the root canals or not, likely though it makes more sense to go for implants if you need crowns on all your teeth - in the long run. \n\nIf you get them all pulled and get dentures, you could have time to save up for implants. I know some people who did dental tourism and for 1/2 of a jaw done in one go, so I would not panic right away at the full cost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnclaimedWish",
            "body": "Oh I’m so sorry. Such a difficult situation. Have you also checked for medical tourism in Malaysia and Turkey for dental restoration.\n\nMexico is not as cheap as it used to be and most full time Nomad’s I know have work done in either of those places instead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Drink8004",
            "body": "I need an implant and a partial . I’m nervous to even ask what that would cost.  I’m prob not going to get them done. I already know an implant is at min 4- 5,000 alone.  What is your diet like since you have autoimmune issue? .  Diet plays a big role.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheapdvds",
            "body": "I am not familiar with hyperthyroidism, but that shouldn't cause decay of the teeth right? How are you doing with dental hygiene? Are you using mouth wash every single day and floss? Wouldn't improving dental hygiene decrease the odds of decay as well as lower occurrence of pain and make things cheaper for you?",
            "score": 1,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "When it's not properly medicated Graves Disease causes severe dry mouth, which significantly increases the risk of tooth decay. I've been really disciplined with my regiment -- I floss every night, use a waterpik, use high fluoride toothpaste and a high fluoride mouthwash. I also have a spray for dry mouth to use at night, and I use a mouth guard. I also don't drink soda or smoke. \n\nIt's one of those unlucky genetics/disease things -- if I had to do it again I would have probably started getting  crowns earlier  instead of multiple fillings on each tooth. I just didn't know it would keep getting worse.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ToofPimp",
            "body": "I can’t diagnose you over redit\n\nI just came here to say for the love of god do not “just extract your teeth and get dentures” and do not “go to Mexico” for dental care. \n\nHave your dentist phase your treatment starting with the worst teeth.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Shayshay4jz",
            "body": "Sjogrens is terrible, they have some good info in the subreddit. Also the Sjogrens syndrome foundation is a good source of info.",
            "score": 0,
            "replies": [
                {
                    "author": "Tall-Advance2523",
                    "body": "I have Graves Disease, but untreated it causes similar symptoms. It absolutely sucks!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Shayshay4jz",
                            "body": "I have Graves aswell as Sjogrens. Thyroid eye disease is terrible I hope you can get some relief!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "NeedYourHelp712",
                            "body": "honestly your best bet are probably to have ur teeth pulled and get 3 on 6’s … there cheaper then getting all single implants but u get to use ur real gum line and they use fake teeth on 3 posts. this is perfect for u it sounds like. if u spent 30k and still need work ur teeth are no good and are gonna continue to cause u problems my friend. spend the 25k n rid urself of any pain or anxiety in the future and get a new set of teeth n carry on worry free. thats seriously ur best option.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bianceziwo",
            "body": "Try turkey. You can get a full set of new, perfect teeth for cheaper than that",
            "score": 0,
            "replies": []
        },
        {
            "author": "abhishekdutta405",
            "body": "Pls visit India. Root canal costs around 100 USD\n\nIf you need more details, you can DM me",
            "score": 0,
            "replies": []
        },
        {
            "author": "snow-haywire",
            "body": "Hello fellow dry mouth sufferer.\n\nIf the university route doesn’t work out for you, when I started having tooth issues I had a consultation with a very well respected dentist and he said if we had to go the denture route, permanent dentures would be the best course of action and easier to manage for me. It involves implants and anchors.\n\nHowever, my previous dentist to him was horrific and I didn’t need the amount of work I was told.  I got out with one tooth extraction, and one implant.  Took a year from start to finish and I couldn’t have hoped for a better outcome.  I’m very happy with the implant.  \n\nDo not get crowns and root canals.  Those are just pushing problems down the line.",
            "score": -1,
            "replies": []
        }
    ]
}