{
    "title": "McDonalds can suck an egg...",
    "author": "Slight-Garlic534",
    "subreddit": "povertyfinance",
    "rank": 3,
    "score": 817,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 133,
    "url": "https://www.reddit.com/r/povertyfinance/comments/1je5kxp/mcdonalds_can_suck_an_egg/",
    "id": "1je5kxp",
    "selftext": "So I go to McDonalds once or twice a week (If I can afford to) to get a large Vanilla Iced Coffee because in my area you can get any size coffee for $1.99. It's way cheaper than anywhere else (besides doing it at home in the long run, i know, i know)...even from some gas stations! I also get an extra pump of vanilla for a 40 cent upcharge. This past week, they are running a promotion of any sized Iced Coffee for $1.79...sweet, 20 cent off!\n\n This morning I ordered my usual large Iced coffee with and extra pump of vanilla and do you know those dirty bastards raised the price of the extra pump of flavoring from 40 cent to 90 cent? Guess they had to make up for the \"promotion\" price somehow. Assholes....",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This post has been flaired as “Vent”.  As a reminder to commenting users, “Vent/Rant” posts are here to give our subscribers a safe place to vent their frustrations at an uncaring world to a supportive place of people who “get it”.  Vents do not need to be fair.  They do not need to be articulate.  They do not need to be factual.  They just need to be honest.\n\nUnlike most of the content on this subreddit, Vents should not be considered advice threads.  In most cases it is not appropriate to try to give the Submitter advice on their issue.  In no circumstances is it appropriate to tell them “why they are wrong” or to criticise them, their decisions, values, or anything else.  If there are aspects of their situation that they are able to directly address themselves, the submitter can always make a new thread with a different flair asking for help once they are ready to tackle the issue.\n\nVents are an emotional outlet, not an academic conversation.  Appropriate replies in these threads are offering support, sharing similar experiences/grievances, offering condolences, or simply letting the Submitter know that they were heard.\n\nAs always, if there are inappropriate comments please downvote them, REPORT them to the mods, and move on without responding to them.\n\nTo the Submitter, if you DO want discussion to be focused on resolving your situation, rather than supporting you emotionally, please change the flair of this post, and then report this comment so we can remove it.  Thank you.\nThank you all for being a part of this great financial advice and emotional support community!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/povertyfinance) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThaShitPostAccount",
            "body": "What if I told you a whole bottle of Vanilla Syrup at Walmart was $5?  That's 20¢ per pump.  Put it in your glove compartment and doctor your coffee yourself.",
            "score": 680,
            "replies": [
                {
                    "author": "SomeHyena",
                    "body": "I've found bottles of different syrups at Ross for under $3...",
                    "score": 127,
                    "replies": [
                        {
                            "author": "No_Adhesiveness_7590",
                            "body": "I always learn something new in this subreddit",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Quinzelette",
                            "body": "I believe the ones at Ross that are $3 are sugar free. At least the ones at TJ Maxx and Marshalls are. I can't use SF syrup as it instantly gives me a headache. Torani & Monin (the two syrups most coffee shops use) are $7.50-$8 a bottle at TJ Maxx and Marshalls and are the only full sugar syrup brands they sell.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SomeHyena",
                                    "body": "Depends on the Ross, I suppose. I generally try to avoid sugar-free things because, like many other people, they make me gassy. While a lot of the mixer things that I've seen it Ross are definitely sugar-free, I have 100% found standard vanilla syrup there. Ross sells a lot of overstock merchandise from other retailers, so it definitely would make sense that what they offer from one region to the next might differ a bit. As well as what they offer from one month to the next",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "crave_you",
                    "body": "I use stok blonde iced coffee and torani vanilla syrup and it makes a better iced coffee than I have gotten anywhere else.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "coffeebuzzbuzzz",
                            "body": "I used to be addicted to Stok.  I drank a bottle a day, which ended up being $200 a month.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Money_Ease6974",
                                    "body": "wow !",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "coffeebuzzbuzzz",
                                            "body": "I save money by taking coffee home from work now.  I work at McDonald's and we dump out any leftover iced coffee at the end of the night, so I just take it home(black, I add my favorite creamer at home).",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Own_Experience_7912",
                                                    "body": "good idea",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stopsallover",
                    "body": "You can make simple syrup on the stove and then drop half a vanilla pod into the bottle as it cools.\n\nI know it's something of a joke that making your own coffee adds up to big savings but it's becoming more true all the time.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Aurora--Black",
                            "body": "It's more true now than it used to be",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "stopsallover",
                                    "body": "It still always did add up. I got out of the cycle of paying late fees most months by first keeping $50 saved. Not buying coffee out was part of that. \n\nIt's more a hack to be less poor than it will get you rich.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mind8mischief",
                    "body": "Yup! I try to find cheap sugar free syrups at places like home goods, Ross, Marshall’s, or Tj max. Great brands too! Just forgotten and discounted. Obviously I check the expiration dates. But I do this too, I make my coffee everyday at work to save money. On the weekends I treat myself to cafe boughten coffee w/ that cafe tasting syrup. Coffee, It’s such an expense!!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "twistedscorp87",
                    "body": "I bought that Vanilla Syrup stuff recently, thinking it'd be a nice flavor upgrade since I gave up the flavored nondairy creamers I used to use...\n\nThe flavor is super weak and you have to use a ton before you even taste it a little.  The bottle is pretty convenient though, so I'm going to refill it with a homemade one with stronger flavor.  Probably costs less than buying it, I was just being lazy.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jkurratt",
                    "body": "Wait till they find about brewing your own coffee.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alive-OVERTIIME-247",
            "body": "That's crazy! Not to make you feel worse but my McDonald's vanilla iced coffee is only 99¢ in the app.",
            "score": 477,
            "replies": [
                {
                    "author": "Lori_ftw",
                    "body": "Yup, and you still get points so you can get free ones over time.",
                    "score": 123,
                    "replies": [
                        {
                            "author": "badskinjob",
                            "body": "Come on guys, he already feels bad enough today.",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Pluperfectt",
                                    "body": "😂",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Public-Somewhere8727",
                    "body": "Same, .99 and the extra pumps are free",
                    "score": 77,
                    "replies": [
                        {
                            "author": "FoolOfATook916",
                            "body": "*one pump, one cream*",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "Public-Somewhere8727",
                                    "body": "don't judge me but 3 extra pumps, normal cream",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "badskinjob",
                                            "body": "Sounds like my last relationship",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "coffeebuzzbuzzz",
                            "body": "I work at McDonald's, the extra pumps are not free.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Public-Somewhere8727",
                                    "body": "I think it varies by location + dependent on app use. It's free for me in my local store in Ohio. I use the .99 mobile app deal and then customize it, it's still 0.99. Used to be able to get \"iced caramel mocha coffee\" as part of that deal too, that thing was amazing.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Slight-Garlic534",
                    "body": "https://preview.redd.it/24wzwb20pgpe1.jpeg?width=320&format=pjpg&auto=webp&s=f87e65e6be5805ecac85a0962ff2f5bfc3b74dd9",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Slight-Garlic534",
                    "body": "Not in my area. These are the only deals that are currently on my app.\n\nhttps://preview.redd.it/tobi176uogpe1.jpeg?width=320&format=pjpg&auto=webp&s=6d9f01d4553c85087c0ec75917970bfdffc901f8",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Hot_Photograph5227",
                            "body": "Sometimes specific locations/management remove deals they think they're losing money on",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "coffeebuzzbuzzz",
                            "body": "Are you using your app every time to get points? It keeps track of what you buy and gives you deals based on your history.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SBSnipes",
                            "body": "Perhaps it doesn't show as an \"App exclusive\"?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Slight-Garlic534",
                    "body": "https://preview.redd.it/xn5kf1f2pgpe1.jpeg?width=442&format=pjpg&auto=webp&s=ce485cc0e61c03ccda55c94f806327ab1b6718d2",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Outside_Holiday_9997",
                            "body": "Weird.  Mine is .99 too...and it's automatic before 11am so you can use the deal on something else.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "yupuhoh",
                                    "body": "1.29 coffees in my local one in the morning. So far no upcharge for the wife's 5 cream 5 caramel hold the coffee please. \"Coffee\"",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "saloondweller",
                            "body": "It only shows up when you order it, add it to your cart and you'll see the deal. Its not on the deal page it's one of the deals you see at cart like how they do the 2 for x amount hashbrowns etc",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Appropriate_Ratio835",
                            "body": "I tried. Mine is $2 for any size but the extra pumps are free.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BadReview8675309",
                    "body": "The app is great for little things on the regular but sometimes it's a big value... My area was handing out 10 piece $1 nuggies every time I turned around for weeks. The receipt with the survey always gives a free sandwich if you buy one in my area and I just write a random 8 digit number on the receipt for the survey completion code because they never verify at the counter that it's actually real.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "EliRiots",
                    "body": "I've cooled on the app, used to use their \"coupons\" constantly but it seems now that the good ones are all for delivery only (which defeats the purpose, considering delivery fees and all)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "rapidecroche",
            "body": "Use the app, you’ll save money and have free fries on Fridays.",
            "score": 77,
            "replies": [
                {
                    "author": "bellabarbiex",
                    "body": "Points add up rather quick too - even if you don't go super frequently. They also do double points in the mornings. Where I live, if our hockey team scores in the first round, you can get a free fry as well. I got a free sausage, egg and cheese bagel right after they were re-released. The app is so worth it.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Slight-Garlic534",
                            "body": "I didn't even think about the points aspect! I use the app for the excusive deals sometimes...like for the free fries or the 40% off a double cheese burger. I can get double points ordering my coffee off the app?",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "bellabarbiex",
                                    "body": "Yes. It's down at the bottom of the deal section. It's double points from between 5:00 a.m. and 10:30 a.m. on weekdays.\nEdit: I hope it's not location dependent but I've been to several different locations in my area and they offer it.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Slight-Garlic534",
                                            "body": "Oh ok! Thanks for the info!",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Slight-Garlic534",
                    "body": "It won't save me money because the app doesn't have specials on coffee drinks in my area. It would get me points tho...I didn't think of that",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "sunshineandcacti",
                    "body": "McCafé Monday sometimes too! Idk if it’s regional or not. I always get a kids fry and drink as my special treat lmao.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sailor_Chibi",
            "body": "Corporations almost always win in the end. They get your money somehow.",
            "score": 60,
            "replies": [
                {
                    "author": "paloaltothrowaway",
                    "body": "Nothing is stopping OP from making coffee at home if they don’t want to give money to McD",
                    "score": -7,
                    "replies": [
                        {
                            "author": "Sailor_Chibi",
                            "body": "Even poor people deserve to have treats, you know.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "paloaltothrowaway",
                                    "body": "So don’t whine about how corporations “win” in the end if you willingly pay for the convenience",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "Slight-Garlic534",
                                            "body": "I don't get it enough to justify buying the stuff to make it at home. I rarely get one twice a week...2 bucks a week isn't a huge expenditure",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "drpepper1992",
                                            "body": "What convenience are they paying for? They are receiving the same flavor shit, only the price has increased",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Inorashi",
                                                    "body": "The convenience of paying someone else to prepare it for them.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "drpepper1992",
                                                            "body": "That’s the same convenience as before, but with extra cost",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Inorashi",
                                                                    "body": "Yeah, that's inflation.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "According_Gazelle472",
                                                    "body": "Lol.and they will still keep buying it .",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "paloaltothrowaway",
                                                    "body": "Don’t buy it then if it’s not worth the price. \n\nHowever, OP said they only got it once a week and it’s just not worth to make it at home. So clearly it’s still worth it to the OP",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "According_Gazelle472",
                    "body": "And you can bet on that one .",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "expertninja",
            "body": "A 15$ bottle of Torani vanilla  syrup will last a year",
            "score": 38,
            "replies": [
                {
                    "author": "MyNeighborThrowaway",
                    "body": "You can get them for 7$ at TJMaxx too",
                    "score": 14,
                    "replies": [
                        {
                            "author": "OutrageousIce307",
                            "body": "Fashionista shout out!! Love TJ’s",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Slight-Garlic534",
                            "body": "Sadly, no TJ maxx....closest one is 45 mins away",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "MyNeighborThrowaway",
                                    "body": "I nabbed the 2 pack from Amazon once, just depends on price!",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Expert_Conclusion232",
                                            "body": "nice ...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LilBearLulu",
                                    "body": "Marshall's sells them cheaply, too.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "According_Gazelle472",
                            "body": "Ours was on clearance for 3 dollars a bottle .We stocked up on it and make ours at home now .",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Get_Back_Loretta_USA",
                    "body": "Cheaper and healthy option: Simple syrup. Less than a dollar for ingredients. May last up to a month if store properly.  I store the simple syrup in the fridge in a short glass mason jar.\n\nOne cup sugar and one cup water. Bring to a very slow and low boil until the color starts to turn light brown and thickens. Maybe 5 - 7 minutes. Keep stirring. If you take your eye off it, it will over boil, make a mess and harden into hard candy. So go low and slow. Take it off the burner to add 1 teaspoon to 1 tablespoon of vanilla extract or extract flavor of choice. No open flame. Some extracts have boozy alcohol. No fire starter here! \n\nNo added chemicals, stabilizers or artificial flavors. I bet you have both a 1 cup of sugar and a tablespoon of vanilla in the house. Maybe add a 1/2 dash of cinnamon and nutmeg during the Winter months. You can use organic sugar and/or extract, if you like. Enjoy! 😊\n\nDuring the holiday, make a batch and put the simple syrup in pretty capped bottles from Micheal’s, Dollar Tree or Hobby Lobby for your coffee drinking friends with a big bow. ☕️🎀",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Slight-Garlic534",
                            "body": "Great idea. thanks!",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Casswigirl11",
                    "body": "They always taste a little chemically to me. Is there a good flavor?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "expertninja",
                            "body": "I think the 1883 syrups are rated better  but I’ve never tried them since I’m not fancy like that.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "sunshineandcacti",
                            "body": "The Carmel one is nice. I usually splurge and buy the Starbucks branded flavors for my at home coffee bar though.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "bubblebath_ofentropy",
                            "body": "Monin brand syrups are what’s often used commercially, a little pricier but less chemical taste IMO.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bubblebath_ofentropy",
                            "body": "Monin brand syrups are what’s often used commercially, a little pricier but less chemical taste IMO.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mysterious_Fennel459",
                    "body": "Where are you at that you're paying $15 for a bottle of that? Everywhere around me charges $7.99 at most for Torani.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "coffeebuzzbuzzz",
                    "body": "You can get syrups off Amazon for cheap.  They come in so many more flavors than what's at the store too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "1-RN",
            "body": "Started buying syrups at Marshall’s/TJ Maxx for like $7/bottle (half price) and now make my own foofy coffee at home. Stick it to them!",
            "score": 9,
            "replies": []
        },
        {
            "author": "xLoveMeDo",
            "body": "I've noticed the prices vary a ton on the coffee depending on which area you go to. Also the amount they charge for the extra pumps varies too. If I go to the one near my house an extra pump of caramel is free but if I go to the one near my work which is a HCOL area, it's an extra 25 cents. All of the food there is 50 cents or a dollar more. Crazy.",
            "score": 5,
            "replies": [
                {
                    "author": "Inevitable_Road_7636",
                    "body": "Yup, comes down to who owns the place and what they set for prices.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sunshineandcacti",
                    "body": "Also check on your app to see if they have the free café item on Monday.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jeuster23",
            "body": "Just buy a vanilla bean for 5 dollars and open it up into equal parts sugar and water. And that’s a gallon of vanilla syrup for very cheap. You can use bits of the bean to make smaller batches as they only last about a month in the fridge. enjoy.",
            "score": 7,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "I made vanilla extract that way .Vanilla bean and vodka .Makes great extract.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "twbird18",
            "body": "Look sometimes you just want to get your coffee while you're out & it's a treat we understand. Sucks big time. \n\nVanilla syrup takes \\~5 min to make at home. It lasts for ages if you keep it in a clean jar & don't contaminate it. Make some & keep a small container in your car or bag, save your money. Don't pay these jerks.",
            "score": 16,
            "replies": []
        },
        {
            "author": "JollyMcStink",
            "body": "Tbf idk where you are but lots of gas stations have decent coffee near me and granted you have to make it yourself, but it's still +/-$2 and it's better tasting than the instant I make at home (living alone no sense making a whole pot of coffee and I don't feel like french pressing every single cup, so instant it is lol)\n\nThe gas stations usually have decent deals on coffee with buttered hard roll or breakfast sandwich combos too, if you're willing to treat yourself it's still cheaper than most fast food but way fresher.\n\nIdk just a suggestion if you're now seeking alternate options.",
            "score": 4,
            "replies": [
                {
                    "author": "elcasaurus",
                    "body": "We invested in a Keurig and reusable cups so we can use regular grounds. Solves the \"i only want one cup\" problem completely and has paid for itself a million times over. Even cheap aldis grounds are leaps and bonds better than prepackaged k-cups. Works great if you can swing the up front cost or find one used somewhere.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "likethemovie",
                            "body": "I got my Kuerig for like $20 on a Walmart Black Friday sale. My mom is more frugal than me and finds then occasionally at local thrift shops. 100% agree on getting the pod where you can use your own grounds. Tastes better and it's less waste.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "sunshineandcacti",
                                    "body": "FB marketplace is a good place for these as well! I’ve gotten a nespresso, kureig, barista, and soda stream for $50ish total from different people. I just make sure to scrub it super well and disinfect before using it",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sunshineandcacti",
                            "body": "https://preview.redd.it/0ce7fmuppgpe1.png?width=1982&format=png&auto=webp&s=f1e7de4458d34439c48e54503bb23d4b172029f5\n\nI have a nespresso and recently scored a whole shoe box of pods from a coworker who’s moving and didn’t want to toss them!",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "JollyMcStink",
                            "body": "Thanks for the suggestion! What kind of reusable pods do you use? I ask because while I'd prefer ones made without plastic, it kinda is what it is bc I'm also not tryna spend tens of dollars on reusable pods either 🤷‍♀️ lol",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "elcasaurus",
                                    "body": "I do use cheap plastic ones from Amazon but they're very reusable, we've had them 2 years now and they're not even sort of worn out. I have one stainless steel one but that was more expensive, but by expensive I mean $15 for one. I found mine on Amazon but I've seen them in grocery stores too.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mumblerapisgarbage",
            "body": "The 30 % off disappeared last year and last month the 25% off disappeared in the app.",
            "score": 3,
            "replies": []
        },
        {
            "author": "effervescentpony",
            "body": "I want to know how to dupe the frappes. It’s up to like $4.99 for a medium one. Absolute insanity.",
            "score": 5,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "It's 7 dollars where I live .We make our own frappe with a  blender. It saves so much money .",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HypnoticCat",
            "body": "Yooo. I can totally see this if it’s a franchise. They probably had to run the promotion because of corporate but as soon as it was over; the owners probably wanted to make it back quickly.",
            "score": 3,
            "replies": [
                {
                    "author": "According_Gazelle472",
                    "body": "Taco Bell had a killer Cinnabon iced coffee for 2.25.It was very profitable but they found out thaf people were only buying them instead of the food.They completely discontinued it in all of the franchises .",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Revolutionary-Chip20",
            "body": "Just saying. My local mcds, an extra slice of cheese went from .30 to .70 a slice ... It's over 5 dollars for 2 cheeseburgers extra cheese for my son now.",
            "score": 5,
            "replies": [
                {
                    "author": "Qu1ckN4m3",
                    "body": "I'm not a huge fan of cheese on hamburgers. But they leave me no options... At places like McDonald's. So, I'm constantly having to pay for cheese that I'm not eating. So outside of their kids meal sized hamburger you really can't get a burger that doesn't have cheese. I don't know how many times I've said no cheese and they still put cheese on my burger. And I get it; it's weird to order a cheeseburger without cheese. \n\nI tend to eat at Burger King more, because they have no cheese as the default setting. I wish there was a cheese donate button so that I could donate all my cheese to your son. Or you know they lower the price when I remove cheese from my hamburger.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "UniqueIndividual3579",
            "body": "Sunday I almost got a quarter pounder meal. It was $12.50 in the app. So I checked Red Robin takeout, $9.99 for a Tavern Burger and steak fries. If I ate in, the drink would bring it to the same price, but you get bottomless steak fries. Compare that to McD's that holds the fry box sideways and barely fills it a 1/3 of the way. Texas Roadhouse cost the same as McD's, but you could sub the fries with just about any other side with no upcharge, and you got the rolls. \n\nMcD's was built on \"good, fast, cheap\", now they are none of those. I have spent 40 minutes in the drive thru with only five cars in front of me.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BIBLICALTHINKER2",
            "body": "Try the app bro",
            "score": 6,
            "replies": []
        },
        {
            "author": "sunshineandcacti",
            "body": "Also don’t forget the app has McCafé Monday! There’s usually a free cafe item including the fancier oc d drinks if you spend $1\n\nI used to thrive on a kids fry and iced latte for a weekly treat.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DeliciousFlow8675309",
            "body": "Meanwhile my McDonalds barely runs specials and no fucking way are you getting an ice coffee *with flavoring no less* for that cheap! \n\nIt's $3 for an iced coffee and $4 for a frappe around here.",
            "score": 3,
            "replies": [
                {
                    "author": "Slight-Garlic534",
                    "body": "https://preview.redd.it/cs0vxysougpe1.jpeg?width=370&format=pjpg&auto=webp&s=8b5c7f326bde34cb21436daff00f1598442a8db2\n\nPlus that's for any size Iced Coffee and as I said in my post, right now they're 1.79....Sorry about where you live...",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mysterious_Fennel459",
            "body": "You can get a large iced coffee for $1 if you use the app. It's the only thing left I get at Mcdonalds after they dropped the $1 large fries offer.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kieko89",
            "body": "Large Caramel iced coffee is $0.99 when using the app at McDonald’s",
            "score": 3,
            "replies": []
        },
        {
            "author": "Desperate_Guess_6201",
            "body": "TIL that McDonald's iced coffee prices vary regionally by a significant amount. They're $2.79 where I'm at, so I never get them unless I have points 😵‍💫",
            "score": 3,
            "replies": []
        },
        {
            "author": "Long_Presentation793",
            "body": "Everyone has to reduce the frequency of their McDonalds visits. We can’t completely stop but we need to make them feel.",
            "score": 5,
            "replies": [
                {
                    "author": "iekiko89",
                    "body": "Why can't they completely stop? I haven't been in years and have never gotten a coffee from them",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "No_Goose_1774",
                    "body": "I haven’t went since before the McRib last year. I didn’t realize they were operating restaurants on occupied land.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Coffee_And_NaNa",
                    "body": "They won’t it sucks so hard",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nighthawk68w",
            "body": "This is an odd topic for a povertyfinance page.",
            "score": 5,
            "replies": []
        },
        {
            "author": "aimerj",
            "body": "Doing it at home would pay for your coffee habits in like a month. That's not \"the long run.\" \n\n\nIf you get some dopamine from a mcdonalds coffee, more power to you. But this purchase borders on irresponsibility when talking in a \"poverty\" sub. Fwiw",
            "score": 5,
            "replies": []
        },
        {
            "author": "rideadove",
            "body": "I bet you go more than once or twice a week.",
            "score": 10,
            "replies": [
                {
                    "author": "Slight-Garlic534",
                    "body": "First off, it's rare that I even go get one twice a week. I don't drink coffee like that...matter of fact, I don't drink coffee at all at home\n\nSecond off, do you fucking know me? Have we met? I hate when people like you assume the worst of everyone else just because you do shit like that IRL and expect everyone else to, too....",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dependent_Poet_7401",
            "body": "On my app large vanilla iced coffee is $2.99 with an extra pump for $.50 🤨",
            "score": 2,
            "replies": []
        },
        {
            "author": "strange-brew",
            "body": "Well, McDonalds coffee is so bad that you have to add sugary syrup in order to drink it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "hangingsocks",
            "body": "Why not just buy a bottle of vanilla syrup, keep in your car and add in? At .90 a pump, will def save you money!",
            "score": 2,
            "replies": []
        },
        {
            "author": "bucketofnope42",
            "body": "You can buy a bottle of vanilla syrup and flavor it yourself. They're like $7 for 1ltr of the stuff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Goose_1774",
            "body": "McDonalds in my area has started charging a quarter for a cup of water. They actually went back to the first window and ran my card for a quarter when I asked for a cup of water at the second window",
            "score": 2,
            "replies": []
        },
        {
            "author": "AdAffectionate3143",
            "body": "Cheaper than making at home?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Embarrassed_Lab7320",
            "body": "Bro save your money and make your ice coffee at home.  Just prepare coffee night before, add your sugar to taste,  cool in fridge. In the morning add what ever flavor you want. 1000% better than McDonald's  and vastly cheaper",
            "score": 3,
            "replies": []
        },
        {
            "author": "SillyWoodpecker6508",
            "body": "I stopped eating at McDonalds a long time ago",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mrwoogy01",
            "body": "Just a FYI you can get any size hot or iced coffee for .99 on their app",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourEvilHero",
            "body": "Probably just your location. My local location is 99 cents for any size with the app. All pumps are free, except espresso for 0.59 still beats dunkin and Starbucks $1.50 for an espresso shot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shoddy_Training_577",
            "body": "Lol I never buy their drinks. Whenever I'm feeling thirsty I'll just buy their ice-cream cone instead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Bat3062",
            "body": "\" (besides doing it at home in the long run, i know, i know) \" oh c'mon, you're BARELY treating yourself once or twice a week, you deserve it!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lost-in-EDH",
            "body": "The right sub for this post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DOG_DICK__",
            "body": "Man I like my espresso machine. No idea what the cost per drink is but it's less than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToughCollege8627",
            "body": "Don’t eat McDonalds. Its not good for anyone. Financially or nutritionally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "purpleb00ty420",
            "body": "Not only is McDonald's over expensive, but you should also be boycotting them. I don't expect you to understand that though given the fact half of Americans are ingnorant",
            "score": 0,
            "replies": []
        },
        {
            "author": "Nedstarkclash",
            "body": "Why don't people make coffee at home?",
            "score": 0,
            "replies": []
        },
        {
            "author": "HanCholo97",
            "body": "McDonald's twice a week?? No wonder you're on this sub. Make food and especially coffee at home. No extra 90 cents for vanilla there.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Intelligent_Month294",
            "body": "ive been boycotting mcdonalds for about a year or so and pretty early on it was evident they were taking measures to prevent losses. they sent countless emails trying to promote/give specials so people would keep going. a few weeks ago, i did give in simply bc id spent the night with some friends & nothing else was open when i got up to go home - 4-5am. one steak mcgriddle meal cost me around $11, i really wanted it but had me wondering if they raised the price on that too. \n\nwhen i used to go before, i always used the app so i never paid more than $5-8 for anything. (using points or promos but they werent as good towards the last few months i was actively going) anyways, yesterday i was working & wanted something quick (nothing around wouldve been ready to eat and/or have a bathroom) and the fries are like $4??? insane. i walked out. \n\ni shop at aldi for groceries & make sure to get enough snacks for the road so i dont feel the need to buy fast food. other expenses take priority sometimes so thats why yesterday happened, overall aldi has been great for affordable groceries for my partner & i and they have some pretty good selections for taste, dietary restrictions, etc. doing instacart put me on & ive also seen that food lion is pretty affordable too.\n\nin conclusion, mcdonalds can suck many eggs.",
            "score": 0,
            "replies": []
        }
    ]
}