{
    "title": "This sucks",
    "author": "BackgroundSleep4184",
    "subreddit": "povertyfinance",
    "rank": 7,
    "score": 118,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/povertyfinance/comments/1je68ro/this_sucks/",
    "id": "1je68ro",
    "selftext": "Sold my car last week to my moms friend for $410 (he said he give me $90 later) and was pretty happy. I put the money in my dresser drawer since it was like 3 am when they woke me up to do this. A few days later it's still in the drawer, I figured cool I'll use it towards my portion of rent and deposit it my next day off. \n\nToday I go to grab it and it's missing... I've searched the whole house, my car, my dirty clothes, everywhere... I've been crying for hours. I don't want to accuse anyone in my house of stealing it, but I don't usually misplace money. I always return found money as well! I found $50 in the break room at work and took it to the receptionist. Someone left their wallet in my car, I returned it next morning undisturbed. I'd feel better if it was bad karma! Either way, this sucks. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This post has been flaired as “Vent”.  As a reminder to commenting users, “Vent/Rant” posts are here to give our subscribers a safe place to vent their frustrations at an uncaring world to a supportive place of people who “get it”.  Vents do not need to be fair.  They do not need to be articulate.  They do not need to be factual.  They just need to be honest.\n\nUnlike most of the content on this subreddit, Vents should not be considered advice threads.  In most cases it is not appropriate to try to give the Submitter advice on their issue.  In no circumstances is it appropriate to tell them “why they are wrong” or to criticise them, their decisions, values, or anything else.  If there are aspects of their situation that they are able to directly address themselves, the submitter can always make a new thread with a different flair asking for help once they are ready to tackle the issue.\n\nVents are an emotional outlet, not an academic conversation.  Appropriate replies in these threads are offering support, sharing similar experiences/grievances, offering condolences, or simply letting the Submitter know that they were heard.\n\nAs always, if there are inappropriate comments please downvote them, REPORT them to the mods, and move on without responding to them.\n\nTo the Submitter, if you DO want discussion to be focused on resolving your situation, rather than supporting you emotionally, please change the flair of this post, and then report this comment so we can remove it.  Thank you.\nThank you all for being a part of this great financial advice and emotional support community!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/povertyfinance) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "billyRayWonka",
            "body": "What crack house are you living in?",
            "score": 108,
            "replies": [
                {
                    "author": "Future_Dingo_5309",
                    "body": "lol !",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "mredding",
            "body": "> I put the money in my dresser drawer since it was like 3 am when they woke me up to do this.\n\nOk, sure...\n\n> A few days later it's still in the drawer, I figured cool I'll use it towards my portion of rent and deposit it my next day off.\n\nWOAH! That sock drawer isn't FDIC insured.\n\n> Today I go to grab it and it's missing... I've searched the whole house, my car, my dirty clothes, everywhere...\n\nYou were stolen from. In your house. By someone you live with. Plain and simple.\n\n> I don't want to accuse anyone in my house of stealing it, but I don't usually misplace money.\n\nOh fuck you, stop this shit. You were stolen from, plain and simple!\n\nThis is not at all normal behavior, and I've seen it before. You've been gaslighted, probably your whole life. You doubt yourself, your sanity, your grip on reality. For the rest of us, this behavior of yours is frustrating to watch.\n\nIt's straight-fucking-forward. You put it in your drawer, and that's where it was. No, you didn't fucking drop it in the toilet. It was there, now it's not. Come off it.\n\nThat means someone in your house is a dirty fucking rat who thinks you're a stupid piece of shit, not anything more than someone who can be stolen from. They have zero regard for you.\n\n> I found $50 in the break room at work and took it to the receptionist. Someone left their wallet in my car, I returned it next morning undisturbed. I'd feel better if it was bad karma!\n\nYeah, your openly good conscious is easy to exploit. You're a mark. Whoever did it, they KNOW you don't want to accuse anyone.\n\n> Either way, this sucks.\n\nI hope you learn your fucking lesson and put a wad like that in a bank.\n\n> I figured cool I'll use it towards my portion of rent...\n\nI'd tell everyone in the house your rent was deposited in the pocket of a thief, that you consider the matter of your portion of the rent settled, and that it's up to the thief to cover your portion this month, since they have it.\n\nLet the roommates eat each other.",
            "score": 53,
            "replies": [
                {
                    "author": "-blundertaker-",
                    "body": "I used to leave my rent money in a kitchen drawer for my old roommates (they were the \"main\" tenants who paid the landlord). Not for long, they'd be at work and wouldn't be home by the time I left or whatever so I'd just shoot a text and let them know it was there when they got home. Apparently they had a sketchy friend over and came to me saying that my portion was short.\n\nI told them they better hit their buddy up then because he stole from \\*them\\*.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "mredding",
                            "body": "That's the exact right answer. The drawer is the exchange. The precedent is established. You informed them of the transfer. You met your obligation. It wasn't your friend in the house.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wonderful_Mix977",
                    "body": "Harsh words but I cannot disagree. They need to wake up and stop living in a world of magical thinking where everyone is honest, good and money sitting in an unlocked drawer can be left untouched around strangers. It's a rotten lesson and it sucks to live in this kind of world but looking back it's kind of obvious what could have been done to prevent this.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "No-Anxiety-7125",
                    "body": "Let them eat each other! \nI love it. i love your whole comment saying what we are all thinking about reading this. Sorry about your luck, but someone in your house is a dirty, rotten thief plain and simple.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok_Active_1435",
                    "body": "🤣🤣 thank you for bringing reality in.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DangerousDuty1421",
            "body": "It is horrible that something like this happened, especially because you seem like someone who really didn't deserve this. I get it when you say that you would have felt better to deserve it, unfortunately bad things often happen to who least deserves it. Have faith in yourself, you will make it through. ❤️",
            "score": 14,
            "replies": []
        },
        {
            "author": "BeginningExisting578",
            "body": "I’d speak to people in your apartment and make a police report.",
            "score": 12,
            "replies": [
                {
                    "author": "Wonderful_Mix977",
                    "body": "Absolutely.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jasmineandjewel",
                    "body": "This☝",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Express_Science_7171",
            "body": "Sadly just take this as a lesson. Hopefully you get your money back or misplaced it but never just leave money lying around.",
            "score": 23,
            "replies": [
                {
                    "author": "GrumpyKitten514",
                    "body": "I mean, \"sold my car to moms friend at 3am for $500\" sounds like OP is down bad for sure. \n\nI would 100% accuse someone of stealing it, sounds like everyone in that situation can use $500.",
                    "score": 67,
                    "replies": [
                        {
                            "author": "Express_Science_7171",
                            "body": "100% would be my first thought is that it was stolen but you never know. Hopefully it is found in some way.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "espositorpedo",
                    "body": "It wasn’t lying around. It was in a dresser drawer. Someone had to go looking for it. What is wrong with you?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Express_Science_7171",
                            "body": "??? Have I said something wrong? It is a lesson to be learned. The money was not secured which is why it is now not found. I was in no way being malicious in what I said. It could have been put in a wallet/purse then taken to the bank when given the chance.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Johto2001",
            "body": "If you live with other people who aren't immediate family or a long-term romantic partner, don't keep your money in your home. Sometimes not even if you are living with family, because sadly sometimes family members steal from each other. You need to get a deposit account of some kind - a credit union account or a bank account.",
            "score": 1,
            "replies": []
        }
    ]
}