{
    "title": "i literally cannot save in this economy and i have cut all my expenses including trash pickup lmao. how am I supposed to contribute to my IRA?!?!!",
    "author": "EmuInteresting2722",
    "subreddit": "povertyfinance",
    "rank": 4,
    "score": 543,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 201,
    "url": "https://www.reddit.com/r/povertyfinance/comments/1je6bpk/i_literally_cannot_save_in_this_economy_and_i/",
    "id": "1je6bpk",
    "selftext": "In 2016 I made 12.50 an hour and could save enough to invest hundreds in stocks or my IRA per month.\n\nIn 2025 I make $24 an hour and I literally have around $12 left each month in my checking account before my next pay check. No joke.\n\nI do not eat out. I don't buy new clothes. I don't have an insane car note (its paid off) nor an insane mortgage ($770/mo.) No credit card debt(I dont have a credit card I canceled them all because I'm too monkeybrained for them). My expenses each month are : gas, grocery store, mortage, home insurance, car insurance.. And usually once per month there is some random stupid bullshit expense but one that is necessay like doctor bill, car repair, etc.\n\nThis economy sucks big time. I cut my trash pickup (which was like $40/month) and literally cannot cut anything else. I take my trash to the dumpster at work because my boss lets me use it.\n\nAlso I have 2 kids. But i make too much for food stamps or welfare assistance. I want to cry every day\n\nIf the economy keeps going like this I'd imagine we're due for a big recession since by the looks of it, the only businesses getting my money in 2025 are the grocery store, the car repair, the doctor, and the gas station. I literally don't have money for any 'fun' spending whatsoever",
    "comments": [
        {
            "author": "AwesomeAF2000",
            "body": "I had to take a side gig last year. I walk dogs through rover during my non working times. I do enough walks a week to get $100 a week. I make anywhere between $10-$35 per walk including tip. Little dog short walk gets less money than 2 big dogs for hour long walks. I’m starting to get regulars and one of them even paid me to dog sit when they went away for the long weekend. \n\nI originally got this job for fun money to take my kids for fun stuff and maybe a trip but I find myself constantly dipping into this dog walking money to fund day to day expenses like groceries.",
            "score": 217,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "How do I get a side gig?\n\nI'm basically tied down 6 days a week at my current job",
                    "score": 63,
                    "replies": [
                        {
                            "author": "Disco_Pat",
                            "body": "6 days a week at 24/hr and a 770 mortgage? Your money is going somewhere and you need to find out where.\n\nDo you currently use any budgeting or expense tracking software? I use one called YNAB and it has literally changed my life. It takes some getting used to, but knowing where all your money is going is the first step.",
                            "score": 139,
                            "replies": [
                                {
                                    "author": "Free-Pound-6139",
                                    "body": "Don't worry, they always lie about where their money goes.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cold-Repeat3553",
                            "body": "Check with your kids' teachers. There might be a classroom parent group you can join. Offer Friday and Saturday night babysitting. If you and kiddos are going to be home anyway, babysit their friends. You could make some extra cash and the kids get a play date. Parents are always looking for reliable date night babysitters.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "AwesomeAF2000",
                            "body": "I have 2 kids and I work full time plus some more too. Just look around to see if there are casual jobs you can get like uber, door dash, instacart. Nice thing about the dog walking through rover is I can pick up jobs when I have time. The jobs are like 30mins to an hour. And I look for them closer to home so I don’t have to travel far. The $10 walk I do is only 20mins because it’s this super old little dog but it’s close to home and they pay me to do it 3 times a week. Sometimes I even send my oldest to do the walk for me. \n\nIs that an option? Could your kids help out by doing some extra jobs around the neighborhood? Not sure how old yours are. Mine will shovel sidewalks and cat sit for neighbours for extra money.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "LeapinLizards27",
                                    "body": "You seem to have pretty good writing skills. Why not look at one of those online websites - I forgot the name; maybe someone here can chime in - where you can work whenever you have extra time. You can work on close captioning and other writing gigs. Over the course of a month, you could make a nice sum of money without having to leave the house.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bootyspagooti",
                            "body": "If you have a fenced in yard, you can rent it out on Sniff Spot. It’s for people that have dogs but don’t have a yard, and you rent access to it for a set period of time.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Any-Freedom6277",
                                    "body": "interesting stuff thanks.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Spockhighonspores",
                            "body": "Can you go to a food pantry? They will give you food and you can use that money towards your savings.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "allisaidwasshoot",
                            "body": "If you have decent thrift stores in your city you can start reselling. Books, CDs, DVDs, board games and toys can make good money if you are savvy. Clothes are more common for reselling but if you know your stuff I'm  sure that can be profitable too.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Proof_Most2536",
                            "body": "At this point the only thing you can probably do is look for a higher paying job. 6 days is already a lot.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FormatException",
                    "body": "What a fuckin boss",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ybrain48",
            "body": "Do breakdown of finances pls",
            "score": 88,
            "replies": [
                {
                    "author": "SBSnipes",
                    "body": "This, bc $24/hr can be tight, but usually because housing costs tend to be double what op is paying or more. Like are the kids in daycare or something?",
                    "score": 95,
                    "replies": [
                        {
                            "author": "ybrain48",
                            "body": "Guessing his food costs are a lot",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "DumbVeganBItch",
                                    "body": "Health insurance premiums can be insane if you have your kids on it.\n\nFriend of mine was paying $1,200 a month to have her, her husband, and their newborn on her husband's plan.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stopsallover",
                    "body": "Literally sit with pen and paper and write down the essentials. \n\nWhat's listed in this post indicates some huge other expenses with a paid off car and $770 mortgage.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "pervyme17",
            "body": "Does your partner provide any support? Either child support or paying any bills?",
            "score": 59,
            "replies": [
                {
                    "author": "Greatest-Comrade",
                    "body": "Yeah the only way this adds up is if partner is not providing financial support OR childcare. \n\nIf partner is pitching in it would dramatically decrease OP’s costs, and they wouldn’t need to make this post.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Least-Cup-7261",
                            "body": "thats what I think too",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea_One_6500",
            "body": "Go to food banks now so you can have money set aside for food when the banks and pantries start to experience shortages. Your situation is why these resources exist, so please use them. You have a house, and I'm guessing at least a small yard. Look into growing your produce this spring. Seeds are inexpensive, and you don't really need anything fancy. The kids can help out, and they'll love watching their plants grow. You can't save for the future at the moment, and that sucks, but you have a stable roof over your head, and in these times, that's a lot. If your children are school age, reach out to their schools. There are programs in place to help kids with food insecurity, and they may need able to help you find other resources to help you out. Also, apply for free/reduced lunches if you haven't already. Lastly, if you use social media, look for local buy nothing/free little pantry groups. People always seem to be giving away food.",
            "score": 30,
            "replies": []
        },
        {
            "author": "PersonalityHumble432",
            "body": "You make 50k a year. What about your coparent/partner? It’s hard to make it by on one income so the other spouse needs to gain an income stream or you need to put them on child support if it’s a coparent situation. \n\n3333 - 770 = 2563.33 per month after paying the mortgage. \n\nGas, groceries, insurance takes up over $2500 a month? Something is missing.",
            "score": 42,
            "replies": []
        },
        {
            "author": "callofduty1966",
            "body": "All your money is gone because you have 2 kids… look for a better job or a partner that works too.  It’s hard to survive alone on $24hr, no way you can with 2 kids",
            "score": 136,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "Nobody is hiring everybody is laying off. I've had people with much better jobs than me tell me I'm lucky to have the job I have because at least I have job security. My friend who is a mechanical engineer just got laid off. This economy is cooked",
                    "score": 73,
                    "replies": [
                        {
                            "author": "StreetClothesMike",
                            "body": "Instead of assuming there are no jobs, actually start looking.  The best time to look for a job is when you have one.  Check job postings every morning.  It will happen.",
                            "score": 95,
                            "replies": [
                                {
                                    "author": "Sad-Teacher-1170",
                                    "body": "There's a difference between actual no jobs and no jobs that aren't going to put OP in a worse position. There are lots of things to consider outside of straight salary. Things like if the commute/hours are longer you need to fund more childcare and pay more transport. No availability in your sector within a commutable distance. No time/money etc. To study to go in a different career direction, and loads of other obstacles that may make a change impractical",
                                    "score": 89,
                                    "replies": [
                                        {
                                            "author": "Superb-Antelope-2880",
                                            "body": "Sure,  but they were talking about OP partner getting a job and contribute, not OP.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "StreetClothesMike",
                                            "body": "Then move",
                                            "score": -87,
                                            "replies": [
                                                {
                                                    "author": "MyOpinionYourEars",
                                                    "body": "Her mortgage is $770 a month — in this economy that’s the biggest expense and hers is very manageable. So I doubt moving is an option.",
                                                    "score": 48,
                                                    "replies": [
                                                        {
                                                            "author": "Seaofinfiniteanswers",
                                                            "body": "Definitely do NOT move if you have that mortgage. Never find that again. Keep looking for better jobs.",
                                                            "score": 33,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TraditionalSpirit636",
                                                            "body": "And moving takes money. Which OP doesnt have.. \n\n\nIts always the most useless/dismissive advice given.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "EmuInteresting2722",
                                                    "body": "My mortgage is locked in at 3%\n\nAn apartment would be more expensive than my mortgage. Golden handcuffs",
                                                    "score": 73,
                                                    "replies": [
                                                        {
                                                            "author": "StreetClothesMike",
                                                            "body": "What’s your car payment",
                                                            "score": -63,
                                                            "replies": [
                                                                {
                                                                    "author": "EmuInteresting2722",
                                                                    "body": "It is paid off",
                                                                    "score": 43,
                                                                    "replies": [
                                                                        {
                                                                            "author": "StreetClothesMike",
                                                                            "body": "I used to work at Best Buy for 14hr.  Hated it.  I would wake up every morning and apply to jobs.  It took three months but I found a salary job at a local ad agency.  10 years later I’m an Executive at one of the largest advertising agency in America.  The only person that can change your situation is you.  \n\nI’ll tell you right now you can make more than what you’re making annually waiting tables.  Maybe try and pick up some shifts at a local restaurant.\n\nDownvoted because I pulled myself out of poverty.  Lol.",
                                                                            "score": -52,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "JHoney1",
                                                                                    "body": "Downvoted because\nA) Dismissive tone.\nB) obviously not everyone can do what you did, you were exceedingly lucky. Hard work does not translate reliably into your success. It enables it, but very few will ever be that lucky. \nC) obviously Obama economy 10 years ago was massively different than the current state. \n\nI wish I could downvote you twice.",
                                                                                    "score": 60,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Spockhighonspores",
                                                                                            "body": "I don't vote up or down normally but I'll happily downvote them for you.",
                                                                                            "score": 5,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Darkrobx",
                                                                                    "body": "You are being downvoted because;\n\n-You do not care enough to read\n\n- Giving dumb advice because if you read you’ll understand more about this person situation and their kids “WhY DoNt YoU MOvE”\n\n-Good got you for getting out but your experience don’t apply to everyone and I don’t think you had kids at Best Buy\n\n-Before making a comment put yourself in their shoes and realize they can’t make a selfish based decision because they have people they are responsible for",
                                                                                    "score": 37,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "StreetClothesMike",
                                                                                            "body": "I read it but missed the paid off part.  I guess that makes me incompetent and disqualifies me from giving internet advice.  I am going to re evaluate my life and take a hard look at where my education went wrong.  \n\nIt all began years ago...\n\nI used to live in a small village nestled between green hills.  My family was poor, and they worked hard to make ends meet. Every day, I helped my parents with chores around our small farm, waking up before the sun and going to bed long after it set. School was an afterthought—my parents didn’t see the point of education when there was so much work to be done.\n\nOne day, a teacher from a nearby town visited my village. She spoke to the children and their families, sharing stories of faraway places and amazing inventions that changed the world. I listened closely, feeling something stir in my heart. “You can learn,” she told me, “and with knowledge, you can build a better life.”\n\nThat night, I couldn’t sleep. My mind raced with the possibilities of what I could learn if I went to school. The next morning, I made a decision. I would go to school, even if it meant working harder.  However, my parents concerns about the farm's well being outweighed my yearning for education.  I guess that's where it all went wrong.  Thanks Obama.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "EmuInteresting2722",
                                                                                    "body": "I didnt downvote you to be fair",
                                                                                    "score": 10,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "ahtomix",
                                                                                    "body": "I upvoted you. I did the same. Went from 15/hr to 26/hr in a little over two years because I worked hard and I worked smart. Hard work is good and helps you get jobs, but if you’re working hard in a dead end or limited path, you’re setting yourself up for failure. Sure as shit wasn’t easy. I had to do work and school full time and when I graduated, I replaced that school time with learning new skills and certifications for a related field that gave me even more options.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "MyOpinionYourEars",
                                                                    "body": "She doesn’t have one lol did you read the post?",
                                                                    "score": 36,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Lingonberry_Bash",
                                                    "body": "Moving a household with two kids costs hundreds to thousands of dollars. You have to pay for moving supplies, take the time to pack your house, pay a deposit on a new place, possibly pay utility deposits, rent a moving truck (sure, you can move without a truck - if you buy all new furniture afterwards), gas for going back and forth, etc etc.\nPlus there's the upheaval to the kids, finding a new job, building a new support community, finding new locations for your medical care and other needs...\n\nMoving is expensive. It's not something an adult with a house and kids can just do on a whim.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "StreetClothesMike",
                                                            "body": "Sounds like a temporary hardship that’s necessary to change the situation.  I’d hope she would have friends to help her pack and move.  Def not going to get 3% but if she moves to a lower cost of living area it could even out.  Also. If she’s in a big house, take might be okay with losing some square footage to be better off financially.  If she’s had equity in her house, that will help lower the mortgage payment as well.",
                                                            "score": -6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "24_mine",
                                                    "body": "shit take",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sad-Teacher-1170",
                                                    "body": "Again, not always feasible- especially with kids. Moving costs money too",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "whisperingserpent",
                                                            "body": "People don’t understand how difficult it is to “just move”. It’s not free to move. Especially if you rent. When you have $20 a month left over, you can’t save enough for first month’s rent, last month’s rent, and a security deposit. Suggesting OP move with their two children is not constructive lol.",
                                                            "score": 36,
                                                            "replies": [
                                                                {
                                                                    "author": "Blossom73",
                                                                    "body": "Exactly. Plus landlords usually want excellent credit, no history of eviction, and a long, solid rental history. Things that many poor and moderate income people don't have.\n\nNot to mention too the disruption of putting the kidding in a different school. \n\nAnd some single parents cannot legally move due to custody agreements. \n\nBesides, there's very, very few places in the United States any more with a decent job market, plus good schools, in a safe neighborhood, where rent on a 2-3 bedroom apartment will be less than $770 a month.",
                                                                    "score": 7,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Number1AbeLincolnFan",
                                                                    "body": "Especially if you rent?  My brother in Christ, moving is literally 10x harder and more expensive when you own a house.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "whisperingserpent",
                                                                            "body": "I mean, yeah, you have a point lol not arguing that! I was just stuck in that endless cycle of barely affording rent meaning I can’t save to move for a long time before I owned, so that’s where my mind went. Now that I do own, moving is DEFINITELY not an option any time in the near future.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Spockhighonspores",
                                                                    "body": "Omg I try to tell people that all the time. Moving costs thousands of dollars, it's ridiculous to assume someone can just move. Even if you were lucky enough to get a cheap 1K apartment you need 3K just to get in there plus the money to take the time off of work and rent a moving truck. It's probably going to cost 4 to 5k just to move. Moving is only a good suggestion if you have a job lined up thats going to pay you a hell of a lot more.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "georgepana",
                                                                            "body": "Why move when the mortgage is an incredible $770 a month? That is crazy low. Most 1 BR apartments around here are between $1,500 and $1,700, and that is Tampa, forget NYC, Boston, Seattle, LA, etc. \n\nThe money probably goes for the 2 kids, I assume that expense wasn't there in 2016, and kids can be expensive (daycare, activities, extra medical coverage, etc.)",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TraditionalSpirit636",
                                                    "body": "“I have no extra money”\n\n\n“Well use a few thousand and move”",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "--Knowledge--",
                                    "body": "So much this. I just went from making $21.85 an hour to a 50k salaried position. It's not a huge jump in money but it's something.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Greatest-Comrade",
                                            "body": "Plus usually money/benefits/WLB/compensation is an exponential process that relies on experience. Sure it’s a small jump now, but itll be bigger and bigger as time goes on.\n\nOfc if you limit yourself then you’ll never know and never get better opportunities because you’ll only get them if they land in your lap!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Free-Pound-6139",
                                    "body": "No, but once years ago someone told him he was lucky so why should he look for jobs???",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "callofduty1966",
                            "body": "Go work in the trades, there’s always work to be done. Where I work No experience laborers in dirt work start at $30 plus benefits",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Room_Ferreira",
                                    "body": "Idk why people are downvoting you lol.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SpoopyDuJour",
                                            "body": "Because it's not always an option either. Even smaller chronic health issues will fuck you in trades.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "callofduty1966",
                                                    "body": "Not always, there laborers that just sweep and clean all day inside. If you can’t even do that there’s no way you’ll make it in this world",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "SpoopyDuJour",
                                                            "body": "Try sweeping and cleaning for 8-12 hours a day with a ruptured disk and get back to me.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "callofduty1966",
                                                                    "body": "I have seen guys with ruptured disk and worst still laying pipe in the ground and running hauling trucks outside in the heat. Listen there’s always a way to make more money. If you always find an excuse you’ll not get ahead in life…",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SpoopyDuJour",
                                                                            "body": "Yeah, and I watched my parents with manual labor jobs do they exact same thing. It really, really, really didn't work out for them, and it doesn't work out for a lot of people. Pushing through pain in trade jobs is a great way to land yourself in the hospital with more debt than you had before.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Free-Pound-6139",
                            "body": "> I've had people with much better jobs than me tell me I'm lucky to have the job I have because at least I have job security\n\nThis is a bad reason not to try for a new job.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nateandgypsy",
                    "body": "That's a reality for many, unfortunately, and it's going to get worse as long as we keep rewarding bad behavior from the wealthy, politicians, and business leaders. Capitalism, with its unchecked exploitation and the elite that protect  the capitalist, is the problem.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Financial-Fan2490",
                            "body": "Yup blame game is the answer!!!",
                            "score": -13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -25,
                    "replies": [
                        {
                            "author": "MyOpinionYourEars",
                            "body": "She or he has their kids years ago. Your comment isn’t helpful. The economy is not something you can time nor is life in general. You live it and you TRY to roll with what it throws at you.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "rosiestgold",
                            "body": "Your comment is so out of touch. \n\nCan you see into the future and predict what the economy will be like?\n\n4 years ago, I would have had no problem affording a comfortable life for 2 kids. But today, the economy is rough. Things are much more expensive than I thought. Now I’m thinking it probably makes more sense to have just one. But if I had started having kids 4 years ago, when I could have afforded two, maybe I’d have two kids right now and would be in a tighter financial situation. And I don’t think that would have been irresponsible of me. ",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "povertyfinance-ModTeam",
                            "body": "Your post has been removed for the following reason(s):\n\nRule 11: Challenging user values\n\nUnsolicited advice must be generally respectful of people's right to determine their own values, free of assumptions and judgments, and in otherwise fitting with the rules, guidelines, and spirit of the sub.\n\nPlease read our [subreddit rules](https://www.reddit.com/r/povertyfinance/wiki/rules). The rules may also be found on the sidebar if the link is broken. If after doing so, you feel this was in error, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fpovertyfinance).\n\n\nDo not reach out to a moderator personally, and do not reply to this message as a comment.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "rassmann",
                                    "body": "Your post has been *removed for the following reason(s):*\r\n\r\n**Rule 6: Judging OP or another user.**\r\n\r\n- Regardless of why someone is in a less-than-ideal financial situation, we are focused on the road forward, not with what has been done in the past.\r\n\r\n[Please read our subreddit rules.](https://www.reddit.com/r/povertyfinance/wiki/rules) The rules may also be found on the sidebar if the link is broken. If after doing so, you feel this was in error, [message the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Fpovertyfinance) \r\n\r\n\r\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*\r\n\r\nYour post has been *removed for the following reason(s):* \r\n\r\n**Rule 11: Challenging user values**\r\n\r\n- Unsolicited advice must be generally respectful of people's right to determine their own values, free of assumptions and judgments, and in otherwise fitting with the rules, guidelines, and spirit of the sub.\r\n\r\n[Please read our subreddit rules.](https://www.reddit.com/r/povertyfinance/wiki/rules) The rules may also be found on the sidebar if the link is broken. If after doing so, you feel this was in error, [message the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Fpovertyfinance) \r\n\r\n\r\n*Do not reach out to a moderator personally, and do not reply to this message as a comment.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stopsallover",
                    "body": "Kids don't cost that much though.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "callofduty1966",
                            "body": "🤣🤣",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "stopsallover",
                                    "body": "It's not really funny. If you grew up without money as a kid, you'd know the deal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Asleep_Surprise947",
                    "body": "Why do so many people have kids when they can’t afford to raise them?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "touchesgrass",
                            "body": "Things like illness, death and divorce happen. People are not always upwardly financially mobile. You don’t know what people have been through to get where they are. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdvantagePretend4852",
            "body": "Have you tried being born with generational wealth? I heard that helps you save a lot of money",
            "score": 82,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "Lmao",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Anon0118999881",
                    "body": "I'm pulling hard on these bootstraps but I'm not going anywhere. What am I doing wrong plz help my country is dying 😂",
                    "score": 13,
                    "replies": [
                        {
                            "author": "AdvantagePretend4852",
                            "body": "Learning the truth about the bootstraps statement radicalized me a bit.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zebras_And_Giraffes",
                    "body": "That's what I always say. Why don't people listen?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AdvantagePretend4852",
                            "body": "Too busy having poor grandparents I guess",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Hot-Principle-8210",
                                    "body": "life is so unfair",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AdvantagePretend4852",
                                            "body": "I know. Why didn’t I invest in Apple in 1990?!? I was too busy learning to crawl and stuff",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DumbVeganBItch",
                                                    "body": "I was wasting time in the void waiting to be conceived like an *idiot.*",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WolfOffSesameStreet",
                            "body": "They're all watching netflix and eating avocado toast with their unwealthy parents.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Early_Apple_4142",
            "body": "You need to find a part-time job. Potentially something easy with like a local recreation or sports commission. Our local recreation commission has desk staff jobs at the facilities that are part-time mostly evenings and weekends. They don't pay great but for an extra 8-12 hours a week you could probably pick up another $250-350 a month and if yours are like ours the work is super easy. Mostly just check-in people in for facility usage or collecting payment.\n\n  \nedit: Yes the economy sucks. In 2017 my first year as a teacher I taught paid as a long term sub and made 24k doing that with another 10k from my part time job for a total of 34k and managed to get by and even bought a new house the next year when it jumped up to about 45k total. Now I make 84k plus whatever my business makes which last year was about another 30k and with two kids I'm still getting my ass kicked by bills. Only solution is to find more money.",
            "score": 11,
            "replies": [
                {
                    "author": "SBSnipes",
                    "body": "They need to break down the costs, $24/hr should be doable when you have a $770 mortgage.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Early_Apple_4142",
                            "body": "Sure. If they have child care costs or high insurance it could be eating up a lot of the remainder. \n\n  \nMy insurance cost last year on 84k was 14.5k so really income was 69.5 minus other taxes, 401k contribution to get match, etc. Gross unfortunately doesn't mean a whole lot.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "SBSnipes",
                                    "body": "In \\*most\\* places, they'd have about $42-43k left after taxes working full time, and they're saying they don't have enough to put into IRA, I presume that means they're not doing 401k either, especially given that this is r/povertyfinance \n\nIt's $3500/month post-tax, $770 mortgage should be doable if they actually only have the expenses listed in the post.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "SlomoLowLow",
                                            "body": "I make $25/hr and after tax and insurance I get $730/wk totaling ~$2900. Idk where Reddit gets its math at but like it’s always off by literally hundreds of dollars a month.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "SBSnipes",
                                                    "body": ">and insurance\n\nThere's the difference. You may also be paying into retirement before from the paycheck before it gets to you, which you should be, but op doesn't seem to be",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "SlomoLowLow",
                                                            "body": "Definitely not contributing anything to retirement. My employer matched 3% but I wouldn’t be vested until year 5 and I don’t even know if this place will be around in 5 years so I’d just be losing money every week to get a lump sum payment of a couple grand at the end of my time here because it can’t be transferred. I would rather be able to pay my bills than have a couple grand in 4 years when the company goes under. \n\nMy insurance is $96/wk as a single male with $75 copays for doctors appointments and a $5k deductible. This was the cheapest insurance my employer offered.\n\nReddit math just doesn’t math. Whenever people are calculating wages I say figure 30% for tax and insurance. Chances are that’s estimating high but it’s better to have more money than you expected than to have less money than you need. \n\nSo if you make $25/hr and work 40 hour weeks, expect to have a weekly paycheck of $700 or biweekly of $1400. Chances are it’ll be close but leave you wiggle room.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "SBSnipes",
                                                                    "body": "So insurance and variability in local taxes, my math was post-tax but pre-insurance, but it does in fact math. That said, I do like the 30% for tax+ins. combined estimate, definitely a good starting point/tool for when you don't have time to dig into the numbers.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Superb-Antelope-2880",
                                                    "body": "Insurance is an expense just like grocery or mortgage are.\n\n\nYou deducted it ahead of time while you didn't for the other costs; you're throwing your own math off.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Flimsy_Situation_",
            "body": "Are you a single parent? We couldn’t do it on one income. And we don’t even have the kid yet (3 more months).",
            "score": 11,
            "replies": []
        },
        {
            "author": "Darkrobx",
            "body": "Sound tuff. Advice I could give:\n\n-Ask your partner to start working if they are in the picture\n\n-Get a second part time job that happens on the weekends like : Amazon or bartending/bouncer or home care\n\n-Rover is an app I think people use for dog sitting and sometimes it would be in your own home.",
            "score": 8,
            "replies": []
        },
        {
            "author": "ChronicallyPunctual",
            "body": "I have 2 kids as well, and fuck it’s hard dude. As soon as I get a bill paid off another one comes in or a kid gets sick. My wife wants to get a dog too, and fuck that. I can’t afford to feed us! It doesn’t help that I’m the “breadwinner” either. It’s so damn hard.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Bird_Brain4101112",
            "body": "What were your expenses then vs now?  That’s the difference? I’m guessing you didn’t have 2 kids in 2016. Did you have your own place? A vehicle? What is the difference in food expenses (prices aside) of feeding just yourself vs 3 people.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Anon0118999881",
            "body": "Honeslty I too think we're staring down the loaded barrel of another recession. Not getting political but my IRA has been wiped down 20% over the last month and 401k is reporting red as well, I've literally never had that happen in the last 3 years that I've funded it.\n\n\n\nPersonally, I've been looking like hell to cut costs however I can. My last cut has been driving, I'm still ''car-lite'' as in I still own my paid off vehicle, but I barely drive it. I live close to work so I'm fortunate in that it's an option for me, but my miles are down to under 200 a month (I'll still drive in poor weather to work, unexpected needed trip etc) and my car related costs for insurance, gas, repairs, tolls went down considerably. I know not everyone can do it especially in America here where our infrastructure is shit, but if possible try to cut down on car trips and replace them with bike or transit or walking it really does help. Look at subs like /r/fuckcars /r/bikecommuting /r/ebikes and your local city might have a cycling or transit sub or forum. \n\n\nAgain this sadly can't work for everyone like someone in Baton Rouge this isn't as helpful, but say someone in Minneapolis or LA or even Houston this can be a gamechanger.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Princess-Donutt",
            "body": "How old are your two kids?",
            "score": 4,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "10 and 14 💀 all they do is eat food because growth spurt",
                    "score": 17,
                    "replies": [
                        {
                            "author": "bedofflowers",
                            "body": "You should try some food banks to help you out",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "sunshineandcacti",
                                    "body": "Some districts in the summer months will also provide some ebt/snap",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Neagex",
                            "body": "oof yeah. My bills really pilled up when the kids got into their teens. its insane I couldn't keep food in the house.Honestly a saving grace for me was shopping at costco/sams club during that period. 10 dollar giant box of pop tarts.\n\nOne kid is no longer in the house. and the expenses fell dramatically lol.... the cost of raising kids is no joke",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "AwesomeAF2000",
                            "body": "My kids are younger than yours. See if you can get them to help out. See if the neighborhood has people who need help shoveling snow or mowing grass. Or some yard clean up, dog walking, etc. they can earn some extra cash and use it for their spending to take some pressure off of you.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "NoninflammatoryFun",
                            "body": "I was a tiny girl and I ate like a motherfucker at those ages. I’m glad we had money and groceries were cheap back then. \n\nI echo the food bank thing.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "PantasticUnicorn",
                            "body": "Maybe you need to sit them down and be realistic about them eating so much food. I know people might disagree with me, but if they're eating you out of house and home then something needs to change. Portion out meals, only give them X amount for snacks. Make sure they don't go over that and budget it to last. Also the 14 year old could find a small side job, whether its going around the neighborhood asking about moving lawns, or babysitting, or what have you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LaRaAn",
                                    "body": "I disagree with sitting then down to discuss their eating habits directly. The last thing OP wants to do is kickstart some kind of anxiety around eating or the development of an eating disorder. A better approach might be just saying money is tight so we won't be buying as much junk food, snacks, etc. and then to make the shift towards more food that needs to be cooked and isn't as easy to grab and eat. Don't make it about about how much the kids are eating.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "dallasalice88",
                                            "body": "Yeah. I had to ration food as a child, it left me with some severe psychological damage. I'm a food hoarder now. Never enough. Also putting kids to work is not the answer. Did that too....",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "forakora",
                                    "body": "Feed them cheap healthy food. Lentils and apples are a hell of a lot cheaper and healthier than chips and snacks. It's a win win situation",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "PantasticUnicorn",
                                            "body": "I agree with this completely. Junk food snacks cost more and they arent necessities. But getting stuff like apples, yogurt, etc will provide nutrients and are cheaper and go a long way",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ill-Entry-9707",
                                            "body": "The best change for the budget and health is cutting out sugar sweetened drinks and fruit juices. If the budget is really tight, switch to tap water only. Buy a filter pitcher and get packs of flavor mixes online if you want some variety. Be careful with those as too much of anything prepackaged is not healthy. \n\nIn my experience, kids don't recognize the cost of snacks and drinks. Take the kids to the store and give them ten dollars each for packaged foods for the week. If their money buys a bag of chips and a 12 pack of soda, they won't pig out the first couple days for more than once or twice before they learn how to ration their treats. If they want extra junk food money, let them figure out how to earn it. No kid is going to starve if you have bread, peanut butter, apples and bananas on the counter and leftovers in the fridge. Tell them they can earn extra grocery money by preparing food for the family.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DumbVeganBItch",
                                    "body": "Noooo, that's how you give kids eating disorders. I had a binge eating problem until my early 30s cause I grew up in a \"finish your plate clean, we can't afford to waste food\" household with random bouts of having next to nothing in the fridge. I ended up mildly obese until I buckled down and got myself on a calorie restriction.\n\nUnless they're actually overweight, kids that age should not be restricting nutrition. Their bodies are going hard on their development, they need a lot of fuel.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Express_Science_7171",
            "body": "Any cuts you can make to groceries or maybe try and find cheaper alternatives to what you buy? If not a better or second job is probably your best bet.",
            "score": 4,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "I shop at Sam's club and without that I'd be broke for sure\n\nI have actually thought about a second job. My friend is a bartender and he told me he makes like $300 in two days. My problem is that in my current job, it is impossible for me to work a 2nd because I'm already 6 days a week. I'd have to find some kind of online job I could do on the side at my current job. its tough",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Express_Science_7171",
                            "body": "It’s unfortunate people have to think about another job in order to make it out of these times but it may be your best bet. Idk where you live but could try a food delivery service or something along those lines. Could maybe try a food pantry for the short term to lessen the grocery bill a bit",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Darkrobx",
                            "body": "Work partime on the weekends….well your only off day Ig",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TrashPanda2079",
            "body": "Are you in the US and in good health? Donating plasma has supplemented my normal 9-5 income by $400 a month donating twice a week. Lots of places also offer new donor specials. The very first month I started donating I earned $900. Tax free.",
            "score": 7,
            "replies": [
                {
                    "author": "EmuInteresting2722",
                    "body": "That sounds incredibly painful",
                    "score": -4,
                    "replies": [
                        {
                            "author": "TrashPanda2079",
                            "body": "Not really…. The techs at my center are really good, I’ve been donating for a year now and have only had two bad sticks. \n\nSide gig- like others have said: dog walking/pet sitting, try to find an entry level data entry thing working from home… my friend has a part time job cleaning office buildings in the evenings, she actually really enjoys that. OT at your current job if it’s available although I know some places are sticklers about not having any overtime at the end of a pay period.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Darkrobx",
                            "body": "Stop acting like you got a choice big bro",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EmuInteresting2722",
                                    "body": "I'm not donating plasma and getting my vein blown out\n\nI do agree with u I need a part time job",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jsboklahoma1987",
                                            "body": "You shouldn’t have to donate bodily fluids to survive and everyone needs to stop normalizing this.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Old-Mushroom-4633",
                                            "body": "You don't have to and shouldn't have to, but it's easy money. Your veins will be fine. I've donated blood as often as allowed for years and my arms are 100% fine. It doesn't really hurt either. I'll take a blood donation over a corporate meeting anytime.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "EmuInteresting2722",
                                                    "body": "im just scared ive seen horror stories where somebody bad at their job messes up and the persons entire arm is black and blue for a month from brusing. im not built for donating blood tbh",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NoninflammatoryFun",
                                                    "body": "I’m glad I don’t need to right now because people would suggest this but I never could lol. My veins are hard to find (despite my skin being almost translucent) and now I also almost pass out when donating blood 😂",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Disco_Pat",
                                            "body": "Donating Plasma is way less painful than working most part time jobs.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NovelHare",
            "body": "That’s crazy cheap for a mortgage. Damn.  Like that’s half the coast of a cheap apartment to rent.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BillionDollarBalls",
            "body": "Trying to level up my job has been hell to boot. It shouldnt be this hard...........",
            "score": 3,
            "replies": []
        },
        {
            "author": "Critical_Set_8701",
            "body": "Are you me? It’s like looking in a mirror. I go to the food bank every other month which helps A LOT. Churches have help too. I felt embarrassed at first but really they’re there to help you.",
            "score": 3,
            "replies": [
                {
                    "author": "grrlwonder",
                    "body": "I totally second food pantries. There is a great selection here, including one that is \"grocery store\" experience that has great things like produce, higher quality veg, day old bread from Walmart. \n\nI usually will hit the weekly one every 2-3 weeks but sometimes weekly when necessary, then with way less out of pocket can add $20 in groceries and have great meals all week.\n\nI've found the Catholic charities are very good sources for help like this.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EmuInteresting2722",
                    "body": "What regional area are u in? west? east? mid west? i am embarassed to go to a food bank",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BeautifulGlum9394",
            "body": "Excuse my poverty but what is a ira ?",
            "score": 5,
            "replies": [
                {
                    "author": "wolfofone",
                    "body": "Individual Retirement Account. A tax favorable bucket for your money.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "bobbywaz",
            "body": "24 an hour isn't enough for someone with two kids in 2025 unfortunately.",
            "score": 6,
            "replies": []
        },
        {
            "author": "DankDarko",
            "body": "With that mortgage and no car payment it makes no sense how you cannot have a surplus at the end of the month with that pay. You are spending money somewhere that you shouldn't need to. Make sure you tax deductions are set appropriately for your household. You should not be getting any money back (or very little) on taxes if you did it correctly. \n\nUse a money management account to see where you money goes over time and adjust. I use Nerd Wallet.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Peachy_Keen31",
            "body": "It’s not easy out here. \n\nIn the meantime, take advantage of your local food pantry. You should qualify for state insurance- have you applied? That might help. \n\nIf you haven’t, shop around for new insurance rates. Use coupon apps like Ibotta and fetch. Get free passes at your library for fun and free (or close to free) with your kids. They usually offer free clubs too. \n\nI know it isn’t much but every thing helps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "foreverseekinganswer",
            "body": "You could try online classes for free to learn booking keeping or basic accounting skills (many small/medium or self employed individuals hate this part of it hire someonetwice or onnce a month) either distant or to come to office during office hours - and , virtual personal assistant, house cleaning jobs, advertise in Nexdoor. A few these side jobs could be done. I was a single Mom for 8 years I get it. I had a corporate job, took any side job, worked 7 days a week, catering waitress (oncall), waitress 2 shifts a week, personal assistant. Many of the small jobs I took my daughter went with me, I found many people would refer me to other little jobs to help because people like to help. I mowed yards, cleaned houses, small stores, rental cleanups, painting rooms (if you can paint, this one earns pretty good)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Number2637",
            "body": "We are a family of 3 on less than 60K (closer to 55k) a year, similar mortgage payment and a car loan and we do 4% in an IRA.. your money is going somewhere, we were hemorrhaging on groceries for a while. We got to the point we budgeted down to the penny for a while to figure it out. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "SBSnipes",
            "body": "Show us the numbers. after tax, your income should be about 43k, or a bit over 3500/month  \n\n\n|Expense|Amount|Remaining|\n|:-|:-|:-|\n|Starting point|0|3500|\n|Mortgage|770|2730|\n|Grocery|900\\*|1830|\n|Home Ins. |150|1680|\n|Car ins+gas|400\\*|1280|\n|Phone+Internet|100\\*|1180|\n||||\n\nNot sure how much your health ins. is - that could be the kicker.  or what other expenses you have here, but you can probably keep them under 1200 if your health insurance isn't insane. \\* = can be workable for less. ie grocery can be lower than that if you really pinch, car ins+ gas that's for minimum coverage and average driving. Phone and internet you could go lower on.",
            "score": 5,
            "replies": [
                {
                    "author": "Flimsy_Situation_",
                    "body": "I make more than op and definitely don’t bring home 3500 a month. Taxes are different in every state. And you mentioned health insurance. Probably isn’t cheap, especially with kids.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Blossom73",
                            "body": "Yep. My state has a state income tax, *and* residence city income taxes, *and* work city income taxes.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "SBSnipes",
                            "body": "It's probably not cheap, hence why it would be useful for op to mention - some employers cover it, most partially cover but some still comes out, others just pass the costs along. if OP's insurance is $1500/month then yeah, this is a super tight situation, but they flaired it for budget advice and then didn't give much info for the numbers.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jsboklahoma1987",
                    "body": "Possible extras:\n\nClothes, shoes, household cleaning products, extracurriculars for kids , toiletries, home incidentals (fixing issues both minor and big for instance we just had to buy a roof), makeup (yes is necessary if you work in an office and are a woman), medical expenses, car incidentals (oil changes, brakes etc), summer camps, phones for the kids, UTILITIES, things for the kids (bikes, scooters, trampoline whatever)…. I could probably think of more \n\n\nEdited wasn’t done.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SBSnipes",
                            "body": "Thrift/walmart/Sams for clothes, should definitely be doable on under $100/mo. (I foster 4 kids and have 2 bio kids, so I'm familiar with the prices. cleaning products and toiletries are included in groceries. Some extracurriculars sure, but there are plenty that are free or cheap, especially through schools.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "jsboklahoma1987",
                                    "body": "You didn’t even include natural gas, electric or water. That alone costs my family $400-500/month",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "SBSnipes",
                                            "body": "Our Utilities are normally $200-250/month for 6-8 people (varies a bit what with fostering). As for the rest of the added things - again secondhand, but also summer camps aren't a necessity for 10/14, and phones were included, this r/povertyfinance we're not getting a 10yo an iPhone 16 pro max on the top verizon plan, we're getting the cheapest phone possible on Mint or something.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "jsboklahoma1987",
                                                    "body": "Insurance for me is $275/month and that’s super cheap bc I’m a county employee. So let’s say it’s that. Phones for the kids. If they are being left to their own devices with no summer camp they need a phone to call someone ($40). And utilities vary wildly depending on your provider we will say ($400 to be fair). So let’s evaluate this again. \n\n$100-clothes\n$400- utilities\n$275- insurance\nMedical expenses (deductibles)-$50 (at minimum this is extraordinarily conservative for 3 people)\nCar upkeep: quick google search says for a used car expect about $2000/year for repairs and upkeep on average. $165/month\nHome upkeep: (quick google search says 1-4% of the cost of home) $770 mortgage tells me maybe it’s a $120,000 home roughly. That’s $2400/year and $200/month. \nGrand total of unaccounted for expense: $1140\nLeaving about $40. HOWEVER I doubt she takes home this much bc I also make more than her and take home less. So likely she’s coming out in the hole every month. \nSomething tells me you aren’t in charge of the finances in your home and if you are you are very bad at it.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "SBSnipes",
                                                            "body": "I didn't say they couldn't afford it, I said they need to give more information if they actually want help figuring out how to make their situation better, especially since they don't want to try to change jobs. I even acknowledged straight up that it's possible that just insurance pushes them over and that's difficult to lower, though worth talking to their company's HR if it's that dire. And same for utilities - op should just say what they pay. Every once in a while you get the person who posts their budget and they're got a $500/month water bill that they thought was normal bc they have a running toilet or someone spending $200/month on their phone bill bc they think you just walk into verizon and get what they tell you. Just better to have the details to be able to see if there's anything they're missing.   \nAnyways in our home we do finances jointly so that we both know what's going on and whether we have it in the budget to do something if we can't consult with each other in the moment, but we're both contributing 9% to retirement, have a fully funded emergency fund, paid off cars, saving for college, etc, budgeting for groceries, clothes, housing, etc. for a variable number of people (Again, fostering). I think I'm alright.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "jsboklahoma1987",
                                                                    "body": "I never said you weren’t doing ok. In fact I suspected you were probably significantly better off based on your inability to account for basic necessities, that’s a common problem for people who are a bit too removed from poverty for too long. Have a good one.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SBSnipes",
                                                                            "body": "doing fine budgeting lmao, but sure, just continue to not actually read what I type",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "jsboklahoma1987",
                                                                                    "body": "You actually did not read anything I wrote. You blew off utilities and insurance bc they didn’t list it as if they don’t exist (they do) you didn’t acknowledge home or car upkeep… like your budget is awful and you’ve yet to acknowledge it.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "SBSnipes",
                                                                                            "body": "I gave a price for utilities and **asked op to tell us what they pay for insurance** because it's highly variable and situational. You, on the other hand, just popped in the average for car upkeep like it's nothing, when you can save a good chunk by learning some very basic auto care yourself instead of being beholden to shops, you can call around and find the best price, you find a mechanic who lets you bring your own parts and not pay the shop upcharge, etc. Same for home upkeep, the average is going to be more than what's \\*necessary\\* - some people are out there getting a new appliance bc a $5 part that takes 20 mins to swap out broke. That's factored in to those numbers.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "jsboklahoma1987",
                                                                                                    "body": "I did the low end on both assuming some minor things could maybe be fixed on their own. You can’t expect a single mom to work full time, be a construction worker/handyman and a mechanic. That’s asinine. Is she supposed to install her own roof? Fix her transmission? Get out of here.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "SBSnipes",
                                                                                                            "body": "Those examples aren't upkeep. A roof is maintenance, but it's typically every 20 years (or more) unless something happens, in which case it's up to the insurance. a transmission going isn't upkeep, it's a dead car, I could just as easily ask if they're supposed to rebuilt their home from scratch if a tree falls on it. Doing your own oil and filter changes and learning basic plumbing is very much a useful skill to save money, especially if you're struggling to get by financially.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "jsboklahoma1987",
                                                                                                                    "body": "You don’t even save that much money doing your own oil changes but if you fuck it up you’ll definitely pay a lot for it. And I’m not sure if you’re being intentionally ignorant or if this is just your baseline but… supposing you need a new roof, gutters generally too and maybe some siding replaced or paint done every 20 years let’s say it’s $30,000 (this is what we literally just paid for the aforementioned items). That’s $1500/year for 20 years… that’s absolutely a part of home upkeep and home upkeep costs/month. Let’s say a storm blows your roof off your insurance deductible  is likely at least $1500… again part of the home upkeep costs (and let’s not forget your insurance will absolutely go up). Then you’d have a few extra hundred dollars here and there for stuff you don’t know how to fix or can’t like a burst pipe or maybe some electrical issues that can come up.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "SBSnipes",
                                                                                                                            "body": "$30k? My coworker just got full roof, siding, and gutters on a 1500sqft house for $17k total. And *I'm* the one out of touch with poverty. Anyways, oil change and filters saves like $150/year, small plumbing stuff and appliance fixes can easily save $100+ per time you'd have called someone in, that adds up plenty",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "jsboklahoma1987",
                                                                                                                                    "body": "We financed it baby like true poors. And it was the cheapest of all the estimates I collected over a 6 month period. It included some siding work but not a full replace. $17k would get you a roof only here. Again things cost different prices depending on where you live. But we had to buy a house with a falling in roof then finance the roof replacement bc we couldn’t afford/qualify a mortgage on a house with a good roof. You gotta do what you gotta do to keep a roof over your family’s head.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "SBSnipes",
                                                                                                                                            "body": "Where you live does make a difference, but I've seen estimates lower than that for full roof, siding, and solar install in the northeast for 2/3 that, and gutters shouldn't be more than mayyyyybe a few thousand unless you're going crazy. Unfortunate if you live in an area that's more expensive than that, but case in point, most of those areas don't have $770 mortgages, even 5-10 years ago.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "jsboklahoma1987",
                                                                                                                                                    "body": "LOL you’re extremely out of touch. I SOLD solar panels for a short stint and I know exactly what they cost $3/watt is the average and the average install is 10,000 watt… I think you’re  living in 2005 still with pricing. You just happened to bark up the wrong tree with me bc I am VERY acutely aware of what these specific things cost bc I just got 15 estimates last year. I’m no longer taking anything you say seriously especially after the solar panel comment.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "SBSnipes",
                                                                                                                                                            "body": "My guy I was in grade school in 2005. Solar panels are heavily subsidized in a lot of places, and prices are trending downwards instead of upwards. If you happen to have gotten yourself a house with a significantly more complex roof than is typical, bigger than average, or opted for a more expensive material, I can't help you.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Blossom73",
                                    "body": "Not at all comparable. \n\nFoster parents get a monthly stipend for each child. from the state. So, you have whatever income you earn, *plus* that stipend.\n\nAnd then Medicaid as well, so you don't have to provide medical insurance for the foster kids, or pay for copays, deductibles, coinsurance, or prescriptions for them.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SBSnipes",
                                            "body": "\\*sigh\\* yes, I do get a stipend, I also have 2 bio kids, and the fun thing about a stipend is you still have to get the stuff with it, so you still know how much it costs.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Blossom73",
                                                    "body": "Sure, but no one is paying OP a stipend for her kids, so not a comparable situation. She has to make do with only her income.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "SBSnipes",
                                                            "body": "Nobody's paying me a stipend for my bio kids, and the stipend I get for the foster kids typically doesn't cover their expenses, in addition to non-typical expenses like pull-ups for older kids, taking unpaid time off of work because DSS/CPS transport forgets to take them to their visits half the time, etc.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Blossom73",
                                                                    "body": "Fair enough. Thank you for fostering. \n\nI was just saying that everyone's situations are unique. What works for one family may not for another.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SuddenContest4495",
                            "body": "Make up is not necessary if you work in an office. Signed a woman who works in an office",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jsboklahoma1987",
                                    "body": "It’s definitely an individual preference. However, 90% of the women I work with do to some degree. A lot of the time (unfortunately) you are viewed as less put together, look tired etc by others which can affect your life inadvertently and if you think it doesn’t I promise it can. Now obviously it doesn’t apply if you’re naturally glowing and beautiful but not everyone is made that way.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MoreSunsetsPlease_",
                            "body": "Don’t forget those sneaky things like streaming services, Apple storage, phone bill wasn’t listed, nor was internet. These add up too. \n\nWe make $3500/mth ish by hubby (+ my smaller income) and it really adds up. No car payments, no mortgage or rental fees/insurance or medical ins, but we’re paying for our immigration cash and will flip that to savings once it’s paid for. That’s about $1700/mth. \n\nI keep track of everything, honestly thru every dollar. It was worth the cost, but really gives the full picture of where everything goes. (Been using it for 6yrs. Got us debt free in Canada before immigrating to the US).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyOpinionYourEars",
                    "body": "Property Taxes if not included in with her mortgage",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SBSnipes",
                            "body": "Good catch, so that would likely bump up to \\~$900-1k depending on state, drops remaining to around/just under $1k, and there's still health insurance. Also I forgot utilities, seems likely a small home, but still probably \\~$300+",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WolfOffSesameStreet",
                    "body": "Looks like you care more about the OP's financial situation than the OP since they absolutely refuse to give any kind of breakdown of monthly expenses after many people asking.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "He_Who_Knocks",
            "body": "Your problem is not being born into wealth. Look into mutual aid and skill sharing networks in your area, take advantage of food banks and local buy nothing groups for toys/clothes for the kids. \n\nWithout adding a second job you are at your limit. This is unfortunately why politics are important because an increased child tax credit would net you an extra 12K a year, effectively raising your monthly budget by a thousand dollars allowing you to invest and save for retirement.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Get_Back_Loretta_USA",
            "body": "A side hustle, and mental and physical fortitude is a must. It doesn’t have to be forever. But to get over the hump and/or lead to new opportunities mental toughness and internal strength is a must. What other option do you have? You got this!",
            "score": 3,
            "replies": []
        },
        {
            "author": "adrian123456879",
            "body": "I think people are not investing anymore, they are spending it all the new normal is you have 0 in your account at all times and 20.000 debt in credit cards",
            "score": 3,
            "replies": []
        },
        {
            "author": "wolfofone",
            "body": "What is hitting your account each paycheck? Are you doing your tax withholdings to not get a refund? Is your health insurance or homeowners insanely expensive? Where is your money going?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-Sleep8958",
            "body": "If you can’t cut, you’ll have to focus on earning more. Get a side gig or switch to a higher paying job. It’s hard right now, but even though you don’t have money to invest, you can still invest your time to go into a higher paying job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Horroz330",
            "body": "How far are you away from your work? Recently I have saved a lot of money by biking to work instead of driving.\n\nIt takes some extra time, but doable depending on your situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stanleytucci11",
            "body": "You can go to food pantries",
            "score": 1,
            "replies": []
        },
        {
            "author": "InTheMomentInvestor",
            "body": "24 an hour is not.enough for 3 people",
            "score": 1,
            "replies": []
        },
        {
            "author": "zerthwind",
            "body": "Sadly, you need a side hussle.",
            "score": 1,
            "replies": []
        },
        {
            "author": "404unotfound",
            "body": "It would be helpful if you posted a breakdown of your budget if you want tips. If you just want to vent that’s okay though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thick-Fudge-5449",
            "body": "I mean, you might be able to get groceries cheaper. I just buy rice, dry beans, potatoes, and whatever is on sale for meat, usually chicken thighs or pork chops. Obviously work some fruit and vegetables in there when that particular fruit or veggie is in season they become significantly cheaper",
            "score": 1,
            "replies": []
        },
        {
            "author": "youtheotube2",
            "body": ">If the economy keeps going like this I'd imagine we're due for a big recession since by the looks of it\n\nMaybe, but probably not tbh. The stock market is so disconnected from reality at this point. Homelessness will keep rising as more people drown under high prices, but the billionaires and Fortune 500 companies will keep raking in __our__ money. They’re doing great",
            "score": 1,
            "replies": []
        },
        {
            "author": "Free-Pound-6139",
            "body": "If you care post your full expenses here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MsTerious1",
            "body": "It's getting worse all the time. COVID especially, followed by the Russian war on Ukraine that affected shipping routes all gave rise to sharp and sudden price increases on so many things, which then triggered secondary rises, none of which involved actually keeping wages in line with those jumps. \n\nI'm privileged to have a decent income. I cannot imagine how people making $20 an hour are doing anything for fun these days without going into debt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual_Bite_793",
            "body": "Lol, your Ira won't matter in a year. We are a sinking ship bro.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Wanna_make_cash",
            "body": "Retirement is for the middle class and above, unfortunately",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mediocre_Ad_9136",
            "body": "Also be careful about cancelling garbage pickup. If the board of health finds out and the disposal company will notify them you can be fined edited to add that you should check your local ordinances. My disposal company reported me to my town and I had a $1000 fine which is way more than $40 a month. But down vote away",
            "score": -5,
            "replies": [
                {
                    "author": "insecurecharm",
                    "body": "Everywhere I've lived,  it's either a municipal service provided by taxes or you deal with your own removal either by outsourcing or doing your own dump runs. As long as there's no buildup of garbage there's no code violation.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Mediocre_Ad_9136",
                            "body": "My town has an ordinance that everyone has to have garbage service and I got fined for doing the same thing. Just something to consider because a fine can be more expensive than service since most stuff is unfair for poor people. Don’t know why it was downvoted. It’s worth checking because $1,000 fine blows.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyOpinionYourEars",
                    "body": "She’s bringing trash to her work bin.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PantasticUnicorn",
            "body": "One idea is since the car is paid off, cancel the car insurance, and use public transportation. Unless you live in the middle of nowhere, a car is a luxury and a privilege, and not using it will save you money from gas and car insurance. That, and look at potentially carpooling with some coworkers. Are either of the kids teenagers? Because they can go out and get a job and help with the household expenses too, even if its a small part time one.",
            "score": -3,
            "replies": [
                {
                    "author": "nuskit",
                    "body": "Something to consider before canceling car insurance  -- when you go to restart it, the cost will be significantly higher.  This is because going without insurance presumes that you are an irresponsible person or display risky behavior by driving while uninsured.  I sold insurance for many years, and that bit always got people.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpiderWriting",
            "body": "I do DoorDash. I make good money at my day job. Have no debt. Mortgage on my condo is $615 per month. I save, save, save.",
            "score": -1,
            "replies": []
        },
        {
            "author": "mixed_breed101",
            "body": "Join the military",
            "score": -5,
            "replies": []
        }
    ]
}