{
    "title": "it’s so lonely",
    "author": "Mother-Mortgage226",
    "subreddit": "povertyfinance",
    "rank": 11,
    "score": 12,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/povertyfinance/comments/1jeh99f/its_so_lonely/",
    "id": "1jeh99f",
    "selftext": "I’m very grateful to have found this group, because I feel like I’m drowning constantly. I work two jobs (am a teacher and tutor every day) and it’s not enough. I’m giving my all and it just feels like no matter what I do, I’ll never be free financially. I haven’t told any of my friends about what’s happening and it feels super heavy on me each day. Anybody else feel this way? Any words of encouragement to not feel as anxious or ashamed about my situation? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This post has been flaired as “Vent”.  As a reminder to commenting users, “Vent/Rant” posts are here to give our subscribers a safe place to vent their frustrations at an uncaring world to a supportive place of people who “get it”.  Vents do not need to be fair.  They do not need to be articulate.  They do not need to be factual.  They just need to be honest.\n\nUnlike most of the content on this subreddit, Vents should not be considered advice threads.  In most cases it is not appropriate to try to give the Submitter advice on their issue.  In no circumstances is it appropriate to tell them “why they are wrong” or to criticise them, their decisions, values, or anything else.  If there are aspects of their situation that they are able to directly address themselves, the submitter can always make a new thread with a different flair asking for help once they are ready to tackle the issue.\n\nVents are an emotional outlet, not an academic conversation.  Appropriate replies in these threads are offering support, sharing similar experiences/grievances, offering condolences, or simply letting the Submitter know that they were heard.\n\nAs always, if there are inappropriate comments please downvote them, REPORT them to the mods, and move on without responding to them.\n\nTo the Submitter, if you DO want discussion to be focused on resolving your situation, rather than supporting you emotionally, please change the flair of this post, and then report this comment so we can remove it.  Thank you.\nThank you all for being a part of this great financial advice and emotional support community!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/povertyfinance) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Avenged_7zulu",
            "body": "I'm the same. I'm greatful i found this thread and i'm also grateful you're hear. Good thing to notice you've posted as \"Vent (no advice/no criticism)\". Since you tagged it as such some may feel reluctant to provide any advice or constructive criticism. I'd love too hear more of your story and see what helpful ideas this community might be able to provide but more people will probably give feed back if you make another post and use a different \"flair\". I could be wrong. I've seen some pretty strict sub reddits before. But you aren't alone and people here for the most part know what its like and want to help.",
            "score": 3,
            "replies": [
                {
                    "author": "Mother-Mortgage226",
                    "body": "Totally. I have a very secure understanding of my path, and have made many changes according to people in my life as well as research in this sub. This post is more venting because it’s just hard to take on these transitions and live life when I’m feeling so lonely and anxious about everything! It’s hard to see progress even if it’s there, and it’s hard to stay motivated within it all. Thank you for your kind words.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Avenged_7zulu",
                            "body": "I actually made a post that was in the same vein and I was lucky enough to receive dozens of good responses that as i said \"help me get my head on straight\".  I come through reddit fairly often. Hopefully we will get to chat again soon.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "povertyfinance-ModTeam",
                    "body": "Your post has been removed for the following reason(s):\n\nRule 10: Asking for or offering donations/loans/crowdsourcing\n\nNo soliciting, offering, or accepting public or private donations, loans, or crowdsourcing.  All aid given must be in the form of information or advice. We do this in order to prevent this community from potential scams (because we have no way of verifying need/authenticity of requests), and to prevent the sub from being inundated with requests for aid (because it can be unreasonable to ask others in poverty to give their limited resources).\n\nThere are other subs such as r/Donation, r/assistance and r/randomactsofkindness that could help. Also check out our wiki with food resources. Thank you:\n\nhttps://www.reddit.com/r/povertyfinance/wiki/foodbanks\n\nPlease read our [subreddit rules](https://www.reddit.com/r/povertyfinance/wiki/rules). The rules may also be found on the sidebar if the link is broken. If after doing so, you feel this was in error, [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fpovertyfinance).\n\nDo not reach out to a moderator personally, and do not reply to this message as a comment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mind8mischief",
            "body": "My words of encouragement or even a sliver of advice is. I’ve been there. I was a teacher too. Overworked, underpaid. And now I’m going through the aftermaths of that career. My advice to you is GTFO of being an educator. If you’re not a professor teaching at a uni IT IS NOT F WORTH IT. Don’t get stuck there. Obviously you are struggling financially if you’re working two jobs. Obv. You are not happy with where you are in life. Study something else, apply to other jobs that you don’t qualify for- you might get a shot. But for the love of god leave the teaching job. I left my teaching job this past summer and now make $5 more working at a business office I had little experience for. I switched my career completely. There is no money in being a teacher or tutor. It’s tough, it’ll take some time, but get out or you’re stuck in this endless cycle of  needing money and being tied to a job that doesn’t cut it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SoullessCycle",
            "body": "(Psa you marked this vent; we’re not supposed to give advice on those.)",
            "score": 0,
            "replies": [
                {
                    "author": "Mother-Mortgage226",
                    "body": "yeah, fair, I guess let me rephrase to words of encouragement!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}