{
    "title": "BOMBSHELL: USAID Sent $9.3B to Terrorist States Responsible for Killing 3,000 American Soldiers",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 464,
    "score": 109,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 49,
    "url": "https://conservativeroof.com/usaid-sent-9-3b-to-terrorist-states-responsible-for-killing-american-soldiers/",
    "id": "1inup8j",
    "selftext": "",
    "comments": [
        {
            "author": "SideRepresentative9",
            "body": "Let’s wait for the evidence …  since the 50Mill Condom-scandal turned out to be not Gaza in Israel but a county or city in Africa.",
            "score": 30,
            "replies": [
                {
                    "author": "R3ditUsername",
                    "body": "This guy gets it.  Initial reports and news on anything are deceivingly void of detail.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "StigMX5",
                            "body": "For a reason I'm sure.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TestPilot68",
                    "body": "It turned our to be 60 mil, mostly in Africa. U S taxpayer should not be paying for African condoms. Period.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "SideRepresentative9",
                            "body": "Well first of all it’s, in the Christian tradition of the USA, a good thing to do. Secondly as one of the richest countries it always was a „giving back“ Kind of thing.\nPlus USAID is probably a huge CIA front to control, direct and change countries and their path - in many regards: social, political, economical, …",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "FerretOnReddit",
                                    "body": "As a fellow Christian I get that... but 60 million? That's overkill.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SideRepresentative9",
                                            "body": "It’s probably not just for condoms - I guess it’s to combat HIV. Plus if you think about it:\nCondone let’s say 50 cents = 100 mil condoms. 34 million people in Mosambik. Let’s say half is an adult (which actually doesn’t say anything about your sexlife) wich is 17 mil. So everybody gets about 5-6 condoms … mehhh",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "FerretOnReddit",
                                                    "body": "It's still way overkill, like a better use of the money would be setting up \"condom factories\" (if those are even a real thing) or something. I don't know for sure. But there's plenty of ways we can still help fight HIV/AIDS in 3rd world African countries while not overspending.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "soupdawg",
                    "body": "Still not a great thing to spend 50 million on.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "StigMX5",
                            "body": "Again, it wasn't 50 million.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TestPilot68",
                                    "body": "It was 60 million\n\nhttps://www.statnews.com/2025/02/07/trump-usaid-malaria-tuberculosis-funding-restored-waiver-granted-foreign-aid-freeze/",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SideRepresentative9",
                            "body": "Why not? HIV is still a huge problem in parts of Africa - plus it’s literally the job of USAID",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "TestPilot68",
                                    "body": "Because it's not the job of the US taxpayer to provide medical services in Africa.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "SideRepresentative9",
                                            "body": "No but it’s USAIDs job to do that. Since the 1960.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "shakennotstirred72",
                                    "body": "Why do the taxpayers of the United States need to foot the bill for them? It's time our money took care of the citizens of this country.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "SideRepresentative9",
                                            "body": "Most likely it is: USAID always was believed to be a CIA undercover mission. So what they allegedly do is control a lot of stuff in other counties for the USA. So actually good! Plus the Bible says: „ordo amoris“",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "giff_liberty_pls",
            "body": "Yikes this article is crazy. The language and reporting both seem wildly biased. Using quotes around West Bank and saying \"terrorist areas occupying Israel\". Meanwhile no proof that any of this aid went to terrorist groups indirectly or directly. We know the war in Gaza was pretty brutal, we've been fighting for the last year to show that Israel isn't doing a genocide because they've been trying to aid the Palestinian civilians there, *with the help of the US*. You can, and should, be pro Israel and anti-Hamas, but this is just radical goofiness.\n\nIdk what the Somalian government is responsible for, that really just seemed like an excuse to complain about Ilhan Omar which is a fair thing to do but doesn't feel relevant, or at least the article failed to mention any reason it might be relevant. Obviously there's terrorists *within* Somalia, but it's not like Somalia is known by everyone as a terrorist supporting country the way Iran is. Not worth my time to read into right now tbh but if anyone knows more about Somalia let me know I guess, this article didn't.\n\nI haven't finished reading the 133 page SIGAR report that just came out (or any before then), but we have statements from members of Congress about spending in Afghanistan after the withdrawal. So at the very least it isn't news, but after the reading the rest of this article I have very low expectations their interpretation of the situation is accurate, especially when they claimed the money was entirely unaccountable and there was no cooperation with SIGAR at all.\n\nSo, overall, this article feels like dogshit and more propaganda than reporting. According to the statement from Chairman McCaul about a SIGAR report that I referenced earlier, the taliban got nearly $11 Million of the money that went to Afghanistan after the takeover (out of 2.8 billion). That's unacceptable and I'd rather see an article about that real thing than this slop that throws a big number at you with no information about it at all.",
            "score": 8,
            "replies": [
                {
                    "author": "FerretOnReddit",
                    "body": ">We know the war in Gaza was pretty brutal, we've been fighting for the last year to show that Israel isn't doing a genocide because they've been trying to aid the Palestinian civilians there, *with the help of the US*. You can, and should, be pro Israel and anti-Hamas\n\nOut of morbid curiosity I went in r/palestine earlier... and I felt sick by what I saw. Everyone in that sub is a brainwashed idiot. Every last one of them. And if they saw this statement you just said, they'd freak the fuck out, because they've been in their echo chamber for so long that they can't face simple facts, like Israel being the homeland of the Jews, and \"palestinians\" being the ones who don't belong there, or the fact that Hamas is a proxy of ISIS",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TestPilot68",
                    "body": "Its only dogshit because you agree with US taxpayers providing foreign aid. However, most taxpayers do not and the article was quite clear about where the monies are going.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "giff_liberty_pls",
                            "body": "The article wasn't even clear enough to tell you how much money is going to Gaza vs the \"West Bank\".\n\nThis has nothing to do with agreeing about foreign aid or not, it is just a question of detail and accuracy in information. This article seems to lack both. If there's a particular thing in this article that is informative or accurate with any details about the funds, let me know I'd love to see. But I read the whole article and it has no substance whatsoever. How does the money going to the Somalian government fund terrorists? How about the money in Gaza? How about the money in Afghanustan? All we know is the location these funds are going. Nothing else. You can find more information somewhat easily in other articles. It's out there, just not here.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TestPilot68",
                                    "body": "The thing is, US taxpayers don't care about where it goes once in Somalia. It should never be in Somalia. Same with Gaza, and Afghanistan.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "giff_liberty_pls",
                                            "body": "Then why does this article matter at all? USAID spends money outside the US (its only purpose, mandated by Congress btw) should be your headline. Unless you mean to say foreign aid can be good for the US, just necessarily never in these locations? Because that's a heavy claim. Again, unsupported by anything here since nine of the infirmary here is in any way meaningful.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LakeLoverNo1",
            "body": "I’m so glad all this corruption and stupid spending is being uncovered and communicated transparently",
            "score": 2,
            "replies": [
                {
                    "author": "StigMX5",
                    "body": "Transparently would be showing the American people the data and the info.  Saying a dollar amount in some faceless website is not transparency. \n\nI'm happy that people are looking at waste, but DOGE is far from transparent",
                    "score": 0,
                    "replies": [
                        {
                            "author": "LakeLoverNo1",
                            "body": "What data has the government ever provided timely?  Btw - what about Biden admin saying they weren’t spending FEMA money on illegals - yet just last week $59 million of FEMA money was discovered paying for luxury hotels in NY.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "StigMX5",
                                    "body": "I've not seen factual details on the 59M reported yet .  If you have a link that shows what was spent, and to what organizations, that would be great.  I've only seen it mentioned but with no details either.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TestPilot68",
                            "body": "The data always comes out after the political points are scored. It's like you have no clue how it works.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Feeling_Dig_1098",
            "body": "Need more media on this to fact check this. I wouldn’t doubt it though. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "LordZombie14",
            "body": "Odd... that doesn't sound like aid to the US.",
            "score": 2,
            "replies": [
                {
                    "author": "Agreeable-Shock34",
                    "body": "Thats because it stands for the US Agency for International Development",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Agreeable-Shock34",
            "body": "A question we need answered here:\n\nWas this cash sent to these areas or was it goods and pay for the boots on the ground (doctors, nurses, truck drivers). These countries do have citizens who are innocent in the behaviors of their governments.",
            "score": -1,
            "replies": [
                {
                    "author": "TestPilot68",
                    "body": "Praytell, why is that a US problem to solve?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Agreeable-Shock34",
                            "body": "Because soft influence is valuable. Influencing people of different countries can sow discontent with unfriendly regimes and can also ensure that those regimes never come to power. The best way to sow discontent is to provide something of value: food, water, goods, jobs, access to information, etc. Weve been doing this for 200 years pretty successfully all things considered.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "shakennotstirred72",
                    "body": "I don't think that matters either. The people of this country have had to make due for years while we waste money on bullshit kickbacks that are disguised as aid to other countries. It's time for America first. Fix our own problems first. Then give aid.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Agreeable-Shock34",
                            "body": "I mean, we can differ on support for humanitarian aid, personally I see significant value in soft influence abroad. As for fixing our problems at home, while i do agree, most of those problems aren't things the government can fix. Homeless, addiction, hunger, there are resources for all of those yet the problem is not solved.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "shakennotstirred72",
                                    "body": "You don't think that all that waste that has been uncovered couldn't help the American people? Our tax money goes to foreign countries while we have plenty of people here that could benefit, also.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Agreeable-Shock34",
                                            "body": "I mean, im open to hearing how it could help, i see a lot of cutting but no plans to help the American people who have been suffering for 4 years.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}