{
    "title": "USAID Hearing Airs All the Jaw-Dropping Receipts",
    "author": "M_i_c_K",
    "subreddit": "Republican",
    "rank": 419,
    "score": 158,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 19,
    "url": "https://townhall.com/tipsheet/miacathell/2025/02/13/usaid-congressional-hearing-n2652163",
    "id": "1iorcqd",
    "selftext": "",
    "comments": [
        {
            "author": "Frequent-Worth5202",
            "body": "The greatest house cleaning in US history....I knew nothing of \"USAID\" prior to this....most Americans didn't....God Bless Trump, Musk and we sane Americans.",
            "score": 51,
            "replies": []
        },
        {
            "author": "depwnz",
            "body": "66 million USD for vasectomies on Congo?",
            "score": 14,
            "replies": [
                {
                    "author": "overide",
                    "body": "The vasectomies only cost 50k, the rest went in someone’s pocket.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "tomcat91709",
            "body": "Time for the Dems to start hiding from justice, if they can, or prosecuted to the max when they can't.  Including good ol' George Soros...\n\nI bet they'll scream lawfare!",
            "score": 24,
            "replies": []
        },
        {
            "author": "M_i_c_K",
            "body": "Waves 👋 at woke imbecile humping the down vote button for pure sexual gratification. 🤣",
            "score": 29,
            "replies": [
                {
                    "author": "LarryMyster",
                    "body": "They do not care. They must obey their masters. Common sense means, let’s dress up as a clown.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Substantial-Raise144",
            "body": "I just wonder how many kick backs those bastards got!!! Trump/Musk taking care of business!! 🇺🇸",
            "score": 7,
            "replies": []
        },
        {
            "author": "jacktdfuloffschiyt",
            "body": "Can someone please help me understand this? \n\nCongress approves the USAID budget every year? \n\nUSAID has a public record available to anyone and the use of its budget has congressional oversight? \n\nSome of the USAID programs for “DEI” and “pro-LGBT” have been around for years, some dating back to 2015 according to this article. \n\nAlso, when I search the USAID website, all the supposed DEI initiatives are very vague. Is there another source investigating how these funds were used? \n\nI don’t enjoy seeing how millions of our tax dollars are being spent on silly programs. \n\nIf eliminating these programs brings suffering to people around the world, then that’s not our problem. It’s their fault for not having a developed country right? \n\nIt’s time to help the people in America first. Do people think Trump should get rid of more social programs in the US too? No more social security, Medicare, etc? \n\nRun the government like a business, America will be rich and it’ll help everyone.",
            "score": 6,
            "replies": [
                {
                    "author": "Whiterlight9",
                    "body": "Thats the key point, these were all congressionally sanctioned and reviewed so its not as clean as the republican rhetoric is spinning it \"democratic fraud\", \"hidden espenses\"..etc. \n\nThat said, im not against eliminating foreign social programs being paid for by our tax dollars for random stuff. Emergency humanitary aid Im for (within limits). Preventative programs to teach and prevent future emergencies - thats where things can get messy in the details.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fuck-face-actual",
                    "body": "I think the point is to get rid of social programs we are funding in other countries. There is nothing wrong with social security, WIC or food stamps. Granted we need to get the fraud out of that. Being fat shouldn’t make someone eligible. Multiple generations being on welfare starting at 18 needs to be investigated. I don’t think we need to get rid of our programs, but make sure the fraud is investigated and prosecuted. But the silly programs abroad, yeah, cut that 100%.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "juliusnvincevega",
            "body": "If we desire respect for the law, we must first make the law respectable.\n\nLouis D. Brandeis",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roudyrepublican",
            "body": "I wanna see people rotting in jail cells and that's putting it nicely because I don't think they even deserve the tax dollars it would take to sustain them. A box of ammunition is only $150...",
            "score": 1,
            "replies": []
        },
        {
            "author": "shiparoundfindout",
            "body": "That’s so cool",
            "score": 2,
            "replies": []
        }
    ]
}