{
    "title": "DOGE Website Hacked and Defaced — Internet Laughs at Musk: 'These Experts Left Their Database Open'",
    "author": "quaifonaclit",
    "subreddit": "Republican",
    "rank": 405,
    "score": 53,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 87,
    "url": "https://dailyboulder.com/doge-website-hacked-and-defaced-internet-laughs-at-musk-these-experts-left-their-database-open/",
    "id": "1ipdm49",
    "selftext": "",
    "comments": [
        {
            "author": "muxman",
            "body": "Oh no. Someone was able to hack their website. That must mean all the government waste they've uncovered is not valid and the wasteful spending needs to be put back.\n\n*The completely stupid point dems think this makes...*",
            "score": 29,
            "replies": [
                {
                    "author": "Beautiful-Tie1974",
                    "body": "Agreed. It interesting because I know they will say exactly this on MSNBC tomorrow. Mark my words.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deserter15",
            "body": "Why have I only seen 3 different sites with identical articles on this?\n\nAnd do these hackers allege that Cloudflare pages makes the site inherently insecure?",
            "score": 8,
            "replies": [
                {
                    "author": "JustOldMe666",
                    "body": "I hadn't seen it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RavenousFlerken",
            "body": "Musk has a reputation for pushing things out the door that are not fully tested and verified or setting unrealistic timelines for project milestones. That is not to take anything away from the success he has had. He is a very intelligent and motivated person with high expectations.\n\nI think this is what happens when ego precedes technical capacity, planning, execution and testing. But he is not the only tech CEO to be guilty of this pattern. There have been plenty over the years.\n\nThis may also be a problem with his young and lesser experienced employees at DOGE. Experience in the tech business teaches you a lot about what NOT to do. Like setup a website and make it public without securing it first as being one of the most basic.\n\nIt is an embarrassment to the efforts of cleaning up government waste. We seriously need to clean up the federal spending BS. I am just not sure he is the right guy to be leading the effort.",
            "score": 22,
            "replies": [
                {
                    "author": "Im_still_at_work",
                    "body": "\"He is a very intelligent and motivated person with high expectations.\" makes absolutely no sense when immediately following  \n\"Musk has a reputation for pushing things out the door that are not fully tested and verified or setting unrealistic timelines for project milestones.\"\n\n  \nA very intelligent person would not set unrealistic timelines like that. A very intelligent person would not push out things not fully tested and verified.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "RavenousFlerken",
                            "body": "He would if he is intelligent about manipulation, greed, and ambition. Just uses it the wrong way.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fuck-face-actual",
                    "body": "Musk didn’t make the website. \n\nThe website wasn’t hacked. \n\nAll .gov websites have the same standards. They didn’t have musk sit down and build the site himself. Lol.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Existing-Bug3109",
                    "body": "So, not an efficient process? In less words, ofc.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "RavenousFlerken",
                            "body": "No. It is a sloppy process.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Agreed. Let’s use a scalpel not a chainsaw. I’d even settle for a machete.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "uskevinmc",
                    "body": "Read the bible, you are thinking too much about this physical world lol",
                    "score": 0,
                    "replies": [
                        {
                            "author": "RavenousFlerken",
                            "body": "Spare me your proselytizing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fuck-face-actual",
            "body": "I don’t think it was hacked… \n\nI checked the doge website right after and the site looked totally normal. \n\nI think this is low quality trolling by the left.",
            "score": 2,
            "replies": [
                {
                    "author": "No_Virus_7704",
                    "body": "Ya think???",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Fuck-face-actual",
                            "body": "You’d be surprised how many people see a photo and do 0 research and accept it as fact.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "No_Virus_7704",
                                    "body": "Would not be surprised at all. The shallowness of the left is profound.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Fuck-face-actual",
                                            "body": "I mean, you’re not wrong. It’s mostly woke lefties I’ve seen just eating it up, but even some on the right believe this is real. Completely ignoring the fact that all gov websites are made the same with the same security. It’s not like Musk made the website himself. Lol.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "No_Virus_7704",
                                                    "body": "You're too deep. /s",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dasmahkitteh",
            "body": "The honey trap theory is pure cope. Sorry guys. But that doesn't mean doge is incompetent \n\nIntelligence agencies have libraries full of exploits for every device you can imagine, even for devices going back decades. They keep them private so that they aren't patched. Just one of them would enable this kind of attack on doge\n\nYou could have the most secure setup imaginable, following all the best practices, and it won't matter if they know a secret way in",
            "score": 16,
            "replies": [
                {
                    "author": "monocasa",
                    "body": "There's no fancy TLA exploit.  Just amateur hour work that wouldn't pass muster at a third rate engineering firm.\n\n\nhttps://archive.ph/2025.02.14-132833/https://www.404media.co/anyone-can-push-updates-to-the-doge-gov-website-2/",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Dasmahkitteh",
                            "body": "It looks like they left api access points wide open according to this. If true this is actually incompetence and I was wrong",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "aecyberpro",
                            "body": "I’m sure that the DOGE team are the ones who created and updated the website, right? No, they are probably busy auditing the government and they have other people assigned to take care of stuff like that. 🤦‍♂️",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "monocasa",
                                    "body": "They are.  This is what they were doing before the EO came down, so that the website could be up same day.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "phixitup",
                                    "body": "Are they auditing though? I thought that they were programmers.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Dasmahkitteh",
                                            "body": "Some are programmers, some are financial analysts",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Yeah but this is a 101 error. Not even a vuln let alone a zero day.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LowFlowBlaze",
            "body": "the optics aren’t good, regardless if it was a honey pot trap. I’d rather us have an impenetrable security than a “gotcha!” moment.",
            "score": 7,
            "replies": [
                {
                    "author": "sailor-jackn",
                    "body": "Nothing is impenetrable now. My bank got hacked. T mobile got hacked. The social security administration got hacked. The department of  defense has gotten hacked so many times I’ve lost count. This is just the reality of our times.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Ace_W",
                            "body": "It really comes down to how secure do you want things? \n\nI mean the easiest way to secure a computer is to not network it.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Existing-Bug3109",
                                    "body": "Air gap FTW 🍻",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "sailor-jackn",
                                    "body": "This is true. I was just pointing out that major institutions, even government agencies, get hacked.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "XToEveryEnemyX",
                            "body": "As a former engineer as T-Mobile I can confidently say that they've been cutting back on security measures for years. \nMore times than not it's not even some super sophisticated attack. Mostly low hanging fruit. User error and incompetence is the best and fastest way to compromise a company \n\ndoge is just retarded",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "monocasa",
                            "body": "Banks kind of gave up on good security years ago.  Now they just rely on being able to claw anything back through the swift network.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeftAreTerrorists",
                    "body": "It's just an information website. There's really nothing to hack.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "bibbys_hair",
                            "body": "People acting like the guy who runs Tesla and SpaceX spent his nights programming the DOGE website. \n\nObama didn't write the software for Healthcare.Gov. It's been up for a decade and it's still trash.\n\nIn case nobody noticed, every Federal government website is trash. The fucking FBI website was hacked. \n\nEvery CA .gov website is trash. \n\nLike you said, there's no database on this DOGE website. No leaked social security # or personal data.\n\nIt's a basic website.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "That is the lamest honeypot if that’s what it was tbh",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant-Bid-447",
            "body": "Sounds like what the left is good at. Creating a diversion. While Doge is looking into something else.",
            "score": 4,
            "replies": []
        },
        {
            "author": "IveNoClueWhyImHere",
            "body": "Sharing screen shots of FPDS-NG is hardly any kind of efficient auditing. This is the equivalent of a table sweep. This’s isn’t going to solve anything. It’s just giving the gullible something to chew on.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sarah_Ps_Slopy_V",
            "body": "All of these comments are such cope for daddy Musk...",
            "score": 2,
            "replies": []
        },
        {
            "author": "hekk13",
            "body": "So he says there is fraud but lies about it and then says \"I'm bound to make some mistakes\" when called out. Then he finds more fraud which turns out to be mostly DEI programs that were approved previously. Then he hires young and inexperienced workers to do a very important job... why again? Well he already said it, he'll make some mistakes. But rest assured he tells us that he'll realize and correct those mistakes very quickly. I'm thinking there's not that much actual criminal fraud going on. I don't buy it just because he says it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smakusdod",
            "body": "On the day doge was set to publish their initial findings.  🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "woman-ina-mansworld",
            "body": "Surprise",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Feed-201",
            "body": "They 100% did this on purpose to see who would do what. (maybe I'm giving them too much credit, but it didn't hurt anyone and it's something I would do).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wastedtalent10",
            "body": "Because website security is directly linked to their ability to find wasteful government spending. That is democrat logic for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feeling_Dig_1098",
            "body": "Lets just say that it wasn't deliberate, do people think Musk can't hire the best Cybersecurity agencies to protect the site?",
            "score": -3,
            "replies": []
        },
        {
            "author": "None",
            "body": "I thought this was a Republican forum but it seems it’s nothing like it.",
            "score": 0,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "How about look at the end goal. Saving taxpayers money, accountability, fiscal responsibility etc. Long term it’s for our grandchildren. Not us. The path our country has been on is wrong and could have ended our Republic of Democratic States. It’s a situation that could not have fixed itself. \nTough men create easy times. Easy times create weak men. Weak men create tough times. Etc. Etc. Etc.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "quaifonaclit",
                                    "body": "How about looking at the way things are happening rather that spouting mindless platitudes. ",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "No_Virus_7704",
                                            "body": "There was nothing mindless about that. Compare it to \"orange man bad,\" or \"Elon bad.\"",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "quaifonaclit",
                                                    "body": "Literally every sentence was a mindless platitude. ",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordZombie14",
            "body": "As many times as Musk has set traps for people, I wouldn't doubt it if this was also.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Low-Management-5837",
            "body": "Food for thought: what if that was intentional… to leave it ‘open’. I find it hard to believe (I could be wrong) that any tech entity would leave a site vulnerable w/o it being intentional. Maybe to trap/catch ??? Just a thought",
            "score": -12,
            "replies": [
                {
                    "author": "RedditModsHarassUs",
                    "body": "If I wanted my site to be block chained. I’d intentionally leave it open to being defaced so the people making the decision will hopefully say “okay. We see. Implement the block chain, then we can track the changes while leaving an open record for everyone to see.”",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "independentlywrong",
                    "body": "Hmm you may be correct",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "jkjkjk73",
            "body": "Sounds like a honey hole trap.",
            "score": -8,
            "replies": [
                {
                    "author": "Neither-Strength-336",
                    "body": "Thats what I was thinking a “honey pot” trap. People have been leaking everything in the gov their gonna track all these people down and find these all groups",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Key-Honeydew-9804",
            "body": "🤦‍♂️🤦‍♂️🤦‍♂️",
            "score": 0,
            "replies": []
        },
        {
            "author": "USANewsUnfiltered",
            "body": "Not true, website looks fine\n\n[https://doge.gov/](https://doge.gov/)\n\n![gif](giphy|98maV70oAqIZtEYqB4)",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "Honey pots are made to be easier to hack. There's a reason for them. You get trapped in one, if the maze is good enough you're stuck. But even if it was the website, who cares, it's just updates. They probably built it on WordPress lol",
            "score": -2,
            "replies": []
        }
    ]
}