{
    "title": "WATCH: Dem lawmakers answer USAID funding questions after bombshell report",
    "author": "warhorse500",
    "subreddit": "Republican",
    "rank": 413,
    "score": 11,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.foxnews.com/politics/watch-dem-lawmakers-answer-usaid-funding-questions-after-bombshell-report",
    "id": "1ipfgaz",
    "selftext": "Swallwell is commenting on this? THIS GUY???  Mr \"I got my d--k caught in a Chinese honey trap\"???\n\nSwallwell's idea of eliminating waste is farting while up at a podium.  This guy seriously needs to sit and STFU.",
    "comments": [
        {
            "author": "RogerAzarian",
            "body": "Elon is getting close, and they can't let him reveal what they know he is going to find. This is only the beginning. Its going to get even uglier before it gets better.",
            "score": 2,
            "replies": []
        },
        {
            "author": "phixitup",
            "body": "Instead of contesting the article’s claim that most of Musk’s claims of fraud (which is true), you trot out some sophomoric rumor that has never been substantiated to attack the messenger.  This country is hanging on by a thread and this is your attempt at starting a serious discussion? I’m all for rooting out waste. I’m all for getting independent auditors (after legitimate background checks) into every one of our agencies and finding waste/fraud. I also expect a detailed report sent to Congress so they can do their Constitutional duty of appropriating funds that cuts out waste/fraud. It’s how our government is set up.",
            "score": -12,
            "replies": [
                {
                    "author": "warhorse500",
                    "body": "Get outta here troll.  The fact that the article LED with Swallwell---after all of his well-publicized malfeasances---shows that a \"serious\" discussion was never an option.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Morgue724",
                    "body": "Sending the detailed report to congress is the equivalent to the thief sending an email to his buddies so they can get in on the grift.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "The country also isn’t “hanging on by a thread” 😂. Talk about doom and gloom.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}