{
    "title": "Border Czar Tom Homan Talks to Maria Bartiromo on AOC’s Efforts to Impede Law Enforcement",
    "author": "DEMOCREPUBLIX",
    "subreddit": "Republican",
    "rank": 320,
    "score": 38,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 12,
    "url": "https://youtube.com/watch?v=Khhn2_rQSOw&si=lUo2BxOh6H3eN6Ps",
    "id": "1ir53cg",
    "selftext": "",
    "comments": [
        {
            "author": "odieman1231",
            "body": "I would highly suggest people watch AOC's videos and come to a conclusion yourself if you think she is \"helping illegals hide and avoid detection\". The crux of her videos were that ICE is using their perceived power to avoid legally detaining illegal immigrants. ICE can not show up without a signed warrant from a judge. She simply informed the public that if ICE shows up, ask them for the warrant. This is something everybody in this country already knows. If police show up and want to enter your home, ask for the warrant. This should be what we all want. We never want a situation where an authority can show up to anyone's home and rip them from it without some form of paperwork. If these people get detained without warrants and someone fights against it, these people get released which is exactly the opposite of what Republicans want. \n\nAlso, you can Google \"does ICE need a warrant\" and it lists the exact topics AOC covered in her videos at the very top of the page; \n\n\\*What to do if ICE shows up \n\n* Ask to see a signed judicial warrant\n* Refuse entry if ICE only has an administrative warrant\n* If ICE is arresting you, ask if you can speak to a lawyer\n* Don't lie\n* Don't share information about your immigration status or criminal record without a judicial warrant\n\nYou can consult an attorney if you're unsure about your legal rights\\*\n\nI guess its time to lock up Google.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Doesn't anyone else think the real problem is that everyone in power talks, and talks, and talks? Name a ruling elite who has gone to jail, or one who has been executed for treason.  Hell, even name one who has been expelled from their position. Everyone wants to yak to get sound bytes, but no one actually takes any action. Power & money always take priority over law.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TexasGroovy",
            "body": "You don’r need a warrant if ICE has probable cause a crime is being committed.\n\nIf an illegal alien exists in this country, a crime is committed every second he is here. Thus, you have Probable cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "independentlywrong",
            "body": "AOC is so dumb, the left loves her though.",
            "score": -1,
            "replies": [
                {
                    "author": "SnooFloofs1778",
                    "body": "It’s because she’s dumb.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juliusnvincevega",
            "body": "3 things\n\n1. Why only 60% of us citizens want todeport illegals? Seems low\n2. Wasnt 12 year boy that was raped by illegal alien tranny in AOCs distruct in NY?\n3. Trump team filed a criminal action against NY people, i dont know if AOC was on list, anyone know?",
            "score": -1,
            "replies": [
                {
                    "author": "fromtybee",
                    "body": "AOC was not on the list because she did not commit a crime.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "juliusnvincevega",
                            "body": "Thanks bud",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "fromtybee",
                                    "body": "Happy to help. It seems odd to law enforcement officer of Tom Holman's caliber did not know this speech was not criminal. His behavior is a violation of the 1st Admenment.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "odieman1231",
                    "body": "I'd argue more than 60%. The debate has always been \"how\" it gets done.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "No_Virus_7704",
                    "body": "Impeding law enforcement is a crime. DOJ looking into that charge now.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "juliusnvincevega",
                    "body": "Hold the fck up...  i asked questions about the actual video after watching it and was downvoted for questions?  Not that i give a flying fck about being downvoted for imaginary currency of karma and votes...  but this is republican sub...  fck you goofy ass b1tches that can't read or understand a question.\n\n![gif](giphy|3otOKJruVwZH3213Fe)",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}