{
    "title": "Thoughts on this article? Inside the Trump administration’s error-plagued federal firing spree",
    "author": "Top-Psychology5094",
    "subreddit": "Republican",
    "rank": 300,
    "score": 4,
    "upvote_ratio": 0.54,
    "num_comments (reported by reddit)": 57,
    "url": "https://www.washingtonpost.com/nation/2025/02/17/trump-fires-federal-workers-performance/",
    "id": "1is0ujw",
    "selftext": "",
    "comments": [
        {
            "author": "ddx-me",
            "body": "At some point, we need accountability (actual paper trails) on who and what DOGE is choosing to cut. That guy taking care of veterans getting fired is likely a drop in the water in the government budget.",
            "score": 7,
            "replies": [
                {
                    "author": "Express_Yam1750",
                    "body": "A drop in the water is what leads to corruption. If it’s just a little here and there there becomes a sense that things can be “hidden”. I heard today that they are aiming for 1 Trillon. That’s not a drop!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Top-Psychology5094",
                    "body": "I do wish there was more transparency on how they are identifying fraud/waste/abuse. On a related note, I recently learned about operational audits. For context, Indeed has this [Guide to Operational Auditing](https://www.indeed.com/career-advice/career-development/operational-auditing) and it seems pretty systematic and well organized. When reviewing the guide, it makes me wish it was clearer how DOGE is identifying waste. On top of this, I wish it was clear how DOGE concluded that terminations would resolve the issue.\n\nFor example, in a business, if a project isn't going well, management will determine where to move folks to increase efficiency. i.e. a restructure. So I have also been wondering, if there was waste identified, could there have been a minor restructure to better leverage resources? How did we determine in so many instances that folks needed to be terminated? I'm not saying downsizing is bad 100% of the time. Just thinking about how it could be more transparent to the American public so it was clear what the North Star is. Otherwise it just seems pretty indiscriminate to me.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "drdrdoug",
            "body": "When massive fraud is discovered in any organization, there is always some collateral damage as it is sorted out. That is what embezzlers and fraud artists count on, that nobody will check because it is too big. The WAPO essentially acts as the public relations/propaganda arm of the Washington establishment, and not surprisingly has a vested interest in keeping things hidden. The argument on immigration reform (despite only 1% of us crops being harvested by undocumented persons) is that if we deport people, who will pick our crops -- yes, some farms will be hurt, but that ignores the correction of a massive injustice, at emancipation it was if we end slavery who will pick our cotton, and yes, farmers were hurt, even some innocent ones who owned no slaves, but in order to solve a massive injustice. To focus here on the .000002% who might be temporarily inconvenienced or even upended to bring justice to a system that is so filled with fraud (while not wanting to report on that) is pretty gross, and pretty standard operating procedure for the Post, NYT and LA Times.",
            "score": 2,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "Personally I try to get news from a broad range of sources to better understand different viewpoints on the same topic. For example, Washington Post, Fox News, The Hill, Joe Rogan interviews, Brietbart, etc. The benefit is learning more information about the same topic across sources. The main constraint is scalability - realistically, I can't do that with every article I read. But that's my personal philosophy. Definitely curious to learn what news sources you'd recommend, I'd be happy to add them to my list.\n\nI agree with your comment on immigration reform. While industries would be hurt, it would allow us to take the next step. Which is figuring out how to \"course correct\" after relying on undocumented labor for so long. Also appreciate the connection to slavery and how the history of the end of slavery raised similar questions for the folks that relied on and benefited from enslaved labor.\n\nTo your point, I would be curious what impact this RIF has had on unemployed federal workers. For example, foreclosures, car repos, paying for daycare? As in, what kind of issues do folks face in this economic climate? How long are they unemployed for? Raising these questions because it would be interesting to learn from a data science standpoint what actually happens. Maybe nothing would happen at all and folks would find a job pretty quickly. Which to your point would make this a very brief chapter for federal employees.\n\nAlso, to your point, probationary employees (200k) make up 0.0005% of the population. It is a fraction of the general population. I can definitely see how it would indicate that the issues the article raises are relatively insignificant. But I shared the article because it's a different angle on the administration's goal of shrinking government. For me, it's obvious that shrinking the government will save money. And it's also obvious that it will save tax payers like myself, money. But are there unintended consequences? That's what is interesting to me. Ultimately that's why I shared the article, to kick off a discussion and thoughts. So thank you for sharing your thoughts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "drdrdoug",
                            "body": "Me too on the breadth of news reading. I’m retired and state each day looking at NYT, New York Post, Washington PostWashington Times, Fox and Breitbart, then local news. I spend about an hour as the left sites all have the same stories as each other, right sites, the same thing. \n\n(The hazards of a degree in political science and law degrees who worked in government for 30+ years.)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WildeBeastee",
            "body": "DOGE live tweeting their findings without a report we can actually read is annoying. Elon can say he saved us a trillion dollars but \"trust us bro,\" is not what I voted for. Cutting spending is a bipartisan position.",
            "score": 7,
            "replies": []
        },
        {
            "author": "mikemeyers-90210",
            "body": "Not particularly happy they go after the agencies that control food security,  financial services and grant consumer protection. Those were created because greed driven companies poisoned our food and water, Used toxic materials in children toys and use every loophole to scam elderly and people most desperate. I think we should be tougher on bad actors and root them out",
            "score": 3,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "I agree - it's disheartening to think that our food safety (for example) will take a hit. Especially when thinking about it within the context of globalization. We can't send food inspectors to some factory in India, or China regularly enough to guarantee fidelity. But we can use science to assess incoming produce (for example) and determine if it is safe for the public. I worry this will make it harder for the American public to know when there even is food contamination, because folks who investigate this are gone. Or, if it will mean companies won't announce recalls because they think they can get away with selling contaminated food.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "mikemeyers-90210",
                            "body": "Interesting take",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mr_Ashhole",
            "body": "Why do they keep calling these firings? Are they not layoffs?",
            "score": 1,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "To my knowledge these were firings as the termination letters referenced poor performance as a reason to terminate folks. Here's an excerpt from the article;\n\n>The termination letters hitting inboxes all struck the same note: Probationary workers were getting the ax for poor job performance. But many of those fired had just received positive reviews, or had not worked in the government long enough to receive even a single rating, according to interviews with federal employees and documents obtained by The Post.\n\nIt's accurate to describe them as layoffs in terms of *intent*, but technically these were mass terminations based on the letters the federal employees received. My impression is that it's a loop hole used by the Trump administration to justify firing probationary employees.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mr_Ashhole",
                            "body": "Well that’s not good. This definitely feels rushed.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Top-Psychology5094",
                                    "body": "Yeahhhh",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Top-Psychology5094",
            "body": "Here are some quotes I found interesting. Please note, I share quotes for folks that don't have the capacity to read the full article. But ultimately it's a gift article so anyone can read it for free.\n\nHere's one quote I found interesting,\n\n>The Federal Aviation Administration let go hundreds of technicians and engineers just weeks after a midair collision miles from the White House killed 67 people, eliciting promises from Trump officials to improve air safety, workers said in interviews. FEMA, which handles the nation’s natural disasters, is preparing to fire hundreds of probationary employees, according to four people familiar with the situation who, like others interviewed for this report, spoke on the condition of anonymity for fear of retaliation. The agency is already stretched thin responding to fires in California and floods in Kentucky. And the administration terminated scores of employees who work to bolster the nation’s nuclear defense, only to realize its error and start reversing the firings.\n\nHere's one,\n\n>Internal communications from the Office of Personnel Management obtained by The Post appeared to tie the performance directive to Trump’s plans. In a message sent Friday to agencies, an OPM employee wrote that, because of Trump’s mandated hiring freeze, probationary employees “had no right to continued employment. … An employee’s performance must be viewed through the current needs and best interest of the government, \\[in\\] light of the President’s directive to dramatically reduce the size of the federal workforce.”\n\nhere's one,\n\n>Some employees said the proceedings seemed rushed, the details botched. Termination letters at Education listed the wrong job, or the wrong start date. A legal help number offered in a notice sent to a Small Business Administration employee led to the voicemail for an apartment building, not a lawyer. Some firing letters seemed copy-pasted from a form and left out the name of the agency where employees worked.\n\n  \nhere's one,\n\n>One Transportation Department worker found out he was fired on Valentine’s Day just after putting his children to bed, as he sat down to watch a movie with his wife. An Agriculture employee discovered he was terminated the morning after attending an ex-partner’s funeral. A Natural Resource Conservation Service employee was cut months after the government paid $20,000 to relocate his family to North Dakota.\n\n  \nhere's one,\n\n>Luke Graziani, a disabled Army veteran, was five weeks from completing his probation year on Friday, when he logged into his work computer at the Bronx Veterans Affairs hospital.\n\n>Waiting on the screen was a boilerplate termination email citing performance concerns. Graziani printed out the message and took it to his boss, who was shocked — and promised to submit a request for exemption.\n\n>“You’re critical staff,” Graziani recalled his boss saying. “We’re going to try.”\n\n>Graziani, who is 45 and has four children, had believed until this weekend that his veteran status would protect his job. He served 20 years in the Army, first as a supply specialist and then in public affairs, deploying for two tours in Iraq and another two in Afghanistan before retiring in 2023.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "I think these folks salaries aren’t high enough to warrant waste fraud and abuse personally. Now lobbyists or folks on the hill? Yes go get them. That will make a huge dent. I have a hard time believing park rangers and va hospital workers are the problem here. And to that- let’s start to see these savings pay off elsewhere in the national debt and such",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Thin_Economy850",
                            "body": "Idk how we went from the politicians were the swamp, to the NPS ranger is the swamp. \n\nCongress should be doing its job and creating the yearly budget to keep these departments working as intended.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Top-Psychology5094",
                                    "body": "I agree - how is it that so many folks across the country are part of the Deep State? That a park ranger in Michigan is somehow tied to the ivory tower in DC?\n\nI personally find history to be quite interesting, and as a result, over time I have come to see some of these processes (like Congress setting the budget) almost like an American tradition because it's so old. For context, I learned through [congress.gov](https://www.congress.gov/browse/1st-congress) that the first Congress ever held was in 1789. Definitely speaks to the power of American democracy, and that we in many ways set the standard for other countries. With that being said, I wish this has been done through our time honored traditions. This is part of what makes America special.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Absolutely. Departments shouldn’t be incentivized to max out their budget every year either as it is today. More partnerships with Wall Street should keep prices lower and innovation higher. America should build great products and great minds. That’s what keeps us #1",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "I also think a lot of people have no idea what OIG or the GAO were meant to do. Which they’re clearly not doing very well or we wouldn’t be here. Perhaps they just can’t stand up to any lobbying major corporation or super pac. Either way agreed these cuts to good families hurt what’s best in America.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Top-Psychology5094",
                            "body": "I agree, I suspect these folks are not part of anything improper. For me, the scale of the terminations is really something else. It's occurred across the country, across agencies, regardless of hiring shortages or resource constraints. Even the FAA was impacted, and we had the recent plane/helicopter crash near the White House. For context checkout these articles;\n\n* [AP News: Trump begins firings of FAA staff just weeks after fatal DC plane crash](https://apnews.com/article/doge-faa-air-traffic-firings-safety-67981aec33b6ee72cbad8dcee31f3437)\n\n* [CNN: Hundreds of FAA probationary workers fired by Trump administration, union says](https://www.cnn.com/2025/02/16/politics/faa-employees-fired-trump-administration/index.html)\n\n  \nAdditionally, it seems they didn't consider exceptions to terminating probationary employees. For example, weighing if someone is a veteran, or if someone moved into a new role after decades of service. It's my personal bias, but I would at least consider retaining those folks because of their years of service to the American public. All of this gives me the impression the firings were indiscriminate.\n\nTo your point - I do wish there was a concerted effort to investigate fraud, waste, corruption within the context of lobbyists, bribes, etc. Those are the kind of folks that don't have everyday Americans' best interest at heart. Yet it seems they have even more access than any of us. I've been to DC before. There are so many banks with offices so close to the White House. What kind of message does it send about what our democracy values? Why do these corporations need offices a few blocks from the White House?\n\nTo your final point about national debt - I am also curious to see how these savings will be leveraged. For example, will it be used to pay down national debt? Or are we destroying so much, so quickly, that we will instead need to backtrack and put out fires that affect Americans' safety? For example, air traffic control, food safety, fire safety, etc. Not that I'm implying it's all bad. But ultimately curious to see how this turns out.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Agreed. Small town Americans aren’t the problem. K street corruption and Silicon Valley greed is.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "linuscatt",
                                    "body": "It’s completely indiscriminate. Based only on category of employee (right now, probationary) not merit or the service they provide",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Crosswinds45",
                    "body": "Those are very emotional stories and each could make a great cable movie.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Top-Psychology5094",
                            "body": "It's fair to highlight these as human interest stories. For me, they highlight the personal toll RIFs (reductions in force) have on a single household. It's also helpful to have context on the broad range of impacts. I'm in my corner of the U.S., so I wouldn't necessarily know that there were folks across the country impacted without broader news coverage.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comprehensive-Tell13",
            "body": "Personally I feel that radical individuals are acting on EO's  in negative ways and deliberately causing problems. Probably at the direction of dem leaders who inturn go on the news and extort it. Things are not going to get better tell it gets a lot worse because despite any good intentions the bad doesn't care how bad it gets. In fact the worse they can make it the better. \n\n\nA classic example is in what part of a hiring freeze does it mean start firing people 🤔",
            "score": -3,
            "replies": [
                {
                    "author": "DoNotShake",
                    "body": "The firing and reports I am reading currently impacts employees in their probationary period. I don’t think that was radical individuals making those decisions.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Top-Psychology5094",
                            "body": "I agree. When doing my research, it sounds like they have been targeting probationary employees because they have fewer rights and are consequently easier to fire, even if it is technically illegal since it bypasses Congress and their budget appropriations process. Here are more news articles exploring this topic;\n\n* [Idaho Capital Sun: Federal workforce hit by Trump’s sweeping firings of thousands of probationary employees](https://idahocapitalsun.com/2025/02/16/repub/federal-workforce-hit-by-trumps-sweeping-firings-of-thousands-of-probationary-employees/)\n* [CNN: Hundreds of FAA probationary workers fired by Trump administration, union says](https://www.cnn.com/2025/02/16/politics/faa-employees-fired-trump-administration/index.html)\n\n* [Bloomberg Law: FDIC Fires Probationary Employees Amid Continued Agency Cull](https://news.bloomberglaw.com/banking-law/fdic-fires-probationary-employees-amid-continued-agency-cull)\n* [NPR: Trump's spending cuts target probationary workers. What does the status mean?](https://www.npr.org/2025/02/15/nx-s1-5298182/trumps-probationary-workers-federal)\n\nOf course, I can see how it would be unproductive to have an exhaustive list of articles exploring this topic. But my goal is to highlight that breadth of coverage on this that would indicate this was indiscriminate terminations across agencies, across the country.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gallant_hubris",
                    "body": "This is a very creative way of shifting blame from trumps EO’s back to democrats.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Top-Psychology5094",
                    "body": "Can you provide more context? Just trying to make sure I understand, thanks",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Comprehensive-Tell13",
                            "body": "Nice of you to give me a option 🙂 because of the personal insult I will ignore them both.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Top-Psychology5094",
            "body": "Ack, here is the free gift article that allows you to read it without any paywall:\n\n[https://wapo.st/4b5IDHh](https://wapo.st/4b5IDHh)",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "Unelected bureaucrats have received too much power because Congress has given them authority and refuses to properly oversee their activities, often to avoid responsibility. The Deep State (aka Administrative State for all you Bannonites) is angry that it no longer has a total grip on power with little to no scrutiny.",
            "score": 0,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "Following up again to try to better understand your comment. Can you provide context on what you're referring to be 'unelected bureaucrats'? Do you mean federal employees?\n\nSounds like you're saying terminated federal employees are angry they no longer have a grip on power?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Article I of the Constitution states that all legislative powers herein granted shall be vested in a Congress of the United States which shall consist of a Senate and a House of Representatives. This means that the act of creating and passing laws happens through Congress, elected legislators who are held accountable by their electorates.\n\nFor too long Congress has delegated its legislative authority away from Congress to federal departments and agencies. In theory, this should work as long as Congress properly provides oversight of the agencies and departments they have delegated legislative authority to. But they have not. Congress has not properly exercised its oversight authority which has allowed misuse of taxpayer dollars to occur and the passage of vague and hard to understand regulations by agencies has allowed agencies and departments to abuse the powers granted to them. Also, it’s pretty clear from oversight hearings that members of Congress are more interested in bashing their political opponents and blaming them for everything instead of using that time to properly oversee and hold to account the folks they have given legislative powers to.\n\nAlso, Independent agencies are supposed to be insulated from presidential control, the reality is that presidents have much influence and control over them, meaning that Congress has delegated much of its legislative authority to the executive branch.\n\nDelegating legislative powers away from Congress to federal agencies and departments is also a convenient way for members of Congress to blame someone else for bad laws, rules, and regulations.\n\nPoint is, if Congress wants to make laws and regulations, they themselves must pass it. That is exactly what the Founders intended for when setting up our current system of government. Members of Congress can scream all they want about Trump having too much power, but for decades they deliberately gave the executive branch too much power because it suited their political interests.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Top-Psychology5094",
                                    "body": "Thank you for this explanation! This was very helpful for me.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Virus_7704",
                    "body": "In a nutshell.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Top-Psychology5094",
                    "body": "Can you provide more context? Just trying to make sure I understand, thanks",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crosswinds45",
            "body": "LOVE IT!!! The ones that want to return to work and theyre needed should be welcome back.Ummm,new boss new rules,if not id look for a new job.",
            "score": 0,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "I definitely think on principle if folks aren't willing to work they should look for a new job and leave. Otherwise they're just taking up space that a hardworking job applicant could fill.\n\nI do wonder about the extent of the RIFs with the federal government. For example, checkout this article from [AP: Trump and Musk demand termination of federal office leases through General Services Administration](https://apnews.com/article/trump-musk-gsa-terminate-office-leases-f8faac5e2038722f705587c8dd21ab26). In that case, it seems the implication is that there are more RIFs to come.\n\nI agree there are definitely new rules at play. Folks who don't survive the RIFs will need to look for a job ASAP. At the same time I feel bad for them because of the conditions of the job market. Checkout this snippet from USA Today;\n\n>Hiring rates [are also down,](https://fred.stlouisfed.org/series/JTSHIR) hovering around 3.3% since June compared with 4.6% in 2021, according to the Bureau of Labor Statistics. Discounting the dramatic hiring dropoff amid early 2020 lockdowns, the last time hiring rates were this low was in 2013 when the labor market was bouncing back from the Great Recession.   \n[article: Workers say it's a 'tough' time to find jobs with hiring rates below prepandemic levels](https://www.usatoday.com/story/money/2025/02/01/job-market-hiring-trends/77909818007/)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Crosswinds45",
                            "body": " I read that about the GSA. I take theres confusion with reducing office space and the return to work orders?  Those jobs people had that cant or wont return to work in many cases will cease to exist. Im sure the jobs that are neccessary will still be there,but efficiency many times can mean less jobs.  Federal government has done nothing but grow and arent familiar with how jobs work for the rest of america. Ive lost a job,down to the unemployment office and a job search begins......",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Top-Psychology5094",
                                    "body": "Thank you for sharing your perspective, that was helpful for me!  \n  \nAlso, I can relate - I've faced rounds of layoffs in the last few years. I even had to quit a job once without one lined up. Definitely a tough reality. But nonetheless, as you mentioned, we all have to just find a new job and make the best of it.\n\nI will say, to your point, sometimes it leads to more efficiency. Fewer meetings, less overhead, fewer processes. Especially for larger employers. It has its advantages.\n\nI'm tipping my hand here, but I admit that my spouse was a federal employee who was recently terminated. They helped investigate outbreaks from food contamination. For example, think of anything related to food recalls. My spouse was the newest hire in the last 8+ years. Everyone else (the 3-4 others, literally, in their equivalent role) had been there for decades. In part because it was hard to hire for that particular role. And my spouse was a top performer (captured via performance reviews, organizational-wide awards, etc). Knowing this, I question if *all* probationary employees were terminated because their roles were unnecessary.\n\nAlthough circling to your earlier point - I've witnessed layoffs where the most talented folks were let go because there just wasn't enough money to go around. But even then, it was clear that the plan was to save money by deprioritizing low-priority initiatives. For example, laying off the marketing team and hiring a consulting firm to save money. \n\nIn this case, my impression was that food safety should be high priority. For example, because of globalization, we don't have full oversight into our supply chain. There are so many steps before food reaches the supermarket, let alone our dinner plates. But I guess food safety isn't high priority? Or maybe there will be a new, more efficient way of doing the same thing? \n\nIn the aftermath, these are the questions I have. But ultimately I agree that losing and finding a job is part of life. Definitely unavoidable. Additionally, I agree that the bureaucracy and inefficiencies in our federal government are a symptom of a dire need for reform.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Crosswinds45",
                                            "body": "I actually have sympathy for workers that do lose jobs. Sometimes that good worker might be able to change position but with downsizing probably not going to happen. Im a supporter of private sector  unions but not public sector unions in most cases. a union in the private sectors power is limited because the dont want that business to go bankrupt then everybody loses.   Public sector unions are part of the bureaucracy and are organized against the taxpayers essentially and were 30 trillion in debt.  And Im thinking RFK jr. is concerned about food safety.I dont know too much about him but I believe thats pretty high on his list of priorities. Shoot,they have to fight to get even the corrupt parts of the government out.If they can do that at least,I think would make legit jobs more secure.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Electronic-Yam6502",
            "body": "This is a farm for bots…never seen so many liberals in a republican thread",
            "score": -3,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "For me, I see this discussion as an example of how political identity is a spectrum. For example, maybe there are hardliners who care about this issue, maybe there are more moderates participating in this discussion. I can't say for sure. Regardless, I'm glad we can all participate in civil, thoughtful discourse. Feel free to share your own thoughts on the topic! The more the merrier.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "IrishWolfHounder",
                    "body": "No shit.  We should clearly keep trillions in waste and keep the government taxing us to death because they fired someone maybe they should not have.  \n\nThis is going to be painful and not perfect and “republicans” need to not get their panties in a bunch everytime there is a headline that is critical of something.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Bench_2569",
            "body": "Good start in my book government to lazy to come in sit at desk to work i suppose ever government that trump reduction is great think not like miss them havent work in government building for 4 years trim the fat that money can go to people actually work",
            "score": -2,
            "replies": [
                {
                    "author": "Top-Psychology5094",
                    "body": "I'm definitely all for trimming the fat, especially if it improves government efficiency and reduces the tax burden on Americans.\n\nI think it's fair to want folks to return-to-office, and there are tons of benefits for local economies. Suddenly all kinds of services crop up. Restaurants, cafes, bus drivers, public transportation, etc. It's hard to ignore those benefits, even when remote work allows folks to have so much flexibility. For me, it doesn't change the fact that the most critical folks in our society don't even have the option. Teachers, police officers, fire fighters.\n\nI do wonder where all of the cost savings will go. Maybe to the national debt? Maybe to expand DOGE? Hard to say.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}