{
    "title": "Anyone else feel like this aptly describes their position?",
    "author": "fksakeisaidnobabe",
    "subreddit": "Republican",
    "rank": 204,
    "score": 530,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 209,
    "url": "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8189e984-4331-4f80-bd8a-6d3021614db6_860x573.jpeg",
    "id": "1itjrjl",
    "selftext": "",
    "comments": [
        {
            "author": "ImperialxWarlord",
            "body": "Somewhat. I felt I was fairly to the right until a few years ago. And while some of my views have changed a bit, I mostly feel each side has just gone father and farther in each direction, leaving me stranded in the middle lol. I mostly feel that each party had abandoned the middle, and labeled them Nazis/rinos/facists/commies by everyone to the left and right of us. There’s little ability for many on either side to compromise or moderate. And even worse I see a lack of tolerance on other side, anyone who isn’t agreeing with you is an enemy.",
            "score": 114,
            "replies": [
                {
                    "author": "Cronus6",
                    "body": "> I mostly feel that each party had abandoned the middle\n\nThey have.\n\nWhich is strange since most Americans are pretty solidly middle of the road regardless of party affiliation.\n\n>And even worse I see a lack of tolerance on other side\n\nDo **not** use social media as a guide here. It's very misleading. The malcontents on both ends of the spectrum live on social media and while they are *very* \"loud\" they are not a good representation of where the country really is politically.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ImperialxWarlord",
                            "body": "Yeah, I don’t get why each party does this, they just cater to loud minorities that come out in primaries or raise a ruckus if they don’t get their way. The only reason we haven’t seen one party crush the other is because they’re both stupid and put enough people off lol.\n\nEven beyond social media, I see it on tv and in the average republican and democrat I know. Left wing folk listen to left wing news where left wing politicians aren’t criticized and republicans are demonized. Right wing folk listen to right wing news where right wing folk are never criticized but democrats are demonized. And anyone in the middle who dares to not pick a size is a fascist or a rino.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Cronus6",
                                    "body": "I guess it's the old adage \"the squeaky wheel gets the oil\" transformed for the information age.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "katielisbeth",
                                    "body": ">Left wing folk listen to left wing news where left wing politicians aren’t criticized and republicans are demonized. Right wing folk listen to right wing news where right wing folk are never criticized but democrats are demonized.\n\nTale as old as time. \"Democrats didn't do shit when ___!!\" \"Oh yeah? Well, republicans were suspiciously silent when ___ came out about [republican politician]!!\" \n\nLike, y'all. Their news didn't report on it. They had no idea it happened. You are being manipulated.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ImperialxWarlord",
                                            "body": "Can you explain, sorry, I don’t get what you’re saying?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "katielisbeth",
                                                    "body": "I'm saying in politics we like to say the opposing side supports shitty people when really their news is lying to them, and ours is stoking the flames to keep us divided. Sorry if it wasn't clear, I was running on very little sleep lol.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ImperialxWarlord",
                                                            "body": "Gotcha! Yeah lol the news just lies to us all. Most times when I watch and read various programs and news groups I find that they’re all just detached from reality and lying. And few can really see it because they buy their respective bullshit.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 29,
                    "replies": [
                        {
                            "author": "jonw95",
                            "body": "Have our numbers decreased, or have they gotten louder? :(",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ImperialxWarlord",
                                    "body": "A bit of both, but mainly the latter. I think some moderates have shifted due to toxic news on both sides/become unwilling to vote for the other party even when they hate their candidates/party. But mainly it’s that things are far far more partisan and each party caters to loud minorities in the party.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ImperialxWarlord",
                            "body": "I wish. I would kill for such a thing. It’s much needed in this ever more polarized nation.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LordIzalot",
                    "body": "This",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "kin3tiks",
                    "body": "Preach it. I love this. With that said, it’s amazing we can say that in this sub, but if we said it anywhere else we would be cooked.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ImperialxWarlord",
                            "body": "Even here I feel that while certain right leaning/anti woke etc views can be expressed here where in most of Reddit it can’t be without getting cooked, I feel we have our own intolerances here too. I often feel that any anti trump or just somewhat critical comments on him or his policies is criticized or labeled as leftist brigading. Each side sucks in my eyes lol, it’s just in different flavors lol.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JohannLandier75",
            "body": "I have been a lifelong center right voter who has voted both parties. To be fair both the left and right have run far from the center. For me this is why I struggle with both parties",
            "score": 74,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "I feel you. Essentially you're left begging for a candidate to step up from either side and drag their party back to reality.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "audiophilistine",
                    "body": "In what way, specifically, has the right gone further right? I have considered myself a moderate conservative since I could understand what those words mean. I feel like I've stayed in exactly the same place. I often hear leftists complain about the right going ever farther right, but I'm just not seeing it. Can you explain your perspective?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shaolin__Funk",
                    "body": "The thing is, the further the left goes, the further the right goes. These people cry “Nazi” and “fascist” but it’s them constantly saying that, demonizing people, and pushing these far left agendas and ideologies that are going to make people embrace fascism and nazi’sm. They made the first moves.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Defiant_Giraffe9143",
                    "body": "I’m right of center too, and been one most of adult life once I figured politics out.  Fast forward a few decades, I am  moving righter.  The absolute corruption of the government by the left in the Biden admin time frame assures I will never vote a democrat in a federal election (and probably state too) ever again.  They wanted to control everything that was once free: speech, choice to manage your health, choice on what kind of car you drive, choice on what kind of stove I can buy, this goes on.  They tax everything because they think they can do it better, only to make some bureaucrat richer.  The far left  showed no morals, no ethics, no common sense, fraud, waste, abuse of power.  And the centrist left went along side with them.  Drain the swamp, vote them all out. Establish and enforce ethics.  It’s the only way the democrats could come back from this.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Im_still_at_work",
                            "body": "You're not at all right of center with how you just positioned yourself.\n\nIn one fell swoop you labeled everything Dems do as corrupt, everything they do is in the name of controlling, went on about free speech for some reason, and talked about taxing things to make some bureaucrat richer.\n\nYet, in no manner whatsoever have you mentioned anything regarding republicans pushing too many religious values and beliefs into law (abortion is the obvious one that also seeked to incentivize reporting abortions or tracking people across state lines), aiming to remove people's access to contraception, completely blurring the lines between politics and religion by attempting to put things like the 10 commandments in classrooms through political channels (but ignoring any other religious group's rules or values), putting the richest man in the world (and who has every dominant company he has getting poured government money) be in charge of government spending and efficiency, Nepotism in the Trump family (Kushner getting Saudi money in his time in government position, Ivanka getting Chinese patents in her time in government position), Donald and Melania's crypto rug pulls, among other things.\n\nIf you're center-right then you wouldn't be a \"never a dem in federal election ever again\" and the things you highlighted wouldn't be so coated as \"only dems do this\"",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shaolin__Funk",
            "body": "Pretty much, I’d be a democrat if it were the 90’s or hell even the 2000’s. Before the left actively started hating and othering me simply for being a white dude who has self respect and doesn’t want to submit to self degradation and self hate. They’ve become authoritarian and can’t even see it, or don’t care because they want to be authoritarians with their ideologies. Same as every other self righteous commie and socialist throughout history.",
            "score": 13,
            "replies": [
                {
                    "author": "SnowWhite3366",
                    "body": "This is exactly my experience.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImportantWords",
            "body": "The picture is 100% accurate. Sometimes I look over Bill Clinton's platform from 1996 and realize just how little progress we've made. \n\n[https://www.presidency.ucsb.edu/documents/1996-democratic-party-platform](https://www.presidency.ucsb.edu/documents/1996-democratic-party-platform)\n\nIt's literally exactly what Trump is campaigning on.",
            "score": 5,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "Interesting read, thanks for sharing! I had to get GPT to give me the spark notes lol.  \n  \nFor sure. I mean, there's a few variances in there (free trade v protectionism, pro-choice, gun control, and some foreign policy stuff), but for the most part, not all that different. Sad, really.\n\nThis kind of sums it up early on: \"The economy is stronger, the deficit is lower, and government is smaller\"",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ImportantWords",
                            "body": "I'll pull out some quotes because it really is uncanny how people still want essentially the same things. It's been 30 years and the parties have completely switched sides. Even when you talk about Free Trade, the core of the proposal was to open markets. Exactly what Trump is doing with reciprocal tariffs. When Clinton signed those deals he was opening markets - ending American tariffs in exchange for foreign countries ending theirs. Over the ensuing decades though America has kept its doors wide open while other countries have slowly been shutting theirs. Here is where the Democrats were in 1996:\n\n>In the last four years, the Clinton-Gore Administration has signed over 200 trade agreements, including NAFTA and GATT, **to open markets around the world to American products, and create more jobs for the people who make them here at home. We have put in place the most sweeping agreements to lower foreign trade barriers** of any administration in modern American history\n\nOn Education:\n\n>**We restructured federal education programs and eliminated federal regulations to give local schools, teachers, and principals the flexibility and help they need to meet those standards.** In the next four years, we must do even more to make sure America has the best public schools on earth. If we want to be the best, we should expect the best: We must hold students, teachers, and schools to the highest standards. They should be required to meet high standards for professional performance and be rewarded for the good jobs they do. **Schools should be held accountable for results. We should redesign or overhaul schools that fail. We should expand public school choice**\n\n  \n(Looks like I am gonna have to divide this....)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImportantWords",
                                    "body": "On Medicare:\n\n>We have given Medicare beneficiaries more health plan choices and increased benefits. **We have cracked down on health care waste, fraud, and abuse, saving more than $15 billion in three years. Now we must finish the job -- we can balance the budget while we preserve and strengthen Medicare and Medicaid**, protecting millions of middle class families from being overwhelmed by health care costs for their parents, children, or family members with disabilities.\n\n\n\nOn Crime:\n\n>Today's Democratic Party believes the first responsibility of government is law and order. Four years ago, crime in America seemed intractable. The violent crime rate and the murder rate had climbed for seven straight years. **Drugs seemed to flow freely across our borders and into our neighborhoods.** Bill Clinton promised to turn things around, and that is exactly what he did. \\[...\\]**to answer the call of America's police officers and pass the toughest Crime Bill in history. The Democratic Party under President Clinton is putting more police on the streets and tougher penalties on the books**; and it is making a difference. In city after city and town after town, crime rates are finally coming down. **The Crime Bill is putting 100,000 new police officers on the street.** We deplore cynical Republican attempts to undermine our promise to America to put 100,000 new police officers on the street. **We pledge to stand up for our communities and stand with our police officers by opposing any attempt to repeal or weaken this effort.**\n\n  \nOn Immigration:\n\n>**We cannot tolerate illegal immigration and we must stop it. In 1992, our borders might as well not have existed.** The border was under-patrolled, and what patrols there were, were under-equipped. Drugs flowed freely. Illegal immigration was rampant. Criminal immigrants, deported after committing crimes in America, returned the very next day to commit crimes again.\n\n>**President Clinton is making our border a place where the law is respected and drugs and illegal immigrants are turned away.** We have increased the Border Patrol by over 40 percent; in El Paso, our Border Patrol agents are so close together they can see each other. **Last year alone, the Clinton Administration removed thousands of illegal workers from jobs across the country.**\n\n\n\nOn DOGE:\n\n>The American people have a right to demand that responsibility is the order of the day in Washington. **The mission of today's Democratic Party is to expand opportunity, not bureaucracy.** We have worked hard over the last four years to rein in big government, slash burdensome regulations, eliminate wasteful programs, and shift problem-solving out of Washington and back to people and communities who understand their situations best.\n\n>In the last four years, President Clinton, working with the National Performance Review chaired by Vice President Gore, **has cut the federal government by almost 240,000 positions, making the smallest federal government in 30 years. The federal government is eliminating 16,000 pages of outdated and unnecessary regulations, has abolished 179 programs and projects, and saved taxpayers billions of dollars.** \n\n>Over the next four years, the Democratic Party will continue to make responsibility the rule in Washington: cutting bureaucracy further, improving customer service, demanding better performance, holding people and agencies accountable for producing the best results, ensuring all Americans have access to high quality public services",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ImportantWords",
                                            "body": "On FEMA:\n\n>In the last four years, **we have transformed the Federal Emergency Management Agency from an outdated bureaucracy into a swift and effective agent of relief for victims of earthquakes, floods, hurricanes, or other disasters.**\n\n  \nOn Defense:\n\n>Three times in three years, President Clinton has increased our defense spending plans -- a total of almost $50 billion -- for readiness, force modernization, and quality of life improvements. The Administration defense plan reverses the downward trend in procurement with a 40% real increase for weapons modernization by 2001. **At the same time, as part of its reinventing government program, the Administration has fundamentally reformed government procurement rules in order to get the most for our money.** \n\n\n\nOn an Iron Dome:\n\n>The Democratic Party is committed to a strong and balanced National Missile Defense (NMD) program. The Administration is spending $3 billion a year on six different systems to protect our troops in the field and our allies from short and medium range missiles. **To prepare for the possibility of a long range missile attack on American soil by a rogue state, the Clinton Administration is committed to developing by the year 2000 a defensive system that could be deployed by 2003, well before the threat becomes real.**\n\n  \nOn Religion:\n\n>Today's Democratic Party understands that all Americans have a right to express their faith. The Constitution prohibits the state establishment of religion, and it protects the free exercise of religion. The President fought for and signed the Religious Freedom Restoration Act, to reaffirm the great protection the Constitution gives to religious expression, and to recognize the historic role people of faith have played in America. Americans have a right to express their love of God in public, and we applaud the President's work to ensure that children are not denied private religious expression in school. Whenever the religious rights of our children -- or any American -- are threatened, we will stand against it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ImportantWords",
                                                    "body": "On Parents:\n\n>Today's Democratic Party **knows that governments do not raise children, parents do**. That is why President Clinton and Vice President Gore took action to order all federal agencies to make sure everything government does for children promotes responsibility from all parents, fathers as well as mothers.\n\n  \nOn Israel:\n\n>The Democratic Party remains **committed to America's long-standing special relationship with Israel**, based on shared values, a mutual commitment to democracy and a strategic alliance that benefits both nations. The United States should continue to help Israel maintain its qualitative edge. **Jerusalem is the capital of Israel** and should remain an undivided city accessible to people of all faiths. **We are also committed to working with our Arab partners for peace to build a brighter, more secure and prosperous future for all the people of the Middle East.** To that end, we seek to further and enhance our close ties with states and peoples in the Arab and Islamic world committed to non-aggression **and willing to take risks for peace.**\n\n  \nOn the FAA:\n\n>President Clinton asked the Vice President to chair a commission **on the future of air traffic security and safety**. We will work to increase the security of our air travel system, the safety of our airplanes, **and the safety and security of our air traffic control system**.\n\n  \nOn Ukraine:\n\n>Four years ago, the forces of reform in the former Soviet Union were embattled. Today, U.S. initiatives are helping democracy and free markets take root throughout the region, **Russian troops are out of** **~~Ukraine~~** **the Baltics, and democracy has triumphed in** **~~Ukraine~~****'s Russia's elections.**\n\n  \nThe Pitch:\n\n>Now we must move forward, and we know the course we must follow. **We need a smaller, more effective, more efficient, less bureaucratic government that reflects our time-honored values.** The American people do not want big government solutions and they do not want empty promises. They want a government that is for them, not against them; **that doesn't interfere with their lives but enhances their quality of life.** They want a course that is reasonable, help that is realistic, and solutions that can be delivered -- a moderate, achievable, **common-sense agenda** that will improve people's daily lives and not increase the size of government.\n\n  \nHonestly, I think Trump just remembered the 90s and was like \"holy fuck why don't we just go back to doing that\". Like that picture 100% captures the situation.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "barkmagician",
            "body": "Lifelong liberal here. This is exactly how i see it. The conservatives of today are the liberals of 15y ago.",
            "score": 62,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "Couldn't agree more... some of the stuff conservatives used to fight against like gay marriage, has now been mostly accepted, even on the right. Meanwhile, what it means to be 'liberal' seems to have shifted in a way that leaves me and many of my friends feeling politically homeless. It's like the culture war moved so fast that a bunch of folks who thought they were pretty progressive suddenly got labeled as outdated or even right-wing.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "unamusedaccountant",
                            "body": "I disagree. I think that most “conservatives” would still argue that gay marriage is unacceptable. My counterpoint would be that conservatives of yesteryear have been validated in their opposition. The slippery slope remains undefeated and now we are battling transgenderism which was the logical next step their activism would take after gay marriage.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NothingEquivalent632",
                    "body": "Not a life long liberal but a life long independent and I feel that way too. This feels exactly what it feels like.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "WackFlagMass",
                    "body": "Cant believe so years ago but now I can. The people on this sub are so much more sensible than the rest of liberal Reddit nowadays. It's fucking crazy how anal the moderators of all the main subs have become. They literally just perma-ban anyone on a whim the moment they oppose things like DEI",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "GaggleOfGibbons",
            "body": "2008 & 2012 are accurate.\n\nRight around 2014 I took a look around and started backpeddling to the right.\n\n\\~2018 started jogging right.\n\n2019 sprinted right and now I'm the \"LOL!\" guy.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Clay-mo",
            "body": "https://preview.redd.it/3cavid82k6ke1.jpeg?width=680&format=pjpg&auto=webp&s=009d0858f6817d8abfad6e1baf1357f919263792",
            "score": 41,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "The casual nature with which the term Nazi gets thrown around these days is disturbing!",
                    "score": 26,
                    "replies": [
                        {
                            "author": "infiniteoo1",
                            "body": "Visiting a sub about Ukraine I commented on someone who called conservatives Nazi and how that was similar to what Russians called Ukrainians and the down votes and idiocy ensued.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "RevenueDry8416",
                            "body": "You did see the shadow president doing a sieg heil right?",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "barkmagician",
                                    "body": "If you are referring to elon, We also saw him supporting israel. What now?",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "monocasa",
                                            "body": "The Nazis cared about Jews because they were an easy scapegoat; they mainly tapped into the existing antisemitism and amplified it because it was politically expedient.\n\nToday, in the US, other ethnicities are blamed for the woes of the nation, and so the focus from fascists is on them.  Additionally, normalizing an rightwing ethnostate like Israel is a politically expedient move if you're trying to normalize rightwing ethnostates in general.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "barkmagician",
                                                    "body": "The nazi killed more jews than they cared. What now?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "monocasa",
                                                            "body": "Do you have any grammatically correct sentences?",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "barkmagician",
                                                                    "body": "Do you have any rebuttal?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "monocasa",
                                                                            "body": "Rebuttal to what?  I literally don't know what you were trying to say because you couldn't construct a sentence properly.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "barkmagician",
                                                                                    "body": "Sounds like a comprehension problem",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "monocasa",
                                                                                            "body": "That typically happens when you write incomprehensible sentences.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "barkmagician",
                                                                                                    "body": "I can understand it well.\nSounds like a skill issue from your side.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "monocasa",
                                                                                                            "body": "I'm sure that's what you told your teachers when you got an F on a paper.\n\n\nIt seriously looks like you had a stroke while typing out that sentence you now have the audacity to defend.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "barkmagician",
                                                                                                                    "body": "Nope. They all gave me an A+.\nSounds like a \"you\" problem.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "monocasa",
                                                                                                                            "body": "If you're going to lie, at least make it believable.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "barkmagician",
                                                                                                                                    "body": "If youre going to play dumb, dont.\nYou are a natural.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "monocasa",
                                                                                                                                            "body": "I'll assume that sounded better in your head.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "barkmagician",
                                                                                                                                                    "body": "You are lefty. Everything sounds bad in your head.",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "monocasa",
                                                                                                                                                            "body": "I love how rather than explain yourself in a way that can be understood by others, you're just becoming increasingly unhinged.\n\nIt's a great look.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "barkmagician",
                                                                                                                                                                    "body": "Bees dont explain to flies why honey is much better than poop",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "monocasa",
                                                                                                                                                                            "body": "Is that what you're telling yourself about not knowing how to write clearly?",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "barkmagician",
                                                                                                                                                                                    "body": "Is that what you tell yourself when you cant comprehend what people write?",
                                                                                                                                                                                    "score": 0,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "monocasa",
                                                                                                                                                                                            "body": "You aren't even capable of your own insults?",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "fksakeisaidnobabe",
                                    "body": "Yeah. Incredibly dumb. Reprehensible, in fact. Gives the actual far-right lunatics something to rally around.\n\nWith that said, I don't think he's trying to bring back the Reich. I think he's just a complete fucking moron.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "TeaBaggerBoy",
                                            "body": "Always funny to me when you people say billionaires are morons. WTF are you worth and what company’s do you run?",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "fksakeisaidnobabe",
                                                    "body": "Yeah the guy is obviously a successful entrepreneur, but success doesn’t mean he’s not a moron in a lot of ways. He constantly overpromises on tech (like FSD and Hyperloop) and ignores experts when they tell him something won’t work. \n\n\nHis impulsive decisions like the Twitter acquisition... have cost billions and made the platform worse. He spreads misinformation (like downplaying COVID) and makes bizarre scientific claims (like nuking Mars). His leadership style is toxic, with high employee turnover, and he lashes out at critics like a child. He’s great at hype and has pushed some industries forward, but his ego and recklessness often undermine his own success.\n\n\nPhilip Low wrote a piece on him recently that was interesting: https://www.reddit.com/r/teslainvestorsclub/comments/1icom15/philip_low_longtime_friend_and_peer_of_elon_musk/\n\n\nI'm not inclined to put billionaires on pedestals arbitrarily.",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "infiniteoo1",
                    "body": "Now that is what Reddit feels like",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Giraffe_66",
                    "body": "That pretty much sums it up lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Grouchy-Capital3408",
            "body": "No. Started off right, and just got further and further right. In my opinion even reagan was a liberal",
            "score": 13,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "Fair enough. We probably don’t see eye to eye politically, but what really bothers me is how political leanings have become tied to someone’s entire identity. Like, when did we lose the ability to just disagree on governance, society, and ethics while still getting along?\n\nI love that we have different opinions... that’s what keeps things interesting and keeps ideas evolving. I’ll disagree with you loudly, maybe even get frustrated, but I’ll still defend your right to push back just as hard. What really gets to me is how quick people are to label, dismiss, or outright censor opposing views instead of debating them. That’s the part that worries me the most.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Grouchy-Capital3408",
                            "body": "The problem is if “conservatives” are just last decades liberals the left will always win, we need to push the other way.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "fksakeisaidnobabe",
                                    "body": "You might be correct, but as an \"Ambivalent Right\" (according to a Pew Research Political Typology Quiz), or perhaps as a self-described right-of-center-moderate, my feeling is that the whole country needs to come back towards the center.\n\nI'm not sure a \"push the other way\" achieves that, but I also don't know what does. I'd love a candidate from either party to step up and position an agenda that blends the \"common sense\" stuff from both sides of the aisle. Overly simplistic, and unrealistic. I know. I know.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "IrreversibleDetails",
                                            "body": "You may like r/tuesday if you’re not in it already",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "fksakeisaidnobabe",
                                                    "body": "How am I only finding out about this?!\n\nThanks for sharing.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "IrreversibleDetails",
                                                            "body": "It’s sort of a middle ground - hard to have it suggested when it’s so … moderate compared to the other subs on either side!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "overide",
                                                                    "body": "I just looked and thought I was in r/democrats maybe I’m further right than I thought…",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Grouchy-Capital3408",
                                            "body": "Ever since after WW2 the window of what is acceptable in politics has slowly moved left, if we want society to stop crumbling we must push it back at least 20 years.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Iamtheconspiracy",
            "body": "Yup, lol. Left got radical real quick and started ignoring straight up facts. Now they're all in a delusional bubble full of uncontrollable emotions and anger at anything that doesn't fit their narrative. Help.",
            "score": 9,
            "replies": [
                {
                    "author": "ambidextr_us",
                    "body": "I can only hope that they continue doubling down on the mental illness so that the right-wing continues winning elections. They don't seem to learn from their bad policy mistakes for whatever reason.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Shaolin__Funk",
                    "body": "Crazy thing is these people would call JFK far right and fascist if he ran today. Trump is pretty damn moderate regardless of what people may think.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Startyde",
            "body": "The biggest problem with the left is they seem to take the position of, whatever the right is for, we're against. So when the right proposes enforcing laws, treating people by what they do and not how they're born, cutting wasteful bloat in government etc, the left looks like lunatics to the average joe by default opposing these things.",
            "score": 10,
            "replies": [
                {
                    "author": "Shaolin__Funk",
                    "body": "They also look like lunatics when they can’t even reflect on the idea that confused children cannot consent to puberty blocks, surgery, and hormones and that this ideology shouldn’t be forced on to greater society and children’s spaces. They’re dead set on whatever narrative they deem progressive and righteous regardless of stats or critical thought and don’t reflect on the negative outcomes, just like with the BLM/abolish the police shit, statistics show black people are not being disproportionately unjustly killed by police compared to anyone else but they still peddle that narrative and now criminals are being released when they shouldn’t and causing more harm, and black neighborhoods have way less police presence and more crime.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Frequent-Structure81",
                            "body": "I’m flabbergasted that granular matters of child sexuality (that apply to what… 1% of the population maximum??) is really the hill dems want to die on.  Sooo much progress for lgbtq is being undone by radicalism on the left.  Can’t they just take a beat on the trans issues?  Who is the dog and pony show about it even *for*?  Real people are worried about grocery bills smdh not sex changes for their grade schoolers.  I have no children so I’m not qualified to say but being “out, loud and proud!” just does not need to be a priority for a child prior to puberty.  This being a major talking point for dems is enough to send sensible people running.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fksakeisaidnobabe",
                    "body": "Certainly a good chunk of the left. The loudest ones for sure. \n\nI've come across more moderate left-leaning folks who'll agree on simple stuff like - Voter ID.. but they don't categorize themselves as right-leaning because of their opinions on gun safety, reproductive rights, Church-State stuff, social security... etc.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "EldestGruffsDonut",
            "body": "Put the hammer down friend, you nailed it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LakeLoverNo1",
            "body": "No. I was center right, not center left, but the graphic is 100% accurate other than that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Somewhat-Subtle",
            "body": "I think a lot of people feel this way.  I started a bit further to the right, but ya, a lot of the left sprinted lefter.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No-Leather-3786",
            "body": "Always been right leaning but I’ve gone more center since the MAGA/trump era. He has done good things yes but for me the negatives outweigh the positive. Our founding fathers wouldn’t have voted for the clown in office.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Intelligent-Spot-475",
            "body": "The left is inherently progressive, so naturally it will go further left, pushing for things like black rights/women’s rights at some point was considered “far left”. (That’s just an example though ik political parties were very different and the state of politics has changed completely) but conservatives want to keep things how they are, so of course they will hate anything with transgender people because the left slides a little further left and the right will not budge on that issue",
            "score": 3,
            "replies": []
        },
        {
            "author": "RogerAzarian",
            "body": "Not at all. You're a dick.",
            "score": 3,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "My man, you have no idea. I’m a colossal dick. Scientists are still trying to measure it. Villagers tell legends about me. Stay safe out there. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RogerAzarian",
                            "body": "I believe it. Wear it it like a badge. It is all you have.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "fksakeisaidnobabe",
                                    "body": "Will do. Your mom doesn't seem to mind. Why should anyone else? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RogerAzarian",
                                            "body": "Mom died in 2011.\n\nGFY",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "fksakeisaidnobabe",
                                                    "body": "Oof that's sad. Almost as sad as moderating a circle-jerk subreddit for free on a platform run by a left-leaning billion-dollar company that would ban you the second it became financially convenient.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheShayger",
            "body": "Exactly, honestly 2000 libs were essentially conservative, Obama was big on deportation and the left and right loved him then. Idk what’s happened since then that sent the left that far but it’s not working.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fartyunicorns",
            "body": "You can’t call republicans from 2012 RINOs and then say the party has stayed the same for the last decade",
            "score": 4,
            "replies": [
                {
                    "author": "JohannLandier75",
                    "body": "This, by most measurements I am a RINO but was considered a solid republican until the 2010s.. my core beliefs have not changed",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Odiemus",
            "body": "The right has shifted a lot in the past 20-30 years. The craziness of the left almost feels like it’s in response to the right moving more to the center. \n\nFor example, the right in the 90’s was pretty against LGBT and very religious. By the 2010’s, pretty accepting and token religious. The only choice for the historic champion of social issues was to find/create more ways to distinguish and differentiate themselves by moving further left.",
            "score": 7,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "Yeah this is a good take, and echoes what u/mixer2017 said above. \n\nAt the same time, I think the left’s shift wasn’t just about trying to differentiate itself... society as a whole moved left on social issues, so naturally, progressive movements pushed further to keep that momentum going. The problem is, once you win the big battles, the new focus can sometimes feel a lot more niche or even unnecessary to people who were on board with the original fight (Hey hey, it's me!). That’s probably where a lot of the frustration comes from... it’s not that we became conservative, it’s that we don’t think every new shift is equally valid or necessary.\n\nAnd then you're ostracized by the aggressive and loud minority on at the extremes (aptly characterized above).",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Odiemus",
                            "body": "The extremes are small and seem to have taken over all discourse at what was traditionally the “adult table”.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "InvestingPrime",
            "body": "It's true, the other issue though is that it also been mixed in with a \"never trump\" initiative. Whatever he supports becomes bad. I mean, if Trump came out in support of illegal immigration tomorrow the left would be snitching on each other left and right.",
            "score": 4,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "As neither a supporter or detractor of Trump, the attitude you describe definitely irks me.\n\nLike, please objectively separate the policy from the person. Good policy is good policy, regardless of who it's champion is. Illegal immigration is illegal. Why is this not a non-partisan issue. Insane to me.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fantastic_Story1086",
            "body": "Yes!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big_Listen3985",
            "body": "This is exactly what happened.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Decent-Inevitable-50",
            "body": "Great depiction, I may have to borrow this 😉",
            "score": 2,
            "replies": []
        },
        {
            "author": "tightie-caucasian",
            "body": "This is me for sure. Never saw an illustration that captures the political situation in this country better than this one does.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Mauldalorian",
            "body": "2021 was definitely a pivotal year with millions of former Dems watching blue states botch COVID restrictions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DirtPiranha",
            "body": "Recently, I have come to believe that the Left is for children; people that don’t have any real responsibilities or obligations and people who can afford to have their feelings be their sole concern. \n\nIf you are like me and your sole concern is making sure there is a roof over your families head, food on the table, gas in the car, clothes on your families back, and another paycheck on the way, then we got real concerns. I need to know why so much of my check is being taken. I need to know why things are so expensive. I need to know where the money being taken from my check is going and how it’s going to help me. \n\nThe lefts concerns aren’t invalid. Those are issues and topics deserve to be addressed, but right now it feels like a person with a headache complaining at the hospital that the gunshot victim is being seen first.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CanaKitty",
            "body": "Oh hey it’s a picture of me 😅😅😅😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "PSanonymousity",
            "body": "This is me and many people I know.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ifellicantgetup",
            "body": "I have always been verrrry financially conservative but socially so-so liberal. Example, I don't give a rat's butt what gender someone is for the day, but I don't want to pay for surgery. That's on them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GuyWhoWantsHappyLife",
            "body": "I find myself mostly in the center on things. Believing neither extreme of the 2 sides is appropriate and most things can be reasonably compromised. Over the course of my life I do lean more right now as the left is so freaking crazy, and I know most dems don't even agree with it anymore. Any group that says agree with us or you're evil is not a group I want to associate with.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_captain_tenneal_",
            "body": "This is exactly what happened to me lol. The left has become insufferable",
            "score": 2,
            "replies": []
        },
        {
            "author": "drokkon",
            "body": "I mean yes, if you’re talking about the guy on the right.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jay298",
            "body": "Yep.  Though I think it has more to do with pragmatism.  Basically socialism doesn't work.  It just makes people poor but a lot of poor people want government help more than they want to stop being poor and the media just manipulated them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Spiritual_Win_6365",
            "body": "My dad told me once when I was young “if you aren’t a liberal by the time you’re 25 then you don’t have a heart. And if you aren’t a conservative by the time you’re 45 then you don’t have a brain.” \nNever understood what he meant until I did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "drleeisinsurgery",
            "body": "As a young man I was very pro-free speech, anti-war, pro-choice, anti-organized religion.\n\nPretty standard young Democrat from the 90s.\n\nNow apparently I'm a far right wing Nazi.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PepperJack386",
            "body": "Honestly at this point the only reason I vote right anymore is to vote against gun control.",
            "score": 2,
            "replies": []
        },
        {
            "author": "InteractionHot5102",
            "body": "That's exactly how I feel about mainline christians",
            "score": 2,
            "replies": []
        },
        {
            "author": "Spectacularsquid42",
            "body": "Yeah that’s me. I’m independent now but find myself leaning more right more and more often. This whole woke shit has gotten to the point we’re one side won’t even have a logical conversation. Then seeing the social media side of things just pushed down my throat, the distrust of the medical industry in its entirety, the failure of the Covid vaccine just ruined it for me in totality",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Corgi7272",
            "body": "https://preview.redd.it/fsmiqlhqm8ke1.png?width=1401&format=png&auto=webp&s=0a515f35ff744a6ab26206efdd6f1939ccb26016",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stunning-Egg-9469",
            "body": "Accurate.  And when all else fails.  Just call the other person a NAZI, RACIST, BIGOT, HOMOPHOBE, TRANSPHOBE.",
            "score": 2,
            "replies": []
        },
        {
            "author": "olives2280",
            "body": "Yes! Pretty accurate except that I’m pro choice.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fksakeisaidnobabe",
            "body": "I mean, the years a probably slightly off for me, and it's fair to say the dude on the right also probably veered a little further away...\n\nBut the principle is spot on.",
            "score": 4,
            "replies": [
                {
                    "author": "mixer2017",
                    "body": "Nah not really. If nothing else, we have shifted to the left if anything else.  The problem is the left is so far left it makes the right seem so extreme.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "fksakeisaidnobabe",
                            "body": "Yeah, I don’t think most conservatives have radically shifted, but there’s definitely been an uptick in far-right voices that didn’t seem as prominent or even really exist in the mainstream back in the early 2000s. Whether that’s because the internet gives them a louder platform or because the Overton window has shifted, I don’t know. But it does feel like both extremes are way more visible now than they used to be, which makes it easy for everyone to assume the worst about the other side.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Shaolin__Funk",
                                    "body": "There’s always going to be a counter to extremism and big shifts, without the left going off the rails we would’ve never seen far right figures pop up. Same thing happened in Germany. The Nazi’s weren’t good but they were a response to the degrading society and economy that the Weimar Republic brought, without Weimar there would’ve never been Nazi’s or WW2. Of course places like Soviet Russia or Mao’s CCP didn’t have any counters that could gain power, they just killed them. Which is why the way the left is going is dangerous, they’ve already started the othering of specific groups and calling dissenters “fascist” tactic that Mao and Stalin used before genociding them and becoming totalitarian. Which I firmly believe the modern left is possibly getting to a point where they’d feel that’s justified to do here.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Silky_Mango",
            "body": "Pretty sure the 2008 and 2012 conservatives have been kicked out of the party, so the right hasn’t stayed the same either tbh",
            "score": 2,
            "replies": []
        },
        {
            "author": "GuyOnABuffalo82",
            "body": "This...100%",
            "score": 2,
            "replies": []
        },
        {
            "author": "JoiedevivreGRE",
            "body": "lol the right side (MAGA) should be about 2-3 football fields away from center",
            "score": 2,
            "replies": []
        },
        {
            "author": "fksakeisaidnobabe",
            "body": "Well this sure has been validating. Thank you all for the discussion and the opportunity to vent/relate!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Empty-Nectarine",
            "body": "Pew Research has been studying this for ages:\nhttps://www.pewresearch.org/politics/2014/06/12/political-polarization-in-the-american-public/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cold_Navy79",
            "body": "Both Elon and Joe Rogen made this same analogy. Sadly it’s true for most. It is as if the last 6-8 years has been a competition with liberals to see who can have them most extreme crazy ideology.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rock_Successful",
            "body": "I would say I’ve always been right of center but over the last 10 years I’ve become more right wing. I still have *libertarian* values (not a liberal).",
            "score": 1,
            "replies": []
        },
        {
            "author": "xxPOOTYxx",
            "body": "Accurate drawing except the liberal needs a frowny face. They are always miserable and are never happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaltyBigBoi",
            "body": "I think both sides keep going farther in the wrong direction. I wouldn’t be a conservative if it wasn’t a two party system, but what can you do",
            "score": 1,
            "replies": []
        },
        {
            "author": "Celebrimbor96",
            "body": "Yes but I also feel like the right is running away, albeit not nearly as fast",
            "score": 1,
            "replies": []
        },
        {
            "author": "fdrowell",
            "body": "Nah, I've been perfect even for longer than the last 17 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoIDontwanttobeknown",
            "body": "I mean isnt that point of \"progressives\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimmyb1982",
            "body": "Not for me. Growing up, my dad owned a small business. He explained Republican/Democrat to me when I was a young teenager. Been a Republican ever since.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBestDanEver",
            "body": "This is without a doubt the story of my existence lol. I voted for Obama twice and then suddenly found myself stuck between Hillary or Trump in 2016. Hillary was just so obviously fake and flawed that I couldn't bring myself to vote for her. I'd definitely say I float around the right more than the left ever since the parties shifted but I'm pretty sure my personal stances haven't actually changed lol. I'm still pro choice and pro weed.. I dont hate social programs. I just also happen to really like guns and not want those social programs to expand our national debt further. I love the idea of america being home to a bunch of immigrants, I just want them to come here the right way. \n\n\nIdk, the party changes have been super obvious and super frustrating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OceanBlueRose",
            "body": "This is pretty much exactly the transition I’ve made, but not quite on that timeline (I was 11/12ish in 2008 lol). I feel like the left identify happened early in high school and into college, and as I got older I very slowly shifted, center, and then right-leaning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "marksman81991",
            "body": "Somewhat. I've been centrist most of my life but in recent years I opened my eyes and saw what the left was doing to our country. Now I am a proud conservative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CallSignAwesome",
            "body": "I’m proud to say that the fluff and noise of 2008 and 2012 never pulled the wool over my eyes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Cerberus",
            "body": "https://preview.redd.it/lfsj5n4147ke1.jpeg?width=2048&format=pjpg&auto=webp&s=4621ff372e476dae75d94a376e4cf70b82715f44\n\nThis was my experience.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forresett",
            "body": "I’m the exact opposite!",
            "score": 1,
            "replies": []
        },
        {
            "author": "rhood_boy",
            "body": "This implies that your views haven't evolved in 17 years ago  which isn't really a flex",
            "score": 1,
            "replies": [
                {
                    "author": "fksakeisaidnobabe",
                    "body": "I mean, I’m not trying to flex anything… just making an observation about where I find myself politically.  \n  \nAnd you're probably right. In principle, my views haven’t really changed all that much. What’s changed is everything around them. The core issues in US politics over the past 20 years... things like free speech, gun rights, immigration, foreign policy, taxes, government size, abortion, and cultural debates... have all evolved in ways that sometimes make the same position feel further left or right depending on the moment. But on those core things, I still feel like I stand where I always have.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}