{
    "title": "Kash Patel To Relocate Hundreds Of FBI Staff Out Of DC: Report",
    "author": "Equivalent-Ad8645",
    "subreddit": "Republican",
    "rank": 168,
    "score": 237,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.dailywire.com/news/kash-patel-to-relocate-hundreds-of-fbi-staff-out-of-dc-report",
    "id": "1ivj50e",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 16,
            "replies": [
                {
                    "author": "MikeyPh",
                    "body": "Regardless of that, decentralizing the power structure is a smart move. Richard Grenell makes great points about this issue. If they are all in DC, they are far more susceptible to the Democrat power structure they've created over the decades. Breaking up these administrations breaks up that power and makes it harder for any party to have control over them, which makes them more likely to just do what they were designed to do.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "atomic1fire",
                            "body": "I assume the other benefit is greater cooperation with local and state police if they have more FBI field/satellite people where people can see them.\n\nedit: Also I just realized that the FBI has satellite offices, and those buildings have google reviews, which may be an unintentional source of comedy. Lots of scam victims, but also a few people asking about directed energy weapons, cavity searches, and microchip implants.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sixtysecdragon",
            "body": "This has been going on for a while. They moved a good deal to Huntsville, AL in recent years.",
            "score": 15,
            "replies": []
        },
        {
            "author": "TungstenBronze24",
            "body": "Will be interesting to see the attrition rate. Was at a company that did similar things and it was >50%. ",
            "score": 7,
            "replies": [
                {
                    "author": "Enchylada",
                    "body": "That's probably the idea lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "deeziant",
            "body": "Hallelujah",
            "score": 10,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Dismal_Survey_539",
                    "body": "why?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConsistentType4371",
            "body": "This was always the plan, they’ve been moving away for close to 15 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HandicapMafia",
            "body": "Transferring the undesirable or politically compromised agents to bumfuck backwater towns sounds like a fitting punishment\n\n![gif](giphy|b2GGdaqhFVdQc)",
            "score": 1,
            "replies": []
        },
        {
            "author": "CanadaSoulja",
            "body": "What’s the difference between working in the area of DC vs out of it? If the leadership structure is still the same",
            "score": 0,
            "replies": [
                {
                    "author": "Beneficial_Put4173",
                    "body": "This is speculative, but I believe it has something to do with the shift in foreign policy. The International Operations Division of the FBI is based in D.C. and they oversee the legal attaché program. According to fbi.org, this program’s purpose “is to establish and maintain liaison with principal law enforcement and security services in designated foreign countries. This liaison enables the FBI to effectively and expeditiously conduct its responsibilities in combating international terrorism, organized crime, cyber crime, and general criminal matters. In particular, legat liaison activities are essential to the successful fulfillment overseas of the FBI’s lead federal law enforcement mission to prevent terrorist attacks against citizens and interests of the United States.”\n\nPatel emphasized he would like to revert the FBI’s focus to traditional law enforcement. So I think it’s likely he’s repurposing positions in DC to focus more on domestic issues. I welcome any other speculations or sources stating otherwise!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "CanadaSoulja",
                            "body": "This is just the answer I was looking for thanks, not sure why I was getting downvoted",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Slske",
                    "body": "Apparently, you're not following closely the events in D.C. since January 20th...",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}