{
    "title": "BREAKING: Obama Judge Amy Berman Jackson Rules Trump Has No Authority to Fire Hampton Dellinger—Declares Firing Illegal",
    "author": "trumpaddict2020",
    "subreddit": "Republican",
    "rank": 62,
    "score": 12,
    "upvote_ratio": 0.52,
    "num_comments (reported by reddit)": 29,
    "url": "https://conservativeroof.com/judge-amy-berman-jackson-rules-trump-has-no-authority-to-fire-hampton-dellingerdeclares-firing-illegal/",
    "id": "1j1pxw0",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/r/Republican is a partisan subreddit.  This is a place for Republicans to discuss issues with other Republicans.\nTo those visiting this thread, we ask that unless you identify as Republican that you refrain from commenting and [leave the vote button alone](https://www.reddit.com/r/MetaRepublican/comments/5t017a/this_sub_is_for_republicans_if_you_do_not/). Non republicans who come to our sub looking for a 'different perspective' [subvert that very perspective with their own views when they vote or comment.](http://i.imgur.com/XqL0wfR.jpg)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Republican) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sixtysecdragon",
            "body": "This is the case you want to go to SCOTUS. There is a similar case called Morrison v. Olson that had the same outcome. Scalia was the only dissenting Justice at the time. \n\nIn that decision, SCOUTS does back flips to try and come to the outcomes here. [Scalia’s dissent](https://fedsoc.org/commentary/videos/the-great-dissent-justice-scalia-s-opinion-in-morrison-v-olson) is about the unitary power of the presidency and such silly carve outs. It’s become famous and has gained traction. \n\nThe lower court judge maybe right on the precedent. But is wrong about the law. And this is a near direct 1-to-1 so Morrison can be overturned and would likely free Trump and future presidents from this overreach against the executive.",
            "score": 48,
            "replies": [
                {
                    "author": "Churn",
                    "body": "How quickly is a ruling from SCOTUS possible in this case?  Would it take months or days?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "sixtysecdragon",
                            "body": "To give you the most lawyerly answer ever, it depends. Historically, the Court doesn’t like to make rulings on a Temporary Order. They want a fully developed case before diving in. \n\nSo, they may dismiss the order and then let it proceed on its merit before taking it up. Roberts did something similar last week in a different matter. But if there isn’t a perception of urgency by the court, it will climb through a sort of normal path. But with Urgency, it could be pretty quick. \n\nSo, it could be weeks, but more likely months before the court would hear it. Also, the Court doesn’t hear many cases after April as tradition has it. They hear most matters between October to April. After April, it would be a special case. \n\nSorry for likely the longest and least satisfying response possible.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Churn",
                                    "body": "This is a great explanation. Thanks for taking the time.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PsychologicalBit803",
                    "body": "This ruling might actually help make SCOTUS rule on it sooner. Let’s hope so.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bakerman82",
            "body": "Supreme Court going to be busy litigating all the 5-Alarm Fires Dem Judge Shopping is going to yield.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Coast_watcher",
            "body": "Keep on firing. They can't save everyone.",
            "score": 16,
            "replies": []
        },
        {
            "author": "not_my_real_name_2",
            "body": "Actual court opinion here, https://storage.courtlistener.com/pdf/2025/03/01/dellinger_v._bessent.pdf",
            "score": 5,
            "replies": []
        },
        {
            "author": "PI_Dude",
            "body": "Impeach her then fire him again.",
            "score": 16,
            "replies": [
                {
                    "author": "No_Cardiologist9607",
                    "body": "I can see this playing out in my mind, and it’s hilarious. Thank you for laugh this morning. Be well, sir",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Comprehensive-Tell13",
                    "body": "Idiot judges make the scotus decisions all that easier why impeach someone that unintentionally does you favors.\n\nAnd as far as firing him it would be easier to just have someone that the judge can't make the argument on fire him. but if you do that there's no reason for scotus to make the ruling that we want made.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Australianfoo",
            "body": "SCOTUS will handle it and favor President Trump..",
            "score": 2,
            "replies": []
        },
        {
            "author": "Enchylada",
            "body": "And then she'll get shot down by SCOTUS to no one's surprise.\n\nIt's just more lawfare",
            "score": 6,
            "replies": []
        },
        {
            "author": "GriffinObuffalo",
            "body": "Typical leftist stooge.",
            "score": 7,
            "replies": []
        },
        {
            "author": "TradLad1994",
            "body": "They are working continuously to block every step.  Why do they want the same old same old?  Let's fix things.  I just dont get how they are thinking.",
            "score": 3,
            "replies": [
                {
                    "author": "letitbe2day",
                    "body": "Because they didn’t use due process that’s why. We do want federal employees, or any for that matter, to be fired without cause. Read the ruling . Regardless of our political leanings we do not need to break the law to do get our way- no more complicated than that",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "burn_all_the_things2",
            "body": "But since he’s the chief executive he could also define their scope of work. So he could assign them to an empty desk with the explicit instructions to stare at a blank wall.",
            "score": 4,
            "replies": []
        },
        {
            "author": "woman-ina-mansworld",
            "body": "He’ll be the next whistleblower for Shifty Schiff.\n\nWe found a man now find the crime",
            "score": 2,
            "replies": []
        },
        {
            "author": "SIewfoot",
            "body": "Still don't see why some randomass judge in some randomass town can overrule the president. Where were these guys when Biden was doing a bunch of stupid crap?",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MikesHairyMug99",
            "body": "Scotus time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighEndSociopath",
            "body": "And your paid vacation to Gitmo is now boarding. All aboard!",
            "score": -9,
            "replies": []
        }
    ]
}