{
    "title": "I've never understood how Lumineon is considered so forgettable and especially never understood how it's considered bland. In my opinion it's one of the most beautiful Pokemon and certainly one of the most beautiful fish Pokemon. Not to mention it's Pre-evolution Finneon is just plain adorable.",
    "author": "Purpledratini",
    "subreddit": "pokemon",
    "rank": 11,
    "score": 169,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 78,
    "url": "https://i.redd.it/oou5nd9psipe1.png",
    "id": "1jeh5hf",
    "selftext": "",
    "comments": [
        {
            "author": "SharpEdgeSoda",
            "body": "I think any of the \"fish\" end up forgettable unless a major character uses them.\n\nGoldeen was Misty's gag pokemon.\n\nMagikarp has one of the most hype evolution and the whole gimmick is going from pathetic to busted strong.\n\nI think GF might have needed to have more a \"Regional Fish\" pokemon pushed more like they unofficially have \"regional birds\" \"Regional rodent\" \"Regional Bug\" ect.\n\nStep 1 would have been making it \"common\" to get with early game fishing rods. Don't make the Old Rod only good for magikarps.",
            "score": 52,
            "replies": [
                {
                    "author": "Keithfrommars",
                    "body": "I thought Psyduck was Misty’s gag pokemon 😭 she barely used Goldeen.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Furrulo878",
                            "body": "If I remember correctly, there was one battle in which goldeen was useful because there was water involved, otherwise the fish would just flop about while yelling its own name like a dummy",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SharpEdgeSoda",
                            "body": "She didn't have psyduck right away. Your right that psyduck basically became her mascot.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GracefulGoron",
                    "body": "Magikarp being the ‘default’ fish ruined the new region fish chances every game, maybe ever.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SharpEdgeSoda",
                            "body": "It might be part of why Milotic and Feebass worked. No magirkarp to drown it out",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mysteryurik",
                                    "body": "There are magikarp in RSE, feebas and milotic are remembered because of how ridiculously hard it is to find feebas, the unique evolution method, and the fact that milotic is actually pretty good",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DontEatNitrousOxide",
            "body": "So pretty but so weak, I think it would benefit from fairy type and a stat bump",
            "score": 28,
            "replies": [
                {
                    "author": "something-magical",
                    "body": "Fairy type Evo would be great. Also, I always thought it should learn Quiver Dance, since it vaguely looks like a butterfly. That would set it apart from the other fish Pokemon.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "POWBOOMBANG",
                            "body": "A water quiver dancer would be super cool",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Live-Sprinkles-9937",
                            "body": "Yeah this mon is up there on a list of mine of forgotten Pokémon that should get either one more evolution or one in general.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DontEatNitrousOxide",
                            "body": "I really don't know what they thought when they were designing this Pokémon stats wise, it doesn't even make sense to be that weak from a level design perspective given its distribution.\n\nI love the idea of it getting quiver dance, absolutely fits it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "digitaldrummer",
            "body": "It's pretty easy to go through a game in gen 4 without finding either finneon or lumineon in the wild, and its stats are really bad, especially compared to the other available water types.",
            "score": 59,
            "replies": [
                {
                    "author": "geek_metalhead",
                    "body": "and IIRC only a few skippable water trainers on an ocean route have this pokémon, so you have chances of  not even having it in your pokedex at the last gym",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheInnsanity",
                    "body": "yup, most people who played gen 4 don't know it exists, and I don't think it's been prominent in anything else either.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ShadowsOfSense",
                    "body": "I didn't even remember it was in Gen IV.\n\nI would have guessed it was Gen V just because there were so many new Pokemon it'd make sense if it was lumped in there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Purpledratini",
            "body": "Also I adore it's shiny.\n\nhttps://preview.redd.it/bfwsrlkxsipe1.png?width=813&format=png&auto=webp&s=a3ad79c68ef361742ddf06c59c616769be950be4",
            "score": 37,
            "replies": []
        },
        {
            "author": "Maeriberii",
            "body": "I love its cry.",
            "score": 13,
            "replies": []
        },
        {
            "author": "KarmaTheEgg",
            "body": "As much as it lacks main game precence, Luminion has a very pretty cry, and was a very fun challenge of a pokemon to catch in Pokemon Ranger: Shadows of Almia because of its speed",
            "score": 8,
            "replies": [
                {
                    "author": "Purpledratini",
                    "body": "I'm so happy to see someone else who remembers that game and mission. Struggling to catch up to it honestly just made me like it more. I remember coming back just to see it again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pkmn_trainer_shay",
            "body": "Lumineon and Finneon also have some of the best cries IMO.",
            "score": 1,
            "replies": [
                {
                    "author": "GracefulGoron",
                    "body": "Common Sinnoh win",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frix_Manepaw",
            "body": "He's one of the best support cards on pokemon tcg :)",
            "score": 1,
            "replies": [
                {
                    "author": "mattdv1",
                    "body": "Yeah, anyone playing the TCG for the last 2 years absolutely knows lumineon and appreciates his work!! I hold him close to my heart  !!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZoinkedAcroporuh",
            "body": "deserving of a mega tbh",
            "score": 5,
            "replies": []
        },
        {
            "author": "BrownEyesWhiteScarf",
            "body": "There are too many water type pokemon in the game",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManufacturerFluffy40",
            "body": "Basic Design (By basic I mean its just a caricature of a tropical fish), Weak, somewhat rare, and no major character uses it as its ace.",
            "score": 1,
            "replies": [
                {
                    "author": "MechaPanther",
                    "body": "Essentially chimecho but without the anime prominence.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AerySprite",
            "body": "Deserving of a beautiful evolution. For sure",
            "score": 1,
            "replies": []
        },
        {
            "author": "vismayz",
            "body": "Hotel Pond Ass Fish",
            "score": 1,
            "replies": [
                {
                    "author": "Purpledratini",
                    "body": "I've never stayed at a hotel so I have no visual reference to go on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jra625",
            "body": "Not competitively viable, even in a casual playthrough, plus it's hard to find in it's gen game. There are also other better water types that are easier to find and train to your team level.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MetapodChannel",
            "body": "I think its super pretty. I love it and Lumineon is so cute too. Great cry. And comes from a great gen. Sad it is so overlooked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrTritonis",
            "body": "Meh. Cool concept, I’d like to love it, but it doesn’t scratch the itch, something is not right with the design.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PokemonFan587",
            "body": "Imo it became more memorable due to it being in BDSP and Arceus\n\nPeople call Maractus forgettable despite it having an entire down dedicated to it in SwSh\n\nImo the most forgettable Pokemon is Cryogonal",
            "score": 1,
            "replies": []
        },
        {
            "author": "Red_Rocker9957",
            "body": "It has weak stats, which is why it's forgettable to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagicalBread1",
            "body": "Admittedly, this post reminded me of Lumineon's existence. It's forgettable because of how many fish Pokemon there are. Neat design and shiny, but it's a Pokemon I barely see and never use.",
            "score": 1,
            "replies": []
        },
        {
            "author": "some_tired_cat",
            "body": "its illustration rare card is so pretty, one of my favorite ones",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThePiGuy3",
            "body": "At least you can take solace in the fact that in the TCG world, Lumineon is a household name, famous for its support capabilities",
            "score": 1,
            "replies": []
        },
        {
            "author": "wackywizard54",
            "body": "The most forgettable Pokemon for me is phione, it doesn’t even evolve into manaphy",
            "score": 1,
            "replies": []
        },
        {
            "author": "PCN24454",
            "body": "Because it’s not “cool”. That’s why people only use Floatzel in their play throughs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Horatio786",
            "body": "Because it’s hard to find.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShatoraDragon",
            "body": "That quest in Pokémon Rangers.  I will for ever hate that darn fish.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lrossp",
            "body": "Big Lumineon guy myself",
            "score": 1,
            "replies": []
        },
        {
            "author": "roryextralife",
            "body": "TCG Players will never forget this beautiful fish, it will live on in our memories forever once it rotates out in a few weeks",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomAssGuy414",
            "body": "honestly I didnt even know what that pokemons name was until I saw this post, not saying its a bad mon, just stangely forgettable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "laserofdooom",
            "body": "its remembered as the most forgettable pokemon which is pretty ironic. finneon is a adorable jelly bean. lumineon needs something tho. a sig move or ability",
            "score": 1,
            "replies": []
        },
        {
            "author": "BushyBrowz",
            "body": "When did you get into the series?\n\nIt was hard to find in its debut game and didn’t really stand out in any significant way imo. It’s one of the few pokemon that actually benefited from the jump to 3D imo. Its design really comes alive.",
            "score": 1,
            "replies": [
                {
                    "author": "Purpledratini",
                    "body": "When I was about four, so 21 years ago.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yerm_Terragon",
            "body": "Forgettable? Easy. There was only one NPC in the entire game that used Lumineon. And you had to go out of your way to find a pond that you could even catch Finneon in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefyGravity42",
            "body": "Because it didn’t get much prominence in the game it was introduced in or in the later games\n\nI loved it and Finneon but since I never saw a wild one in DPPT I still forget that they were in gen 4 sometimes.\n\nThey did get lovely showing in the New Pokemon Snap\n\nAnd I actually encountered them in Legends Arceus",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elvenoob",
            "body": "The design is adorable, the problem is just the scarcity and the lack of stats. (Other rare and weak pokemon tend to be unpopular too)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nindroid2012",
            "body": "Literally just a fish bro 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "pokepok",
            "body": "It's kind of boring imo. It's just a fish and we already had an abundance of \"just fish\" pokemon by the time gen 4 came out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pincheARCEUS",
            "body": "To me, it's just a fish that doesn't do anything special. Anything that it does do, another Pokémon does better. Design wise, it looks OK though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotCutMan",
            "body": "i think people think it's forgettable because they aren't in many games and in the ones they are in they're not very common, so if you need a water-type, it's always easier to catch a magikarp or pick the water starter 😔 it's a shame because lumineon is gorgeous, i need to use it again some time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dar0man",
            "body": "It was always memorable for me due to its cool looks, it’s pre-evolution and the fact that it was the last pokemon I needed for the Platinum regional deck when I was a kid. I ended up using one on my team in Shinning Pearl and it did great!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MegaKabutops",
            "body": "It’s a good design, but it takes a CRAZY good design to make a pokemon famous without any other noteworthy traits, and design’s the ONLY good trait it has got. \n\nThere’s a good half-dozen water types in the region that can be acquired FAR faster and easier than finneon, and who will vastly outperform lumineon in battle, both in a playthrough and competitively. Its anime appearances are also sparse, failing to offset its combat ability for fandom relevance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Magic-Sword",
            "body": "I think it looks better when the blue/green parts glow, but its more that it's a generic water type without anything to make it stand out and terrible stats.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuxyLux25",
            "body": "its shiny is also incredible",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anabiter",
            "body": "On the casual side it's a forgettable fish pokemon that appears way too late and has nothing to make it different. It doesnt even have a cool ability or movepool. On the competitive side it has awful stats and doesnt do anything besides whirlpool encore meme strats which is bottom of the barrel for a pokemon. It's not really bulky enough to do this well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CamoKing3601",
            "body": "it is a pretty design, but it's also a fairly standard tropical fish that could resonably exist in real life, not that there's anything wrong with a more grounded design, but I feel most people would be more driven twords the more imaginative creatures, especially harsh competition in the Water type department against sea dragons and  warrior penguins and whatever the fuck Swampert is and whatnot\n\notherwise it's fairly weak pokemon stat-wise, that is rare so most people won't find it on their first playthrough, in a type that has such tough competition",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotAlwaysGifs",
            "body": "Anyone who’s been on the receiving end of a Starmie/Lumineon deck in TCGP might beg to differ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WoolooOfWallStreet",
            "body": "It has the prettiest cry\n\nAn hour long track of just that would probably put people to sleep like whale songs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glory2Snowstar",
            "body": "I really wish they gave this fella Quiver Dance considering their butterfly wing gimmick. I do love Lumineon since it’s a combo of a bunch of cool fish (especially tripod fish, it can walk with those lower fins), but gameplay-wise they’re unfortunately sauceless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuzzy_Lengthiness_95",
            "body": "That Lumineon cry is iconic. Who is this diva",
            "score": 1,
            "replies": []
        },
        {
            "author": "Els236",
            "body": "You can easily play through Sinnoh without ever seeing one, as I think only 2-3 trainers even have Finneon or Lumineon in the entire game (I know a swimmer has one on Route 223 in BD/SP, so just before the League).\n\nFinneon has an atrocious BST for the period of the game you find it (outside of Good Rod fishing at Windworks, provided you bother to do that) and Lumineon isn't much better, with the only OK stat being Speed.\n\nIts level-up moveset is terrible, learning its first decent move into the 40s, which is U-Turn, which it doesn't have stab for. For water moves, it's Water Pulse and Whirpool and that's it and it learns Whirlpool late.\n\nIt also evolves at Level 31, which is quite late for such a low-BST mon.\n\nIt's basically Sinnoh's answer to Goldeen and Seaking and those aren't good mons either. However, Finneon & Lumineon are nearly always in the \"top most forgettable\" tier-lists on YouTube, which has kind of made it... not so forgettable nowadays.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreeTrees69",
            "body": "You want to know what Pokemon is forgettable, Mandibuzz I was looking at Braviarys pokedex entry today and Honestly I complete forgot Mandibuzz existed. They even had a somewhat important gimmick tied to Braviary that they can only be female while Braviary can only be male.\n\nI'm Honestly expecting a Mandibuzz variant in Legends Z because of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HonchosRevenge",
            "body": "Looks neat but no stats and no gimmick hurts. It’s not even good enough for challenge runs",
            "score": 1,
            "replies": []
        },
        {
            "author": "el_toro_grand",
            "body": "I mean eh? To each their own",
            "score": 1,
            "replies": []
        },
        {
            "author": "Triangulum_Copper",
            "body": "Because they put it at the very end of the Gen 4 fame LONG after you had a chance to pick up way better Pokémon like Buizel, Shellos, Magikarp… heck, even Psyduck. To say nothing of your starter.  It needed to be way better to be worth any investment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thegreatpenguintm",
            "body": "True, incredibly underrated mon!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoctorWhosYoDaddy",
            "body": "Alpha Lumineons cry is terrifying. I will never forget that pokemon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Psapfopkmn",
            "body": "I like Lumineon, I was just disappointed that it didn't keep pink details like Finneon's.",
            "score": 1,
            "replies": []
        },
        {
            "author": "krossoverking",
            "body": "It looks like a fish I could buy in a store. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "PikaPerfect",
            "body": "LUMINEON FAN SPOTTED!\n\ni agree with this, but i also can understand the forgettable factor, i mean hell, i love lumineon and even i forget it exists sometimes :( it's relatively uncommon and not very strong, but it doesn't have the \"it's intentionally so bad that it's memorable\" (like dunsparce) factor, it's just genuinely mid (which sucks, because its design is fire) (or i guess water...)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qoppa_Guy",
            "body": "Beautiful by design and concept but not a mid-late game encounter. I think a lot of fish Pokemon fall under this in-game power creep.",
            "score": 1,
            "replies": []
        }
    ]
}