{
    "title": "Trump has claimed London has become “unrecognisable” because it has “opened its doors to jihad”",
    "author": "YoungOneDev",
    "subreddit": "Asmongold",
    "rank": 2,
    "score": 1072,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 471,
    "url": "https://v.redd.it/hzoop2u0mgpe1",
    "id": "1je6g8w",
    "selftext": "",
    "comments": [
        {
            "author": "Excellent-Ad257",
            "body": "I watched a video of a Muslim imam not long after the London bombings in 2005. He said that while he felt all non muslims should convert or die, he didn’t believe they needed to carry out suicide bombings. His reasoning was that the “west has opened its doors to the wolves in sheeps clothing, and within the next century we will breed them out of existence” Those words were more frightening than bomb threats imo. It is a much more successful strategy",
            "score": 429,
            "replies": [
                {
                    "author": "Moerko",
                    "body": "This is also what Gaddafi said maaany years ago iirc.",
                    "score": 121,
                    "replies": [
                        {
                            "author": "Butefluko",
                            "body": "Interesting how they all skipped your reply lol. No one wants to share genuine constructive views.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "JustAnotherGlowie",
                            "body": "UAE foreign affairs minister said a similar thing https://youtu.be/s0jIKBhUDeA",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AgentEbenezer",
                    "body": "UK here , Trump isn't exaggerating. We're so up the creek it's mad . I left school nearly twenty years a go and the Islamic influence within the school was concerning then . We had one student involved in the honor killing of his sister as she'd started a relationship with an Indian dude . \n\nWe're so politically correct it borders on the dangerous.  We can't really raise these issues online as even these very carefully put words could see me dragged into a police station for inciting racial hatred.  \n\nThis particular case should tell you everything you need to know about how things stand in the UK right now . \n\nhttps://freespeechunion.org/uk-teacher-who-showed-muhammed-cartoon-to-start-discussion-about-blasphemy-still-in-hiding-3-years-later/\n\nThere's many other similar incidents that have occurred.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Fast_Assumption_118",
                            "body": "This is absolute bollocks. You lot are absolutely insane or brain damaged. Stop making up excuses to be racist. Be proud of who you are!",
                            "score": -30,
                            "replies": [
                                {
                                    "author": "AgentEbenezer",
                                    "body": "What exactly have I made up ?\n\nhttps://www.theguardian.com/uk/1999/may/26/sarahhall",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Fast_Assumption_118",
                                            "body": "You had to go back 26 years to find that you Muppet!",
                                            "score": -17,
                                            "replies": [
                                                {
                                                    "author": "AgentEbenezer",
                                                    "body": "Yes , if you read my comment properly you'll see I mentioned when  I was at school twenty years ago it was concerning as this incident happened then . I was accused of BS so I put up the evidence of said honor killing . Your reading comprehension is poor .",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Fast_Assumption_118",
                                                            "body": "I will give you the benefit of the doubt on that. The way I read your comment was that this happens all the time and we are now a Muslim controlled country. If you were only pointing out one random time that it happened and not just trying to get in with the racists in here then I apologise.",
                                                            "score": -10,
                                                            "replies": [
                                                                {
                                                                    "author": "AgentEbenezer",
                                                                    "body": "I'll accept your apology but its more common than you think . Here's a interactive map of all the honor killings in the UK in recent history.  These are suspected/ confirmed cases .\n https://karmanirvana.org.uk/data/interactive-map-of-honour-based-abuse-deaths-in-the-uk/\n\nAnd before you cry racism , I'm not racist in the slightest,  my issues lie with religion, all of them .",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Fast_Assumption_118",
                                                                            "body": "Now I'm not saying it isnt horrific and stupid because it is. With a quick Google the estimate for \"honour killings\" is around 12 a year.  A similar Google shows 42 toilet related child deaths. I absolutely believe that the number of honour killings should be zero but we have bigger problems to contend with. Again from a quick Google the number of domestic abuse deaths involving white people was in the hundreds. Again I'm not saying you are wrong to be angry at any of it but to pick the one you have over others has to have something to do with the people doing it and not the crime itself.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AgentEbenezer",
                                                                                    "body": "OK,  I'll ask you this , of the 12 a year , which religion is most prominent? And I've raised that particular issue in my original comment as we're talking about radical Islam and my concerns about it ruse in the UK . If this thread was about Catholicism I'd be mentioning the child abuse scandles . You seem to have a knee jerk reaction to critism of certain Islamic practices.  Why is that? Why shouldn't I be able to raise concerns in a sensible manner without being called a racist ?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Fast_Assumption_118",
                                                                                            "body": "I want to point out that I absolutely hate religion of any kind. It is used to control people. However let's not pretend that most people here are here for anything other than hating brown people. As you said Catholics are more likely to fuck kids but they have been here forever. \nHowever my point wasn't that it wasn't bad. It's that people use it as an excuse. 5 or 6 people die every year from cow related issues. Should we kick all the cows out?",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AgentEbenezer",
                                                                                                    "body": "You've dodged my question , which religion has the most honor killings in the UK?  And going by the interactive map its increasing in frequency.  \n\nTbh I find this sub quite open minded, ofc there's always a few people with extremist views but the majority seem level headed. \n\nWe can't control cows or the people who venture too close them , it's not a valid argument.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Fast_Assumption_118",
                                                                                                            "body": "Yeah Muslims do most of those 12 if not all. It's not the win you think it is. Bad people are bad. My point is that the really bad people use stuff like this to divide us. I have more in common with you and most Muslim people in my country than I do with people like trump and musk. They want us divided so we ignore that they are screwing us over at every turn. \n\nThis is the first time I've been here and reading through the comments doesn't seem to agree with your comment although as it is now on the front page that could be outsiders.\n\nWe can and do control cows. Completely. Don't think there are any wild ones out there.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "AgentEbenezer",
                                                                                                                    "body": "I'm not looking for a win , I'm trying to get across the point that we need to be able to have conversations like this without the knee jerk response of racism . \n\nNow it would appear that you were looking for a win,  your comment about my post being bullshit and calling me a muppet which I admit you did apologise for screams look at me and how quickly I can disprove your point . I would hassard a guess you were looking for an argument. I'd kindly suggest that you consider what's being said before launching into an attack.  \n\nDiversive politics,  ofc there's always been that problem but it's a natural one , everyone's different and thinks differently to another so they'll always be a divide . \n\nAs far as Trump go's he right sometimes , I'll vehemently disagree with his handling of the Ukraine crisis and totally agree with other things he might say . Biden was sometimes right also .\n\nYou seem to be on mission to attack anyone or on anything that agrees with Trump . Take time to consider the actual issue and not political aliegances you hold . \n\nCows, what I'm saying is we can't reason with a cow or control the IQ of those stupid enough to get too near them , we can  or rather should control humans wanting to inflict their religious beliefs on their adopted countries.  Please stop looking for that win in this conversation and use logic .",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Fast_Assumption_118",
                                                                                                                            "body": "You are right. I should stop looking for a win. You aren't grasping what I'm saying at all. Never mind. Carry on with your life",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "AgentEbenezer",
                                                                                                                                    "body": "Maybe it's how you approach a subject . Never mind and I'll wish you a good day .",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ImpossibleRoutine780",
                            "body": "The reason the UK is collapsing is because of Brexit. The UK has been collapsing since WW2 and that was the final nail in the coffin.",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "AgentEbenezer",
                                    "body": "It's not Brexit , our inflation is less than the EU. Trade continues just as much as before . We never implemented brexit properly. It what's called a soft brexit, basically in name only . \n\nWe've had boom and bust many times since WW2 , more boom than bust tbh . What's declined is living standards , wages dropped due to immigration , health service can't cope due to the mass influx of people . There's other factors but immigration is the key one in my opinion.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "ImpossibleRoutine780",
                                            "body": "Right so immigration is only a problem when people come in. But isn't UK also sending their own immigrants to other countries but that's not a problem? In other words your people can be immigrants but as soon as people come in there is a problem. How about you people stay where they are too?",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "HazelCheese",
                                                    "body": "> Right so immigration is only a problem when people come in. \n\nIf significantly more people come in than leave, then yes. The Boriswave was like 2 million people in 2 years. Boris and Sunak absolutely ratfucked us.\n\nI feel fucking bad for Labour because they are just fucked. The devastation of the tory immigration policies is nuts. There is zero chance they can fix it before the next election.\n\nThe other thing fucking us is disability stuff. People claiming money and cars because they have \"adhd\" etc. Governments on the news trying to cut it today and everyone is screaming like the government is trying to kill them. We have millions of people living in this country who are emotionally invested in having everyone else pay for them to live. \n\nThere was a guy complaining about the government cutting PIP in one of the threads a few days ago, looked at his post history, free car from the government which he took racing around the scotish highlands and the rest of the money he spend on a full F1 racing sim rig and like 20 collectable edition lego car models. And this guy was acting as if the government has no heart because they say they can't afford that sort of thing.\n\nThe guy has genuine mobility issues and I really feel for him, and I'll happily pay taxes for the government to help people like him live a normal life. But I don't remember signing up to pay for someone to race around scotland or funding their lego addiction. And every penny spent on stuff like that is money not spent in situations where someone really needs it.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "ImpossibleRoutine780",
                                                            "body": "Right so maybe focus on the native born criminal element that is stealing hundreds of millions in white collar crime. Also all you have to do is tax The City of London and it's what 1000s of financial institutions just on that street. Did you know they don't have to pay taxes because of a loophole signed by William the Conqueror. Watch the Spiders Web doc about it then come talk about it.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "HazelCheese",
                                                                    "body": "If you took 50% of the wealth of all the rich people in the UK, it would pay for like 1 month of the governments current bill, do it again and you get another month and have no more rich people to take money from.\n\nWe can't afford the current system. There's 27 million private workers, and 28 million civil workers/pensioners/benefits claimants. The math just does not add up and that's before you include the millions of children which also get healthcare and schooling etc.\n\nEvery single person working is paying for more than 1 other persons salary or non working funds. That is pure insanity.\n\nALl of this went haywire after COVID and we can literally see in the stats it's not disabled or sick people who are the problem. It's people claiming benefits for \"mental health\" that has skyrocketed since furlough happened. Millions of people who are just gaming the system and making life harder for people who are physically disabled or have real mental health problems.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ImpossibleRoutine780",
                                                                            "body": "Tax havens like the city of London costs governments $500- $600 Billion ANNUALLY by hiding money. The money is there",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "ImpossibleRoutine780",
                                                                            "body": "The City of London is home to FINANCIAL INSTITUTIONS. They can literally afford to Trillions of pounds why? Because the global pool of money that is being sheltered for tax purposes is about 20 trillion which the city of London helps hide a significant portion of that pool. The top 1% can afford a bit of a haircut.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "HazelCheese",
                                                                                    "body": "If you look at that stats, the UK loses 40 billion anually to tax avoidance from Multinational Corporations and Invididuals. \n\nThis is from the Tax Justice Network who hold extremely low opinions of the UKs fight against Multinational Tax Avoidance so they are not biased in the governments or companies favour:\n\nhttps://taxjustice.net/country-profiles/united-kingdom/\n\nThey wrote an entire article last year blaming the UK for being one of the worst offenders for tax avoidance:\n\nhttps://taxjustice.net/press/tax-haven-ranking-uk-protects-itself-while-keeping-world-defenceless-to-british-tax-havens/\n\nIf you want to include tax lost by all countries in the world to UK tax havens, it would be 160 billion anually, but that's the entire world, the UK would only see 40 billion of that, miles away from the 500 billion you claim.\n\nOn the other hand, we are currently paying 55 billion a year in benefits, and that's expected to rise to 100 billion a year within 5 years, if nothing is done. Labours cuts they announced today will only reduce that to 95 billion within 5 years.\n\nSo even if we magically captured 100% of all the UK tax avoidance, within 5 years we'd still be worse off than we are now.\n\nThe system cannot go on as it currently does. The math does not add up.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ImpossibleRoutine780",
                                                                                            "body": "You gotta read the article you posted literally found this in the article \" The yearly loss goes up to $169 billion when including losses arising from wealthy individuals using the UK and its tax havens to underpay tax.9\" any more dickriding you want to do from propaganda?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "HazelCheese",
                                                                                                    "body": "That's all countries globally combined, not the UK losses alone.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "ImpossibleRoutine780",
                                                                                                            "body": "Ok I didn't think I would have to spell this out so essentially the UK is gathering the money from people avoiding taxes in their home country I understand that. But now UK has a pool of  roughly $180 billion hidden in its institutions. So a politician can now make a law that says ok but now you hav to pay a tax avoidance tax to have your money with us right?",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "HazelCheese",
                                                                                                                    "body": "The yearly tax bill is 900 billion so if we took the entire global 180 billion (which every country would demand their part of) we still wouldn't even have enough to cover 1/4 of a year.\n\nAnd then we'd never be able to do it again because no multinational would ever trade in the UK again. They'd flee to other tax havens.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "ImpossibleRoutine780",
                                                                                                                            "body": "No the 180 billion represents just how much the UK handles through its tax havens. the global pool of dark money is again in the trillions about 20 but no one really knows. but what other tax havens let you park money without even disclosing your name able to set up a phone address in the British Virgin Islands. Switzerland only allows it's citizens to bank in the country so unless you're born there can't use that. All you would need is a politician and a following that backs the idea of taxing I mean why not seize the entire 200 billion since technically the money doesn't belong to anyone what are they gonna do? Most other countries are starting to make you disclose who the real owners are anyway so the world is starting to go after them. You are doing a lot of mental gymnastics to not say your biggest problem is actually the bankers and politicians the UK has elected I think most or the last few PMs since Cameron all come from the finance world specifically City of London why? So you hate  the immigrants and not them.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "ImpossibleRoutine780",
                                                                                            "body": "https://taxjustice.net/press/tax-haven-ranking-uk-protects-itself-while-keeping-world-defenceless-to-british-tax-havens/#:~:text=Countries%20are%20estimated%20to%20lose,tax%20havens%20to%20underpay%20tax. I can link stuff too",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AgentEbenezer",
                                                    "body": "It's more the illegal immigration that effects us , also economic immigration.  We have a plyable benefits system and free health care that acts as a magnet . When British/UK citizens emigrate we tend to go to jobs and marriages . We also abide by the rules of the new countries and pay our way in their health systems , sadly this can't be said for many many of those who arrive on our shores .",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Excellent-Ad257",
                                                            "body": "A lot of them send the bulk of their money back home as well. They live with 3 families and 3 generations of those families in a single dwelling to save money to send it back to their home countries. Im sure most is going to family members but I’m willing to bet if even a small percentage goes to anything nefarious that amount is still in the tens of millions at minimum",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Beo_reddit",
                    "body": "i work with British and many colleagues from our company are muslim, the muslim people have 3-5 kids, the Brits have 1 or none.  \nI believe this will happen",
                    "score": 143,
                    "replies": [
                        {
                            "author": "Commercial_Camera_86",
                            "body": "And are these muslims you work with radicals? Cause the muslims I’ve worked with have been beautiful souls, very gentle.",
                            "score": -138,
                            "replies": [
                                {
                                    "author": "Beginning_Stay_9263",
                                    "body": "Very gentle until they have the majority. Then you get Lebanon or Syria https://www.youtube.com/watch?v=aMRJJzC9V7Y.",
                                    "score": 76,
                                    "replies": [
                                        {
                                            "author": "boltroy567",
                                            "body": "You get Lebanon and Syria after years or European occupation, followed by America buying cheap oil from the group that became Saudi Arabia, which spread the Islamic equivalent of the westboro Baptist Church across the region.",
                                            "score": -19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "iiji111ii1i1",
                                    "body": "The gentle ones are still following a religion which says being gay is wrong and to kill non believers and something about marrying 9 year olds",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "tactycool",
                                    "body": "\"Radical Muslims will throw you from a roof top.\n\nA moderate Muslim will watch the radical throw you from a rooftop.\"",
                                    "score": 155,
                                    "replies": [
                                        {
                                            "author": "gridemann",
                                            "body": "Amen!",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "ImpossibleRoutine780",
                                            "body": "Right and a radical Klan member will lynch you while the free speech warrior will watch see I can do it too.",
                                            "score": -38,
                                            "replies": [
                                                {
                                                    "author": "Adventurous_Mail7467",
                                                    "body": "Ya and? Two things can be true",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "INTJ_Nerd",
                                                    "body": ">radical Klan member \n\nThis is a mythical creature which doesn't exist anymore.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "ImpossibleRoutine780",
                                                            "body": "Same people don't know the definitions of things and just listen to what they are told. The definition of radical advocating or based on thorough or complete political or social change; representing or supporting an extreme or progressive section of a political party.. I think an all white world would be extreme wbu?",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "INTJ_Nerd",
                                                                    "body": ">I think an all white world would be extreme \n\nChange the color from white to black or brown, is that also extreme?",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hypewhatever",
                                            "body": "Oh how similar white Americans and Muslims are. Guess extremists are the same everywhere",
                                            "score": -67,
                                            "replies": [
                                                {
                                                    "author": "Ambitious-Net-5538",
                                                    "body": "Ah yes, all the American public stonings and state-approved roof throwings. Which ESPN is that on again? 9?",
                                                    "score": 34,
                                                    "replies": [
                                                        {
                                                            "author": "ImpossibleRoutine780",
                                                            "body": "O right because the US doing death by firing squad isn't also barbaric",
                                                            "score": -30,
                                                            "replies": [
                                                                {
                                                                    "author": "tactycool",
                                                                    "body": "Bruh, you can only do that by request of the inmate & even then only in a few places, & even then only for the most horrific of crimes😂\n\nYou need a better pearl to clutch",
                                                                    "score": 13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ImpossibleRoutine780",
                                                                            "body": "No because I'm Mexican where we have a history of firing squads and death squad. if you think it's so noble n just why don't you sign up to do it?",
                                                                            "score": -7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "tactycool",
                                                                                    "body": "1. Who said anything about nobility? 🤨\n2. I'm a law abiding citizen 🇺🇸 I don't need to fear the death penalty \n3. I would 100% take a firing squad over a chemical injection",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ImpossibleRoutine780",
                                                                                            "body": "Sure buddy because the government has never executed aN innocent man right? O wait no that's when the government is perfect n doesn't make any mistakes or have any corruption that would send an innocent man to the death penalty. Which is it we live in a perfect government or do we have a fucked up government that has the ability to nothing right both cannot be true if you support trump. Do you want to rethink your statement?",
                                                                                            "score": -3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TheGrandBasstard",
                                                    "body": "Are you braindead? Whens the last time you saw a \" white American\" kill someone for being gay?",
                                                    "score": 35,
                                                    "replies": [
                                                        {
                                                            "author": "New-Land2026",
                                                            "body": "You're joking right",
                                                            "score": -27,
                                                            "replies": [
                                                                {
                                                                    "author": "tactycool",
                                                                    "body": "& they weren't arrested? 🤨",
                                                                    "score": 19,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "TheGrandBasstard",
                                                                    "body": "No, I'm not joking and I'm still waiting. Of course you didn't answer me",
                                                                    "score": 7,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "HomerSimpsonFanFan",
                                                                    "body": "Silence speaks volumes...",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Duke9000",
                                    "body": "Religion of peace!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "SenorShrek",
                                            "body": "So peaceful that they just can't keep it in. They explode their peaces all over the place",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ambitious-Net-5538",
                                    "body": "So they aren't fanatics, just zealots of a hateful and destructive belief system? Well, now I'm sold lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ambitious-Net-5538",
                                    "body": "So they aren't fanatics, just zealots of a hateful and destructive belief system? Well, now I'm sold lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Purple-Group3556",
                                    "body": "The outward racism of this subreddit is so sad.",
                                    "score": -8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "starberry101",
                    "body": "I'm an ex Muslim who received asylum in Canada. I was raised in the religion and what you're describing is a strategy that a lot of Muslims agree with.\n\nThey will also pretend to agree with certain Western values in order to establish a foot hold. I mean you can see it plain as day.  Look at someone like Ilhan Omar - she grew up in a religious fundamentalist household and still chooses to wear a hijab. Do you really think she is progressive and supports LGBT? It's all for show to grab power",
                    "score": 81,
                    "replies": [
                        {
                            "author": "Carnivalium",
                            "body": "I can't imagine the frustration of the people who flee from this only to see it grow in the society they escaped to.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "ImpossibleRoutine780",
                            "body": "So one person speaks for an entire religion. Well I think Charles Manson speaks for all white and Christians",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "starberry101",
                                    "body": "I think Mohammed speaks for all Muslims",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kc3x",
                            "body": "A Question if you care to answer...You say you're Ex Muslim and believe these talking points.( Do you feel that your asylum should be revoked) as you're contributing to the said problem? You being in the country taking away from a Natural Born Canadian,Job,Housing,Resources  even though you're claiming asylum...You're still naturally a Muslim at heart with different values.(Yes-DeportMeBack)(No-ImAGoodOne)",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "ReptAIien",
                                    "body": "Truly a dumbass reading of what that dude said. I expect nothing less from this sub, well done.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "EmmaPosi",
                                            "body": "Your right 👉",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "kc3x",
                                            "body": "😂😂I guess it's dumb to ask questions. MAKE IT MAKE SENSE",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "ReptAIien",
                                                    "body": "You're not asking a question, you already know what you think. Telling him he's contributing to a problem isn't opening him up to a response, it's an attempt to guilt him into answering in a way that's contrary to what you've already determined is true.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "kc3x",
                                                            "body": "So cause the question makes him feel bad it's not ok??????????? No it's asking him about his belief  wtf are you on about. I ALREADY KNOW WHAT I THINK THATS WHY I ASKED WHAT DOES HE THINK... WTF that's bad now...snowflake",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "ReptAIien",
                                                                    "body": "I doubt the question made him feel bad, he probably doesn't give a fuck. The reason it's a poor \"question\" is because regardless of what he says, it will make zero impact on your thoughts.\n\nImagine he says \"no\", what's your response? Seriously, I want to know what you'd say to the dude if he actually fell into the trap of interacting with you lol.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kc3x",
                                                                            "body": "If he says no and / or doesn't respond like so...the conversation ends..if he responds to the conversation it continues and we dive deeper",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MakeAmericaPoopAgain",
                                                    "body": "Do you know you're retarded? Just asking a question.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "kc3x",
                                                            "body": "I would believe so like most people are. Lol \nDo you feel you're also retarded for engaging with a retard?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "starberry101",
                                    "body": "I think Canada should stay Canada and I moved to Canada because I think Canada is better than Egypt.  There are 100 million Egyptians and 40 million Canadians.\n\nIf enough Egyptians come here we will become just like Egypt and it will become not safe for religious minorities.  When I was in Egypt I had to pretend like I was Muslim. It is now getting to that point here in Canada - I think that is a bad thing and it may get worse",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "kc3x",
                                            "body": "Canada should stay Canada. \nThat line is really confusing as to what it means. \nI'm American, I know there are Americans from countries I've never heard of that don't speak English but I wouldn't say they are Making America less American by joining the country. Do you mean by like Changing the Laws? Do you consider yourself to be Canadian or Egyptian.If these Laws came into Place/no asylum. Would you be first in line to go back since you support no asylum.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MDK1980",
                    "body": "Another imam also said years ago that they wouldn't even need to fight because they'd use the West's political correctness against itself. The UK will very shortly pass completely insane blasphemy laws, so he was completely right.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "stewartm0205",
                    "body": "I notice how successful it is by the fact that there are no longer any true Christians.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Iwubinvesting",
                    "body": "Wow you watched a single retard say something and now you're radicalized into far right wing ideas? How original.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hrafndraugr",
                    "body": "Every demographic growth statistic confirms it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "plain_incognito",
                    "body": "That's also what the right Christian right says in America. They are cut from the same cloth and know nothing but control and violence.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GhostInThePudding",
                    "body": "Yep, Muslims are sadly much smarter than Westerners. We are busy worrying about aborting babies and cutting off our genitals, they just keep breeding and conquering.\n\nI don't really care though. I'll convert to Islam and have me a harem of slave girls if it comes to that. Hell in Germany more than 80% of women actually voted to have that, so it's ironically consensual slavery.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nezothowa",
                    "body": "He’s in for a rude awakening because the dormant SS stands at the ready when the time is right. \n\nThey will never let this happen.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AntBeaters",
                    "body": "Well luckily every retarded hick in this nation will pump out half a dozen bacon eaters on average",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Mello_20",
                    "body": "This sounds like a good plan until you realize that kids from immigrants are often not religious at all.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "starberry101",
                            "body": "Second and third generation Muslims in Europe are often times more religious than their parents.",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RedMdsRSupCucks",
                    "body": "Yikes such fear mongering..\nIt is true that London is very culturally diverse, but after living there for over a year and a half I learned that there are neighbourhoods and neighbourhoods.\nNorth is eastern Europeans and Jews, east is eastern Europeans and Muslims, south blacks and whites, west mostly whites and rich Muslims, and in the centre, well it's literally a rainbow (not talking about gays )... Also a lot of South Asians but they're pretty much everywhere in London.\nIt's very diverse and most people that live there just want to live their lives and take care of their families.\nNo one came there to \"outbreed\" the whites... That's pure nonsense spewed by a retard.",
                    "score": -90,
                    "replies": [
                        {
                            "author": "Vdjakkwkkkkek",
                            "body": "English people are white. London should be mostly white.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "RedMdsRSupCucks",
                                    "body": "That's racist",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "author": "Vdjakkwkkkkek",
                                            "body": "Please explain to me how either of those statements are racist.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RedMdsRSupCucks",
                                                    "body": "Saying that one place should be one race implies discrimination based on race .... Racism...\nI feel sorry for you if that's how you view the world, based on melanin content.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Vdjakkwkkkkek",
                                                            "body": "I said it should be mostly white. English people should be a majority in England. \n\nHow is that racist?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "RedMdsRSupCucks",
                                                                    "body": "They are lol, just drive 60 miles in any direction... \nThe brown population in the UK are mostly South Asians ( Indians and Pakistanis) and most of them are there for 3-4 generations, can't really kick em out they're as English as black Americans are American...",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Vdjakkwkkkkek",
                                                                            "body": "Terrible analogy. America is different since American is not an ethnicity so yeah black Americans are of course just as American as white Americans who have been here for generations. \n\nEnglish is an ethnicity. there are no South Asian English people. All English people are white. \n\nThere are South Asian UK citizens but they can not and will not ever be Scottish or Welsh or English or Irish.\n\nI'm glad to hear from you that English are still a majority in London. They should keep it that way!",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RedMdsRSupCucks",
                                                                                    "body": "Yea I don't know about what they should or shouldn't do... But from what I gather, most people that have a problem with non-whites are people online. \nI agree that there is a big problem brewing in Europe regarding immigration. But to paint all brown people as immigrants just because they're not indigenous to Europe is racist IMO, especially since most South Asians were invited in the UK by the UK through student visa programmes and no visa requirements for Pakistanis and Indians, which in the UK constitutes the majority of brown people. To go back to the original subject of this post, a lot of non-whites in London have been there for generations, the house I rented in Finchley when I lived in London was from an Indian landlord who was born there same as his father, it was his grandfather who came to the UK in the 40's.\n20 years ago it had roughly the same composition racially but now it's a problem because trump said it ...",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Vdjakkwkkkkek",
                                                                                            "body": "Again you keep inferring that I'm saying England is only for white people. The UK was an empire that England was the center of and towards the end of their empire they incorporated a lot of their colonies. It was a really humane way to unwind colonialism unlike say the French who fought bloody wars to hold on to their colonial holdings to the last inch. \n\nThat's why there are some of UK citizens who live in England of Indian, Pakistani, Jamaican, Bangladeshi, etc descent. \n\nThat does not make those people English and you still haven't given me any reason why it's racist for me to say the capitol of England should be inhabited by mostly English people. Nor have you explained how it's racist to say that Germanic people have white skin.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "RedMdsRSupCucks",
                                                                                                    "body": "You said London should be mostly white... Why ? Because it's in England ? And English people are white ?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Vdjakkwkkkkek",
                                                                                                            "body": "Yes Exactly!",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "RedMdsRSupCucks",
                                                                                                                    "body": "So what do you suggest we keep it white ... Impose some Jim crowe laws that prevent non-whites from buying property? Or how about redlining that prohibits others from moving in ?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Vdjakkwkkkkek",
                                                                                                                            "body": "Drastically limit migration. Let in 0 non skilled workers. Deport anyone who entered illegally.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "RedMdsRSupCucks",
                                                                                                                                    "body": "Yea I'm with you 100% on that one... But most of the non-whites in London are there legally... For generations, they're British citizens, what do we do about those non-whites?",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Vdjakkwkkkkek",
                                                                                                                                            "body": "You shouldn't do anything with them WTF is wrong with you, I imagine if you take the steps I listed London will remain majority white. \n\nLondon should remain majority white. \n\nWhat are you having trouble with. I really don't get.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "RedMdsRSupCucks",
                                                                                                                                                    "body": "I don't know anymore how to explain this to you my dude...\nWhen you're making statements on how things should be based on race it implies that the other races shouldn't be there. \nI don't know exactly what the racial diversity is in London but based on the fact that the most common name for newborns in 2023 was Mohamed, I don't think that a white majority is prevalent there but that doesn't mean that it shouldn't be like that, especially since it didn't got that way through imoral ilegal or unethical means.\nYou can't work in England if you entered the country illegally or are illegally there. \nThey have either a settlement scheme or right to work, which means that everyone who is there can't work without a government issued number, and employers can't hire you without that number. \nThings are the way they are through legal means... \nI can go on about how white people have less kids because they focus more on careers and themselves meanwhile less educated people tend to have more babies thus out breeding the whites, or how immigrants tend to stick together and bring their families over or how rich nations always attract people form poorer more corrupt countries but that's mostly white peoples fault and we have to deal with it.\nI'm not going to fault someone who wants to do the same work but get paid 10x for the same work in the UK as to where they came from...",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Able-Helicopter-449",
                                            "body": "UK should be as diverse as it was 500 years ago and the rest of EU as well. that's how I want it to be.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "RedMdsRSupCucks",
                                                    "body": "500 years ago the world was a shit hole, no thank you... \nBut you keep being racist.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Excellent-Ad257",
                            "body": "The interview I saw said nothing about “the whites”. It was all non Muslim peoples. This includes native Americans, African Americans, as well as Europeans. The only ones it didn’t include were asians because they don’t have the same open door policies. I’ll try to dig up the video. He went a lot more in depth",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "RealityIsRipping",
                            "body": "Are you British or are you a foreigner living in London as well?",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "RedMdsRSupCucks",
                                    "body": "I'm eastern European, lived in the UK for about 10 years and then fucked off to Netherlands when I saw how fucked things were getting...",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "RealityIsRipping",
                                            "body": "Foreigner - got it. Your opinion has been discarded.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RedMdsRSupCucks",
                                                    "body": "Lmao, as if yours matters 🤡🤡🤡",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Holiday-Profile-919",
                            "body": "London was not diverse in first place not until they opens the door for immigration for the sake DEI and they have fked very hard now and Europe also.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "RedMdsRSupCucks",
                                    "body": "That's not true, Indians and Pakistanis have been in London since the 50's..",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Kano_Roronoa",
                                    "body": "London became diverse when they invited other ethnicities from the colonies to increase labor and build their city. You can't blame them for settling there even after the shit treatment they got.\nWhen they pushed brexit and sent home the wind rush generation the NHS and other sectors almost collapsed",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Anemicwolf14",
                            "body": "the downvotes says alot about this sub right?",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "RedMdsRSupCucks",
                                    "body": "Yea ever since baldie-locks went full political this sub is becoming more and more ...",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ImpossibleRoutine780",
                    "body": "It's so funny watching white people be afraid of the very thing they did to native populations everywhere. I think white people project the fears of what their ancestors did because they think if we were got into power we would destroy them. Nope your racism makes you weak.",
                    "score": -50,
                    "replies": [
                        {
                            "author": "ImHerPacifier",
                            "body": "No, you're wrong. You're ideologically possessed. Humans tend to protect their cultures and traditions; it's only the new post-modern cancer that the west has accepted in recent times that lead to this scenario. \n\nYour pathology can easily be exposed: the folks immigrating to the UK would never stand for their country having a laissez faire immigration policy in which foreigns make up significant portios of economy, birth and etc. This is effectively giving your country over to another group or nation and the non-western world (where most are emigrating from) understand this. Do you not see the irony here?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "ImpossibleRoutine780",
                                    "body": "I'm possessed? You are just spewing talking points. Every Western countries population is crashing or not meeting replacement levels so this idea of keeping your ppl pure will eventually cause your extinction. Immigration has been happening since the dawn of time and to think that groups can be kept separate shows your brain rot. That's not how the real world works. Civilizations take and borrow things from each other all the time.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "ImHerPacifier",
                                            "body": "What you're talking about is a replacement theory and not a sharing of cultures or ideas. You're wrong again or just being dishonest - most countries, especially outside of the western world - protect their traditions and cultures. That's partly why we have different countries with different borders and different cultures and traditions. It's not about keeping a populace \"pure\", it's about preserving the populace's cultures, traditions, and way of life. One more, I'll state again: the migrants also hold this viewpoints and would not allow a large foreign populace to enter their home countries to put reproduce their native population. If natives are replaced then those cease to exist and in current scenario will be entirely replaced with the winning populace. \n\nIt's pretty simple logic to understand: if the Brits have a reproduction rate of .9 and migrants have a reproduction rate of 2.4, what do you think will happen? The British culture will be replaced. This isn't an innocent \"sharing of ideas and cultures\", lol, how dishonest and ignorant.\n\nEdit: one more point, again you're being dishonest or you're incredibly ignorant / super narrow world view: most countries in the world have strict immigration policies with distinct traditions, cultures, and peoples.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ImpossibleRoutine780",
                                                    "body": "News flash replacement theory was a thing created by Right wing think tanks to get you exactly what you are doing. Blindly following. on a long enough time scale the life of everything goes to 0. So if you don't have an influx of population then a tribe would die. New people means that old customs and new customs are shared and exchanged. It's only through this western culture that has financially segregated everyone into their echo chambers. Also here is a thought for you in 100 yrs when everyone you know is dead You Are Already Going To Be Replaced. That's what time does. The fact that you use British culture as an example proves you know nothing about history or culture. British culture is a made up word it comes from when Celts , Danish and Anglo Saxons all invaded the island so where do you even get this idea of British culture the island has been invaded hundreds of times n each time the culture changed. Did you know the original Celts had chariots similar to ancient Egypt so isn't that proof that ideas and cultures can be exchanged. I also shouldn't have to mention sometimes these culture changes happen at the sword point as the Germans that destroyed Rome if that didn't change things. Fundamentally history has been people coming together sharing ideas to face the problems sometimes they did so peacefully the  impact of Buddhaism is just one example a religion originally in India now dominants all of Asia and many parts of the world. So just because you don't know how to research doesn't mean the information isn't out there.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "ImHerPacifier",
                                                            "body": "You've just made one big, incredible straw man. I don't entirely disagree but it's not what we're talking about. People conquering lands or assimilating over time is distinctly different from an immigration policy that allows large foreign populations to move in and out reproduce the native populations.\n\nYou can point out that populations will die if they don't meet a certain reproductive rate with perfectly utility, but it doesn't make a justification for immigrants replacing an existing populace. Most rational people don't want their country, economy, politics, traditions, etc.. suddenly overrun and replaced. \n\nWhat's happening in Europe isn't some natural evolution of people sharing ideas and cultures, you again keep trying to frame it that way.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ImpossibleRoutine780",
                                                                    "body": "Ok so according to you what year did immigration start because under your definitions you are saying that one day all these immigrants just started showing up at your door through no actions of the government from which you come from. The UK through colonization caused issues in the middle east where most of your immigrants are coming from. So you want answers who is to blame but you got to start looking in the mirror. And which policy let's immigrants out fuck your \"native\" population because I don't remember that passing Parliament it's the free market of ideas and when you are losing you now want to change the rules to the game. Truth is Europe is dead and has been dying since WW 2 you have no manufacturing don't even have an great big army anymore China developed AI before you. UK is also so based on who you know why would anyone want to keep that culture alive rather than making a new one. You also couldn't even defend the whole British culture and how it doesn't exist because it was invaded who knows how many times by diverse groups of people  so you are making argument you can't even defend. Europe has been devolving for centuries face it your best stuff is behind you n you let propaganda convince you it's because of immigrants no you just suck.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Excellent-Ad257",
                                            "body": "“Talking points” is the new hand wave I see. When did talking points become a bad thing? lol. \n\n“You’re just spewing talking points” as you put your head in the sand and contribute nothing to the conversation yourself",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ImpossibleRoutine780",
                                                    "body": "No what you said was just dumb and wrong. N literally saw piers Morgan say the same thing. Have your own ideas not what they tell you. Immigrants that come from other countries have also lenient immigration policies. Mexico before Trump historically was open to immigrants and even has immigrant populations ranging from Jews to Koreans. Same goes for most of South America letting even Nazis live there. African countries let's Chinese companies and people live in their nations counter to propaganda they treat them fairer than white colonizers.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ImHerPacifier",
                                                    "body": "Everything this guy says is a lie, including saying I have \"talking points\". He's a post modernist. My ideas are novel, while his are all ideological. You could easily replace him with any other liberal / progressive and it wouldn't make a difference. There's no \"him\" in his argument, it's just regurgitated ideological viewpoints that he's rehearsing.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Adventurous_Day470",
                            "body": "I find it ironic you call people racist when you're the one throwing about the term White people and what their ancestors done clearly you haven't read a history book and clearly you're unaware that the people you're trying to defend literally still practice genocidal tendencies and also had some of the worst practicing of slavery against Africans and still practice slavery to this day.\n\nBut we always have to remember you guys forget who ended the slave trade.\n\nNever forget [https://www.youtube.com/watch?v=dnDhuRUYQoE&t=736s&ab\\_channel=BlackJournals](https://www.youtube.com/watch?v=dnDhuRUYQoE&t=736s&ab_channel=BlackJournals)",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "Beo_reddit",
                            "body": "Who is \"we\" and who is \"white people\"? You need to be more specific. If it was not for the west, most Muslims would still be fucking sheep and beating each other with sticks in the desert",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "ImpossibleRoutine780",
                                    "body": "Lol white people wouldn't be anywhere historically they have been slaves for a lot longer than they have run things. Also the Pinnacle of civilization is Egypt they have a culture that has survived thousands of years. White ppl get most of their personality from an invisible guy they think will help them that came out barely 2000 years ago. The pyramids were already built for who really knows how long. So no Muslims don't just beat each other they actually never had a dark ages unlike European whites. In fact thats why the ancient texts like Mediations because Muslims scholars were saving while white people were saying it was devil work. Miss me with that",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "djiemownu",
                            "body": "Maybe you are one of the reasons people want to crusade . Ever tought about it ?\n\nIf racism is okay as arabs , what makes you think they other way around wouldn't work ?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "ImpossibleRoutine780",
                                    "body": "That's the way it's worked in USA for 200 yrs. My people come from Mexico where we lived under almost 500 yrs of racism and slavery. They already made the world you talk about but it didn't affect you so what do you care",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smelly_farts_loading",
                            "body": "I have this weird feeling you’re definitely racist.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Franklynotarobot-",
                            "body": "Listen to yourself. If a bunch of retards like yourself were in power you would absolutely be a racist piece of shit. Fuckin shitstain",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Carnivalium",
                            "body": "Do you think the Arab conquests were peaceful?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ImpossibleRoutine780",
                                    "body": "Yes some of them were. Have you ever heard of the Islamic Renaissance. Did you know the only reason we have \"Western\" works like Homer was because Muslims in universities were saving works while white ppl in Europe were in the dark ages were burning all the western ideals you claim to protect now. islam like all ideas can be highjacked by ppl who want to abuse it. However when white people do it it is fine when minorities do it they are all bad.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ruggersyah",
                            "body": "How are the Christians doing in Syria currently? Or how about the Christians in Nigeria?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImpossibleRoutine780",
                                    "body": "Well if you knew anything historically they were fine. In fact when Jerusalem was under Muslim control of Saladin it was then that first broke with crusader tradition and didn't murder all of the population and gave all the religions equal access. Now after USA bombed things like weddings of Muslims probably not so good. Also did you know Palestinians are also Christians are you worried about them?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ruggersyah",
                                            "body": "Historically? it's happening now in Syria and Nigeria, you don't have to go back 100s of years ( guess we won't talk about the muslin colonization of Spain).\n\nMajority of Palestinians are Muslim  less than 2% are Christian and that number shrinks dues to hamas and Israel",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "anyonereallyx1",
            "body": "True. It is 30% white British.",
            "score": 221,
            "replies": [
                {
                    "author": "Marcson_john",
                    "body": "That's hilarious because you know those 30% will deny it. Chicken for KFC.",
                    "score": 92,
                    "replies": [
                        {
                            "author": "anyonereallyx1",
                            "body": "Bro the UK are on a suicide mission. Kind of like the bombers from a particular area of the globe haha.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "No-Swimming-6218",
                                    "body": "England is 80% white British, with another 6% identifying a 'white other' (Irish, French etc)\n\nScotland is 96% white British\n\nAsians (including Muslims, Hindu's, Buddhist, Chinese, japanese etc etc) make up 9% of Englands population and 4% of Scotlands.\n\nThe murder rate per capita in the US is 6x that of the UK.  Appreciate crime will vary drammatically in some areas vs others in the USA - but the same can be said about the UK.\n\nUnquestionably though, net immigration is too high in the UK just now - but is a fraction of the net illegal immigration the US is currently dealing with.  I think perhaps Trump is deflecting and should focus on domestic issues rather than concerning himself with the demographics of a unquestionably safer country than his own.  Not to mention the Fent/Opiod epidemic that is plagueing ur cities over there - that should be far more concerning than any kind of demographic consideration no?\n\n[https://www.ethnicity-facts-figures.service.gov.uk/uk-population-by-ethnicity/national-and-regional-populations/population-of-england-and-wales/latest/](https://www.ethnicity-facts-figures.service.gov.uk/uk-population-by-ethnicity/national-and-regional-populations/population-of-england-and-wales/latest/)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "Your numbers are slightly off, but you make a good point, though I do think is it just a statement. I wouldn't read in to it too much. He says a lot of wild shit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "No-Swimming-6218",
                                                    "body": "They arent\n\nedit - they are, Scotland is 95% white British, with 1% 'white other'\n\nLook, i'm not saying immigratio in the UK isnta problem just now, but, compared with US cities its a fking Utopia.  Trump is deflecting.  As an example, check this shit out - imagine this was London or Liverpool or some shit - and an American president is taking aim at our cities - he can gtfo\n\n[https://www.youtube.com/watch?v=p5AeGKSDVdE&ab\\_channel=StreetRecords](https://www.youtube.com/watch?v=p5AeGKSDVdE&ab_channel=StreetRecords)\n\nAnd this same shit is happening is Washington, Baltimore, St Louis etc etc",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "Sorry, yes you are right.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "No-Swimming-6218",
                                                                    "body": "all good my man",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Marcson_john",
                                    "body": "Don't worry my dude, the European continent isn't far behind. We are just short of finding oil and American would not resis the urge to invade us.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CheapLink7407",
                    "body": "You can’t call the UK a country if all the local people are the minorities now. It’s sad, but this is a failed immigrant policy. Politicians don’t give a f**k because it doesn’t affect them.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "anyonereallyx1",
                            "body": "There is still hope! Re-migration is inevitable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "elev8dity",
                    "body": "Arabs are 1.6% of the population according to their demographic data.\n\nEdit: for added clarity\n\n* 53.8% White\n   * 36.8% British\n   * 1.8% Irish\n   * 14.7% Other \n* 20.8% Asian (much of these are second/third/fourth gen due to being prior British territories)\n   * 7.5% Indian \n   * 3.3% Pakistani \n   * 3.7% Bangladeshi \n   * 1.7% Chinese\n   * 4.88% Other\n* 13.5% Black (Most also multi-generational Londoners)\n* 5.7% Mixed-Race (mostly white + other race)\n* 6.4% Other\n   * 1.6% Arab\n   * 4.7 Other Ethnicity",
                    "score": 12,
                    "replies": [
                        {
                            "author": "bwv1056",
                            "body": "Pakistanis aren't Arab though, and they comprise the largest group of Muslims in the UK. ",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "elev8dity",
                                    "body": "True, they've grown from 0.9% to 3.3% from 1980 until now.  I'm unsure if that's driven by their birth rate or migration.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "bwv1056",
                                            "body": "I would guess that it's a little bit of both. ",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "anyonereallyx1",
                            "body": "So? I never mentioned Arabs, you mentioned Arab, the Asian population is about 20% if you take out Chinese. \n\nThen you have specific areas in London like Tower Hamlets. \n\nAt 34.6%, Tower Hamlets has the largest Bangladeshi population in England and Wales and the largest Muslim population (39.9%) in England and Wales. It had the fourth smallest White British population and the smallest Christian population in England and Wales.\n\nOr Birmingham which is only *48.7*% *White* \n\nOr Manchester which is only *56.8% White*\n\nAlso 41% of London's population were not born in Britain. \n\nAnd I don't care if you class them as second generation immigrants, they are not British. You're not making a good case as to how Britain is not turning in to a globalist dot on the map, devoid of the culture and the people that made it Britain.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Successful_Candy_759",
                                    "body": "Why is a high percentage of white people important to you?  Every white person in America is the descendant of an immigrant.  Why is immigration wrong if you're not white",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "It is not about skin color it is about culture.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Successful_Candy_759",
                                                    "body": "Since when is culture defined by skin color?",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "For all of history, but you are right, different races can obviously live together given proper assimilation. That is not what has happened in England. In 1990 the white British population was 94.65%, now it is 68% . You can not assimilate that many people in the span of 30 years. It is just not going to work.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Amzer23",
                                                                    "body": "It's actually 74%.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Successful_Candy_759",
                                                                    "body": "This whole idea that immigration pollutes your country's culture is straight out of the fascism playbook.  \n\nIt's fucking crazy to me that this has become a leading belief.  Y'all are racist as fuck.\n\n\"Give me your tired, your poor, your huddled masses yearning to breathe free, the wretched refuse of your teeming shore\". But only if they are white I guess because that would dilute our culture.  Shame on you.",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "anyonereallyx1",
                                                                            "body": "Immigration does not, I just told you this, uncontrolled mass immigration does, but you can bury your head in the sand and pretend normal people don't have rational concerns, and you will keep getting politicians like Trump, then asking yourself why it is happening.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Successful_Candy_759",
                                                                                    "body": "These are just ramblings.  What aspects of American culture are being eroded due to mass immigration?",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "anyonereallyx1",
                                                                                            "body": "Well, what is the point if you just consider everything i say as ramblings and dismiss. This conversation is a waste of time.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Successful_Candy_759",
                                                                                                    "body": "Hahahahaha so I ask for you to give me an example and you get upset and leave the conversation.\n\nSo typical.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "anyonereallyx1",
                                                                                                            "body": "No, it's not. It's just a waste of time, but here, US culture is heavily based around European, Christian values, and also the constitution. You open the doors like Biden did. You let in millions who don't care about the constitution or what made America great to begin with. \n\nThat erodes the culture because now you have foreigners in the country who don't share your traditions and values and most likely,  dont give a fuck about the constitution or the millions of men who died in world wars to keep the country we have. Living in the US is a privilege and should be treated as such. \n\nI mean, this is just common sense. I'm not sure why I have to explain this to you.\n\nAlso immigrants who come from tyrannical places are more likely to accept less freedom than the typical Amercian because it's at least better than where they left.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Successful_Candy_759",
                                                                                                                    "body": "This is rambling nonsense.  You did not give a single example of a piece of culture being eroded.\n\nWhat are European values?  What are Christian values?  Name a specific value that has eroded specifically due to immigration.\n\nWhat in our constitution has eroded?  Pretty sure our rights are the same as they always were.  The only one trying to change the constitution is trump and project 2025\n\nEdit: like dude it's crazy that you're trying to veil your obvious racism beneath some bullshit analytics about culture.  You can't provide a single example, you just don't like brown people",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "anyonereallyx1",
                                                                                                                            "body": "lol, no, you're just too stupid to open your eyes and live in reality. Here's a specific one, like you said. Chicago is a none gun zone. Why? Well, because of the gun crime committed in the city by mainly black people. You will keep losing elections over and over because normal people agree with what I'm saying, not radical reddit leftists.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "MaridKing",
                                                                                                                                    "body": "82% of gun crime in Chicago was committed by black people (92% male) between 2015 and 2021, that's true. \n\nSo are we going to treat 99% of the 700,000+ black people living in Chicago like criminals because 1% are vastly more prone to gun violence? That's literally just stereotyping and racial profiling. It isn't the fault of black people, it's the fault of a tiny subset of black people.\n\nHey, did you notice that men are an even higher % of the perpetrators than black people? Why aren't we talking about how violent and dangerous men are? Oh right-because it's retarded to generalize a small sample size to the whole group.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                            "body": "lol, you are adding to a conversation at the wrong point, they asked for an example of a minority community affecting the constitution that is what I gave. But, you're right, I agree, so lets look at the whole of the US. 60% of all violent crime in the US is committed by 3.4 % of the population, that is black males between the ages of 14 to 45. Trust me, you don't want this debate. The facts are not on your side.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "MaridKing",
                                                                                                                                                    "body": "wow 60%. You wanna see a bigger number? 99% of sexual assault is done by men. So tell me, based on the fact that a small group is overwhelmingly responsible for a certain crime, what are your conclusions, and what do you think should be done about it?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                            "body": "My point is, we don't need to import more problems, we have enough.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "MaridKing",
                                                                                                                                                                    "body": "pussy ass bitch can't give a straight answer after claiming the facts are on your side.\n\nCome on, man up. 60% by 3.4%, what's your conclusion, and what do you wanna do about it?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                            "body": "Why personally insult me? It's weird. You are trying to add to conversation but you don't know what we are talking about. Read whole thread and you will have your answer.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "MaridKing",
                                                                                                                                                                                    "body": "You're on the asmongold subreddit and you're offended? Get real.\n\nI'm insulting you because you talk big, but the moment you're in a corner, you back down and change the subject. Then when you get called out, you cry about it and still keep your mouth shut. What happened to all the facts that are on your side? Didn't you say I don't want this debate? Well, I do, but apparently you don't.\n\nI've seen all I need to. You wanna keep quiet, be my guest.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                                            "body": "There is a difference between a debate and then you being too lazy to read what I have already written, and then ask questions that are not at all relevant to the original conversation. Why are you so stupid? Just go read what i wrote.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": []
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Griffith-007",
                                            "body": "I ask you this, that flip it around. Would you be okay if bunch white immigrant moves to to Pakistan or other Arab/African nation",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Due_Tell11045",
                                                    "body": "Wont happen.  Most of those same countries won't let u move there unless u have A LOT of money.   If they don't gain anything by letting u be there u don't get to.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Successful_Candy_759",
                                                    "body": "Yes, why the fuck wouldn't I be?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Griffith-007",
                                                            "body": "But let's say 300 year from now they are replaced by white population. That is the problem.im getting at",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Successful_Candy_759",
                                                                    "body": "What the fuck is this white replacement theory bullshit.\n\nThe racism is so thinky veiled it's basically just blatant.  You're not being replaced.  Skin color is not a competition.\n\nThey're just fucking people",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fission2006",
                                    "body": "You are so racist it's unreal bro.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "Are you joking or? lol",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "lol, England is the most divided it has ever been, multi-culturalism is a failed idea and you are on track for a civil war. Healthcare, housing, culture, community trust, even the safety of young British girls, in which over 500k have been systematically raped by Pakistani grooming gangs over the years and the police covered it up. Nothing is working. \n\nHow many terror attacks did the UK have prior to Blair opening the doors to the rest of the world? None. \n\nYou call me racist for wanting the Britain to remain British, I would not say the same about your country of origin. I think all races and cultures should have their own homeland. It is not racist for whites to want that, it is natural.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Fission2006",
                                                                    "body": "Absolutely not.\n\nYOU ARE WRONG.\n\nHow many shops do you go to a day that are owned not by the \"white British race\" but by people who have come over here and made a living? Blood sweat and tears? But you just glaze over the core problem?\n\nA few bad eggs do NOT ruin the batch.\n\nA majority of refugees/immigrants want a better life, they want to live in a peaceful society.\n\nWhy can we not offer this to them?\n\nim not saying that there are not people coming over here intending to do harm. Obviously. People are people, we are mad and unpredictable and easily swayed to the \"wrong\" side.\n\nYou are comparing everyone that came to this country in times of need and suffering and tarnishing them with the same brush.\n\nHow is that fair?\n\nI stand by my accusation that you are a racist and there is nothing I could possibly say that could convince you.\n\nWish you all the best.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "anyonereallyx1",
                                                                            "body": "Because you told me you're not British, I am fucking sick to death of foreigners moving to the west and then telling us how we should behave and what laws we should have and who we should let in the country. NO. Remigration is inevitable, remember that.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Fission2006",
                                                                                    "body": "Please try again bro.\n\nYour talking to a white British person...",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Fission2006",
                                                                                    "body": "When did I tell you I'm not British?  I AM WHITE BRITISH\n\nI'm born and raised here.\n\nI understand the problems in this country.\n\nWe are at a crossroads but I believe in the spirit of humanity.\n\nThere will always be more good than evil. This is not religious in any way but what I believe.\n\nYour way of thinking is fundamentally flawed and I think you need to review your life stance. Painting everyone with the same brush is what got Germany into the nazi era, if you can't see that you are blind.\n\nIf people act like they did back then it is only a matter of time before the quote unquote \"good guys\" fall to the same thing that happened 80+ years ago\n\nEveryone is human and deserves a life with all the rights afforded to me and you. \n\nWhy should they be characterized on the colour of their skin. Are we not meant to base them on the content of their character?\n\nAgain we could have this conversation till the end of time itself and we would never agree.\n\nWish you all the best.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TheDreadEffigy",
                                                                                            "body": "I think you need to get out more and see what's going on around you. These views, whilst admirable, lack life experience.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Fission2006",
                                                    "body": "Not joking, the UK is a testament to how people from all worlds and walks of life can live together. Just because we are not MOSTLY white British, I think this annoys you.\n\nTry learning about other cultures. Respect them as people...\n\nA few bad eggs don't ruin the batch.",
                                                    "score": -5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fission2006",
                                    "body": "You are so racist it's unreal bro.",
                                    "score": -4,
                                    "replies": []
                                },
                                {
                                    "author": "DonShino",
                                    "body": "What is this culture and people that made Britain that people always talk about? How far back do you go? \n\nThe Romans? The Anglo Saxons? The Norman's? The Union in 1707? The Beatles first album?",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "wtf are you talking about? Obviously all of it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "DonShino",
                                                    "body": "The Romans brutally invaded and forced assimilation into the Britain of the time. They imposed their own laws and order, erasing local traditions and identities. \n\nThe culture changed. It changed with every invasion, with every conquest, with every religion... it will continue to change forever. I wouldn't worry yourself about it.",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fast_Assumption_118",
                                    "body": "What culture do you offer? Shit tattoos and football hooliganism isn't what we are after!",
                                    "score": -6,
                                    "replies": []
                                },
                                {
                                    "author": "Fast_Assumption_118",
                                    "body": "What culture do you offer? Shit tattoos and football hooliganism isn't what we are after!",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "lol, don't make me pull out the list. Everything you see around you came from Europe or Britain, the language you speak even. You are like a fish who dismisses water. You have become so accustomed to our culture you don't think it exists.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Fast_Assumption_118",
                                                    "body": "I live in it you twat. My question wasn't what was our culture, it was what you think you provide towards it. Smoking rollies, drinking lager and smacking your misses doesn't count either!",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "I'm not even going to entertain this with a response. You are dumb.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Fast_Assumption_118",
                                                                    "body": "So I'm right then?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Adventurous_Mail7467",
                                                                            "body": "Right dumb",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Fast_Assumption_118",
                                                                                    "body": "Get back in your mother.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "plain_incognito",
                                    "body": "Well, that all depends on what you consider Britain. You got to remember Britain had many colonies in the British provider. So for a Time that was all Britain. Because if you don't count That then you can't count North Ireland, Wales or Scotland. The fact is you're being pedantic and racist.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "No, you would not go to China and call them racist for wanting their country to be mostly Chinese. These are dumb arguments and only used against white people in the west. I'm sorry but I don't agree and I don't care what you want to label me. The fact is, people have had enough of being called racist and are now moving to action, which is why you have Trump and the right wing winning all over Europe. Canada will soon be a conservative government as well. People will not sit by while there country is turned in to something they don't recognize. It won't happen.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "anyonereallyx1",
                            "body": "You are looking at the wrong figure, they are classed as Asian in England. *Asian British: 20.8%*",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "spondgbob",
                                    "body": "If you were born and raised in a country, are you not a part of that country? When does that change… after so many generations?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "No. My British ancestry can trace back 1000 years. You don't become British because you have a piece of paper given to you by a treacherous government.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "surrealpolitik",
                                                    "body": "That doesn’t answer the question though. If being born and raised in a country isn’t enough, then what is?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "Well, those people will never be British. I just explained what I consider to be British, deep ancestral ties to the land dating back to near the creation of the country is a good starting point. Just because you were born in a country does not make you automatically from there. Maybe it does to you. I disagree. You're acting like if I moved to China and 40 years later, my demographic was 40% of the population that we would now all be Chinese. No. You would call us racist colonisers then, wouldn't  you?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "surrealpolitik",
                                                                    "body": "So someone needs to have family ties going back a millennia, got it. I guess someone else whose ancestors came to your green and pleasant land in the 17th century should still be considered outsiders? \n\nGood Lord, America’s got plenty of problems but the Old World is damn near fossilized.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "anyonereallyx1",
                                                                            "body": "Yes. In the case of America, the 17th century was when the country was created, so yes.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "surrealpolitik",
                                                                                    "body": "That’s hardly the point.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "GInTheorem",
                                                    "body": "and presumably by extension you would conclude that the only people who are right to call themselves American are native Americans?",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "INTJ_Nerd",
                                                            "body": "No, they lost in the Age of Empires III to EU civs.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "SilverDiscount6751",
                                                            "body": "Do you want the same thing that happened to indigenous americans to happen to the british? Was is good then or is it bad now?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GInTheorem",
                                                                    "body": "Nothing in my comment contained any kind of moral judgement. As it happens, my view is that there are a large number of culture-driven issues with British immigration policy at the moment, but that doesn't change the fact that suggesting people born and raised in Britain who might never have left the country can be something other than British is a fundamentally ridiculous take.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok_Cryptographer8549",
                            "body": "https://www.cosmopolitan.com/uk/body/a26971152/most-popular-baby-names/\n\n\nAs of 2023, most popular boys name is muhommad. How the fuck that happened in london is a big fuckin problem",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "elev8dity",
                                    "body": "Probably because of less diversity in naming for Muslims than non-Muslims. The following 27 most popular names are Bible-based, and the 28th is Mohammed instead of Muhammed lol.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ok_Cryptographer8549",
                                            "body": "That contributes for sure. But the fact thats happening in a western country highlights an issue that most dont want to acknowledge. These people arent assimilating to our societies.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "elev8dity",
                                                    "body": "I don't think that indicates any level of assimilation. I think it indicates lazy parenting and a lack of creativity.  When you have their kids going to British public schools, they'll learn British ways and assimilate even if the parents aren't interested.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "spondgbob",
                    "body": "36.8% white British and 53.8% white as of 2021. It’s the New York City of the UK, of course it is the most diverse? Should New York be worried because there are so many Italians/jewish/irish?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "anyonereallyx1",
                            "body": "Yes, of course you should worry about demographics, or you lose what made you that country, the 3 biggest cities in England.\n\n  \nLondon 36% White\n\nBirmingham which is only *48.7*% *White*\n\nOr Manchester which is only *56.8% White*",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "huntersam13",
                                    "body": "Reddit taught me cultural genocide only matters when it happens to POCs lol",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "That is essentially the argument, it's okay if it happens to white people because of racism or something? lol, no. All races and cultures have worth and deserve to have their own place in the world. That's what makes the world interesting.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SaraJuno",
                                    "body": "This isn’t even correct though",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Successful_Candy_759",
                                    "body": "Skin color doesn't define a country you fucking racist.",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "Successful_Candy_759",
                                    "body": "Skin color doesn't define a country you fucking racist.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "Never said it did you fucking shitlib.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cplusequals",
                            "body": "Yes, it's a problem if the English are becoming a minority in their own country. Only 36% of their own capital is crazy. America doesn't really compare well to other countries since we are a melting pot. And New York's melting primarily happened a hundred years ago where discrimination forced the Italians and Irish to integrate and drop the antisocial or otherwise incompatible aspects of the cultures they brought. And it wasn't nearly as rapid a demographics change. Britain's mass migration problem is way worse per capita than the US's and it's heavily concentrated in cities rather than along the border populations which already had heavy cultural influence from Mexico.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DogbrainedGoat",
                    "body": "It's 36.8% white british (which precludes other nationality white btw)\n\nNew York is 37.5% white\n\nWhat's the problem? Big metropolitan cities that are melting pots are a good thing actually and London is a great place to visit as is NYC.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "anyonereallyx1",
                            "body": "Well America was 96% white European in 1960, so you have a big problem too.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "DogbrainedGoat",
                                    "body": "USA is not in Europe and the indigenous people of the USA are not white.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "Bullshit, the original North Americans are not white. The USA was created by white Europeans.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "DogbrainedGoat",
                                                    "body": "I obviously meant the land not the political arrangement of the govt.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "Yes, well, I could say the same about anywhere. It's not relevant. The British weren't Italians until Rome invaded, bringing up ancient history it not smart, you are doing it to you can dismiss facts you don't like as racist or something. It's 2025, the strategy is played out, I don't care what you think about me.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "DogbrainedGoat",
                                                                    "body": "Wtf is this projection? \n\nI was simply saying it's normal for big metropolitan cities to be diverse in ethnicity, it's nothing new and nothing to piss your pants about.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SaraJuno",
                    "body": "What you referring to? London is over 50% white",
                    "score": -4,
                    "replies": [
                        {
                            "author": "anyonereallyx1",
                            "body": "No it is not it is precisely 36% white.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SaraJuno",
                                    "body": "And again, what are you referring to? Because everywhere I check this number shows it’s wrong",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "anyonereallyx1",
                                            "body": "Google London demographics.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SaraJuno",
                                                    "body": "I did, it says London is 54% white",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "anyonereallyx1",
                                                            "body": "The white British population I am talking about, again this is not a race issue, it is a culture issue. In 2021, 53.8% of London's population identified as white, including 36.8% who identified as \"White: English, Welsh, Scottish, Northern Irish or British,\" while 17% identified as \"White: Other\". \n\n  \n[https://www.google.com/search?q=white+population+in+london&sca\\_esv=45c41d3e543101a5&ei=08vZZ8nPFJPw0PEP7vWs0QE&ved=0ahUKEwiJhYbzsJSMAxUTODQIHe46KxoQ4dUDCBA&uact=5&oq=white+population+in+london&gs\\_lp=Egxnd3Mtd2l6LXNlcnAiGndoaXRlIHBvcHVsYXRpb24gaW4gbG9uZG9uMgsQABiABBiRAhiKBTIFEAAYgAQyBRAAGIAEMgYQABgWGB4yBhAAGBYYHjIGEAAYFhgeMggQABgWGAoYHjIGEAAYFhgeMgYQABgWGB4yBhAAGBYYHkiaLFAAWPspcAB4AZABApgBswOgAaUbqgELMTMuMTAuMS4xLjG4AQPIAQD4AQGYAhigAoEWwgIQEAAYgAQYkQIYigUYRhj5AcICChAAGIAEGEMYigXCAgoQLhiABBhDGIoFwgILEAAYgAQYsQMYgwHCAgsQLhiABBixAxiDAcICERAuGIAEGLEDGNEDGIMBGMcBwgIOEC4YgAQYsQMYgwEYigXCAioQABiABBiRAhiKBRhGGPkBGJcFGIwFGN0EGEYY-QEY9AMY9QMY9gPYAQHCAg4QABiABBixAxiDARiKBcICEBAuGIAEGLEDGEMYgwEYigXCAg8QLhiABBhDGNQCGIoFGArCAggQABiABBixA8ICDhAAGIAEGJECGMkDGIoFmAMAugYGCAEQARgTkgcGMTMuOS4yoAed0AGyBwYxMy45LjK4B4EW&sclient=gws-wiz-serp](https://www.google.com/search?q=white+population+in+london&sca_esv=45c41d3e543101a5&ei=08vZZ8nPFJPw0PEP7vWs0QE&ved=0ahUKEwiJhYbzsJSMAxUTODQIHe46KxoQ4dUDCBA&uact=5&oq=white+population+in+london&gs_lp=Egxnd3Mtd2l6LXNlcnAiGndoaXRlIHBvcHVsYXRpb24gaW4gbG9uZG9uMgsQABiABBiRAhiKBTIFEAAYgAQyBRAAGIAEMgYQABgWGB4yBhAAGBYYHjIGEAAYFhgeMggQABgWGAoYHjIGEAAYFhgeMgYQABgWGB4yBhAAGBYYHkiaLFAAWPspcAB4AZABApgBswOgAaUbqgELMTMuMTAuMS4xLjG4AQPIAQD4AQGYAhigAoEWwgIQEAAYgAQYkQIYigUYRhj5AcICChAAGIAEGEMYigXCAgoQLhiABBhDGIoFwgILEAAYgAQYsQMYgwHCAgsQLhiABBixAxiDAcICERAuGIAEGLEDGNEDGIMBGMcBwgIOEC4YgAQYsQMYgwEYigXCAioQABiABBiRAhiKBRhGGPkBGJcFGIwFGN0EGEYY-QEY9AMY9QMY9gPYAQHCAg4QABiABBixAxiDARiKBcICEBAuGIAEGLEDGEMYgwEYigXCAg8QLhiABBhDGNQCGIoFGArCAggQABiABBixA8ICDhAAGIAEGJECGMkDGIoFmAMAugYGCAEQARgTkgcGMTMuOS4yoAed0AGyBwYxMy45LjK4B4EW&sclient=gws-wiz-serp)",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "plain_incognito",
                                                                    "body": "Your point being. The fact is that any major population area that has a lot of internal trade is going to have a relatively low native make up. And let's not forget the major reason is because England was imperialistic and brought a lot of cheap labor back home. If you don't like it maybe don't go taking people from other parts of the world like that.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "anyonereallyx1",
                                                                            "body": "Oh I forgot I went to India and \"colonized\" the place. I must of just woken up from a coma. No. Using selective ancient history is not relevant to me and my opinions today. I didn't do these things.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "plain_incognito",
                                                                                    "body": "Ancient history. It was less than a century ago. And that doesn't excuse your racism. The fact is it's the reason why there are so many people there of different ethnicities is because you brought them there. Maybe not you personally, but the people who were there before you did so you don't really get to complain about it. You don't like it go somewhere else. That's what people like you always say. Hell you want to go even further back. Your ancestors don't even belong there. You're not native to Britain. Your people invaded it. So you were just as much a stranger as any of those other people.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "anyonereallyx1",
                                                                                            "body": "The paradigm in which you are calling me racist is about 15 years old. These were normal Liberal positions in like 2008. You don't know what you are talking about. Obama was deporting 2000 people a day. My position is basically early 2000s Liberal.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "plain_incognito",
                                                                                                    "body": "No it isn't. Obama was a neoliberal corporate Democrat. There's the big difference between legally deporting people and illegally deporting people. The fact is Obama never deported anyone with a green card and all of them had due process. That's the big difference. These people weren't even charged with anything and have the same rights as anybody else under the Constitution. The fact is you just don't like it because they're a different color which is why you're just a racist.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "anyonereallyx1",
                                                                                                            "body": "No, they do not. That is a lie. Obama deported undocumented immigrants just like Trump is doing. Being in the country illegally is a crime and is enough grounds to deport you. \n\nGreen card holders are not citizens and can have their visas revoked at any time if they advocate for interests adverse to American foreign policy. \n\nSo you again don't know what you are talking about.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "plain_incognito",
                                                                                                                    "body": "Actually you don't know what you're talking about because they did have due process. Too. Legally deport someone. They have to be found guilty in a court of law. Green card holders are citizens. That's what a green card does is give you citizenship and they still have protections under the Constitution. You can't revoke it just because you say so. There's a process. Your ignorance is on display and they weren't advocating for adverse American foreign policy unless you think our American policy is wholesale genocide of a people. Cuz that's what Israel is doing. They are basically 1940s. Germany. Literally killing an entire ethnic group just because they're different. So you can dress it up any way you want that still makes you a racist. Just because you're ignorant, doesn't excuse it.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "anyonereallyx1",
                                                                                                                            "body": "You are just wrong and I'm not arguing about it. Read the law.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "plain_incognito",
                                                                                                                                    "body": "Why don't you read the law? Because you are wrong, you don't have to argue about it because that's the truth. You can be wrong all you want and you can be a racist. That's your right as a free American as for now. But you're absolutely incorrect that Obama deported people without giving them trials because that's not how it worked. Trump is trying to enact a war-Time power in a time that we're not at war to try to deport people. The law has already said that he can't. That's why the court blocked it. Stay ignorant if you want.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                            "body": "You're wrong. Green card holders are permanent residents, not citizens. \n\nYour Rights as a Permanent Resident\nAs a permanent resident (Green Card holder), you have the right to:\n\nLive permanently in the United States provided you do not commit any actions that would make you removable under immigration law.\n\nWork in the United States at any legal work of your quYour Rights as a Permanent Resident\n\nAs a permanent resident (Green Card holder), you have the right to:\n\nLive permanently in the United States provided you do not commit any actions that would make you removable under immigration law\n\n[link](https://www.uscis.gov/green-card/after-we-grant-your-green-card/rights-and-responsibilities-of-a-green-card-holder-permanent-resident)",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                    "body": "Everyone is also protected by the Constitution If you are in US jurisdiction.. everyone has the right to free speech. Everyone have the right to peaceful assembly. All people do who are in the United States. And they literally said that he did not break the law. He has broken no immigration law. Neither did that professor that they deported. So you're wrong. They are still a citizen as far as it pertains to the Constitution. So tell me what law did he break because the government literally said he didn't break any laws.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                            "body": "You do have the right to free speech, yes. You do not have the right to advocate for terrorists, but you wouldn't know that because you haven't read the law.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                                    "body": "They were speaking out against Israel's genocide that is not supporting Hamas. In fact, if you want to call, it is what it is. If you support Israel in their genocide, you are supporting terrorism. I have read the law and again they didn't charge him with anything. So tell me what law did he break because you have to break a law and be convicted of it to be deported. Literally the Constitution grants everyone in US jurisdiction due process. Why don't you read the basics of our country before you start spouting off with your racist nonsense.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                            "body": "Wrong, he was organising protests that barricaded universities and hansing out pamphlets on hamas. Both of which are ground to lose his green card. As you have seen.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                                                    "body": "And yet the government didn't charge him with anything. They said so. So again, where's the due process that the constitution grants him? You have to be adjudicated. You cannot just ship people out that is against the law in America. And again, what did the professor do that got deported. She didn't even speak out against anybody but she was illegally deported all the same. It's funny how you pick and choose, but fail to understand that the Constitution still applies. You can't just deport somebody without a judgment from a court. That is the law in America.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                                            "body": "It's at the sole discretion of the secretary of state, but don't worry, it's in court now, and you will be proven wrong in the courts too.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                                                                    "body": "Yeah and when he is found not guilty will you shut the hell up? Probably not. You'll just bitch and complain cuz you're a racist. Again. I see you haven't said anything about the professor that was illegally deported. What did she do? She wasn't part of a protest and the government has yet to show any evidence that he actually supports Hamas as well. And it's not the sole discretion of the Secretary of State. Not a power that he has. You literally don't know anything. Obviously because you are still granted due process in America under the Constitution. It's in the Bill of Rights.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                                                            "body": "lol, it won't happen because I read the law, and you use feelings to make your arguments.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                                                                                    "body": "You haven't read the law. You haven't quoted any law. Which law are you talking about? Because as far as I know, the Constitution is the highest law in the land and is granted to all people, residents and non-residents within the jurisdiction of the United States and one of those is due process. So it's not at the sole discretion of the Secretary of State. They cannot unilaterally deny somebody a green card that has already been granted one. But prove me wrong. Pull up the US code that says that they can. I'll wait.",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                                                                            "body": "Look for the law on your own. I don't have to hand, and im at the gym. Have fun.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                                                                                                    "body": "Like I said, you've never seen it. You're just repeating some bull crap you've heard because you can't pull it up because it doesn't exist. There's nothing in the code that supports anything. You're saying whatsoever. It literally says you have to break immigration law. Go ahead and wank off by yourself because you've lost. You don't have anything to back up what you're saying and I have the Constitution which beats out your imaginary laws. Of course you people don't believe in the Constitution. Evidently as long as it's not applying to someone of a different color that you disagree with.",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "author": "anyonereallyx1",
                                                                                                                                                                                                                                            "body": "Believe what you want. I don't care. I read it. It's something like section 8c or something of the the Immigration and Nationality Act (INA).",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": []
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "author": "plain_incognito",
                                                                                                                                                    "body": "The Constitution literally applies to everyone within the jurisdiction of the United States. Residents and non-residents and as a green card holder, he is a permanent resident and therefore has the protections of the Constitution.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "SaraJuno",
                                                                    "body": "But that makes complete sense. London is one of the biggest international hubs in the world. New York is like 31% white (not even white american, just white). LA is the same.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "anyonereallyx1",
                                                                            "body": "That is a major problem, whether you think that should be the case is the point of debate. I think England will lose it's identity, you obviously don't see it that way. Which is fine, I respect your opinion. I just don't agree with it. \n\nIt's not just London by the way.\n\nLondon 36% White British\n\nBirmingham which is only *48.7*% White British\n\nOr Manchester which is only *56.8%* White British",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "SaraJuno",
                                                                                    "body": "I’m not even arguing should or shouldn’t. These cities also possess large chunks of non white brits, which you’re not including for some reason. New York is majority American citizens, including a huge chunk of black Americans.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "anyonereallyx1",
                                                                                            "body": "Because it's not about race. It's about keeping Britain British. Like a good example. The Jamaican community, they are 100% in alignment with British values and assimilate perfectly. It doesn't matter they are black. They become British. That's an example of good immigration. A bad example would be Pakistanis, who share no common culture or values, have a different religion and belief system, and basically set up there only little enclaves. There is a massive difference. They will never consider themselves British.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "SaraJuno",
                                                                                                    "body": "If it’s not about race why are you referring specifically to white brits and completely disregarding non white brits?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "anyonereallyx1",
                                                                                                            "body": "Because they don't share the culture. What are you talking about? I don't think just because you're white you are okay to live in Britain. No. Britain for the British.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "SaraJuno",
                                                                                                                    "body": "Who is “they”? The non white brits? Including the ones you just said do share the culture?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "anyonereallyx1",
                                                                                                                            "body": "Well, i don't know. Poles? lol. You brought them up not me. They are not British, which is what this conversation is about.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThrowAwayInevitable1",
            "body": "As an Irish man, he's 100% correct, this is happening across the West.\n\nLondonstan, Paristan, and Dublinstan soon.",
            "score": 224,
            "replies": [
                {
                    "author": "Shizngigglz",
                    "body": "Man I saw a video of someone in Paris recently.... all peddlers selling shit on the street and not a French person in sight",
                    "score": 93,
                    "replies": [
                        {
                            "author": "Klebhar",
                            "body": "Sadly, as a French, I confirm.",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "toyotatechenjoyer",
                            "body": "Last time I was in Rome and Paris it was really bad. Seemed more like Libya than France or Italy.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "aerobuff424",
                            "body": "I saw the same thing but in London.  Place looked so sketch.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beo_reddit",
                    "body": "i travel to UK on business trips from Central Europe, the place has changed so much its crazy",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "GratuitousAlgorithm",
                    "body": "Its true in some parts of the biggest cities, but the rest of the UK is very, very white.\n\nWe have a census almost every year.\n\nThe U.K  is approx 80% White British, & has been that way for decades.\n\nPeople only ever see London, Birmingham or Manchester mentioned. They ignore the hundreds of other towns & cities that make up the true majority.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Cipher_01",
                            "body": "London being the capital city, ofc people will look at it.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "GratuitousAlgorithm",
                                    "body": "Yes, okay. but that doesn't change what I just said does it?\n\nThe UK is 80% White British.\n\nThe UK's muslim population is around 6.5%.\n\nThe USA \\*by comparison, is around 60% white.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Sudden_Bat6263",
                                            "body": "That is not true those are 2005 stats. It was 11% in2011, is now 22% and is predicted to be 33% in 2035 by the current growth rate.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "GratuitousAlgorithm",
                                                    "body": "What? I am using the last census, done in 2021.\n\nedit\\_dunno where you pulled your stats from, but do you not see how insane those figures sound?\n\nYou really think its possible that the population of muslims doubled in 14 years?? 😂",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cipher_01",
                                            "body": "Why do these percentages matter?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Sudden_Bat6263",
                                                    "body": "It's also not true those are 2005 stats. Currently 22% of the UK is identifying as practicing Muslim in census/surveys.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "GratuitousAlgorithm",
                                                            "body": "Bullshit. According to what, where are you pulling that from? The last census was 2021, and it shows around 6%.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "GratuitousAlgorithm",
                                                    "body": "If we're gonna have this conversation, than of course it matters.\n\nIt adds overall context to this bad faith argument that the UK is overrun with muslims.. The UK isn't only represented by certain neighborhoods in London, or whatever. \n\nMentioning the US white population is a comparison.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "RockstarOfLiterature",
                                                            "body": "When the police are too afraid of being called Islamophobic to investigate the serial sexual assault and rape of young white girls at the hands of Muslim grooming gangs, one can intuit that the UK has been overrun, not by population percentage, but by social pressure. Christ, instead of confronting the reality, some politicians have even branded the term ‘grooming gang’ as racist. \n\nBefore you reply, no, not all grooming gangs are Muslim. The Muslim ones are, though.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "GratuitousAlgorithm",
                                                                    "body": "I am 100% in agreement with you there 👍\nI'm in absolutely no way a Muslim apologist. There are many problems in muslim culture and society, and the effect they are having on my country is a tragedy.\nBut it annoys me when ppl lie about stats.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RockstarOfLiterature",
                                                                            "body": "Ah, fair enough, we’re in agreement then! Hopefully one day the people in our nation will choose to actually address the problems, rather than beating around the bush because they’re scared of being vilified.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "GratuitousAlgorithm",
                                                                                    "body": "Exactly. We don't need to make up shit just to reinforce our bias. It only makes us look stupid and  untrustworthy to our political rivals.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Cipher_01",
                                                            "body": "alr cool. Though the brits need to really control their immigration process. I cant imagine this being any good for their country.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GongsunYiru0",
            "body": "It's how the name 'Londonistan' was coined by French agencies, who saw it as a base of radicalization, in the mid-90s.\n\nOmar Nasiri, a pseudonym of a Belgian spy who infiltrated Al Qaeda, wrote:\n\n\"The mid- to late 1990s were the years when Britain's capital earned the sobriquet of \"Londonistan,\" a title provided by French officials infuriated at the growing presence of Islamist radicals in London and the failure of British authorities to do anything about it. [...] Raids in France and Belgium had produced phone and fax numbers linked to the United Kingdom, and names of suspects were passed on. Some French officials believe that if more had been done by Britain at the time, the network behind the summer of 1995 bombings might have been broken up and the attacks prevented.\"",
            "score": 143,
            "replies": [
                {
                    "author": "Beginning_Stay_9263",
                    "body": "Look into the NGOs pushing for this change to Europe.\n\n[Islam is the broom](https://www.youtube.com/watch?v=k8kc1_-cj6w)",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "The_Flagrant_Vagrant",
                    "body": "If you fly into Heathrow and take the train in to Paddington Station, when you leave the station you will think you were stepping on to the streets of Cairo. The women are all in burkas, and the shop signs are all in arabic.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shizngigglz",
            "body": "Muhammad is the most popular boy name in UK now. So yea...",
            "score": 57,
            "replies": [
                {
                    "author": "lizardkingsc4",
                    "body": "That’s insane, I thought it was just London but it’s the whole country now.  The country is doomed and they deserve it",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Amzer23",
                    "body": "Probably due to the fact that majority of Muslims name their kids the same name, unlike people in the west who generally choose names that they like the sound of or even making new names (Elon's children's name for a start).",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Shizngigglz",
                            "body": "Or due to the fact that the country is being overrun",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "luchisss",
                    "body": "McLovin is that you?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "castilhoslb",
            "body": "Give 1 more year to Lisbon and it's the same",
            "score": 17,
            "replies": []
        },
        {
            "author": "Dannyboy765",
            "body": "When did it become controversial to not want immigration from cultures that are incompatible and antithetical to our own?",
            "score": 18,
            "replies": [
                {
                    "author": "AnarchoCapitalismFTW",
                    "body": "You should see Swedistan Somalinlandia.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hiisthisavaliable",
                    "body": "When guilt by association became popular. Its like people have forgotten that the normal way to deal with radicalization isn't censorship and punishment but deradicalization. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "luthfins",
            "body": "for thinking like this, the left will brand us as rascists \n\n\nWell, let's just swap the region shall we? imagine if Ghana suddenly had an influx of white people while the native population declined\n\n\nIf the Ghanaian had a concern about this, were they rascist?",
            "score": 11,
            "replies": []
        },
        {
            "author": "kahmos",
            "body": "He's right.",
            "score": 52,
            "replies": [
                {
                    "author": "floodisspelledweird",
                    "body": "Bro you live in America shut the fuck up lol",
                    "score": -2,
                    "replies": [
                        {
                            "author": "kahmos",
                            "body": "You know a lot of us served in the military and been to these places.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nostalgebra",
            "body": "From the UK but not London. Visit for work occasionally. First went when I was 10. Wow how things have changed. The buildings are the same but the people are not. Unfortunately the culture in the UK does not allow anyone to speak up without reprisal. Immigration is a necessity for a lot of things but the scale and speed over the last 25 years has been shocking. Total replacement of many communities. If you go to London head to the pubs. Thats the only place you'll find western culture.",
            "score": 64,
            "replies": [
                {
                    "author": "PazzMarr",
                    "body": "Out of curiosity, what things are immigration a necessity for?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Sudden_Bat6263",
                            "body": "It's needed to fuel our businesses addiction to cheap labour,  ensuring the minimum wage is the maximum wage and to keep plenty of people competing for housing so slumlord rents are high and the housing property market continues to rise higher than inflation. Cos that's what the London financial is based around and secured on.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "TheDustyPineapple",
                            "body": "You ever seen British food? They at least need chefs",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Cantbebothered6",
                                    "body": "France is literally right next to us. We don't need to import a bunch of Bomalians for that.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "TheDustyPineapple",
                                            "body": "If French chefs came over and stayed would that not be them immigrating?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Cantbebothered6",
                                                    "body": "French chefs are a lot more civil than what we're currently getting.",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nostalgebra",
                            "body": "We have a huge employment need for both high skill medical jobs and low skill jobs that British people won't do. For that immigration is needed. That and international students etc. what we have is enormous amounts of third world uneducated cheap labour bringing their families with them over many years. We've got populations reliant on welfare and not contributing. Say this in the UK publicly and you'll be sacked or worse.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Grim_Reef3r",
            "body": "It's the same in Sweden.",
            "score": 27,
            "replies": []
        },
        {
            "author": "IDVFBtierMemes",
            "body": "He isn't wrong, I did a project in London in 2015 and I'm doing one in a nearby area now and it truly is unrecognisable - This problem will grow exponentially unless something is done.",
            "score": 77,
            "replies": []
        },
        {
            "author": "captaintemno",
            "body": "Trump not wrong ![img](emote|t5_2y1rb|3744)",
            "score": 9,
            "replies": []
        },
        {
            "author": "BennyOlaf",
            "body": "Went to Paris about a year ago and this is 100% accurate. It was like little Africa. Go visit the eifel tower and you will be completely harrassed from left to right with illegal black/arab merchants that get angry if you say no. Even the mini-mouse walking around is a short marrocan dude. I am from Amsterdam and my mom couldn't put the trash outside at night at her house because Arabs would be yelling sexual crap to her. In German schools the arabs play on the playground and the german kids stand at the edges. This will only get worse. In Portugal theres whole towns full of Indians that walk in groups of men everywhere.",
            "score": 9,
            "replies": []
        },
        {
            "author": "No_Bit_3897",
            "body": "Well... Cant deny that.",
            "score": 37,
            "replies": []
        },
        {
            "author": "JohnBulgakov",
            "body": "Claimed? It is.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Beerbarian87",
            "body": "I mean, tell me he's wrong. I'm British, and I'm sick of Islam being forced upon everyone thanks to our spineless government",
            "score": 33,
            "replies": [
                {
                    "author": "Snowrazor",
                    "body": "They are not spineless, they just sold you all.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Beerbarian87",
                            "body": "Fair point",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Beginning_Stay_9263",
                            "body": "Mossad probably has blackmail on all of them. [Islam is the broom](https://www.youtube.com/watch?v=k8kc1_-cj6w)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Amzer23",
                    "body": "As someone who actually lives in London, what the fuck are you talking about? I've seen nowhere that Islam is being \"forced upon everyone\".",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RealityIsRipping",
            "body": "Very true. Last time I went to London, not a single British person to be found - not even the businesses are owned by British folk.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Davidmuz",
            "body": "It’s true I live in England London is an absolute shithole immigrant dump now",
            "score": 7,
            "replies": []
        },
        {
            "author": "025shmeckles",
            "body": "UK and Europe are on their way to be 3rd world",
            "score": 6,
            "replies": []
        },
        {
            "author": "AnyEntrepreneur2334",
            "body": "I am from a muslim majority country and Taxpayer in US. (Turkish)  \nand here is the irony: I totaly agree with him. Don't let them come to your country, especially from Pakistan, Afghanistan and North Syria. Unfortunately muslim civilizations decided to keep middle age mindset even after Industrial revolution . Then few moron came up with idea that some verses sent to 6th century which were all about fighting against pagans during that era is practicable in modern era too because they hate west and they need excuse to be barbarian. Because just like Asmon said, some cultures are really inferior especially in 21st century. Those people need education but they refuse it. Educated muslims becomes the SECULARs who understands that in modern society you cannot practice sharia which is nothing but lunacy, especially if person reads quran with modern mindset, including other religious books, it is simple: Be a good person, help poor, believe in god .. etc If a lunatic reads , focuses on the specific era , he can easily ignore the biggest fact of the all religions : BE A GODDAMN GOOD PERSON, NO KILLING , NO VIOLENCE , GOD IS WATCHING.   \nAnd we are lucky that we had a historical person like Ataturk who turned country in the secular. we could end up just like them. \n\nanyway, your stupid government especially in US(democrats) let many lunatics to walk in, there are probably got sleeping ISIS cells and Taliban cells waiting for the right moment. I hope Trump, CIA and ICE destroys them soon. I hope they end up in places like CECOT or face with ultimate justice.",
            "score": 29,
            "replies": [
                {
                    "author": "Blowsight",
                    "body": "Osama bin Laden went to Oxford and still managed to become a terrorist leader. \n\nThe HAMAS leaders (Ismail Haniyeh, Khaled Mashal, Abu Marzouk) are educated and billionaires, though Ismail died last year in an airstrike. Each were worth over $4b USD.\n\nEducated muslims do not neccesarily become moderate.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "xRiolet",
            "body": "London looks like african/middle eastern shithole",
            "score": 33,
            "replies": []
        },
        {
            "author": "Correct-Style-9194",
            "body": "I was born in London and it’s TRUE. It has completely changed. Like, I can’t even begin to explain…",
            "score": 6,
            "replies": []
        },
        {
            "author": "Chikaze",
            "body": "England is lost to mass illegal immigration, their quality of life will continue to go lower and lower as more and more of this people continue to invade their land.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Feeling-Comfort7823",
            "body": "This isn't a claim, it's truth. My best friend just moved from there to Canada because he fears for his families safety and their home is unrecognizable.",
            "score": 6,
            "replies": [
                {
                    "author": "JustAnotherGlowie",
                    "body": "Canada is on track too",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zorath-tarrenmill",
            "body": "It is true. Same shit is happening more and more in sweden also..",
            "score": 5,
            "replies": []
        },
        {
            "author": "Rarazan",
            "body": "nah, its not because doors are open its because they allow them to ignore their laws, they dont punish immigrant but they punish their people way harsher then usual when they retaliate, same cases but different punishments if one side is immigrant",
            "score": 6,
            "replies": []
        },
        {
            "author": "pagarus_",
            "body": "London needs to be hypothetically nuked and rebuilt",
            "score": 5,
            "replies": []
        },
        {
            "author": "Barry_Umenema",
            "body": "He's right. It's not just opening the doors to jihad, although that's the elephant in the room right now. It's also opening the doors to simply too many people from everywhere. I don't know what the bar to meet for living here is, but it seems pretty low to me.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ulmaguest",
            "body": "It’s true",
            "score": 3,
            "replies": []
        },
        {
            "author": "Milkyslick",
            "body": "You see what China did in xinjiang is not too bad after all.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lilith-Vampire",
            "body": "[ Removed by Reddit ]",
            "score": 3,
            "replies": []
        },
        {
            "author": "Severe_Farmer_7023",
            "body": "He ain't wrong.",
            "score": 3,
            "replies": []
        },
        {
            "author": "StonedToDeath00",
            "body": "Ireland is following suit letting in so many unvetted migrant or \"vetted\" migrants who were convicted of the r work and then committed the r word in Ireland within a day of arriving. Happened within the last fortnight. Also the number of slashing incidents is crazy",
            "score": 3,
            "replies": []
        },
        {
            "author": "--lewis",
            "body": "It fucking has, country is a shit hole.\n\n And any town that has remained untainted has become destroyed by tourism/air BnB.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Prestigious_Cut4638",
            "body": "Yeah United Kingdom is being destroyed from the inside. Muslims will replace the British.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LouDoBz",
            "body": "Thing is, he's not wrong. I know it's a hard thing to hear, but London has changed a hell of a lot over the years and not in a good way. I can't say the same for Paris, I've only been there once myself, but it's capital cities that tend to take the biggest L when it comes to illegal immigrants getting into the country",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fickle-Elk-5897",
            "body": "islam really pushing for the religious victory lately",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jlp1991",
            "body": "He’s not wrong",
            "score": 3,
            "replies": []
        },
        {
            "author": "Accomplished_Cry4307",
            "body": "Londonstan.",
            "score": 3,
            "replies": []
        },
        {
            "author": "recountbumblaster",
            "body": "Demographic replacement is an indisputable fact.\n\nBut when you bring this up the left calls you a conspiracy theorist & a Nazi. Then you show them the numbers and they’ll say it a good thing.",
            "score": 3,
            "replies": [
                {
                    "author": "Nezothowa",
                    "body": "It’s not a good thing and Nazism will inevitably rise again because of it. But this time they will know what to do and what not to do. \n\nNazism 2.0. The better version, given the circumstances.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JunketInternal1724",
            "body": "Sad but true",
            "score": 9,
            "replies": []
        },
        {
            "author": "AdministrativeYam330",
            "body": "I mean it’s a fact, and the whole of Europe will be there soon then…\n\n![gif](giphy|qwGcDfEAGdJWmuSnwh|downsized)",
            "score": 9,
            "replies": [
                {
                    "author": "Jaxsso",
                    "body": "So putin nuking London would be doing the old UK a favor?",
                    "score": -10,
                    "replies": [
                        {
                            "author": "AdministrativeYam330",
                            "body": "Didn’t say shit about Putin. I see you are infected with the woke mind virus.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Jaxsso",
                                    "body": "You know nothing. I believe nuking a few of the major cities of the EU would kill more foreign invaders than local nationals. It's not like they have armies to stop anyone. The UK has around 18,000 combat ready troops, which couldn't even secure London, let alone the country. They are pathetic.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Jaxsso",
                                                    "body": "The UK army is 100,000, but there are only 18,398 combat ready troops (Medically Fully Deployable (MFD)) as of July 2024. Most in the UK army are not combat troops, but various support positions.\n\n[https://www.army-technology.com/wp-content/uploads/sites/3/2024/11/table.jpg](https://www.army-technology.com/wp-content/uploads/sites/3/2024/11/table.jpg)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mendenlol",
                                    "body": "i refuse to believe anyone who is no longer a teen seriously uses the phrase “woke mind virus”",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "AdministrativeYam330",
                                            "body": "Take one look at Reddit. It’s very real.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "mendenlol",
                                                    "body": "You personally know every single individual posting and thus cannot prove it’s a division campaign?\n\nOr are you just assuming everyone on reddit is a real person acting in good faith?\n\nThis subreddit alone could have someone without any critical thinking abilities thinking that blue haired ‘leftists’ are taking over the world and, simultaneously, that the authoritarian ‘strong men’  are ‘winning’ or whatever.\n\nReddit isn’t a good representation of real life and it may benefit you to talk to people face to face before writing off entire swaths of people.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Snowrazor",
                            "body": "Why would he? His government doesn't fight back immigration either.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jaxsso",
                                    "body": "putin is a dictator and has previously threatened nuking London and other EU capitals due to their tenacious support of Ukraine, especially after they provided Ukraine the storm shadow missiles. The joke is putin threatening to nuke London would be doing UK citizens a favor because it would mostly kill foreign invaders, and actually help UK citizens living under the oppression of mass migration and the murder and rape of UK citizens by the government supported foreign invaders.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Snowrazor",
                                            "body": "Your joke was pretty obvious, mate, not gonna lie.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Jaxsso",
                                                    "body": "Thank you, thought maybe it was going over some heads.\n\n![gif](giphy|ltBhl4BoHaMM)",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Cipher_01",
                            "body": "rent free",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Holiday-Profile-919",
            "body": "Don’t forget the mass rape happening in up for decade from a certain community and government did nothing.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TTrainN2024",
            "body": "Where is the lie?",
            "score": 8,
            "replies": []
        },
        {
            "author": "Jebator97",
            "body": "finaly someone is saying it",
            "score": 7,
            "replies": []
        },
        {
            "author": "cainreaker",
            "body": "For anyone interested in their actual published statistics \n\nhttps://trustforlondon.org.uk/data/geography-population/",
            "score": 3,
            "replies": []
        },
        {
            "author": "martini1294",
            "body": "As a Brit, London is a place I absolutely only go for a purpose or out of necessity. I’d liked to have seen it at another point in time. It’s a shame because some of it is absolutely beautiful and it has some great amenities",
            "score": 4,
            "replies": []
        },
        {
            "author": "Ok-Objective1289",
            "body": "That’s has basically happened to all of Europe",
            "score": 4,
            "replies": []
        },
        {
            "author": "Quintillion_Ton",
            "body": "![gif](giphy|tVT01YrHonWShkPcVq)\n\nWelcome to Londonistan!",
            "score": 2,
            "replies": []
        },
        {
            "author": "VolcanoSpoon",
            "body": "At the end of the day, rapid demographic change is probably the most disliked thing about immigration. I love meeting foreigners, but no-one wants entire areas of their country becoming foreign, particular when it's meant to be your capital city.",
            "score": 2,
            "replies": []
        },
        {
            "author": "glowingmug",
            "body": "damn dude's just said it, lol. Facts though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hardball1013",
            "body": "This is happening to Ontario big time as well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Geistermeister",
            "body": "I mean theres a reason why chinese airlines now have warning for women not to be unaccompanied in London.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Daedelous2k",
            "body": "London's demographics have changed so dramatically you can even [see it here](https://en.wikipedia.org/wiki/Ethnic_groups_in_London)\n\nJohn Cleese himself has even commented on it. There's even small towns made entirely of these groups, like Savile Town.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Devil_that_Heals",
            "body": "It’s true. I would never travel there",
            "score": 2,
            "replies": []
        },
        {
            "author": "CptKarma",
            "body": "He ain’t wrong.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MothsConrad",
            "body": "It’s certainly not a jihad but London has changed dramatically from a demographic perspective.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snoo48387",
            "body": "It's happening in slowly in Norway. Not long ago the biggest chicken slaughterhouses began slaughtering according to Islamic rules. There's a video of 2 Muslim guys just holding their hand out touching all the dead chickens that are on the assembly line. For some reason, the orange juice is also marked with Halal. Like wtf. It's actually crazy how much it has grown in the last few years. In my town (about 100k people) there's maybe 3 or 4 Christian churches, and at least 4 mosques that i know of. \n\nHere's a link if you want to see the chicken video. Nothing special but yeah..: [https://www.nrk.no/trondelag/norsk-kylling-har-begynt-med-halalslakta-kylling-1.17224591](https://www.nrk.no/trondelag/norsk-kylling-har-begynt-med-halalslakta-kylling-1.17224591)\n\nNot to mention the crime rate these days... Though that's mostly because of the immigrant laws being retarded and protecting the immigrants doing crime. A couple of months ago there was an article on the news that the police was looking for a fugitive, but they censored his face, and gave no name lol.. Granted, they always censor the face and name when it comes to crimes going on, which is just insane imo. Almost every day there's a new article about a murder by stabbing, or mugging on the open streets. Even just 10 years ago it wasn't this bad. \n\n  \nThere's a saying in Norway that we are about 10 years behind Sweden when it comes to crime rate due to immigration. Sweden is 100x worse though so hopefully our government will actually make a change before it's too late.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TeaSipper5000",
            "body": "I'm English. He's not claiming anything. That's how it is",
            "score": 2,
            "replies": []
        },
        {
            "author": "ServeNarrow7187",
            "body": "Hahahahaha its even funnier to think that the Muslims tools in Dearborn thought he liked muslims and decided to vote for him 🤣🤣🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "MDK1980",
            "body": "He isn't wrong. It's estimated that more British Muslim men joined ISIS and the like than the British army. \n\n[https://www.nytimes.com/2015/04/19/magazine/her-majestys-jihadists.html](https://www.nytimes.com/2015/04/19/magazine/her-majestys-jihadists.html)",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrTriangular",
            "body": "A clever tactic to divide the West: install agents to promote unchecked immigration and destroy gender identity, claim those countries are compromised, and go to war for \"Western values.\" Pitting human rights vs national identity vs democracy. You're either a gender-non-conformative cult, a Muslim fundamentalist state, or an authoritarian regime. Well played.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chris54L",
            "body": "What does the real demographic data say thought?",
            "score": 1,
            "replies": []
        },
        {
            "author": "sir_Kromberg",
            "body": "This is just the truth...",
            "score": 1,
            "replies": []
        },
        {
            "author": "National_Salt4766",
            "body": "weirdest shit I've seen, I open this post, and the first 30 comments, deleted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotEntirelyShure",
            "body": "It’s fine. I live here, a bit chilly today but otherwise it’s fine & I’ve not seen any jihad since Friday. There was a little jihad. A smidge of jihad.",
            "score": 1,
            "replies": [
                {
                    "author": "elusivewompus",
                    "body": "Overcast, with a hint of Jihad?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YariaYariDazii",
            "body": "Then why the fk american (+israel)start war in middle east and not none of u or the media call it a terrorists organisation ????\nwhy the fk keep boobming them and when they fight back call them terrorists ???????",
            "score": 1,
            "replies": []
        },
        {
            "author": "alexandercuna",
            "body": "Based comment on London, and the whole of UK.\nNo matter who says it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyuusankininryou",
            "body": "He's not wrong but Europe got a lot of refugees cause wars started by America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GameJon",
            "body": "I’m a 40 year old white Londoner and I’ve seen shit change obviously but it’s blown way out of proportion by the media, by Trump, and by a load of people in this thread.  Used to be knife crime, black youths, Asian youths, acid attacks - all of it just played up for fear.  Now it’s all about Muslims and shakira law (her hips don’t lie)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SquishyShibe11",
            "body": "He's right and anyone who is paying attention has seen this happening. The UK in particular is just totally colonized now. Invaded and conquered without firing a single shot. And then you've got douchebags like Keir Starmer who welcome the wolves in regardless of whether or not they're wearing sheepskins. He thinks he's on the right side of history. \n\nBy the time western countries start forcefully banning Pride, it'll be too late for them to realize what they let in. It'll be both funny and sad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frausing0403",
            "body": "It is and it has, where the fuck have you been these last 15 years…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Just_Nobody9688",
            "body": "It's true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BumbleBiiTuna",
            "body": "\"Claimed\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "S0Up_S0UP",
            "body": "I mean he's right the issue with Islam is that in that religion they rule by the sword rather than peace and that is when suicide bombings and those sorts of things happen. I mean seriously guys take it for what it is it's a wakeup call open your eyes and look for the truth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "plasix",
            "body": "The weird thing about Britain is they keep trying to elect an anti-immigration party but there are none.  So then they made a new party called Reform and then right as it was about to win the next election it morphed into a pro-immigration party.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kikura432",
            "body": "Jihad in arabic means struggling, or effort in literal sense. Jihad in Islam means, a struggle to fight against the enemies of Islam.\n\nYou can do whatever it means above (taken from Google ofc), but all in all, Muslims or not, killing is not allowed. The act is just an opposite of what the Qur'an had said in the time of peace. Killing one means you killed all of humanity.\n\nYou can always smack them by talking if you think what they did is wrong. Don't be afraid. People have the right to correct them. It's all about personal development as a person, not their identity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bahamut5525",
            "body": "Is he gonna talk about how America is only 50% White though?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrashNan1",
            "body": "Opened their doors? The US Gov destablized the middle east so many times,which is and was the cause for the majority of \"refugees\" streaming into europe.\n\nJust like they did with south america....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Firethorned_drake93",
            "body": "Stockholm and Malmö as well in Sweden.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Defynitive",
            "body": "Islamic ideology will always be more terrifying than empty threats",
            "score": 1,
            "replies": []
        },
        {
            "author": "t-costello",
            "body": "Was there 2 weeks ago, seemed pretty recognisable to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual-Anxiety531",
            "body": "Yes let's be more racist because world have refugee problem. 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Profanity821",
            "body": "People complain about immigration in the US but the US gets the good immigrants. Europe... Not so much.\n\nAnd no that's not an excuse for illegal immigrants. That's a different argument entirely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kalkuehl",
            "body": "It already happened. Instead of islam, usas biggest problem is homelessness and gangs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeniMain",
            "body": "dont give a shit what London is like, leave that to the Londoners. Focus on America",
            "score": 0,
            "replies": []
        },
        {
            "author": "CookieAppropriate128",
            "body": "Thank you Trump,\nNow please condemn Lukashenko and Putin who flooded Europe with these type of people as a weapon.",
            "score": -1,
            "replies": [
                {
                    "author": "Searril",
                    "body": "We're blaming Putin for the UK's border policies?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Sudden_Bat6263",
                            "body": "Yeah wasn't putin that did this. This was all self inflicted.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "casual-afterthouhgt",
                            "body": "The commenter mentioned Europe and yes, the Union aside, England is in Europe.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Beginning_Stay_9263",
                    "body": "NGOs run by Jews are the ones pushing for this.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "pickle99",
            "body": "He's out of line but he's right",
            "score": -5,
            "replies": [
                {
                    "author": "SpookySpaceCowBoy",
                    "body": "How is it out of line?",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Yuketsu",
                            "body": "If it hurts someone's feelings it's out of line",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MiddleAgeCool",
            "body": "I was in London at the weekend.  I don't live there and rarely go.   In total I saw less than 10 women wearing hijabs in the busiest parts of the city.   Yes it has crime, yes it has problems but to try and paint it as an Islamic city when it's no different to any of the US cities I've been to is just scaremongering.",
            "score": -9,
            "replies": [
                {
                    "author": "RealityIsRipping",
                    "body": "US cities are nothing like European cities… well they use to not be.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "National_Salt4766",
            "body": "weirdest shit I've seen, I open this post, and the first 30 comments, deleted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaxsso",
            "body": "Which begs the question, why be allied with countries committing suicide? Can't save what doesn't want to be saved, they will just pull you with them to their death.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SykoManiax",
            "body": "haha yes.\n\n30% white\n\n30% white (other)\n\nthe rest is mostly black, indian and chinese\n\n13% muslim\n\nsO ScArY YoU gUyS ItS lOnDiNiSTaN!!!\n\nfucking morons",
            "score": 1,
            "replies": [
                {
                    "author": "Nezothowa",
                    "body": "In the US. This is not the same story for Europe, my friend. Not the same rules at all. \n\nAs Zelenskyy said. You have nice oceans. This is pretty effective against the Middle East. What do we have.. Gibraltar. A 20 km gap between Africa and Europe. \n\nCome to Europe and see for yourself how trashed it has become.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SykoManiax",
                            "body": "im specifically talking about london, where i live, for 20 years\n\n  \npeople talking about londinistan have no idea what theyre talking about\n\n  \nof all the european large cities, london has the LEAST muslim",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Youreallm0r0ns420",
            "body": "Damn, this sub is a shithole. ",
            "score": -1,
            "replies": []
        },
        {
            "author": "ProfessionalSport565",
            "body": "Racist propaganda straight from the KGB",
            "score": -5,
            "replies": [
                {
                    "author": "inactivemember99",
                    "body": "You're on the asmongold subreddit. You're going to be downvoted into oblivion by edgey teenagers",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ProfessionalSport565",
                            "body": "I don’t mind. I was literally in a pub in London as i wrote it and everything is 100% normal here. Trump is paid by his backers to boost messages like this because it somehow benefits them. It’s just a paid PR statement.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "inactivemember99",
                                    "body": "I agree fully. I even commented on this sub it reminds me of paul joseph watson style propaganda.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Nezothowa",
                                    "body": "I live in Europe for 30 years now. It has changed by a very large margin in only 20 years time. \n\nFrance has an insane criminality problem (I’m Belgian). \n\nAs they say “a force de faire rentrer la merde. Ça finit par sentir la merde”\n\n(By allowing shit to enter. It ends by smelling like shit) or something like that.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Randa08",
            "body": "The amount of absolute bollocks that comes out of this man's mouth is unbelievable. And Americans just seem to love gobbling rich man bollocks.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Adel7Max",
            "body": "by Allah Islam will prevail and more when you demonize it like this, and guess what even if all the world band together to make it fail it won't because it's the will of Allah, cry about.",
            "score": 0,
            "replies": [
                {
                    "author": "gBiT1999",
                    "body": "no comprendi",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Adel7Max",
                            "body": "لا يهمني أمرك إفهم لا تفهم أو إعمل نفسك نائم لقد قلت ما قلت نقطة نهاية.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Adel7Max",
                            "body": "je mon fou pas de toi mon pote.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nezothowa",
                    "body": "Go prevail in your country. Leave the civilized western nations alone. Thanks.\n\nGo help Gaza against Israel. That I support you for. Free them.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Adel7Max",
                            "body": "first civilization was invented in the middle east when you where humping wild pigs, pretending to be civilized while killing millions of people ain't civilization, I support how I can it's no of you damn business and you say that while you tax money is being used to kill children right now what a fucking cuck.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Siamak71",
            "body": "He should come and see the poverty in Appalachia regions. No immigrants at all almost, but full poverty. I would rather be in London's worst that this part of America. It's as poor as some regions of Africa.",
            "score": -3,
            "replies": [
                {
                    "author": "mendenlol",
                    "body": "wut\n\nAppalachia has immigrants. The culture here was also built by immigrants (Scots Irish)\n\nOur region is poor for similar reasons as African ones, though. Outsiders coming in to extract the resources while exploiting and false-promising the locals and then, when the resources dry up, leave the locals high and dry.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NodeTMan53",
            "body": "Kinda feel sorry for the real asians that get mixed in with them, like wtf did chinese, korean, Japanese, Malaysian and Thai do?",
            "score": 0,
            "replies": [
                {
                    "author": "Adel7Max",
                    "body": "like south Asia ain't in Asia, the US public school sucks.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NodeTMan53",
                            "body": "Call them middle eastern, don't drag the other asians down",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Adel7Max",
                                    "body": "the thing is that's not even in the middle east go back and study geography, and even the middle east is in Asia., did you fail primary school or something, oh shit I forgot this is the average American who think Wakanda is country.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NodeTMan53",
                                            "body": "You have no idea where middle east is lol \npathetic, butt hurt asians don't wanna be associated with middle east trash",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Adel7Max",
                                                    "body": "the Chinese looking Asian are called the Han race they aren't the only Asian in Asia, there Arab, Persian, Indo-Persian and the Ainu the non-Han Japanese native...ect, the Han race don't own the word Asian.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "National_Salt4766",
            "body": "weirdest shit I've seen, I open this post, and the first 30 comments, deleted.",
            "score": 0,
            "replies": []
        },
        {
            "author": "inactivemember99",
            "body": "This is some paul joseph watson esk propaganda, lol. At least you guys dont block dissenting comments like r/conservative",
            "score": 0,
            "replies": []
        },
        {
            "author": "Griffith-007",
            "body": "This is beyond sad, imagine thousands of years of a group of ethnic races slowly being wipe out of existence. (Keep in mind im chinese). That is like if all the native American were all dead after being colonized.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Glidepath22",
            "body": "He needs to focus on America",
            "score": 0,
            "replies": []
        },
        {
            "author": "Purple-Group3556",
            "body": "Let's see. Great Replacement Theory and racial stereotyping. Another day in Asmons subreddit!",
            "score": 0,
            "replies": []
        },
        {
            "author": "DogbrainedGoat",
            "body": "Absolute bollocks from a demented idiot.",
            "score": -14,
            "replies": [
                {
                    "author": "itsawfulhere",
                    "body": "Muhammad is literally the most popular name in london now",
                    "score": 4,
                    "replies": [
                        {
                            "author": "DogbrainedGoat",
                            "body": "Firstly, so what? What does that have to do with London being 'unrecognisable'?\n\nSecondly do you have any idea why Muhammad is the most popular boys name?",
                            "score": -8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "spondgbob",
            "body": "People here probably would freak out to know there is a Chinatown in every major city in the US! Which means that all white culture is void and gone and replaced… right? Lmao",
            "score": -1,
            "replies": []
        },
        {
            "author": "YMK1234",
            "body": "The sad thing is this fucking nitwit is the president of the US.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Regular_Worry1739",
            "body": "Been to London 4 times in last 15 years, not changed noticeably. Glad the sub filled with people who haven't left their house in months is eating this up tho",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ok_Command7782",
            "body": "it need to be made clear to asmon and his audience the whole reason there is a muslim migrant crisis is because of americas relentless bombing of these countries under the guies of freedom and spreading demoicracy. europe had no choice, were they supposed to kill thousands of refugees?",
            "score": -1,
            "replies": []
        },
        {
            "author": "_bessica_",
            "body": "It just seems like white people that are scared of becoming a minority, which they are not even close to, because they know how they've treated minorities and think that's how they'll be treated. Y'all are telling on yourselves.",
            "score": -1,
            "replies": []
        },
        {
            "author": "CrashaBasha",
            "body": "Screw western culture, let it die for the crimes of genocide and colonialism it has committed on the rest of the world. \n\nPiss on the flag and shit on the cross.",
            "score": -2,
            "replies": []
        },
        {
            "author": "ifhysm",
            "body": "This sub is a literal goldmine if anyone wants to laugh at ignorance and hate",
            "score": -2,
            "replies": [
                {
                    "author": "Daedelous2k",
                    "body": "The ammount of GCJ point and laugh threads has gone down now, but yeah there is plenty of that content going on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "phatbody",
            "body": "I see London, I see France. Donnie Dollhands shits his pants.",
            "score": -4,
            "replies": []
        }
    ]
}