{
    "title": "This prediction is slowly coming true.",
    "author": "Emeron87",
    "subreddit": "Asmongold",
    "rank": 4,
    "score": 705,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 55,
    "url": "https://v.redd.it/y2y8kjwd7hpe1",
    "id": "1je99ow",
    "selftext": "",
    "comments": [
        {
            "author": "Trugdigity",
            "body": "Why does he need a translator in the first place?",
            "score": 78,
            "replies": [
                {
                    "author": "Bazmati1234",
                    "body": "Speaks better English than 99.9% the UK... close your eyes you think he was the Queens teacher!",
                    "score": 92,
                    "replies": []
                },
                {
                    "author": "FindingMememo",
                    "body": "Probably had a mixed audience to where using Arabic made sense. \n\nI love that he was able to “turn on” his impeccable English as a flex to emphasize his point.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "Ainz-Ooal-Gown",
                    "body": "Because they assumed he didn't know english or wanted him to be more comfortable in using his native language",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "JustBennyLenny",
            "body": "He is 100% correct, the Dutch got completely run over by this and now we are stuck with these brain dead \"politicians\" and we got an epidemic of liars and scammers that eroded our beautiful country into a depleted and depressed fucked up place and whats the most messed up part about this is? the ex-PM that did all this, now got himself a prime position as NATO top, NATO is no longer to be trusted, its compromised by liars and scammers, Mark Rutten is such a scammer, look him up, you'll see for yourself. ( [https://x.com/i/grok/share/FTjaNwEb7b4QVLvSLrMNMYYMN](https://x.com/i/grok/share/FTjaNwEb7b4QVLvSLrMNMYYMN) )",
            "score": 100,
            "replies": [
                {
                    "author": "Critical999Thought",
                    "body": "hi their neighbour! Belgium is even far more going down the sink then you can imagine! sharia no go zones, muslim grooming gangs, radicals who are free as a bird to poison anyone they feel like, making extremists on an assembly line...\n\nwich all of these things are totally not happening! don't speak of it, or you are a racist! everything is just fine here,",
                    "score": 29,
                    "replies": [
                        {
                            "author": "JustBennyLenny",
                            "body": "I suppose we both got the short-end of the stick, huh? I can understand you, really upsets me.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Titan_Tim_1",
                                    "body": "German Neighbour here.... it's the same shit. And politicians still pretending not to see the trends. I'm proud that we are taking accountability for the horrors of WW2, but politicians are so scared now to be even remotely critical of anything foreign for fear of being insta-labeled as a Nazi that we are allowing ourselves to be eaten alive.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CptKarma",
                            "body": "The old fucks who ruined your country wont ever have to deal with the consequences. Either gated communities/death of old age/etc.\n\nMeanwhile the majority of the public will pay.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "JustBennyLenny",
                                    "body": "Yep, I don't like to say it too often but I truly hate this guy with all my heart, he destroyed a lot people and their lifes. Families got broken up, without ever validating or checking the data, they just assumed and wend on with it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CptKarma",
                    "body": "All these OLD people in power in the european countries will be dead and avoided all the consequences from their actions whilst never have had it affect them personally. \n\n  \nLiterally.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "JustBennyLenny",
                            "body": "Yeah, seems that way sadly.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MemeDudeYes",
                    "body": "How is it under Geert Wilders?\n\nDid some improvements happen or declines?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Flosero",
                            "body": "Latest poll said 72% are not happy with him",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "MemeDudeYes",
                                    "body": "Damn",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "TheyAlwaysBannMe",
                                    "body": "ofc he is fake nationalist.\n\nhere is a easy way to find out if a \"rightwing\" politician is a true nationalist and patriot:\n\nif that person supports israel then he is corrupt and you can throw him into the trash.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "JustBennyLenny",
                            "body": "Same shit, different color. Dude has been barking all over, but nothing net return. Their all useless.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ServeNarrow7187",
                                    "body": "I thought geert wilders was the \"based\" anti-islam \"hero\" that will ban islam and Muslims in the Netherlands, guess he think moderates Muslims are ok now",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "JustBennyLenny",
                                            "body": "He's only barking so far, nothing done, just nice hollow words, the same yadadada-songs of a politician.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MemeDudeYes",
                    "body": "How is it under Geert Wilders?\n\nDid some improvements happen or declines?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "muscarinenya",
            "body": "It's Carebear ideology\n\nWe're all different colors of a rainbow and if we're all kind to one another we will live in harmony for eternity\n\nAnd it would be cute if it weren't also suicidal\n\nI've lived in very mixed environments, i mean, it's amazing to walk a few minutes and enter Chinatown, and a few more minutes away you get in the Arab quarter, etc\n\nBut this isn't what this is about, these places work because *people and cultures don't mix*\n\nIt's fine if it's a few streets, but you can't have that on a national scale\n\nGlobalization was forced on people for the last 40-50 years, now after decades of abuse the pendulum is swinging back with anger, frustration, and a growing sentiment of isolationism",
            "score": 26,
            "replies": []
        },
        {
            "author": "Critical999Thought",
            "body": "when even muslims saying the shit people have warned us here 20years ago, you know Europe is in such deep unimaginable shit, and we can't even say anything about it or the police comes knocking on your door.",
            "score": 18,
            "replies": [
                {
                    "author": "ServeNarrow7187",
                    "body": "Muslims countries have been fighting extremists for decades, europe havent",
                    "score": 8,
                    "replies": [
                        {
                            "author": "clararalee",
                            "body": "Try centuries",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GeologistOutrageous6",
            "body": "If that was a UK citizen saying that today on Facebook live, they’d be arrested",
            "score": 13,
            "replies": []
        },
        {
            "author": "Odinvarr",
            "body": "Smart guy. \n\nLeftists just want to live out their hero fantasy. They're so desperate for attention and recognition for their \"activism\" that it doesn't even matter what the cause is. Hamas, gang members, transexuals, whatever the flavor of the month is - they'll be there instigating violence and unrest.",
            "score": 53,
            "replies": []
        },
        {
            "author": "PaxMuricana",
            "body": "Europe is cooked",
            "score": 51,
            "replies": [
                {
                    "author": "NightLanderYoutube",
                    "body": "Well, not all countries in EU.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Emeron87",
                    "body": "Cooked?! Dude it's served on a silver platter to these radicals at this point.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "413NeverForget",
            "body": "The (Western) EU is so cooked bro. Even Spain... like, dude, y'all spent like 700 years trying to get them out, only to now welcome them with open arms.",
            "score": 14,
            "replies": []
        },
        {
            "author": "ForgottenDreamDeath",
            "body": "Why is everything deleted?\n\nHe's literally saying the environment you create will bring about people behaving in a certain way. How on earth is that controversial?",
            "score": 9,
            "replies": [
                {
                    "author": "DorianGray556",
                    "body": "There are a LOT of people who develop a utopian fantasy existance, and when the very real world dares to intrude and destroy their fantasy they screech \"This is not how it is supposed to be!!!\"\n\nThe fact that reality is under no obligation to conform to their fantasies (sometimes even delusions) is largely irrelevant. They believe THEY should be the ultimate arbiter of reality.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ForgottenDreamDeath",
                            "body": "to be fair, I've seen this with most people. Everyone thinks they know a better way. It' not just a religious \"join our religion\" tthing. It's a political thing. It's an activist thing.\n\nWhat this video is showing is a man who lives in a theocracy saying that the culture of Europe is what is breeding terrorism and it is unfortunately too short to go into why and that is just as important bc we are just left with an assumption it criticizes liberalism, not the answer why and how",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "xalaux",
            "body": "Not a very difficult prediction to make, many of us have been saying this for over a decade.",
            "score": 15,
            "replies": []
        },
        {
            "author": "justdengit",
            "body": "When \"Letting him cook\" comes true.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Radiant_Lie_6312",
            "body": "European are so naive",
            "score": 6,
            "replies": []
        },
        {
            "author": "Aterdeus",
            "body": "This all ties back to the hippie movement. \n\nFor example, the hippies thought motorcycle gang members were some kind of noble savages that were living outside the status quo and viewed them as kindred spirits. Then they hired them as security and they killed people and started a riot. \n\nSo the hippies grew up, took over the education system, and spit out a generation or two of even more detached people who do not understand how much of the world is not the west and still lives by the law of the jungle. \n\nThis guy has dealt with irrational people that want to hurt you his entire life. The average western person is scared to politely disagree with someone.",
            "score": 5,
            "replies": []
        },
        {
            "author": "kahmos",
            "body": "There are religious extremists in every religion. The problem is westerners don't understand the Islam religion and who those extremists are.\n\nThey're learning so slowly by the time they can stop it it'll be too late.\n\nI'm glad to be in the USA.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Winstons33",
            "body": "But....it's the religion of peace?\n\nYep, the bending over backwards to make excuses for Islam following 9/11 disgusts me.  The strangest part, it's always progressives doing it.  They'll on one hand fabricate all sorts of conspiracy theories to try and sabotage Christians, the State of Israel, etc.  Yet Muslims are almost always the victims of hate crime in the Western World.\n\nDefinitely the strangest bed-fellows of the left.",
            "score": 12,
            "replies": [
                {
                    "author": "ServeNarrow7187",
                    "body": "Do you think the left started the christchurch mosque shooting?",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "toyotatechenjoyer",
            "body": "They have too much empathy, like giving away all you're food to people in need to the point you starve yourself to death.",
            "score": 2,
            "replies": []
        },
        {
            "author": "heartfullofpains",
            "body": "Islam is the worst thing that can happen to your country. you guys keep assuming Islam is like Christianity, mostly harmless or sth. no lol, Islam is a deadly cult disguised as religion. when outnumbered they have teachings that tells them to pretend to be peaceful (this is real, i'm ex muslim). Muslims procreate like crazy, if 5% of ur population is Muslim it means its gonna be 20% in 100 years.\n\nall ex-muslims warned you but you banned us as islamphobe.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ServeNarrow7187",
            "body": "UAE is one of the rare Muslims country to be based",
            "score": 6,
            "replies": [
                {
                    "author": "Mental-Crow-5929",
                    "body": "I mean.... they literally gave economic support to Al Qaeda and Isis....",
                    "score": -5,
                    "replies": [
                        {
                            "author": "ServeNarrow7187",
                            "body": "Wasn't it debunked tho? The UAE have arrested extremist and fought back ISIS and so on",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "perdition84",
            "body": "Neoliberal economic policies destroyed the working class and imperial actions destroyed countries around the world. Here in Norway we had a huge wave of refugees and migrants after Libya was bombed and the same happened after Syria was destroyed. Few of these refugees went to the country responsible for the bombings and economic warfare, and now the US is playing victim once again. This dude thinks the culture war happened before the imperialism and economic warfare, the culture war is a consequence of the imperial/economic warfare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "perthro_ed",
            "body": "Who is this guy? He is a great orator",
            "score": 1,
            "replies": []
        },
        {
            "author": "QueenGorda",
            "body": "Oh no, as an European I can tell you that is not \"going to\", its already happening.\n\nCheck Sueden, France, Belgium, now Germany and I also would say even Spain on its way to be a France in a negative way, with no-go zones and other stuff.\n\nAlso UK situation.. pff",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wordox",
            "body": "Not slowly. It's in turbo mode in Europe...",
            "score": 1,
            "replies": []
        },
        {
            "author": "DanTheFatMan",
            "body": "This was already an issue before he said this years ago, also this guy is form the middle east I don't think anyone want their kind of repressive policies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhostInThePudding",
            "body": "The fact of the matter is, there are plenty of Islamic countries that aren't a threat to peace.\n\nIn the West our governments intentionally import Islamic terrorists from the worst places, in order to create discord in their own countries and thus justify stricter, more oppressive laws against free speech, and other freedoms.\n\nThe current aim is to start WW3 with Russia, and thus be able to bring about conscription and send large numbers of young men to die. That will leave mostly women and foreign terrorists in the country. Thus there will be no one to oppose the absolute authority of the government.\n\nIf they fail to start WW3 with Russia, they will continue to work on building hatred toward Islam, in the hopes of starting a West vs Islamic countries world war instead, where again they can do conscription to get most of the young men killed.\n\nThe smart thing is, the people are not hating their government enough, they are hating the terrorists the government is bringing in, but they are blaming the terrorists and not the government for importing them. Thus when a future government suggests a war on terror, people will go for it, when reality what they should be doing is turning against their own governments.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fuz__Fuz",
            "body": "Do we consider \"Israel\" as west?",
            "score": 0,
            "replies": []
        },
        {
            "author": "No_Name275",
            "body": "Fanaticism is never tolerated in Islam I don't know what the entire purpose of those protests is or why those fools demand privilege in other people countries but those are never a good way to send a message",
            "score": -1,
            "replies": []
        },
        {
            "author": "YariaYariDazii",
            "body": "The best thing to happen \nwill be more muslims ❤️❤️❤️🔥🔥",
            "score": -6,
            "replies": []
        },
        {
            "author": "Mental-Crow-5929",
            "body": "This sub went from \"Hasan is bad for supporting terrorist\" to \"this guy who actually gave economic support to multiple terrorist organization is kinda based\" really quickly.",
            "score": -8,
            "replies": []
        }
    ]
}