{
    "title": "Reality MEME",
    "author": "Intelligent-Walk7229",
    "subreddit": "Asmongold",
    "rank": 3,
    "score": 467,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 192,
    "url": "https://i.redd.it/mojtwow2whpe1.jpeg",
    "id": "1jecp0a",
    "selftext": "Europe will collapse from within, its just a matter of time",
    "comments": [
        {
            "author": "riel_pro",
            "body": "Just send the womans equal rights equal fights",
            "score": 172,
            "replies": [
                {
                    "author": "unluckydude1",
                    "body": "Just send 99% of Reddit's users, they seem determined to keep the war going, no matter the cost.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "Koontmeister",
                            "body": "I'm not.  I have a much milder view.  I think NATO should just bomb Russia into the Stone Age for a little bit. Just some light total destruction.",
                            "score": -48,
                            "replies": [
                                {
                                    "author": "unluckydude1",
                                    "body": "I dont know if you act dumb are dumb or think you are funny troll hurr durr. Because thats equal a nuclear war... And you are ready to pay that price?",
                                    "score": 47,
                                    "replies": [
                                        {
                                            "author": "Koontmeister",
                                            "body": "What part of stone age don't you understand?",
                                            "score": -31,
                                            "replies": [
                                                {
                                                    "author": "Slight-Loan453",
                                                    "body": "Maybe the stone age is where you're from because you should recognize that a nuclear attack on Russia would be met with equal retaliation. The USA cannot intercept all of their missiles, so worst case the entire US population dies from initial blasts and fallout and best case is that we suffer \\~20% population loss immediately and then most people die slow deaths much later from cancer via radiation.  \nTell me, what do you think would happen after the US sends the first nuke? genuinely curious",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Koontmeister",
                                                            "body": "What the hell are you talking about?  I said some LIGHT total destruction.  Nuking Russia would be over too fast and be boring.  It's why nobody ever does it.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Altruistic-Rice5514",
                                                    "body": "Without the US NATO doesn't have enough munitions to do that though.  That's the problem.\n\nThe US doesn't want to go to war with Russia and have to escalate into a Nuclear Exchange.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Koontmeister",
                                                            "body": "Agreed.  US could just solo them with conventional weapons instead.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Altruistic-Rice5514",
                                                                    "body": "Ok so you're an idiot then.  Good to know.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DeicideandDivide",
                                                    "body": "Jesus Christ, and people like you get to vote. Fucking hell",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Koontmeister",
                                                            "body": "I love democracy.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "_Learnedhand_",
                                                    "body": "This guy just self-certified hurr durr",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Koontmeister",
                                                            "body": "Lol right?   Why is it my responsibility to explain everything to him?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "_Learnedhand_",
                                                                    "body": "Bro, you ARE the hurr durr",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Koontmeister",
                                                                            "body": "I have not yet begun to peak.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "So you are as retarded as the rest ... what do you think would happen ?",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "neo101b",
                                            "body": "They get to live out their Fallout 3 Fantasy.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "Ahahahahahahaha actual good comment !",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Melodic-Yesterday990",
                                                    "body": "Honestly, I wouldn't mind that since if no one is alive then I am not broke.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Azothy",
                                            "body": "How do you manage to find the time to make these funny posts in between stroking russian cocks?\n\nEdit:check this guy's post history. Real independent thinker.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "You don't know me brotha, so dont try to understand how i think by my post history in reddit ... and if you do it just shows more of who you are and how u do things.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Azothy",
                                                            "body": "No need to get embarrassed now. Wear that Z armband with pride.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Intelligent-Walk7229",
                                                                    "body": "Ok redditor",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Azothy",
                                                                            "body": "Are you sure you want to call people redditor? You post shitty fox news memes DAILY on here. It's beyond parody.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Intelligent-Walk7229",
                                                                                    "body": "and its working, would u imagine that",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Koontmeister",
                                            "body": "Amazing memes for sure.",
                                            "score": -7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Marcson_john",
                                    "body": "Give me the address of your house to tell them where to strike back",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Koontmeister",
                                            "body": "I moved back in with your mom.  Should be easy to find.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "EmptyDifficulty4640",
                                    "body": "Based",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Aritzuu",
                    "body": "Then you will how quickly they revert to housewifes propatriarchy.\n\nHad this friend that served in the army and he said that it was so funny how a lot of the women soldiers would get pregnant near their deployment date to afghanistan.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Rentalis",
                    "body": "That's would be nice.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dull_Woodpecker6766",
            "body": "Yeah ... It's 2025 I can see all genders equally in these drafts.  No need to again just \"send\" men....\n\nEquality was demanded. Now it's finally time to give it fully.",
            "score": 26,
            "replies": [
                {
                    "author": "diprivanity",
                    "body": "Russian soldiers incredibly perplexed and sad that the EU non binary battalion pows came pre-castrated",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VanillaStreetlamp",
            "body": "Just get a judge to issue a worldwide injunction declaring peace on both sides.",
            "score": 42,
            "replies": [
                {
                    "author": "No-Engine-5406",
                    "body": "Lol. Let us see him enforce it.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "J4ckedPepe",
            "body": "Yea right, increase army salaries and make them higher than civilian salaries and you'll have recruits fighting in line, all you need is increased unemployment and high army salaries, that's it, people do dumb shit if they're paid high enough to do it",
            "score": 57,
            "replies": [
                {
                    "author": "TheManyVoicesYT",
                    "body": "Mercenary companies know this one simple trick...",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Bluemikami",
                            "body": "Mercenary hawks **HATE HIM**. Look his this anon dismantled the mercenary industry with this one weird trick.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CalmDownn",
                    "body": "We’d love to pay our troops a livable wage, but how could we possibly afford that when we have essential expenses like a; [$4,361 metal pin (a real bargain, honestly)](https://www.nysscpa.org/news/publications/the-trusted-professional/article/audit-finds-military-contractor-made-9-400-percent-profit-on-single-metal-pin-051519) and a [$10,000 oil pressure switch that NASA somehow got for $328?](https://truthout.org/articles/former-top-pentagon-official-reveals-brazen-defense-contractor-price-gouging/) I mean, priorities! If we start questioning why a [small bag of metal costs $90,000](https://www.youtube.com/watch?v=0CvKcIvovIQ), next thing you know, people will start asking why we’re overpaying [contractors by thousands of percent. ](https://en.wikipedia.org/wiki/TransDigm_Group)And we definitely can’t have that.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "J4ckedPepe",
                            "body": "This is US, because too much money is being pumped into defense and they need to spend all the money cause next year they want more moneyz, in Europe we don't invest shit into defense (apart Poland) because \"the US is here to protect us\". If the EU really wants active troops they can easily get them with very little investment, like 10k signing bonus & 5k eur/month salary and recruitment centers are gonna be full. They have the money to do that, just lower the ESG budget by like 15% and you can defend Europa against Russia lmao",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "jwilson3135",
                            "body": "That’s how we hide monies for martians and Bigfoot. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "diprivanity",
                            "body": "The dad in Independence Day cleared this up for y'all like 30 years ago and I guess it hasn't stuck",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Engine-5406",
                    "body": "Russia did the same and had promising results. As to how many combat troops live long enough to enjoy those salaries, who knows? I imagine their exchange ratio is a lot better than it was early in the war.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lucy_Heartfilia_OO",
                            "body": "That's why I would only accept a bitcoin payment up front",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "But the problem is they will not do that... EU's economy is a joke",
                    "score": -2,
                    "replies": [
                        {
                            "author": "RogerRavvit88",
                            "body": "They can just tax their citizens and subsidize higher salaries with higher taxes. Economists hate them for this one simple trick.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "Ahahaha y thats been happening in EU for a while it's true",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sobakoryba",
            "body": "Russian bot keeps posting Ukrainian propaganda anywhere hd can. Ванька, идо поешь блинов с лопаты, выпей огуречный лосьон и не забывай посасывать xyй путина",
            "score": 7,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "How are you on reddit and not fighting for your country ? While you here typing they are losing ground",
                    "score": -6,
                    "replies": [
                        {
                            "author": "sobakoryba",
                            "body": "/stopbot unlike you, poor silly Russian 🤡, my country is United States",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": " You mean u fled your country because you are a coward ? gotcha",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sobakoryba",
                                            "body": "🫵🇷🇺🏳️‍🌈-ар",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "you also gay ? damn",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Nezothowa",
                                                            "body": "No. He doesn’t like RuskiBots\n\nVanya, go eat pancakes from a shovel, drink cucumber lotion and don't forget to suck Putin's dick",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Intelligent-Walk7229",
                                                                    "body": "ahahahah",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quaronn",
            "body": "Unrelated to the post, but I just looked at OP's profile and my god, he is chronically online and addicted to reddit. I've been scrolling for like a minute and never even left the last couple of days of his comments\n\nBrother you seriously need some help",
            "score": 36,
            "replies": [
                {
                    "author": "Rizboel",
                    "body": "That's fr, 88 comments in not even  a day is a bit much.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Formal_bro",
                    "body": "Indeed, it's pretty sad.\nRussian propagandist working overtime",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Seskekmet",
                    "body": "Lol he is paid to post pro russian stuff,  he dont need help he just has a family to feed. And if he don't do it he might fall from some windows, so let him be.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "ahahahahah projection is wild",
                    "score": -16,
                    "replies": [
                        {
                            "author": "shoePatty",
                            "body": "That Redditor has like 4 comments in a week how the fk is that projection?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "eSsEnCe_Of_EcLiPsE",
                            "body": "That’s not projection by any definition lol",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "wtf_are_crepes",
                                    "body": "He was just trying to get you off his trail by saying “no you!” Come on give him some slack, English isn’t his first language lol",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Skink_Oracle",
                            "body": "\"I've already depicted you as the soyjack, and me as the Chad\" level of retort",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LegacyWright3",
            "body": "Western Europe? Sadly, accurate.  \nPoland? **Kurwa mać, pieprzony kawałek gówna, Rosjanie, czekaliśmy całe wieki, żeby wam rozwalić nowy tyłek! O ja pierdole!**  \nEuropean Texas doesn't need motivation to go in on Russia, they only need to be let off the leash.",
            "score": 27,
            "replies": [
                {
                    "author": "Marcson_john",
                    "body": "That absolute bullshit. Last poll in Poland showed 86% of pole refused straight up to be sent or have the military in Ukraine. Stop pretending freaking keyboard warrior\n\n\nhttps://www.pravda.com.ua/eng/news/2025/03/9/7502003/",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DaRaginga",
                    "body": "Yeah. You guys, the Fins and the French are the only people keeping us safe nowadays. Thank you from Germany",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Long_Chemistry8580",
                            "body": "You morons in germany cucked yourself year after year",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Drezzon",
                                    "body": "Germany's still somehow less of a shithole than the UK or France",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Bluemikami",
                                            "body": "Despite Germany's best efforts to be *the* shithole, UK, France and Sweden (Yes!) out-shithole them.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Drezzon",
                                                    "body": "Ah yeah I forgot about Sweden, they fucked themselves even more than the UK and France, it's honestly kinda impressive",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DaRaginga",
                                    "body": "Yeah. It's really bad and getting worse.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "super_tank_why_not",
                            "body": "And Ukraine who for now is taking all the hits",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DaRaginga",
                                    "body": "Ukraine is not EU, that's why I didn't mention them, but yeah, them too",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "LegacyWright3",
                                    "body": "Sadly, true... It's disgusting how lukewarm our reaction has been to an invasion of Europe",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "super_tank_why_not",
                                            "body": "Yeah but people still make excuses like \" ooooh but our moni.... it should go to us.....\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DaRaginga",
                            "body": "Why is this getting downvoted? I'm confused. I'm happy that the EU has some members who kept their armed forces",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "If you think Poland has any chances against Russia you are highly mistaken my friend ! But i will give you that Poland is the most sane EU country sure ...",
                    "score": -5,
                    "replies": [
                        {
                            "author": "LegacyWright3",
                            "body": "Not unless we blast \"Winged Hussars\" from Sabaton, instant +200% breakthrough  \nJokes aside, the Polish army is large and well equipped enough to have a fighting chance **if** it has air support from other European countries, but only because the Russian army has been utterly battered. Obviously, turn the clock back to 2022, not even close.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "Ye exactly so my point was, you have a really good military but you are dependent of certain things from other countries...",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "UnusualPete",
            "body": "![gif](giphy|tWwXz4EUZ6i9Opk0n3)\n\nThat's the first dude in the picture ![gif](emote|free_emotes_pack|joy)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Shot-Maximum-",
            "body": "BTW, this is a Vatnik bot account who exclusively posts ant Ukraine memes here",
            "score": 1,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "ahahahaha",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Windatar",
            "body": "Migrants are about to find out the hard way that sometimes its not a good idea to go to countries on the cusp of wars.\n\n\"You can't send us back to our country! Don't be racist!\"\n\n\"War? Wait, no no no I will go back. This isn't my country! NO! NOOOOOOO!\"",
            "score": 4,
            "replies": [
                {
                    "author": "GeologistOutrageous6",
                    "body": "EU leaders will just give them a religious pardon and send native Europeans to the front lines",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Intelligent-Walk7229",
                            "body": "Unf thats what probably would happen",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vegetable-Traffic536",
            "body": "Bullshit Russky bot meme, as if the EU countries don't have a military at all... just worthless rage bait.",
            "score": 8,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "Its not that ... its that Eu population doesnt wanna fight specially for a country that is not theirs !",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Vegetable-Traffic536",
                            "body": "You know damn well, that any official participation by an EU country could be used as propaganda for the Kremlin and potentially lead to a nuclear war. We will fight, if we have to defend ourselves and our allies. And we will support Ukraine (who sadly are not a part of Nato yet) fighting for it's liberty and right to choose their own destiny for as long as they have the will to, because that's the right thing to do as a democracy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "Its easy to talk in reddit... [https://azov-international.com/#join](https://azov-international.com/#join) Go do your part brotha ! Uncle Sam is waiting for you \n\nBut on the real note since i know you would never go to Ukraine to help, Europe will not do anything because they dont have a say in it, neither does Ukraine .. And i will explain to you why.\n\nThe BIG Boys are speaking now after 4 years of non communication with the nuclear power that we are on a conflict with via proxy.. So now the GROWN will speak who will get what and what part of Ukraine will stay independent ! \n\n  \nIf Europe does something stupid ? US will stop all support for Ukraine.. The last 3 years of the War Russia was able manufactuered NATO 4/1 .. What do you think will happen when US stops the sending of ammunition/shells/anti air missiles etc etc etc ?\n\nIt's a bye bye Ukraine ! And its because Zelensky choose this, he already had multiple times to end this conflict and at that time way less land was lost to Russia. And Ukraine will never be in NATO..",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Rentalis",
                            "body": "And they so fkn proud about it.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Blursed_Spirit",
            "body": "If anything, I'll be fighting for my country if I'm forced to. \nI don't give a flying fuck about Ukraine.",
            "score": 5,
            "replies": [
                {
                    "author": "RebootGigabyte",
                    "body": "I'll be honest I couldn't even really give that much of a fuck for fighting for my own country. It sounds bad, but why bother fighting for rich fucks in government who own massive real estate empires (I'm Australian, not a rip on Trump) and continually import infinity Africans and Indians to do all the low skill Labor and to make housing unaffordable and what used to be a 20 to 30 minute drive with a little congestion into a 1.5 hour bumper to bumper traffic filled shit fest?\n\nFuck them, THEY can go fight and die for the country they control. Maybe then they might stop the messaging of white men being the problem.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "porrridge",
                            "body": "dont forget allowing all the houses to be bought up by foreign nationals, and then allowing tax breaks via negative gearing to encourage people to own multiple properties. \n\nEnd result is younger people locked out of the housing market.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "wtf_are_crepes",
                                    "body": "I wonder what parties like tax breaks for multiple property owners… hmm",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "porrridge",
                                            "body": "both our major parties as they all have multiple properties and benefit from it.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Blursed_Spirit",
                            "body": "I said if I'm forced to. And in case of Russia attacking Poland, I'd be forced to by law (or imprisoned, executed or sent into a battlefield anyways). If I had a choice, I'd take a dump on a border crossing and left the country for women to defend xD There's nothing really worth fighting for.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aritzuu",
                                    "body": "You can always flee to another country.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "But nobody will invade your country.. People who say Russia will invade other balkan countries are still coping with Cold War Propaganda",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "sgtGiggsy",
            "body": "You masterfully dissected the strawman you created.",
            "score": 4,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "explain",
                    "score": 0,
                    "replies": [
                        {
                            "author": "sgtGiggsy",
                            "body": "There were never talks about EU troops fighting for Ukraine, even less so conscripted people as your post claims. No EU leader ever suggested active participation in the war as that would immediately be an all-out world war.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "I think their actions speak louder than words !",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "sgtGiggsy",
                                            "body": "Tell me just one action that implies ANY EU leader wishes to actively enter this war.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "By continuing the war and wanting to put their soldiers in a foreign country, even if Putin doesnt want it ... which that would be a escalation",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Guilty47",
            "body": "I hear rumors of a possibility of conscription. \nThat Britain is going to conscript in order to get young men into the army since they have completely failed inside their recruitment quotas.",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "I can almost guarantee they will not be able to reach their quotas no matter what ! Nobody is believing in the stories WARMONGER's are telling us",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Guilty47",
                            "body": "I'm just amazed that there's rumors of conscription I mean never in my entire life I ever think of Britain doing Force conscription.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "They are turning authoritarian to fight against authoritarianism .... Amazing",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jaxsso",
            "body": "Poland has been increasing its army size the last couple of years. The UK? It has around 18,000 medically fit combat ready troops! 18,000! They couldn't even secure their own capital, let alone their country, let alone help anyone else! Who would want to be an ally to that?",
            "score": 4,
            "replies": [
                {
                    "author": "Rittou",
                    "body": "M.O.D lists it as 127,000. Wheere did you see 18k?\n\n  \nEdit: Found the source, what classifies as medically fit compared to full time trained personel? Seems like a huge gap.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Jaxsso",
                            "body": "That is what they should have. However, their recruitments have been very short of needs, and the majority of their army are support positions. As of July 2024 they only had 18,398 Medically Fully Deployable (MFD) combat troops, and a little over 150 combat ready main battle tanks. It's alarming how unprepared the UK army is at this time. \n\n[https://www.army-technology.com/news/british-army-has-under-19000-troops-able-to-fully-deploy-in-combat/](https://www.army-technology.com/news/british-army-has-under-19000-troops-able-to-fully-deploy-in-combat/)",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Bluemikami",
                                    "body": "Seems it’s a good time for Argentina to take back the Falklands, with Trump's support (lol).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Jaxsso",
                                            "body": "You know... maybe?",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "elusivewompus",
                                            "body": "To take it back would suggest they owned it at some point. They have not. Their claim rests on Spain claiming it was theirs at some point, even though it was discovered by, and first inhabited by Brits.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Windatar",
                                    "body": "Theres already MP's coming out saying. \"If we need to, you will be conscripted.\"\n\nA lot of EU countries have conscription, lot of economic migrants and refugees are about to find out the hard way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Jaxsso",
                                            "body": "Except when they are armed they will be taking over the UK, not saving it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kjleebio",
            "body": "EU? I thought this was the Russian military all of a sudden.\n\nLets see, Russian minorities to the east, criminals, north koreans, Cubans, Yemens, and of course central Asian populace. If you are going to be glazing Russia you might as well do it correctly and not expose yourselves.",
            "score": 4,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "what ? xd",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Samm_484",
                    "body": "Damn north korean myth still going strong 💪",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Meditativetrain",
            "body": "What stupid ass shit is this.. Plenty willing to fight you sad fucktard",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "ahahah surely",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Meditativetrain",
                            "body": "Of course there are. We are not all sad incels like you.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "projectionnnnnnnn",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Meditativetrain",
                                            "body": "Sure russian bot",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fantaribo",
            "body": "This is fiction, not reality",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "where do you live ?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "fantaribo",
                            "body": "Europe. Why is that relevant ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "Cuz its funny cuz i think its reality and you don't.. and im from europe also",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Djildjamesh",
            "body": "What is this rage bait crap … Europe isn’t going anywhere. If anything we’ve been on a roll since the 2016 brexit vote. And the Trump era is just another confirmation that Europe is on the right track :)",
            "score": 2,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "What you mean by that ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Djildjamesh",
                            "body": "When do you think it’ll collapse? I’ll get back to this post to tell you you were mistaken :)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "Explain what you said broski .... i'm waiting",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Djildjamesh",
                                            "body": "Europe is going strong and it’s only getting stronger. What more do you need explained.\n\nSo. When you think it’ll collapse exactly?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "Is it ? Because im from a EU country and i have traveled... EU is being overran my migrants that do not like our culture and do not wanna adjust !\n\nSince you talked about brexit, People in certain regions of UK can't heat their house up in the winter, Salaries are down.. Bills are UP the roof... Crime is thru the roof.. \n\nPeople outside of EU are not INVESTING IN EUROPE so wtf are you even talking about getting stronger ?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Intreductor",
                                                            "body": "You seem like a good liar. If you trully travelled the EU, you'd know that most EU countries don't have large issues with immigrants because they didn't let too many in. Aside from Germany, France and Sweden, rest is doing perfectly fine.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Intelligent-Walk7229",
                                                                    "body": "No, i live in Portugal which is having troubles aswell, i went to Spain aswell.. which is the same problem ... went to UK and still the same problem .. so idk",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Intreductor",
                                                                            "body": "2/27 + UK. Cudos from Croatia to our fellow Portugeese who are also Eastern Europeans in everything but geography.\n\nEvery country has troubles, but they are not EU wide issues. They are for the locals to deal with.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Intelligent-Walk7229",
                                                                                    "body": "You mean the most important countries in Europe ? ( Not Portugal included btw ) xD but military wise yes the most important countries for EU security are having troubles ... the other countries are dependent from the big countries",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Formal_bro",
            "body": "Ok russki",
            "score": 2,
            "replies": []
        },
        {
            "author": "Turbulent-Deal-5731",
            "body": "Yeah america really loves its people thats why they enroll",
            "score": 1,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "enroll ?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Road2Potential",
            "body": "Ayooo why you draw us so bad bro 😭 Immigrants aren’t illegal. Its the undocumented ones that are bad 🥺",
            "score": 1,
            "replies": []
        },
        {
            "author": "classic-wow-420",
            "body": "Why should young men die because old farts want to btfo Putin? Let them go fight themselves",
            "score": 1,
            "replies": [
                {
                    "author": "super_tank_why_not",
                    "body": "You support Putin?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "classic-wow-420",
                            "body": "No. I don't want young men to die for a stupid dick measuring contest over a country 90% of people can't find on a map.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "super_tank_why_not",
                                    "body": "That doesn't mean said country doesn't have the right to fight back.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "classic-wow-420",
                                            "body": "Sure they do. But they are forcefully conscripting people who don't want to fight which is wrong. Yes I'm aware Russia does it too.\n\nI'm also curious what you think would happen if Mexico or Canada declared tomorrow that they were allying with China. Do you think the US would respect democracy and their sovereignty or would they invade them?\n\nDoesn't mean Ukraine deserves it but they definitely brought it upon themselves.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "Good man",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Antidote8382",
            "body": "Don't let me see you in eastern Europe mraz.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Optoplasm",
            "body": "There is a surprising amount of truth to this. Demonize your home grown patriots and then suddenly nobody wants to volunteer for the military. US is experiencing this issue heavily rn",
            "score": 1,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "They were having this issue .. now they are having the most people volunteering to the military",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhitishRogue",
            "body": "First, we need to question why the war reached the point of needing to send non-ukrainians.  If the war cant seem to end, the people calling for war are the preliminary group drafted.\n\n\nThis will shut things up quickly.",
            "score": 1,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "Oh yeah.. very good point ! In Ukraine people with money can buy their way out of conscription ... So its a war of poor people",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Vegetable-Traffic536",
                    "body": "This whole bullshit argument about war supporters again... noone wants this fuckin war aside from Putin and his imperialistic clown show, jesus, when will you shut the fuck up about that?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "WhitishRogue",
                            "body": "None of the Russian citizens seemed gleeful about the war either.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Vegetable-Traffic536",
                                    "body": "Did I say Russian citizens? No, I said his imperialistic clown show, the government, the propaganda. Fuckin troll.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intreductor",
                    "body": "When Russia launches a large-scale unprovoked war, and keeps promising to invade more countries, sitting around not preparing for it seems like a dumb idea.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sardoodledome",
            "body": "Europe will collapse because the USA destabilized the middle east and flooded Europe with migrants. Than Victoria Newland with the CIA made the Maidan in Ukraine and started the war there! But do not worry - war is coming on your turf! You can not rape and pillage the world and act as peace maker ! Payment is on it's way ....",
            "score": -6,
            "replies": [
                {
                    "author": "super_tank_why_not",
                    "body": "What the fuck are you talking about, you uneducated shit. CIA has nothing to do with Maidan, we kicked out the asshole Yanukovich ourselves",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Sardoodledome",
                            "body": "Go educate yourself beyond the Washington Post and New York Times ...",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "super_tank_why_not",
                                    "body": "I live in Ukraine you fucking moron, I am more educated about this than you are",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sardoodledome",
                                            "body": "You are not educated, you are filled with hatred and hatred will be the end of you. You listen people that hate you and want you dead by telling you - go fight Russia, you have a chance! If you were that educated you would have known that your country IS the most corrupted country in the World and without Russia it can not exist! In your foolish hatred you destroyed yourself ... I have watched documentaries about the killing of kids in Donbas in the other separated states! When you bring hatred and murders, expect much of the same!\n\nLiving in Ukraine does not make you educated by the way! If you are a fool who only listens to what the others say, even if you live under Ukraine you will still be the same regard!\n\nNow go grab a Nazi flag and run into the bullet storm, you educated Bandera neo-nazi!",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "yeahUSA",
                                                    "body": "Nah bro we should nuke Russia. It's a dogshit country.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sardoodledome",
                                                            "body": "I am neither for nor against ?! But if you do this, they will do the same to you and we are all fucked ! You will never find a comment of mine that I have protected Russia! They are all the same and they all serve the same master ! I am just tired of warmongering and people wanting war ... It is not a game and the suffering is never-ending ... \n\nHatred begets Hatred, killing brings killing ... It is just a vicious cycle of non stop agony! And it is all for resources and money for the military complex!",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "yeahUSA",
                                                                    "body": "Well you are not wrong and I see where you are coming from. But the ball is literally in Putins court, he invaded the country, he is the one who can stop it. I'm not gonna hold it against Ukrainians for fighting for their sovereignty I would do the same.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sardoodledome",
                                                                            "body": "I am afraid It is not that simple. It is literally a game of military bases and ability to put your opponent in constant fear and by this he will usually make a mistake when driven by fear and uncertainty. No Russia president will allow for a Nato/USA base to be operational with planes able to carry nukes to Moscow within  an hour. Nato keeps expanding and is now at the borders of Russia.\n\nTell me what would USA do if Russia puts bases in Toronto Canada and Cuba. Treaties were signed and promises were made that Nato would not expand beyond 1990 and the fall of western Germany. But Nato kept going and kept going ....\n\nP.S. \n\nUSA though that Russia will go bankrupt again, as it did during the 1980 when they were losing ridiculous amount of people and Craft in Afghanistan. And when Chernobyl happened it was the final straw in thhe pocket of Communism! But Russia is no more like that and with the export of oil, gas and resources it is more capable of keeping the balance of expenditure! \n\nWatch the Charlie Wilson war with Tom Hanks! They tried to do the same with Ukraine!",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "yeahUSA",
                                                                                    "body": "NATO is a defensive pact, why would Russia care if sovereign nations choose to join it. Russia has no say in this. Russia also has made numerous threats of nuking the US and Europe. Their word is not worth anything and should be ignored.\nEurope has tried becoming closer to Russia through trade and concession after concession which was very wrong in my opinion. We should cease any and all trade and diplomacy with them untill a new government has been formed.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Sardoodledome",
                                                                                            "body": "Seems you talk the talking points, but have no idea why they are saying it. Russia has a nuclear doctrine which says - if there is a possibility that a plane can travel to Moscow and bomb it with tactical nuke - we are bombing the whole world! So USA know this doctrine because it is since the cold war and yet they push and push! They think that Putin would bluff, but why would he! Also their war doctrine is - No Russia than No World! Why would any sane person test the Russians ? They push and push and push untill Russia reacts and than they start - aggressor, killer , etc. Putin is no saint, he has killed many Russians too, do not get me wrong!\n\nThere is a funny example with the Pearl Harbor incident. If you read the whole story now, one could say that Japan were pushed into attacking Pearl Harbor - it was the same as is today - financial regulation, no oil, no energy, no food for Japan and this forced them to attack!\n\nthe United States imposed severe economic sanctions on Japan before the attack on Pearl Harbor, which played a significant role in escalating tensions.\n\nBy the late 1930s and early 1940s, Japan was expanding aggressively in China and Southeast Asia, aiming to become the dominant power in the Pacific. The U.S. and other Western nations saw this as a threat and took economic and political actions against Japan:\n\nU.S. Trade Embargoes on Japan (1939-1941)\n\nThe U.S. restricted exports of key materials like aviation fuel, scrap metal, and machine tools.\n\nThese were essential for Japan’s military expansion\n\nThe U.S. Freezes Japanese Assets (July 1941)\n\nAfter Japan occupied French Indochina (modern-day Vietnam, Laos, Cambodia) in July 1941, the U.S. froze all Japanese assets in American banks.\n\nThis prevented Japan from accessing funds to buy necessary resources\n\nThe Oil Embargo (August 1941)\n\nThe U.S., Britain, and the Netherlands cut off Japan’s oil supply, which was devastating since Japan imported 80% of its oil from the U.S.\n\nWithout oil, Japan’s military and economy would collapse within months\n\nFailed Diplomatic Negotiations (Mid-1941 - December 1941\n\nJapan saw these sanctions as an attempt to strangle its economy and force it to abandon its expansion in Asia\n\nThe U.S. demanded that Japan withdraw from China and Indochina before lifting sanctions\n\nJapan refused, believing that war was the only way to secure resources.\n\nALSO - USA needed the attack so that they have excuse to join the WW2 conflict.... All is lies and theater for the \"goyum\" and the \"unilluminated\" . Do not believe anything they say to you ...\n\nDo you see the similarities between Japan back than and Russia now ... There is nothing new under the sun\n\nEurope is dead without Russia. Europe can not exist economically without the cheap gas and oil from Russia. Europe has been building this infrastructure for cheap gas from Russia for 25 years now! But the world is at a stage of reshaping. Europe has lost it's part on the stage and now China and other countries are stepping up.\n\nEurope has no resources to either fight or ti produce anything besides food. And even food is hard without Russian chheap pesticides and food growth stimulants produced by the oil industry. Currently Europe is dead financially and economically and the EU is going to disband soon!\n\n ",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intelligent-Walk7229",
                    "body": "Its Nuland.. Not Newland\n\nAlso you allowed it to happen... so how is US fault ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sardoodledome",
                            "body": "Sure I did with my 1 trillion dollar budget for war! Tell me when was the last time The Pentagon passed an audit ?! Was it the 19th century ... Billions and Billions of dollars to kill and destroy countries and people's life! What ever America touched it was destroyed ! War after war, genocide after genocide, one atrocity after the other !  You are nothing but blood hungry, oil munching rednecks! War is coming to your shores! Just you wait ... Than you will taste your own medicine",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Virusoflife29",
                                    "body": "Trust me, there is nothing more America wants then you to come a knockin. If you think it's a good idea to try and bring war to a bunch of gun toting rednecks. boy, have you got a lot to learn.   \nI don't expect someone with one brain cell to understand that though.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Sardoodledome",
                                            "body": "Well, first of all I am from Europe and I do not give a fuck about America... But be in no doubt - Everybody hates America ...THE WHOLE WORLD HATES YOU, besides your owners - ISRAEL !!!! But even they know how dumb you are and screw you left and right and use you as a BULLY! Even your neighbors hate you and will betray you at first chance ! Your Presidents are retard after retard and your army is full of vaccinated LGBTQ. You are in so much debt that it is straight moronic ... Your brains are washed into thinking you are good for something! No you ain't ... your army fled like the little bitches they are form Afghanistan .... You fled so fast you left behind everything .... the whole world is mocking you.... If you got to bed thinking you are the best in the world you will be up for a big surprise when planes start flying over your heads :D Pray that neither Taiwan or Israel is touched, because while you rush to help, you will get raped from behind....",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Virusoflife29",
                                                    "body": "HAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAHAHAHAHA.   \nI can't stop laughing that this dude. Top tier troll bro, top tier. hahahahaha",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Sardoodledome",
                                                            "body": "Do not worry - all will be over within an hour! Power is never given up, but taken by force! I bet you will remember this conversation when you can not believe you eyes :)",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Virusoflife29",
                                                                    "body": "![gif](emote|free_emotes_pack|joy)",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sardoodledome",
                                                                            "body": "your own words  - This isn't the military anymore. Loyalty to one company is just hurting yourself and your prospects.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Intelligent-Walk7229",
                                                    "body": "ahahahah this kid is so obsseced with israel is crazy",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Sardoodledome",
                                                            "body": "nah mate ... your country is ... You pay for Israel to kill children, bomb schools and hospitals...  I do not care about the Kazhars bunch ....",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Intelligent-Walk7229",
                                                                    "body": "Go find a bridge and call it quits kid ... you worthless",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Sardoodledome",
                                                                            "body": "Worthless .... Is this what they teach you, when there is no school shooting there ? Worthless are people who think  of people as resources ! Go bomb children in Gaza to feel powerful :D Diabetes runs strong within your blood line or maybe it is the incest ... the small blood vessels in your brain are gone ...",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Surely55",
                                                    "body": "Bro you’re on an American social media obsessed with American games while you’re binging on American twitch streamers. What would you do without America?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Sardoodledome",
                                                            "body": "This is a meme of Europe ... I have trees in my back yard older than America ! :D You regards think that the worlds revolves around you! No you rape and pillage the world, but the world is having enough! The bill is coming ....",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Salt_Hat7080",
                                    "body": "Wa waa waaaa\n-sardoodledome",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Sardoodledome",
                                            "body": "go back to r/askteenboys ... this topic is beyond your one brain cell",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Intreductor",
                    "body": "Maidan would've happened regardless of CIA and Nuland. When you piss off your own people so much that they protest for 90 days in the freezing cold, you don't need foreign interference to get deposed. Majority of Ukrainians didn't even know who Victoria Nuland was, and they didn't care.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sardoodledome",
                            "body": "No it would not! Maidan was a special operation with snipers and paid personnel ... You have no idea what you are talking about... Everybody in Ukraine knew Nuland .... She was walking and talking to the crowds ... ARE YOU DUMB or just plain American brand ....",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Intreductor",
                                    "body": "No it wasn't keep coping. No one in the former Soviet sphere likes the Russians and wants to get away from them asap. Russia wants to keep a leash on the through violence alone, and they are failing. Hands off from our sovereignty you cunt.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sardoodledome",
                                            "body": "EVERYBODY WANTS TO KEEP THE REST ON LEASH! Be it Russia, USA or China! \n\n[here is Victoria Nuland on tour in Ukraine 2013 - 2014](https://www.google.com/search?sca_esv=45c41d3e543101a5&sxsrf=AHTn8zowSeolWRQL5KInMw9HdxXYLvaXwg:1742335256329&q=victoria+nuland+speaking+to+ukraine+crowd+2014&udm=2&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpmDtIGL1r84kuKz6yAcD_ip1RA3L6hbNpnjK_ML6MGeX9tsslGBAmA7OONF1MAjQZHR3Cs5xDlZ6up7OTwRQC7pbbQ2jQX0GuSmU7vXlpc9tGwNTofuNrLzJzGJJ0ywF6b88EJie0CQnTdKKuMfD6uspWLYRFmvQtLorm3xaNLA9huGa7&sa=X&ved=2ahUKEwjz0qHQ0JSMAxUBOHoKHf2PKswQtKgLegQIFxAB&biw=1835&bih=633&dpr=1.88)\n\nYou have resources and hence you have no sovereignty - they are either USA or Russia now!   Your country has been used as a sacrifice altar for geopolitics and you all played by the fiddle . If you can not see this than no one can help you! \n\nNo one in Ukraine wants your sovereignty .... \n\nHere in my country is full of Ukrainians with expensive cars, living in luxury .... And I pay for their stay with my tax money ! \n\nYou will never ever win a war against Russia, because you are its neighbor and they are the biggest country in the world ... they can flood you with people and weapons. If you wish to die so that some USA company can fill its pockets, than go ...  You are free to chose how you condemn yourself !",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheRealTahulrik",
            "body": "Europe will collapse from within quite a while  after the US will at this rate...",
            "score": -2,
            "replies": [
                {
                    "author": "Intelligent-Walk7229",
                    "body": "It's not US thats being invaded by Islamic terrorists who wanna rape your children, and wanna do all types of terrorism, while telling their population they gonna have to send their sons to fight for a Country thats not theirs ! \n\n  \nKeep coping",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}