{
    "title": "Free speech in the UK",
    "author": "ThatPatelGuy",
    "subreddit": "Asmongold",
    "rank": 8,
    "score": 152,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 121,
    "url": "https://v.redd.it/50ji5uuoxipe1",
    "id": "1jeht25",
    "selftext": "",
    "comments": [
        {
            "author": "BumbleBiiTuna",
            "body": "Is this in Londonistan?",
            "score": 40,
            "replies": [
                {
                    "author": "kosfookoof",
                    "body": "Stoke on Trent, city in the midlands. This was part of organised pro Palestine marches from last year.\nThe city is majority white but there are communities of Muslims in some areas.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Winstons33",
                            "body": "Any movements to deport them?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "kosfookoof",
                                    "body": "During the 90's and early 2000's there were several pro nationalist movements that organised, and they were quite popular amongst the working classes but they weren't taken seriously politically. Organisations like the BNP and Nationalist Front (NF) for example. They were often seen as loutish and openly racist, and for the most part they were. \n\nOver the years more mainstream parties have risen and won a few seats here and there like UKIP for example, but they seem to lack enough mainstream appeal to have any real influence. I'm pretty sure UKIP no longer even exists.\n\nWe also had the conservative (mainstream British right wing) in charge for about 14 years prior to the current government, and they often promised to address the immigration issues but their efforts amounted to close to nothing. I know from speaking to my friends at the time that the real driving force behind Brexit for the working class was a desire to take back control of our borders. \n\nThe current UK government seems hell bent on protecting minority groups at the expense of the domestic populations, but they are not very popular with anyone at the minute so I can't imagine them staying in power for long.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "unhappy-ending",
            "body": "They mad, but is he wrong?? I didn't see one single person refute 9 years old.",
            "score": 77,
            "replies": [
                {
                    "author": "slve123",
                    "body": "that cause he's shouting 9 year old and no one els has a mic lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "slve123",
                    "body": "and yes its inaccurate",
                    "score": 1,
                    "replies": [
                        {
                            "author": "slve123",
                            "body": "or half true with no context",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Long-Arm7202",
                                    "body": "Ok, so you're saying he didn't consummate with a child? Because he definitely did.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cr33py-Milk",
            "body": "\"You guys are better than this.\"\n\nNot really. Unemployed brutes, trying to intimidate someone for saying the truth. \nWhich technically means that they feel shame or embarrassment about it.\n\nThey come to the country under false pretences. Lying, deceiving and committing crimes, but want respect.",
            "score": 66,
            "replies": [
                {
                    "author": "slve123",
                    "body": "violence is in all human nature no one has monopoly on it and said the guy on reddit",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Cr33py-Milk",
                            "body": "Can you explain?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ReddTea",
                            "body": "Monopoly on violence is literally the definition of state. People who cannot abide by that don't belong to civilized society.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Uncle__Touchy1987",
            "body": "When Canada votes in the Liberals agai, this will be the next round of hate speech laws too.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Aggravating_Owl_1935",
            "body": "I dont understand why they get mad, like what?",
            "score": 38,
            "replies": [
                {
                    "author": "621Chopsuey",
                    "body": "They can’t handle the truth.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "slve123",
                            "body": "more like lies about there prophet, imagine if your loved one was called a pedo and see if you can stay calm",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "blikkiesvdw",
                                    "body": "It' not lies lol. Also, Christians have their god insulted all the time and no one is scared of them.\n\nThis is an Islam problem and Muslims need to fix that problem. Not the rest of the world's problem.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Dannyboy765",
                                    "body": "What's the lie?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Intelligent-Walk7229",
                                    "body": "keep defending the inbreds",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Give_me_sedun",
                                    "body": "But it's True , go read about it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KeiTruckJDM",
            "body": "Then they’ll go crazy in chat telling Asmon he has no idea what he’s talking about 🤦‍♂️",
            "score": 16,
            "replies": [
                {
                    "author": "RudraVv",
                    "body": "Can you imagine, the majority who agree can't type it or risk being prosecuted.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "slve123",
                    "body": "i know right lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cyberninja1982",
            "body": "Facts.\n\n![gif](giphy|l46CwsAIlmnXlRC9O|downsized)",
            "score": 15,
            "replies": [
                {
                    "author": "slve123",
                    "body": "ironic",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Previous_Painting_75",
            "body": "Poor England. Gave all the rights to the Muslim immigrants an gave the boot to the people",
            "score": 15,
            "replies": [
                {
                    "author": "Sockular",
                    "body": "Dont blame the people, blame the spineless self serving politicians. The people never wanted this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Intelligent-Walk7229",
            "body": "Can't wait for Islam defenders in the comments !",
            "score": 52,
            "replies": [
                {
                    "author": "S0Up_S0UP",
                    "body": "fr bro.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "LiberalTears001",
                    "body": "![gif](giphy|8PuQJoolNUXyE)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Emitex",
                    "body": "Here? On r/asmongold? Of course this sub is notorious for its Islam apologists..",
                    "score": 1,
                    "replies": [
                        {
                            "author": "slve123",
                            "body": "you make it sound like its a terrorist group like America dident commit any crime or Christianity",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Give_me_sedun",
                                    "body": "Found one 🫢",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FatBussyFemboys",
                    "body": "This comment is kinda rage bait though isn't it? Like when you say that you are acting like Islam is all bad and indefensible. But considering the biggest Muslim population is in Indonesia, not a war torn area such as the middle east or a country where a bunch of refugees have gathered and clash with native populations...it's generally safer than American as well on the GPI \"Global peace index\" ",
                    "score": -5,
                    "replies": [
                        {
                            "author": "ElDuckete",
                            "body": "\\>acting like Islam is all bad and indefensible  \nCorrect",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "FatBussyFemboys",
                                    "body": "I mean I won't argue against such an illogical bigoted opinion. That's like the avg aethist liberal equating all Christians to evangelicals and sht. You have the same brain as them, that's OK. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ElDuckete",
                                            "body": "I mean, I'm not going to argue with a user called FatBussyFemboys who has \"LGBTQIA+ Femboy Trap with ass\" in his bio, about religion",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Which_Cookie_7173",
                                                    "body": "Dude would get thrown off a building or stoned to death in Palestine but only has whataboutisms about Christianity",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "FatBussyFemboys",
                                                    "body": "Lmaoo. Cope your inability to reply in good faith however you need to bud. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ElDuckete",
                                                            "body": "Why would I want to have any sort of argument, with someone that obviously does not even practice a religion?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "FatBussyFemboys",
                                                                    "body": "Again cope any way u need, u dont gotta write it here everytime the flavor changes👍 ",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Intelligent-Walk7229",
                            "body": "Brotha are you really this retarded ?! Go study islam and tell me thats a religion of PEACE you fucking mongol !",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "slve123",
                                    "body": "show me a religion of peace and I will show you war crime ,show me any group and I will show you the bad in them its not that hard no one is perfect ,talking shit like its only Islam get the fuck out here",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Intelligent-Walk7229",
                                            "body": "Nonono thats not the point ... in 2025 who is doing terrorism ? Is christians or Jews or drews ( who are dying in Syria right now by islamic pigs ) blowing themselves up for religion reasons ?? \n\n  \nmohammed was gay btw",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FatBussyFemboys",
                                    "body": ">Brotha are you really this retarded ?! \n\n\nEven though this is extremely bad faith, what specifically did I say that made you feel this way? \n\n\nI get if you want to look at the middle east or the uk and think Islam bad but you can't do that with Indonesia for a few reason unless you are just straight up an ignorant bigot. \n\n\n>Go study islam and tell me thats a religion of PEACE you fucking mongol !\n\n\nSo you have done extensive studies into Islam yourself in order to believe its not a religion with the capacity for peace and yet... have not been radicalized.. huh how interesting you must be the only 1 lol. OR you are just repeating something you've  been fed and don't actually have knowledge of Islam in every part of the world. \n\n\nI can only assume you must live a very fearful life believing so many people are just violent extremist, even in Indonesia lmao. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Intelligent-Walk7229",
                                            "body": "Keep finding excuses to defend terrorists brotha it looks great",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "FatBussyFemboys",
                                                    "body": "Lmaooo keep living in/with bigot fear brain ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Intelligent-Walk7229",
                                                            "body": "fear ? nonono brotha ahahah\n\njust waiting for the crusaders to start again",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "FatBussyFemboys",
                                                                    "body": "Cringe ",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Intelligent-Walk7229",
                                                                            "body": "look at your name ... come on bro how ignorant can u be ahahahah",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FatBussyFemboys",
                                                                                    "body": "Hahah your must be like person #763 to think talking about my name will mean anything. In fact it's almost like a litmus test for bad faith people. \" I can't argue with you look at ur name hur hur\" the cope is hilarious every time. ",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Intelligent-Walk7229",
                                                                                            "body": "surely ahahahah",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RebootGigabyte",
                            "body": "\\>acting like Islam is all bad and indefensible\n\nCorrect, I don't enjoy gays being throw off rooftops.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FatBussyFemboys",
                                    "body": "This has happened in every single Muslim country, province, state? Source? data? Illogical Karen view imo. \n\n\nLike saying I don't like Christians cause the crusades were bad lol. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RebootGigabyte",
                                            "body": "Saudis execute LGBT, Palestinian LGBT are thrown from rooftops, Iran has long term jail sentences and hanging for homosexuality, Pakistan and Afghanistan have jail sentences for being gay.\n\nThe list goes on. I literally just gave this a two second google. I'm not here to engage in your autism and have a well reasoned debate with you, this issue is not one that requires it, it is SELF EVIDENT. \n\nThe crusades were an act of defence against Muslim aggression, by the way.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BerithTheBear25",
                            "body": "Remind me how the women are treated with the Islamic faith? Forced to cover up and if they don't, they get a good beating?\n\nRemind me how Jews, Christians, and Homosexuals are treated under the Islamic faith? Lined up for execution as they're deemed filthy apostates?\n\nBro, you gonna quit sucking off Muhammad, I mean, he already has many wives (some child wives like Aisha) and virgins that serve that purpose and get the job done\n\nEdit: mf blocked 🤣",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FatBussyFemboys",
                                    "body": "Well in response to all your questions, are we going off your negative generalized and biased worldview or reality? Trick/rhetorical question this has shown just of ignorant and bad faith you are on the subject.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "slve123",
                    "body": "like what you expect ? you talking shit and we cant defend our self what ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Intelligent-Walk7229",
                            "body": "its not talking shit ... its the truth that you people are ashamed of",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuqMahdihk",
            "body": "England is fucked. ",
            "score": 57,
            "replies": [
                {
                    "author": "LiberalTears001",
                    "body": "They’re all inbred savages \nhttps://www.dailymail.co.uk/health/article-14181241/amp/pocket-England-Pakistani-married-cousins-study.html",
                    "score": 15,
                    "replies": [
                        {
                            "author": "slve123",
                            "body": "for sure buddy not like we have other places with inbred savages , nop all middle east",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LiberalTears001",
                                    "body": "![gif](giphy|7Jq6ufAgpblcm0Ih2z)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SnackEnjoyer420",
                                    "body": "Strong counter point there lol race to the bottom it seems ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Give_me_sedun",
                                    "body": "Yep. Let me guess, you're from middle east",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stage2guy",
                    "body": "Guess why some experts predict that whites will be the minority in the UK by 2050",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Formal-Barracuda-690",
            "body": "Protecting their imaginary god at all cost",
            "score": 21,
            "replies": [
                {
                    "author": "xHindemith",
                    "body": "Ah yes because the west never did such things nuh uh",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "slve123",
                    "body": "you have evidence ? didn't think so just like how i don't so don't talk like its the truth unless you can back it up",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kosfookoof",
                            "body": "That's not how the burden of proof works, it's on you to prove his existence.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VanillaStreetlamp",
                                    "body": "We know the Muslim god isn't real because we already know the Christian God *is* real.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MikeAndresen1983",
                            "body": "This is like your 8th comment on this video trying to defend that pedo you call a god. Mohammed was a sexual predator. Deal with it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dksushy5",
            "body": "oh look at that ...  a native brit cant speak his mind without going to jail whereas the imported terrorist sympathizers can say and do what they want\n\nFunny as hell",
            "score": 22,
            "replies": []
        },
        {
            "author": "Sleepyknot",
            "body": "Disgusting",
            "score": 7,
            "replies": []
        },
        {
            "author": "S0Up_S0UP",
            "body": "Honestly Islam is a fake religion (My opinion) because it all starts 500 years after Christ's lifetime, and it goes about on this a 53-year-old in a 9-year-old honestly, I didn't know pedophilia was a religion.",
            "score": 29,
            "replies": [
                {
                    "author": "OkNJGuy",
                    "body": "Islam isn't a religion in the same way us Westerners understand religions.  It's more of a political system with Sharia law at its center.  Its goal is to spread worldwide until all governments have been replaced with Sharia.  And it's the duty of all Muslims to work toward this mission.  What you're seeing in the UK isn't just a freak thing, it's part of a very deliberate plan that's baked into the religion.  And deceiving Westerners about the goals of the religion is also part of that plan.\n\nBut don't take my world for it, I'm no expert, but I encourage anybody to read the Qu'ran and related material themselves and talk to ex-Muslims for clarity.  It's pretty insidious.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "S0Up_S0UP",
                            "body": "You did a much better job of explaining things than just flat-out denying stuff thanks for talking through it all and not just being stubborn.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dksushy5",
                    "body": "isslam aint even a religion ... its basically a death cult whos political idealogy is to conquer lands/countries  at any cost. Africa/europe/asia --- same friggin story. And if the american subcontinent is not careful , it will repeat in this part of the world as well.\n\ni like to see 1 religion in the world where the devotees go to pray in temples/churches/etc  and come out armed to the teeth and with murderous intentions to kill all non-islamists. Just show me 1 other than islam",
                    "score": 1,
                    "replies": [
                        {
                            "author": "S0Up_S0UP",
                            "body": "What point are you trying to make here bro?...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dksushy5",
                                    "body": "i was adding to your point :) perhaps i should have mentioned that",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "S0Up_S0UP",
                                            "body": "Sorry I was a bit confused and thought that you were trying to tell the other person to bear no mind to what I had to say lol it's all good, but clarification helps.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rangald2137",
                    "body": "Name one religion that isn't fake xD",
                    "score": 9,
                    "replies": [
                        {
                            "author": "S0Up_S0UP",
                            "body": "(My Opinion) Christianity since one of the things it is based on is free will which is allowing people to believe whatever they want to believe unlike Islam which goes along with the idea that if you don't submit to their religion, you die whereas Christianity rules with peace and tolerance.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rangald2137",
                                    "body": "I have no words for that bs.  \nThere's something you made up and you're calling it Christianity but it surely isn't Christianity.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "S0Up_S0UP",
                                            "body": "Brother go and see for yourself to be clearly informed for you wish not to listen to what I have to say.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Rangald2137",
                                                    "body": "I was raised catholic in one of the most catholic countries in Europe. I recognize bullshit when i see one when it comes to Christianity.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "S0Up_S0UP",
                                                            "body": "Listen bro I don't really care for you trying to tell me that I'm spreading bullshit I'm not I'm being honest and truthful and if you took the time to listen maybe you would realize that, but I don't really believe you that's all I'm going to say for now.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "entor",
                                            "body": "You can't argue with a stupid opinion. This dude doesn't claim to understand history or even reality, he's just saying\"this is my \\[uninformed\\] opinion!\". So take that for what it's worth: NOTHING!",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "S0Up_S0UP",
                                                    "body": "Why are you so mad?.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "entor",
                                                            "body": "I don't think I'm mad. It's just a gut reaction to a take so uninformed that it is a waste of time and we are all just that much dumber for having read it. There's nothing nice to say. ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "warbiii",
                            "body": "The spaghetti one",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PebbleSizedPleb",
            "body": "![gif](giphy|hTvW4Y6fBrKlq)",
            "score": 5,
            "replies": [
                {
                    "author": "Joeyjackhammer",
                    "body": "“Kiss me, kiss me”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Creative_Lynx5599",
            "body": "GB is turning into a batman asylum",
            "score": 5,
            "replies": []
        },
        {
            "author": "snafubarr",
            "body": "It is a real mystery why far-right parties are gaining grounds in Europe.",
            "score": 1,
            "replies": [
                {
                    "author": "NatahnBB",
                    "body": "yeah lowkey there needs to be an emergency called about extreme islam. UAE leaders will be the first ones to explain to you about it:  \n[https://packaged-media.redd.it/y2y8kjwd7hpe1/pb/m2-res\\_480p.mp4?m=DASHPlaylist.mpd&v=1&e=1742346000&s=0d71ae37a98961a865edaeed2fe0b513d49e7a37](https://packaged-media.redd.it/y2y8kjwd7hpe1/pb/m2-res_480p.mp4?m=DASHPlaylist.mpd&v=1&e=1742346000&s=0d71ae37a98961a865edaeed2fe0b513d49e7a37)  \n  \nit needs to be driven away from europe. while the last time far right movements rose up, they used a minority as a scapegoat to unite and control the majority. now its not at all a minority. its a real and sizeable population that wishes to change the lives of the majority. combating it wont be a means to control the people for selfish goals like it was last time. honestly it might be the means to self preservation of the culture and the people.  \n  \nand its literally in their religion to spread and conquer the whole world and convert it into their world-view. they arent peaceful immigrants wishing to integrate..",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jaxsso",
            "body": "UK is a lost cause. Allying with them is like allying with a huge anchor dragging itself and everyone else it can pull with it to the bottom of the abyss.",
            "score": 19,
            "replies": []
        },
        {
            "author": "MaestroGamero",
            "body": "The UK is so fucked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kalkuehl",
            "body": "Isnt getting mad at this literally a sin? If Mohammed did this and they think islam is true, they should accept it and praise it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Silverbuu",
            "body": "Why are they upset about that? Isn't it something they are taught anyways? I mean if you are taught the prophet is infallible, than surely there's nothing to be upset about?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisWillNeverFly",
            "body": "We were nearly free from religion in Europe, then these people came along.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hrafndraugr",
            "body": "Just another day in Londonistan",
            "score": 1,
            "replies": []
        },
        {
            "author": "Greedy_Drama_5218",
            "body": "[SHE WAS 9 YEARS OLD](https://www.youtube.com/watch?v=WhwqBUCYQO0&pp=ygUVTk8gT05FIFdJTEwgRVZFUiBLTk9X)",
            "score": 1,
            "replies": []
        },
        {
            "author": "BalkanTurboChad",
            "body": "Sand people are always mad 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "KrakenAsassin",
            "body": "The UK has been conquered by Islam. Once they reach over 10% of pop its O V E R.\n\nStupid fucks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prayedtt",
            "body": "No offense, but the way the world is going, Western society is going to collapse. A bunch of crazy people, delicate men who want to be women and vice versa, extremism. And all of this exploded after the pandemic, the virus must have affected a lot of people's minds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "selvestenisse",
            "body": "[Muslim Schism: How Islam Split into the Sunni and Shia Branches](https://www.youtube.com/watch?v=-85dXjgMiSU)\n\n  \nReal life game of thrones, Abu Bakr used his child to lay claim to the throne. But also, seems like Islam is a war religion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stekarmalen",
            "body": "The UAE guy warned us back in 2017.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whosyodaddy-Senpai",
            "body": "Mob mentality at its finest.. one, two, three people join and the dominos accumulate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CptKarma",
            "body": "They arrest any one against the mob because they are afraid of the mob",
            "score": 1,
            "replies": []
        },
        {
            "author": "KatastrophicNoodle",
            "body": "You're acting like the exact same scenario wouldn't happen in the US. Apart from worse cause they have guns and police just ready to shoot or beat up anyone causing a ruckus.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maanoot",
            "body": "America is the last bastion of freedom against the hordes of leftists rampaging through the rest of the world. If America falls, so does freedom",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revolutionary-Try206",
            "body": "Rage baiting. Works on Jewish, Christian, Buddhists, Muslims, etc.   What the guy said was true, but different time in history, read the Bible, there was a lot of similar lines crossed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exotic_Quarter_1153",
            "body": "What did the guy mean by how old was Jesus? Jesus doesnt have any story like that. He doesn't have any sex or wives at all.",
            "score": 1,
            "replies": [
                {
                    "author": "selvestenisse",
                    "body": "[https://en.wikipedia.org/wiki/Mary\\_Magdalene](https://en.wikipedia.org/wiki/Mary_Magdalene)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Which_Cookie_7173",
                    "body": "He said Joseph",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BerithTheBear25",
                    "body": "Idk, he takes in a whore into his group. Either he was sleeping and getting intimate with Mary Magdalene or the Apostles and Jesus were having a little fun orgy with the boys",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slve123",
            "body": "holy shit people here cant read or bother to learn he married a 6 year old first and it was a political/ permeance it doesn't say anything about sex it took me 10 min to look it up just admit we hate Islam and move on stop pretending like you have good reason.  also i am not replying cause there is like 20 of you mf",
            "score": 1,
            "replies": [
                {
                    "author": "Which_Cookie_7173",
                    "body": "Muhammad ibn Isma'il al-Bukhari, commonly known as Imam al-Bukhari, mentioned a Hadith in his collection wherein Aisha narrated that Prophet Muhammad married her when she was six years old and he consummated his marriage when she was nine years old. (Sahih al-Bukhari, 5133)\n\n\"Also I'm not replying\", meanwhile is crashing out in every comment thread",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BerithTheBear25",
                    "body": "Quit sucking off your ~~warlord~~ prophet, he already has virgins in heaven that fulfill that role",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}