{
    "title": "LSF head mod purges 2nd team in 6 months after refusing to remove problematic powermod",
    "author": "derpnsauce",
    "subreddit": "Asmongold",
    "rank": 9,
    "score": 139,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/Asmongold/comments/1jei7ae/lsf_head_mod_purges_2nd_team_in_6_months_after/",
    "id": "1jei7ae",
    "selftext": "The head moderator of the subreddit LiveStreamFail Stale2000, has once again removed a majority of the LSF mod team - this time for confronting him for not removing a powermod who he randomly added months ago when stale needed support when the prior mods brought up issues about stale  - that mod is on the mod council, actively moderates over 200+ subreddits, and was found to be into underage problematic content. This current group of mods who were removed were chosen by Stale along with two leftover mods from the original team that he purged most of in 2024. After only a couple of months, this new mod team began noticing the same issues the last team had with Stale.  The team grew frustrated that he actively promoted content he was in favor of while removing any content that saw fit in the moment. When confronted he ignored criticism and kicked a member of the team who brought it up at the time. \n\nMembers of the team found evidence that the powermod was openly viewing, favoriting, and active in multiple communities that promoted problematic content about minors and other associated media.\n\nConversation with powermod admitting the accounts associated with the problem content was his:  \n[https://imgur.com/a/slsXism](https://imgur.com/a/slsXism) \n\nMuch of which is sexually suggestive art involving minors, with tags such as #preteen and #12yo. \n\n[https://imgur.com/a/4EfLiKQ](https://imgur.com/a/4EfLiKQ)\n\nIn addition to threatening to 86 other mods and trying to sabotage other mods, by attempting to take over subreddits behind their back.  Not to mention the powermod’s antisemitism and use of anti-LGBTQ insults.\n\n[https://imgur.com/a/AUovsU3](https://imgur.com/a/AUovsU3)\n\nWhen this was brought up to Stale, he didn’t think it was egregious enough to remove the powermod. Later, he stated that he didn’t remove the powermod because he was afraid of losing his position as top mod. Stale refused to even discuss it with the powermod, or take any actions at all. The only action done during this time by Stale was to add 3 alt accounts of his to the 2,3 and 4th spot on the modlist.\n\n[https://imgur.com/a/fGrjbia](https://imgur.com/a/fGrjbia)\n\nComplete conversation with Stale about the powermod:\n\n[https://imgur.com/a/I9nm03o](https://imgur.com/a/I9nm03o)\n\nDue to Stale’s inaction we went to the powermod directly who admitted that everything we found was indeed his and that he saw no issues with it and that he was \"just a weeb\". After making it clear that we did not want him on the team due to what we found, the powermod voluntarily left.  Stale made sure to give him some kind words on his way out:\n\n[https://imgur.com/a/7zWmQxB](https://imgur.com/a/7zWmQxB) \n\nReddit was informed about the situation but did nothing due to it being off platform. Stale was aware of this for a week before members of the team were forced to act on the team’s behalf and ask for the powermod to step down. Obviously upset about the situation, many of the mods once again expressed their concerns to Stale. Stale continued to claim that he did not remove the powermod because he was worried about making Reddit admin’s angry. A week later he removed all but three moderators because they expressed concerns with how Stale handled the situation.\n\nWe thought it was important to get this information out there as LSF affects a lot of streamers careers and can have a life changing effect in countless different ways. We didn’t want LSF to turn into an echo chamber based on one moderator's wishes who happened to get control of the top mod position and is now holding it hostage. Two groups of moderators completely separate from each other have both independently found the same issues and come to the same conclusion that Stale is unfit to run the largest streaming-focused subreddit and unless some sort of action is taken the same set of circumstances will play out over and over again. \n\nTLDR: Top LSF mod treats subreddit like his own personal playground, protects powermods who openly views underage suggestive media, then purges mod team for confronting him. \n\nThis is just a portion of what proof we have. There is quite a bit more, but due to the nature of the content it’s not appropriate to post.",
    "comments": [
        {
            "author": "Gullible_Egg_6539",
            "body": "LSF is a shithole anyways.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Jaxsso",
            "body": "Great write up, you obviously put a lot of effort into it. One small question, what is LSF?",
            "score": 11,
            "replies": [
                {
                    "author": "Yoshiboo420",
                    "body": "r/livestreamfail",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "unhappy-ending",
                    "body": "lol, I wish people who post here would offer up context for shit. So many posts without.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "PenSquare4482",
                            "body": "tbf OP literally opened the post with \"The head moderator of the subreddit LiveStreamFail Stale2000,\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Only_Net6894",
            "body": "Reading these people talk about these mod positions like they actually matter... Fucking WOW.",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_PUNCH_INFANTS",
            "body": "Stale is the only person with a worse hairline than asmon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuz__Fuz",
            "body": "I can't wait for Trumplon to launch an investigation on reddit. It will be so much fun.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yanahmaybe",
            "body": "LSF gradually devolved into letting same group of ppl that used alts and other puppet accounts to post always and upvote their posts/comments  with a literal brigade of accounts and downvote stuff they dint like\n\nIts really easy to do that and most of time a dozen of votes its enough to kill any submission you dont like in new and sit forever under 100 or even under 10 points\n\nIf u ordered stuff like top post for a year or month its was always the usual suspect either a spammer that always post  and never participates with comments or some random account that never had no past history in the sub.\n\nThe whole sub was basically astroturfed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnDeft",
            "body": "I demand to know aht colour their hair is if they are in 200+ subs modding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JISN064",
            "body": "so you saying you guys found a mod that has criminal content and another mod is protecting him, right?",
            "score": 1,
            "replies": []
        }
    ]
}