{
    "title": "Let go today... review severance package or just sign?",
    "author": "wildkiller65",
    "subreddit": "PersonalFinanceCanada",
    "rank": 2,
    "score": 84,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/PersonalFinanceCanada/comments/1jeajxi/let_go_today_review_severance_package_or_just_sign/",
    "id": "1jeajxi",
    "selftext": "Let go today as the title stated.   Was with the company for over 4 years.  Being advised that it's approx 17 weeks of pay.  \n\nWhat should I be doing now etc...  employer lawyer to review? Costs? Any help is appreciated. ",
    "comments": [
        {
            "author": "NSA_Chatbot",
            "body": "First, I'm sorry this happened to you. Layoffs suck and they hurt to go through.  You should get back on your feet soon enough. In the meantime take some time for yourself and your family. \n\nTURN OFF YOUR ALARM! \n\nFile for EI right away, they'll defer until your severance coverage ends but you should get that started in case you can't find anything. \n\nFor the cheque, that's pretty standard for severance.  You should run it past an employment lawyer since it's probably around 25k, but I'd bet a hex dollar they tell you to just sign it.\n\nCheck for non-compete and nda clauses as well.",
            "score": 43,
            "replies": [
                {
                    "author": "shelbsterama",
                    "body": "This is the best answer. Do a free consult with an employment lawyer and don’t sign anything until then. And definitely file for EI right away too. I’m sorry, it sucks right now but it will get better!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "chaitea97",
            "body": "17 weeks is pretty generous. One month per year is great. ",
            "score": 318,
            "replies": [
                {
                    "author": "FightMongooseFight",
                    "body": "Unless OP was poached from their previous job, or is due a bonus soon, or has unvested RSUs, or a bunch of other things. \n\nIt's almost always best to have a lawyer look it over. If everything is onside, 17 weeks is roughly the expected common-law payout for 4 years...it's fair, but not overly generous unless OP has a legally binding termination clause for a much lower payout in their employment contract (which many do not).",
                    "score": 98,
                    "replies": [
                        {
                            "author": "TalkInMalarkey",
                            "body": "I am just wondering, does poaching even matter after 4 years?\n\nAfter a certain time at the new company, you can't use it as an excuse unless your initial contract has a clause where you are protected for X amount of years, right?",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "FightMongooseFight",
                                    "body": "Depends. I think you're right that it fades over time but I'm not a lawyer, which is why I would ask one. \n\nIt may not be a popular opinion but I think it's absolutely crazy to sign something prepared by the other side's lawyers without ever having someone qualified look at it on your behalf.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Panlouie",
                                            "body": "You’re not crazy, I signed a severance package years ago that I regret. I was devastated in the moment and did it to get out of the situation. I wouldn’t make that mistake again.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "FightMongooseFight",
                                                    "body": "I'm sorry. You're not alone, they count on that...and they do not want you to run it by a lawyer.  \n\nIf it's fair, it's fair. But it's better to know for sure.",
                                                    "score": 12,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mysterious_Mouse_388",
                            "body": "I was on the 'just take it side' until I read your comment",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "FightMongooseFight",
                                    "body": "It's funny how tilted the comments are towards \"Yeah, sign this thing prepared by lawyers working for the organization that just fired you.\"\n\nIf OP posted this on r/LegalAdviceCanada, they would get a very different response.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Trust_Im_A_Scientist",
                                            "body": "Curious, but how often do unvested RSUs convert when someone gets terminated this way? Does it depend on the cash value?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "FightMongooseFight",
                                                    "body": "Depends on a BUNCH of things in my (somewhat limited) experience. \n\nLike imagine a scenario where someone is laid off after 5 years. The company offers 5 months of base salary, but only 10 weeks of RSU vesting. The employment contract has an illegal termination clause, but the RSU clawback clause seems legally correct. And the courts have a habit of declaring the whole contract void when one clause is offside....but not always.\n\nI've actually seen this. And realistically only an employment lawyer can actually help untangle it while protecting the employee's interests.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "glorious_bastard",
                                                            "body": "Typically no, RSU don’t exist / have ownership until they vest and the stipulations always revolves around employment status. It’s one of the last things they give up in severance negotiations unless it’s explicitly stated in your employment agreement that you get them regardless of status. Bonuses though, yes on the table.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "FightMongooseFight",
                                                                    "body": "True, but if other parts of the contract are egregiously illegal the court can (and will, in Ontario) often throw the whole thing out and go to common law on everything, RSUs included.\n\nThat said, based on what I've heard, you're correct that RSUs are the toughest part of that fight, and it's the last thing the employer will concede on.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bobmarmite",
                                            "body": "If you take advice from reddit commenters on anything more important than a pizza place recommendation ... well, you get what you pay for.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ListAltruistic9037",
                                    "body": "Really",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kimorin",
            "body": "a month per year of service is pretty standard so that's on par... personally i would just take it",
            "score": 67,
            "replies": []
        },
        {
            "author": "RedDirtDVD",
            "body": "Just make sure the 17 weeks isn’t comprised of a bunch of vacation time/pay. Otherwise that offer sounds reasonable. Best of luck in the hunt.",
            "score": 12,
            "replies": []
        },
        {
            "author": "HotCardiologist6536",
            "body": "I am also new to this. Vacation pay should be separate from severance package, right?",
            "score": 13,
            "replies": [
                {
                    "author": "Expert_Alchemist",
                    "body": "Yes, it should.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "NSA_Chatbot",
                    "body": "Yes, but it'll be at 3/12th of their yearly allowance due to it only being March.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "pgsavage",
            "body": "Pretty good comp for 4 years but the default advice is usually to have an employment lawyer give it a once over.\n\nId sign and move on personally or counter for 20 weeks",
            "score": 21,
            "replies": []
        },
        {
            "author": "MellowHamster",
            "body": "1 month per year is a generous offer. I'd accept it and move on to finding a great new job.",
            "score": 15,
            "replies": []
        },
        {
            "author": "giviner",
            "body": "That is a generous package. Probably not worth seeing a lawyer IMO.\n\nYou will be eligible for EI after your severance runs out.\n\nIf you want to seek re-employment right away, dust off the resume. It can also be a nice sabbatical if your finances allow. \n\nKeep positive. You'll land on your feet and everything will be okay!",
            "score": 27,
            "replies": []
        },
        {
            "author": "Beginning_Winter_147",
            "body": "What does your contract say? Is 17 weeks all in including termination and severance pay, potential pro-rated bonuses / incentives (depending what your contract says), benefits? \n\nDepending on your province, for example in Ontario you’re definitely over the minimum required by the ESA, if that also aligns with what was stipulated in your contract, then you can take it, or also negotiate. Depending on your age, specialty, position, education etc, a lawyer might be able to get more out of it if your common law entitlements would be higher. Some employment lawyers offer a free consultation, you can do that to get an idea and then make a decision.\n\nDon’t let this discourage you, brush up your resume, your linkedin, and apply for EI asap (even though your benefits won’t start until later because of the severance).",
            "score": 5,
            "replies": []
        },
        {
            "author": "Conscious-Positive37",
            "body": "how much would a lawyer cost approx- if OPwould procced?",
            "score": 3,
            "replies": []
        },
        {
            "author": "WhyDoIWorkInIT",
            "body": "Unless you have a contract or agreement with severance terms, this is pretty good. \nMinimum is 1 week (you don't say where you are), 2 weeks the generally accepted minimum. \nLike others say, verify that's not a combination of vacation or other monies owed added in. \nIf you are older and will have trouble finding similar employment, then I suggest talking to a lawyer. If you're young and capable, take it and move on.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Occasion-Particular",
            "body": "It doesn't hurt to have a lawyer review your severance package. It will give you a piece of mind. A consultant is about $250-300.",
            "score": 4,
            "replies": []
        },
        {
            "author": "narfig_agar",
            "body": "Always speak to a lawyer before signing. No company will give you an appropriate severance voluntarily. It depends on your age, industry, ability to get a similar job and so on. My lawyer almost doubled my severance, got my bonus back, paid himself and it still never went to court.",
            "score": 4,
            "replies": []
        },
        {
            "author": "RedDirtDVD",
            "body": "Just make sure the 17 weeks isn’t comprised of a bunch of vacation time/pay. Otherwise that offer sounds reasonable. Best of luck in the hunt.",
            "score": 9,
            "replies": [
                {
                    "author": "Expert_Alchemist",
                    "body": "Great point. Also, OP I'd try and negotiate e.g. a continuation of benefits until the end of severance period.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhyDoIWorkInIT",
            "body": "Unless you have a contract or agreement with severance terms, this is pretty good. \nMinimum is 1 week (you don't say where you are), 2 weeks the generally accepted minimum. \nLike others say, verify that's not a combination of vacation or other monies owed added in. \nIf you are older and will have trouble finding similar employment, then I suggest talking to a lawyer. If you're young and capable, take it and move on.",
            "score": 3,
            "replies": []
        },
        {
            "author": "nosey1-s",
            "body": "People saying it’s generous are assuming based on no facts. You should read the entire agreement and get an employment lawyer. There has to be a reason they offer so much. A lawyer may be in the $400-500 per hour range.\n\nEdit: Also read your employment letters and any subsequent employment agreements.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RefrigeratorOk648",
            "body": "You really won't better than 1 month per year of service unless it was unfair dismissal. \n\nTake it and apply for EI",
            "score": 9,
            "replies": []
        },
        {
            "author": "MDChuk",
            "body": "It doesn't hurt to have a lawyer review your specifics and offer advice.\n\nI don't know what you make in a year, but if you're around the Canadian average and not a minimum age worker, I'd reach out to a lawyer.  A lot of them offer free or cheap consultations for exactly this reason.",
            "score": 5,
            "replies": []
        },
        {
            "author": "little_nitpicker",
            "body": "Take the money, move on. Its pretty generous.",
            "score": 7,
            "replies": []
        },
        {
            "author": "nicerolex",
            "body": "Speak to a lawyer",
            "score": 2,
            "replies": []
        },
        {
            "author": "clever_weather",
            "body": "Take advice from random people on the internet or a qualified employment lawyer. Hmmmmm",
            "score": 2,
            "replies": []
        },
        {
            "author": "louisiana_lagniappe",
            "body": "Don't listen to people on Reddit who don't know your full situation. ALWAYS have a lawyer review before signing a severance package. Seriously. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "smileclickmemories",
            "body": "Sorry for this.\n\nAre you in Edmonton/ post secondary sector?\n\nI'm hearing of a lot of layoffs today and few where I work in this sector so I'm curious if its all related.",
            "score": 3,
            "replies": []
        },
        {
            "author": "zerocoldx911",
            "body": "Dependent on age",
            "score": 2,
            "replies": [
                {
                    "author": "yankowitch",
                    "body": "And disability status",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ignore-me-plz",
            "body": "Always consult with an employment lawyer before you sign anything.",
            "score": 3,
            "replies": []
        },
        {
            "author": "redaloevera",
            "body": "Seems reasonable but I would still have an employment lawyers eyes on it before signing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TipTopTailors",
            "body": "I would get a lawyer - bc you should get a fair settlement. Even if this is fair on face value a lawyer can advise you best.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fsmontario",
            "body": "It depends, how old are you? How easy will it be to find a position with the same pay?",
            "score": 3,
            "replies": []
        },
        {
            "author": "jostrons",
            "body": "If in Ontario, 1 month per year , especially under 10 years of service is where you'd hope to end off. \n\nNot sure why they opened with that, usually you'd expect lowball.\n\nCant hurt to go to a lawyer and see what they think after reviewing your contract and terms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jolly_Photo_8733",
            "body": "Weird that people are saying this is generous as it is basically absolute minimum you’d expect to get. \n\nCan have a lawyer look it over but it most likely won’t change much unless there’s some circumstances around this that be meaningful. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarkReaper90",
            "body": "Do a quick review with a lawyer. Maybe there are clauses they can catch.\n\nNAL but what I'd check is if it included my bonus and are my benefits extended.\n\nIt's a generous offer though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thehog1971",
            "body": "Don’t forget, even if you go to a lawyer to try and get more it is your obligation to mitigate losses. Which means you have to go try and find a job. If you do not then it can cost you in the final result not sure where you are, but in Ontario one week per year Termination pay is law for anybody working under five years for the same company. Saying that common law does very often award up to one month per year, but again there are a lot of factors age type of job and mitigating loss. \nJust my two cents",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ironshallows",
            "body": "go see an employment lawyer. never sign anything without one, ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "20PercentChunkier",
            "body": "17 weeks, god damn. When I was let go from my last full-time job in Canada (Sask) I was given ONE week of severance, because that was legally all they had to offer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "monimonti",
            "body": "Ontario’s standard pratice is one week per year of Service. You are getting one month per year. So technically you are getting almost 3 times the standard practice. \n\nDefinitely take it. Lawyering up might end up them pushing it down to standard practice in which case  it would be down to 6 weeks (2 weeks notice + 4 weeks based on service).",
            "score": 1,
            "replies": []
        },
        {
            "author": "lylesback2",
            "body": "Take it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alph1",
            "body": "If you still have a lot of work years ahead of you and work in an industry with relatively low unemployment, I would take it and enjoy the summer.\n\nThat said, if your salary was incentivised somehow (commissions, bonuses, etc) you can do the math and decide if four months is really fair.\n\nWhile I said I would take the summer off, plan ahead on the day the severance would run out and decide that's an optimum time to start looking for a job. Remember that you should never start digging a well if you're already thirsty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zone4George",
            "body": "Always review with a 3rd party, just in case there are some shenanigans in the severance agreement that you would not ordinarily want to agree to (example, lifetime NDA might be a bit too much to ask, your potential availability at a cheap rate$ if they need help with something your replacement can not handle)\n\nAlso peace of mind that you did in fact get a good deal, so you never have any future lingering regrets. It's a good $300-$600 to get that consultation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ellegrow",
            "body": "To give you peace of mind on the totality of your package it would be worth a review. It's normally about $400-500. \n\nWhile your financials seem great there may be other clauses that should be tweaked in your favour.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewMilleniumBoy",
            "body": "I think that's pretty decent. Mine was around 3 weeks/year of service and the assessment was that it was \"okay, but not great\". Some employment firms will review it for free, some will cost money. When I got my package reviewed, it was billed at about $350/hour for slightly less than one hour I think - that was 2.5 years ago. To me it was a good investment to make sure I knew I was getting a reasonable deal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "putin-gets-pegged",
            "body": "They will always offer you less the first offer. Ask for more, it’s there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Badger_1077",
            "body": "Look into half hour free legal advice on lawsociety site?",
            "score": 1,
            "replies": []
        },
        {
            "author": "swimingiscoldandwet",
            "body": "You were with company for very short time.  17 weeks is very generous.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MichaelLehmann",
            "body": "Definitely speak with an employment lawyer. Rely on their expertise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "falco_iii",
            "body": "My general rule is 1 month per year served, so this is decent.  There are always exceptions.",
            "score": 1,
            "replies": []
        }
    ]
}