{
    "title": "Never signed employee contract for 5 years. Now what?",
    "author": "Cope180-Enjoyer",
    "subreddit": "PersonalFinanceCanada",
    "rank": 12,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/PersonalFinanceCanada/comments/1jebukk/never_signed_employee_contract_for_5_years_now/",
    "id": "1jebukk",
    "selftext": "I work for a Low cap engineering firm for 5 years now.\n\nWhat should I look out for. The only things in the poorly gpt written document that doesn't look right is the severance part. They want to give me the MB minimum which isn't that 2 days per year worked? Everyone here says 4 weeks...\n\nI don't plan on leaving but I do find it odd that only now they give me a contract. Their is no foul play at hand here, very healthy employee/employer relationship. Do I have to sign anything? Would they let me go for not signing it? \n\nCan anyone offer me some help?",
    "comments": [
        {
            "author": "Bynming",
            "body": "It could be worth reaching out to an employment lawyer that works on a contingency basis and ask their opinion. You may be entitled to more than the MB minimum. But I have no idea.",
            "score": 7,
            "replies": []
        },
        {
            "author": "StoryAboutABridge",
            "body": "This is not the right sub. r/legaladvicecanada",
            "score": 5,
            "replies": []
        },
        {
            "author": "lanks1",
            "body": "IANAL but when you don't have an employment contract, the default severance would be the common law normal, which is 4 weeks per year of service. \n\nTalk to a lawyer.",
            "score": 3,
            "replies": [
                {
                    "author": "Separate-Analysis194",
                    "body": "Common law is likely minimum 4 weeks per year. May be more depending on age, seniority and other factors. Also, if they are now asking you to sign a contract that is less than your common law entitlements, you are giving up something significant. They likely need to provide you with some material consideration eg pay raise, one time payment in this case. You should definitely speak to a lawyer.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "BronzeDucky",
            "body": "If you have concerns, you should get your contract reviewed with an employment lawyer.  They can tell you what is valid or invalid, and what you're giving up.\n\nThey should be compensating you for signing the document.  That's another thing you should review with the lawyer.\n\nAnd yes, you can sign a contract that limits you to the legal minimum severance.  If the contract and clauses were valid, that would prevent you for successfully suing for common law amounts (the 4 weeks per year that you're talking about).",
            "score": 3,
            "replies": []
        },
        {
            "author": "Guilty-Bag7162",
            "body": "you must tell a little about the conntent. maybe it's better for you. and u dont tell your situation.. it's very important to relate with written doc's..  good luck",
            "score": 2,
            "replies": []
        },
        {
            "author": "9NEPxHbG",
            "body": "> The only things in the poorly gpt written document that doesn't look right \n\nI'll bet that the document written by GPT is full of American garbage that doesn't make sense in Canada.\n\nIt's scary that someone would use GPT to draft a contract.",
            "score": 2,
            "replies": []
        },
        {
            "author": "askmenothing007",
            "body": "For sure, worth to review it through a lawyer. \n\n  \nBasically think of it this way, currently you have no contract so maybe there is some understanding between you as employee and employer. \n\n  \nNow, they want to enforce a contract and of course it will have specific items stipulated. \n\n  \nThat is a change and you need to review each change and if it is vastly different to current or your understanding then, the employer needs to provide consideration in return for you to agree. (by signing the contract) \n\nThere have been cases where judge sees that employee signed a contract that had unfavorable clauses but there was no compensation or something offered in return, so judge voided that contract or specific stipulation between it was unequal.",
            "score": 1,
            "replies": []
        }
    ]
}