{
    "title": "Is it worth paying $150 to get my taxes done by a CPA if I'm self-employed?",
    "author": "DonVergasPHD",
    "subreddit": "PersonalFinanceCanada",
    "rank": 4,
    "score": 14,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.reddit.com/r/PersonalFinanceCanada/comments/1jecmtu/is_it_worth_paying_150_to_get_my_taxes_done_by_a/",
    "id": "1jecmtu",
    "selftext": "So I'm self employed and I'm filing joint taxes with my wife, who was on maternity leave for half of last year. I wonder if my situation is \"complicated enough\" to the point where paying a CPA $150 to do our taxes would yield a higher return than their fee.\n\nWhat do you think?\n\n  \nEDIT: thank you all, I'll get the CPA to do the taxes AND i'll do my own taxes and compare, then see the difference.",
    "comments": [
        {
            "author": "mousicle",
            "body": "Did you keep up on your book keeping all year or are you going to hand someone a shoe box of receipts?  If you actually did your book keeping properly then it's probably not worth it unless your business is pretty complicated.  If you didn't do any book keeping yourself hten $150 for taxes is a steal.",
            "score": 31,
            "replies": [
                {
                    "author": "jostrons",
                    "body": "I'd probably be charging $850 - $1,250",
                    "score": 16,
                    "replies": [
                        {
                            "author": "mousicle",
                            "body": "I charge by the hour when I do book keeping for people so it depends on how many shoe boxes he has.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "jostrons",
                                    "body": "and the hourly rate increases each week in april as my patience grows thinner",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DonVergasPHD",
                    "body": "I do my bookkeeping",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ARAR1",
            "body": "If you don't know how to do it - see what they do and do it yourself next year.",
            "score": 15,
            "replies": [
                {
                    "author": "ckl_88",
                    "body": "This is a good idea. There are free tax software available that allows you to do your taxes, but only pay when you file it to the CRA. \n\nLet the tax guy do it this year... and when they're done, they will give you the details. Then the important thing is, you also do it yourself with the tax software and see if  you come up with the same numbers. If not, why.\n\nOnce you figure it out, then you can do it yourself next year.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "DonVergasPHD",
                            "body": "This is a good point!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iamnos",
                    "body": "This is what I did almost 15 years ago.  Had an accountant doing it, but he missed something, and when asked to fix it, charged me extra for the time.  So I took his previous year's filings, put it into (then) Simple Tax, and realized how easy it was to do.  Have done ours ever since, including self-employment, rental income, disability credits, etc.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "8bEpFq6ikhn",
                            "body": "95% of the times a client won't give you information, get mad it's not included then get pissy when you charge them to fix it.\n\n  \nBut honestly, I with more people did what you did and do it yourself. Personal tax returns under $800 for just a T4 slip just aren't worth the time for any real firm.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "harv66",
                            "body": "I get people like you call my office asking to check their return before the hit send on turbo tax or just help fix one small thing for FREE. No shame in asking a business for free info/work. Best one is when they pay those cheap preparers to do their return but call a CPA to get an opinion on a deduction or advice because the cheap preparer never bothered to learn it themselves.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FanLevel4115",
            "body": "For your first year absolutely hire a professional.\n\nAlso I quickly discovered having a pro do it was cheaper than the wasted labour time of me taking 4x longer to do it. Plus if you hire a pro to do your taxes you are far less likely to be audited.",
            "score": 9,
            "replies": [
                {
                    "author": "jonkzx",
                    "body": "And if you do get audited, you have professionals who can get you through the audit process. It’s worth every penny.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "FaultThat",
            "body": "I would recommend using  tax software program as a baseline.\n\nTry your best to complete the returns yourself, see what you get as a refund/balance owing.\n\nThen pay the CPA, and compare results.\n\nIt will cost more this year but if you got the same result as the CPA you will know you can forego that expense in future years.\n\nIf you got close to the same but the CPA nailed a few things you missed, then you can consider it useful education and incorporate the same advice when filing yourself.\n\nIf you were way off, then yeah, you probably want the CPA.\n\nKeep in mind, you don’t just want the refund to be more than the cost of the CPA, you want the **difference** between your DIY refund and the CPA produced refund to be greater than than the cost of the software vs the cost of the CPA.",
            "score": 14,
            "replies": [
                {
                    "author": "DonVergasPHD",
                    "body": "This is amazing advice, thank you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "goldenmunky",
            "body": "I have my CPA do my business and personal taxes.  A lot of time saved and you can expense it as well.",
            "score": 5,
            "replies": []
        },
        {
            "author": "TipTopTailors",
            "body": "$150? Mine charges $900",
            "score": 9,
            "replies": [
                {
                    "author": "ConfidantlyCorrect",
                    "body": "Ya $150 is wildly cheap tf. When I needed a business tax accountant, the rate I got was like $400/hr.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "DonVergasPHD",
                            "body": "Oh yeah this same CPA charged me $450 for my corporate taxes, this is for the personal taxes",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ohhi23021",
                            "body": "For basic self-employed?   $400 is the rate if your a corporation… ",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "ConfidantlyCorrect",
                                    "body": "Ya that’s what they quoted me. I had an auto detailing business, real small. Just me. \n\nGranted - terrible bookkeeping.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "8bEpFq6ikhn",
                                            "body": "If your bookkeeping is shit its often just cheaper to let them do it from scratch.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Constant_Put_5510",
            "body": "I stopped using a CPA for our business when I figured out how easy it is to do it yourself. I keep clean set of books though so I know my numbers.",
            "score": 4,
            "replies": [
                {
                    "author": "harv66",
                    "body": "The most sucessful business people treasure their time and value other professionals to help guide them and build wealth. Mom and pop rather do it themselves for everything because they realize they will never grow. \n\nAlso, people and businesses that file their own taxes typical are cheating the system.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "harv66",
                    "body": "The most sucessful business people treasure their time and value other professionals to help guide them and build wealth. Mom and pop rather do it themselves for everything because they realize they will never grow. \n\nAlso, people and businesses that file their own taxes typical are cheating the system.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "foshizi",
            "body": "$150 is pretty inconsequential in the grand scheme of things.",
            "score": 8,
            "replies": []
        },
        {
            "author": "5a1amand3r",
            "body": "$150 for a CPA to do a self-employed t1 is a steal of a deal. When I worked in public accounting, something like that was, at a minimum, $500.",
            "score": 3,
            "replies": [
                {
                    "author": "8bEpFq6ikhn",
                    "body": "$1,250 minimum these days",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pseudomoniae",
            "body": "That's dirt cheap, what's the question? It's only $150,\n\nI don't think ROI is really the question here. If this saves you even an hour and the whole headache of having to figure out your taxes yourself then do it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DarkoJamJam",
            "body": "What CPA is doing self employed for $150. That’s crazy.",
            "score": 3,
            "replies": [
                {
                    "author": "DonVergasPHD",
                    "body": "I already paid him $450 for corporate taxes so he's adding this as an add-on",
                    "score": 1,
                    "replies": [
                        {
                            "author": "8bEpFq6ikhn",
                            "body": "Folks this is why you need to price correctly, a nil T2 should be $2,000 and NTR $3,500+\n\n  \nIf you price to get the guys paying $450 they will question $150 for a T1.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "udownwithopc",
                            "body": "Without having any background info, if you have a corporation, consider running the self employed income through the corp.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConversationMajor543",
            "body": "$150 to get a CPA to do your taxes for self-employed, that's almost too good to be true. Are you registered as an individual, or incorporated?\n\nPaying a professional to do my corporate taxes was an absolute life saver for me.",
            "score": 2,
            "replies": [
                {
                    "author": "DonVergasPHD",
                    "body": "I'm registered as an individual but also have an unrelated corporation (which this CPA already did the taxes for)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UmpireMental7070",
            "body": "I am self employed and I pay a hell of a lot more than that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shs21",
            "body": "I wouldn't even touch your tax return for $150. That's an absolute steal (think at least 60% off).",
            "score": 2,
            "replies": []
        },
        {
            "author": "d-bo201",
            "body": "I was in a similar spot before and during the start of Covid.  Short answer is I used to prepare my own, so when it got a tad more complicated, I did them in the background and had them prepared for me.  She saved me more than her fee for the first 2 years.  Note I keep good books, so that's a factor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "randomuser11211985",
            "body": "youll need to fill in this form. If youve kept your receipts and tracked everything it should be helpful.\n\n[https://www.canada.ca/en/revenue-agency/services/forms-publications/forms/t2125.html](https://www.canada.ca/en/revenue-agency/services/forms-publications/forms/t2125.html)\n\nSome comments from prior experience:\n\nfor the baby, if you needed to go to a hospital that was further then normal ( like 60+km) you can claim expenses, like vehicle, parking etc. Youll have to do some research into this to know what you can do. \n\nFYI im not CPA",
            "score": 2,
            "replies": []
        },
        {
            "author": "6pimpjuice9",
            "body": "$150 is way too cheap for a CPA",
            "score": 2,
            "replies": []
        },
        {
            "author": "GirlYouPlayin",
            "body": "yes for price alone lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "rockstar1346",
            "body": "No im in the exact same boat as you identical. Wife is on maternity since June last year we also got married early this year and we thought about getting a cpa to do it.  We ended up going on wealthsimple which truly is the greatest platform out there and trying just to see as a practice run ended up filing that same night because we were positive we claimed and reported everything. It was so easy I’m sure a high schooler could do it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eyeofthecorgi",
            "body": "Do as much as you can to lower your family taxable income (it's too late to put into rrsps). Depending on your income and your wife's typical income this may be your only year to get Child tax benefit. The less the income, the more child tax benefit you'll get. If the CPA will help you claim things that you otherwise wouldn't know how to claim then it would be worth it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "wrexs0ul",
            "body": "$150 is a great deal. And a good CPA could very well help you save more than that between deductions and saving you the hassle of an audit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Confident-Fig-3868",
            "body": "You can do Wealthsimple tax and see how much you get yourself just do not submit. And then go and compare with an accountant. If it’s close and you’re familiar with what forms to include then you can file it yourself next time.\n\nMine is simple but for years I was paying someone. Wealthsimple tax is free but can set a price if you want to donate.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inevitable_Sweet_624",
            "body": "If you can find a CPA that will do a self-employed schedule and spouse for $150. I would question if they’re really a CPA.  That’s crazy cheap.",
            "score": 1,
            "replies": [
                {
                    "author": "DonVergasPHD",
                    "body": "After reading your comment I just checked and he is a CPA in Ontario, also checked his LinkedIn, seems legit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aiesline",
            "body": "I'd be shocked if it was an actual CPA at that price.",
            "score": 1,
            "replies": []
        },
        {
            "author": "standardnerds",
            "body": "Mine was $225",
            "score": 1,
            "replies": []
        },
        {
            "author": "divine_goddess_K",
            "body": "In Canada we don't have joint filings. Confirm that the CPA is doing one filing for yourself and another for your wife. It's two separate returns for two people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future_Crow",
            "body": "I am amazed that at this point you can find a CPA to do your sole-proprietor taxes for $150. They must be desperate or have outsourcing foreign nationals doing these for $5/hr. We are charging $150 for individual employed tax with basic T4 and other slips and no CPA.",
            "score": 1,
            "replies": []
        }
    ]
}