{
    "title": "Should I keep my credit card limit high after paying it off?",
    "author": "DangerousWithForks",
    "subreddit": "PersonalFinanceCanada",
    "rank": 9,
    "score": 5,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/PersonalFinanceCanada/comments/1jee293/should_i_keep_my_credit_card_limit_high_after/",
    "id": "1jee293",
    "selftext": "I'm going to be paying off my credit card in full, by the end of this month (yay). The credit limit on the card is at $10k currently due to the kinds of purchases I was making on it. \n\nNow that the balance is going to be 0 and I don't plan to use it for any other big purchases, should I reduce the credit limit or leave it as $10k? \n\nI was leaning towards leaving it at $10k so the total available credit space counts towards my credit utilization percentage. Is this the right move? Or is it better (safer) to reduce my limit?",
    "comments": [
        {
            "author": "fxmto",
            "body": "Unless you have a spending problem, which seems like you don't, keep it. It'll keep your utilization % low and should positively impact your credit score over time as long as you continue to pay your bills on time.",
            "score": 19,
            "replies": [
                {
                    "author": "DangerousWithForks",
                    "body": "ok awesome thank you",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ATrueGhost",
                            "body": "There is an argument to lower it if you are looking to seek credit on a different card. I had over 70k worth of unsecured credit, and decided to reduce some cards to ask for more room on others as I've heard that they look at that type of thing when you are applying for new cards or asking for higher limits.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bubbasass",
            "body": "My credit card limit is close to $50k and I barely have even a couple grand on it at any given time",
            "score": 30,
            "replies": [
                {
                    "author": "DangerousWithForks",
                    "body": "oh nice! okay so as another user was saying, it's pretty much showing that you were pre-approved for that amount",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MashPotatoQuant",
                            "body": "One thing that I have ran into is that if you have a high limit already, and want to open a new account because you come across a better financial product, for example maybe it has lower interest rates, or there is perks or points you can collect.  In such a case you may be turned down due to already having access to so much credit. \n\nYour score can be super high, but a lender may still see the high open credit as a downside.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Top_Chemistry5087",
            "body": "Leave it.",
            "score": 19,
            "replies": [
                {
                    "author": "DangerousWithForks",
                    "body": "gotcha thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fuckdatguy",
            "body": "No reason to lower it unless if you don’t trust yourself",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hothborn",
            "body": "I have multiple cards with different banks, I never carry a balance on any of them but I use my points cards for all my day to purchases. I have access to consumer credit of over 200K- which has given me a very high, near perfect credit score. If spending isn’t a problem for you, then it’s a great way to build up a good credit profile for any future financing you may need.",
            "score": 2,
            "replies": []
        },
        {
            "author": "randomuser11211985",
            "body": "I have a 30k plus card, and presently using it to avoid 8% interest (3% +0%). If you manage it properly, you can have alot of flexibility. Keep the limit, if offered limit increases, take them. just dont let the easy money access get to you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JScar123",
            "body": "If you have to ask, best to reduce it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeBlackIsHere",
            "body": "It's not really a high limit at all.  You may need it in the future.  Don't make financial decisions based on how it might affect your credit score, actual cash flow is much more important.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timely_Chicken_8789",
            "body": "Yup leave it. And before you retire make sure you have one with all the bells and whistles. Once you retire (so I’m told) it becomes very hard to get a line of credit or a decent card.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neaj-",
            "body": "Unless it tempts you, which you should resist, keeping it high is good\n\nGood for credit score and good for emergency",
            "score": 1,
            "replies": []
        },
        {
            "author": "sammac66",
            "body": "Keep it doesn't cost you anything to keep it but if an emergency comes up it could save your butt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "queentee26",
            "body": "I have a $9500 credit card that I use for my normal purchases/some bills & pay it off every month. It doesn't usually go higher than $1500 and I get a nice chunk of cash back paid out every January. \n\nIf you can control your spending, I think it's fine to keep it.\n\nSome people will take increases whenever they can, which I don't do. If you do this and need a large loan (ex a mortgage), you might have to decrease it again.. which I guess isn't a huge deal, but I can't be bothered.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Paulrik",
            "body": "Devil's advocate here. You might consider lowering your credit card limit if you're in the market for some other line of credit that's a lower interest rate. \n\nI'm not sure exactly how it factors in to your credit score, but one thing potential lenders will look at is if you could keep up with the minimum payments if you were to max out all your available credit. I would rather owe $10k on a lower interest line of credit than a credit card. Carrying a $10k balance on a credit card would be $167 a month just in interest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Academic-Kale1505",
            "body": "We [husband and I, everything joint] used to have a 35,000CAD credit card limit. At some point our bank advisor suggested we lower it to 10,000 for a “better picture” ‘cause we never used it to this level anyway. Last year I was doing a renovation on an old house and had to apply for the increase of the limit due to spending. It’s a travel points credit card so we like to put everything through it but realized 10,000 limit was too low for that time being. The limit increase application was a tedious experience and we only managed to increase it to 16,000 (which was enough) but I wished we never decreased it from 35,000",
            "score": 1,
            "replies": []
        },
        {
            "author": "InvestigatorOk6009",
            "body": "well its not going to hurt you .... its basily saying you are pre-approved. i have a card with 17k that almost never used",
            "score": 1,
            "replies": [
                {
                    "author": "DangerousWithForks",
                    "body": "oh ok ok! thank you!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "beardsnbourbon",
            "body": "Keep it. Good for an “oh shit” safety next and also looks good from a credit utilization perspective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "illminus-daddy",
            "body": "Leave it and take any offers of making it larger. Only reduce it if you need a mortgage or other large loan and your lender wants your available credit below a threshold. It’s better to have credit and not need it than need it and not have it - and the offers of making it larger don’t ding your credit, they’re pre approvals",
            "score": 1,
            "replies": []
        },
        {
            "author": "gs448",
            "body": "Leave it, but also be prepared for them to view you as a risk. They may lower or cancel the card all together.",
            "score": 1,
            "replies": []
        },
        {
            "author": "figsfigsfigsfigsfigs",
            "body": "I had a really basic credit card for 20 years, I wanted to close it to get a new one, and it was pointed out to me that my credit history would disappear if I did that. Recently, I read that your limit actually plays into your credit score. Maybe someone can confirm? My limit is easily 10x what I spend in a month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GumpTheChump",
            "body": "In addition to the other helpful comments here, if you have a good points-based card, it's nice to have a high limit so you can put expensive items on it, get the points, and then pay it down. I put through work expenses like travel on the card and get the benefit of points on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FondantOne5140",
            "body": "If you are going to apply for a mortgage, keeping the ratio of credit card limit use to under 30% is beneficial. So depending on how much you are using your credit card now, you can calculate for yourself how much you spend on it by dividing it over 10k to check the ratio. If you are spending way less than 30%, you can decide to lower your credit limit. It also protects you against credit card theft as they can’t spend 10k. \nThe mortgage advisor takes the full 10k credit limit that you have into your mortgage affordability as they think you might actually spend the full 10k.",
            "score": 0,
            "replies": [
                {
                    "author": "DangerousWithForks",
                    "body": "I am looking towards buying my first house in the next 2 years so I want to make my credit score as desirable as possible. \n\nSo (just for my understanding), it may be negative to keep my limit high, because mortgage agents will count that 10k towards my \"potential spending\"?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "houseonpost",
            "body": "$10K is a pretty low limit already.\n\nYou should always pay the cc to zero balance each month before the deadline. That way you pay zero interest. \n\nGo over all your regular spending, rent, utilities, phones, streaming services to see if they will set up autopay through your credit card. You will earn a lot of loyalty points. But again be sure to pay it all down to zero each month.\n\nCongratulations!",
            "score": 0,
            "replies": []
        },
        {
            "author": "randomuser11211985",
            "body": "yes.",
            "score": -1,
            "replies": []
        }
    ]
}