{
    "title": "Simple questions and Help thread - Month of March",
    "author": "Froggypwns",
    "subreddit": "Windows10",
    "rank": 0,
    "score": 1,
    "upvote_ratio": 0.55,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/Windows10/comments/1j0yylj/simple_questions_and_help_thread_month_of_march/",
    "id": "1j0yylj",
    "selftext": "Welcome to the monthly Simple questions and Help thread, for questions that don't need their own posts!\n\nBefore making a comment, we recommend you [search your problem on Bing](https://www.bing.com/search?q=Windows+issue) and check if your question is already answered on our [Windows Frequently Asked Questions wiki page](https://www.reddit.com/r/Windows/wiki/faq). This subreddit no longer accepts tech support requests outside of this post, if you are looking for additional assistance try r/TechSupport and r/WindowsHelp.\n\nSome examples of questions to ask:\n\n- Is this super cheap Windows key legitimate? (probably not)\n\n- How can I install Windows 11?\n\n- Can you recommend a program to play music?\n\n- How do I get back to the old Sound Control Panel?\n\nSorting by New is recommend and is the default.\n\n----\n\nBe sure to check out the [Windows 11 version 24H2 Megathread](https://www.reddit.com/r/Windows11/comments/1ftpmes/windows_11_2024_update_24h2_build_26100_megathread/) and also the [Windows 11 FAQ](https://www.reddit.com/r/Windows/wiki/faq) posts, they likely have the answers to your Windows 11 questions already!",
    "comments": [
        {
            "author": "Main-Examination3757",
            "body": "When is Windows 11 going to be fixed?\nWhen is Windows 11 going to be supported on my Hardware?",
            "score": 3,
            "replies": [
                {
                    "author": "Froggypwns",
                    "body": "This is the Windows 10 subreddit, however Windows 11 has been getting fixes released for it every month since it was released in 2021. The vast majority of users are using it without any problems.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Unusual_Blk",
                    "body": "Acc real, they support the ecosystem, but they want people to throw in the trash alot of still good pcs,biggest hipocrisy I have ever seen in my life.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TnDevil",
            "body": "When the offer for extended support of Windows 10 for one year ($30) happens, is that for just one device or all W10 devices tied to your account? I'm using a local account, but on my Microsoft profile where it shows all devices, I have 2 PC's with Windows 10 and 2 PC's with Windows 11. Will the cost cover the 2 PC's that have W10?",
            "score": 2,
            "replies": [
                {
                    "author": "Froggypwns",
                    "body": "I'm under the impression the cost is per device, but I've not seen confirmation and at the moment it is not available for purchase.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wallmapuball",
            "body": "Is there a shortcut for the clear all button from the windows clipboard? I need it to quicken my workflow, I can't be pressing win+v and clicking the three dots and then clear all every time, please help.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Your-Friend-Bob",
            "body": "After it reached EOL in October 2025, would we be able to download a build of windows 10 for free and use it normally? or would you still need to buy a windows 10 license lest you be restricted on functionality?",
            "score": 2,
            "replies": [
                {
                    "author": "Froggypwns",
                    "body": "No. Licensing of Windows does not change after the end of support date.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BloodyFelineArtist",
            "body": "My dad is the admin of the computer and I dont know the password(I cant just ask because he has parental controls). Im not trying to bypass the controls, I just want to be able to run things as admin. Is there any way to get past it?",
            "score": 2,
            "replies": []
        }
    ]
}