{
    "title": "[DISC] Make the Exorcist Fall in Love - Chapter 87",
    "author": "AutoShonenpon",
    "subreddit": "manga",
    "rank": 8,
    "score": 342,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 69,
    "url": "https://mangaplus.shueisha.co.jp/viewer/1023767",
    "id": "1je6zfq",
    "selftext": "",
    "comments": [
        {
            "author": "JauntyLurker",
            "body": "Rocofale is so funny, must be the first time he's seen a woman in millenia, poor thing.\n\nSo Lucifer can't leave his Gehenna else he would purify all the others instantly?! He's pretty OP indeed.\n\nI like that Mr. Priest has calmed down a little from how irrational he was before. He still has tons of regrets about his comrades and anger at Imuri for deceiving him, but she just wants her to be happy all the same. I like that.\n\nSo Verge is here? I'm kinda surprised, has he given up on the whole Baba Yaga ritual? Very bold of him to show up in Beelzebub's Gehenna after deceiving him. Also, who told him Mr. Priest was going to be here? Is he working with Satan now? \n\nGuess we're going on Dante's Inferno now huh?",
            "score": 112,
            "replies": [
                {
                    "author": "Matrix_2k00",
                    "body": "Remember if Dante really is dead he should be inside Sloth layer since he committed suicide. So no idea what Vergil is doing in Gluttony layer.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "ankokudaishogun",
                            "body": "Verg is still a Witch of Gluttony.",
                            "score": 35,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zairaner",
                    "body": ">  I'm kinda surprised, has he given up on the whole Baba Yaga ritual?\n\nOn the contrary, he still needs a part from both satan and lucifer; priest seems like the best option he has.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "CorrectFrame3991",
                    "body": "With Imuri, while I am fine with Mr. Priest still caring about her and wanting to see her be happy, I hope the story doesn't just brush off Imuri's bad actions/behavior throughout the story once she wakes ups, and at least let the priest get mad at her and demand that she be completely honest with him in the future, with no more hidden intentions. \n\nI just want Mr. Priest and Imuri's relationship to face some level of hardship over the stuff she has done, and not just have their relationship go back to the way it was before the reveal or something like that.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Xatu44",
                    "body": "> So Verge is here? I'm kinda surprised, has he given up on the whole Baba Yaga ritual?\n\nWe saw him tearfully dragging Dante into a gate after he alt-f4d from life and then attending his corpse in Beelzebub's Gehenna at the end of Sloth Arc.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "dagreenman18",
                    "body": "With Father-kun as Dante. \n\nThough I’m thinking of it as “Father-kun’s Bogus Journey”",
                    "score": 6,
                    "replies": [
                        {
                            "author": "JProllz",
                            "body": "With companions like these, it's shaping up to be a Bizarre Adventure",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZayYaLinTun",
                    "body": "Of course vergil is bold bro to save his lover maybe he also need something from beelzebub",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Doomroar",
                    "body": "> Guess we're going on Dante's Inferno now huh?\n\nHehe wonder if Cerberus will make a cameo since they are on the gluttony layer",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Kaseruu",
                    "body": "really the character poll came just a little too early, rocofale would have easily stolen a top spot",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BurnedOutEternally",
            "body": "Truly the ritual of gluttony. The demon girls eat their fill, then eat each other out.\n\nOh hey Vergil.",
            "score": 66,
            "replies": []
        },
        {
            "author": "Namaryu",
            "body": "The ritual panel is a callback to chapter 19 when there were humans skewed instead of pigs. The more joyful ritual in Gehenna Vs a terrifying sight on Earth.",
            "score": 63,
            "replies": [
                {
                    "author": "meterion",
                    "body": "Yeah I immediately got flashbacks to that scene, it's not even like I reread it recently that imagery just burned itself into my mind. So impactful",
                    "score": 32,
                    "replies": [
                        {
                            "author": "ZayYaLinTun",
                            "body": "Is definitely one of most horrifying panel in all recent mangas",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "zairaner",
                            "body": "Yeah, it is super memorable. And a good reminder how horrifying both gluttony/the witch we are about to ally with are.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "gokogt386",
                            "body": "It was funny to read through the manga in one sitting because that sat very fresh on the mind when I started coming to these threads and seeing people think the witches weren’t evil",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DarkMatter1889",
            "body": "Protect bro Rofocale at all costs.\n\nDidn’t expect Lucifer to be aura farming in Gehenna. His sheer presence would destroy the entire place.\n\nSo we finally found Vergil. The team is complete for the Journey to Pride.",
            "score": 58,
            "replies": [
                {
                    "author": "famoustristan",
                    "body": "IF Lucifer is still this strong after falling from grace I am questioning the witch insane plan to overthrow god.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "EricaSome",
                            "body": "When the boy heard him speak, he was surprised and said to Vergil something like: \"It's strange, it's as if you believe in God\" making him jump. What if, like the little priest, he too was actually working unconsciously to unify the parts?",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Nelithss",
                            "body": "I thought the plan was to make humans not believe in him not actually fight him. Michael is already most likely stronger than every demons. God is not even part of the discussion.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "KingEmperorLordHope",
                            "body": "Wasn't the plan more to destroy the narrative of Jesus I think? It's been a while since I read that part but I don't think fighting God or the angels is part of it. More change the viewpoint of humanity so that the witches are top dog among the mortal powers.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Namaryu",
                                    "body": "Verge said that the story of Jesus ressurection is the strongest tale of mankind and he wants to change it, and by doing so, kill God.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NonoKuma",
            "body": "Thank goodness Mr.Priest has a reliable, supportive, adult guy with him through this. He better stay that way too. No more betrayal for my guy 🙏",
            "score": 45,
            "replies": [
                {
                    "author": "ankokudaishogun",
                    "body": "Rofocole is *obviously* Lucifer in disguise.   \nPossibly a Doppio to Lucifer's Diavolo.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "dagreenman18",
                            "body": "That’s a possibility, but I’d wait for more clues before that.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "frik1000",
                            "body": "I did some looking up on the name Rofocale. There's supposedly this idea that his name is the reverse of Lucifer, just slightly altered. \n\nLucifer -> Reficul -> Rofocale \n\nThe full name of Rofocale is Lucifuge Rofocale. Lucifuge means to flee the light, in opposition to Lucifer which is the light bringer.\n\nBasically there is a solid chance that there's some polarity/yin-yang thing going on with these two.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "NonoKuma",
                            "body": "I would like this just as much. Keep adding onto his mental strain lol",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ankokudaishogun",
                                    "body": "as alternative, Rofocale's nature as demon will come out when he'll do something absolutely immoral and terrifying like the most natural thing ever",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Teymarofc",
                                            "body": "This has happened before with Asmodeus, I don't see them repeating the same formula",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ta3na",
                            "body": "Im saving this comment for later",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Teymarofc",
                                    "body": "This is literally the plot of the Asmodeus arc, it would literally be a repeat of the betrayal trope from that arc, which I don't see the author doing. I see Rofocale as Bel to the priest, being a friend and kind to him.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "new_interest_here",
            "body": "\"Yes Lord Satan, it is utterly necessary for many women to have a lesbian orgy in front of the gate to enter my gehhena\"\n\n\n-Beelzebub probably",
            "score": 37,
            "replies": [
                {
                    "author": "zairaner",
                    "body": "Is that part of the ritual necessary to enter beelzebubs domain, or to be able to leave lusts? feels more fitting for the latter^^",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "KingEmperorLordHope",
                    "body": "What kills me is the gate was already open by that point. So I'm pretty sure that was just something they wanted to do in the first place and not really part of the ritual anyway. Beelzebub seems like he'd be more into vore anyway.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Extreme-Tactician",
            "body": "Lucifer can \"purify\" the other hells, yet the place he is in is still hell. I'm intruiged.\n\nVergil's in Gluttony? I wonder why he fled to there of all places. I'm sure Beelzebub would hate him.\n\nCatherine and Rofocale may be demons, but they have the motivation to follow their goals. Father-Kun's been lost ever since he's gone to hell. But now he has a goal: see Imuri happy again.\n\nI'm sure that meal Father-kun made was delicious. Good on Rofocale for muting the sounds of pleasure, he can see that Father-kun does not like that.",
            "score": 22,
            "replies": [
                {
                    "author": "Lee-Nyan-PP",
                    "body": "Virgil needs the power of a Miracle to bring Dante back to life, and the only demon who has Divine Power in hell right now is Beelz",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "kung63",
            "body": "Didn’t expect to enjoy the trio this much. \n\nSo Vergil gonna teaming up with Father-kun to save Dante.\n\nI do wonder whatever the witches got a piece of Bel body part.\n\nAlso I kinda want the artist to draw a yuri doujin for no particular reason.",
            "score": 53,
            "replies": [
                {
                    "author": "Matrix_2k00",
                    "body": "They’re in the wrong layer though if they want to save Dante since he’s in Sloth layer.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "NonoKuma",
                    "body": "Ooo a team up would be great! I wanna assume that power to heal is probably a one time use. Mr.Priest might  have to fight marco after their alliance, and be forced to decide between saving his teacher or his lover. On top of dealing with his new found friendship with marco.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "kramsibbush",
                    "body": "need a doujinshi with mommy Leviathan, don't you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yamigosaya",
            "body": "while i hope father gets to find a way to heal imuri, im also hoping that father wouldn't be so forgiving and actually demand the truth from imuri. \n\nalso i have a feeling the new guy is gonna die",
            "score": 13,
            "replies": [
                {
                    "author": "CorrectFrame3991",
                    "body": "I agree with what you said about the priest and Imuri.\n\n  \nWith the new guy, I have heard some people making theories that he could potentially end up being Lucifer himself, with Lucifer and the new guy being in a Diavolo-Doppio situation. I'm not sure how likely that it is, but it could be interesting.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Teymarofc",
                            "body": "But this kind of betrayal has already happened in the Asmodeus school arc, he makes a new friend and then suddenly betrays you, in fact he is the enemy, this has already happened, it is probably just Lucifuge Rofocale, Prime Minister of Hell.\n\n\nThe name \"Lucifuge\" comes from the Latin words lux (light) and fugio (to flee), giving the name the meaning of \"one who flees from the light\" or \"one who worships the absence of light\". Rofocale, in turn, is an anagram for \"Focalor\", the name of another demon. According to other sources, the origin of \"Rofocale\" is closely associated with the very nature of Lucifuge. Just as Lucifuge is the inverse of Lucifer (Latin for \"light-bearer\"), so the name \"Rofocale\" is derived from \"Lucifer\" reversed - that is, \"Reficul\".",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ancient-Cow-7221",
            "body": "I love this trio so much. They all blend in together quite well, More chapters with just 3 of them or a spinoff series with all 3 of them actually. When Priest remembered Imuri and an image of her eating, I was holding back tears bro. Vergil is here, honestly I expect to be in the next chapter. It took me abit of a surprise as well.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Xatu44",
            "body": "Congratulations on your new big brother, Father-kun.  Rofocale really can't handle those succubi lol.  Double lol at him shielding Father-kun from the orgy.  I got a good chuckle from Mr. Priest kebabmaxxing but him missing Imuri made me sad.  He truly does love her.  And now Verge is back to further round out this strange party.  It's sad seeing Golem's skeleton in Beelzebub's Gehenna.  \n\nI wonder if Mr. Priest's inability to use angelic powers is a solvable issue given that Lucifer and Beelzebub can.  Maybe it's a mental thing or there's a spiritual trial he can go through.",
            "score": 10,
            "replies": [
                {
                    "author": "AiraIchigo",
                    "body": "Given that Lucifer can still use his angelic power despite being a fallen one, that might be a hint to the solution for Mr. Priest regaining his power.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ZayYaLinTun",
                            "body": "Considering lucifer is pride and still have angelic power\n\nmaybe father need more pride and confidence in himself ?he is always in depression like 99% of time",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dagreenman18",
            "body": "Now we got Vergil riding through hell. So we get a little more Inferno. \n\nAnd already e’re getting emotional progress for Father-kun. Loving the hell out of the Therapy/“Father-kun’s Bogus Journey” arc.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Backupusername",
            "body": "Well, shit. Vergil's here. Almost certainly because he wants to save Dante. If two people approach Beelzebub at the same time asking for his help, I think I know how he'll react. \n\nHe's going to pit them against each other. Only one of them will receive his aid. The priest will have to kill Vergil and let Dante die in order to save Imuri.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Chang-San",
            "body": "The witches ane demons know how to party, Priest should just stick with them honestly",
            "score": 8,
            "replies": [
                {
                    "author": "gokogt386",
                    "body": "All fun and games until one of them tries to rape him again",
                    "score": 3,
                    "replies": [
                        {
                            "author": "KingEmperorLordHope",
                            "body": "It'll be fine! All the demons would know how bad of an idea that is now given how often he has killed Asmodeus by now. It would be like trying it on her by this point.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrWaluigi",
            "body": "I’m enjoying Mr. Priest’s demon friends/acquaintances in this journey. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "LupusZero",
            "body": "Well that's quite a moltey crew they got assembled, ofc Vergil wants to tag along, he needs Father to help him collect Lucifer's ~~dragon ball~~ fragment. \n\nInteresting though that Father didn't really bat an eye at succubus lesbian orgy, ig he is now much better at dealing with erotic stuff, or at least after last arc deals better with his trauma over it.",
            "score": 8,
            "replies": []
        },
        {
            "author": "ZayYaLinTun",
            "body": "Ngl father missing imuri remaind me of omni man and egg man i miss my wife thing\n\nLet my boy be happy i don't think he even have like 5 chapter of him actually being genuinely happy for entire manga",
            "score": 7,
            "replies": [
                {
                    "author": "Matrix_2k00",
                    "body": "The last time he was genuinely happy was when he went bowling ironically",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Namaryu",
                            "body": "That chapter was not called \"The Final Tranquility\" for nothing.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RulerKun_FGO",
            "body": "oh shit I forgot Father-kun didn't knew about what happened to Dante",
            "score": 7,
            "replies": []
        },
        {
            "author": "dalasthesalad",
            "body": "This must be what a Slaanesh ritual looks like, probably would have more murder though",
            "score": 7,
            "replies": []
        },
        {
            "author": "swoozes",
            "body": "Asmodeus is strangely missing in all these going ons.",
            "score": 5,
            "replies": [
                {
                    "author": "Xatu44",
                    "body": "She's watching Imuri, no?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "EricaSome",
            "body": "And Father-kun slowly starts to lie to himself a little less.. Hellish Therapy MODE ON",
            "score": 3,
            "replies": []
        },
        {
            "author": "LeonKevlar",
            "body": "A festival full of food and booze and then an orgy? Maybe entering hell ain't so bad after all. \n\nSurprisingly though this entire trip to the hells seems to be doing wonders for Father-kun's psyche. Catherine and Rofocale have been great allies so far. I hope they stick around...\n\n....they're gonna die, aren't they?",
            "score": 4,
            "replies": [
                {
                    "author": "Namaryu",
                    "body": "Is it possible for them to die, like, permamently?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "_legna_",
                            "body": "Rofocale himself said that the fact they are not \"dead\" as Lucifer has not purified the Gehenna\n\nI guess it's safe to assume in this case it would be truly death, the death as the soul's level",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nunbrot",
            "body": "Now it gets interesting with Vergil on their side. \n\nNice ritual btw",
            "score": 7,
            "replies": []
        },
        {
            "author": "KingEmperorLordHope",
            "body": "It's not fair! Why is Mr. Priest the one in the Gehenna of Asmo?! It should have been me!\n\nAlso I have to say I had a feeling Lucifer would still be an angelic state. This is really hyping him up a bit because it implies not even hell is enough to corrupt him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Wishbone-Lost",
            "body": "Besides me wishing I was in the orgy. The priest finally knows what exactly he wants, and we get to see if Dante alive or not. I think he's alive.",
            "score": 3,
            "replies": []
        }
    ]
}