{
    "title": "Happened for real",
    "author": "Marwan_hbt8",
    "subreddit": "dankmemes",
    "rank": 12,
    "score": 8021,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 104,
    "url": "https://i.redd.it/8vjsaayfvape1.jpeg",
    "id": "1jdl5w9",
    "selftext": "",
    "comments": [
        {
            "author": "dranoel058",
            "body": "Clean your port. Its most likely dust in it",
            "score": 872,
            "replies": [
                {
                    "author": "joran213",
                    "body": "Eventually that stops working. My previous 6 year old phone could only charge in a specific angle, no matter how often i cleaned the port.",
                    "score": 347,
                    "replies": [
                        {
                            "author": "dranoel058",
                            "body": "I've had the same issue. But usually a good clean and a fresh cable makes it last longer. Everything has a lifetime, but atleast usb-C has a better lifetime than many others ive used",
                            "score": 199,
                            "replies": [
                                {
                                    "author": "DonChilliCheese",
                                    "body": "So when it starts to connect worse it's better to clean it and get a new cable? All of my phones died like this, the ports just got worse and didn't connect anymore",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "author": "llamajo",
                                            "body": "If you don't clean it, then all the wiggling and pushing necessary to get it to charge \"at a specific angle\" stresses the port and can damage it.",
                                            "score": 66,
                                            "replies": [
                                                {
                                                    "author": "DonChilliCheese",
                                                    "body": "Thanks. I wish I knew that before. Any specific tips for how often to clean and how without damaging it?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "PM_me_ur_launch_code",
                                                            "body": "You should use something non conductive but I've had great success with using a small sewing needle/pin. I filed down one side so it's thinner. It gets into the port and makes it easy to get the dust/lint out.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Financial_Fee1044",
                                                                    "body": "A flat wooden or plastic (rigid ones, not the bendy ones) toothpick works for me.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "backturn1",
                                                            "body": "I cleaned my old phone whenever it didn't charge properly (because the cable couldn't go in all the way) and also used a needle. Some say you should use something non conductive, but it didn't damage my phone, even though I touched the part in the middle with the needle. Just use something that is thin enough to fit in there.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "littleSquidwardLover",
                                            "body": "Use wireless charging as a backup",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "DonChilliCheese",
                                                    "body": "I've done it with my last phone for the last 2 years when it was my only option and this also made me only buy phones with Wireless charging. I can't imagine my phone just dying because of that",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "iwilldeletethisacct2",
                                            "body": ">All of my phones died like this\n\nThe charging port can be replaced by a repair shop when it eventually gives up. You could also replace it yourself, depending on your level of skill and handiness.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Megaf0rce",
                                            "body": "Depending on your phones manufacturer you may be able to just replace the USB-Port of your phone. I recently did that with my redmi note 10 pro and paid 32€ for a new usb-c port and a new backglass (old one had cracks). The repair was pretty straightforward and you can find teardown videos for pretty much any phone out there. Took me like 30 minutes to do",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheTrueTrashGoblin",
                            "body": "Probably because your instinct was to bend it and break the solder anchors instead of fixing the thing blocking it. Or it was micro usb. Fuck micro usb",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "sciencesold",
                            "body": "Fresh cable then, the port itself should be rated for roughly 10k mating cycles. Even at 2 cycles a day that's over 13 years.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "bakatomoya",
                                    "body": "My phone gets plugged and unplugged at least 10 times a day.  I have a charger on the couch and I plug it in every time I sit there to charge a bit, I have a charger at my desk, one by my bed.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Charliep03833",
                            "body": "I have 7 years old phone and cleaning the port made it from barely holding the charger to snapping in like new. \n\nEdit: You probably weren't gentle enough and damaged connectors inside your port.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alive_Ice7937",
                    "body": "Title of your sextape",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FlameShadow0",
                    "body": "YES OP. And don’t clean it yourself! Take it to a repair shop! We use special anti static tweezers to clean out the ports. You can blow and blow in there all you want but you’re not gonna get anything out unless you dig. This is why it’s possible to damage your port doing this. Bring it to a shop, we clean them out all the time",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Dyslexic_Engineer88",
                    "body": "Pocket lint collection in my USB port.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MicrowavedTheBaby",
                    "body": "Eventually that stops working",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "toilet_destroyed",
                    "body": "100% this was the case for me. The lint from my pocket would get in there then the charger would pack it further. The pointy plastic part from floss sticks work perfect to clean it out.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheMatt561",
                    "body": "I get it cleaned about every 6 months",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "The_BeardedClam",
                    "body": "Depends on what kind of dust. I work as a machinist and the iron I work with gets pulverized and turns into dust. That dust gets into my pockets and gets into the port, causing it to not charge. Good luck getting that iron dust out of your charging port once it's in there.\n\nI now use the highly advanced method of putting a piece of electrical tape over the charging port while I'm at work and voila a 100% clean charging port.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "imetators",
            "body": "POV lost its meaning long time ago",
            "score": 368,
            "replies": [
                {
                    "author": "FHFH913",
                    "body": "Most of the time they dont even need to write it lol",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "AskinggAlesana",
            "body": "**CORRECTION**\n\nPOV: You are looking at the person who just found out their phone doesn’t charge unless at a specific angle.",
            "score": 220,
            "replies": [
                {
                    "author": "luxusbuerg",
                    "body": "POV: You're watching breaking bad S2E11",
                    "score": 58,
                    "replies": []
                }
            ]
        },
        {
            "author": "Obeserecords",
            "body": "Downvote for misuse of pov",
            "score": 40,
            "replies": []
        },
        {
            "author": "doubletimerush",
            "body": "Wireless charging is your friend here. ",
            "score": 76,
            "replies": [
                {
                    "author": "Marwan_hbt8",
                    "body": "Its slow",
                    "score": 28,
                    "replies": [
                        {
                            "author": "lvl999shaggy",
                            "body": "Slow is better than nothing",
                            "score": 46,
                            "replies": []
                        },
                        {
                            "author": "TrollCannon377",
                            "body": "I have. 50W wireless charger that charges faster than most of the wired chargers I have",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "SSMage",
                            "body": "I actually bought a wireless charger that charged my phone 30% in under an hour. It costs about 30 bucks tho",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "o_o_o_f",
                                    "body": "That’s still quite slow though",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AnOverloadOfDopamine",
                    "body": "I haven’t used a cord for my phone in years",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "straw3_2018",
                    "body": "Never had a phone with wireless charging... Cleaning the port is very successful and not hard",
                    "score": 2,
                    "replies": [
                        {
                            "author": "levian_durai",
                            "body": "Either that or replacing the cord usually does the trick. If it really is the phone though, that seems like a relatively cheap repair, likely just soldering on a new usb c piece.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Reasonable-Pear9122",
            "body": "Oh god why does that always happen?!",
            "score": 13,
            "replies": [
                {
                    "author": "Marwan_hbt8",
                    "body": "Your charge port probably broken",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Sprysea",
                            "body": "No, likely just clean your charging port. I work in tech and its 90% of the cause of this issue",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "The_BeardedClam",
                                    "body": "How would one clean out iron dust? I've tried compressed air, tooth pick with and without alcohol, etc. \n\nThe only thing I've found to work is get a new phone and put a piece of electrical tape over the port while I'm at work so no iron dust gets in there.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sprysea",
                                            "body": "Iron dust is a different subject. Maybe a magnet would work? \nBut for regular dust it is safe to use a hardened plastic or resin tool. About the same size as a SIM card removal tool.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sprysea",
                    "body": "Clean your charging port for dust first, if it still doesn't work. Then it's broken",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "A100921",
            "body": "Dirty port, or your cables probably just fucked. The reason you have to “bend the cord/phone to a specific angle” is because something is shorting out in the cable and you need to bend it to separate the connecting wires, or the port is so dirty that the connection can’t be made.",
            "score": 11,
            "replies": []
        },
        {
            "author": "FlameShadow0",
            "body": "OP, Take it to a repair shop! We use special anti static tweezers to clean out the ports. You can blow and blow in there all you want but you’re not gonna get anything out unless you dig. This is why it’s possible to damage your port doing this. Bring it to a shop, we clean them out all the time and normally the service is cheap.",
            "score": 5,
            "replies": []
        },
        {
            "author": "HollowKyo",
            "body": "This happens because yall always gotta be 2 feet farther away from the outlet than your cable allows and bending the cord at that angle ruins it. Seen it happen a hundred times.",
            "score": 2,
            "replies": []
        },
        {
            "author": "shogunreaper",
            "body": "I started using those magnetic chargers on my last phone like five or six years ago, keeps the port clean because there's always something in it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "modssssss293j",
            "body": "Time to clean the port",
            "score": 3,
            "replies": []
        },
        {
            "author": "Onuzq",
            "body": "My old laptop with a battery that didn't hold any charge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAlwaysLack",
            "body": "I just had this happen to my phone and I tried cleaning the charging port out myself to no avail. As a last ditch effort before trading it in I took it to a phone repair shop near me and asked them what the problem might be. The dude takes it in the back and cleans it with professional tools and brings it back to me working like it's brand new. I don't know what tools they have but take it to a professional and be amazed. Cost me about 30$ altogether and I couldn't be happier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squirchy707",
            "body": "Had this happen and just swapped to using wireless chargers. Downside, a pain to use in the car/on the go. Currently got a new phone and barely used the port to help it last for the car times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DayneTreader",
            "body": "Get it repaired, and be nicer to it this time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "___Skyguy",
            "body": "It's so cheap to get a charging port replaced, and they cost pennies if you know how to do it yourself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Papagiorgio_",
            "body": "Wrap the chord over the top and back underneath to keep that tension boiiii",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet_Xocoatl",
            "body": "Literally just got new cables today.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cjmate22",
            "body": "Check if your charging port is full of lint and remove it, then check again. If it persists then pray it’s just the cord.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fractoman",
            "body": "Just swap out the port, if you're okay with working on your own phone. I did with my old phone and got another 3 years out of it before I replaced it after using it for over a decade.",
            "score": 1,
            "replies": []
        },
        {
            "author": "baylithe",
            "body": "That's why you make sure you get a phone that can wirelessly charge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bit_in_the_ass",
            "body": "Thank God for wireless charging",
            "score": 1,
            "replies": []
        },
        {
            "author": "rafikiknowsdeway1",
            "body": "wireless charger is the move here",
            "score": 1,
            "replies": []
        },
        {
            "author": "Globbas",
            "body": "Real (Its all taped up now)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Dust1871",
            "body": "This happens with listening to music for me, not charging.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Theghost129",
            "body": "solution 1: Battery case.  It's basically a charging port condom.  The battery is also good for 200% battery life\n\nsolution 2: replace the charging port itself.\n\nsolution 3: mix use wireless charging during the life of your phone, don't wear it away",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Credibility",
            "body": "Wireless charging my guy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arqideus",
            "body": "Cleaned my port \"professionally\" 3 times with my last phone.  The port broke, but it cost me $10 and a week of waiting for the part to fix it.  I didn't want to ever have that problem again so I bought a wireless charging phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rezporga004",
            "body": "Why am i meth?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ali33x",
            "body": "I had this problem and kept trying to clean it following online advice but nothing worked and at the end I took it to someone and they said it was just because it got damaged from being dropped and needed some internal fixing",
            "score": 1,
            "replies": []
        },
        {
            "author": "das_zilch",
            "body": "*tfw",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hacka4771",
            "body": "Was like that for 2month, I kept refusing fixing it; Worst mistake",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatpainLeghatsenia",
            "body": "Even though wireless charging doesn't have many followers this is my reason why I like it as a main charging option. The USB port is almost as new even when the phone is many years old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SolidUSnake05",
            "body": "Tooo real",
            "score": 1,
            "replies": []
        },
        {
            "author": "bocksington",
            "body": "remote charging",
            "score": 1,
            "replies": []
        },
        {
            "author": "salkin_reslif_97",
            "body": "So the POV is from the phone, I suppose? Or does your phone look like Walter White?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zestyclose-Leave9781",
            "body": "Ngl man, the reason how i fixed this for my ipad was because of the charging cable itself not my charging port.",
            "score": 1,
            "replies": []
        },
        {
            "author": "plaguedbullets",
            "body": "You got a Pixel? Pixels seem to do that eventually, even with dust in there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeluStarOne",
            "body": "Happening to me rn",
            "score": 1,
            "replies": []
        },
        {
            "author": "WiseBelt8935",
            "body": "it was at this point i bought a Nokia",
            "score": 1,
            "replies": [
                {
                    "author": "sylvelk",
                    "body": "Actually my only phone that had this issue was a Nokia (7 Plus). You can imagine the disappointment...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Machine_94",
            "body": "Get a toothpick and clean the port out, don't worry, you won't damage anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NRichYoSelf",
            "body": "Just got a new phone upgrade since 2019 because of this.\n\nCleaned it and tried new cables, was tired of it and didn't want to try and repair it.\n\nIt's nice being on a new platform that I expect another 5-6 years out of",
            "score": 1,
            "replies": [
                {
                    "author": "FlameShadow0",
                    "body": "Did you take it to a repair shop? A lot of time when the port gets real dirty and compacted, you have to literally dig the dust out with some anti static tweezers.  Blowing it out does nothing. \n\nI see this issue at my shop all the time.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NRichYoSelf",
                            "body": "I didn't if I were to repair it I would have replaced the port.\n\nI got tools specifically to clean it and did a thorough job. It was quite disgusting, years of gunk build up. In the end, it wasn't the angle, but the plugs couldn't grab on to hold the charger in place. It charged just fine, but there was no resistance and any slight movement would take the cord out of the port",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "stnrxop",
            "body": "Yeah, but Satan is the one that leads you to be sinful just so he can punish you. So yeah, he is evil",
            "score": 0,
            "replies": []
        },
        {
            "author": "TrollCannon377",
            "body": "Behold the power of my 50W wireless fast charger",
            "score": -1,
            "replies": []
        }
    ]
}