{
    "title": "I freaking love mushrooms.",
    "author": "Educational-Bowl9317",
    "subreddit": "Cooking",
    "rank": 12,
    "score": 127,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 98,
    "url": "https://www.reddit.com/r/Cooking/comments/1jdw0ca/i_freaking_love_mushrooms/",
    "id": "1jdw0ca",
    "selftext": "I don’t know what it is lately but I am obsessed with mushrooms. I could eat a bowl of them and be so happy!!! Ive made them with garlic and onions and some other seasonings and it’s great but I’d like some suggestions on other recipes. What are some other ways I can make mushrooms or delicious dish containing mushrooms? ",
    "comments": [
        {
            "author": "ttrockwood",
            "body": "Soy sauce + butter + mushrooms = magic\n\n\nUse the mushroomy soy buttery sauce from cooking them together over your rice. I add some pan fried tofu and it’s an awesome fast meal",
            "score": 27,
            "replies": [
                {
                    "author": "infinitetheory",
                    "body": "swap the soy with some Lea & Perrin's Worcestershire and put it over hash browns and cheese inside a crunchwrap, one of my favorite breakfast foods. sometimes I'll add Tony Chachere's or Lawry's or Old Bay or habanero Tajin too",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ttrockwood",
                            "body": "Ooooh i do love some old bay.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kwpang",
                    "body": "And garlic.\n\nMinced garlic in melted butter in moderately hot pan, keep an eye out for browning. Once the butter starts browning barely, splash of soy sauce in to caramelise in hot butter and to cool it off.\n\nThen mushrooms in quickly to absorb the sauce.\n\nGoes excellently with rice. If it's too salty, cook a sunny side up egg and put the mushroom over it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "know_comment",
                    "body": "any variation of fat/butter or oil + mushrooms + acid + salt. Sauteed.\n\nThe acid could be: soy sauce, Worcestershire, lemon juice, wine, vinegar, etc \n\nFor extra points, add an alium (garlic, onions, green onions, scapes, chives, leaks, etc).\n\nMy favorite in the spring is foraged mushrooms (chanterelles/trumpets, morel) and ramp butter, and lemon.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "scotty____j",
                    "body": "I’ve had good success with this recipe. Have tried with king oyster, shimeji, maitake: https://thewoksoflife.com/soy-butter-glazed-king-oyster-mushrooms/",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PomegranateCool1754",
                    "body": "Worcestershire sauce is better",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "butterbal1",
                    "body": "Same concept but swap soy sauce for beef or even veggie bouillon.  \n\n\nSame salty goodness but with the extra beefy deliciousness to make them just a little sticky and all the umami.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chemical_Octopus",
            "body": "Hungarian mushroom soup",
            "score": 19,
            "replies": [
                {
                    "author": "SunnyOnSanibel",
                    "body": "Can you drop a recipe?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Chemical_Octopus",
                            "body": "[https://themodernproper.com/hungarian-mushroom-soup](https://themodernproper.com/hungarian-mushroom-soup)",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Tempy81",
                                    "body": "Mushroom soup is my top pick always",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SunnyOnSanibel",
                                    "body": "Ty!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "skyrymproposal",
                    "body": "Fave!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AttemptVegetable",
            "body": "Have you tried morels? They're super expensive but so good",
            "score": 12,
            "replies": [
                {
                    "author": "trevorroth",
                    "body": "We get all kinds of them in spring. A couple years ago we collected enough for like 5 years.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RCG73",
                            "body": "5 weeks of morels you say ?   \n\nMy dad showed me the best way I’ve found to keep morels.  Clean and pat dry.  Dip in milk   Dip in flour/seasoning/cornstarch mixture.  Lay on a sheet try lined w wax paper. Freeze.  Store in a freezer bag afterwards.    Fry direct from frozen until gbd.   Make pan gravy, serve.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "trevorroth",
                                    "body": "We dehydrate them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Educational-Bowl9317",
                    "body": "I have not, just looked them up. They look very intimidating 😭 would love to try them though, maybe I’ll try looking for some",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "scornedandhangry",
            "body": "My sister and I used to sautee mushrooms in butter and eat them as an after school snack with toast. mmmmm",
            "score": 7,
            "replies": []
        },
        {
            "author": "jaCkdaV3022",
            "body": "They certainly are good in stroganoff!",
            "score": 6,
            "replies": []
        },
        {
            "author": "TrailBlanket-_0",
            "body": "Spring is coming, and that means morel season. You can potentially find hundreds of dollars worth of choice edible mushrooms.\n\n\nThey are only around for about 2 months a year - in late March to late May. Once soil temperatures are at 50 degrees for 3 consecutive days, then it is officially morel season.\n\n\nMorels are mycorrhizal mushrooms, meaning they grow on roots of trees. As the forest is coming out of hibernation, these mushrooms use this time for some reason to reproduce. It's a mystery why, with some theories being the electrical signals firing off in the trees during blooming season may trigger something. I just don't know and it's magical.\n\n\nIt's a blast finding them. It's really hard, until it's not. Finding the first one is always difficult, and then once your eye catches it in person, then you're locked in on more and they just appear to you. Easter egg hunts aren't just for kids.",
            "score": 7,
            "replies": [
                {
                    "author": "bigcoffeebuck_gb",
                    "body": "I used to live in Wisconsin and I loved hunting for morels. I looked forward to it all year. My kids still live there and love it as much as I did.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "professional-yapper-",
            "body": "i love stuffed mushrooms (also very cute), can keep it simple with black rice or panko + parmesan and herbs. I love roasted mushrooms on top of labneh or hummus too. You can also make filled pastries, mushroom risotto, pasta... or season and dehydrate them (with seasoning) as a snack! Teriyaki mushrooms are amazing with rice, and I love making mushroom stock to drink as is too (dehydrated mushroom work very well as the process breaks their cellulose cell walls if i am not mistaken and releases more flavor compounds). You can also make shroom burgers (lengthy but amazing, esp if you make the bread buns too! king arthur's recipe is amazing). Korean cuisine has amazing mushroom recipes!! As an italian i of course adore mushrooms and we also have plenty of recipes since we have many in italy and there is a huge interest in foraging them :) if you love mushrooms try a truffle oil (since they are still mushrooms) to drizzle on top of your roasted mushrooms!",
            "score": 6,
            "replies": []
        },
        {
            "author": "flamberge5",
            "body": "I love making omelets with sauteed mushrooms and Swiss cheese!",
            "score": 4,
            "replies": []
        },
        {
            "author": "seafoam4015",
            "body": "Mushroom stroganoff is so good. Alton Brown has a great recipes thats one of our favorites.",
            "score": 3,
            "replies": []
        },
        {
            "author": "squatsandthoughts",
            "body": "I also love mushrooms but I developed an allergy as an adult. Things I used to love that have mushrooms:\n\nStroganoff and many other pasta dishes. This is one of my faves:\n\nhttp://chefpablos.com/recipe/the-cheesecake-factory-pasta-da-vinci-recipe/\n\nLots of Asian recipes have mushrooms, mushroom sauce, mushrooms in the broth, etc. So many good ones. A lot of people don't realize this if it's sauce or broth based because the sauces don't have mushrooms chunks but they have that good umami flavor. This also includes noodle dishes like Pho and Ramen if that's your jam. Stir fries are good with mushrooms...lots of things. \n\nPizza... pepperoni and mushroom was so good! \n\nSauteed mushrooms and steak, or on burgers\n\nDon't forget truffle oil on basically anything lol. I am very allergic to truffle and I know there are debates about whether it is a mushroom or fungus or something. To me it's all the same because I have the same reaction. The last time I was exposed it was truffle oil in mashed potatoes. And yes, it was good! I didn't know it was in there though. Truffle + potato or pasta seems to be very popular.\n\nUnrelated to food but you can find mushrooms in so many things these days - coffee, skincare, makeup, hair products, even packaging. Fun times.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Wrong-Tell8996",
            "body": "FABLE MUSHROOMS!  \nI'm not vegetarian but they legit taste like meat. So good.  \nAlso if you like mushrooms, you probably will truffle. Not cheap stuff, but try getting some truffle salt. A little goes a long way. Or getting truffles cheeses, such as moliterno al tartufo, and shaving on top.",
            "score": 2,
            "replies": []
        },
        {
            "author": "whisperingcopse",
            "body": "[I think this is delicious](https://www.theoriginaldish.com/2021/03/19/lemony-mushroom-mascarpone-toast-with-beans-herbs/) it’s a fancy mushroom toast recipe",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cfutly",
            "body": "[Braised shiitake mushrooms w/ bok choy](https://www.madewithlau.com/recipes/braised-mushrooms-with-bok-choy)",
            "score": 2,
            "replies": [
                {
                    "author": "foreveronthecoast",
                    "body": "Yesss. Have it with rice or add noodles. Yummmy!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hap427",
            "body": "Chicken Marsala is great. Mushroom and garlic pizza is my go to. I love mushrooms!",
            "score": 2,
            "replies": []
        },
        {
            "author": "fusionsofwonder",
            "body": "I like mushroom risotto.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BreakQuick9884",
            "body": "I fully agreed but then realized I was in a cooking sub. Still agree. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "NVSmall",
            "body": "I *wish* I liked mushrooms 😢\n\nI don't eat meat, and mushrooms are often used as a sub, but I just can't get on board with the texture. I LOVE the smell of mushrooms sauteed in butter, but that's where it ends....",
            "score": 3,
            "replies": [
                {
                    "author": "Lollc",
                    "body": "Many people are sensitive to mushrooms. Sometimes when food grosses you out with the texture, it's because it makes you feel bad and you associate the texture with the feeling.  I put mushrooms in a lot of things but on the rare occasions I cook for company I ask about mushroom allergies specifically.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "inchling_prince",
                    "body": "I used to feel that way, and then I realized I just really hate button/portobello mushrooms.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Educational-Bowl9317",
                    "body": "I actually used to feel that way too!! Because of the soft mushy texture they can get. I found with age though that completely changed",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Momtotwocats",
            "body": "I don't care for mushrooms myself, but I'll give them a good coating of Uncle Tony's cajun seasoning and sautee them in olive oil. When they're done, I serve them by themselves or turn them into a taco filling. My husband loves them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stronk_Magikarp",
            "body": "I just got a giant mixed container of dehydrated mushrooms! Could be something you could try if you haven’t before, you rehydrate them before cooking them and they last a really long time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xylene_442",
            "body": "I think one of the best things you can do is just learn to make a very basic sauteed mushrooms and then use THAT as a base in other things.   It sounds like you are past that point, so:\n\nthe mushrooms can easily be the star in a taco with grilled onions and salsa verde.  Or as the sidekick with hamburger steak and gravy.  Or you can be creative and make a dark pasta dish with mushrooms and black beans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Malisandr3",
            "body": "sauted mushroom supremacy!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salt-Scallion-8002",
            "body": "Miso butter shitakes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lower_Stick5426",
            "body": "Sautéed mushrooms on garlic bread is a favorite component of the “snacky dinners” that my husband and I have from time to time. \n\nOtherwise, I love mushrooms in Japanese curry over rice as a comfort food. I’ll also sautee some bok choy to go with it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BreakingPipes",
            "body": "Mushroom Swiss burger,  sliced up in a salad, fried mushrooms, mushroom gravy off the top of my head.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StanislasMcborgan",
            "body": "This recipe allows you to play with different combinations of mushroom types and develops a beautiful mushroom broth that takes my love of mushrooms to new heights, I cannot recommend it highly enough: https://cooking.nytimes.com/recipes/1020122-spicy-noodle-soup-with-mushrooms-and-herbs",
            "score": 1,
            "replies": []
        },
        {
            "author": "DocumentEither8074",
            "body": "Stuff mushroom caps with chopped mushroom stems and Italian sausage. Bake at 350 for 15-20 minutes or until sausage is cooked through. Add your favorite cheese  on top and heat until melted or zap under the broiler.  Cool a bit before serving.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoldyWolf",
            "body": "I use them for veggie tacos, great protein replacement and still has a meaty flavor paired with some taco seasoning or adobo you wouldn't even notice the difference",
            "score": 1,
            "replies": []
        },
        {
            "author": "Squirrelishly",
            "body": "My husband and I love mushrooms, too! The link below is one of our favorites when we want a lot of mushrooms. It's traditional German Christmas Market food, we have never been, but we heard about it and wanted to try it. Make the garlic dipping sauce a few hours or a day before if you can, so much better. It's still great if you don't, though! I hope you find tasty recipes \n\nhttps://alltastesgerman.com/fried-mushrooms-garlic-sauce/",
            "score": 1,
            "replies": []
        },
        {
            "author": "crow1992",
            "body": "tempura fried ❤️ yum. with a good mushroom broth",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bearded1Dur",
            "body": "Try this. I use puff pastry on top. It's the bomb \n\nhttps://www.kitchenstories.com/en/recipes/brick-fire-mushroom-cobbler-16dc",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmurphJ",
            "body": "Have you battered and deep friend oyster mushrooms? Must try. Dip in your fave ranch, blue cheese, or other fried chicken dip! 🤤",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrauntChristie",
            "body": "Same! My fave is to sauté them in a little butter and olive oil with just a touch of salt. So good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Row882",
            "body": "Duxelles, Mushroom stocks, deep fried oyster mushrooms with remoulade. \n\nIf you love mushrooms, definitely make this. It’s amazing. \n\nhttps://honest-food.net/chanterelle-soup-recipe/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Taintedh",
            "body": "Penne a la vodka with fried mushrooms. Many, many mushrooms. It's incredible",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazy_Kale_9722",
            "body": "My MIL makes delicious stuffed mushrooms with cream cheese, Worcestershire sauce, green onion, bacon, and garlic. Had to ask her for the recipe for this and in her words “it’s a flavor explosion!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "CompoteDisastrous848",
            "body": ">!same!<",
            "score": 1,
            "replies": []
        },
        {
            "author": "_bydarwinsbeard",
            "body": "Try roasting them with parmesan, tossing them in a creamy pasta, or stuffing them with cheese and herbs. And don’t sleep on a good mushroom soup - hits different",
            "score": 1,
            "replies": []
        },
        {
            "author": "arnoldusgf",
            "body": "Use mushrooms and chicken to simmer together, you can taste very fresh chicken soup",
            "score": 1,
            "replies": []
        },
        {
            "author": "GalvestonIslandSpice",
            "body": "Mushrooms are seriously underrated—they soak up flavor like nothing else! If you haven’t tried balsamic roasted mushrooms, you’re missing out. Toss them with olive oil, balsamic vinegar, garlic, and a little thyme, then roast until they’re caramelized and juicy. Also, a good mushroom risotto is next-level comfort food, especially with a bit of parmesan and white wine. And if you’re feeling indulgent, sauté them in butter and heavy cream with a splash of brandy for a rich mushroom sauce over steak or chicken. What kind of flavors do you like best?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elephant789",
            "body": "[zapiekanka](https://www.google.com/search?client=firefox-b-d&q=zapiekanka)",
            "score": 1,
            "replies": []
        },
        {
            "author": "pekak62",
            "body": "Miso. And Sake.\n\nTry enoki, king oyster, baby king oyster mushrooms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pindoocaet",
            "body": "Vegetable soup with mushrooms and other veggies would be delicious!",
            "score": 1,
            "replies": []
        },
        {
            "author": "bnny_ears",
            "body": "Surprisingly, even though I love mushrooms on pizza, I've *just* made the discovery that mushrooms in tomato based soups *rock*. If you use dark ones, they make the color ugly as sin but totally worth it.\n\nI love bastardized baked beans with sauerkraut, a great deal of onions, (smoked) sausage, and mushrooms. Some apple cider vinegar and you're done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Absinthicator",
            "body": "Philly pepperjack cheese steaks, mushroom and gruyere omlette, Beef Stroganoff, Beef bourguignon, sausage bacon cheese stuffed mushrooms, Portabella vegie burger, mushroom swiss cheese meatloaf, Chicken Fricassée. dm for recipies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "__nothing2display__",
            "body": "Mushroom risotto but start with dried porchinni",
            "score": 1,
            "replies": []
        },
        {
            "author": "wharleeprof",
            "body": "The best sandwich in the world:\n\n1. Cook up your mushrooms with onions and garlic (and salt and pepper)\n\n2. When the mushrooms are done, add some Monterrey Jack cheese and let it melt\n\n3. Lightly toast 2 slices sour dough bread, spread the mushrooms/cheese mixture over the bread\n\n4. Optional: add sliced avocado (salt to taste)",
            "score": 1,
            "replies": []
        },
        {
            "author": "based_prettyawsm",
            "body": "Yep, duck breast, soy sauce, mushrooms all thrown into a airfryer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Lab8266",
            "body": "Vodka sauce!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Lab8266",
            "body": "https://cookingwithawallflower.com/2018/04/19/mushroom-pasta-alla-vodka/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lollc",
            "body": "Coarsely cut into chunks, toss with olive oil, sprinkle with salt or your favorite seasoning blend, cook in oven at 425 for 20 minutes, use convection setting if your oven has it.  Bonus-this is cooked hands off while you cook other things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KyWayBee",
            "body": "I like pan-frying or grilling a big portobello mushroom, and then serving it with a nice garlic sauce or hummus. Works great as a main dish.\n\nQuick tip: before cooking mushrooms, soak them in a bowl of water for 5 minutes. This will keep them plumper and juicier, and prevent them turning limp and shrunken, plus they won't suck up as much of the oil in the pan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "butterbal1",
            "body": "My absolute favorite is to slice them and toss into a frying pan and cook till there is no more water in the pan and then add butter and beef bouillon.  \n\n\nNever in your life have you tasted sauteed mushrooms this tasty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "call_me_orion",
            "body": "Go to an asian supermarket and get some enoki mushrooms! They're delicious poached in broth or battered and fried, and not quite like any more common western mushrooms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bex_nh",
            "body": "My favorite is to break apart a maitake mushroom and sauté it with butter & olive oil, salt & pepper until they’re just barely crispy. Sometimes I’ll just eat this for dinner!\n\nI used to get them at Wegman’s but they’ve gotten smaller and smaller and more and more expensive. But I found them at Lotte Market and they are always perfect and fairly priced!",
            "score": 1,
            "replies": []
        },
        {
            "author": "uzochiJ",
            "body": "Same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thesorus",
            "body": "Ottolenghi's spicy mushroom lasagna.",
            "score": 1,
            "replies": []
        },
        {
            "author": "archedhighbrow",
            "body": "Marinate sliced mushrooms in Italian dressing, spread on bread, make a sandwich, butter both sides and grill.  Sourdough is tasty with this sandwich.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ruinsofsilver",
            "body": "[mushroom biryani](https://www.indianhealthyrecipes.com/mushroom-biryani-recipe/#wprm-recipe-container-38336)",
            "score": 1,
            "replies": []
        },
        {
            "author": "erikisst88",
            "body": "I add mushrooms to nearly everything I cook whether the recipe calls for it or not! Every pasta dish, eggs, soup, salads, anything with veggies like stir fry.\n\nHere are two of my fav mushroom recipes: The first one is a fav cuz it incorporates mushrooms for breakfast. The second is just fantastically delicious and worth the bit of effort. \n\n[Mediterranean Breakfast Bowls](https://www.themediterraneandish.com/breakfast-bowls/#wprm-recipe-container-41778)\n\nRoasted Teriyaki Mushrooms and Broccolini with Noodles \n\nMushrooms:\n\n3 8 oz containers of baby bella mushrooms \n\n1-2 Tbsp high heat oil \n\n1 tbsp rice vinegar\n\n2 tbsp soy sauce\n\n1 tsp ginger, grated\n\nMix ingredients together and roast at 425 degrees for 15 min. Stir and cook another 15 min. Set aside. (I use parchment paper on the baking sheet).\n\nVeggies and Noodles:\n\n1 package soba noodles (I use 2 packs frozen ramen) \n\n1-2 Tbsp olive oil\n\n2 cloves of garlic, sliced\n\n2 bunches broccolini (I use 1 head broccoli, chopped) \n\n1/2 onion, chopped (optional)\n\n1 red pepper, chopped (optional)\n\n10 oz spinach (optional)\n\nSaute all veggies minus spinach over high heat until crisp tender. Reduce heat and wilt in spinach, if using. Cook noodles to pkg directions. \n\nSauce:\n\n1/4 c soy sauce \n\n2 tbsp olive oil \n\njuice of 1 lemon \n\n1 tbsp sesame oil \n\n1 tbsp honey \n\n1 tsp Sriracha \n\n1 tbsp (or 2) gochuchang, optional \n\n1 tsp ginger, grated \n\nMix all together in a bowl. Combine veggies, noodles and sauce together. Top with mushrooms. \n\nAdditional suggested toppings: sesame seeds, green onion, jalepeno, chili oil, chili crisp",
            "score": 1,
            "replies": []
        },
        {
            "author": "throatslasher",
            "body": "Try to simmer them in some butter with thyme and balsamic, you will get amazing flavor. Or go creamy with a mushroom risotto. Stuffed mushrooms with cheese and breadcrumbs or in a creamy garlic pasta are win too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Distinct_Star9990",
            "body": "You're so real for this mushrooms are my all time favourite food - can't recommend slow roasted garlic portabello mushrooms enough (1hr - 1hr 20 at 180C)",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcceptableSpring6375",
            "body": "Make a rich mushroom sauce to go with spiced chips or to use as a sauce in your sandwich😩✨💙",
            "score": 1,
            "replies": []
        },
        {
            "author": "Constant-Security525",
            "body": "* Cream of mushroom soup or [Kulajda (another soup)](https://www.anediblemosaic.com/kulajda-czech-mushroom-soup/#wprm-recipe-container-50253)\n* Beef Stroganoff\n* Mushroom Risotto\n* Chicken or Beef Steak with Mushroom Cream Sauce",
            "score": 1,
            "replies": []
        },
        {
            "author": "RCG73",
            "body": "Alton brown did a mushroom stroganoff (swap the stock for a vegetarian version) that is my go to when I have mixed vegetarian/carnivorous guests to cook for.    Super satisfying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "plukhkuk",
            "body": "Curry mushroom are one of my favourites - I use the Japanese curry blocks and either cream or coconut milk. It's sooo good",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlkemyHD",
            "body": "Fried quickly in butter with salt and pepper till golden brown and served on steak or in an omelette is my favourite (bonus points for fried tomato with the eggs) \nOr try a creamy mushroom sauce with steak and chips/fries, start with butter and one clove of crushed garlic in a saucepan, 200g of finely sliced mushrooms and cook out the liquid, add dried parsley two teaspoons of French mustard and 300ml of cream and simmer gently until it reaches your desired thickness, you can refrigerate the leftovers and reheat at 20 seconds a time stirring to recombine then add to a cheese steak sandwich with fresh baby spinach.",
            "score": 1,
            "replies": []
        },
        {
            "author": "canaryclamorous",
            "body": "[Spanish mushrooms and onions](https://spainonafork.com/the-best-ever-spanish-mushrooms-champinones-con-cebolla-y-ajo-recipe/)  I've made this, pretty good.\n\n[Mushroom tart](https://honest-food.net/mushroom-tart-recipe/) \\- so good\n\nSauté a bunch in butter and brandy and use as a side with any protein.\n\nMushroom lover gang here !",
            "score": 1,
            "replies": []
        },
        {
            "author": "alinagraham",
            "body": "Generally with bella mushrooms I just saute in butter, but chicken Marsala is a great one! \n\nAlso, you should see if you have an Asian market near you! There are so many Asian dishes with mushrooms, and so many different types of mushrooms that you can try! One of my personal favorites is enoki! \n\nI traveled in China with my Chinese friend for a while, and her family members quickly realized I liked mushrooms and always made/ordered at least one mushroom dish each meal. They were usually stir-fried alone or with vegetables, or were in various soups..just so many wonderful dishes and I never knew there could be so much variety!",
            "score": 1,
            "replies": []
        },
        {
            "author": "inchling_prince",
            "body": "Hungarian mushroom soup is a BIG time favorite in my household. \n \nPenne boscaiola: https://www.seriouseats.com/penne-boscaiola-mushroom-bacon-pasta-cream-sauce-recipe\n\n\nMushroom and Brie baked eggs: https://www.closetcooking.com/mushroom-and-brie-baked-eggs/\n\n\nFor other recipes, I will often just add them or replace the meat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult_Touch2937",
            "body": "Once, while traveling in China, I tried mushrooms in a creamy sauce. Now it's my favorite dish! I also love cream of mushroom soup, have you tried it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "taylorthestang",
            "body": "[mushroom soup!](https://beingnutritious.com/healthy-mushroom-soup/)\n\nLiterally a pound of mushrooms condensed into like 3 cups of soup. I blended it into a puree and added some raw ones at the end. If you’re a mushroom fan, this is the soup for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuirkyOwl4756",
            "body": "Susan Spicer has a great goat cheese toast with mushrooms in Madeira cream recipe. And mushrooms are great with most pastas! Spinach mushroom omelettes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeamingVrts",
            "body": "I don't have a recipe but the best salad I have had in my life was a mushroom salad. \n\nThey were locally foraged + oysters, fire roasted, arugula, sliced radish, cherry tomatoes, and a light dressing.\n\nI have been trying to mimic the combination but I just haven't been able to get the right mushroom textures.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeteInBrissie",
            "body": "Ew. Eat something that needs sunlight.",
            "score": 0,
            "replies": []
        }
    ]
}