{
    "title": "Taiwanese Flat Cabbage, Where Have You Been All My Life",
    "author": "Antiumbra",
    "subreddit": "Cooking",
    "rank": 4,
    "score": 49,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Cooking/comments/1jea105/taiwanese_flat_cabbage_where_have_you_been_all_my/",
    "id": "1jea105",
    "selftext": "Went to the store because I forgot cabbage for corned beef & cabbage. but they were all sold out of the normal green. I saw what looked to be cabbage put in a hydraulic press, figured it would be interesting to try something new. Popped the corned beef in a slow cooker, followed by the wedged cabbage with two hours to go.\n\nHoly crap this stuff is delicious. Slightly sweet with a delicate flavor, no harsh bitter notes, and a very pleasant texture! Will definitely be using it every year now.\n\nI still have half of a head since I couldn't fit everything into the crock pot. Any awesome cabbage recipes you all enjoy? Was figuring an asian slaw, but I'm willing to try something new.",
    "comments": [
        {
            "author": "Inquisitor_DK",
            "body": "Simple recipe my mom taught me: heat oil in a large pan/wok, then toss in smashed whole garlic cloves and dried chili peppers snapped in half. When you can really smell the garlic fragrance, pile in chopped cabbage, add salt and a couple splashes of vinegar, and stir fry until soft. Simple but delicious. It doesn't really work that well with cabbages other than Taiwanese cabbage because other kinds don't soften well enough.",
            "score": 37,
            "replies": []
        },
        {
            "author": "junkywinocreep",
            "body": "Flat cabbage is amazing.  It's less dense than round cabbage and way juicer.  My wife makes sauerkraut on the regular, and the flat cabbage always has way more juice over the cabbage in the crock.  \n\nAny recipe would be similar in my experience, but would likely need to cut back on liquids until you see how the flat cabbage releases it's natural juices.",
            "score": 8,
            "replies": []
        },
        {
            "author": "sirotan88",
            "body": "I use it in stir fry all the time. Stir fry with pork belly slices is good. Or just plain cabbage stir fry with some garlic. You can have it as a side dish or add it to fried rice, or yaki soba noodles. \n\nOccasionally I’ll even use Taiwanese cabbage in soups too, but I generally prefer Napa cabbage for soups.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Hangrycouchpotato",
            "body": "I used napa cabbage for my corned beef dinner. It was awesome!",
            "score": 5,
            "replies": []
        },
        {
            "author": "sfchin98",
            "body": "Oh yeah, I am Taiwanese-American, and as a kid of course I had no idea there were different cabbages. All I knew was that I didn't like cabbage at all, except when I would go to Taiwan there would be cabbage that somehow wasn't terrible. Only when I became an adult who shops/cooks and I saw Taiwanese cabbage at the Asian grocery store did I realize, oh it's a different cabbage! Using Taiwanese cabbage for corned beef dinner is a great idea, I wish I had thought of that before I made dinner last night...",
            "score": 5,
            "replies": []
        },
        {
            "author": "jackyohlantern",
            "body": "Taiwan, maybe? /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "Distinct_Attitude461",
            "body": "I've replaced regular cabbage with Taiwanesse flat cabbage in every recipe and never looked back. Your dish sounds amazing, and added drizzle of spicey chilli sauce would be the chefs kiss!",
            "score": 2,
            "replies": []
        },
        {
            "author": "36monsters",
            "body": "Roast it in the oven with a drizzle of olive oil, voarse.sea.salt, some diced garlic, and a generous sprinkle of fennel seeds. Yum!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mahrog123",
            "body": "Makes the BEST cabbage rolls. Due to the shape of the head, the leaves are huge.\nAll I buy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished_Net5601",
            "body": "It is so good! Had no idea it was Taiwanese!",
            "score": 0,
            "replies": []
        },
        {
            "author": "PlantedinCA",
            "body": "Wait it isn’t labeled Napa cabbage where you are?",
            "score": -1,
            "replies": [
                {
                    "author": "woailyx",
                    "body": "Napa cabbage and flat cabbage are different things",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PlantedinCA",
                            "body": "Hmm someone else mentioned Napa. I have never seen a flat cabbage in any of my Asian markets at all! That is a shock. We typically have most stuff.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}