{
    "title": "Boil or pan fry hotdogs",
    "author": "Strange_Criticism654",
    "subreddit": "Cooking",
    "rank": 13,
    "score": 7,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 145,
    "url": "https://www.reddit.com/r/Cooking/comments/1jeftku/boil_or_pan_fry_hotdogs/",
    "id": "1jeftku",
    "selftext": "What is the preferred way of cooking hotdogs in your house. Growing up it was boiling but my wife said hers pan-fried them. So I wanna know what the general consensus is",
    "comments": [
        {
            "author": "shujaa-g",
            "body": "I think they're best pan-fried.\n\nThey're easiest microwaved. Single hotdog, roll up in a paper towel, zap for 20 seconds, is just right for my kids, and super quick.\n\nBoiling seems like worst of both worlds, no tasty browning from pan-frying, still have to wash a dish, and slower than the microwave.",
            "score": 44,
            "replies": [
                {
                    "author": "bugogkang",
                    "body": "A hot dog also doesn't make a mess in a pan, thats a quick wash. Boiling or microwaving tastes sad. Pan fried hot dog has character.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Spyderbeast",
                    "body": "I like grilled or pan fried the best, but the paper towel trick is my lazy go to. I do dampen the paper towel slightly though. Might not even make a difference",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "_Bon_Vivant_",
            "body": "On the grill.  Love the char and the smokiness.",
            "score": 40,
            "replies": [
                {
                    "author": "Otherwise-Mango2732",
                    "body": "I grew up eating them in the microwave. Good enough. Now I'm the same way - if I'm firing up my grill I'm throwing at least one dog on in addition to whatever else. Love the flavor the grill provides/modifies.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "69FireChicken",
                    "body": "This is the only way hot dogs are worth eating!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lewphone",
                    "body": "I've smoked them, then vacuum-sealed & put in the freezer (they stay edible for a long time). To warm up: put them in the oven while still frozen & broil for 6-7 minutes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Katy_Lies1975",
                    "body": "I cook Vienna Beef dogs on the grill and you know they're done when they start popping.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ps030365",
            "body": "Grew up with boiled. Now it's grill, airfryer, or pan fry. Really like the quick airfryer method, though.",
            "score": 18,
            "replies": [
                {
                    "author": "Remarkable_Fan_9083",
                    "body": "Same. I don’t hate boiled, that’s what my parents did, but I like some texture on the outside!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "todlee",
            "body": "I put them in a pan with a little water which eventually boils off, and then they brown up in the pan",
            "score": 35,
            "replies": [
                {
                    "author": "bri_c3p",
                    "body": "This is the move.  Boil in shallow water for a few minutes to heat through, then drain off the water and throw a pat of butter into the pan to brown and crisp the skin.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "nugschillingrindage",
                            "body": "What does the boiling accomplish at that point in your mind?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dwbruce",
                                    "body": "Water is a more effective heat transfer method than air, so it ensures that the hot dogs are appropriately heated, and then it's all about adding your desired level of browning / char to the outside. If you only heated them directly on the pan you would either end up having to use low heat for longer, or risk burning the outsides to get the insides to the desired temperature.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Bouche_Audi_Shyla",
                                            "body": "Risk burning the outsides? That's when the outsides are best!",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "nugschillingrindage",
                                            "body": "I can’t imagine ever having an issue frying a hot dog, I guess maybe if it’s one of those huge ones. You put the dog in the pan at medium high heat for 2-3 min and it’s hot and browned. Reverse searing a hot dog sounds like a pure waste of time.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Perle1234",
                                                    "body": "The water first method is typically how sausages are cooked. IRS just extrapolating the method to hot dogs. Since they are smaller they can cook in the frying pan without water, but the skin might be more likely to split. I like my hot dogs grilled over charcoal.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "nugschillingrindage",
                                                            "body": "I wouldn’t say typically but yes, that is a way raw sausages can be cooked and it does make sense in that situation.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "dwbruce",
                                                    "body": "I guess it just depends on the size of the hot dog. The ones I get from the butcher are a bit more bratwurst / sausage like. All that said, it's pretty moot for me personally since I typically just go outside and grill them unless it's absolutely gross outside.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "nugschillingrindage",
                                                            "body": "Well if it made sense to boil them and put them in a pan by the same logic it would make sense to boil them before you put them on the grill.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GtrplayerII",
                                    "body": "When you keep them in the freezer(buying in bulk) it thaws them quickly and allows you to steam the bun if you like them that way.  ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "nugschillingrindage",
                                            "body": "Well sure but I’m pretty sure that’s not what the person I asked is talking about.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TwoAmoebasHugging",
                    "body": "This is smart. Some say to boil first to reduce the salt, then fry. This sounds like it accomplishes the same but easier.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "nugschillingrindage",
                            "body": "Boiling a hot dog is definitely not reducing the salt to any significant degree. The meat is inside an airtight piece of intestine.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "PointNineC",
                                    "body": "My intestines are also air-tight.  Proud of it",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Bouche_Audi_Shyla",
                                            "body": "That's a very important thing, in a living person.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Perle1234",
                            "body": "It helps the skin not to split",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jeepjinx",
                    "body": "This, but beer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WritPositWrit",
            "body": "Pan fry or grill\n\n\nHot dogs are boiled in hell",
            "score": 7,
            "replies": [
                {
                    "author": "crippledchef23",
                    "body": "My friend just bought himself a 4 spot hot dog roller for his counter. I’m jealous.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "theblisters",
            "body": "Ideally grilled but pan fried as necessary",
            "score": 4,
            "replies": []
        },
        {
            "author": "kikazztknmz",
            "body": "My mom always boiled them unless my dad was grilling them. I now use an air fryer. I cut a few slits in them before I put them in.",
            "score": 4,
            "replies": []
        },
        {
            "author": "michaelpellerin",
            "body": "I boil them to plump them up, then quickly pan sear them in butter.",
            "score": 4,
            "replies": []
        },
        {
            "author": "lwillard1214",
            "body": "Pan fried. This way more closely mimics grilled.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Anne314",
            "body": "I'm all in on the Chicago-style dirty-water hotdogs! Some celery seed in the water and they are good to go.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Altyrmadiken",
            "body": "My parents boiled them if we had them. \n\nOnce I was in my early teens and was cooking more, however, I put my foot down and we always had pan cooked or if I was feeling lazy toaster oven cooked (it’ll still get color on the outside that way).",
            "score": 3,
            "replies": [
                {
                    "author": "flyingcasually1320",
                    "body": "My dad has a hotdog for lunch at least two days a week and always does his in the toaster oven, they get a little char on them like they would on the grill, but much less effort 😂",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Altyrmadiken",
                            "body": "Exactly!\n\nI just usually do it in the pan because then I can use the toaster for the buns, lol.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "gimme_that_juice",
                            "body": "Oh dear",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WyndWoman",
            "body": "Lightly slice, then nuke.\n\nAs a kid, we boiled them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pretend-Panda",
            "body": "Grill is best.  Butterflied and pan fried is second. Boiling not an option.",
            "score": 3,
            "replies": []
        },
        {
            "author": "skotgil2",
            "body": "split down the middle and pan fried",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dijon2017",
            "body": "Pan-fried or grilled, not boiled.",
            "score": 2,
            "replies": []
        },
        {
            "author": "YupNopeWelp",
            "body": "Pan-fry or on the grill.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Teauxny",
            "body": "I boiled 'em most my life until I tried cooking them in the steamer and never looked back. But yeah, pan frying is always tastier. Try frying it in some soy sauce, messy but delish.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kfretlessz",
            "body": "Usually boil water, turn off heat, sink some dogs, wait 5 mins, pan fry if crispy outside is desired. \n\nGrilled for best results, however.",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Po-Tay-Toes-",
            "body": "Pan fry with a fuck load of butter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Funnygumby",
            "body": "Pan fried. Gives them some snap",
            "score": 2,
            "replies": []
        },
        {
            "author": "More-Opposite1758",
            "body": "Taste best pan fried.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fun-Yellow-6576",
            "body": "Charcoal grill",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nyadnar17",
            "body": "I would rather have nothing than a boiled hotdog….no offense",
            "score": 2,
            "replies": []
        },
        {
            "author": "nativetoker024",
            "body": "Pan fried in LOTS of butter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Choice_Bee_775",
            "body": "Pan fried for the win.",
            "score": 2,
            "replies": []
        },
        {
            "author": "10yearsisenough",
            "body": "Pan fry",
            "score": 2,
            "replies": []
        },
        {
            "author": "IAMAHORSESIZEDUCK",
            "body": "I do both. Boil for 5 minutes in a sauce pan then pour out the water and fry until there's some crispy. You get both, the soft meat and the crispy skin.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bert4560",
            "body": "Air fry. Get some crisp then brush on BBQ sauce for the last minute or so or cooking",
            "score": 2,
            "replies": []
        },
        {
            "author": "gruntman",
            "body": "We boiled them when we were kids but I was a pan-fryer until we got an air fryer. \n\nAir fry'em",
            "score": 1,
            "replies": []
        },
        {
            "author": "JigsawZball",
            "body": "My parents boiled them. Sometimes we’d boil onions along with them. As an adult, I like them grilled. Now I want a hot dog!",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrdinarySubstance491",
            "body": "Growing up, we grilled hotdogs outside. My husband boils them. I don't care enough to argue with him so now we eat them boiled. \n\nI think they taste best pan fried.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ew435890",
            "body": "I love them air fryer. I score them up all over, throw them in, then put them in the bun with chili, cheese, and whatever else, then put them back in the air fryer for like 2 min.",
            "score": 1,
            "replies": []
        },
        {
            "author": "geoffpz1",
            "body": "I do the smoked Johnsonville brats on the panini press at least once a week.  Regular weiner's on the grill, Nathans, or if I can get them, Vienna beef get boiled.  Always boiled real german weiner's from the german deli, brat's get a beer bath with an onion and a trip to the grill.  So it depends...  LOL",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tll6",
            "body": "Air fryer is a game changer. Even better if you spiralize it first",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arturwill97",
            "body": "Pan-fried all the way! It gives them a nice crispy outside and a better flavor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "warrencanadian",
            "body": "air fryer now, all the char of pan frying but lazier",
            "score": 1,
            "replies": []
        },
        {
            "author": "blubbahrubbah",
            "body": "I've done both. Pan fry or broiled in the oven is better than boiling, but grilled tastes best, imho.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Filippo_G",
            "body": "Broil for a minute or two to get some texture/color.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LeperFriend",
            "body": "Grilled>pan fried>broiled>boiled>microwaved",
            "score": 1,
            "replies": []
        },
        {
            "author": "AxeSpez",
            "body": "In a pan 100%. I like to cut a criss cross pattern on them for more crispy bits",
            "score": 1,
            "replies": []
        },
        {
            "author": "crippledchef23",
            "body": "Pan fried with a thin coating of Pam until they are all very browned and puffy and kind of split. I need the spray because I buy very cheap hot dogs that will stick before they are properly cooked. Serve on lightly toasted bread with yellow mustard, dill relish and a thin line of ketchup. Side of boxed mac and cheese I you’re hungry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WondersaurusRex",
            "body": "Toss them in a pan with like a half inch of water. Let that go uncovered until the water is gone. Best of both worlds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GingerIsTheBestSpice",
            "body": "Grilled, and if not,  pan fry. Boiled makes them worse, even though that's a really common way to make them",
            "score": 1,
            "replies": []
        },
        {
            "author": "swoosan",
            "body": "Pan fried in butter. Throw some minced onion in there too",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmotionDelicious5264",
            "body": "Didn’t read through the other suggestions but my preferred way regardless is dirty water first and then finish whatever char you want…..pan, grillled, air-fried, roasted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grendels-Girlfriend",
            "body": "Toaster oven!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lmstarbuck",
            "body": "Steamies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Talonhawke",
            "body": "George Forman if I'm in a mood for grill marks otherwise I put them in a pan with a bit of water to speed up initial cooking and then effectively fry them as the water evaporates out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jcaffa13",
            "body": "Inside I do a boil in a frying pan - cook until water boils away and then fry in the glaze that’s left\nOutside, charcoal grill is the best way. Or just over an open fire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ceecee_50",
            "body": "I grew up with them boiled, but as soon as I moved out of the house, I started pan frying them. Or deep frying them occasionally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaleficentTell9638",
            "body": "Which one’s better, chocolate or vanilla?\n\nThat’s why they make both.",
            "score": 1,
            "replies": []
        },
        {
            "author": "local_gear_repair",
            "body": "Hot water bath or boil, then grill or pan fry. I find that the water before the grill or pan helps plump them up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sugar_Plum_Mouse",
            "body": "Pan fry",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guillotine-Wit",
            "body": "Grilling is the best option, imho.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WasabiAficianado",
            "body": "It’s a gentle heating in water from cold water to gently and not split them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lonelybidad",
            "body": "I put mine in the air fryer",
            "score": 1,
            "replies": []
        },
        {
            "author": "MYOB3",
            "body": "Time to get out the cast iron griddles and put them on the gas stove, grill mark side up! Nice char marks, just like outside... (just leave the exhaust hood  turned on)",
            "score": 1,
            "replies": []
        },
        {
            "author": "diefreetimedie",
            "body": "Because nobody said it yet, Broil in the oven!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dahlia_and_Rose",
            "body": "Growing up it was boiled. Absolutely hated boiled hotdogs. \n\nMy stepdad loved them though, and since he was the one who paid for groceries, he'd raise bloody hell if they were cooked any other way. \n\nAfter they separated my mom started pan frying them, and I continued to do so after I took over cooking, and continued to do so as an adult. \n\nEventually we got a hot dog roller, and prefer that to boiling or frying if we're cooking in doors. When the weather is nice I'd still rather toss them on the grill though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ergogeisha",
            "body": "Boil, but we boil them in home made tomato sauce so it's a lot more flavorful",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vindaloo6363",
            "body": "Steamed. Preferably ok a bed of sauerkraut.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrankiesMom6",
            "body": "We're pretty old, but I have a friend who's mother was a bit \"off\". She swears her mom would boil the hotdogs, and then make the kids eat the dog water too. Hotdog soup. Needless to say, she no longer eats hotdogs. \nI am pan fried all the way",
            "score": 1,
            "replies": []
        },
        {
            "author": "bedditredditsneddit",
            "body": "I'm on team oven",
            "score": 1,
            "replies": []
        },
        {
            "author": "75149",
            "body": "My wife is a psycho, she throws a couple in the microwave and is happy with that 😂",
            "score": 1,
            "replies": [
                {
                    "author": "Eis_ber",
                    "body": "And they never exploded? Damn, she's on a different level.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "75149",
                            "body": "Sometimes they would split, but she didn't give a shit. \n\nWhen I was a kid, my mother would pan fry them but she would cut an X into the end of each one so the ends would expand and the hot dog wouldn't roll around in the pan.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "desastrousclimax",
            "body": "general consensus depends on the day...if I like it light and without labor I just put them in the water on low for 20 minutes",
            "score": 1,
            "replies": []
        },
        {
            "author": "M_Chevallier",
            "body": "I’ll be honest … if you see me eating a hotdog it’s because I’m at a baseball game and I’ve been over served. However, most of my friends like them grilled.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DL-Red-1",
            "body": "My mother would butterfly cut the hot dog and fry.  I miss those days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jasondfw",
            "body": "I discovered this method 10-15 years ago and it's been my preferred method since\n\n  \n[https://lifehacker.com/give-your-franks-the-dirty-water-dog-treatment-1849357413](https://lifehacker.com/give-your-franks-the-dirty-water-dog-treatment-1849357413)",
            "score": 1,
            "replies": []
        },
        {
            "author": "lo0tDel1very",
            "body": "Air fry. Once you try it you’ll never go back",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaryWhit",
            "body": "Grilled, then you can start the endless debate on shades of doneness.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spud8000",
            "body": "pan\n\n  \nbut best is grilled outdoors",
            "score": 1,
            "replies": []
        },
        {
            "author": "goingtogoeatworms",
            "body": "Pan fried, ideally with a little butter and onions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous-Soup-5413",
            "body": "Pan",
            "score": 1,
            "replies": []
        },
        {
            "author": "MinkieTheCat",
            "body": "My husband is a boiler and I am a pan fryer. He usually makes the hotdog when we indulge and he boils them and then pan-frys mine, butterflied.",
            "score": 1,
            "replies": []
        },
        {
            "author": "civilwarcorpses",
            "body": "Grill for bigger batches or if we're grilling other stuff at the time.  Some kids are sensitive to grill marks, so when I can, I'll put the hot dogs in a foil pan with some water to make sure they don't get over done.  \n\nPan fry if I'm just cooking a few.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eis_ber",
            "body": "If it's going in a bun or some bread: boil.\n\nIf it's going in my pasta or on rice: pan fry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feeling-Visit1472",
            "body": "Grilling isn’t an option?",
            "score": 1,
            "replies": []
        },
        {
            "author": "pilsnerprincess",
            "body": "Air fryer",
            "score": 1,
            "replies": []
        },
        {
            "author": "kkidd391",
            "body": "If we want steamed buns, we will boil the hot dogs, put a grate on top for the buns and cover for a little bit. Put the finished hot dogs straight into the warm soft bun. I pan fry for any other hot dog \"flavor profile\" because I don't have a grill.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lightning_teacher_11",
            "body": "I use my indoor \"grill\"/panini press/skillet (all one gadget). My husband likes them boiled, I grew up with them being cooked that way and it's my least favorite. \n\nThe best way is on a grill or open fire. They get a little charred and more flavorful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeepjinx",
            "body": "Grilling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Steamysauna",
            "body": "Neither, bake them. Sheet pan 400 degrees for 15 minutes. They're perfect. Having tried all the other ways including grilling. Just my .02\n\nGot this from Nathan's website.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vsanna",
            "body": "I pan fry and once they've got a good sear all around I slap a lid on to let them steam.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Britches_and_Hose",
            "body": "Toaster oven, closest to grilling without actually grilling, and I don't dirty a pan. If that's not an option, pan fry in my cast iron.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eulenna",
            "body": "Butterfly down the middle but don’t separate them, leave a hinge to keep it together.  \nToss some butter in a preheated pan, dogs go in cut side down.  \nPut a cooking weight on them for even contact and to prevent curling.  \nOnce crispy, add more butter, flip over and repeat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "malcifer11",
            "body": "grill 🌚",
            "score": 1,
            "replies": []
        },
        {
            "author": "watadoo",
            "body": "Hah! both. We like to do it Wisconsin-style with our Brats.  Simmer lightly in beer, onions, and butter for about 30 minutes - then grill them on the barbeque. Serve on steamed sourdough buns with hot mustard, onions and more beer (in a bottle). A sliced, tart garlic dill pickle on the side is a nice touch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deLanglade1975",
            "body": "Good quality, natural casing wieners?  Pan fry, maybe split and pan fry to get more tasty crispyness.\n\nCheap ol' mechanically separated weenies?  My vintge Presto Hot Dogger.  Quick and easy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RiffRanger85",
            "body": "Deep fry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alinagraham",
            "body": "1st choice - cooked on a grill or over a campfire\n2nd choice - fried in a pan\nLast choice - boiled or microwaved (I avoid eating these if at all possible)\n\nFor context, I'm not a huge fan and always choose burgers if both are available. So the only way I'm fine with them are high-quality ones, that are browned/charred in one way or another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaymondLuxuryYacht",
            "body": "Grilled or microwaved in the bun, wrapped in a paper towel. Bun gets steamed, super easy and fast.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Azathoth1978",
            "body": "Boil or steam.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The0poles",
            "body": "roast or grill imo",
            "score": 1,
            "replies": []
        },
        {
            "author": "SluggardStone",
            "body": "I will steam them if I am not in a hurry. Otherwise I'll microwave them in a bowl of water.",
            "score": 1,
            "replies": []
        },
        {
            "author": "424Impala67",
            "body": "Uhhh, under the broiler for a couple of minutes, roll and heat for a few more minutes?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LKayRB",
            "body": "Pan fried",
            "score": 1,
            "replies": []
        },
        {
            "author": "crapshootcorner",
            "body": "Microwaved hot dogs is why the rest of the world hates US 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "krissycole87",
            "body": "Both. Put hotdogs in about an inch of water in a pan. Let them boil until the water is gone, then once the pan is dry, pan fry the hotdog to get nice color and crust.  \n\nNothing beats cooking them over a campfire, but this is the second best thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chabadgirl770",
            "body": "Boil or grilled",
            "score": 0,
            "replies": []
        },
        {
            "author": "TheBigPhysique",
            "body": "I boil.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MyAimSucc",
            "body": "I put them in a pan with a little bit of water and cover, steam until all the water is gone and then fry them to put on some color.",
            "score": 0,
            "replies": []
        },
        {
            "author": "gtmbphillyloo",
            "body": "Boil then fry. \n\nBut best over a campfire.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Common-Attention-889",
            "body": "40 seconds in microwave.  I used to pan fry, but this is quicker.\nI also would not use the air fryer to avoid the hassle of washing it, for a couple of hot dogs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Appropriate_Sky_6571",
            "body": "Air fry! It gives the same slightly burnt grilled flavor without the mess",
            "score": 0,
            "replies": []
        },
        {
            "author": "cellardweller1234",
            "body": "Usually boiled but either way is great.",
            "score": 0,
            "replies": []
        },
        {
            "author": "xshap369",
            "body": "I like boiling them cuz the hot dog water is really good",
            "score": 0,
            "replies": []
        },
        {
            "author": "OldRaj",
            "body": "Boiled in a tiny bit of water; once it evaporates, toast in the same pan.",
            "score": 0,
            "replies": []
        },
        {
            "author": "sundial11sxm",
            "body": "Pan fry, but put a little water in the bottom, barely covering the bottom of the pan. Let the water evaporate off, brown dogs to taste.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Accomplished-Eye8211",
            "body": "Boiled or steamed or even microwaved is fine for me if they're the routine skinless dogs.   If they have a casing - pan fried, grilled or broiled.  Or airfried.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mynameisnotsparta",
            "body": "Boil and make some NYC street food style onions with red sauce.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Purrogi",
            "body": "Burnt please",
            "score": 0,
            "replies": []
        },
        {
            "author": "fermat9990",
            "body": "Par-boil then pan fry is good",
            "score": 0,
            "replies": []
        },
        {
            "author": "Outaouais_Guy",
            "body": "I don't boil them. Bring water to a bare simmer and put the dogs in. Turn the temperature to low and give them time to warm through.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BAMspek",
            "body": "Air fryer.",
            "score": 0,
            "replies": []
        }
    ]
}