{
    "title": "Is this the reason why you can't date Sae Niijima in the game?",
    "author": "coleknight2066",
    "subreddit": "Persona5",
    "rank": 18,
    "score": 3069,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 143,
    "url": "https://i.redd.it/6cyb8llc1ape1.jpeg",
    "id": "1jdgwj6",
    "selftext": "Every female social link is a romancable option aside from her. It's a shame.",
    "comments": [
        {
            "author": "TryThisUsernane",
            "body": "Apparently it was supposed to be an option.\n\nBut you have to remember that her entire confidant takes place in a single afternoon. You aren’t getting a grown lady to fall in love with a highschool guy she initially hated the guts of in a single day, while she is working.\n\nIt also would have taken away from the seriousness and tension of the entire thing.\n\nPlus Joker was drugged and apparently nearly passing out, and his fate was in Sae’s hands. The entire situation would have been predatory.",
            "score": 1253,
            "replies": [
                {
                    "author": "ConformistWithCause",
                    "body": "When you phrase it that way, a half-drugged twink locked in a secret basement room telling stories about plowing your little sister does shine him in a more appealing light.\n\n\nAlso, she's busy pretty much nonstop the moment that could even be considered. Detained by shido's people followed by working his case. It would be an even less fulfilling romantic option than yoshizawa. It would be so limited and just in the end-game",
                    "score": 596,
                    "replies": [
                        {
                            "author": "BaronMerc",
                            "body": "r/brandnewsentence",
                            "score": 94,
                            "replies": [
                                {
                                    "author": "ConformistWithCause",
                                    "body": "Maybe new for you",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "author": "UnlikelyKaiju",
                                            "body": "Yeah, it's a pretty common concept for regulars to this sub.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "ConformistWithCause",
                                                    "body": "No, you stop that. Stop trying to normalize my kinks right now",
                                                    "score": 16,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SemperFidelisHoorah",
                                    "body": "YOU NEVER SEE IT COMINGGGGGGGG",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "C1nders-Two",
                            "body": "> an even less appealing option than Yoshizawa\n\nOkay, first of all, *rude*. Second of all, what makes Yoshizawa unappealing in the first place?",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "kyleliner",
                                    "body": "Little bitter aftertaste following a well cooked meal",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "C1nders-Two",
                                            "body": "If you’re talking about the ending where she acts like you’re just acquaintances, you right.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "kyleliner",
                                                    "body": "Well, you could take it that way.\n\nBut what I was actually talking about was the comment you replied to lol",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "ConformistWithCause",
                                                            "body": "I just don't get it. Like, I'm not trying to start a waifu war and felt like I emphasized how irrelevant it actually is, but it kinda turned into that anyway, completely missing the original point",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "kyleliner",
                                                                    "body": "Hahaha no worries, its just a good, well put explanation that is then followed by a different opinion that is left unexplained.\n\nI neither agree or disagree about Yoshizawa, I just found that little comment hilarious",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ConformistWithCause",
                                    "body": "The romance option really only matters for 3+ dates (the plus being those addition hangouts which sorta count but also not really cause, let's be honest, none of it *really* matters) and yoshizawa isn't even available for one of them which also happens to be the \"most\" important one (again, doesn't really matter) since Christmas is when you get that item that gives like additional xp for fusing persona of that type (I think that's what it is?) So from an objective pov, it is the least appealing option since it has the least amount of rewards. Also, since you need to rank her up 5 times in that span of time (no idea the fastest it can be done), it gives you less time for 'spent alone time with'\n\nAgain, cause I can't stress it enough, it doesn't matter if yusuke isn't an option",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "C1nders-Two",
                                            "body": "1. Nobody does the dates since it just uses a time slot with no tangible incentive to do so\n\n2. If your reason to not choose her as your romance, she’s not the “least appealing” from the perspective of actually getting to know and date her, she just gives you the least stuff.\n\n3. All the Christmas romance items do anyway is slightly boost confidant rank xp *for that specific confidant*, which is not only not a problem because it’s super easy to get sufficient xp for the next rank-up during the confidant episodes themselves (you can also boost this further by equipping a Persona of the same Arcana), and her confidant is split in half between the third semester and the rest of the game, so a romance item for Yoshizawa would be of highly limited utility anyways.",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "great_penguin",
                                                    "body": "I think she is the least appealing option because I don't like her at all. :D",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "C1nders-Two",
                                                            "body": "![gif](giphy|26BRrSvJUa0crqw4E)",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "great_penguin",
                                                                    "body": "That's what I said, no?",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "scrambleforafrica2",
                            "body": "Gooners failing the \"try not to refer to teenage boys at twinks\" challenge again, it seems...",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jbg0801",
                    "body": "It's fair to assume that in the context of the version of the game where you could date her, her confidant was likely different. According to the wiki, at one point she was your guardian instead of Sojiro (check Sae's wiki page and look in the trivia section) so your dynamic was likely VERY different in the version where you could date her.\n\nStill not a fabulous relationship, given it'd be a guardian/dependant relationship, but better than \"woman who didn't leave me to die while I was doped off my mind and I spent one afternoon talking to her\"",
                    "score": 80,
                    "replies": [
                        {
                            "author": "draxdeveloper",
                            "body": "well, would be almost at the same level as teacher maid relationship",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Timtimus007",
                    "body": "I feel like it could've worked better if she was an actual confidant before Joker was caught. We see and talk to her a few times before that already in the game, so I imagine that we could just ran into her more often for events to happen",
                    "score": 27,
                    "replies": [
                        {
                            "author": "draxdeveloper",
                            "body": "Speaking about her being a confidant... How the hell this works?  \nI mean, how she can influence the personas fusion in the PAST?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LaMystika",
                                    "body": "She doesn’t, at least not in the original game.\n\nYou didn’t get any XP boosts for fusing Judgment Personas in the original game until after >!you survive the interrogation and Akechi’s attempted assassination.!< I don’t know about Royal; I only got as far as establishing the link and haven’t played since (had other things going on and other games to play)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "lastsaeprise",
                            "body": "Agreed.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "OoguroRyuuya5",
                            "body": "She didn’t interact that much with Joker aside from one time, she mainly talked to Sojiro as Joker often stumbled in Sae forcing information out of Sojiro.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Justadudscrolling",
                    "body": "It’s not like the other adults romances aren’t predatory",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Intelligent_Check528",
                            "body": "Like the one where you are getting drugged (but willingly), or the one where you're romancing a drunk... or your own teacher... and then there's Chihaya, who isn't much older than you (early 20s?)",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Justadudscrolling",
                                    "body": "She’s the least problematic age-wise tho if I want to be an arse I’d say she’s doing new age kind of indoctrinating stuff",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Werten32",
                                            "body": "Maaaan isn’t the point of her link pulling her out of the mlm",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Justadudscrolling",
                                                    "body": "Prolly i didn’t cared about her link + I was just talking about indoctrination into potentially dangerous stuff more as a joke than anything",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Intelligent_Check528",
                                            "body": "Right, she's riding that fine line between acceptable and not.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "hypomanix",
                                                    "body": "She could have just as easily been a high school dropout/runaway and it genuinely would not have made a difference in her confidant",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TryThisUsernane",
                            "body": "That’s true, all of the adult romances are predatory.\n\nBut Sae’s would’ve been like Predatory Plus. Power imbalance + drugged + trapped in an undisclosed room + your life is in her hands.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SorakuFett",
                    "body": "Well, you were also originally supposed to be the Niijimas' neighbor and would have leveled both Sae and Akechi's confidants at your own pace rather than through the story, but they changed that.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "dennisleonardo",
                            "body": "Not just neighbour. Sae was supposed to be your legal guardian instead of sojiro. It's never really properly explained what led to sojiro taking you in beyond him owing your parents a favour, him being an Ex-Federal Agent, and him getting paid for it. Considering what we know about him, it seems like something he normally wouldn't bother with. But the game never explains why he did.                       \n\nWould've made a lot more sense if it was sae instead. Sae was already trying anything she could to improve her standing as a federal prosecutor and further her career. Taking in a delinquent criminal student and making him behave for a year of probation, therefore successfully \"reforming\" him would've definitely added to her resumé. Sounds like something early sae would've been desperate enough to do in order to push her career.                    \n\nThis would've also introduced us to akechi earlier, who met up with sae semi regularly due to him being assigned to the same cases.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "ci22",
                                    "body": "I also heard Akechi and Makoto were gonna be siblings with Sae as their mother \n\nWould've made the game for tragic",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "dennisleonardo",
                                            "body": "It would be so nice to be able to at least read a script of that older version, lol. Witcher 3 somewhat recently had its original script released (at least the vast majority of it). Which revealed all the cut content and things they changed over time. Really, really interesting. Game was originally supposed to be about twice as long (release version is still easily a 100h+ game).                        \n\nWould be super cool if that happened with more games. Would love to read that earlier version in text form.                    \n\nAlso, makoto + akechi as siblings would've been crazy. But kind of ruins akechi's character if sae is their mother. What would his motivation for the mental shutdowns even be then? Maybe shido killed their father? But even then, why help shido. The whole reason why he helped shido in the release version is the fact that he had no way of getting back at him otherwise. Cuz he had nothing. No family, no money, no influence, no friends, no one to even talk to, nothing. I think akechi definitely got changed for the better, lol. Early version akechi sounds like a pure villain ngl.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ci22",
                                                    "body": "Unless they both have different fathers And Akechi found out he's Shido's kid. And his motivation is to please daddy. Shido manipulative him.\n\nYeah I do like how Akechi turned out. Both Akechi and Makoto seem to have a but of siblings rivalry and Sae is kinda like a parents to them. Well to Akechi in my headcannon \n\nLike when you talk to him in the jazz club he talks about him wanting to treat Sae to Sushi 0:43\n\nhttps://youtu.be/P0sCwpemX4E?si=vb9rXp9sUSqPDEAf",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ansu_fatismo23",
                                                    "body": "Where can I find the original witcher script?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SorakuFett",
                                    "body": "Yes, thank you. I couldn't remember a lot of this. And yeah, early Sojiro seems like a guy with way too much on his plate to take in someone's \"delinquent\" kid.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dunkbuscuss",
                    "body": "Personally I think if they had made her confidant start in the past/flashback it could work.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "dark_dizzy",
                    "body": "Literally any of the romance options Joker has with adults are predatory lol",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tmntnyc",
                    "body": "I feel like with enough Guts, anything is possible....",
                    "score": 2,
                    "replies": [
                        {
                            "author": "lastsaeprise",
                            "body": "And Charm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flairsupply",
                    "body": ">The entire situation would have been predatory.\n\nWhile I agree, that ship sailed with 50% of P5's romances already-\n\nHell even some of the ones in Joker's age range are... questionable in some parts (Sumi in particular, a lot of the story circumstances make me REALLY awkward around that one)",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "yegkingler",
            "body": "Probably cause her entire social link is technically only like an actual hour or so in game.",
            "score": 276,
            "replies": [
                {
                    "author": "GovernorGoat",
                    "body": "To be the devils advocate they could've totally written something in post interrogation. That being said, it wouldn't make any sense for her character lol",
                    "score": 71,
                    "replies": [
                        {
                            "author": "lastsaeprise",
                            "body": "Or written something pre and post investigation.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Cereal_CakX_Offender",
                                    "body": "I say it could've been a Royal addition, like how they reworked Akechi's",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "lastsaeprise",
                                            "body": "Absolutely",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Intelligent_Check528",
                                    "body": "... although I see an opportunity with your comment, username, and profile picture, I will not make an innuendo.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Totheendofsin",
                            "body": "I mean it not making sense doesn't really matter, it doesn't really make sense for any of the adult confidants to have romance options, its pure wish fulfillment",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "lastsaeprise",
                                    "body": "And it could be written to make sense too.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Virdice",
            "body": "You spend the entire game telling her how you hire your teacher as a maid for \"favors\", how you are dommed by 2 kids and how you romance multiple women including her sister, if she'd still want to date you that'd be weird",
            "score": 92,
            "replies": [
                {
                    "author": "CLxJames",
                    "body": "https://preview.redd.it/3zdd2vfhcape1.jpeg?width=1512&format=pjpg&auto=webp&s=a36cff3bba43bd31d2782f16003e562275f4cf9d",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Intelligent_Check528",
                            "body": "Studying ;)",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RedNicoK",
                    "body": "Not even Joker's ultimate rizz can overcome that many red flags",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "liteshadow4",
                    "body": "I mean Joker doesn’t tell Sae everything that he experienced",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElderOmnivore",
            "body": "You also can't date the twins and Lavenza. So, Sae isn't the only one. I don't think you should be able to date the twins nor Lavenza. It's sad I have to specify that because otherwise some people would think I was implying that just by saying you couldn't. \n\nAnyway, for Sae, I believe people discovered it was planned at one point, but scrapped. I would guess just because of the nature of how the confidant progresses. It's automatic and really the only thing you say to her that matters determines whether you get a bad ending or not. \n\nI guess they could have done something after you max her out automatically, but didn't want to break the structure they setup. Maybe even romancing a prosecutor as you're drugged up was a bridge too far for them as well. Who knows. ",
            "score": 81,
            "replies": [
                {
                    "author": "lunas2525",
                    "body": "There was stuff cut out they could have had more but perhaps it did not fit well for them also there were so many you could date already... Though lavenzia and the twins are a bit more understandable they are clearly underage in appearance...",
                    "score": 21,
                    "replies": [
                        {
                            "author": "SilverSaren",
                            "body": "And yet you can date Ken in P3P.  😬",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "lunas2525",
                                    "body": "Yeah there isnt a romanceable male in p5 i did ann, makoto, futaba, katsumi, kawakami.\n\nIn p4 a extra velvet room inhabitant that you could. I did yukiko...\n\ni dont remember p3 that well but a female protag was possible... I got to the end then could not bring myself to finish the agis portion...",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "R4msesII",
                                            "body": "In p4 there was a male romance option? Unless you mean content that is not in the game, then no.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "lunas2525",
                                                    "body": "Humm why did i remember it wrong i thought Kanji Tatsumi was. Looked it up and no.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LegacyTwilight",
                                    "body": "Mistakes were made.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SpecialistHearingDoc",
            "body": "what the fuck did i just look at",
            "score": 38,
            "replies": [
                {
                    "author": "Intelligent_Check528",
                    "body": "Something that someone is into, I'm sure. Personally, I hate it, but I'm going to let people be.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "BasimIbnIshaq3000",
                            "body": "He definitely got this from DeviantArt. I'm also into that fetish",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "FairAhri",
                                    "body": "I knew you used DA because you didn't forget the capital \"A\". Only someone who sees that name often can remember that detail.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "originalno_name",
            "body": "she is too good for date a minor like joker, sae still have dignity",
            "score": 86,
            "replies": [
                {
                    "author": "fox_hound115",
                    "body": "Unlike a certain teacher I know",
                    "score": 38,
                    "replies": [
                        {
                            "author": "enchiladasundae",
                            "body": "You’re shooting strays at the doctor and I won’t accept attacking her or teacher",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "lIamN9",
                            "body": "Yo, leave my gf alone.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Logank365",
                    "body": "Dignity? She rigged cases and ruined people's lives for personal success. She threatened to take Futaba away from Sojiro.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Embarrassed-Two-1174",
                            "body": "I don't think it's said that she ever rigged cases herself, but that she was going to because of her twisted desires. And she threatened to take Futaba away because, despite us having inside knowledge about why she shut herself away, the rest of the world doesn't, and there is some validity in it that while Sojiro wasn't abusive at all, he wasn't a perfect guardian, either, she wasn't attending school, socializing in person, likely wasn't eating properly, the amount of trash in her room, etc",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "TJ248",
                                    "body": "IIRC it's said pretty clearly, almost explicitly even. Sae is expected by her superiors to maintain a ludicrous indiction rate of 99%. She's also stated to see justice as meaningless. It's not just a couple of cases. It's suggested she rigs *a bunch* of cases and that she has put many innocents behind bars. It's worth noting that she's not actually happy about the fact she has to rig cases, as the pressure comes from above, but that doesn't change the fact she still does it. Akechi even confirms it IIRC. I mean ffs her palace is even a rigged casino, the metaphor isn't exactly subtle.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Logank365",
                                    "body": "The game glosses over her, but by the game's own logic, Sae did rig cases. In Kamoshida's palace, Morgana said that the treatment of students in it was a reflection of what was happening in real life and that was consistent throughout the palaces. That means that Sae was rigging cases and viewed them purely as things to be won. When Kaneshiro was caught, she didn't care about him exploiting others; she was upset that she couldn't catch him to get a promotion.\n\nIf Sae had thought Sojiro was abusing Futaba, then that makes things WAY worse. That means that she didn't actually care or have any intention to step in and stop the abuse that she thought was happening. She only cared about it to the extent that she could use it to threaten Sojiro about cognitive psience.\n\nEdit: Ya'll are downvoting me, but know I'm right.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "originalno_name",
                            "body": "yup and she did it with dignity",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thomas_Chinchilla",
            "body": "Look, even though I think she’s the most attractive character in the game, her not being romanceable is 100% justified. She’s part of the justice system, and very dedicated to her job. The last thing she’d do is enter a relationship with a high schooler ~10 years her junior",
            "score": 28,
            "replies": [
                {
                    "author": "TJ248",
                    "body": "She's officially called a \"**young** prosecutor\" by other characters. She's also been Makoto's legal guardian for around 3 years. You need to be 18 to be a legal guardian, so even assuming she passed her exam to be a prosecutor almost instantly, it's safe to assume she is a minimum of 20-21. Nowadays it takes longer, but when P5 came out you could manage a law degree in Japan in 3 years, possibly even 2 if you already had prior requisite knowledge (which Sae easily could have considering we're told she was practically an honour student). For quite a long time, you didn't actually even need a degree to take the bar exam in Japan, you could take it right out of high school and if you, by a miracle, passed at that point, just one year of legal apprenticeship later and you could work as a lawyer. This exact scenario is seen in P2. I think that's been changed now, though, before P5 came out. Even still, I'd say 10 years is on the high end of an estimate. 28 isn't really \"young\" anymore, biologically speaking, 30 is \"old\". It's more likely that Sae is around 5 or 6 years older than Joker, probably like 22-23, 25 years max. Whilst Joker is technically underage, the age gap isn't *too* problematic if you ignore the fact he's a student, though it's still pretty damn dodgy imo. The real problem with this would be the fact she's actively working his case, so there's a power dynamic issue, but also a conflict of interest issue, and, as you've rightly pointed out, the fact she works in the justice system and is constantly under intense scrutiny by her boss, given what we know of Sae it would be hugely out of character for her to risk her career by fucking around with an underage Joker.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Zookeeper_west",
                            "body": "She passed the bar in high school, I think it’s mentioned in the dancing game",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ci22",
                            "body": "If she's 25 then she's around Mitsuru and Akihiko's age. \n\nFunny to think she had a normal high school year while they were fighting to save the world",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ganbazuroi",
            "body": "https://preview.redd.it/2rv6wr6avape1.png?width=720&format=png&auto=webp&s=015a3abd72560cbed5183d86d8442d9241ff3e3d\n\nBro just posting fetish artwork like we wouldn't notice lmao",
            "score": 11,
            "replies": [
                {
                    "author": "BasimIbnIshaq3000",
                    "body": "It's from DeviantArt. There's also an artwork in which Makoto does the same thing Sae did to Joker in this artwork",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BaritBrit",
            "body": "Because she's a lawyer and understands how the legal system would view such a pairing i.e. not well. \n\n\nBesides, it's refreshing having at least one plot-relevant woman in the game who *doesn't* instantly want into Ren's underwear because he's spoken to them ten times and made the music notes appear. ",
            "score": 30,
            "replies": [
                {
                    "author": "Queen_Persephone18",
                    "body": "Finally, some sense other than thinking below the belt! Not every woman should automatically want to get into the protag's pants at each opportunity!",
                    "score": 12,
                    "replies": [
                        {
                            "author": "BaritBrit",
                            "body": "The game already has nearly a dozen women who invariably come down with an incurable burning case of protagonist fever just from being exposed to Ren's blank expression and one-sentence replies. \n\n\nIt's odd how people sometimes fixate on the *one* who isn't interested. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Queen_Persephone18",
                                    "body": "Because it's Gaston principles; chasing after something they can't/shouldn't have.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheOzymandias78",
            "body": "Idk but she has a romance scene in the anime which is pretty interesting",
            "score": 7,
            "replies": []
        },
        {
            "author": "RotoBlenzo",
            "body": "Persona fans care more about romance than the whole game",
            "score": 13,
            "replies": [
                {
                    "author": "_BluSteel",
                    "body": "Even more sad when you remember that Persona's dating mechanics are the most basic things imaginable. Unironically these guys like this series for the wrong reasons",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RotoBlenzo",
                            "body": "The worst part is how they simp over a character, in a game relationship that doesnt change anything in that same character development or any other thing on the game. W for Metaphor for not having romancable npcs, cuz i’m only doing a romance route if find the mc and that same char match (not goinf into wierd stuff) or because of a achievment/trophie. Simple as that",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KayMGames",
            "body": "More importantly, why CAN'T you date **Akechi**?\n\nhttps://preview.redd.it/bdhzajc24ape1.jpeg?width=612&format=pjpg&auto=webp&s=2af5d1f4b8883975c7a1712c3acbf1f8e7f04bad",
            "score": 41,
            "replies": [
                {
                    "author": "originalno_name",
                    "body": "it would be very unfair to the others girls",
                    "score": 11,
                    "replies": [
                        {
                            "author": "KayMGames",
                            "body": "then they can cry about it\n\nhttps://preview.redd.it/fy3lj9kzjape1.jpeg?width=1497&format=pjpg&auto=webp&s=866bacf79ec6a8b50e5c4c9d0ffec2ef6ba868e8",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "originalno_name",
                                    "body": "fair",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MemerDreamerMan",
                    "body": "You know why",
                    "score": 15,
                    "replies": [
                        {
                            "author": "BaconxHawk",
                            "body": "https://preview.redd.it/7dxmfe4d4ape1.jpeg?width=1170&format=pjpg&auto=webp&s=e5300fef44147a1e4fef0780009c46416ad4d428",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nomaiD",
                    "body": "I mean, you definitely go on dates. The jazz club, the arcade, the AQUARIUM. Those are dates. They are the most date-like events among all confidants imho, except maybe Futabas (and even then there's an undertone of \"let's help this mess of a girl become less of a mess\"). But you can't romance him because... Well because it's the same game where gay men being predatory towards a minor is okayed as a recurring joke, that's probably why.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "SuperVaderMinion",
                            "body": "Yeah, we're supposed to call that shit \"cultural differences\" or something. Really hope that Atlus figures out how much money they're missing out by ignoring queer representation",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "LLLLLL3GLTE",
                                    "body": "Fuck the money I just wanna be GAY",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "nomaiD",
                                            "body": "Well, you (just like me) should have thought about that before deciding to have a sexuality that is now part of a culture war. \n\n/s, obviously.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "LLLLLL3GLTE",
                                                    "body": "Nah I’m straight but I just wanna fuck Akechi\n\nhttps://preview.redd.it/z2ccbm2wyape1.jpeg?width=750&format=pjpg&auto=webp&s=2f6e604219989bb47cc5e3a753e5057876bc7dc2",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "planetarial",
                    "body": "Its funny cause he arguably feels the “main” girl of a romance game. Most of his link is just going on one on one hangouts instead of Joker being their therapist, his confidant even in Royal has some rank ups that only occur during plot relevant events, and the game acknowledges that you maxed his link and changes the story a bit for it, which the girls don’t get outside of fluff events like Christmas and Vday.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ganbazuroi",
                    "body": "Having to dig up your boyfriend isn't really a healthy dynamic - ^(lmaokumura!)\n\nhttps://preview.redd.it/7parxnwkvape1.png?width=720&format=png&auto=webp&s=ebfa6ed40dc29586a481496476b018c280fb6b7b",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "sayzitlikeitis",
                    "body": "wtf why",
                    "score": 3,
                    "replies": [
                        {
                            "author": "HommeFatalTaemin",
                            "body": "Tf do you MEAN “wtf why”? Why would people want to date him? Have you PLAYED the game, Mary?",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "the_saint_digger",
            "body": "She hit em with the Batman arkham inputs",
            "score": 4,
            "replies": [
                {
                    "author": "coleknight2066",
                    "body": "What's that?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "cpt_edge",
            "body": "Fetish art? Really? On *my* porn app?",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheREALProfPyro",
            "body": "They wanted the other girls to have a chance. Sae is just too powerful.",
            "score": 3,
            "replies": [
                {
                    "author": "lastsaeprise",
                    "body": "So true",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "codykonior",
            "body": "She’d be too powerful.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Medical-Paramedic800",
            "body": "You were supposed to be able to",
            "score": 5,
            "replies": []
        },
        {
            "author": "Strange-Aspect-6082",
            "body": "Persona fans when the game doesn't let them date everyone (They're single irl):\n\nhttps://preview.redd.it/l10rm4vizape1.jpeg?width=409&format=pjpg&auto=webp&s=5b2e6130bc0457807627baf1f299bfc0584bc3ed",
            "score": 4,
            "replies": []
        },
        {
            "author": "Impossible-Blood-624",
            "body": "🤣🤣🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "KaiOfTheCosmos",
            "body": "Uhh, well obviously it’s because you’re a minor and she’s an adul- oh wait….",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Engineering_1495",
            "body": "Y'all play the game just to date people?",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Measurement_6611",
            "body": "Persona 5 Remasked will include it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BananaMelonJuice",
            "body": "She represents the Judgement arcana. She cant be biased and will be bad story wise if she falls in love with the MC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mv48",
            "body": "I am surprise there isn't a mod",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jamessgachett",
            "body": "Black flash",
            "score": 1,
            "replies": []
        },
        {
            "author": "slm_ben_tru",
            "body": "Out of topic why she hitting the mitsuru p4a myriad arrows kick",
            "score": 1,
            "replies": []
        },
        {
            "author": "DOA-FAN",
            "body": "![gif](giphy|TX2S4jjhDVEFVbOR4z)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ancient_Internet6396",
            "body": "It kind of makes sense. Her conversations, even post-palace and outside of the interrogation room are kept very professional and minimal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "enperry13",
            "body": "Other than the timeframe of events between her and Joker. Such pairing would just be contradictory to her character.\n\nShe’s a career woman prosecutor trying to climb up the ranks of male-dominated profession where she is severely underestimated and always looked down for gender; and the person she ends up romancing with is the very criminal she is trying to prosecute and her sister’s friend?\n\nNaah, that would just invalidate everything she worked on to that point and just prove all those misogynistic comments about her right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PureSprinkles3957",
            "body": "Sae Niijima is a plot Link like Morgana and Igor\n\nIt advances with the plot\n\nIn the Beta the Niijima Sisters were in place of Sojiro and Futaba",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gloomy-Matter",
            "body": "First of all she’s a prosecutor, the end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Da_Electric_Boogaloo",
            "body": "did they have to draw her pussy lips?",
            "score": 1,
            "replies": []
        },
        {
            "author": "pastelnoivern",
            "body": "maybe she just isnt attracted to minors",
            "score": 1,
            "replies": []
        },
        {
            "author": "Queasy_Coast1784",
            "body": "Imma find a way even if I have to speak to this:\n\nhttps://preview.redd.it/ojysn2oecdpe1.png?width=1080&format=png&auto=webp&s=8f6bafa59bdfa526f40d7179537191dfff7aa322",
            "score": 1,
            "replies": []
        },
        {
            "author": "lStoIeYourToast",
            "body": "I wouldn't mind what's going on in this picture tbh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Pen4977",
            "body": "This is my wallpaper now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Successful-Mud9372",
            "body": "I assumed because it wouldn't make sense compared to other romances. \"You have been accused of several horrible crimes like: Blackmail and Murder. I like you, here's my number\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "BabyJWalk",
            "body": "She’s literally a prosecutor and you want her to date a teenager? 🙂‍↔️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Either-Condition4586",
            "body": "No one would ever date a damn fed!",
            "score": 1,
            "replies": []
        },
        {
            "author": "spencer1886",
            "body": "It would've made 0 sense with how the story is written",
            "score": 0,
            "replies": []
        },
        {
            "author": "FeelingUnwellCuzLife",
            "body": "Real answer is probably that she's not really a proper confidant because it's a speedrun during a single interrogation when Ren is high and being accused of mass murder.\n\nHow *I* interpreted it is that Sae is the only adult woman in the game that isn't a paedophile.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Putrid-Class-3244",
            "body": "Might as well date lavenza since he has nothing left to lose",
            "score": 0,
            "replies": []
        },
        {
            "author": "TheAngryWitcher99",
            "body": "It's hinted that Sae is a lesbian. She kinda had a flirtatious interaction with the Doctor. So it's kinda assumed she's not into guys. Plus she's like twice Jokers age and is her sisters friend. Doubt she'd want to fuck up Makoto's friendship.",
            "score": -4,
            "replies": [
                {
                    "author": "Zookeeper_west",
                    "body": "How dare people downvote you when Sae x Tae is the best ship in the game. Idc if they’re not actually together. Theyre together to me.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TheAngryWitcher99",
                            "body": "They aren't and it is stupid when art of them pops up in this sub all the time, but whatever.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}