{
    "title": "What if a certain someone was in P5 Strikers (Art by @argentsunshine)",
    "author": "DashingCards",
    "subreddit": "Persona5",
    "rank": 8,
    "score": 1054,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 39,
    "url": "https://www.reddit.com/gallery/1je0mdz",
    "id": "1je0mdz",
    "selftext": "",
    "comments": [
        {
            "author": "MaxEmerald77",
            "body": "Absolutely fucking cooked. My god.\n\nhttps://preview.redd.it/xkd5mqp60fpe1.png?width=1170&format=png&auto=webp&s=e09b3d8c804b3b39ccf0e449b7cedb175fca355d",
            "score": 364,
            "replies": []
        },
        {
            "author": "Clear-Anything-3186",
            "body": "It's funny seeing Joker being called \"Akira\" in Strikers fan content because Strikers already has a character named Akira.",
            "score": 304,
            "replies": [
                {
                    "author": "traditional_prompt64",
                    "body": "Yeah I was confused for a second",
                    "score": 61,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nothatcreative55",
            "body": "I always thought Futaba had some anger on Akechi for killing her mom, I’m kinda happy that was brought up here",
            "score": 173,
            "replies": [
                {
                    "author": "ScorpioTheScorpion",
                    "body": "It’s a lot more succinct in Royal that Haru and Futaba really don’t forgive Akechi for what he did to them. But they do understand why he did what he did, and they’re willing to put their negative feelings aside in the moment to do what needs to be done.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "abandonedDelirium",
            "body": "Highly recommend the fanfic Daredevil, You've Hit the Wall by ez_cookie on AO3. It's a retelling of Strikers with Akechi and Sumi added to the cast and it's really good. It has some great interactions between Akechi and Futaba/Haru and it also gave Joker a super interesting character arc related to his hero complex and guilt over failing to prevent Akechi's death in the engine room.",
            "score": 77,
            "replies": [
                {
                    "author": "snvwmaidens",
                    "body": "just wanna quickly pop in and say thank you for the recommendation! i'm hovering around chapter 10 so far, it's super good so far. :>",
                    "score": 11,
                    "replies": [
                        {
                            "author": "abandonedDelirium",
                            "body": "no problem, glad you're enjoying it! there's also a sequel based on tactica if you like this one.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ReadyForKenny",
            "body": "10/10 comic, the bitterness between these two is amazing. I especially love Futaba's final words to him, like yeah I hope you have a heart so you can feel all the shit you put me through. \n\nI'm also an avid supporter of the futago siblings theory which makes this even better in my eyes.",
            "score": 37,
            "replies": []
        },
        {
            "author": "DeLoxley",
            "body": "Am I the only person who thinks Futaba in this art style laps? \n\nJust makes me want to see a slightly older take on this series at this point",
            "score": 57,
            "replies": []
        },
        {
            "author": "UnderwaterPromQueen",
            "body": "it’s nice to see art of futaba/haru interacting with akechi because this is peak. i wish it was brought up in the game more 😭",
            "score": 25,
            "replies": []
        },
        {
            "author": "Apprehensive_Beach_6",
            "body": "I really wish we had Akechi. There’s no dedicated curse user on the team (No, Joker doesn’t count)",
            "score": 106,
            "replies": [
                {
                    "author": "ConsistentAsparagus",
                    "body": "*sad Arséne noises*",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "Crimson_Zebra135728",
                    "body": "Finally! Someone brings that up!\n\nWe get Sophie who is a Bless unit with Healing and Rakunda, and then Wolf who is quite literally the best party member because of his extensive kit, but we don’t get anyone for Curse Magic. Don’t get me wrong, Arsène exists and so do the other Curse demons, but having no party member specialize in Curse always felt weird to me while playing Strikers.\n\nHell, this might just be a me thing, but Akechi’s absence is noticeable in Strikers. Not so much the fact that they don’t mention him, but just something doesn’t feel right as the narrative goes on.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "DashingCards",
            "body": "[Source](https://www.tumblr.com/argentsunshine/754662333260939264/change-of-heart)",
            "score": 38,
            "replies": []
        },
        {
            "author": "svxsch",
            "body": "I feel like this really fits both of their characters and I always hoped we’d get some sort of interaction like this. I understand they had bigger fish to fry during the third semester, but still some form of conversation would’ve been great.",
            "score": 32,
            "replies": []
        },
        {
            "author": "SnowySongBirdy",
            "body": "I adore this, like i wish this was canon",
            "score": 8,
            "replies": []
        },
        {
            "author": "ArloVerde",
            "body": "https://preview.redd.it/tou0v1d8gipe1.jpeg?width=750&format=pjpg&auto=webp&s=055361d9a0392a19a25330a609c4aec322de45be\n\nPEAK",
            "score": 5,
            "replies": []
        },
        {
            "author": "JunkDog-C",
            "body": "I hate that Akechi and Sumire aren't around for strikers",
            "score": 11,
            "replies": [
                {
                    "author": "TRaywen_",
                    "body": "Seems like that‘s because royal and strikers were developed roughly around the same time. The devs probably didn’t even know if they are making a sequel for vanilla or royal. The last arcs of royal and strikers also are very similar in message (one does it better than the other though lol).",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "suzume1310",
            "body": "This is canon for me now - what a great comic!",
            "score": 8,
            "replies": []
        },
        {
            "author": "originalno_name",
            "body": "I would have more respect for PT if they openly hate akechi insted pretending they care about him, the engine room discourse feels really hypocritical because of it\n\nwe need more of this",
            "score": 15,
            "replies": [
                {
                    "author": "ReadyForKenny",
                    "body": "They're not pretending, they do care about him lmao. At least enough for him to still be offered an olive branch after all the shit he did.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "originalno_name",
                            "body": "they care so much that they handled the situation in the worst possible way, as if they want to make akechi angry on purpose, even doing nothing would be more helpful",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "ReadyForKenny",
                                    "body": "They beat his ass until he calmed down and managed to talk him into abandoning his years-long vendetta against Shido. Akechi was ready to go with them until the cognition showed up. I'd say that's about one of the best ways they could handle it.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "sushiibites",
                                            "body": "This is random but honestly that battle I think would’ve been so much cooler if it came down to JUST Akechi vs Joker instead of everyone vs Akechi. Even if it started as the PT team at first but came down to just the two of them.. that would’ve made it for me.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Demonicbane",
                    "body": "You really missed the point of the engine room. But it's your opinion so I won't argue with it.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Bambuskus505",
                    "body": "\"Tell me you completely missed the point of his character arc without saying it directly:\"",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Monamona072",
                    "body": "I kinda agree, when I saw the engine room scene in the base game it felt forced and out of nowhere since we never saw them feeling sorry towards Akechi before that. I wish there were more buildup before that.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sushiibites",
                            "body": "Nah there was definitely the seed of it there before, especially with Joker and Akechi interacting and him stopping by Leblanc frequently - they built a kind of relationship, despite the rivalry. but this is exactly why Royal does it so much better because it does really flesh out that connection and makes it hit so much harder. It’s more suggested in vanilla that they formed that relationship rather than really shown.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Monamona072",
                                    "body": "Yeah I think Joker and Akechi's bond made sense in Royal. Still I think the writing could've handled Futaba and Haru's attitude towards Akechi better in the engine room scene. I know both of them are really really nice people who believe that people can change for the better, but still I don't think there were enough buildup for them to act so kindly. Especially Haru, she lacked screentime so she could've got spotlight in Shido's palace.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "sushiibites",
                                            "body": "I honestly think it would’ve been cool to see Haru and Futaba give in a bit to that. Would’ve deepened their stories and characters. As you said they’re good people and believe Akechi can change but they’re also just teenagers, the game shows multiple times how these kids are good but lack the emotional maturity at times to handle things in the ‘right’ way. They mature with the story. \n\nI think it would’ve been cool to see both of these girls at some point express an anger or hatred towards Akechi that they work through by coming to understand him and his situation, and grow through either acceptance or forgiveness if they choose. I know I’m thinking too far into it but I agree with you their writing in that arc could’ve given us so much more lol.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Monamona072",
                                                    "body": "I’m with you that Shido’s palace could’ve been a lot better. Still a fantastic game but since I played base game first and payed full price twice I wanted more contents added in Royal haha.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "sushiibites",
                                                            "body": "Oh yeah it’s brilliant, and I understand there’s gotta be some kind of cutoff point, it’s pretty long already. But yeah there’s some stuff I would’ve loved to have seen haha",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ganbazuroi",
                    "body": "Realistically if I were in Haru or Futaba's shoes I'd be laughing my ass off after the Engine Room, don't let the Gates of Hell hit your ass on the way out, fucker lmao",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Falchion92",
            "body": "His name is Ren, damn it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "bwburke94",
            "body": "He's a dead traitor, and it's best if he stays dead.",
            "score": -42,
            "replies": [
                {
                    "author": "gazeboconjurer",
                    "body": "He didn’t betray Sumi, although only by the fact that she wasn’t around at the time. In fact, he’s only helped her by around the game ends. They could still be friends, even if you consider any other theives related relationship with him to be unsalvageable.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "ogsoul",
            "body": "what the fuck is this artstyle dawg 😭",
            "score": -9,
            "replies": []
        }
    ]
}