{
    "title": "I FINISHED MY FIRST PLAYTHROUGH LAST MONTH",
    "author": "KonoHope-sama",
    "subreddit": "Persona5",
    "rank": 15,
    "score": 117,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 22,
    "url": "https://i.redd.it/0pbkn4v9yfpe1.jpeg",
    "id": "1je3o9p",
    "selftext": "All right guys, gotta admit I love this game!\n\nHere's a big Perosona fan from Brazil, I just wanted to share with you that last month I finished my first playthrough within 203 hours (for the first in-game MONTHS, I looked every corner to see every detail, never skipped any dialogue and went for building \"ultimate Personas\" for each element, when they get ready, I'll make another post).\n\nI've already started another playthrough, which I'm already starting the Sae Arc within 90 hours (by this time on my first playthrough, I still was at Futaba's Palace).\n\nAnyway, sorry for bad English, I'm still trying to learn this language day by day!",
    "comments": [
        {
            "author": "Zealousideal_Goat774",
            "body": "Bro took the \"Take your time\" at the start really seriously",
            "score": 44,
            "replies": []
        },
        {
            "author": "Just_Here808",
            "body": "Almost 204 hours?! Did you just leave the game on while running errands a lot?",
            "score": 8,
            "replies": [
                {
                    "author": "KonoHope-sama",
                    "body": "I played the game entirely lol, I just took my time literally",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Just_Here808",
                            "body": "Respect lol",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ill_Mortgage_6490",
            "body": "Parabéns por ter terminado o jogo, amigo!!\nPersona 5 é incrível mesmo, terminei o jogo ano passado, eu sonho com o jogo lançando em português algum dia, vi até que criaram um abaixo-assinado pra isso no Twitter kkkkk",
            "score": 7,
            "replies": [
                {
                    "author": "KonoHope-sama",
                    "body": "Não sei se o 5 ganharia uma versão PTBR algum dia, mas os próximos com certeza virão legendados, já é uma grande vitória pra todos que puderem jogar esses jogos maravilhosos",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Criss_Sheik",
            "body": "200 hrs this is the way",
            "score": 2,
            "replies": []
        },
        {
            "author": "Teflonscribe",
            "body": "A lot of grinding I see.",
            "score": 2,
            "replies": [
                {
                    "author": "KonoHope-sama",
                    "body": "Mementos was my most visited place for sure",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Teflonscribe",
                            "body": "Mine too. Lol. Did you nail the timing on flu season and farm reapers? I max leveled all of my party members in a day.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KonoHope-sama",
                                    "body": "I didn't know about this flu season thing, but I think I killed Reaper five times in order to get the achievement on Thieves Den. Ryuji Instakill also breaks the game in order to give easy XP",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Teflonscribe",
                                            "body": "Well done!!! I grinded Mementos to max level, fill the compendium and fuse an unbeatable persona that does break the game. I fused a Yoshinitsu with no weakness, all reflects and drains for every possible attack class or element type.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "KonoHope-sama",
                                                    "body": "I've built my Yoshitsune like this too, but I'm going to rebuild him with all drain elements instead of nulls/repels just for flavor lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Teflonscribe",
                                                            "body": "That’s a good idea. It can be tricky to perfect the checks and balances if you get too greedy. Love this fckng game so much.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Weewee_time",
            "body": "this is the correct way to play. Welcome fellow 180hr+ player",
            "score": 2,
            "replies": [
                {
                    "author": "KonoHope-sama",
                    "body": "Enjoyed almost EVERYTHING of this game",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fernando753416",
            "body": "Nice and congrats! Gotta ask tho. What romance and ending did you go with and do you plan on sticking with that for the second play through or mixing it up?",
            "score": 1,
            "replies": [
                {
                    "author": "KonoHope-sama",
                    "body": "I romanced all the girls (except Chihaya cause I chose the wrong dialogues and wasn't following a guide, also I didn't get Akechi 3rd awakening for the same reason) and got the Royal Ending, now I'm doing a second run in order to achieve 100% on Thieves Den (awards, cutscenes, songs, gallery) so I'm gonna wait till the last possible day to rank 9 Maruki and gonna romance Chihaya (just for the achievement, but best girls for me are Togo\n\nIf I were to save time though, I should've done the vanilla ending first and then do the Royal ending on the second playthrough",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SubstantialAction918",
                            "body": "For the Thieves Den, I believe there is an achievement for completing a playthrough with all confidants maxed but not dating anyone, so you might have to do a third playthrough or reload a save before dating anyone. Not that it's a bad thing to play for a third time",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KonoHope-sama",
                                    "body": "\"We Stand as Equals\" does not work like that, you need to have a platonic relationship with the 10 girls, but it doesn't necessarily need to be in the same run,in fact, you can also savescum to win the award in just one playthrough",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}