{
    "title": "What are they?",
    "author": "ComfortableTurn8948",
    "subreddit": "Persona5",
    "rank": 3,
    "score": 270,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/gallery/1jegd26",
    "id": "1jegd26",
    "selftext": "What exactly are the velvet room attendants? Are they shadows?",
    "comments": [
        {
            "author": "Lz537",
            "body": "Cognitive beigns designed to help the Wildcards on theur jorney.\n\nMaybe created by Igor.\n\n\nMarie is not an attentand, she just chills there.",
            "score": 314,
            "replies": [
                {
                    "author": "Floppydisksareop",
                    "body": "Isn't she a meteorologist currently? As in, she both announces AND decides the weather in Inaba?",
                    "score": 135,
                    "replies": [
                        {
                            "author": "FederalBeyond1122",
                            "body": "She’s a minor goddess who also doubles as a weather reporter",
                            "score": 125,
                            "replies": [
                                {
                                    "author": "Electronic-Spend364",
                                    "body": "And also loves a human",
                                    "score": 26,
                                    "replies": []
                                },
                                {
                                    "author": "heyimmaboredkay",
                                    "body": "Technically her job wouldn't be a weather reporter but a weather controller. Well the kids think the latter anyway.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rocket_of_Takos",
                    "body": "I thought they were dolls brought to life, created by Igor.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "StupidSparkyLJ",
                            "body": "I'm pretty sure he implies at the beginning of Episode Aigis that he's a doll brought to life by Philemon, but I don't think there's any evidence that the attendants are also dolls.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Canadia86",
            "body": "Cute",
            "score": 100,
            "replies": [
                {
                    "author": "arrokudatime",
                    "body": "Hot, in Elizabeth and Margaret's case",
                    "score": 15,
                    "replies": [
                        {
                            "author": "StupidSparkyLJ",
                            "body": "People can be both.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AzailiusArts2003",
            "body": "I mean we know Igor CAN just straight up make people based off morgana .. I assume theyre his creations",
            "score": 92,
            "replies": [
                {
                    "author": "7pikachu",
                    "body": "Untrue cause Morgana's a cat\n\nAlso does Igor just kind of Frankstein them into existance? That'd be kinda funny but messed up",
                    "score": 47,
                    "replies": [
                        {
                            "author": "NeonTiger1135",
                            "body": "I mean they are all named after Frankenstein characters",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "7pikachu",
                                    "body": "https://preview.redd.it/admu30fszipe1.jpeg?width=683&format=pjpg&auto=webp&s=224e77d828f130fbf6fa3ab3151bfb7a2ff6dc93\n\nWait really no way my theory may actually make sense",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "rotary-dials",
                                            "body": "yup. Elizabeth Lavenza, Justine Moritz, Caroline Frankenstein, Margaret Saville. Theodore comes from Theodore Bohmer from the film the Ghost of Frankenstein, and Igor himself comes from Igor, the assistant in pretty much every adaptation.\n\nprobably comes from the fact that Igor is a doll given life by Philemon, like Frankenstein. to give your theory more merit.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "7pikachu",
                                                    "body": "I really gotta play persona 1 and 2, Philemon looks sick \n\nAlso If Igor is a doll and he is making more that's kinda like, him expanding his family? Sort off? That's cool, i always wanted to read Frankstein, now It's even more",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "eddmario",
                                    "body": "And Victor himself is canon to the full SMT franchise.  \nEven shows up in *Soul Hackers 2*",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Rimuriku",
            "body": "grrrr, its MARGARET in p4, Marie is just a resident not an attendant!",
            "score": 76,
            "replies": [
                {
                    "author": "ComfortableTurn8948",
                    "body": "https://preview.redd.it/ll4dvzpdripe1.png?width=512&format=png&auto=webp&s=4d22955bd9399a8d4fef8fece4020b63cffebf34",
                    "score": 49,
                    "replies": [
                        {
                            "author": "xd-Sushi_Master",
                            "body": "https://preview.redd.it/pp0nvu8lsipe1.jpeg?width=622&format=pjpg&auto=webp&s=7768aca5d0f38036fdad50c9038e8f9739f8d998",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "foodrunner464",
                            "body": "The best attendant.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skull_kid1119",
            "body": "From what I get they are assistants that each protagonist get to help them through there journeys, each of them holds a compendium of persona the protagonist fused and can use. Marie isn't an attendant she was just staying in the room cause she had nowhere to go. The attendants all have yellow eyes and silver hair",
            "score": 18,
            "replies": []
        },
        {
            "author": "Parzival-Bo",
            "body": "We still don't exactly know what they are. Clearly not human, at any rate.\n\nMarie is technically a \"mere\" shard of a cognitive goddess but for all intents and purposes she's a deity in her own right. Still, she's a different species from the Attendants entirely.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Nild_of_Astora",
            "body": "The Most difficult opponents",
            "score": 8,
            "replies": []
        },
        {
            "author": "robby_x",
            "body": "Idk, but I'd say they're like Igor. Creatures that only exist in that world between consciousness and subconscious.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ulape00",
            "body": "Created either by Igor or Philemon, the Rulers of Power aren't Shadows, but are entities whose role it is to guide the Wild Cards in the use of their power, and assist their progress in the trials they face.  Each Wild Card gets the attendant best suited to him or her, so a rapport will develop between them.  Of course they develop rather more than a \"rapport\" with the guests we know about.  It's implied they have a destiny of their own to fulfil, though only Elizabeth has embarked on that destiny so far.    \n\nMarie isn't one of them, she is >!the goddess Izanami-no-Mikoto, who once restored to her true self acts as the protective guardian of Inaba, as well as controlling the weather.  She's fairly new to coming back to her full power after a long time as a fraction of herself, not knowing who or what she was, so she's not too powerful at the moment.  Even so, she manages to hold the line against Hi-no-Kagusuchi until Yu and his fellow persona users can defeat him - she also makes sure all the people of Inaba are safe during the whole ordeal!<.",
            "score": 8,
            "replies": []
        },
        {
            "author": "RS-YW",
            "body": "Baddies",
            "score": 9,
            "replies": [
                {
                    "author": "RS-YW",
                    "body": "(Excluding Lavenza)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pedroboii",
                            "body": "ESPECIALLY Lavenza ~~for legal reasons this is a joke~~",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "evios31",
            "body": "The best",
            "score": 4,
            "replies": []
        },
        {
            "author": "Skraporc",
            "body": "Igor, the Demon Painter, Nameless, and Belladonna are all implied to be creations of Philemon. The attendants are implied to be creations of Igor’s, and all seem to have some ontological relationship to shadows and cognitive beings.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Training_Pen_832",
            "body": "Dolls constructed and given life through supernatural means. They’re created to guide, provide assistance and companionship to Wild Cards. Through forming bonds with their Wild Cards they learn more about humanity and by extension themselves.\n\nMarie is different though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "7pikachu",
            "body": "If the Velvet Room exists between mind and matter, reality and dream, then It's residents must do too",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zeeshmania",
            "body": "They're just chill guys",
            "score": 2,
            "replies": []
        },
        {
            "author": "Karnewarrior",
            "body": "They are Those Who Preside Over Power.\n\nAFAIK this means they're essentially humanoid constructs not dissimilar to Personae or Shadows, but on a totally different axis and crafted purposefully by Philemon, who's essentially the Good God to Nyarlothep's Bad God. It's their duty to attend to notable people in the Velvet Room (hence \"Attendant\") and ensure they rise to their maximum power in time for whatever huge threat is threatening the universe this week.\n\nI don't believe we've yet seen one at full power. When they duel their Guests they're usually holding back quite severely.\n\nI don't think they're created by Igor, but they are subservient to him as the Master of the Velvet Room. It's his duty to act as a Guide too, just in a more mysterious capacity.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Various-Complex-2192",
            "body": "Best Little Sister a Trickster could ask for, The Based one, and Marie",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wh1sk3y_Fr13nd_02",
            "body": "Waifus.",
            "score": 4,
            "replies": [
                {
                    "author": "Legend365554",
                    "body": ".....Lavenza is there",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Deathburn5",
                            "body": "They said what they meant",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Independent_Plum2166",
            "body": "Fun Fact: They’re all named after Frankenstein characters. Yes even Marie, but to show she’s an outlier, she’s named for the author, *Mary* Shelley and not a character in the book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iwasateenagegoth",
            "body": "Okay, for some reason I was under the impression they were dolls Igor created? (Aside from Marie, who came to the Velvet Room). At least Igor is a doll created by Philemon",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strawbz18",
            "body": "Many answers you can be given here but at the end of the day we have no clue lol. People think they are cognitions born from your psyche but they're also Avatars of Power who govern over strength. \n\nThey clearly are not humans or shadows but that is all that can be said for sure. They're an interesting and mysterious part of the game, I honestly hope we never get a straight answer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Realsorceror",
            "body": "It didn't even occur to me that they might be cognitive. I just assumed with all the Frankenstein names that they were artificial bodies given the spark of life. Flesh and blood but not born the normal way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ger_Electric_GRTALE",
            "body": "No idea, but what i want to know is where the hell they go after the journey. Like, i don't think they die or anything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sushiroll16",
            "body": "Friend shaped!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Luxierre_",
            "body": "Velvet Room attendants are cognitive entities of Philemon's design, tasked with aiding Igor on the protagonist's joirney. The latter, as well as the Room's.original denizens (Nameless, Belladonna and subsequently the Demon Painter) all professed to being servants (and presumably other creations) of the former.\n\nMarie is confirmed verbatim to be another incarnation/fragment of Izanami, just like to the others that were fought as bosses in Persona 4.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Syrupthief07",
            "body": "Velvet room assistant at the end of P5, Velvet Room assistant in P4, and idk abt the last girl",
            "score": 0,
            "replies": [
                {
                    "author": "IllConsequence506",
                    "body": "The second one is Elizabeth from P3 and the last one is Marie from P4, who isn’t really an attendant she’s just >!a goddess with memory loss who got lost!<",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Syrupthief07",
                            "body": "I tried to keep the vague to avoid spoilers but thank you :D",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}