{
    "title": "which of the Phantom thieves is most likely to have a Tik Tok account?",
    "author": "Local_Neighborhood50",
    "subreddit": "Persona5",
    "rank": 9,
    "score": 46,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 19,
    "url": "https://i.redd.it/hjh2yn2osjpe1.png",
    "id": "1jelk63",
    "selftext": "",
    "comments": [
        {
            "author": "Suzume175",
            "body": "Futaba probably watches all the TikTok. Ann actually posts. Makoto is like, \"How you do fellow kids. Is this the tickytocks the young people are into these days?\"",
            "score": 37,
            "replies": [
                {
                    "author": "AlexTheGreat1997",
                    "body": "Makoto: Tiktok? I already know what time it is.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hoshi_Hime",
            "body": "Ann has an account where she posts her model gigs, GRWM etc but i see her more prone to use Insagram\n\nSumi posts gym videos time to time or Cinderella edits\n\nJoker posts coffee making videos. He never shows his face but sometimes Mona pops up in the frame\n\nAkechi needs it for his detecrive prince gig\n\nFutaba does not post but has an account and trolls Akechi's",
            "score": 32,
            "replies": []
        },
        {
            "author": "EdJewCated",
            "body": "ryuji doesn’t post but his entire fyp is anime edits and manga slideshows\n\nharu definitely gets those ASMR hydraulic press videos on her fyp",
            "score": 1,
            "replies": []
        },
        {
            "author": "dtrain2495",
            "body": "Ann 10000%",
            "score": 7,
            "replies": []
        },
        {
            "author": "OoguroRyuuya5",
            "body": "Akechi is pretty much a celebrity and given how his public image is perfectly crafted, he’d definitely use Tik Tok as a way to capitalise on trends further up his popularity as Detective Prince.\n\nAnn is a model and would be someone who uses it to express herself.\n\nHaru maybe but it’s more to do with her plants and coffee than anything about herself.\n\nFutaba wouldn’t show her face.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Guidance9105",
            "body": "All because they are Gen Z",
            "score": 5,
            "replies": [
                {
                    "author": "Local_Neighborhood50",
                    "body": "I'm 2005 gen z and I don't have one.\n\nthen again I also despise most modern trends.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lazyph0enix",
                    "body": "Gen z here and actually a lot of my friends don’t have tiktok like a 1 to 1 ratio, but everyone who does is super into it (me included)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Sun_3000",
            "body": "Futaba",
            "score": 3,
            "replies": []
        },
        {
            "author": "SsjSylveriboi",
            "body": "Ann Futaba Ryuji and Ren send TikToks to each other on a daily basis. Ren downloaded the app so he can see the tiktoks his friends send him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Senior_Schedule_4124",
            "body": "Futaba. She is a techno whiz. Also, the Phantom Thieves are evil.",
            "score": 1,
            "replies": [
                {
                    "author": "Local_Neighborhood50",
                    "body": "I think I found akechi's reddit account.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Realsorceror",
            "body": "Makoto has just discovered it and sends videos you’ve already seen. \n\nYusuke has just discovered it and sends videos no one has ever seen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bstuna13",
            "body": "Ann!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DorothyDrangus",
            "body": "Ann tries to make Ryuji do TikTok dances with her on a daily basis",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdExtension8954",
            "body": "Joker - Posts cat videos with Morgana from his hometown. The other Phantom Thieves can hear what Morgana is saying but to most people Joker is just posting noisy cat clips.\n\nRyuji - I think he has one, and he posts those clips in which he speeds up the video to look like he is running really fast. (And in his case he can.)\n\nAnn - She has one but doesn't post often on it since she's not the type to make tutorial or comedic videos which (to my understanding, I don't use it) is largely what is posted on TikTok. She'd definitely record a few short videos during moments with friends though, especially clips of Yusuke whenever she's back in Japan.\n\nYusuke - Speak of the devil, I don't think he uses it at all. Yusuke definitely uses Pixiv though. And, as mentioned, he definitely shows up in funny videos Ann posts.\n\nMakoto - Doesn't post anything on it, but uses a burner account to watch the content to see what the other young people like. And, after she's graduated then she'd just watch what her friends are up to.\n\nFutaba - Posts gaming clips, and hacks her own page to have special effects on it. Posts hacking tips and also probably records \"Inari\" sometimes (since he's still in Tokyo like her) which gives him a presence on the platform, as well as her other friends when they visit. She also totally sometimes films Sojiro and asks him a silly question about coffee or something.\n\nHaru - Almost exclusively records official Okumura Foods branded content, but she appears in her friends' videos when visiting, and sponsored videos as well. \n\nAkechi - >!He makes POV you’re a zombie videos, he made detective prince content before December, and weirdly vague threat content as well. He also sometimes records Ren when he’s not looking.!<\n\nYoshizawa - She posts gymnastics content and motivational content, also totally sometimes does some funny things with Futaba since I think they are in the same class.\n\nMaruki - Was introduced to it by Yoshizawa. He posts really reassuring kind videos toward everyone, as well as simple taxi driving tour videos, and he sometimes collabs with the Phantom Thieves who live in or visit Tokyo. \n\nMishima - Posts absurd meme videos, and he definitely struck a deal with Futaba to manufacture fake drama and apology videos to make each other more popular since Futaba can hack the algorithm. \n\nHifumi - Her mom doesn't let her use it, but after she lives alone she just posts the chess tips content but with Shogi.\n\nIwai - He posts workout videos and shows off his gun collection. Sometimes does a collab or two with Futaba (who told him about the app) since the two met at that enthusiast store and seemed to have similar interests.\n\nSae - Posts political commentary videos approximately five times a year but never watches anything on TikTok.\n\nShinya - Posts Gun About clips and videos from his elementary school.\n\nChihaya - Does live streams (are those on TikTok?) where she tells the chat's fortune, until they go too viral so she can't help one person at a time.\n\nOhya - Posts worse comedy than Mishima.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key_Shock172",
            "body": "Ann would. Ryuji would have one. Maybe Haru too but hers would probably be controlled by her company.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ADXII_2641",
            "body": "Ann",
            "score": 1,
            "replies": []
        }
    ]
}