{
    "title": "15 hour flight. My media screen encrypted itself",
    "author": "Nerfarean",
    "subreddit": "Wellthatsucks",
    "rank": 16,
    "score": 29809,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 459,
    "url": "https://www.reddit.com/gallery/1jd1g4v",
    "id": "1jd1g4v",
    "selftext": "",
    "comments": [
        {
            "author": "mickturner96",
            "body": "As the air flight assistants about it \n\nYou might get moved to a different seat... Maybe a better seat",
            "score": 8731,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "I did. Flight was completely booked",
                    "score": 5921,
                    "replies": [
                        {
                            "author": "standardtissue",
                            "body": "well shit.  I hope you were able to make the best of it.  I would go mad.",
                            "score": 2845,
                            "replies": [
                                {
                                    "author": "Nerfarean",
                                    "body": "8 hours of sleep, 7 hours of Minecrack ",
                                    "score": 3905,
                                    "replies": [
                                        {
                                            "author": "ZubacToReality",
                                            "body": "You slept for 8 HOURS in an economy seat? I am so insanely jealous lol I cannot sleep for 8 straight hours in my own bed. The longest I've slept in economy is 20 minutes.",
                                            "score": 2362,
                                            "replies": [
                                                {
                                                    "author": "Nerfarean",
                                                    "body": "Yeah but my neck is killing me",
                                                    "score": 1368,
                                                    "replies": [
                                                        {
                                                            "author": "Diligent_Elk_7451",
                                                            "body": "Always, always carry a neck pillow when flying coach.",
                                                            "score": 554,
                                                            "replies": [
                                                                {
                                                                    "author": "Nerfarean",
                                                                    "body": "This. I hacked one together by rolling a blanket into neck pillow shape. Did help ",
                                                                    "score": 596,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SomeReddita",
                                                                            "body": "![gif](giphy|1082yS2HMbLMSQ)\n\nSame energy",
                                                                            "score": 265,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ThePizzaNoid",
                                                                                    "body": "![gif](giphy|XydXaWB0qZiIo)",
                                                                                    "score": 69,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "theamydoll",
                                                                            "body": "Did you fold the headrest in to rest your head against it, at least?!",
                                                                            "score": 21,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "BackWithAVengance",
                                                                                    "body": "SO many people don't know the headrests do that. I went out to Cali a couple weeks ago, turned my headrest into a HANS device",
                                                                                    "score": 27,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "gabbagabbawill",
                                                                                            "body": "Do what now",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "jmlinden7",
                                                                                                    "body": "You fold the sides of the headrest inward to form a neck/head restraint. Some even let you fold the bottom upward to provide more support there as well.",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "gabbagabbawill",
                                                                                                            "body": "On a seat in coach? Of all the times I’ve flown I’ve never had a clue about this. I’m having a hard time picturing it.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "jmlinden7",
                                                                                                                    "body": "Long haul flights usually have them, short haul is hit or miss",
                                                                                                                    "score": 2,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "Rainydayday",
                                                                                            "body": "I didn't know this was a thing until I was in Japan and noticed that all of their public transport does this. It's so comfortable.",
                                                                                            "score": 4,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "Expensive_Yam_2222",
                                                                                            "body": "I've never heard of this but I'm happy I learned this today. I bought a neck pillow the last time I had to fly and it broke before the first layover and was spilling those tiny plastic beads out.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "HairySonsFord",
                                                                                            "body": "They never fold in enough, though! My head always feels like it's slipping/rolling off the headrest",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "danyoff",
                                                                            "body": "I do this sometimes with jackets, i roll them to fit the gap between my neck and the seat and it helps.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "Clone-Wars-CT-5555-",
                                                                            "body": "Serious question, did you take any medication or consume anything that helped you sleep that long on the flight?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "siltyclaywithsand",
                                                                    "body": "The neck pillow is great. I also always take a hoodie and put it on backwards. Hood up over my face for darkness. Not for everyone since your breath gets trapped in it. But I can never keep a sleep mask on, so that is my go to.",
                                                                    "score": 17,
                                                                    "replies": [
                                                                        {
                                                                            "author": "nirmalspeed",
                                                                            "body": "I've used [this](https://a.co/d/b0LTd1H) mask for 5 years now and it rarely slips off. This one has a section for your nose bridge with a bendy wire that you punch to secure it. That's the reason I like it versus the generic mask. I sleep on my stomach so with a normal mask, if I move my head at all, it'll come off. Also, the straps can be tightened versus the fixed length straps that get too loose over time.\n\nThe seams for the foam insert can fail after a while but I just fixed it myself with a thread and needle. I don't actually know how to sew but whatever I did is holding up fine.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "siltyclaywithsand",
                                                                                    "body": "Thanks. But I'm a violent sleeper. I use a 19lb single weighted blanket and a 25lb twin together and at least one ends up on the floor every night. When I'm sleeping somewhere that isn't my bedroom, I usually tie a t-shirt around my face as a blindfold. That doesn't last either. I usually have to find it and re-tie it at least twice.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "nirmalspeed",
                                                                                            "body": "> I'm a violent sleeper\n\nIs this you? https://m.youtube.com/watch?v=J7f0i1-owwU",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "siltyclaywithsand",
                                                                                                    "body": "I have been compared to Tina Belcher before.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Altruistic-Piece-485",
                                                                            "body": "Ever tried cinching the hood down to cover your eyes then tieing it off? That way it doesn't cover your mouth. I do that and it works well for me. I have a big head so sometimes I need to pull the back of the hoodie up a bit so the hood reaches further down my face though.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "siltyclaywithsand",
                                                                                    "body": "Yeah, that doesn't work for me for long.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Diligent_Elk_7451",
                                                                            "body": "Why not just use an eye mask?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "siltyclaywithsand",
                                                                                    "body": "Eye masks don't stay on my face. I move around too much. Even in a tiny airplane seat.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "aerostotle",
                                                            "body": "so is lung cancer from all those cigarettes",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Hopeira",
                                                    "body": "I had a good 2 hour nap on a 3 hour flight in economy last week. I don’t even fly very often, but exhaustion is one heck of a sleep aid!",
                                                    "score": 35,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CockpitEnthusiast",
                                                    "body": "My record was 14 hours on my flight home from overseas. Fistful of benadryl and teleported back home",
                                                    "score": 39,
                                                    "replies": [
                                                        {
                                                            "author": "HoozleDoozle",
                                                            "body": "hydroxyzine for me. + melatonin if I’m landing in the AM",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "pgraczer",
                                                    "body": "i can’t do this without xanax",
                                                    "score": 27,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "theDomicron",
                                                    "body": "As the media library on long haul flights has gotten better, my ability to sleep has definitely gone down. Don't get me wrong, on a 15 hour flight I definitely sleep, but I used to sleep for like 8 to 10 hours, and last couple of trips it's been maybe half of that. \n\nThe trick though is to get an extra pillow or blanket for lumbar support and to be 5'8 so you aren't super cramped in your seat. I also prefer the window seat so no one bothers me when they have to pee",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "pannenkoek0923",
                                                            "body": "Once I watched the Fellowship of the Rings and Two Towers (sadly only theatrical editions) on a flight, and then Return on the King on the connection. Best flight ever",
                                                            "score": 15,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "i_forgot_my_sn_again",
                                                            "body": "I haven't been 5'8 since sophomore year in high school. Being 6'1 sucks on domestic flights, having to deal with that on 10+ hour international flights is part of what hasn't let me go across the Atlantic or pacific. \n\n\nI've flown from Texas to Costa Rica but that's only like 4 hours which I'm used to.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Esava",
                                                                    "body": "I have essentially flown around the world a ton of times and I personally am decently fine with it as long as I don't injure my knees during sport again. \nI am fairly tall (194cm) too. You gotta remember that long distance economy usually has slightly (but not that much) more space and usually also (slightly but noticeably) better seats than domestic flights. \n\nBut I fall asleep decently well in airplanes. I just put in headphones with an audiobook (important: really good voice actor, but atleast there are a lot of those in German) and I can just shut off and fall asleep. \n\nEither way in my experience US domestic flights are usually a bad experience anyway. I have flown my fair share of cheap airlines in Europe and Asia as well and while they are also optimized and cheap, the \"vibe\" often feels better. \n\nBut the differences between economy seat comfort on long distance flights is night and day depending on the airline one is flying with. Like I have had some truly terrible seats on some transatlantic KLM and Delta flights, Lufthansa (and the entire Star alliance) is usually pretty good for long distances but some others (Japan Airlines, Korean Air) just have better economy class. \n\nOne small thing: I have flown a lot of business class for work too. I personally would never pay that much extra for it but while the differences are bigger than in economy depending on the airline (also in regards to food, behaviour the staff etc.), I would argue that it matters LESS as all (long distance) business class seats are comfortable enough to sleep and in my experience the food is always decent. After all it's just  a method of travelling, not a prolonged hotel stay. \nFor me personally (as I can fall asleep in economy seats as well) the bigger factor is when I am on a work trip and have a stopover (for Germany it's often Frankfurt) after my long distance flight before taking the short 1h flight back to my home airport: \nIt's just so nice to just stroll into a Lounge in the airport, take a shower, have a decently quiet and calm environment and getting some free acceptable food. Then I get home feeling well instead of feeling \"airplane/travel sweaty/dirty\". \nThis is also nice when I have to take a flight really early in the morning. Stopping by a lounge and having a free coffee and some free breakfast is just nice. \n\nI have a status with Star alliance that allows lounge entry but honestly: you can pay to have access to most lounges just then and there (or book it online)  even if you have an economy ticket. If you have a longer stopover you would probably need to buy some food at the airport anyway. Then the price for the lounges isn't that high anymore and so much more worth it than  a business class flight experience in my opinion.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "shintojuunana",
                                                                    "body": "The trick is to stop caring if you can feel your knees anymore. (International sucks so badly, my legs hurt so much when I get up, even if I move around the cabin occasionally)",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "-WhiteOleander",
                                                    "body": "I'm incapable of sleeping sitting down, so I never sleep on a plane. When I flew from Europe to New Zealand I was awake for 36 hours straight.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Nelly03",
                                                            "body": "I can’t either, and fly 12 hr routes often. \nOnce I took a Xanax, hoping it would help me sleep. Nope. Instead it made me really grouchy and awake.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "crispypancetta",
                                                    "body": "I just did a massive sleep. Oxycodone, NyQuil PM, and a few glasses of wine and I was out. Little bit woozy on the other side not recommended if you need to drive.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "_who-the-fuck-knows_",
                                                    "body": "My hack is not sleeping the night before a long haul. And the bonus of not being able to itch my vices just makes my brain turn off and I'll sleep on and off for most of it. I'm that guy waking himself up when my head falls forward lmfao.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "achtungbitte",
                                                    "body": "75mg mirtazapine when I had a 21h flight.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "weirdstuffgetmehorny",
                                                    "body": "Be careful what you wish for lol I can sleep anywhere for hours on end, including economy, but the catch is I’m such a deep sleeper I had to buy a bracelet that shocks me awake (with electricity) to make sure I don’t oversleep work in the mornings.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "phillysan",
                                                    "body": "Sammmmmeee I cannot sleep on planes. It sucks :(",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Jaggar345",
                                                    "body": "I slept 8 hours once on a red eye flight. Took melatonin and that shit knocked me out otherwise I cannot sleep on planes.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "adamwill86",
                                                    "body": "I sleep for 58 minutes on an hour flight in economy, thats why I always pick the window seat so I can lean against it. \n\nUsually wake up and we bounce off the tarmac.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Esava",
                                                    "body": "I always do. If you look around on long distance flights (especially when they are overnight) you will realize that most people are actually sleeping even in the economy seats. \n\nI personally usually have a pillow with me, put in some headphones (I use overhears when watching movies on the plane, but inears when trying to relax or sleeping) and put on some nice audiobook. Then I usually either end up not really noticing the time or (far more often) just very quickly fall asleep. Honestly i might fall asleep faster on planes than at home. I sleep very well once I fall asleep but it can take a while. Probably because I am on my phone in bed, like right now. On a plane I just fall asleep to the rumbling of the engines. \n\nI am also not the tiniest person (but not quite above the 2m mark) but it works fine for me.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "garlic-bread_27",
                                                    "body": "The day before my 9hr return flight from Europe, I got up at 7am, did a lot of activities and stayed awake until 5am when the flight departed. I was asleep before liftoff, and didn't wake up until a half hour before touchdown. Didn't even eat the food I was going to get.\n\nMy neck hurt like a bitch and a half for a while, though. I was in the middle seat but my friend let me use her as a pillow 😆 this was also just basic economy. Nothing special.\n\nSlept great. Well, at great as you can in a middle seat, flying economy, after being awake for 22 hours with no assistance from caffeine or anything else",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Hayden190732",
                                                    "body": "Just lay your arms and head on the drink tray in front of you. I sleep on every single flight.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "standardtissue",
                                            "body": "lol at least you got some sleep.  better luck next time !",
                                            "score": 105,
                                            "replies": []
                                        },
                                        {
                                            "author": "rly_weird_guy",
                                            "body": "Crack always works",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "lira-eve",
                                            "body": "I used to be able to sleep anywhere at any time when I was younger and in the military. 😅 \n\nI haven't flown in almost nine years so no idea if I still can, ha.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "-Dixieflatline",
                                            "body": "Good to have backup. I always go into it assuming the IFE will be messed up just in case. Laptop with movies, book, and my phone. \n\nAlthough, I found myself just staring off into the abyss for a few hours my last 15 hour flight. 1 part jet lag, 1 part boredom of all forms of media. Who knew that raw dogging flights is actually legit?!?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Titanww8",
                                            "body": "Minecrack... Sounds like somebody had a GREAT time.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "lucky7355",
                                            "body": "I had this happen on a 15 hour flight as well and was not prepared with anything on my phone to pass the time.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ialo00130",
                                            "body": "I desperately hope you got up and moved around a few times within that time frame. \n\nSitting in a cramped airline seat for a long period of time can be incredibly dangerous.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DanTMWTMP",
                                            "body": "After your flight, they’ll have a survey for the flight. Mention that you had issues. Many airlines will give you extra miles, or other future upgrades.\n\nI once filled out a survey just mentioning how the flight entertainment didn’t work. I didn’t really mind as I usually read a book and sleep, and just merely mentioned it. My next flight, I got upgraded to business class ahhahhahaha. \n\nGranted, I’ve been a frequent flyer with United for decades (I fly a TON) so they do treat me very well.\n\nBut it doesn’t hurt to just ensure what’s wrong so they fix it, and they’ll usually take care of you with some minor to\neven major perks depending on your status with the airline.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "dm-pizza-please",
                                            "body": "Mmmm I love crack",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "YouDontKnowJackCade",
                                    "body": ">he passengers of a lengthy flight contend with their boredom as the plane's entertainment system is broken. \n\nhttps://en.wikipedia.org/wiki/The_Entertainment_System_Is_Down",
                                    "score": 72,
                                    "replies": [
                                        {
                                            "author": "GreenHairyMartian",
                                            "body": "Staring Keanu Reaves?!?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "sealab2077",
                                                    "body": "Kirsten Dunst too!  I haven't seen her since she played Mary Jane.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ChimeraYo",
                                                            "body": "Watch Civil War, it’s very apt at the moment.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "T0biasCZE",
                                            "body": "!remindme 6 months",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "RemindMeBot",
                                                    "body": "I will be messaging you in 6 months on [**2025-09-17 02:50:08 UTC**](http://www.wolframalpha.com/input/?i=2025-09-17%2002:50:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/Wellthatsucks/comments/1jd1g4v/15_hour_flight_my_media_screen_encrypted_itself/mi76p6y/?context=3)\n\n[**35 OTHERS CLICKED THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FWellthatsucks%2Fcomments%2F1jd1g4v%2F15_hour_flight_my_media_screen_encrypted_itself%2Fmi76p6y%2F%5D%0A%0ARemindMe%21%202025-09-17%2002%3A50%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201jd1g4v)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rutoca",
                                            "body": "Happened with me when the entire plane ES went down on a 12 hour flight",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "YouDontKnowJackCade",
                                                    "body": "Congrats, hollywood picked keanu reeves to play you!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "rutoca",
                                                            "body": "Yey",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Dravarden",
                                    "body": "do people really only plan around only in-flight entertainment? I always come with a fully charged phone, tablet, some sort of portable console, with a lot downloaded on them, plus a book with a lot left to read. Never been bored on 14~ hour flights\n\nmaybe because I've never been on a plane with screens",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "standardtissue",
                                            "body": "Everybody has different resources.  I don't depend on the airlines and bring my own ipad with downloaded movies but that's something not everyone can do.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "RedditIsShittay",
                                                    "body": "Books exist.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Dravarden",
                                                    "body": "people that can't afford a phone and a book probably can't afford flights with screens",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "afihavok",
                                                            "body": "You’ve never been on a 14 hour flight with screens?  I would be hard pressed to find one without screens. What significantly cheaper airline do you fly long flights on that doesn’t have setback screens?",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Namaker",
                                                                    "body": "I was once on a flight from Brazil to Germany (11h or something) operated by Condor that used an ancient 757 without screens in the seats. It did, however, have CRT screens flipping down from the ceiling every few rows, some of them with a terrible hue and obviously everyone had to watch the same movie...",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "indianajoes",
                                            "body": "I do the same. It was one thing pre-smartphones but even then you could've brought a book like you said. Nowadays, I'll always have a fully charged phone loaded with content and a portable charger. I'm hoping the screen works but if it doesn't, I've got backup.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fankuverymuch",
                            "body": "This happened to me and the airline did give me a pretty decent voucher. Unfortunately it was only good for a year and I tend to travel like never via plane. ",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "GlitteringAttitude60",
                                    "body": "Is it possible to sell those vouchers?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tame_Trex",
                                    "body": "Did you need to provide evidence?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Imaginary_Shift_6370",
                            "body": "Ask the airline about getting partial credit back from your flight. If a part of your seat is broken, you are entitled.",
                            "score": 119,
                            "replies": [
                                {
                                    "author": "TimTay144",
                                    "body": "Technically not a part of HIS seat. No refund.\n\n\\- The airline, probably",
                                    "score": 89,
                                    "replies": [
                                        {
                                            "author": "unrebigulator",
                                            "body": "And they give the refund to the person sitting in front.",
                                            "score": 38,
                                            "replies": [
                                                {
                                                    "author": "3vi1",
                                                    "body": "And they add him to the no-fly list.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SeasonGeneral777",
                                    "body": "will only require you to sacrifice a couple hours of free time on the phone with an overseas customer support agent just to earn a $20 voucher or something",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "The_Autarch",
                                    "body": "The airline doesn't guarantee anything about in-flight entertainment. Trying to get a refund for this would just be a waste of time.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Goldentongue",
                                            "body": "In flight entertainment is a well advertised perk of the airline. They want people to have access to it and enjoy it so you keep flying with them. Something like this that is \n\n\n1. Entirely out of the passenger's control\n2. Clearly unfair/an inconvenience due to a fault or defect by the airline\n3. A relatively rare occurrence where they don't have to process thousands of claims at once\n\nis exactly the sort of thing they're likely to give out at the very least a moderate voucher for. Odds are good that reaching out will at least get OP something in return.",
                                            "score": 58,
                                            "replies": [
                                                {
                                                    "author": "bakatomoya",
                                                    "body": "Last time this happened to me on Air Canada I got a $250 voucher on $500 flight, I mean I'll take it I was going to read a book or watch something on my phone anyway.",
                                                    "score": 21,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "sinkrate",
                                                    "body": "Family member had this happen on an international flight, Delta gave them a $250 voucher towards future travel",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "NitroLada",
                                                    "body": "ya, not going to get a refund. may get some miles or a bit of credit. it's like the wifi not working or running out of beef/chicken for meal choice. there is zero obligation for them to provide any compensation but they will especially if FA noted it and filed a report",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Inappropriate_Comma",
                                            "body": "Depends on the airline friend. I’ve seen people get credit for broken IFE on long haul flights plenty of times.  You pay for every advertised feature of your seat and if one of those features doesn’t work the airline will 99% of the time compensate you in one way or another.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "realpersonnn",
                                            "body": "I have gotten a credit for this exact scenario from Jetblue for $70",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "vandon",
                                            "body": "You miss 100% of the shots you never take.\n\n\nIt doesn't hurt to ask, there not going to charge you *more* because you called.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "seriousFelix",
                                            "body": "Ok big-airline 🙄",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "foolishnhungry",
                            "body": "Please make sure to complain about it post flight. I once didn’t have working audio on an 8 hour flight. Received a flight voucher at least",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "lameuniqueusername",
                            "body": "I had a screen that didn’t work on a flight from SFO to Narita. So 10ish hours. I would have read most of the time anyways but they gave us (now that I’m writing this I think it was the major the seats that had the issue) 6 or $800 vouchers for our trouble. You should reach out and see if they will compensate you",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "TheDevilsAdvokaat",
                            "body": "You've got photo evidence; I;d be asking for a partial refund at least.\n\n..also, what the hell was it encrypting?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "PM_Me_Your_Deviance",
                                    "body": "> ..also, what the hell was it encrypting?\n\nBest guess, it is being run by a thin-client and the disk is encrypting.  It's possible it was re-imaged between flights (update or fixing an issue) and something hung during the process.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "TheDevilsAdvokaat",
                                            "body": "When you say the disk is encrypting though....disks don't encrypt, applications do. Disks might contain encrypted contents, but the disks themselves do no encryption or decryption.\n\nAlso, wouldn't a client be decrypting not encrypting?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "PM_Me_Your_Deviance",
                                                    "body": "The industry term is \"full disk encryption\".  Saying the \"disk is encrypting\" is just short-hand for \"the operating system is going though the initial setup process to encrypt the storage volume\".  If you want to \"well atchully\" me, you might as well point out that this is likely solid-state and no \"disks\" were involved. \n\n>Also, wouldn't a client be decrypting not encrypting?\n\nIf you re-image a client, one of the first tasks that will happen afterwards is encrypting the drive.  Decryption usually happens silently as data is requested.  Given that an airline seat-back display is probably an old low-end tablet of some kind, the encryption process would take a while.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "TheDevilsAdvokaat",
                                                            "body": ">If you want to \"well atchully\" me\n\nThat wasn't what it was intended to be, sorry if it came off that way. It was just intended to clarify things. \n\nWhy would you encrypt a drive after reimaging the client? I can understand why encryption would be slow on a tablet as compared to a pc....but why encrypt the drive?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PM_Me_Your_Deviance",
                                                                    "body": "> why encrypt the drive\n\nI don't know specifically what's on these tablets, but it's generally done to protect corporate secrets. \n\nStuff like: license keys, proprietary software, security certificates or cached credentials.   Even stuff as simple as information about their IT department or network is stuff you'd rather keep from getting out. \n\nSometimes it's done prophylactically without a specific threat in mind. It's basically free and generally recommended as a best practice.\n\n>after reimaging the client? \n\nThe image is deployed un-encrypted. Each device has it's own encryption key, so you can't really pre-encrypt it.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheDevilsAdvokaat",
                                                                            "body": "Thanks! Very helpful.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "archetypalliblib",
                            "body": "I had the same thing happen in a Beijing -> NYC flight. They gave me 2000 miles compensation, but I didn't end up traveling with them again.\nEdit: dropped a word",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "camk16",
                                    "body": "Dollars!?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PM_ME__BIRD_PICS",
                                            "body": "Probably Yuan? about 300 us dollars.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "offlein",
                                            "body": "Compensations. 2000 compensations.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "archetypalliblib",
                                            "body": "Oops, edited. Miles. They gave me miles, but it wasn't like I had vacation time left that year or like I was going to choose their airline again.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "s0ulfire",
                            "body": "What route was it?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Nerfarean",
                                    "body": "SFO-Guangzhou",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "42ElectricSundaes",
                            "body": "That’s how they get cha",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Rincewind08",
                            "body": "Singapore airlines?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Nerfarean",
                                    "body": "China Southern ",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kr613",
                            "body": "That happened to me on an 8 hour flight, so they kept handing me beers on the house. I guess the saving grace was the fact that there was wifi on the flight and also, I had downloaded a bunch of movies and shows on my tablet. So it was fine overall.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wrld_news_pmrbnd_me",
                            "body": "Even first?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "seanchappelle",
                            "body": "Ask for a small partial refund / points / miles.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Lastburn",
                            "body": "Did they give you a voucher ? I got a 100 dollar voucher from singapore air when I told the the screen wont turn on in my flight",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "pentesticals",
                            "body": "Contact the airline. You should be able to get a partial refund. Friend of mine had this and got a refund of 200.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "WormLivesMatter",
                            "body": "This happened to me on a 4 hour flight. Got$ $50 credit back on it. Ask about that.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "NutNutInMyButtButt",
                            "body": "Was this Air Canada?? I wonder if we had the same flight! A month ago I was on a 16 hour flight, and my auxiliary in didn’t work on my screen.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CrueltySquading",
                            "body": "Bitch to the flight company about it, maybe get a partial refund",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "used_octopus",
                            "body": "Better cause a scene and get that plane turned around.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kantan432",
                    "body": "You can ask for compensation, last time my IFE did not work I got a 250€ voucher",
                    "score": 38,
                    "replies": [
                        {
                            "author": "clubby37",
                            "body": "They don't really call it an IFE, do they?  In aviation, that usually stands for \"in-flight emergency\" which basically means \"clear the fucking runway, my plane is coming down one way or another.\"  You'd think they'd come up with a different initialism for the passengers' entertainment screen.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "jrf1234",
                                    "body": "Commercial pilot here—in the plane I fly the entertainment features are referred to as IFE, I’ve never heard IFE refer to emergencies.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "clubby37",
                                            "body": "Huh, you're right, I can't find anything supporting that.  I got that information from a guy who maintained Harrier engines for the Marines, so I assumed it was solid.  Maybe I just misheard him.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheMacMan",
                    "body": "Normally they can just reboot the particular seat from their main controls. Super quick and simple.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "11teensteve",
                            "body": "but then what would we need our pitchforks for? I'm not just toting this thing around for nothing.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheMacMan",
                                    "body": "That's true. We can't have simple solutions solving these issues.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "City_of_Lunari",
                    "body": "On Delta I asked them to fix my screen and they offered to move me from business to a middle seat economy. When I said that's not even remotely fair based on what I paid they told me I was \"Becoming an issue\". \n\n\nFuck Delta all the way to the moon, though I'm amazed if they can get above 42,000 feet.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "OpenSourcePenguin",
                            "body": "Insane downgrade proposal and you aren't supposed to react to that?",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "FriskyFritos",
                            "body": "If it helps at all my man, that’s probably the least worst case option they had to offer you. They had basically three choices.\n\n-Move you to an empty seat on the plane with a working monitor; Business was likely booked up and it’s not like they could bump someone else who also paid for that seat.\n\n-Put you on a later flight in the same class if there was an open seat in Business. A huge inconvenience to you.\n\n-You tolerate it and they compensate you in flight vouchers/points. Which since you complained they offered you the only other reasonable option.\n\nAll the options suck but it happens and there’s really not much they can do and they probably tried what they could. Flight crew get so much shit and nasty comments every day so they were probably already on the defensive as they kindof always have to be.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "walkinthedog97",
                            "body": "What do you want them to do about it?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "City_of_Lunari",
                                    "body": "Inspect the screens for maintenance regularly? Offer a voucher for not having an entertainment screen on a 14 hour flight? I can think of more lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dohwhere",
                    "body": "Everyone that works as one will call themselves either “cabin crew” or “flight attendant” (it was my profession for many years). I’ve always found it interesting how many variations the general public makes of this job title though. “Air hostess”, “cabin steward”, etc. “Air flight assistant” is certainly a new one for me.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ILoveHomelessMen",
                            "body": "Same 😂",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "N8ThaGr8",
                    "body": "air flight assistants lmao",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "astralseat",
                    "body": "\"oh, sorry, that's supposed to be for the Air Marshal\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Thick_Yak7185",
                    "body": "Had a 16 hour or so flight back in 2016 with a broken monitor, it was a packed flight so the stewardess provided complimentary drinks. Never again will I get drunk then hungover then drunk again on a flight",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gamblor69",
            "body": "Tried turning the plane off and on again?",
            "score": 2874,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "Let me find factory reset button for the plane",
                    "score": 1283,
                    "replies": [
                        {
                            "author": "AlexG2490",
                            "body": "It's actually a small, button-cell style battery that has to be popped out of the plane for 30 seconds and then reinserted.\n\nThe hard part is getting to it while in flight...",
                            "score": 304,
                            "replies": [
                                {
                                    "author": "quadruple_negative87",
                                    "body": "I’m imagining a CR2032 cell the size of a manhole cover here.",
                                    "score": 124,
                                    "replies": [
                                        {
                                            "author": "Mind_on_Idle",
                                            "body": "So, a CR20320, lol\n\nPizza Battery",
                                            "score": 77,
                                            "replies": [
                                                {
                                                    "author": "ggroverggiraffe",
                                                    "body": "Actually like 45020, based on standard manhole sizing. That's wafer thin, though!",
                                                    "score": 30,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MikeDavJ",
                                    "body": "I thought it was near where the peanuts were kept?",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Next-Preference-7927",
                                    "body": "I vaguely recall an air crash investigation show where a seriously contributing factor to the crash was that they essentially tried that - pulling essential breakers in flight because that checklist was supposed to only be performed on the ground.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Muffin_The_Bear",
                                            "body": "[AirAsia 8501](https://admiralcloudberg.medium.com/blind-to-the-problem-the-crash-of-indonesia-airasia-flight-8501-b49e71f71b11)?\n\nThe pilots were having an issue with one of the rudder safety features, and the suggested solution was not working. Instead, they decided to pull the circuit breakers for some flight computers, which resulted in a large number of systems being lost. They were not expecting this and ended up stalling/crashing.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Lopsided_architect",
                                    "body": "Not if it is a boeing. Might just fall out on it's own",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sucnirvka",
                            "body": "It’s usually under the pilot’s seat. See if they will let you in.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "sicilian504",
                            "body": "Just gotta unplug it and plug it back in.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "b0jangl3s_2814",
                            "body": "That button is right next to where it gets plugged in for overnight charging",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yo_Honcho",
                    "body": "I fix aircrafts for a major airline. You’d be surprised how many times this fixes Airbuses. As smart as those airplanes are, it fixes a lot of problems.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Atomicnes",
                            "body": "Decades of IT advancements and \"turn it off and on again\" is still the #1 fix to anything",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Yo_Honcho",
                                    "body": "I used to love Boeings when I first started in my field over a decade ago but I’m leaning towards Airbuses since I’m realizing how smart the planes are. It’s like comparing analog to digital.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Moonrak3r",
                                            "body": "This depends on the model lol. If you’re comparing a 737NG with an A350, sure. But the same holds true for an A320 vs 787…",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "playwrightinaflower",
                            "body": "That sounds quite maintenance friendly. Idk how long it takes to reboot a jet or what your labor for it costs, but I'm almost sure it's cheaper than nearly every single part (maybe except the barf bags) that you could order for a fault!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NellikFPV",
                    "body": "I'm an airline avionics tech - you'd be surprised at just how many problems i've solved on aircraft via a good old hard reset!",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Mynameismikek",
                    "body": "You laugh, but the 787 MUST be periodically rebooted else the pilot data goes screwy:\n\n[linky](https://www.theregister.com/2020/04/02/boeing_787_power_cycle_51_days_stale_data/)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Cappedbaldykun",
                    "body": "Here's your 1000th upvote",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "williamtowne",
                    "body": "That's been happening too much lately.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "zleuth",
                    "body": "During encryption?? Are you insane? That's what happened to Malaysia flight MH370!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "whatshamilton",
                    "body": "You joke but I was on a flight that they accidentally did that while boarding so we had to board in the dark with phone lights for 20 minutes while the power cycled back on",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EvaderDX",
            "body": "DO NOT USE IFE SCREEN \n- U.S Military Encrypted",
            "score": 1165,
            "replies": [
                {
                    "author": "remrunner96",
                    "body": "What a solid Reddit reference lol",
                    "score": 198,
                    "replies": [
                        {
                            "author": "Empty-Part7106",
                            "body": "Got a link? Google doesn't bring anything up.",
                            "score": 69,
                            "replies": [
                                {
                                    "author": "nomoreteathx",
                                    "body": "It was a thread in the tinder sub, someone posted sceeenshots of a conversation with a scammer who was pretending they were using a military phone that added \"US military encrypted\" to every message. Can't post sub links or automod will freak out, so just use quotes to do an exact search and the thread will be the first result.",
                                    "score": 152,
                                    "replies": [
                                        {
                                            "author": "SirSoliloquy",
                                            "body": "I love how \"reddit references\" just refer to screenshots of other social media.",
                                            "score": 54,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MadeByAdidas",
                    "body": "Only OG's remember this one\n\n• U.S Military Encrypted",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Coreysurfer",
                    "body": "Attention passengers we will be landing in 15 minutes please….it starts working )",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "clarkster112",
            "body": "Plane boutta get ransomwared",
            "score": 580,
            "replies": [
                {
                    "author": "asyork",
                    "body": "Send BTC to deploy landing gear",
                    "score": 200,
                    "replies": [
                        {
                            "author": "Daniiiiii",
                            "body": "Some hack Netflix writer just stole this idea and his pitch has already been greenlit.\n\nComing this Summer... \"SKY JACKED: AIR PIRATES\"  \nStarring: Kevin Hart as a bumbling Sky Marshal who gets in the way of the civilian hero. The Rock as the civilian hero who will fly his helicopter up to the airplane and fight his way in to rescue everyone, especially his daughter who is flying to see him. Gal Gadot as the ultra badass Air Stewardess who kicks all type of ass while looking like a supermodel. Ryan Reynolds as a goofball Captain who has to contend with a dead copilot as hilarity ensues. With Robert Dinero in the tower as the guy who is too old for this shit. And some rando as the hijacker.",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "D4FF00",
                                    "body": "I think Robert Dinero is a Mexican-American money launderer.\n\nThat’s a great treatment, cracked me up.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Bd0g360",
                                    "body": "I would unironically watch the shit out of this and love every minute",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "tsukaimeLoL",
                                            "body": "Right? That sounds like a decent movie idea",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "N0ntarget",
                                    "body": "I plugged this idea into ChatGPT and it feels way too similar to what Netflix would actually put out.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "mmob18",
                                    "body": "so many kind-of-but-not-really good movie ideas absolutely fucking ruined because of Kevin Hart and Dwayne Johnson",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mjrubs",
                    "body": "Dammit, gonna be a long flight\n\nhttps://preview.redd.it/586rw2l4a6pe1.png?width=802&format=png&auto=webp&s=e38b47527e5564236ce0ebaab9170e29150cd15b",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "__Elwood_Blues__",
                    "body": "WannaFly",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Strawberry_Poptart",
                            "body": "Most under rated comment.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Frxnchy",
                    "body": "My flying-phobia would immediately land on this conclusion, “i’m about to be on the first plane crash due to hackers”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pedrop1985",
            "body": "Never rely on their systems. I always have a few shows or movies (or a book, but I have to say that's less and less often for me) on my phone and use my own devices. \nI've tried the other way and hate it when they force you through commercials or whatever; or their audio sucks, etc.",
            "score": 756,
            "replies": [
                {
                    "author": "Oranginafina",
                    "body": "All of this, plus a portable charging bank. I was in a flight from NYC to Hong Kong a couple of years ago and none of the outlets worked in my row and the plane was full. The charger kept all my devices going through the 15 hour flight.",
                    "score": 271,
                    "replies": [
                        {
                            "author": "Nerfarean",
                            "body": "This. 99wh Anker kept my Minecraft session going for 7 hours",
                            "score": 146,
                            "replies": [
                                {
                                    "author": "twenafeesh",
                                    "body": "Just [never store this kind of battery in your checked baggage](https://www.youtube.com/watch?v=Y50saxfTqQA). Cargo/luggage fires are often caused by lithium batteries, and is the reason why you can't take batteries above a certain capacity on an airplane, and why anything you buy with a battery comes with a special sticker on the box.",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "author": "bezkyl",
                                            "body": "Why would you store it your checked baggage when you need it in the cabin….🙄",
                                            "score": 94,
                                            "replies": [
                                                {
                                                    "author": "twenafeesh",
                                                    "body": "IDK, maybe you want it at your destination. I don't really know. It doesn't really matter. Just don't pack this shit in your checked bags. Consider not bringing it on your carry-on too. I *do* know many airplane fires are caused by lithium batteries brought by passengers or carried in cargo.\n\nhttps://mentourpilot.com/incident-lithium-battery-fire-disrupts-easyjet-flight/\n\nhttps://mentourpilot.com/accident-e-cigarette-catches-fire-in-flight/",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "MeIsMyName",
                                                            "body": "They have special bags and procedures designed to contain a lithium battery fire in the passenger cabin. However, in the event of a fire in the baggage compartment, there is no way to access the device and try to contain the spread, which makes the risk a lot higher. This is why it's not allowed in the baggage compartment, but is allowed in the passenger compartment.",
                                                            "score": 22,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "jso__",
                                                            "body": "There's no real evidence of that. A lot of airlines are banning their in flight use because of borderline hysteria, but no investigation has yet proven that the fire on the Korean Airlines plane was caused by lithium power banks.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "twenafeesh",
                                                                    "body": ">no investigation has yet proven that the fire on the Korean Airlines plane was caused by lithium power banks.\n\nDon't really understand why you brought up that specific flight. I didn't mention it. Just that batteries have caused fires in the past - both as carry-ons in the passenger compartment and in checked baggage. [Here's an example of the risk of batteries in the cargo compartment (i.e. checked-in baggage or a cargo flight).](https://www.youtube.com/watch?v=Y50saxfTqQA) I will have to search for the video discussing cabin fires, but at minimum we know it happened with some of those Samsung galaxy phones.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "jso__",
                                                                            "body": "I brought up that specific flight (Air Busan—not Korean Air oops) because it's in the news. A bunch of Asian carriers are banning the use of portable batteries and/or requiring they be kept as a personal item, not in overhead storage. There is also no compelling evidence that merely bringing a power bank on a plane is unsafe, the only risks seem to come from heavy use (in which case it'll be right out in the open to extinguish). In theory it's possible, I suppose, for it to catch fire randomly, but as long as it's in an accessible place, that's really low risk (you can just put it out with a fire extinguisher), but that's why it's not allowed in checked luggage.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "bezkyl",
                                                            "body": "You are too dumb to",
                                                            "score": -1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "bezkyl",
                                                            "body": "🙄",
                                                            "score": -8,
                                                            "replies": [
                                                                {
                                                                    "author": "twenafeesh",
                                                                    "body": "https://mentourpilot.com/incident-lithium-battery-fire-disrupts-easyjet-flight/\n\nhttps://www.youtube.com/watch?v=Y50saxfTqQA\n\nhttps://mentourpilot.com/accident-e-cigarette-catches-fire-in-flight/",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bezkyl",
                                                                            "body": "wtf are you trying to prove… the comment you replied to was to bring a battery into the cabin to charge your devices… so you went off on a rant about not putting them in to your checked baggage… btw there are less than 100 incidents per year and there are millions of flights worldwide, I’ll take my chances",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "twenafeesh",
                                                                                    "body": "Weird that you are so triggered by this. Find a new person to rage at for no reason.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "bezkyl",
                                                                                            "body": "Cope harder",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "twenafeesh",
                                                                                                    "body": "Are you doing ok? Do you need someone to talk to?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "bezkyl",
                                                                                                            "body": "Are you? You seem to be jumping around in your comments and reposting the same thing multiple times.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "twenafeesh",
                                                                                                                    "body": "https://o.quizlet.com/5MMVWK7QFPwXW-aSIxezlQ.gif",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "bezkyl",
                                                                                                                            "body": "![gif](giphy|AAsj7jdrHjtp6)",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "maxolotl33",
                                                                    "body": "You're probably that one bitch at security that has to disassemble her whole bag because rules don't apply to her.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "bezkyl",
                                                                            "body": "Not even in the slightest… you seem like you are fun at parties 🙄",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bravesirkiwi",
                                                    "body": "I'd never bring one if I didn't need it in the cabin but them things are heavy!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Opetyr",
                                            "body": "I thought they specifically tell you that they cannot be stored in checked luggage.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Dogg0ne",
                                                    "body": "Do you think telling people stops it? If I had to guess, removing those power banks from checked luggage is like the most common job for TSA\n\nAnd I mean... it is told that you must not take liquids in larger than 100ml containers and no blades longer than 6cm. Yet, almost each visit at the airport I see a security guy at some line pull those out.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "aksbutt",
                                    "body": "Which power bank was it? I have the 20,000 prime but I don't think I'd get 7 hours of charging from it, at least not to my laptop but i have a beefy one",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Nerfarean",
                                            "body": "Anker powerhouse 100",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "atomic_refugee",
                                    "body": "How were you able to play Minecraft on the plane? Tablet with the battery pack?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "bEEYONDUMB",
                                            "body": "They could be just on their phone too, but yeah minecraft is on like everything now a days",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SydneyRFC",
                            "body": "Airlines have been stopping passengers using powerbanks. Singapore is the latest - [https://www.singaporeair.com/en\\_UK/au/corporate/newsroom/newsalert-listing/advisory-on-portable-power-banks-on-singapore-airlines-flights/](https://www.singaporeair.com/en_UK/au/corporate/newsroom/newsalert-listing/advisory-on-portable-power-banks-on-singapore-airlines-flights/)",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "fankuverymuch",
                                    "body": "Ugh this sucks but honestly I’ve been waiting for it. It makes sense especially with all the goofy knockoffs out there sold on Temu or whatever. ",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "fellows",
                                            "body": "I haven’t been on an international flight lately where they were allowed. My last flight on Etihad they had a whole monologue dedicated to “no battery bank usage” as soon as the cabin doors were shut. \n\nAnd to be honest, like you I’m with them. I’ve even had Anker packs start expanding on me after years of use.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "maxolotl33",
                                                    "body": "Interesting. I've been on most EU carriers, and most don't really care. Some have a message about watching it closely while charging.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dalzmc",
                                            "body": "Yeah even without power banks, I’ve seen pilots say they honestly think it’s a miracle we haven’t had a disaster as a result of a battery fire yet. Like a phone falling into a seat and somehow getting punctured or something. Flight attendants are apparently trained to deal with lithium battery fires but you never know what could happen. If there’s two places I don’t want to be stuck inside with a battery fire, it’s in a tube at the bottom of the ocean, and in a tube in the sky.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Top_Beginning_4886",
                                    "body": "I really don't get this. Is a 25000mAh phone good? It's the same lithium battery, so why ban power banks specifically?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "turnsover",
                                            "body": "I'd assume it's because they have experienced many power bank fires on planes, but many fewer phone battery fires.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pannenkoek0923",
                            "body": "Some airlines have started to not allow the use of power banks in flight, so make sure you have an alternate plan  and travel with a fully charged phone!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GregTheMad",
                    "body": "I never step into a plane without a switch, Steamdeck, or ereader. Best all three (for long flights and you need the entertainment/battery rotation).",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Thomas-Lore",
                            "body": "My phone replaces all of those for a flight. And the battery is fine for at least 12 hours, so no problem there either.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GregTheMad",
                                    "body": "If you think a phone can replace any of these, you really have no idea what they're _doing_.\n\nSwitch and Steamdeck have better temperature controls and ergonomics for gaming. The bigger screen alone is so much better for your eyes.\n\nEreaders use eink displays that are also wildly better for your eyes.\n\nEspecially in the dry air of an airplane eye care is kinda important.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "24bitNoColor",
                                    "body": "> My phone replaces all of those for a flight.\n\nI don't know. Even with my Fold 5 I would rather bring a bigger tablet (which are also available with OLED screens) at least for watching something more artistic than Youtube  to be honest.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wan2tri",
                    "body": "I am yet to fly on an aircraft with a screen right in front of me for entertainment, since all of my flights so far are relatively \"short\". Longest is around 3hr20min. Albeit, that was the 2nd flight of the day as we took a 2hr30min flight first, waited for 4 hours, then boarded the 2nd.\n\nThus, it's always my own devices I have to rely on.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "DeHarigeTuinkabouter",
                    "body": "Forced commercials? What airline?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "lucidspoon",
                    "body": "I've had them freeze a lot too, especially after an announcement. \n\nI do tend to go overboard with downloading media. 3 hour flight? Better download 18 hours worth of movies!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NaoPb",
                            "body": "It's always good to have a choice. You never know what you'll be feeling like watching.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gittenlucky",
                    "body": "I have been on 3 jetblue flights in the last week and all 3 were non functional. They don’t care anymore and assume everyone brings their own entertainment.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gxbcab",
                    "body": "Every time I’ve flown in the past 5 years, you could just connect your phone to the planes network and have access to all the same things the seat screens have.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "warm_sweater",
                    "body": "I fly domestic flights much more often than international and there are never screens on any of the planes, so I’ve become very self sufficient with my phone and tablet.\n\nHaving the screen on an international flight is like a special bonus!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ILoveHomelessMen",
                    "body": "> Never rely on their systems.\n\nNah. I paid for it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DeHarigeTuinkabouter",
                            "body": "This dude paid for it but was shit out of luck, so not sure what your point is here besides ignoring reality?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ILoveHomelessMen",
                                    "body": "You’re suggesting I pay and bring backups for every service i pay for in life lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeHarigeTuinkabouter",
                                            "body": "Mate you just download a few videos on your phone.\n\nAnd yes, if the service failing is a problem and you can easily bring a back-up then you do so. It's why bringing not just one debit/credit card when traveling is also a good idea.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Darkuwu_",
                    "body": "you guys travel?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "SolClark",
            "body": "Not sure which airline this is, but usually you can hold down the power button to force shut down, and then press again for boot up.",
            "score": 213,
            "replies": [
                {
                    "author": "LewisRosenberg",
                    "body": "Just make sure not to press small blue button, it might turn off plane itself.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "zan13898",
                            "body": "Dont even ask what the red button do.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MamasGottaDance",
            "body": "I'd feel so vindicated if that happened to me. I always download hours upon hours of music, podcasts, movies, and episodes when I fly somewhere, but I never end up even touching them so I am always like \"What's the point of doing this?\" But I ALWAYS do it again the next time. So if that was me, I would be like wow. My weird habit has prepared me for this moment",
            "score": 170,
            "replies": [
                {
                    "author": "Party-Ad4482",
                    "body": "I always do this too, but I also always use it because I'd rather listen to my own media than the plane screens.\n\nOne time my Spotify app logged me out and made me reset my password *while the plane was boarding*. It cleared all of my downloads. I managed to get one album saved and just listened to it on loop for the whole flight. That one sucked.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "MamasGottaDance",
                            "body": "Spotify does me dirty every day. Lately, it's that every time I click off the app, it scrolls up to the beginning of my playlist.  Before that, it used to glitch out every day, and a song would like...get stuck. Like the title and everything would be blank and I couldn't play a different song. If I wasn't leeching off my mom's family subscription, I would've deleted that app years ago",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "D4FF00",
                                    "body": "I’m not a programmer, but scroll position persistence seems like an easy UI fix, and something that really irks me when it’s lost. Like, if I can write something down or remember it myself, code should be able to do it no problem.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "D4FF00",
                            "body": "I would have had steam shooting out my ears if that happened, “Of course! *NOW* it does this! #@$&%!!!”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "organisms",
                    "body": "Happened to me the last time i flew.  Ended up sitting next to quite an interesting fellow and we chatted about life and tried to identify what we could see through the window the whole time.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "xiaopewpew",
                            "body": "Plot twist: he hacked your system because he is lonely",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tigrisrock",
                    "body": "I just would sleep. My better half hates me for that but on intercontinental flights I fall asleep about 5 minutes after takeoff and wake up when they serve breakfast 6-7 hours later.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "KPexEA",
                    "body": "I downloaded a whole bunch of comic book archive files (cbz) from archive.org for my tablet to read on flights. Lots of amazing stuff from Robert Crumb et al available there for free.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lefty7111",
            "body": "Was the plane a victim of ransomware?",
            "score": 47,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "Maybe I planted it",
                    "score": 37,
                    "replies": [
                        {
                            "author": "SeriousButton6263",
                            "body": "you're dangerously approaching \"this shit does not look good on paper\" territory",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "flyingthroughspace",
                                    "body": "It's Reddit.  There's nothing here a defense attorney *wouldn't* try to have stricken from the record.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Antrikshy",
                            "body": "Welcome to the list!",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Useuless",
                            "body": "He's crazy enough to do it for the karma!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tornadoRadar",
            "body": "am i the only person who never uses inflight anything?   ipad/iphone and a power bank.  im good for however many hours the flight is.",
            "score": 70,
            "replies": [
                {
                    "author": "dalzmc",
                    "body": "Yeah I always bring my switch and iPad with me, but I just end up on my phone reading the whole time. Or sleeping. The longer the flight.. the more I sleep. Even helps make sure I get my sleep schedule changed to where I’m headed if needed. So I don’t really need more entertainment even on longer flights.\n\nWhen I was a kid I definitely used in flight stuff tho. Before smartphones and all that.. the gameboy battery only lasted so long!",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Aiuner",
                            "body": "I always brought spare batteries.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dalzmc",
                                    "body": "I had a game boy sp and unfortunately I think it didn’t let you do that so easily lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "azspeedbullet",
                    "body": "i only use the inflight to view the airplane maps that show you your position and places you are flying over",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Legend_of_dirty_Joe",
            "body": "this looks like a scene from some cheesy techno thriller movie",
            "score": 24,
            "replies": []
        },
        {
            "author": "Secret_Account07",
            "body": "As a techie I’m curious, what actually is getting encrypted? I mean, the media system should not need re-encrypted each flight so what’s going on?",
            "score": 19,
            "replies": [
                {
                    "author": "DrTankHead",
                    "body": "Scrolled wayyyyy too far to find this. Very curious to know what's up here...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "that_dizzy_edge",
                    "body": "Yeah this doesn't make sense, especially with the fake low-res pixels. It makes me think it's a paused movie (or if we're being charitable to OP, maybe it froze that way). Wasn't there just another post recently about an in-flight movie stuck on one frame the whole flight? Maybe it's just karma-farming.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mittenknittin",
            "body": "this is why I bring a book",
            "score": 35,
            "replies": [
                {
                    "author": "BissoumaTequila",
                    "body": "Whats a book?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "CompSolstice",
                            "body": "It means your father, in Arabic.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "darexinfinity",
                                    "body": "> this is why I bring ~~a book~~ your father\n\n🤔",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Nightblade",
                            "body": "Thinly sliced trees stained with ink.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "great_escape_fleur",
                            "body": "It's like a kindle but it smells nice",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "carguy1997",
            "body": "![gif](giphy|453QsWPQj5bsQaqp8M)",
            "score": 13,
            "replies": []
        },
        {
            "author": "Heyric21",
            "body": "Form an IT point of view, what does this mean?",
            "score": 10,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "Corrupt firmware on the tablet. Needs reflash or factory reset. Or hardware fault, needs swap",
                    "score": 6,
                    "replies": [
                        {
                            "author": "GlitteringAttitude60",
                            "body": "The screens are tablets?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Woodtoad",
                                    "body": "Yes, usually all screens are tablet-like devices running Android, with very slow local compute, all connected to a central storage somewhere in the plane.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fusseldieb",
            "body": "Why a damn entertainment system needs encryption is above me. It's not like it holds personal data.",
            "score": 22,
            "replies": [
                {
                    "author": "3-2-1-backup",
                    "body": ">  It's not like it holds personal data.\n\nWorse, it hold (dramatic cue) ***corporate data.***",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Fusseldieb",
                            "body": "Which still doesn't make sense since the device is supposed to be up and running, which means data is decrypted anyways.\n\nPlus, most of the content is streamed from a central location anyways, so I really don't get the point.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MrVantage",
                    "body": "Probably a scene from a movie and OP trying to be cool",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "darexinfinity",
                    "body": "I wouldn't be surprised if the system ran on some version of Android rather than being made from scratch. It's possible encryption was left in because of that.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "xdeskfuckit",
                    "body": "maybe payment information or something",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fusilero",
                    "body": "Looks like it's China Southern, I'm sure the CCP sneaks a little personal data.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WhatzMyOtherPassword",
                            "body": "I assure you we do not. We would love your feedback on where you heard such rumors. Just reply with your location and we will gladly interview you about this misunderstanding.\n\nE: We found your location from a good samaritan. We will be there shortly. Congratulations, you are being rescued. Please do not resist.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Strawberry_Poptart",
                    "body": "That looks like ransomware deployment.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheDrunkSemaphore",
                    "body": "Hollywood requirement on their media, early access movies, etc.\n\nSource: Used to work on IFE",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Star_king12",
                    "body": "Everything uses and should use encryption for the file storage nowadays. Every phone, smart watch, every new computer comes with it enabled. It's just for security.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PanoramicDawn",
                            "body": "Security from what?? It's a plane entertainment system.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Star_king12",
                                    "body": "Does it have a payment system? Does it connect to the internet? Do you want the guy on the other end to be able to listen to you for the whole flight? Play sounds on the tablet. For that thing to be used in a botnet to DDOS your fav site?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PanoramicDawn",
                                            "body": "The disk contents are decrypted while it's running, so I don't see how that's relevant. And I might be mistaken, but I'm pretty sure these things can't connect to the general internet.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Star_king12",
                                                    "body": "They're not fully decrypted while it's running, it's done on the fly on a per file basis. Depending on the plane they might have access to the satellite internet.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Somepotato",
                                                            "body": "No, they're practically fully decrypted while running. The encryption key is the same for the entire filesystem.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Star_king12",
                                                                    "body": "They're decrypted into ram as needed. So what if it's the same? You're not gonna pull it without some very advanced hacking tools.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Binary_Lover",
            "body": "That's a cool font with the colors tho.",
            "score": 7,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "This. Would be a fun wallpaper for desktop ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Binary_Lover",
                            "body": "Definitely worth creating a jpg of it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Milton_McGee",
            "body": "If I was hacking someone's computer in 1998 this is the message I would expect to see",
            "score": 5,
            "replies": []
        },
        {
            "author": "outofcontextseinfeld",
            "body": "It’s always a fully booked 15 hour flight when this happens",
            "score": 11,
            "replies": []
        },
        {
            "author": "pgraczer",
            "body": "love the guy in the next row who, faced with a thousand entertainment choices, is like 'i think i'll play go'",
            "score": 18,
            "replies": [
                {
                    "author": "BenjaminGeiger",
                    "body": "I thought the same thing, but I'm pretty sure it's actually gomoku.\n\nThat said, if they had an option to play go against other passengers (or even via the Internet) I'd probably do it.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "GlitteringAttitude60",
                            "body": "In-flight chess tournament.\nThat'd be great :-D",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "miraculum_one",
            "body": "Tell them and they will restart it",
            "score": 2,
            "replies": []
        },
        {
            "author": "NFFUK",
            "body": "Forced Rawdogging",
            "score": 4,
            "replies": []
        },
        {
            "author": "evolsoulx",
            "body": "Got a good one. Back in like 2003 I flew from Australia to LA. I took too much something to try to knock myself out, and ended up being in the few % of people that tweak when taking too much of this OTC drug.\n\nWelp, that alone sucked. But my TV screen also had a broken volume down button. And at some point while watching cartoons the volume shot all the way up, so i could either watch, i think like Hey Arnold, at full blast volume, or sit in silence in a plane... So that wasn't fun.",
            "score": 4,
            "replies": [
                {
                    "author": "WhatzMyOtherPassword",
                    "body": "MOVEIT FOOTBALL HEAD",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Commercial-Ad8123",
            "body": "A lesson learned. Always bring your own entertainment. Rely on yourself not others and you’ll never be disappointed.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Equal_Objective_2317",
            "body": "Better this than an engine catching fire.",
            "score": 4,
            "replies": []
        },
        {
            "author": "i_m_sick",
            "body": "progress update please",
            "score": 3,
            "replies": []
        },
        {
            "author": "Iguanatan",
            "body": "That happened to me when my then new Husband and I were flying to Hong Kong for our Honeymoon. Their solution was to move me over the other side of the plane away from my husband. \n\nNot a great start to the honeymoon! But in the scheme of things, not the worst that could have happened.",
            "score": 3,
            "replies": [
                {
                    "author": "LyyK",
                    "body": "Wait, who did you pick? Your new spouse or the 10\" LCD screen?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Iguanatan",
                            "body": "The Husband. But I won't lie, when he fell asleep I did pop over to the other seat to watch some movie I cannot recall.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "overkil6",
            "body": "What’s more surprising is that it’s your screen and you couldn’t manage to centre it in the shot.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gattaaca",
            "body": "In plane infotainment is always ass.\n\nJust bring a phone or tablet preloaded with stuff to watch or play",
            "score": 3,
            "replies": []
        },
        {
            "author": "SAGA0599",
            "body": "I somewhat had a similar experience, in my case the display got stuck on the flight tracking screen and was stuck till the end of the flight… and I had to see it for the whole 14 hours! \nA terrible experience overall.",
            "score": 3,
            "replies": [
                {
                    "author": "Wlng-Man",
                    "body": "You call the flight attendant, they have a reset-pin. Happens all the time.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SAGA0599",
                            "body": "I did ask them to do it, they just signalled me that they’re coming but they didn’t… and I had to spend my journey like that…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bronzbeauty_25",
            "body": "Same thing happened to me for 22hours flight! All the screen showed was maps🙂",
            "score": 3,
            "replies": []
        },
        {
            "author": "roomob",
            "body": "Ransomeware hackers getting desperate. “Send bitcoin if you don’t want to lose your mind on your 15 hour flight”",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dcoal",
            "body": "As a frequent flyer, I have to stress, ALWAYS have entertainment backup. I have a tablet with 9 seasons of the Simpsons",
            "score": 8,
            "replies": [
                {
                    "author": "Thomas-Lore",
                    "body": "Why haul a tablet when a phone is enough and you already have it on you? (I like to travel light.)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Dcoal",
                            "body": " Tablet is only 400g, so I think the larger screen is a worthwhile quality of life improvement for a long haul flight ",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "azspeedbullet",
                            "body": "for me i enjoy watching content on a device with a bigger screen like a tablet. Viewing things on my small phone screen can cause issues for me",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HerculesZeusTV",
            "body": "Air India vibes…",
            "score": 5,
            "replies": [
                {
                    "author": "Alarming_Dog_6685",
                    "body": "You'd be lucky if the screen even turns on with Air India. Speaking from experience...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jerryeight",
            "body": "File a claim with the airlines if they can't fix the issue. \n\nThey owe you cash and points.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Asleep_Management900",
            "body": "Thankfully nobody buys tickets based on if they have screens or not.",
            "score": 2,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "Don't give them ideas lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TorontoPolarBear",
            "body": "Write a polite letter to the airline (you can use AI to help) pointing out the issue and suggesting that the full value of your seat was not enjoyed. Maybe hint at receiving some refund or compensation. (probably will be airline points)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Uncle-Cake",
            "body": "I can't imagine going on a 15 hour flight and relying on that screen for entertainment. That screen should be a last resort.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anishx",
            "body": "Call Jack bauer",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kevftw",
            "body": "Did they not have any spares?\n\nEveryone that comments having had a similar problem mentions changing seats but on my last flight, my entertainment system had a faulty USB slot and one of the stewardesses literally disconnected the screen from the seat and swapped it with a replacement.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wartoofsay",
            "body": "wake up neo",
            "score": 2,
            "replies": []
        },
        {
            "author": "leavethisearth",
            "body": "You can force restart these screens by holding the power button for a few seconds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "El_Taita_Salsa",
            "body": "I always download shows or movies from Netflix or Max on my phone just in case some shenanigans happens with my screen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "breadboi196",
            "body": "Is this a malware? If it is, how does it not spread and affect the plane's piloting systems?",
            "score": 2,
            "replies": []
        },
        {
            "author": "P0pu1arBr0ws3r",
            "body": "What even is this, it makes no sense. An infotainment system isnt just going to begin encrypting itself with a custom interface...\n\nAnd the time interval didnt change between images- either its fake, frozen, or op has a good phone camera thst can capture simultaneous pictures with a high iso and short shutter.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EriclcirE",
            "body": "Always be prepared with Balatro downloaded to your smartphone",
            "score": 2,
            "replies": [
                {
                    "author": "Ultima_STREAMS",
                    "body": "Balatro! Let's goo!!! We've been killing it on xbox!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "naughtynaughty2025",
            "body": "Well that sucks",
            "score": 2,
            "replies": []
        },
        {
            "author": "Infinite_Scar_2797",
            "body": "you definitely just paused a movie mid frame",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThomasGullen",
            "body": "I did a similar length flight once with a broken screen, didn't bring any books with me or laptop.  Body also decided to keep me wide awake once it realised how triggering the whole situation was.  Never been more bored in my life.  The last few hours really really dragged.\n\nThe torture of waiting as long as possible before looking at your watch and seeing only 15 minutes have passed is a unique torment that is hard to understand without direct experience.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cmdr-Ely",
            "body": "Tell the pilot to reboot the plane.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dietcam",
            "body": "FEED ME A STRAY CAT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brave_Passenger4978",
            "body": "Report it online, you'll get thousands of air miles!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dense_Principle_408",
            "body": "This would be fine for me because I always end up watching someone else’s screen anyway",
            "score": 2,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "This. Such an underrated answer lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThPrimeSuspect",
            "body": "I've never shown up to a flight without hours of videos on my phone and a book. Crazy that people actually use these things",
            "score": 2,
            "replies": []
        },
        {
            "author": "-_-_-_-_--__-__-__-",
            "body": "Pay that damn ransom!",
            "score": 1,
            "replies": []
        },
        {
            "author": "YB9017",
            "body": "Always bring a book. And ask for free alcohol.  lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "AppropriateBunch147",
            "body": "Enjoy a book",
            "score": 1,
            "replies": []
        },
        {
            "author": "MindlessKangaroo",
            "body": "hold down that power button operating system be damned",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoodyLiz",
            "body": "those in flight magazines can be pretty good sometimes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Longjumping-Salad484",
            "body": "I wouldn't mess with encryption because it's encrypted for a reason. \n\nand I'm not frickin \"hey, less decrypt these encrypted files!\" no way that's not me \n\nI would if I were Batman, though",
            "score": 1,
            "replies": []
        },
        {
            "author": "MelancholyGalliard",
            "body": "I had an eight hours flight where the entire system froze, at least we were all bored. Then it turned into a nine hour flight because the main door got stuck and trapped all of us on the tarmac in Dulles…",
            "score": 1,
            "replies": []
        },
        {
            "author": "notdoreen",
            "body": "Nice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frequent-Avocado2599",
            "body": "![gif](giphy|3ohc14lCEdXHSpnnSU|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fletcharoonie",
            "body": "That's just the plane encrypting itself. Good luck with the auto pilot now AI is at the wheel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fffan9391",
            "body": "I had this happen once on a 14 hour flight to Japan. Luckily we had to switch planes and the replacement had a working screen at my seat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Firstnameiskowitz",
            "body": "ngl ascii art even in the most random places looks sick, it was a defining sign of the 70's and 80's",
            "score": 1,
            "replies": []
        },
        {
            "author": "DopeAbsurdity",
            "body": "If it asks if you want to play a game you can say yes but DO NOT PLAY THERMONUCLEAR WAR!! all the other games are fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KyrosXIII",
            "body": "sigh. adding this to my list of long flight worries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Armstrong_Gr",
            "body": "One I slept 950 minutes in a 10 hour flight in economy who can beat that? \nI missed all the dinners unfortunately",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlitteringAttitude60",
            "body": "Do people actually rely onto external entertainment for such long flights?\n\n\nI've never been on one, but I'm currently returning from a weekend trip with a two-hour train ride each way, and I have a tablet full of books, a Switch, and two embroidery projects with me, because I am horrified by boredom.",
            "score": 1,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "I'd say half of people do. My kid definitely does. 15 hours in confined seat is long",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GlitteringAttitude60",
                            "body": "Okay...\n\n\nTell your kid if they every see a fluffy blonde with glasses in this situation to talk to me. Then they can borrow one of the embroidery projects :-D",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_OccamsChainsaw",
                    "body": "Makes no sense to me. Most streaming services allow you to download shows/movies for offline use on your phone/tablet. Plenty of games are available on a phone. A switch is very portable. And of course a good old fashioned book. \n\nRelying on inflight entertainment seems wild to me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Silver_Shadow",
            "body": "To Seoul?",
            "score": 1,
            "replies": []
        },
        {
            "author": "D4FF00",
            "body": "Ok, Ethan Hunt. Hope you were able to get your mission briefing first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PartridgeViolence",
            "body": "*I’m in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lariato",
            "body": "Your screen or the person next to you?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salamander-7142S",
            "body": "Try turning the plane off and on again?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kevleyski",
            "body": "That’s pretty bizarre (have worked on flight entertainment software)",
            "score": 1,
            "replies": []
        },
        {
            "author": "wabashcanonball",
            "body": "Old person here: always have a book with you on a flight. E-reader or hard copy. You'll never regret it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gimmerick",
            "body": "My friend and I both faced this during our last flight. We complained to the airline staff and they gave us replacement seats within 10 mins. There were others who also faced the infotainment issue but there were no other seats left after we claimed ours. 🫢",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Scar_6132",
            "body": "I sent 4 dots",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yakkizm",
            "body": "NO SCREEN FOR YOU! Back of the line.",
            "score": 1,
            "replies": []
        },
        {
            "author": "johnschool",
            "body": "Watch stuff that on the device ur posting from",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElectricalPlantain35",
            "body": "Lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "HealerOnly",
            "body": "What do you do with those screens? havnt been on a flight since like 15 years back. I guess u can watch movies? what about audio tho? Can you like bluetooth or do you need to bring some oldschool earbuds?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Basic-Reception-9974",
            "body": "You can hold the power button down, it'll reset the device",
            "score": 1,
            "replies": []
        },
        {
            "author": "Novel_Measurement351",
            "body": "*incoming transmission: \"You're mission should you choose to accept it...\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "gabriel_wlg",
            "body": "This looks like a scifi movie intro.\nBe prepared to face a unknown enemy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious_Donkey61",
            "body": "Did you ty turning it off and on again?",
            "score": 1,
            "replies": []
        },
        {
            "author": "_free_rick_sanchez_",
            "body": "You wouldn't download an airplane",
            "score": 1,
            "replies": []
        },
        {
            "author": "grafknives",
            "body": "This screen is so stylish, it looks like part of movie itself :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "KMReiserFS",
            "body": "you have to transfer some bitcoin to a Russian hacker to watch the movie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "miwi_kiwi",
            "body": "Did you take the red or the blue pill?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daydream_machine",
            "body": "![gif](giphy|H7kfFDvD9HSYGRbvid)\n\nTime to meditate for 15 hours straight",
            "score": 1,
            "replies": []
        },
        {
            "author": "WedNiatnuom",
            "body": "Had a 14 hour flight to India and right before takeoff the pilot announced none of the screens were working, but it’s either that or don’t go. Luckily I had my own entertainment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BigBearSD",
            "body": "I had something similar happen several years ago on an african airline... 16 hour flight (turned in to 18/19 hours), with the tv crapping out the first 30 minutes of the flight. Completely booked. It was not a fun flight, especially since back then they did not allow people to use their electronic devices, not even on airplane mode, and we were mostly flying at night so didn't want to turn on the light to read. it sucked. zoned out off and on, and that's about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mtsmash91",
            "body": "In the mid 2000’s I flew a similar length flight. The seat back entertainment system was working fine in couch but first class was having issues. They kept rebooting the system to solve the issues after about an hour of reboots they shut the whole system off for the rest of the flight… if first class couldn’t have it no one could. This was the days before iPhones, I had a gameboy and a sudoku book. Longest flight of my life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drAsparagus",
            "body": "Pipboy 1000. \n\n\nStill working out the kinks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ftaok",
            "body": "Too late for you, but if the flight attendant can’t fix the problem, you could ask them for free wifi so that you can at least get some entertainment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abraxxxas_",
            "body": "Well, at least it has a timer you can look at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmeech999",
            "body": "I don’t get it, you got a phone, it has a screen…",
            "score": 1,
            "replies": [
                {
                    "author": "LemonWasHere",
                    "body": "Plane Wifi sucks and costs a fortune, and people dont have the foresight to pre-download their movies and tv shows",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dmeech999",
                            "body": "Since when is $8-$15 a “fortune”?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LemonWasHere",
                                    "body": "Id rather just not pay for plane wifi, especially because I have plenty of potential options to keep me entertained throughout the flight. Im not judging you if you pay for it, but its just not my thing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "St4tikk",
            "body": "Did it at least give you some kind of secret classified briefing first?  Are you a member of the Impossible Mission Force?",
            "score": 1,
            "replies": []
        },
        {
            "author": "eXistentialMisan",
            "body": "Did you choose to accept your mission?",
            "score": 1,
            "replies": []
        },
        {
            "author": "sudahmakann",
            "body": "Is the person in front playing go?",
            "score": 1,
            "replies": []
        },
        {
            "author": "24bitNoColor",
            "body": "Why wouldn't you just bring a tablet filled with stuff you want to watch, anyway?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarshallMarks",
            "body": "You're gonna get a phonecall warning you agent smith is coming for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "These will be some looooong 15h",
            "score": 1,
            "replies": []
        },
        {
            "author": "hoss_style",
            "body": "You try putting it in rice?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular-Smile5025",
            "body": "Wow 🤩 that must not have been a comfortable flight??",
            "score": 1,
            "replies": []
        },
        {
            "author": "sendlewdzpls",
            "body": "Are you sure the screen is being encrypted and not YOU?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WowIsThisMyPage",
            "body": "I have epilepsy and the screen I got was broken and flashing. The flight attendant just taped a piece of paper over it lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "nikkel_navigator",
            "body": "This is why I always have my iPad handy, and preloaded with stuff to watch, just in case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jonneiljon",
            "body": "Prepare to be snatched up by ICE agents when you land.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiserableSwimming136",
            "body": "Raw dog that thang",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nicht0",
            "body": "me and my friend tried to play yazze but the game crashed both our screens. luckily the flight was \"only\" 9 hours long.",
            "score": 1,
            "replies": []
        },
        {
            "author": "figgens123",
            "body": "Damn. CNS at it again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dreamer0303",
            "body": "which airline?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gumbini",
            "body": "Laughs in Ryanair",
            "score": 1,
            "replies": []
        },
        {
            "author": "styrofoam__boots",
            "body": "This happened to be once on a 15 hour flight and now I always bring a backup iPad. I’m sorry this happened 😭 the airline won’t compensate you for shit either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crayfishcraig108",
            "body": "Send this to customer complaints you might get some credits for drinks or something",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pulse_Amp_Mod",
            "body": "I’m flying from Dallas to Manila in April. Any tips on a long ass flight? I’ve only flown domestic and if sucks for me. Are the seats bigger?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeorgeMeganWham5",
            "body": "Bummer I said well that sucks before even knowing the SR",
            "score": 1,
            "replies": []
        },
        {
            "author": "InternationalSpyMan",
            "body": "Why would you not have a tablet or\nPhone filled with entertainment?",
            "score": 1,
            "replies": []
        },
        {
            "author": "serenawaldorf",
            "body": "“Fuck this guy in particular”",
            "score": 1,
            "replies": []
        },
        {
            "author": "levy--",
            "body": "There's an even better screen to look at if you just turn your head to the right.",
            "score": -2,
            "replies": [
                {
                    "author": "Nerfarean",
                    "body": "Sadly night time flight. Got nice view of Golden Gate Bridge on the way out though",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "BvanLeeu",
                    "body": "Ah yes I love staring at blue nothingness for 10+ hours",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "flargenhargen",
                    "body": "there is no 15 hour flight with good view the whole way.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "tetsuo_7w",
            "body": "A snobbish as it's going to sound, you know what won't brick itself (usually)? A book. Books are great. They have stories in them and stuff. And they're made out of paper rather than a flashlight, so if you want to take a nap after reading, it's way easier.",
            "score": 2,
            "replies": [
                {
                    "author": "miyakohouou",
                    "body": "I haven't flown a lot, but when I have traveled audio books always seemed like the best option to me. Listening to something with good noise canceling headphones drowns out the plane sounds, you don't have to worry about motion sickness from trying to read a physical (or electronic) book, and you don't need to deal with trying to manage a laptop or tablet while packed into a sardine can.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Bakoro",
                    "body": "I love books as much as anyone, but there are tradeoffs everywhere.    \nYou still need adequate light to read by. They're bulky and easily damaged.  \nA boom typically has one story, and if it sucks, that's it. \n   \nMy e-reader has like 1000 books on it, has a backlight, and lasts multiple days on a single charge.   \n   \nMy phone has books, movies, and multiple gigs of music.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BodybuilderClean2480",
            "body": "They have these magic analogue things in the airports these days... you don't even need any power! You can move your eyes on the pages and it creates a story in your own brain! They're called books.",
            "score": 1,
            "replies": [
                {
                    "author": "Mal-De-Terre",
                    "body": "Whuuuut? Really? Wild!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackc43",
            "body": "Get miles or a voucher for comp",
            "score": 1,
            "replies": []
        },
        {
            "author": "AskMeAboutMyHermoids",
            "body": "Am I the only one who never uses the tv except for seeing where the plane is over the world? \n\nMy phone has everything I need already downloaded to it and I can use my Bluetooth headphones",
            "score": 1,
            "replies": []
        },
        {
            "author": "FurryYury",
            "body": "From a cybersecurity perspective, that is scary. (Because you don't know if a hacker many be doing something in the Airline computer system - which also happens to fly this plane)",
            "score": -1,
            "replies": [
                {
                    "author": "flargenhargen",
                    "body": "if the same computer system that flies the plane is directly accessible by direct wired connection available to all the passengers,  well then mr. musk,  the plane probably doesn't have much of a chance.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Taro8383",
                    "body": "You're not the smartest tool in the shed huh",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kingddd991",
            "body": "Always try to grab a book old media never disappoint",
            "score": 0,
            "replies": []
        },
        {
            "author": "xtheory",
            "body": "This would be both hilarious and frightening if it were a ransomware cyber attack mid-flight. God forbid if they didn't segregate the flight control computers away from the media entertainment system.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ClosedSundays",
            "body": "boohoo I can afford to fly a 15 hr flight but not afford the probably free anyway wifi to stream from the entire digital library the world has to offer",
            "score": -4,
            "replies": [
                {
                    "author": "coolfluffle",
                    "body": "most long haul flights limit wifi usage to casual browsing (i.e. no streaming) but sure!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ClosedSundays",
                            "body": "Enough to come on to reddit and whine! Hooray!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Siyareloaded_",
                                    "body": "I mean…yes? If you pay for something that doesn’t work it is certainly enough to “whine” in a place called r/wellthatsucks",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "coolfluffle",
                                    "body": "or... they posted it after they landed? and it's a pretty valid reason to complain lol. especially in a sub that is built for people to complain",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EmilioFreshtevez",
                    "body": "I’ve only been on a couple of flights, but none of them had free WiFi",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "the_chazzy_bear",
            "body": "I always just chat with whoever is next to me (if they seem willing) or read a book. Enough screens in my life already lol",
            "score": -2,
            "replies": []
        }
    ]
}