{
    "title": "While I was out of work for a surgery, someone filled my compost pile with rubberbands.",
    "author": "Yoloswagforjesus420",
    "subreddit": "Wellthatsucks",
    "rank": 4,
    "score": 15421,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 300,
    "url": "https://i.redd.it/idggwo6bvbpe1.jpeg",
    "id": "1jdq1fl",
    "selftext": "I have this compost pile that I care for at the small local restaurant I work at and while I was gone for a surgery, one of the younger prep cooks dumped a case of brocclini still banded into the bin. Best ideas for removing?",
    "comments": [
        {
            "author": "wooksGotRabies",
            "body": "Best way to remove those is to have the younger prep cook dig his hands into the bin and pull out each broccoli rubber band till there isn’t one, then wash him with the hose and send him back to the kitchen",
            "score": 9094,
            "replies": [
                {
                    "author": "JCtheWanderingCrow",
                    "body": "That’s a funny way to spell “beat him with the hose…”",
                    "score": 2616,
                    "replies": [
                        {
                            "author": "0x633546a298e734700b",
                            "body": "\"so my dad got out his jumper cables\"",
                            "score": 660,
                            "replies": [
                                {
                                    "author": "Darmortis",
                                    "body": "\"Never hung by your thumbs before, huh? Billy, go get my lighter.\"",
                                    "score": 149,
                                    "replies": []
                                },
                                {
                                    "author": "cyanocittaetprocyon",
                                    "body": "Easy there, /u/Simon10!",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "PM_ME_DAT_PUPPER",
                                            "body": "Aw man did they delete their acct? :(",
                                            "score": 13,
                                            "replies": []
                                        },
                                        {
                                            "author": "Either-Pizza5302",
                                            "body": "Who is/was Simon10?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "DonPittelleone",
                                                    "body": "https://www.reddit.com/u/rogersimon10/s/odX7RDG3Aq\n\nIt's rogersimon10, check his comments ;)",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "COOPERx223x",
                                                            "body": "There's no way it's been 9 years since his last comment... Is there?\n\n![gif](giphy|GrUhLU9q3nyRG|downsized)",
                                                            "score": 13,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Crituhcul",
                                                            "body": "Thank you, that was great to go through 😂 I love this site",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BossAVery",
                                    "body": "Such a great story teller. I really do miss coming across those randomly in my younger Reddit days.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TiresOnFire",
                            "body": "\"Back in my day, we used to take guys like you out back and beat them with a hose. But now you got your unions.\"",
                            "score": 110,
                            "replies": [
                                {
                                    "author": "Mellen_hed",
                                    "body": "You know I'm not a union guy, Cap",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "TiresOnFire",
                                            "body": "Thank you! I was waiting for this reply!",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Salute-Major-Echidna",
                                    "body": "I guess it's \"up his nose with a rubber hose\"",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "RainaElf",
                                            "body": "my god it's been years",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Prestigious_Smoke131",
                            "body": "It picks up the rubber bands or it gets the hose",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "breath-of-the-smile",
                            "body": "Save the beatings for your boss. Educate and lift up your younger coworkers instead. We're in this together.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Howlihowl",
                            "body": "Put the dishie in charge of him it’ll feel like it",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Severe_Ad_5914",
                            "body": "Beat him like a rented mule.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kiln_monster",
                    "body": "Agree!! Only way they will learn is if they clean up what they did!!!",
                    "score": 70,
                    "replies": []
                },
                {
                    "author": "PsychologicalCan1677",
                    "body": "Reminds me of my old job I was the prep cook. My boss had me doing a lot of random things like helping to split firewood or hauling buckets filled with dirt and gross shit from a pipe out of the crawlspace.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "csonnich",
                            "body": "Did you put them in the crawlspace tho?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "C4rdninj4",
                    "body": "Stick'em in the scrubber with a hose pipe on 'em is what you do with a drunken sailor. I guess the jr. prep cook would be similar enough.\n\nEdit: autocorrect.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "TransmogriFi",
                            "body": "Scupper. Scuppers are drainage holes that allow a ship's deck to drain. You put him in the scupper with a hose pipe on him to wake him up and wash away the vomit and alcohol stink, but you want that nastiness to drain away from the deck.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Commercial-Royal-988",
                            "body": "I mean, drunken sailor; prep cook. what's the difference in the two other than one is swaying when he walks on purpose?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ZipoBibrok5e8",
                            "body": "I thought you were supposed to shave his belly with a rusty razor?\n\nEarly in the morning, obviously.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "C4rdninj4",
                                    "body": "Or put him in bed with the captain's daughter, or stuff him in a longboat 'till he's sober.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "boh3m3",
                    "body": "Make him wash the rubber bands and use them for a rubber band ball for the foreseeable future. Can use an old champagne cork as a core or something.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "sloppy_sock",
                    "body": "compost him.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "BakedBaconBits",
                    "body": "![gif](giphy|JrFsxgkXzp73C5blq8|downsized)",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "TacoLvR-",
                    "body": "Heisenberg? Cook? Evil. lol",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "RecklessDab",
                    "body": "Nice prof pic",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "DirtyGrimace1",
                    "body": "Nice pfp",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Renfek",
                    "body": "![gif](giphy|Ld77zD3fF3Run8olIt)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bretthren2086",
                    "body": "Don’t forget the de-lousing powder. Or powdered sugar whatever you have laying around.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Few-Emergency5971",
                    "body": "True story",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CreoOookies",
            "body": "I would have the younger prep cook take all the rubber bands off but honestly, murder is never off the table...",
            "score": 2644,
            "replies": [
                {
                    "author": "ccrunn3r4lif3",
                    "body": "Also, mostly compostable…",
                    "score": 336,
                    "replies": [
                        {
                            "author": "Salute-Major-Echidna",
                            "body": "Polyester clothes don't break down. Also shoes",
                            "score": 72,
                            "replies": [
                                {
                                    "author": "ffleischbanane",
                                    "body": "Rubber is a lot like plastic, so it surprises a lot of people when they learn a lot of rubber is biodegradable because it comes from trees, rubber trees… Have you ever had an old rubber band become brittle? That kind of gives you an idea of their capacity to disintegrate.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "kitten_cheesecake",
                                            "body": "Natural rubber is biodegradable and so rubber bands made from natural rubber are also biodegradable. Unfortunately “elastic bands” and “rubber bands” are used interchangeably and elastic bands can also become brittle and break down (into micro plastics) so there’s no guarantee unless you know which one was used originally.",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "author": "NorwegianCollusion",
                                                    "body": "On the other hand, if food is wrapped in synthetic rubber, THAT'S the real problem.\n\nOP, I would honestly ask the supplier if they are using natural rubber, and if not, make as big a stink as I could about THAT.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "PurinaHall0fFame",
                                                    "body": "It's also worth noting that biodegradable is not the same as compostable. Yes, they're likely made form natural latex rubber, but that's augmented by other stuff you don't want in your compost. The rubber will likely break down but everything else will remain to contaminate your pile.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "kitten_cheesecake",
                                                            "body": "True! And compostable doesn’t necessarily mean home compostable such is the greenwashing of everything. Best to remove the bands.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "teakwood54",
                    "body": "Bonus: you can compost his body afterwards.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "shorse_hit",
            "body": ">Best ideas for removing?\n\nMake the cook who did it dig them out by hand?",
            "score": 2413,
            "replies": [
                {
                    "author": "Thatguy468",
                    "body": "Time to learn a lesson on what makes compost toxic.",
                    "score": 347,
                    "replies": [
                        {
                            "author": "Prudent-Ad-5292",
                            "body": "If there's a lot of animal waste in there - absolutely toxic.\n\nNormal compost pile? Shouldn't be more toxic than a pile of dirt. Unsafe gasses can accumulate, but that would only be an issue if the compost pile was in an enclosed area.\n\nAn open air pile of compost filled with a good mix of green/brown and no feces/meat should smell like a forest floor (earthy, wet, and *almost* sweet) and should be as safe to touch/dig around in. In fact I'd say with a forest floor you have to worry about the miniscule chance of prions or parasites. 😅",
                            "score": 68,
                            "replies": []
                        },
                        {
                            "author": "Beckphillips",
                            "body": "What do you mean toxic",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "7i4nf4n",
                                    "body": "There are gasses and stuff in there that can make you vomit pretty fast if you inhale it while digging in there, ig that's what he means",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "Undying_Shadow057",
                                            "body": "That's just more stuff for the compost /s",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Federal-Laugh9575",
                                    "body": "Large amounts of methane gas released from the waste being broken down.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shadowscar00",
            "body": "He who fucks up, does the unfucking. You should absolutely make a sign, but you’d think this would be common sense. \n\nThe prep cook picks out all the rubber bands, you make a sign, and put the whole thing behind both of you as you sneak some old fries.",
            "score": 685,
            "replies": [
                {
                    "author": "tallyretro",
                    "body": "i dont believe someone who puts trash into compost will read a sign telling them not to",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Cyber_Candi_",
                            "body": "Isn't broccolini just tiny broccoli? Like yeah the rubber bands should not have made it to the compost, but veggies are veggies right? Or is broccoli on the non-compostable list? (I'm genuinely asking, I just recently started my compost pile so I'm still not 100% on what can and can't go in there. Broccoli just seems like it would be on the 'yes' list to me)",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Wookmane",
                                    "body": "I don't think they are talking about the broccoli lol. Just the rubber bands being trash.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "tallyretro",
                                    "body": "rubber band = trash, hope that helps u💀",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GitEmSteveDave",
                    "body": "Worst idea.  Someone tried to help.  Punishing them will just make them not want to help at all going forward and they will likely tell others what happened. \n\nIs OP also going to make someone remove the labels from the avacados, which IMHO, stick around longer than rubber bands.",
                    "score": -142,
                    "replies": [
                        {
                            "author": "shadowscar00",
                            "body": "Cleaning up after yourself is not punishment. Also, this isn’t a friend coming over to help, it’s their job.\n\nMost produce stickers are biodegradable",
                            "score": 159,
                            "replies": [
                                {
                                    "author": "deadpoetic333",
                                    "body": "Biodegradable =/= compostable \n\nIdk if the stickers are compostable or not but a recent study found a bunch of micro plastics in compost because a lot of “biodegradable” plastics just broke down into microplastics instead of something useful to living organisms. ",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SewerSighed",
                            "body": "\\>Is OP also going to make someone remove the labels from the avacados, which IMHO, stick around longer than rubber bands.\n\nProbably?? Hopefully??",
                            "score": 59,
                            "replies": []
                        },
                        {
                            "author": "radialomens",
                            "body": "He isn't \"trying to help\" he did his job he gets paid for. He needs to fix it, which he will also be paid for.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "bolitboy2",
                                    "body": "Not to mention if they are never taught or punished for messing up, then they are going to keep messing up and making someone else fix it for them",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pavotine",
                            "body": ">Is OP also going to make someone remove the labels from the avacados\n\nYes.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "OldenPolynice",
                            "body": "Good, please tell others what happened",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "ohdearitsrichardiii",
                            "body": "How is he helping by putting rubber bands in a compost?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Throwoahwoahaway",
                            "body": "You sound like someone who wouldn’t have a job in the first place",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Chomp-Rock",
                                    "body": "Or worse, become a manager ",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OpenSourcePenguin",
                            "body": "Help how? Where's the help here?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Ashton_Garland",
                            "body": "Unless you’re a complete idiot, everyone knows rubber bands aren’t compostable.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "GrizFyrFyter1",
                            "body": "I stand corrected. Neither vulcanized rubber or produce stickers are biodegradable",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "devilishycleverchap",
                                    "body": "https://www.cleanup.org.au/the-problem-with-produce-stickers-plus#:~:text=Since%20there%20is%20currently%20no,place%20for%20disposal%20is%20landfill.\n\nIt's hard to wrap my head around the levels of such arrogant ignorance these days.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KuFuBr",
                            "body": "Fun fact: all produce stickers like those on apples *have* to be edible! (This applies where I live, not sure about other places.)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Xelcar569",
                            "body": "Whether or not the labels stick around longer than rubber bands isnt a matter of opinion, it's a matter of science and fact. \n\nRubber is biodegradable, plastic is not an most product labels have plastic.",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "GrizFyrFyter1",
                                    "body": "I stand corrected. Neither vulcanized rubber or produce stickers are biodegradable",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "LegitosaurusRex",
                                            "body": "Google tells me most produce stickers are made from petroleum-based plastic and thus not biodegradable, are you saying that's wrong?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bolitboy2",
                                                    "body": "Yes, because you looked up normal stickers, not the ones they put on food…\n\n“All PLU codes are made with FDA-compliant materials. This means that the adhesive, facestock, and ink are all food grade.“",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "LegitosaurusRex",
                                                            "body": "No, I looked up produce stickers like I said.\n\nFood grade just means they can safely come in contact with food, not that they can be eaten or anything...\n\n\"PLU stickers are typically made of thin plastic, which is not biodegradable and can contaminate compost piles or facilities\"",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "devilishycleverchap",
                                                            "body": "Do you know what food grade actually means?\n\nThey are not compostable or biodegradable.\n\nhttps://www.cleanup.org.au/the-problem-with-produce-stickers-plus#:~:text=Since%20there%20is%20currently%20no,place%20for%20disposal%20is%20landfill.\n\nEdit: ChatGPT is lying to you\n\nhttps://www.ars.usda.gov/research/project/?accnNo=441951\n\n\"There are currently no off-the-shelf laminate constructions that meet home compostable standards.\"",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mechanicalcanibal",
            "body": "Remind the prep cook that he is compostable and rubber bands are not.",
            "score": 201,
            "replies": [
                {
                    "author": "dakapn",
                    "body": "Some rubber bands are compostable. I take it that these are not?",
                    "score": 21,
                    "replies": [
                        {
                            "author": "j8945",
                            "body": "Depending on the degree of vulcanization, latex rubber goes from breaking down in a ~ year (unvulcanized) to breaking down over decades. \n\nI think you are going to need vulcanization for rubber bands to have the strength/elasticity you need, but I'm not sure if its more like the rubber that takes 5 or 50 years to break down. Either way they are going to greatly outlast the vegetable matter in a compost bin.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "PurinaHall0fFame",
                            "body": "They're really not. Even made with natural latex, the vulcanization process introduces compounds you don't want in your compost pile when the latex breaks down.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "robotatomica",
                            "body": "a lot of things are marketed as compostable but will not break down in a backyard compost pile, they need a lot lot more heat.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jro2020",
                    "body": "If they're rubber bands. They are compostable.  If they're not compostable, they're not rubber bands.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mrbmud",
                    "body": "going to need a hot compost pile to for the prep cook though, this one does not appear to be one",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KogasaGaSagasa",
                            "body": "Do we consider a young prep cook to be green or brown? On one hand, inexperienced, on the other hand, burns easily so probably mostly carbon. /s\n\nCompost jokes. That's a new low for me.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "darxide23",
                    "body": "Where do you think rubber comes from?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Chomp-Rock",
                            "body": "Most of it comes from the same place as plastic. Just under a third of it comes from rubber trees. We don't know which kind of rubber these bands are. ",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ohdearitsrichardiii",
                            "body": "Now I'm curious. Where do YOU think rubber comes from?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NorthwestSmith",
            "body": "Begin cultivating rubber trees.",
            "score": 473,
            "replies": [
                {
                    "author": "Yoloswagforjesus420",
                    "body": "It only makes sense for the next step",
                    "score": 190,
                    "replies": [
                        {
                            "author": "PsyOpBunnyHop",
                            "body": "If it were up to me, I'd ignore them until the broccolis break down.\n\nThen there's no need to take them off the stalks.\n\nThey will just be loose and easy to grab.\n_____\nKeep in mind, rubber is organic.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Chomp-Rock",
                                    "body": "Not all rubber is organic and if you wait for the broccoli to break down the bands will by then be buried by other foodstuffs. ",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "PsyOpBunnyHop",
                                            "body": "> the bands will by then be buried \n\n*\"Oh no! Anyway...\"*\n\nSeriously, so what? Nothing will happen.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Chomp-Rock",
                                                    "body": "I don't know much about composting but it's fairly obvious I know more than you. ",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "6FalseBansIsCrazy",
                    "body": "isn't rubber made from trees anyways?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Pablo_Sanchez1",
                            "body": "Only natural rubber which makes up about 30% of rubber worldwide. The rest is synthetic. I only know this because watching videos of people tapping rubber trees is very satisfying",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "6FalseBansIsCrazy",
                                    "body": "i figured most of it was artificial, though i did have a feeling natural rubber was made from trees",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "4RealHughMann",
                            "body": "That's why they're cultivating rubber trees...",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FleeshaLoo",
            "body": "Whoa, I hope educational karma is on their tail and closing in.\n\nI hope your surgery went well and you'll heal well. Hugs",
            "score": 150,
            "replies": [
                {
                    "author": "FroyoEmbarrassed5043",
                    "body": "While recovering, rubberband prank = mystery solved!",
                    "score": 15,
                    "replies": [
                        {
                            "author": "FleeshaLoo",
                            "body": "Really? Was it someone you knew? A practical joker?",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DanGTG",
            "body": "Task the young prep cook to use a pair of scissors to remove them.",
            "score": 71,
            "replies": [
                {
                    "author": "BawlSack_",
                    "body": "His balls?",
                    "score": 27,
                    "replies": [
                        {
                            "author": "DanGTG",
                            "body": "The rubber bands from everywhere",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "dungeonblaster93",
                                    "body": "Then his balls",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "ASTERnaught",
                                            "body": "Don’t they sometimes use rubber bands to remove balls?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "csonnich",
                                                    "body": "Great idea, and sustainable!",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SarahPallorMortis",
                                                    "body": "This brought back info that’s deep in my brain and mostly useless. I believe those are castration bands.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DanGTG",
                                            "body": "One nipple for gender neutrality",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Chomp-Rock",
                                    "body": "Everywhere?? He has to remove all rubber bands from existence? ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bherman13",
            "body": "Everybody wants to beat the young prep cook for doing something wrong, but it would be good to consider maybe he was just trying to help you out.\n\nMaybe he didn't know what he was doing, but if he was doing it in good spirit, punishing him is wrong. \n\nYou can both take the rubber bands out together and use the time to teach him about compost piles.",
            "score": 110,
            "replies": [
                {
                    "author": "El_Zarco",
                    "body": "Thank you. Fucking medieval comment section lol",
                    "score": 50,
                    "replies": [
                        {
                            "author": "counters14",
                            "body": "First time on reddit?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Commercial-Royal-988",
                            "body": "you think \"clean up the mess you made\" is a medieval punishment?\n\nI kinda want to meet your parents and commit actual medieval torture just so you have a frame of reference.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Sea_Cow4033",
                                    "body": "![gif](giphy|QiCCluutpecs8)\n\nYou",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Commercial-Royal-988",
                                            "body": "![gif](giphy|Wt6kNaMjofj1jHkF7t)",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "takenalreadythename",
                                                    "body": "https://preview.redd.it/xzztiqlr0epe1.png?width=500&format=png&auto=webp&s=576d52903808fd99029aed41088a83e1dca230bf",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "pepperlake02",
                                    "body": "The #2 top comment (at this time) says murder isn't off the table.  I think you are missing something with your characterization of the comment section.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Commercial-Royal-988",
                                            "body": "At the time of posting literally the top 10 most popular comments were \"pick them up or make him do it, why are we discussing this?\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HolderOfFeed",
                    "body": "No need to take out, the bands they use on produce will break down in a few months, compost or not.  \nSource: former chef",
                    "score": 12,
                    "replies": [
                        {
                            "author": "PurinaHall0fFame",
                            "body": "No, you definitely need to take them out. You think they break down in to nothingness? They leave behind a bunch of shit you don't want in your compost. Even natural latex has been processed and had chemicals added to it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Able-Worldliness8189",
                    "body": "Seems more reasonable or.. OP does himself I mean I can see a dozen or so rubber bands, they are pretty bright, the compost doesnt look all to horrible, I don't see how OP doesn't just spend 5 minutes weeding them out himself.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "HotdogFarmer",
                            "body": "Right? Op has fingers and a minute.  Don't wanna hurt those glass hands I guess",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ArtigianoDelCorpo",
                    "body": "So you're saying we should turn the prep cook into compost?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Chomp-Rock",
                    "body": "He wasn't trying to help out, he was doing his job. He probably only did this because he was told to. ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SuperZapper_Recharge",
                    "body": "> You can both take the rubber bands out together and use the time to teach him about compost piles.\n\nAbsolute insanity.  You can go do that in woo-woo land.  I am grabbing the thumbclips. Why learn when you can fear?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "eggs__and_bacon",
            "body": "Ideas for removing?…. Take 1.5 mins and remove them.\n\nJesus Christ this is barely mildy infuriating",
            "score": 22,
            "replies": [
                {
                    "author": "TheManBearPig222",
                    "body": "Yeah, I'm honestly baffled by how serious people are taking this. With a pare of scissors this would take no time at all. That and a convoy with the prep persona about what goes into compost.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "kingofallrealms3",
                    "body": "Fr.\n\nLazy ass people.\n\nI was zooming in trying to see what the big deal was, he really wondering and asking for ideas?\n\nBro just get in there, get some scissors or even just take the rubber bands out by hand, they are attached to the big ass stems, not just scattered into the dirt.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vectornull",
            "body": "I'm sure it'll bounce back in no time ",
            "score": 28,
            "replies": []
        },
        {
            "author": "CHiZZoPs1",
            "body": "Are they actually made of rubber?",
            "score": 25,
            "replies": [
                {
                    "author": "GitEmSteveDave",
                    "body": "If they are like any \"rubber' band I have ever handled and tried to save, they will snap within a week and then break down to dust in a few more when I go to grab it 2 months later.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "allabtthejrny",
                    "body": "Right!? If they are made of rubber then they are compostable. They will 100% breakdown.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "getstabbed",
                            "body": "I don’t believe most bands are made with natural rubber, instead using synthetic which isn’t biodegradable.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "allabtthejrny",
                                    "body": "Okay, I did some research. It's definitely latex rubber (blue rubber bands used on produce specifically), but there's no way of knowing if it's natural or synthetic.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "FearLeadsToAnger",
                                            "body": "Synthetic is more common in general but natural does tend to be used around food much more often than not.\n\nI would still probably remove them either way.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "silver-orange",
                            "body": "A lot of manufactured polymer \"compostable\" products will only break down in commercial compost operations, and not when you just chuck everything in a bin like you might do at home.  Commercial compost is shredded, and maintained at high temperatures and humidity levels.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "kuukiechristo73",
                                    "body": "Hooey.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thiagoknog",
                            "body": "Question now is what makes them blue",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Chomp-Rock",
                            "body": "I don't know much about compost. Is it OK to have rubber in it? Or would it somehow ruin the compost? ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "allabtthejrny",
                                    "body": "Potentially yes & potentially no.\n\nNatural rubber is fully biodegradable. It's a type of tree sap. It's what makes balloon releases somewhat acceptable (though you should use cotton strings and even then it's problematic because how much wildlife will die before the product biodegrades). It doesn't require ultra high heat and the bands are already quite small, so chopping them up won't do much to speed the process.\n\nBut, if the bands are synthetic rubber, it's a totally different story. It would be an oil derivative product similar to plastics.  It would totally ruin the compost.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PurinaHall0fFame",
                            "body": "Even natural latex is treated in order for it to perform like we want it to, so no, these wont just break down in to nothingness, and they're not compostable... unless you want a bunch of micro contaminants in your compost that you can't get out.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SchmuckTornado",
            "body": "Lol what do you mean ideas for removing? It's like 25 rubber bands, just pick them out...",
            "score": 8,
            "replies": []
        },
        {
            "author": "Windsdochange",
            "body": "Looks like 20-30 bands at most.  Pick ‘em up, pull ‘em off, and done faster than it takes to make a Reddit post 👀",
            "score": 36,
            "replies": [
                {
                    "author": "slowdownwaitaminute",
                    "body": "Right? Of course there should be a discussion or some measure taken to ensure this doesn't continue, but the retribution and punitive measures so many are suggesting wouldn't really accomplish anything aside from providing some surface-level satisfaction.\n\nIt's not that many rubber bands. There are better things to focus on than petty squabbles.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Major_Nutt",
                    "body": "But then OP wouldn't get karma.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SarahPallorMortis",
                    "body": "Cut them and pull off. It’s a lot easier than digging around. But the one who messed up should fix it. But no shame should be made against them. Tho it’s a kitchen so there will be shame lol give ppl the benefit of doubt and they won’t harbor resentment and everyone can move on.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ensign53",
                    "body": "Like most of the things in your life, I assume, you're only looking at the surface level. There might be more underneath.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "Manisil",
                            "body": "even if the amount was tripled, it would take 10 minutes tops.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Relative_Inflation72",
            "body": "Just pick them out. What possible other way could there be?",
            "score": 42,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 22,
                    "replies": [
                        {
                            "author": "about7grams",
                            "body": "For real this guy just wants to jump right in \"picking them out\". There's a bunch of bureaucracy and red tape we're going to have to sort through before we can just rush into something like that.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Realmofthehappygod",
                    "body": "Maybe somebody made a magnet for rubber. \n\nOr for blue!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "TheManBearPig222",
                    "body": "It would probably have taken them the same amount of time to pick them out as it did to make this post.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Relative_Inflation72",
                            "body": "I was thinking that. I reckon op could remove those visible ones in 3 minutes, and that's being pretty generous with  time per band.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "throwautism52",
                    "body": "Lmao it would genuinely take like 2 minutes and people are so fucking mad",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoSituation1999",
            "body": "I’m on mobile and I thought this was a delicious brownie. I’m sure you’re more disappointed than me, OP, fair enough, but I’m not far behind you !",
            "score": 4,
            "replies": [
                {
                    "author": "tigm2161130",
                    "body": "I came here to say this so I’m glad it wasn’t just me.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "gypsycookie1015",
                    "body": "Scrolled forever and thought my high ass was the only one. 😭😭 I saw a big ass brownie Sunday with syrup and sprinkles.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mutantmanifesto",
                    "body": "Meanwhile I thought it was used kitty litter",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoSituation1999",
                            "body": "One man’s trash is another man’s treasure, as they say hahahaha",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lonewuhf",
            "body": "Did you confirm that this was ok with the health department before doing this? This may be a health code violation.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Strofari",
            "body": "Smelly lesson for the prep cook.",
            "score": 4,
            "replies": []
        },
        {
            "author": "shit_ass_mcfucknuts",
            "body": "Don't worry, your compost will bounce back.",
            "score": 5,
            "replies": []
        },
        {
            "author": "axefairy",
            "body": "Bit off topic but maybe worth noting, those avocado skins will take *fucking years* to break down without chopping up finely",
            "score": 4,
            "replies": []
        },
        {
            "author": "jro2020",
            "body": "Look I'm not going to be too picky here or anything but The rubber bands that come on foodstuffs are usually real rubber and therefore compostable.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MebbeitsOK",
            "body": "Scissors and time.   Scissors and time....  But make the offender do it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sidekick87",
            "body": "Seems like someone had the idea to help u out and forgot to take the bands off the broccoli.",
            "score": 3,
            "replies": []
        },
        {
            "author": "El_Sanduche",
            "body": "I didn’t read the caption at first and thought everyone just really hates young prep cooks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bmansmith10",
            "body": "If they’re latex they’ll actually degrade relatively quickly.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Shirizuna",
            "body": "My hungry ass first thought that was traybake",
            "score": 3,
            "replies": []
        },
        {
            "author": "Relative_Inflation72",
            "body": "Just pick them out. What possible other way could there be?",
            "score": 9,
            "replies": []
        },
        {
            "author": "Tacomathrowaway15",
            "body": "Oh no, someone helped! \n\n\nMake a sign on the bin for the future, telling folks what's good and bad. And to lightly cover the top with some browns.\n\n\nThen either a little garden claw or just pick them out once the compost batch is done. if they're still there they will be easy to grab ",
            "score": 8,
            "replies": []
        },
        {
            "author": "mbgameshw",
            "body": "Picking them out is the way… or have a KP do it. But while not ideal, I don’t think rubber would contaminate. Might make some interesting carrots 🥕",
            "score": 5,
            "replies": []
        },
        {
            "author": "ThurmanMerman82",
            "body": "Filled...",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeaconSage",
            "body": "Have the dingus who threw them in there go out there with a pair of scissors (to make removal easy) & get them all out of there.",
            "score": 2,
            "replies": [
                {
                    "author": "chickapotamus",
                    "body": "☝️this",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zestyclose-Art4698",
            "body": "Maybe you, or someone, threw vegetables that came from the grocery with a rubber band into your compost and enough time has passed for their deterioration that the bands are easily seen¿",
            "score": 2,
            "replies": [
                {
                    "author": "root_b33r",
                    "body": "This seems more logical, you can see the elastic bands wrapped around things here, no one would take the time, except an exceptionally crazy or vengeful person, even more likely they bought the food and it began expiring and this was the disposal method",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VolumeAcademic6962",
            "body": "Never fu@k with a man’s compost pile.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LivesDoNotMatter",
            "body": "you could just pick them out in less time it took you to snap a photo and whine about it on reddit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mediocre_Ad_2422",
            "body": "Natural rubber is used for food so youre fine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "earthhominid",
            "body": "making the cook who did it sounds good, but it was probably an honest mistake. \n\n  \nThe real answer is to just compost the pile and then get them out on the screen when you screen the finished compost.",
            "score": 2,
            "replies": []
        },
        {
            "author": "xSHITx",
            "body": "Put his nose in it and say “bad prep cook!”",
            "score": 2,
            "replies": []
        },
        {
            "author": "Emotional-Courage-26",
            "body": "This is great for anyone who wants to put compost in their garden. They’ll be able to stretch it a lot further",
            "score": 2,
            "replies": []
        },
        {
            "author": "superphage",
            "body": "This is why there are so many stupid signs for shit. Guess you have to laminate one that says FOOD SCRAPS ONLY FOR FUK SAKES!",
            "score": 2,
            "replies": []
        },
        {
            "author": "theloniousmick",
            "body": "Best one we had \"does someone unconscious count as willing\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Foxs-In-A-Trenchcoat",
            "body": "Maybe it was one of those Bowerbirds that collects blue things.",
            "score": 2,
            "replies": []
        },
        {
            "author": "N3onDr1v3",
            "body": "I dom't understand, are you mad at the brownies?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Freakwilly",
            "body": "Did a dog poop there?  Relevant George Carlin  https://youtube.com/clip/UgkxbAk8TzN5ol9Tg466jnOxUsAz3FUPmGE0?feature=shared",
            "score": 2,
            "replies": []
        },
        {
            "author": "ginghams",
            "body": "The coffee shop I work at has a compost bin that is accessible by the public and I find plastic trash in it almost daily. I have been begging them to get a lock for it since it is only technically for our use and they just don't care. It's nice to see that this kind of crap enrages other people, too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miserable-Button4299",
            "body": "Make him dig them back out",
            "score": 2,
            "replies": []
        },
        {
            "author": "Action-a-go-go-baby",
            "body": "Just to clarify: is this an open air compost pile in a residential neighborhood directly next to your fence?",
            "score": 2,
            "replies": [
                {
                    "author": "arizicedtea",
                    "body": "It’s in the back of a local restaurant",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MightBeAGoodIdea",
            "body": "So many jokes but realistically, dig it all up and sift them out, or do as much sifting as you can and start picking. Make a dumb game of it and don't worry about getting them all in one day just get as many as you can in 10 minutes everyday until you cant find any more.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shoehornblower",
            "body": "Looks like they threw bunches of broccoli and the rubber bands hitched a free ride…",
            "score": 1,
            "replies": []
        },
        {
            "author": "RegularLibrarian1984",
            "body": "It's annoying yes but i had worse things, i planted Chinese white radishes and was waiting to collect the seeds and one of my crazy neighbours stole them all thinking it's \"weeds\" out of the fear they would spread to their garden. They where inside vegetable patch with wood rods marked. I was so annoyed about the wasted time.",
            "score": 1,
            "replies": [
                {
                    "author": "Psych0matt",
                    "body": "Did you confront them?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RegularLibrarian1984",
                            "body": "Pointless we had left and right teacher's one was director. Both behaved like psychopaths one wanted to shoot my cat cause walking into their garden, bringing my mother stones to clean with hedgehog poo, thinking it's our cat. The other one poisoning our black cherry tree cause he had shadow in his garden after 17.00 both nuts. I confronted one of them, he ended up insulting me and he had planted his wife in the garage to listen secretly but it blatantly failed as they insulted us but i don't go to a judge for such crap. These people are miserable and torture everything around them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bluecrowned",
                                    "body": "Maybe keeping your cat indoors would help",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "RegularLibrarian1984",
                                            "body": "I moved away with my cat, we had another neighbour that drowned a cat and stuffed it in our letterbox these people aren't humans.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bluecrowned",
                                                    "body": "And you still let your cats outside? It's horrible that happened but there's a super easy preventative measure",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "meow_mayhem",
                                                            "body": "you sound just like those psychopaths that enjoy killing cats. Hope no one shoots your dog or you know drowns it and stuffs it in your letterbox.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "bluecrowned",
                                                                    "body": "I don't let my dog run free so that would never happen. But it's horrible you'd accuse me of killing animals, i wouldn't ever do that. I am saying this because I want them to be safe. I wish they all had good homes where they'd be kept safely indoors away from people who do those things and dangers such as cars and wildlife.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CapacityBark20",
            "body": "My fat ass saw a cosmic brownie",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntergalacticPopTart",
            "body": "[Hey y’all prepare yourself…](https://youtu.be/ygkswJazPbM?si=r2z6Mze4x7XbU2qp)",
            "score": 1,
            "replies": []
        },
        {
            "author": "InvestigatorWide7649",
            "body": "Get whoever made the mistake to fix it, then feed them to the compost pile when they're done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClydePrefontaine",
            "body": "Bald tire compost",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific_Success214",
            "body": "Another criminal act by the rubber bandit!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarvinHeemeyersTank",
            "body": "> I have this compost pile that I care for at the small local restaurant I work at and while I was gone for a surgery, ***one of the younger prep cooks*** dumped a case of brocclini still banded into the bin. Best ideas for removing?\n\nYou already know the answer. Make the younger prep cook remove them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Megalo85",
            "body": "Pitchfork will make easy work of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kratomite247",
            "body": "Wouldn’t it help hold it all together??",
            "score": 1,
            "replies": []
        },
        {
            "author": "towerfella",
            "body": "Technically, won’t the rubber bands just breakdown?\n\nEdit: answer — [maybe](https://theecohub.com/is-rubber-biodegradable/) (use reader view)",
            "score": 1,
            "replies": []
        },
        {
            "author": "dakapn",
            "body": "I've been on this subreddit long enough to know you gotta pee on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "enzodr",
            "body": "If they are standard latex rubber bands then even if they don’t decompose, it’s relatively harmless",
            "score": 1,
            "replies": []
        },
        {
            "author": "AVeryHeavyBurtation",
            "body": "Rubber band magnet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VapoursAndSpleen",
            "body": "Put a chair and a bucket next to the compost bin and have the younger prep cook spend the afternoon outside cleaning up that mess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical-Hour-5480",
            "body": "From a distance that looked like a really good brownie",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlohaSmiles",
            "body": "Obnoxious but gloves and a pair of scissors, snip the band and pull it out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Niteowl_Janet",
            "body": "Get him to remove the rubber bands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NegScenePts",
            "body": "For removing the guy who did it?\n\nA trebuchet would be pretty efficient.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LolcatP",
            "body": "it should bio degrade in like 1000 years",
            "score": 1,
            "replies": []
        },
        {
            "author": "Independent_Bite4682",
            "body": "Rubber bands are latex, latex will breakdown",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItsLiterallytheLaw",
            "body": "this would ruin me",
            "score": 1,
            "replies": []
        },
        {
            "author": "treeteathememeking",
            "body": "Excellent opportunity to teach the new cook about doing the job right and not half assign things. Seems a little extreme, but if you’re gonna half ass throwing something in the compost… you’re gonna half assign harder things. \n\nIf you want to be extra mean, you can have him turn the compost pile… since it looks like it needs a good turning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glad_Lychee_180",
            "body": "No doubt wishing you well and hope you bounce back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Replacement_1407",
            "body": "All I can focus on is the snake head with white glowing eyes.\n\n\nPlease tell me someone else sees it too!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RynoRama",
            "body": "I see all the \"make the young guy do it\", but he was trying to help no? He needs to learn, not be punished. Why not take him out to the compost and do it together and teach him a bit? I'd bet less than 15 minutes your done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cgdoosi",
            "body": "If they’re actual rubber then they’ll compost. They’ll decompose slowly. But they’re fine to leave",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alan_Greenbands",
            "body": "I don’t know anything about composting. Why is this a big deal?",
            "score": 1,
            "replies": []
        },
        {
            "author": "A2S2020",
            "body": "Pick them out. If anything comes out attached to a rubber band, zing it away. Twang!\n\nSeriously, rubber bands are made of latex and will break down in compost. No big deal",
            "score": 1,
            "replies": []
        },
        {
            "author": "ubermierski",
            "body": "Burn it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "kongclassic",
            "body": "Rubber bands made from natural rubber are biodegradable and compostable",
            "score": 1,
            "replies": []
        },
        {
            "author": "Free-Atmosphere6714",
            "body": "How big of a problem is this? From a practical standpoint i would expect these to fall to the bottom of the bin over time with mixing. Also rubber is a natural product and while galvanized rubber certainly takes some time to break down i don't see those bands cause trouble for the plants their fertilizing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jrose152",
            "body": "Cut with scissors and pick them up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SarahPallorMortis",
            "body": "Is he stupid? Cause I’m assuming he’s stupid and lazy. Really attractive combo",
            "score": 1,
            "replies": []
        },
        {
            "author": "nedonedonedo",
            "body": "no one is actually giving advice, so here's some:\n\nget a metal coat hanger and unfold it. wrap it around a broom on one end to make a large cork screw and bend the other end into an L to make a handle. after you've gathered a bunch of bands you can remove the food from all of them at once",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic-Cod-8451",
            "body": "On my phone, not zoomed in, my dumbass thought this was a very large brownie cake.",
            "score": 1,
            "replies": [
                {
                    "author": "Educational_Tip5368",
                    "body": "With sprinkles",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TeratoidNecromancy",
            "body": "Looks like someone just threw in several bunches of herbs that were wrapped in rubber bands.  The herbs withered, the bands stayed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MithranArkanere",
            "body": "If they were natural rubber you could just leave them there, but they are probably synthetic latex rubber bands for produce, so you need to take them out.\n\nWhoever dumped them, make them grab a pair of scissors and kitchen pliers and cut them all and then pull them out with the pliers, then clean the tools thoroughly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyHamburgerLovesMe",
            "body": "The exact same way they would have been removed when the broccoli was fresh???",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brasou",
            "body": "just grab some scissors snip them and pull them out? They are all on the top layer...it would take maybe 5minutes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cybertubes",
            "body": "Just leave them and when you screen out the compost for use at some point they'll get screened out. They aren't hurting anything.",
            "score": 1,
            "replies": [
                {
                    "author": "jm5813",
                    "body": "Finally, someone with common sense!!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kuukiechristo73",
            "body": "tell me you don't know how to screen compost without telling me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "that_att_employee",
            "body": "There's really not that many. That would probably take 30 minutes to pick out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mypod49",
            "body": "Don’t worry, I’m sure it will bounce back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "minkbag",
            "body": "They probably did that \"rubber bands on watermelon\" trick there for it to explode directly on the compost so they don't have to clean the mess. But now the mess is the rubber bands (well partly that would've been the mess anywhere else also).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oppowitt",
            "body": "Scissors in one hand, long pliers in the other.\n\nSnip and pull, about 100 times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "saurus-REXicon",
            "body": "Asparagus, green onions, broccolini… maybe",
            "score": 1,
            "replies": []
        },
        {
            "author": "D_Winds",
            "body": "Tangential question here, but are there any types of rubber that are \"biodegradable\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "wheatbread-and-toes",
            "body": "Just pick up the broccoli and throw it away. Why are you asking us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "harmicistt",
            "body": "Call the prep cook to take each band out, because it isn't a plastic dump post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sudiptaarkadas",
            "body": "Rubber bands will break down eventually I think",
            "score": 1,
            "replies": []
        },
        {
            "author": "GooseGeese01",
            "body": "![gif](giphy|n4GnKL68ol0ty)",
            "score": 1,
            "replies": []
        },
        {
            "author": "brightroomonfire",
            "body": "The Rubber bandits still at large",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conscious-Film9046",
            "body": "i know i can just look this up, but what is this?",
            "score": 1,
            "replies": [
                {
                    "author": "DeflatedDirigible",
                    "body": "Food compost bin. Rubber bands were wrapped around a good product that was tossed in.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "heiroglytch",
            "body": "Rubber is compostable. This is probably fine. I used to compost balloons when I helped my ex with a birthday party business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yuyufan43",
            "body": "Lucky. When I was out of work for surgeries, someone rear-ended my parked car and totaled it. I would've preferred the rubber bands lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "trowcky2008",
            "body": "If the compost pile is active enough, the organisms will push them to the top. My worms will push all the plastic stuff to the top. Makes it easy to pick through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical-Scar7139",
            "body": "Meh, those rubber bands for produce are just plain untreated latex, afaik. They should compost just fine; might take longer, but they aren’t plastics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TehRiddles",
            "body": "Haven't you got a new prep cook? That can be a job for him to do, I'm sure he'll figure it out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrJacquers",
            "body": "Some chemicals from the bands have probably already leeched into the compost. May be best to start over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darkv3ng",
            "body": "He owes you the biggest rubber band ball now, chop chop!",
            "score": 1,
            "replies": []
        },
        {
            "author": "JawnDoh",
            "body": "Sift the compost, should likely do that to get stuff that might take longer to decompose out before using.  \n\nYou can make sifting trays pretty easily with wire mesh and some wood + screws.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FishLampClock",
            "body": "Really? Best idea for removing? get in there and pick them up and remove them by hand and throw them away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grand_Negus",
            "body": "Blinding soup.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lightningfast13d",
            "body": "It’s simple correct me if I am wrong but broccoli is biodegradable while the rubber bands arent so if you leave it to break down for long enough the rubber bands will be the same as when they were originally thrown in so you can have them spend an entire day sifting the compost to remove every single one which can technically be done at any point it would just resemble compost more the longer it sits",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldybowen21",
            "body": "Just ask the guy who put them in there if he could take the rubber bands out, it's seems like a small issue solved by simply communicating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntentionPowerful",
            "body": "Doesn’t rubber come from a tree?",
            "score": 1,
            "replies": []
        },
        {
            "author": "tallyretro",
            "body": "suit him up with PPE so he's not gonna get sick and make him pick it out lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoodGoodGoody",
            "body": "Not exactly “filled”.",
            "score": -1,
            "replies": [
                {
                    "author": "Yoloswagforjesus420",
                    "body": "Filled enough for me to be ĝrumpy about it.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "im_peterrific",
            "body": "I was thinking that someone finally found a good use for brussel sprouts...",
            "score": 0,
            "replies": [
                {
                    "author": "Yoloswagforjesus420",
                    "body": "Deep fried and tossed in a soy chili sauce!!!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "decade240",
            "body": "The time it took for you to take a picture, post this reddit thread, read even a single response has taken longer than just picking the fucking things out.  \n\nJesus fuck dude, I mean, just fucking pull them out or cut them.  \n\nGoddamn why are you such a little bitch.  Just fucking take them out.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SnooPineapples521",
            "body": "Make the younger prep cook unfuck his fuckup. By hand. Then have him sweep, vacuum, then mop the entire parking lot. In the rain. If it’s not raining, make rain. Then he can paint any flagstones you have on the property. Make sure he gets multiple coats and they fully dry for an even finish. Any sort of brightwork you have, get a can of nev-r-dull and have him polish it. If you can’t use it to shave the fuzz off a spiders ballsack have him do it again. Have him remove excess paint off the flagstones then repaint them. Have him organize the stock room. Then realize the lard needs to be on the top shelf and the paper stuff goes in the broom closet but yell at him anyways for you forgetting. Make him clean the grease traps. With his toothbrush. HIS toothbrush. Dishes for years. I’ve got an entire navy’s worth of hazing for stupid fucks like him.",
            "score": 0,
            "replies": [
                {
                    "author": "_HOG_",
                    "body": "How is this a fuckup?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SnooPineapples521",
                            "body": "The elastics in the compost.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "_HOG_",
                                    "body": "They’re food grade rubber bands. They will biodegrade eventually and meanwhile will cause zero harm. \n\nWhat’s the problem?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SnooPineapples521",
                                            "body": "Then why is OP complaining about it?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Joseph_of_the_North",
            "body": "Latex is biodegradable.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ObviouslyNerd",
            "body": "Comments say this is bad, but why is it bad? Is it a chemical reaction from the rubberbands, does it fuck with the worms at the bottom? idk how compost this size works or what the problem **causes**.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ArkuhTheNinth",
            "body": "Fire him.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Talkaboutplayoffs",
            "body": "The fact you’re in here asking instead of making the little fuck get everyone out of there tells me exactly why it happened in the first place. You’re not respected",
            "score": -8,
            "replies": [
                {
                    "author": "ensign53",
                    "body": " r /iamabadass vibes from this user.",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}