{
    "title": "My Amazon account was hacked and they want me to pay 550$+ of fraudulent charges.",
    "author": "J-Payero",
    "subreddit": "Wellthatsucks",
    "rank": 5,
    "score": 2284,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 69,
    "url": "https://www.reddit.com/gallery/1jdu1kh",
    "id": "1jdu1kh",
    "selftext": "I think I went crazy or something. I would like to know in what world someone's account gets hacked, a third party person orders a bunch of stuff, and then they make you responsible for that. Like what? I have proof that Amazon admitted my account was hacked. How is that not enough for me not to be found responsible. I'm seeking help lol.",
    "comments": [
        {
            "author": "syzygysd",
            "body": "I know it sucks, but Amazon doesn’t have to refund the fraudulent purchases. Your Credit Card provider should easily handle the fraud. I had this happen to me with another company. They essentially told me to pound sand. My credit card company immediately reversed the charges and handled everything with the company.",
            "score": 1780,
            "replies": [
                {
                    "author": "iruleatants",
                    "body": "My account has hacked, I noticed it in minutes and reset the password and contacted support. They promised a refund for everything. A month later I had not received it and so I contacted them and they offered another refund. A month later nothing had happened.\n\nI contacted my bank and they started the dispute process and Amazon told me to cancel the dispute because they would refund me. Still no refund and my bank doesn't allow a second dispute.\n\nI contacted their social media support who reached out to help and then told me they can't do anything.\n\nIn the end, 6 months after the incident I sent an email directly to Jeff Bezos and someone from his staff contacted me the next day and processed the refund right away.\n\nIt's just absurd.",
                    "score": 637,
                    "replies": [
                        {
                            "author": "jhonny-rocks109",
                            "body": "Hey do you by any chance have those emails, im having the same problems not getting a refund from amazon for a month now and would love to get in touch with someone that can actually solve my problem and not jerk me around",
                            "score": 202,
                            "replies": [
                                {
                                    "author": "tychozero",
                                    "body": "If you've tried to go through Amazon and got nowhere, take it up with your card company. DO NOT undo that even if Amazon asks.",
                                    "score": 111,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DjSall",
                            "body": "You never cancel reversing a fraudulent charge, that's how the marketplaces get to keep your money, sadly :/\n\nI hate shady businesses",
                            "score": 114,
                            "replies": []
                        },
                        {
                            "author": "IndependentThen8969",
                            "body": "I’m assuming you know this but never ever listen to a company telling you to not dispute 1 they aren’t supose to do that in the US if your else where they scammed you",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "J-Payero",
                    "body": "That's what Amazon said, yet they're still fighting those charges. The first two disputes I did were wrongly done by my credit card institution because they were not listed as fraudulent charges, so Amazon easily won by saying I didn't return any packages or that I as a customer know the price of the items before buying anything, which is false because I didn't order anything - even Amazon admitted my account was hacked by sending me emails about the third party being kicked out. Now, I still don't know why they won the dispute again so I'm going to wait for the letter.",
                    "score": 113,
                    "replies": [
                        {
                            "author": "emmejm",
                            "body": "Did you send those notifications to your bank with the dispute?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "J-Payero",
                                    "body": "Yeah, when my bank account institution sided with Amazon the first dispute, which they didn't list as a fraudulent dispute and that's why Amazon won, they sent a letter to me explaining why they sided with Amazon. In that letter, aside from explaining why Amazon won, they also had an email listing my credit card institution email for sending further proof if I still wanted to continue with the dispute. So, I sent them all of the Amazon emails with me explaining why I shouldn't be charged for anything of what was ordered. In any case, it's absurd to think about me paying even some of that money. Even if they got to deliver some packages I could not have even been waiting for them and someone might have even stolen them because again, an Amazon agent told me they were going to cancel everything since I did not order anything myself but some random Mf.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "nj23dublin",
                            "body": "If things don’t get moving, go to BBB. I didn’t have the same exact situation but digital purchases all restored after being hacked because I complained on BBB.",
                            "score": -13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DullSentence1512",
                    "body": "Worked fraud dept for a bank's CC. File a police report, you will need to send it in to the person handling your case with the bank and you should be good to go. Its more complicated than that, but without the police report, nothing will be done.\n\n  \nalso, tell the officer or whoever you talk to that you need a report to turn into your bank for fraud and should be good to go.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "HotAd9605",
                            "body": "Can I do that for BetMGM? (See posted comment) I didn't authorize the charges and after the dispute they say too bad.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Organic_Popcorn",
            "body": "Who's making you pay? Your bank?",
            "score": 215,
            "replies": [
                {
                    "author": "J-Payero",
                    "body": "When this first happened, the first institution I contacted was Amazon. They told me to dispute the charges with my credit card institution and so I did, just to find out that Amazon is fighting for it, which doesn't make any sense to me.",
                    "score": 217,
                    "replies": [
                        {
                            "author": "Organic_Popcorn",
                            "body": "Escalate the dispute, keep fighting it. I think you might have to get the police involved.",
                            "score": 180,
                            "replies": [
                                {
                                    "author": "J-Payero",
                                    "body": "There is no way in which I can pay for something I did not order. I'm thinking about contacting MasterCard itself or the police, whatever that gives me a chance because that's too much to pay and I have proof I didn't order anything. What concerns me is that in the Amazon app I can't see the items that were ordered because Amazon got them removed. The only proof I got are the emails that Amazon sent me about the issue.",
                                    "score": 93,
                                    "replies": [
                                        {
                                            "author": "Unlucky-tracer",
                                            "body": "Make a police report ASAP. Get the police report number or the document to the credit card company. This will at least be a paper trail because rarely do people who commit fraud file police reports. Also document every call and chat with Amazon and your credit card company so you can pull their prior statements up during any further discussions. The vendor themselves might be the culprit and Amazon dosent want to admit fault. Amazon vendors have done this many times in the past.",
                                            "score": 76,
                                            "replies": [
                                                {
                                                    "author": "J-Payero",
                                                    "body": "Do you know if they take electronic evidence? All I have are the Amazon emails stating that indeed my account was hacked and they got rid of the hacker. I have proof that some items were cancelled, others not delivered, and two delivered but they're not listed on my Amazon item list. And yet, they're still charging me the full amount. Which pisses me off is that they probably access my personal information. Amazon should be at fault for literally everything. I'm too cautious about opening some type of links so I'm pretty sure it was not my fault.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "Unlucky-tracer",
                                                            "body": "If they are saying your account was hacked in emails and have taken action, but you are still liable you need to send that correspondence to your credit card’s fraud department. You are not at fault for a breach of your account. You still need to file a police report if possible as it indicates you are looking to clear your name. Dont let the police say its not their problem. Say that someone stole money from your credit card by hacking into Amazon, provide them the correspondence. Get it in paperwork. Hope it works out.",
                                                            "score": 15,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "envysteve",
                                            "body": "All you have to do is file a police report and give the case # to Amazon and your bank. They’re not going to fight that, not for a second. I did it with the front face recently because they wanted to play games when FedEx blatantly delivered the package to the wrong house with photographic evidence.",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "rocketman19",
                                            "body": "MC won't do anything, all they do is control the network, the banks do everything else",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cardboardoge",
            "body": "I once had someone break into my car at the gym and steal my wallet. Luckily, when they tried to buy anything above 5 dollars the card declined. I got to cancel all my cards before anything went through.\n\nThey robbed the poorest person in the parking lot 🤷‍♀️\n\nEdit: Also, sorry to hear OP, that majorly sucks",
            "score": 89,
            "replies": []
        },
        {
            "author": "cpshoeler",
            "body": "Please make sure you are opening a fraud dispute and not just a regular dispute for goods and services. They can be very different things for banks. Tell the bank you did not authorize or make these charges. A regular dispute you usually keep your same card number, a fraud dispute you are issued a completely different number. Amazon would then need to prove that they sent the purchased items to your address. Now if they did get sent to your address and were stolen from there, then you may be out of luck or have to do everything through Amazon directly.",
            "score": 41,
            "replies": [
                {
                    "author": "J-Payero",
                    "body": "That's what happened when I opened the dispute the first time. The second time, it was done correctly and my card information was changed. Also, they delivered a package with two items, yet I can't see them listed on my items on my Amazon account. It's like Amazon deleted them when they kicked out the third party, so I'm not sure what I should do in this situation tbh.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Salogy",
            "body": "This isn't called a dispute. You're not disputing anything. This is called fraud. If this was a dispute then you received the wrong items or they came in a different condition as described. You're not disputing the service, your account was compromised and money was stolen from your bank.",
            "score": 12,
            "replies": []
        },
        {
            "author": "paligators",
            "body": "Good luck, I went throught his. You need to charge back through your credit card. Amazon won't do anythign on their own but you can continue to escalate. It took me 5 months to get $450 worth of charges finally off my card.",
            "score": 7,
            "replies": []
        },
        {
            "author": "J-Payero",
            "body": "Also, I didn't mention this but it seems the person also tried to order a lot of gift cards to their email. Almost 10,000$ even though my credit limit is 2000$. I didn't receive any emails about payment being declined or something, just this email. I was also tempted to contact that Mf.\n\nhttps://preview.redd.it/iowjbswr1dpe1.png?width=1080&format=png&auto=webp&s=767fec985cda4498701a49c3fcb425dd92dcf8de",
            "score": 6,
            "replies": [
                {
                    "author": "horsetooth_mcgee",
                    "body": "*Tempted* to contact them? Of course contact them. Craft the scariest, most legal looking email you can, accusing them of a felony, tell them there is a warrant out, and send it to them as a threat. Might not accomplish much except make their blood run a bit cold, stressed out that they're about to get busted big.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "upievotie5",
            "body": "I'm curious, you can see where the orders were delivered right?  Do you know who they went to?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Just_Ear_2953",
            "body": "This isn't a dispute between a buyer and seller. That's what Amazon's system is set up to deal with. They received an order, and they presumably delivered the product as requested. They have no way of knowing it was fraud.\n\nIf you paid with a credit card, you may have the option to dispute it with your credit card provider depending on the terms of your card agreement, but if not, then it really is just on you. Protect your card and number.",
            "score": 8,
            "replies": []
        },
        {
            "author": "BrendaHelvetica",
            "body": "Is this citi? They’re so bad with their fraud investigations. I disputed 3 different legitimate charges and lost each time. I’m about to close the CCs with them because of these experiences.",
            "score": 2,
            "replies": [
                {
                    "author": "J-Payero",
                    "body": "Yes it is. I thought about cancelling my credit card with them if they don't handle this situation as it should.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sh0ch",
                            "body": "I just want to throw this out there: I've never lost a dispute with American Express. I've been very impressed with their handling of fraud and disputes.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AmorinIsAmor",
                    "body": "3 times you got told to pound sand and youre just maybe thinking about changing banks fucking lmao.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tommygun1921",
            "body": "I absolutely hate when websites force you to save your c.c. on file. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "The-Poet__57",
            "body": "I don’t care what anyone says, let the credit card company do their job to get your money back",
            "score": 2,
            "replies": []
        },
        {
            "author": "bctopics",
            "body": "You need a police report. If you have a police report this should be an absolute cut and dry case for the credit card company.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Super_Order_7744",
            "body": "What location were they sent too? Your bank allowed the address?",
            "score": 3,
            "replies": [
                {
                    "author": "afitz_7",
                    "body": "Pretty sure that the bank is not given the ship-to, only the location of the transaction.  I use my Amex for all online purchases and most everything else and would have used them to stop payment.  Amazon would probably ban my account (like Apple tried to do before), but I’d have my money back.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Super_Order_7744",
                            "body": "Just a chase experience if my billing address  is different it won't work but Op said they used op location so sounds like family or friends(idkk)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "afitz_7",
                                    "body": "That does sound fishy. I don’t think even Amex would bail me out on that. Definitely seems like a local job.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "J-Payero",
                    "body": "They were going to send it to my apartment, which didn't make sense to me because why would someone hack my account and send items not to their places. It looks like the person wasn't able to change the address. However, when I talked to the Amazon agent I told them to cancel everything. They still sent like three items - two packages. One package was delivered and one was returned cause it needed a password since that package itself was like 300+ of women jeans I believe so I told the delivery guy what was going on. The other package got to be delivered cause it didn't need a password.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "LucarnAnderson",
                            "body": "password for delivery? never heard of that. do you mean something like a signature? or is it that you need to say a literal codeword for them to be able to deliver? I'm very curious and a bit confused",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "J-Payero",
                                    "body": "Yeah, when the package that's being delivered is costly Amazon sends you a one time password to give it to the delivery guy and avoid any theft. Without it, the delivery guy cannot leave the package on the floor and mark it as delivered as he did with the other one. I'm not sure if codes are given for the same purpose.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "LucarnAnderson",
                                            "body": "ohh cool! i didnt know it did that sometimes. at least that one package wasn't able to be delivered cause of this then",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "J-Payero",
                                    "body": "Yeah, sometimes when the item that's being delivered is costly, Amazon itself sends you a one time password so that nobody can steal the package. You just give that password to the delivery guy and they give you the package, which is why he couldn't deliver that package. I'm not sure if they give you codes for that purpose too.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Super_Order_7744",
                                    "body": "Maybe ment signature",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WhenTheDevilCome",
                            "body": "Agree, there is a \"PIN required for delivery\" option now for some items to try and mitigate the amount of \"never got it\" reports, by trying to force someone having to be face to face with the delivery person and providing the PIN.\n\nThe description in your comment here makes sense... but also seems to describe that the hacker \"got nothing.\"  The items were either cancelled, returned by the carrier due to lack of PIN, or were successfully received by you.\n\nWhich makes it seem like \"everything except the package received by you\" is already handled.  Or at least about to be handled, once they receive back the item for which the PIN was never provided.  Whether bought by you or the hacker, the item successfully received can be returned under normal Amazon return policy.\n\nSo while it's understandable \"I would like for my credit card to have never paid these things in the first place\", it also concurrently seems like a situation where even if the credit card-level disputes don't end up siding with you, Amazon is going to ultimately be issuing credits for all of these anyway once you return the item successfully received.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "J-Payero",
                                    "body": "I did receive two items, but how can I return them when I can't see those items in my Amazon app? When Amazon \"handled\" the situation, they also did something to my account, which I don't know what It was to kick the third party and at the same time it's like they got the items deleted on my app. I don't know how to explain it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WhenTheDevilCome",
                                            "body": "Fair enough, that sounds like something only talking to Amazon could answer.  Both the \"why can't I see them online any longer, if I'm still getting charged for them\" aspect, and also the \"what is happening with the cancellations and returns on the items, and is there a return or cancellation I still need to initiate\" aspect.\n\nI was just thinking from a \"if they end up believing the hacking was still your responsibility\" angle, if in their view you did place all three of those orders (or gave someone the password to do so, etc., such that you're responsible), then cancellations and returns of these \"legitimate Amazon orders\" (in Amazon's view) should also be an option for why the money goes back to the payment method.  At least \"eventually.\"",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Melbuf",
                            "body": "> They were going to send it to my apartment, which didn't make sense to me because why would someone hack my account and send items not to their places.\n\nthe person making the fraud purchase likely had one sent to the address on file to see if the transaction would go through before going after something larger.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Melbuf",
                    "body": "I recently had an employee who had their corp card get compromised, and amazon sent the order to us at work. We assume the person making the fraud purchase had one sent to the address on file to see if the transaction would go through before going after something larger. \n\nThe order was a stack of 10 paper notebooks.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "greywar777",
            "body": "ask them for a address where you can serve them under small claims court.  Their actions in telling you you would be refunded have resulted in you being unable to file a dispute with your CC.  If nothing else it should at least get their attention.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ready-Interview4020",
            "body": "Just reminded me to close my Amazon account, I had a card info left in there but didn't use it for months. Thanks",
            "score": 1,
            "replies": []
        },
        {
            "author": "AUMatl",
            "body": "That looks like a Citi bank fraud investigation and they do a Horrendous job of \"investigating\" fraud",
            "score": 1,
            "replies": []
        },
        {
            "author": "Contemplating_Prison",
            "body": "I wouldn't even deal with Amazon over this. Call the bank or credit card company and have them charge back the purchases and do a fraud investigation. Youll get everything back",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious_Fennel459",
            "body": "♫Never keep your cards on file anywhere!♪♪",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular-Smile5025",
            "body": "Oh my word that is horrible!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClutterKitty",
            "body": "Double check that the company hasn’t refunded the purchase and that’s why your dispute is being closed with your bank. The same happened to me (someone bought $300 of Facebook ads) and my bank refused the refund. Next day I got my refund directly from Facebook.  \n \n(Unless I’m misunderstanding this, and it’s Amazon who refused. In which case, open a chargeback claim with your bank.)",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdministrativeFly233",
            "body": "This is one of the reasons I do not leave my credit card on my Amazon account. I delete it after every purchase so that I don't have this issue.  It is a hassle to jump through all the hoops it takes to get your money back",
            "score": -1,
            "replies": []
        },
        {
            "author": "weasel",
            "body": "Use 2 factor authentication for better security",
            "score": -1,
            "replies": []
        },
        {
            "author": "HotAd9605",
            "body": "I'm dealing with this through PNC. \n\nBetMGM ran my card 6 times for $100 each within 3 minutes. Now, in order to add money I have to verify with my thumbprint and put in my CVV code. I was playing a slot game and it started glitching and now I know why. But there is no way I was physically able to keep adding money while playing because of security steps.\n\nBank told me this weekend it's my responsibility. 🤦🏼‍♀️",
            "score": -3,
            "replies": []
        }
    ]
}