{
    "title": "Trying to understand the failed assassination of Donald Trump",
    "author": "MyStupidName2048",
    "subreddit": "communism",
    "rank": 435,
    "score": 158,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 55,
    "url": "https://www.reddit.com/r/communism/comments/1e31u8a/trying_to_understand_the_failed_assassination_of/",
    "id": "1e31u8a",
    "selftext": "Hello everyone. I've just heard the news about the attempt to shoot Trump. It looks like people are talking a lot about it. I'm not from the US and I don't understand the politics background there. Can someone give me some insights of it, and maybe some analysis from a Marxist point of view? Thank you very much.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "urbaseddad",
            "body": "I'll go against the grain here and say it doesn't mean much of anything. It doesn't magically reveal a deep crisis of imperialism, we already knew that. The conspiracy theories including the ones being posted in this thread are ridiculous and a further symptom of the petit bourgeoisie panicking; also further proof Democrat supporters / Amerikan \"liberals\" and Republican supporters / Amerikan \"conservatives\" are not much different. Some guy just shot at Trump because he was very upset about his declining petit bourgeois settler interests (due to the aforementioned crisis of imperialism, which we knew of independently if Trump) and believed Trump is to blame for it. That's basically it.",
            "score": 80,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "compocs",
                            "body": "what’s so interesting about the guy’s self-conception?",
                            "score": 20,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Careless_Owl_8877",
            "body": "donald trump is a rich guy who speaks for extremist settlers. a lot of people hate him. someone tried to shoot him.",
            "score": 309,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "dovhthered",
            "body": "This event is a reflection of a profound crisis of the imperialist system, and this crisis has once again reached the point of the physical elimination of the contenders for the presidency.\n\nOf course, it cannot be ruled out that this is a setup, as the manipulation of public opinion for their ultra-reactionary ends through commotion is written in the history of the US ruling classes.\n\nRegardless, the first thing that came to mind when I read the news was that this will escalate into mass unrest, and there's no vanguard party to lead them.",
            "score": 152,
            "replies": [
                {
                    "author": "MyStupidName2048",
                    "body": "You said \"once again\"? So this kind of assassination has happened before?\n\nCan you elaborate on your prediction? With mass unrest and without vanguard party, how do you think the situation is likely to end up with?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "bort_jenkins",
                            "body": "JFK, Gerald Ford, Reagan, RFK, a few others",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "Oddblivious",
                                    "body": "Attempted on Roosevelt",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dovhthered",
                            "body": ">So this kind of assassination has happened before?\n\nIn the US this has happened a lot. Kennedy and Reagan were the most notable recent examples, there's an entire wikipedia article dedicated to this topic.\n\n>how do you think the situation is likely to end up with?\n\nwe cannot predict the future, but past experiences show that without the guidance of a vanguard party, spontaneity and tailism often lead to failed revolutions.",
                            "score": 48,
                            "replies": []
                        },
                        {
                            "author": "redrefractions",
                            "body": ">You said \"once again\"? So this kind of assassination has happened before?\n\nHonestly, half of me assumed you were trolling, but then I saw you were Vietnamese. Sorry for assuming, lol.\n\nEven though he wasn't President, it kinda gives me George Wallace vibes over, say, Kennedy--since both failed and were directed at \"racist dinosaurs\" (a quote from Wallace's assailant). Maybe it's like Reagan and he was trying to impress Jodie Foster.\n\nCoincidentally, I have a clip of Parenti talking about JFK in my post history. You can find the entire lecture somewhere online, if you're more curious about American assassinations.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 55,
            "replies": [
                {
                    "author": "kannadegurechaff",
                    "body": ">Trump is a neo-fascist/isolationist right wing “authoritarian” [...] and wants to replace it with an open terroristic bourgeois dictatorship.\n\n\na rather long text just to call Trump a fascist and spout some scare words that liberals would love.\n\nThe only difference between the two parties is their approach to maintaining domestic or international empire. To claim that Trump is advocating for an \"authoritarian terrorist bourgeois dictatorship\" now suggests that the US has not been one until this point.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "marxistgarfield69",
                            "body": "the neoliberal US has maintained the illusion of domestic rule of law and civil rights, fair elections. \n\nlook at the panthers in the 60's and 70's who were victims of police raids, COINTELPRO, disruptions of their community programs, media campaigns funded against them to discredit them, arrests on dubious legal charges, and other harassment like this. even the assassination of fred hampton they justified with self defense, search warrants etc. \n\nthis is not the same as an openly fascistic leadership like for instance the fascist regimes installed by the US in latin america. \n\nunder ábenz or pinochet who took no issue with openly ordering the deaths of dissidents in the street with no pretense of judicial justification. \n\nidk it seems kinda unclear where exactly to draw the line and i don't think it's really that important to split hairs with the terminology like this",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "kannadegurechaff",
                                                    "body": ">Real oppression towards people of color\n\nimplying they're not genuinely oppressed right now?\n\nHow do these people even find their way to this subreddit?",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "kannadegurechaff",
                                    "body": "What you are doing is simply [Tone-policing](https://www.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/). \n\nThat user offered a shallow analysis of the situation, which I simply pointed out. \n\nIf you've been part of an org or study group, you'd know that people often avoid criticizing or denying others' viewpoints to keep things non-confrontational, this is usually unproductive. At least in this internet forum we can challenge each other and turn discussions into something productive.",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 13,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -7,
            "replies": [
                {
                    "author": "Wide-Engels",
                    "body": "What democracy? Down with \"your\" \"democracy\".",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "kannadegurechaff",
                    "body": ">He's a threat to our democracy, and an actual fascist\n\nwho's democracy?",
                    "score": 28,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "GeistTransformation1",
                                    "body": "A democracy that was established by slave owners.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "GeistTransformation1",
                                                    "body": "Rights for white settlers. Not the indigenous or black people.",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "GeistTransformation1",
                                                    "body": "Democracy, but America has never been one.",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "dovhthered",
                                                    "body": "you're already living under a dictatorship, the dictatorship of the bourgeoisie, and you benefit from it, yet remain blind to its realities. \n\nyour so-called \"democracy\" has long resembled fascism for oppressed groups within the US, such as Black, Indigenous, queer communities, and others.",
                                                    "score": 21,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Autrevml1936",
                                                    "body": "Dictatorship and democracy are not exclusive. Capitalism has a Democracy for the Bourgeoisie and a Dictatorship over the Proletariat.\n\n\nDictatorship in the way we use it(as this is a communist subreddit) simply means rule or rule by one class over another.\n\n\nThe Idealist version of \"Dictatorship\" most get taught(one man with all Power, absolute power corrupts absolutely, etc) has not been demonstrated materially.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "But it isn't a democracy.",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MyStupidName2048",
                    "body": "Considering his popularity right now, I may argue that his death may make many people angry and may cause worse consequences than him alive.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -5,
            "replies": [
                {
                    "author": "MyStupidName2048",
                    "body": "Well, there are multiple articles on the incident on Vietnamese newspaper (I'm Vietnamese) so I assume things must be hotter or at least equal hot in the US and around the world.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}