{
    "title": "Fake lenin quote (?)",
    "author": "UomoPuma",
    "subreddit": "communism",
    "rank": 425,
    "score": 46,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/communism/comments/1e8xb2n/fake_lenin_quote/",
    "id": "1e8xb2n",
    "selftext": "Hello comrades. Recently I stumbled upon this alleged Lenin quote about Mussolini:\n\"What a waste that we lost mussolini. He is a first-rate man who would have led our party to power in italy\"\nI'm inclined to think that's it's fake, given that the only source I could find was the book Third World Ideology and Western Reality by Carlos Rangel, a known liberal and anticommunist author but i'm not that good at tracing the sources. Maybe someone here could help me. Thank you \n\nEDIT: The source cited by Rangel is \"Mussolini and Lenin: A conversation with Domenico Settembrini\" by George R. Urban. Urban was a hungarian liberal anticommunist who worked with radio free europe. As for Settembrini he was an anticommunist personality who thought that \"Communism is an extremist form of fascism; fascism is a moderate form of communism\". As i dig more my suspects become more certain. Tomorrow I'll go to the library hoping to find the book in question to check its sources ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Metallikov_",
            "body": "Thats obviously fake. Does Rangel even cite a source for this quote?",
            "score": 38,
            "replies": [
                {
                    "author": "UomoPuma",
                    "body": "\"Mussolini and Lenin: A conversation with Domenico Settembrini\" by George R Urban. Both Urban and Settembrini are liberals and anticommunists",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Metallikov_",
                            "body": "Probably a rumor. Mussolini had no relevance within the Italian communist movement. With so many good bolsheviks in italy why would he \"mourn\" a person who was never a member of the communist party?",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "untiedsh0e",
                                    "body": "I doubt the quote is literally true, but it is a fact that Mussolini was a leading figure in the \"intransigent\"/\"Maximalist\" faction of the socialist party, what was considered the revolutionary or left wing of the party in its opposition to the reformist, openly revisionist right wing. It is uncomfortable to admit that not a small number of interwar fascists came from a background in the orbit of their respective social democratic parties, but it is in facts like these where we can reveal the essence of social democracy as social fascism. Before the First World War, the revisionist socialist parties were places where future fascists, communists, and liberals coexisted and their political trajectories are not at all straight forward. What made the difference between a Mussolini, a Bordiga, a Gramsci, or a Togliatti? We are not just talking about individuals.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok-Communication4264",
                            "body": "Urban legend lol",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yifans",
            "body": "lenin died 20 years before mussolini",
            "score": 10,
            "replies": [
                {
                    "author": "zziikii",
                    "body": "well no. the fascist party was officially formed in 1921,the march on rome was in october 1922 and lenin died in 1923. so lenin was alive and knew about mussolini because of his socialist past.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Lenin died 1924",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Lenin did not die. He lives in my heart",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "yifans",
                            "body": "yeah i didn’t know the context of that quote oops",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UomoPuma",
                    "body": "yeah but i think he refers to the fact that he left the Italian socialist party because he was pro-WW1. we lost him in that sense",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kirk_Blanchard",
            "body": "I can’t tell if it is legit, but I highly doubt it. Mussolini became somewhat famous in the Italian Socialist Party only in 1912 when he lead the Radical Wing of the party at the Congress of Reggio Emilia. He was expelled from the Party in 1914 because of his pro War stance, a position that Lenin would have condamned. Lenin in 1912 wasn’t too much known worldwide apart from some circles in Germany and Austria, and according to an Italian newspaper https://www.ilsole24ore.com/art/un-mussolini-po-russo-AEj4PbAB Mussolini didn’t know Lenin until 1917 when he started writing articles about the two Russian Revolutions (Mussolini praised the russian revolutionary movement and even declared Russia to be a country of honor and intellectual and moral strenght, until Russia Made peace with Germany, which Mussolini saw as madness). However you have to take in consideration that Mussolini was always the most radical in the Italian Socialist Party and if the Bolsheviks continued to fight for the Entente, probably Mussolini would have supported them. Mussolini was actually a comrade, before greed and ambition corroded many of his youth period ideas.",
            "score": 2,
            "replies": []
        }
    ]
}