{
    "title": "Court dissolves Move Forward Party (Thailand)",
    "author": "earthfirewindair",
    "subreddit": "communism",
    "rank": 396,
    "score": 26,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.bangkokpost.com/thailand/politics/2843182/court-dissolves-move-forward-party",
    "id": "1em9fzy",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "HappyHandel",
            "body": "Why post this here?",
            "score": 18,
            "replies": [
                {
                    "author": "AltruisticTreat8675",
                    "body": "Same. Probably just another Thai liberal discovered communism on the internet and they took it (the dissolution) personal.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "earthfirewindair",
            "body": "Thoughts on this? Will the repeated dissolution of political parties push more people towards non-electoral methods to bring about change?",
            "score": 7,
            "replies": [
                {
                    "author": "AltruisticTreat8675",
                    "body": "It's just a bourgeois party dabbling itself in neoliberal reformism despite the existence of \"Marxists\" in the party. Are you actually a Thai person? Just asking. \n\n> In reality, the MFP is not a real threat to the Thai ruling establishment, but rather functions to contain growing political opposition to the ruling class within the narrow confines of what passes for parliamentary democracy in Thailand. It is a bourgeois party, representing aspiring sections of the corporate and financial elite, that masquerades as a “progressive” opponent of the military and more right-wing sections of the Thai state.\n\n> The MFP is not making any attempt to mobilise workers and youth in opposition to the Thai state’s flagrant attack on democratic rights. This was made clear by MFP leader Chaithawat Tulathon, who told reporters, “We plan to talk to the public about how we will fight this case in our way… It will not affect our work in parliament.”\n\nhttps://www.wsws.org/en/articles/2024/04/08/avfn-a08.html\n\nWSWS is not good but at least they point out the un-logic of participating in bourgeois politics and the inevitable \"repression\" as a result. Notice that Move Forward still accept the \"repression\" given its need to maintain seats in the Parliament instead of joining in the protest (just like its predecessor), although the class character of the MFP (certain faction of the Thai bourgeoisie in alliance with the urban petty-bourgeoisie) block any revolutionary act from within (and structurally speaking it can't). \n\n> political parties push more people towards non-electoral methods to bring about change?\n\nIt already happened. \n\nhttps://en.wikipedia.org/wiki/2020%E2%80%932021_Thai_protests \n\nThe Thai equivalent of the \"Arab Springs\" and the Candlelight movement in South Korea against the Park Geun-hye's regime. They were all defeated for the same reason.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "earthfirewindair",
                            "body": "I'm aware of the protests. Any thoughts on this organization: https://x.com/socialistth?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArcoftheVerse",
            "body": "Sad. They may be social democrats but they're still the best party there",
            "score": 1,
            "replies": [
                {
                    "author": "TardisTrekkie84302",
                    "body": "The fact that The Move Forward Party was dissolved by a court and the party’s seats in the Thai house of representatives will be forced to join a existing party or be forced to vacate their seats only proves that it may take a while for the Thai government to have a prime minister from a center left party",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}