{
    "title": "Are new social programs impossible after the collapse of the USSR?",
    "author": "Googie-Man",
    "subreddit": "communism",
    "rank": 390,
    "score": 137,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/communism/comments/1enpm4t/are_new_social_programs_impossible_after_the/",
    "id": "1enpm4t",
    "selftext": "There is a theory that during the cold war, the capitalist Western European states (and other western countries like Canada, Australia, etc.) had to develop several social programs in order to \"bribe\" their citizens to not side with the USSR. Such as giving out free education, free healthcare, free public housing, etc.\n\nNow that the USSR has collapsed in Europe, the West has no incentive to give its citizens these benefits, because where else could you go? There's no USSR anymore.\n\nI can see most of these social programs gradually being reduced and defunded, or only made to be available to \\~5% of the population. Some programs may be scrapped altogether. It would be logical since the West would rather use that money on foregn imperial wars than on their own people.\n\nAs such, since the government has 0 reason for bribing the public by offering generous social programs that makes life better, it essentially makes any new social programs impossible to implement. Such as with universal public healthcare in the USA.\n\nWhat are your opinions about this idea, and is there any truth to it?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CombatClaire",
            "body": "sophisticated slimy onerous unwritten unpack market direction lock support nail\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 70,
            "replies": [
                {
                    "author": "Googie-Man",
                    "body": "It's interesting that all the Westerners thought they were \"capitalists\" pre-1991, while they were actually living in a heavily socialist inspired capitalist system.\n\n\nI think the world is heading towards what capitalism really is like, and these same westerners will be shocked by what they see.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "CombatClaire",
                            "body": "chop plant liquid caption drab bag employ waiting repeat memory\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Googie-Man",
                                    "body": "I see social democracy as being the bribe the West gave to their people to not turn towards true socialism.\n\n\nSocial democracy is not real socialism. It just mimics it, like a stick insect or something of that sort. ",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "veen_666",
                                            "body": "It mimics it in that many citizens can get a quality of life achievable under socialism but that's only because of the exploitation of the global south. By elevating it's own citizens to labour aristocracy, it outsourced it's proletariat.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "You could just call it capitalism with safety nets. Or welfare capitalism. While i understand the point you’re trying to make, the other commenter is right, there’s really nothing about western/Northern Europe that resembles socialism. Yes fear may have played a role in their imperialist adjacent ruling class’ decision to give concessions, but really tho, any tangible labor gains, in the west or anywhere else, are almost always the product of growing class consciousness + solidarity coupled with hard fought struggle. To simplify it down to their proximity to socialist nations is a textbook reactionary way of looking at things and honestly, quite insulting to the legacy of those workers who fought tooth and nail for those concessions.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "lm_a_celeb_NAM",
                                            "body": "You're so right",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bighi",
                            "body": "Saying that one is heavily inspired by the other because they have tiny similarities is like saying that my milk frother is very similar to an Apache helicopter because both have something that spins.\n\nI’m bad at analogies, but I hope I could create the visual I intended.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Auroraescarlate44",
            "body": "I perceive this notion as idealist, which is why it is so propagated by opportunists and revisionists. These social welfare programs and more generally the welfare state that characterizes the modern hegemonic imperialist states started to form around the second half of the 19th century long before the October Revolution. \n\nThe precursor I believe was Bismarck's Germany, during the process of German reunification and it's rise to the status of great imperialist power but soon it started to emerge in the other imperialist states as well and reached full maturity in the post WW2 period. Social welfare, high paying jobs for life and low price of housing and other commodities characterized this period and is the reason why it's called the \"miraculous\". It occurred in most modern hegemonic imperialist states in the same period between 1950 to the late 1970s.\n\n The rise of the welfare state therefore coincides with the expansion of the labor aristocracy and petty bourgeoisie in imperialist nations and we can conclude that it is financed in the same fashion, through imperialist super profits. So the question is should we continue to refer to this as a \"bribe\"? Lenin of course did so several times but in his time the labor aristocracy was not fully formed as class yet, only a minority of workers in hegemonic imperialist nations were bourgeoisified. \n\nI believe that if communists continue to refer to this process as a bribe we end up propagating this idealist notion that the labor aristocracy and the welfare state exist because a portion of the ruling bourgeoisie decided it was necessary to starve off revolution and as soon as the threat of \"communism\" passed they started to undo it. This is not how politics or economics work. The ruling class can't control things to this level and can't coordinate on such a fashion, the capitalist system operates autonomously. \n\nTherefore the labor aristocracy and the welfare state in hegemonic imperialist nations arose because it became possible in a period in time in witch the super profits were plentiful enough to sustain such a large number people to reap more value than they produce through their own labor. This of course is still true to this day but there has been an overall erosion of the benefits that this class enjoys and this is a result of the waning of imperialist superprofits as a result of inter imperialist competition as well the tendency of the rate of profit to fall not the collapse of the Soviet Union.\n\nThis is why China's relative rise to the status of imperialist contender will not bring back the same plentiful benefits that were once afforded to the labor aristocracy through the welfare state or other means as it is not possible to do so. In fact competition from China will result in a further diminishing of benefits. There is simply not enough profit to go around anymore and attempting to resurrect the welfare state fully would only lead to further economic degeneration through stagflation as was already beginning to occur in the 1970s. The neoliberal turn of the 1980s allowed the capitalist system to reinvigorate itself and the entry of China into the world economy as a source of cheap exploited labor was essential to this as simply eroding the welfare state would have been insufficient.",
            "score": 17,
            "replies": []
        },
        {
            "author": "None",
            "body": "Yes, the very reason for the invention and existence of Keynesian bourgeois social welfare is due to pressure from the superior conditions for workers in the first socialist super power.  \n\n1 example:  there used to be great funding programs for musicians and artists in West Germany (which funded the German musical innovation of the 60s and 70s - Can, Neu!, Faust, Tangerine Dream, Kraftwerk, etc.), and right after 1991 began to dry up.    Today it is a terrible situation for artists who each competes with others for survival.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Yookusagra",
            "body": "I believe there's a ton of truth to this.\n\nApart from social-democratic welfare states, we can also see this phenomenon in civil rights; in the competition for third world allies, the US looked worse than the Soviet Union when lynchings and Jim Crow were rampant. I think a big part of why the civil rights movement in the US got as far as it did - still not far enough - was due to the Cold War propaganda race.",
            "score": 21,
            "replies": [
                {
                    "author": "Googie-Man",
                    "body": "That's true. However, that has gone away since the 1990's unipolar moment. The US was the only game in town, so they didn't care about how they look to third world states. If you don't agree with the USA, they'll attempt to \"regime change\" you like Libya, Syria, Venezuela, etc.\n\n\nAnd that whole narrative was finally killed off with the US supporting genocide in Palestine. No third world country will want to touch anything from the West with a 10 foot pole now.\n\n\nIt's why we need a strong BRICS to compete with the West.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "kannadegurechaff",
                            "body": ">It's why we need a strong BRICS to compete with the West.\n\nwhy do you think BRICS is going to change anything?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Googie-Man",
                                    "body": "Not just BRICS.\n\n\nBRICS, SCO, EEU, ASEAN, CSTO, etc. \n\n\nAll of these groups are Eurasian integration projects, which seek to ally up the whole of Eurasia, so they can counter-balance Western power.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "turbovacuumcleaner",
                            "body": "> It's why we need a strong BRICS to compete with the West.\n\nSo, social-chauvinism abroad for social-fascism at home. Got it. At least you're straightforward. I hate when people beat around the bush to get to this point.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tenchi1128",
            "body": "I think I heard the term champagne communists back in the day, only exists in wealthy western countries",
            "score": 2,
            "replies": []
        },
        {
            "author": "deodorel",
            "body": "Yes I have the same feeling. About the causes there is also globalisation and capital mobility that makes it difficult even for willing countries to run and implement them. Any attempt to extract more from capital is futile as companies will just move to another country.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -3,
            "replies": []
        }
    ]
}