{
    "title": "Zak Cope gone crazy and disavow his work on unequal exchange for neoliberalism.",
    "author": "Technical_Team_3182",
    "subreddit": "communism",
    "rank": 375,
    "score": 103,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 82,
    "url": "https://www.reddit.com/r/communism/comments/1esgloc/zak_cope_gone_crazy_and_disavow_his_work_on/",
    "id": "1esgloc",
    "selftext": "https://link.springer.com/referenceworkentry/10.1007/978-3-031-25399-7_82-2\n\nEdit: u/ComradeShaw made comment on it an hour ago in weekly discussions, which I didn’t realize until after I made this post. Mods should decide if this should stay on.\n\nhttps://www.reddit.com/r/communism/s/0rm7QbsvL9",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": "Damn you were not kidding, what a loser. I tried to read it out of curiosity but it's a screed. Unless Cope really did have a mental breakdown, I wonder about his understanding of Marxism in the first place. Oh well. The funniest thing about it is the author bio:\n\n>Zak Cope is Research Fellow at Queen’s University Belfast, and author of Dimensions of Prejudice (2008) and The Wealth of (Some) Nations: Imperialism and the Mechanics of Value Transfer (2019). I am co-editor of the Palgrave Encyclopedia of Imperialism and Anti-Imperialism (2021) and the Oxford Handbook of Economic Imperialism (2022).\n\nI disavow all my previous work but I still put it on my CV.",
            "score": 65,
            "replies": [
                {
                    "author": "GeistTransformation1",
                    "body": "I doubt it's a mental breakdown. Zak Cope cites is horror over the ''bestial violence'' of Hamas ''terrorists'' as the reason why he now hates Marxism; Cope is Northern Irish and brazenly quotes Margeret Thatcher in his newly published screed which likely means that he comes from a Loyalist background considering that Margeret Thatcher is an incredibly despised figure amongst Northern Irish Catholics and nationalists, and Loyalism is to Ireland what Zionism is to Palestine.\n\nMy theory is that Cope probably had a rebellion against his parents or family that was expressed in academic terms, initially citing sectarianism in Northern Ireland caused by British colonialism as the catalyst for writing DWDC, but after the recent uprising in Palestine that began on October 7, Cope has probably realised that he isn't so different from all the Israelis who were killed by the outbreak of revolutionary violence and has now understood what the stakes are for his class, maybe fearing that the IRA or another group like them may do to him what Hamas has done to the beneficiaries of Zionism, and so Cope has given up his rebellion and is now going to embrace settler-colonial ideology.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "cyberwitchtechnobtch",
                            "body": "I don't think it's a coincidence both Cope and Lauesen went down a revisionist path within a similar time frame, though clearly Cope has shot way past revisionism. Neither had a particularly sufficient explanation of the reproduction of imperialism based within the labor process itself, they merely described *how* value was transferred but failed to correctly identify *why*. Empirically rich but theoretically poor. Sadly we see where the poverty of such theory leads when subject to the forces of academia and revisionism today. Though, this whole episode has lead me to reread Sam King's thesis, partially out of neuroticism but more productively, to get a stronger grasp of it.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "> partially out of neuroticism\n\n\nWhat do you mean?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "cyberwitchtechnobtch",
                                            "body": "Some erroneous line of thinking like, \"If Cope can blindside everyone by becoming a pathetic liberal, anyone can.\" This is clearly coming from a place of reaction, and the correct response is a sobering reminder that we should always be reading these authors critically regardless of whether their writing resonates with us, and to also be sure to consistently reevaluate our understanding of them.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "urbaseddad",
                                                    "body": "Right. I think it's true that liberalism is immanent to all people of such classes, maybe even all people under capitalism. Perhaps I'm not as emotionally invested because I hadn't read Cope before this (I still plan to, though) but I don't see why one should be particularly thrown off by this. But yeah I think you've reached the right conclusion. We keep in mind they're fallible like anyone else and take the correct parts and discard the wrong parts. (Not to justify liberal or revisionist eclecticism; there is a qualitative difference between revisionists picking out the wrong parts and discarding the correct parts and Marxists doing the exact opposite.)",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ULTIMATEHERO10",
                                    "body": "What is Sam King's thesis?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Natural-Permission58",
                                            "body": "[https://vuir.vu.edu.au/37770/1/KING%2C%20Samuel%20-%20thesis\\_nosignature.pdf](https://vuir.vu.edu.au/37770/1/KING%2C%20Samuel%20-%20thesis_nosignature.pdf)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "bumblebeetuna2001",
                                    "body": "can you expand on what you mean by \"Neither had a particularly sufficient explanation of the reproduction of imperialism based within the labor process itself, they merely described *how* value was transferred but failed to correctly identify *why*\" ?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MajesticTree954",
                            "body": "While it may be true October 7th forced him to make that qualitative break with his past by forcing him to reckon with the real-life implications, the seeds were there before in his ideological development up to that point. It's kind of pop psychology to attribute this to a rebellion against his parents. It may be a possible interpretation, It doesn't really help us because we need to understand how someone becomes a neocon on the basis of a scholar who has published about imperialism not just with reference to their class position, but their ideological development which has some degree of independence - which has its own logic and history.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "GeistTransformation1",
                                    "body": "I'm not sure Zak has written enough to trace his ideological development; he is not a public figure rooted in any political struggle but an academic whose only exposure we have to him are a handful of works published over the course of a decade before he suddenly made a 180° on all of his views which could be for any reason, maybe he was approached by a libertarian Think Tank who offered him money, had a mental breakdown like Althusser, my theory about October 7 or he followed the course of some logic in his work that we haven't discovered yet. All we can do is critique his select few works and isolate any reactionary logic that a detached academic like Cope is bound to reproduce.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Technical_Team_3182",
                                            "body": "https://www.researchgate.net/publication/365429237_Imperialism_and_Its_Critics_A_Brief_Conspectus\n\nCope’s hysteria was already foreshadowed in The Oxford Handbook of Economic imperialism in 2022, where Cope worked with Immanuel Ness. In particular, the chapter written by Cope. Just look at the last line on the abstract.\n\n>>The chapter concludes by highlighting the limits of much contemporary ‘anti-imperialism’, and the tendency for ‘anti-imperialist’ discourse to provide cover for authoritarian and imperialist states outside ‘the West’.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "ULTIMATEHERO10",
                                                    "body": "He also called the USSR under Stalin \"settler colonialist\" in that same book...and he didn't really provide any real justifications for it either tbh. It's a shame: I read through DWDC earlier this summer after finishing *Settlers* and found it really insightful and found myself agreeing with his points about the chauvinism of first world workers.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ComradeShaw",
                    "body": "I have heard that Divided World Divided Class is one of the best books to understand the labor aristocracy. Would you say this is still true (Was it ever true)?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "None",
                            "body": "It has weird concepts of nation, but economically it is interesting. No reason not to read it as you read everything: critically.",
                            "score": 22,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CoconutCrab115",
            "body": "Skipped the Trotskyite and just became a neocon. Holy shit",
            "score": 32,
            "replies": []
        },
        {
            "author": "GeistTransformation1",
            "body": "Not just a liberal but a fascist now. Strange and disappointing development but it's not the first time that a ''Marxist'' member of the intelligentsia turned around to disavow Marxism and embrace fascism. We will just have to appropriate where Cope was correct and throw out the garbage",
            "score": 57,
            "replies": [
                {
                    "author": "Technical_Team_3182",
                    "body": "What’s really funny from this piece is the tension between his supposed neoliberalism (free-market anti-protectionism) and neoconservatism (“defend” liberal values against “dictatorships”), almost an embodiment of the preserving capitalism vs “US hegemony” contradiction. For example, \n>>If a significant number of nations adopt anti-capitalist policies, this can lead to a shift away from open markets toward more protectionist and statist economic models. Such a shift would undermine the economic growth model upon which many countries rely, potentially leading to economic contractions and increased tensions between nations having differing economic ideologies. The promotion of protectionist nationalism as a socialist response to free market internationalism risks fueling imperial expansionism. When countries adopt trade barriers or protectionist tariffs, they disrupt established supply chains and trade relationships, damaging domestic industries that rely on imports of raw materials or exports of finished goods and lowering economic efficiency by reducing competition.\n\nThis is reminiscent of what China “wants” with its trading partners, to stop tariffs and disruption to trade relationships. Also China’s anti-revolutionary outlook, since it might disturb the global supply chains, is also what is outlined by Cope. \n\n>>Growing trade conflicts and a fragmented global economy could damage necessarily multilateral cooperation on issues such as security, technology, infrastructure development, and the environment (Rohac, 2019). It must also increase distrust and tensions between nations having differing approaches to economic and trade policy. \n\nAll of this comes, nevertheless, with an extreme hostility to every “anti-Western/anti-imperialist” movements from history until today—specifically “reactionary” ones like Russia or Iran—with October 7 being Cope’s turning point. \n\n>>In recent times, socialists determined to exculpate the governments of Russia and China from any wrongdoing have engaged in atrocity denial in Syria, Xinjiang, and Ukraine. Their massed ranks descended on the streets of Western capitals to denounce Israel in the wake of Hamas’ October 7 pogrom before the country had even had the opportunity to count its civilian dead and kidnapped. Anti-capitalism has served as a major bedrock of the anti-Western (especially anti-American) worldview that makes such egregious moral myopia possible.\n\n\nI also wonder if there was anything immanent to his analysis that forced him to abandon Marxism or whether it was just the typical “the Left left me”. \n\nPerhaps both, that the Dengism that eventually arose from Cope’s politics came into cognitive dissonance with his personal life, bombarded with propaganda, which left a mess. You’re right that this is not the first and certainly won’t be the last time.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "GeistTransformation1",
                            "body": "Regarding Cope's Zionism, I wonder if it has any relationship with his Northern Irish background and if he hails from the Protestant community who have a strong affinity with Israel due to their shared experience as settler colonialists fighting against indigenous ''terrorists''. Or if his training by Queen's University has functionality turned him into a 'protestant' even if that's not how he was brought up. I'm probably stretching though, there are many other reasons why a white academic would have their class interests aligned with Israel, and as it has been pointed out here, Cope looks like an opportunist who refuses to remove his ''toxic'' Marxist works, that he has disavowed, from his CV because he knows that it looks good on his portfolio and that whatever fascist drivel he publishes in the future will never match in terms of citations\n\nEdit: He has now quoted Margeret Thatcher (which no Catholic in Northern Ireland would ever do) and I've heard that he comes from a Loyalist family so I guess that explains where his Zionism comes from and his hostility towards national liberation.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "_dollsteak_",
                            "body": ">Anti-capitalism has served as a major bedrock of the anti-Western (especially anti-American) worldview\n\nAnyone using \"the West\" is such a way reveals their racism so boldly—the bastion of civilisation (white people) against the barbarians and savages (any peoples outside of Euro-America). How unsurprising.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Far_Permission_8659",
            "body": "It’s telling that what made his prior works worthwhile is totally missing here. Even as far as liberal polemics go, this is lazy and poorly thought out— not much more sophisticated than the average conservative troll here demanding we reckon with whatever new dumb thing Timothy Snyder said.\n\n>Nationalist socialism can lead to a fragmented global economy that undermines growth and fuels geopolitical conflict. As such, countering anti-capitalism with reasoned argument is crucial to challenge its widespread influence.\n\nThis part especially stood out to me because it’s a weird amalgam of hasbara (or post-Clinton hysteria that puts the cause of world conflict on an irrational oriental totalitarianism) and domino theory. Unlike its predecessor, however, the necessary response isn’t military intervention but being a debatebro in some as-of-yet undefined arena (of course he means academia). I suspect this is the direction that academic “Marxism” will go now that Dengism doesn’t need an actual flesh-and-blood validation for their carnival while the proletariat has outgrown such theorists. There is simply no market for the Zak Copes of the world so he pivots.\n\nIf he wants to be Douglas MacArthur in the meme wars then fine, but it’s insulting to his own legacy to be this bad at it.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Technical_Team_3182",
            "body": "From LTV to economic planning to the theory of imperialism/unequal exchange, Zak Cope basically attacks everything having to do with Marxism, opting to defend the liberal world order.",
            "score": 19,
            "replies": [
                {
                    "author": "Flamez_007",
                    "body": "This man literally says he's indebted to [Johan Norberg](https://en.wikipedia.org/wiki/Johan_Norberg) (notorious ghoul of the Cato Institute and writer of the Capitalist Manifesto) and he's quoting fucking Eugen von Böhm-Bawerk's works like *Capital and Interest* and *Karl Marx and the close of his system.* \n\nThis is like watching your favorite Chihuahua getting rabies and tweaking at your grandmother's house, this is so sad.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ambitious-Humor-4831",
            "body": "Perhaps a re-evaulation of his work is in order. Anyway this is incredibly disappointing to see. His, john smiths and J Sakai works were essential in forming my own anti-imperialist views and it's looking like Sakai is the only person that has emerged timeless.",
            "score": 24,
            "replies": [
                {
                    "author": "None",
                    "body": "This MIM article briefly mentions Sakai making a questionable statement regarding 9/11:\n\n>In addition to the obvious, in-daylight sellouts in the Middle East, there are also clandestine sell-outs. Like the Liberals in the Iraqi CP and the CP=U$A that supports it, there are many in the Middle East and other places who have decided that attacking \"theocratic fascism\" takes higher priority than attacking u.$. imperialist interests.\n\n>No doubt Russia and China have their cynical geo-political interests involved in enticing u.$. imperialism into becoming the world's two-fisted liberal against Islam. Those thrilled with this idea should see their new allies. One is Christopher Hitchens(4) denouncing \"theocratic fascism.\" The other is the practically John Birch society rag \"Front Page Magazine\"(4) which has called for a Congressional investigation of MIM. Hitchens is hawking his credentials as a journalist in favor of a war crimes trial for Henry Kissinger et. al. regarding Vietnam while simultaneously talking up G.W. Bush. **Even worse, J. Sakai is calling September 11 2001 the work of \"Pan-islamic fascism pressing home their war.\"**(5) Since none of these Liberals ever claimed to buy into Lenin's theory of imperialism as the highest stage of capitalism dominated by finance capital, we cannot say we are surprised. They are all entitled to define fascism in whatever useless way that they want.\n\n[https://www.prisoncensorship.info/archive/etext/wim/cong/fascismcong2004.html](https://www.prisoncensorship.info/archive/etext/wim/cong/fascismcong2004.html)\n\nUnfortunately, the source link is broken for his quote; regardless, I was surprised Sakai would frame 9/11 in such a way.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ernst-thalman",
                    "body": "Idk if anyone could say that Sakai emerged timeless. There are inconsistencies and other issues even with settlers, but also with some of his later writings",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ambitious-Humor-4831",
                            "body": "What's inconsistencies is in their sakai? I honestly think Settlers is incredibly underrated and that it actually explains far more about global capitalism than I think Sakai realized at the time, especially after reading all 3 volumes of Capital.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "urbaseddad",
                                    "body": "Sakai is an anarchist. This interview of his that was explicitly anti Lenin, basically called Leninism a bourgeois intelligence plot against anarchism https://redyouthnwa.wordpress.com/wp-content/uploads/2018/05/basic-politics-of-movement-security.pdf. Which is consistent with anarchism of course but inconsistent with reality, which his Settlers (from what I've heard and seen since I haven't actually read it yet) does a good work exposing.\n\n\nEdit: typo ",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Turtle_Green",
                                            "body": "It’s a talk he gave at an anarchist festival in Montreal, he’s just speaking to the audience there. Sakai’s not calling Leninism a bourgeois plot—whether the Czarist secret police quelled anarchism through uplifting Marxism is immaterial, since Marxism just happened to be true. I can imagine him saying this to a few chuckles: \n> Clearly they made a few small mistakes in doing it this way,\n\n*Settlers* is an explicitly Marxist-Leninist text. It’s more ambiguous in FNFI, which was written by a wider group that Sakai was a part of. The guy probably has a soft spot for anarchists, but that’s not that important. *Settlers* is his life’s work, rigorously researched and written at a particular historical moment of transition—whatever else he says on the side we can either take or leave.",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ernst-thalman",
                                    "body": "It is incredibly underrated and completely worth fighting through the settler Leftist pearl clutching to read with people for political education  but reading through the section on WW2 demonstrates some of the flaws with Sakai’s method of discerning revolutionary nationalism. There is also the frequent referral to the settler nation of Atzlan by proponents of Settlers without a critical analysis of how Chicanismo has subverted indigenous national liberation struggles and can be co-opted into fascism, though this is more an issue of interpretations of Sakai",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "red_star_erika",
                                            "body": "Aztlán is not a settler nation unless you are also willing to argue that New Afrika is as well. there are contradictions between the aforementioned nations and the First Nations but they do not have to be antagonistic. the goal should be unity against amerikkka.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "ernst-thalman",
                                                    "body": "Why is Guadalupe-Hidalgo central to the national origins of Atzlan then? Why is Chicanismo so reliant on Indigenismo and the erasure of Indigenous national identities and territory? You mention contradictions, as do MIM adjacent articles, but I don’t see any meaningful effort to work them out beyond calling for an unprincipled unity",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "cyberwitchtechnobtch",
                                                            "body": "Your eagerness to label Aztlán (though really Chicane nationalism) as settler-colonial is suspect. Assuming you read *Settlers*, it's not exactly clear how this would lead you to believe Chicanismo is *specifically* settler-colonial. The argument could be made that elements of Chicanismo (especially those that draw from La raza cósmica) carry *colonial* baggage from the bourgeois intelligentsia which first articulated it, but note, it is precisely colonial in nature.\n\nFor a vulgar but hopefully illustrative comparison, is Hindutva fascism *settler*-colonial in nature? Clearly not, unless one awkwardly bends all the theorization on it by Indian Maoists through the terms of an already contorted concept of settler-colonialism. Though to be clear, Hindutva is plainly reactionary whereas Chicanismo has the potential to be (and already is to some extent) progressive in the hands of Chicane masses.\n\nHowever, you are correct in that contradictions between Chicanes and First Nations are woefully overlooked and that this has been a historically weak point for anti-revisionists. Though I don't think you've offered much greater clarity yourself in your thread with u/red_star_erika. I don't know what characterizes the class relations between mestizos and indigenous peoples as *settler*-colonial. Mestizos were certainly placed above indigenous people within the Spanish colonial caste system, but mestizos were not settler-colonists (though Penisulares and Criollos arguably were, but of a pre-capitalist form). You'd also have to make the argument that mestizos in other Spanish controlled colonies were/are settler-colonists which starts to diminish the explanatory power of *settler*-colonialism. If you framed the question instead in terms of (post/semi) colonialism colliding with settler-colonialism then I find there is much greater clarity.\n\nEd: Re-reading this again, I think it's necessary to point out a consistent pitfall with the reliance on racial categories like, \"mestizo\" or \"criollo\" and really even the category, \"indigenous\" for that matter. Speaking only in those terms, or placing them as primary, only obfuscates any analysis of the \"Americas\" and keeps things trapped in the realm of postcolonialism where questions of class or productive relations are just some few coins in a pile of loose change to be pulled out from the pockets of academics when it's time to buy a \"new idea.\"",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "ernst-thalman",
                                                                    "body": "Response coming soon, but I promise you it’s not eagerness but rather complicated thoughts after having working with Chicano nationalist groups like Brown Berets and Indigenous cadres who were dealing with the consequences of their agitprop",
                                                                    "score": 8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "red_star_erika",
                                                            "body": "define a settler nation.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "ernst-thalman",
                                                                    "body": "Where the Quebecois not a settler nation despite facing national oppression by Anglo-Kanadians?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "red_star_erika",
                                                                            "body": "Aztlán contains proletarians and nationally-oppressed lumpen whereas quebec does not. again, define a settler nation.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ernst-thalman",
                                                                                    "body": "I think this would be faster if you just made your case here. Why is this true?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "red_star_erika",
                                                                                            "body": "you made the claim that Aztlán is a settler nation and I'm asking you to define what that means. are Chican@ migrant proletarians from the third world settlers? you brought up chauvinism within the Chican@ movement but I don't view this as satisfactory since Black nationalism nowadays is largely chauvinistic and historically, also made the error of not paying attention to the First Nations. does this make it a settler nation in your view? to speak about settler-colonialism, you have to speak about class and you have failed to do that so far.",
                                                                                            "score": 12,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ernst-thalman",
                                                                                                    "body": "What more makes it a settler nation to me is its historical origins are based on aftermath of the Mexican American war. Chicano migrant proletarians from the third world doesn’t make sense. Chicano is a term used to describe a national identity north of the border, that was ghettoized within the amerikan southwest. The development of the region, before and after the Mexican amerikan war, involved the dispossession of indigenous peoples by an emerging ‘mestizo’ strata of the population. To compare this to the systemic trafficking of west Africans that served as the crucible of the New Afrikan nation is a bit misleading imo. To this day it’s not just a matter of chauvinism, it’s a matter of erasing this history.",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "red_star_erika",
                                                                                                            "body": ">Chicano migrant proletarians from the third world doesn’t make sense.\n\nyes it does because they become a part of the Chican@ nation and experience national oppression.",
                                                                                                            "score": 7,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "ernst-thalman",
                                                                                                    "body": "Now what I’m curious about, besides your response on the origins of Atzlan, is the differences to you between the national question  in Atzlan and Quebec(which was also ghettoized and repressed)",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "red_star_erika",
                                                                                                            "body": "already answered this.",
                                                                                                            "score": 7,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ernst-thalman",
                                                                                                                    "body": ">Aztlán contains proletarians and nationally-oppressed lumpen whereas quebec does not. again, define a settler nation.\n\nThis isn’t a sufficient answer",
                                                                                                                    "score": 3,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "FinikeroRojo",
                                                            "body": "Guadalupe Hidalgo is not central to the national origins you don't know what you're talking about. The indigenismo is a problem true but this is not irreconcilable similar confusions exists in most oppressed nations.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "ernst-thalman",
                                                                    "body": "Can you elaborate then?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FinikeroRojo",
                                                                            "body": "Chicane nation was created through the forced and coerced assimilation of people from the local indigenous tribes, imported indigenous peoples (initially tlaxcalans later others) and mestizos, black people and others into the rancher and mission system as it expanded. The Criollo/Peninsulares classes were at the top of this system (not mestizos) and it was initially integrated into Mexico. Guadalupe Hidalgo is just a document the people which we call Chicanos already existed as the document was signed.\n\nedits: wording",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ambitious-Humor-4831",
                                            "body": "Hmm. I can agree with this take. Capitalism is always revolutionizing itself so it is certainly possible that nationalism that we thought were revolutionary could be considered reactionary now. Marx changed his mind on a few issues throughout his life as his method got more refined. We have a wealth of 40 years of knowledge now since the books publication. We must live up to the full potential of their revolutionary analysis even if they as individuals falter a bit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpiritOfMonsters",
                    "body": "This passage always stuck out to me in *Divided World Divided Class*:\n\n>Black America, meanwhile, even its “left” reformist political vehicles, has completely failed to question its social chauvinist commitment to Obamas presidency. Thus the US government has been\r free to launch a war of aggression against a sovereign African nation\r (Libya), in which it armed, trained and helped organise a rebel force\r composed of Islamic fundamentalists, intelligence service assets,\r comprador capitalists and anti-black racists who have since publicly\r lynched hundreds of black Africans and ethnically cleansed large\r parts of the country of the same. In addition, Obama launched a\r proxy invasion of Somalia at the height of its worst drought in 60\r years and cut food aid to the country, thus condemning many tens of\r thousands to death by starvation. Even within the US itself, Obama\r publicly denies the significance of “race” to the disproportionate\r impact the current recession is having on Black people in terms of\r employment, health care and home ownership. Yet Black approval\r ratings of Obama remain between 80% and 90%.  \n>  \n>As Black Agenda Report writer Glen Ford has noted, “Obama,\r who arrogates to himself the right to kill designated enemies at will,\r is permitted by Black America to commit crimes against peace with\r political impunity... \\[and has\\] paid no domestic political price for his\r cruel barbarities against Africa’s most helpless people, because Black\r America exacted none.” This is a symptom not merely of political\r confusion and misleadership, as Ford suggests, but of the absence of\r a militant Black proletariat seeking an end to its exploitation and the\r overthrow of the capitalist state.\r\n\nThis passage has aged very poorly, and the \"even\" in the first sentence sticks out especially. Maybe Cope is an example of where overly cynical third-worldism leads you.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "red_star_erika",
                            "body": "how has it aged poorly? was Obama ever taken to task for his crimes against the third world? right now, is Harris seriously threatened for her role in imperialism?",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "SpiritOfMonsters",
                                    "body": "The Ferguson riots happened in 2014, and black people have always consistently rebelled against police violence. Can you definitely say there is an \"absence of a militant Black proletariat seeking an end to its exploitation and the overthrow of the capitalist state\"? That the masses do not consciously direct their violence toward the end of capitalism and the bourgeois state as a whole follows from spontaneous rebellion and the lack of a communist party that would organize them. That there are chauvinistic black labor aristocrats does not automatically foreclose the possibility of revolution. Cope's argument for why this is a doomed effort is approval ratings.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "red_star_erika",
                                            "body": "the uprisings in response to police violence do not prove the existence of a proletariat. white people participated in them afterall. the passage is not saying that there is no possibility of revolution, but points out the integration of the oppressed nations of Turtle Island into imperialism (which fits into the book's larger purpose of exposing first world wage labor as a whole, it isn't just relying on approval ratings). there has been a growing disconnect between New Afrikans and Afrikans due to this but it doesn't mean there is no point in engaging with the New Afrikan national struggle.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "SpiritOfMonsters",
                                                    "body": ">the uprisings in response to police violence do not prove the existence of a proletariat.\n\nI don't disagree, however, Cope is the one specifically asserting that there is no black proletariat, and I don't believe he is justified in doing so. Especially because his motivation for the book was settler-colonialism in Ireland. Since the bulk of the book is about wage differences between the first and the third world, you would think that would suffice for his discussion of the US in the present day, but he decides to make a specific argument about \"Black America.\" The argument he chooses to make is not one based on how the settler hierarchy of wages has changed in the US, but just a lazy page or two where black people are equated to Obama. To me, this just sounds like the kind of lazy third-worldism which takes for granted that there's no first-world proletariat even in oppressed nations without any social investigation. Maybe you could argue this is just poor word choice on his part or not representative of his thought, but I don't feel too charitable given his recent work.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "> Cope is the one specifically asserting that there is no black proletariat, and I don't believe he is justified in doing so.\n\nThen write your economic analysis and prove it to us.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "SpiritOfMonsters",
                                                                    "body": "Cope's flimsy argument is not correct by default unless someone proves otherwise. My point is that the existence or nonexistence of a black proletariat in the US is precisely what's to be studied rather than dismissed offhand.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": ">the existence or nonexistence of a black proletariat in the US is precisely what's to be studied rather than dismissed offhand.\n\nAgreed.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Auroraescarlate44",
                            "body": "I also do not understand why this passage aged poorly. Isn't this simply an effect of many, perhaps a majority, of Black Americans being integrated into the labor aristocracy? There were many Black Americans supportive of Obama because they profit from imperialism, less then White Americans but they still profit nonetheless.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "SpiritOfMonsters",
                                    "body": "See my other response. My point is not that he's wrong about there being a black labor aristocracy, but that his assertion that there's no black proletariat is not justified by two pages about Obama.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "_dollsteak_",
            "body": "> and argues that following free trade principles of comparative advantage can benefit all countries.\n\nCrikey. Is it still worth reading his previous books? (Divided World, Divided Class specifically is one I've seen recommended a lot here.)",
            "score": 11,
            "replies": [
                {
                    "author": "cyberwitchtechnobtch",
                    "body": "You'd get more out of reading Sam King's thesis than DWDC. King actually addresses Cope's argument on imperialism within the thesis:\n\n>To substantiate his view that global productivity is converging, Cope compares productivity in like for like commodities in agriculture and manufacturing, concluding that productivity is similar. It is true that in certain types of labour processes labour productivity is equal or close enough to equal—such as sewing garments. This is the reason capitalists do move these labour processes to cheap labour locations.\n\n>However, this represents only one of the two key trends in the international labour division. It ignores the increasing concentration in the imperialist core of other types of labour tasks where productivity is not equal. Thus, even if we accept Cope's calculations that Third World agricultural labour is equally productive to First World labour in agriculture or selected other areas, this would in no way demonstrate that labour is equally productive in general. Cope makes passing mention of core \"technological advantage\" but this is separated from his main theoretical argument, from which it is excluded in favour of the contradictory postulate of converging productivity.\n\n>How then is value transferred? For Lauesen and Cope,\n\n>*The principal mechanisms for this transfer are the repatriation of surplus value by means of foreign direct investment, the unequal exchange of products embodying different quantities of value, and extortion through debt servicing.*\n\n>(...)\n\n>As Cope says,\n\n>*since the incredibly low wages of Third World nations do not result in a concomitantly high rate of profit* \\[for the capital employing this labour power - principally Southern firms - SK\\]*, international differences in wages are principally observed in prices.*\n\n>The first problem is that Southern-produced cheap labour goods have both high and low prices. Compare the iPhone to the $10 pair of jeans. If both these are assumed to contain mostly cheap labour, what explains their radical price divergence? Secondly, profit rates are not equal. What Lauesen and Cope seek to explain is not equal profits but core surplus-profits. If, as Cope says, productivity is now equal, and it is Southern capital that has best access to cheap labour, why can't it be the principal beneficiary? Thirdly, as Mandel (1972) pointed out in relation to the theory as originally articulated by Emmanuel and Amin, for their theory to work, capital would have to be constantly flowing into the South. Such capital outflow from the core would be a massive capital flight. Yet capital continues to concentrate in the core, not decamp en masse.\n\nIt sort of makes sense how Cope wound up at \"free trade principles,\" since even within DWDC the explanation for the reproduction of imperialism was theoretically poor, relying on an explanation that lay outside the realm of production:\n\n>Like other \"financialisation\" explanations, Cope does not explain how \"finance\", \"investment\" or \"exchange rates\" can bring about core monopoly domination in the absence of its productive domination. \"Domination of world trade\" on the other hand, clearly relies, in the long run, on what one has to trade. According to Cope, technology transfer is blocked not by any organic economic mechanism within the imperialist economy but only outside of the economy due to political intervention—\"protectionism\".\n\nIf the problem is \"protectionism\" then \"free trade principles\" becomes an obvious solution.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "OMGJJ",
                            "body": "Off topic - but just wondering if anyone here has read both Sam King's thesis and the book (Imperialism and the Development Myth) that he turned his thesis into? Are there any major differences between the two, and if so which one should be studied first?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "nearlyoctober",
                                    "body": "In his own words in an email from a few years back:\n\n> You've probably worked out already the book is largely similar to the PHD. The main changes as I remember are re-written introduction and conclusions. Re-written and re-arranged chapters outlining the key concepts of monopoly capital as written by Lenin and then my own. These are not changed, just better organised, but you seem to have well understood the original formulations anyway. Update and expansion of the China section to a few chapters (basically adding new data from the Trade War as it progressed). Substantially shortening the 'literature review' critiques of other authors. **For example the section on Zak Cope that your comrade quoted in the Reddit discussion may have been cut or shortened.** Though I left a fairly thorough critique of Smith.\n\nEmphasis mine. [The Reddit discussion he's referring to](https://old.reddit.com/r/communism/comments/imqsvv/sam_king_lenin_monopoly_and_imperialism_a_brief/).",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "OMGJJ",
                                            "body": "Thanks!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "_dollsteak_",
                            "body": "This was really helpful, thank you!",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Feels like a gut punch seeing this. Currently halfway through Divided World Divided Class and cannot wrap my head around how he has done a complete 180. Very disappointing.",
            "score": 9,
            "replies": []
        },
        {
            "author": "vimingok",
            "body": "A symptom of the fact that class, exploitation, imperialism etc are not revolutionary ideas in themselves, because understanding them does not require \\*any\\* sort of revolutionary consciousness. The commanding heights of capitalism, and probably most of the middle and lower parts as well, already understand those things well enough.\n\nSearching through the relevant pdfs, he criticises both Zionism and Irish Protestantism as thoroughly as one could wish. Going mad is unlikely to be this boring and consistent. I can't access the pdf (upload to libgen anyone...?) but the gist is: the rules based order and globalism (versus multipolar rogue capitalism) is the best way to end racial capitalism and labour arbitrage. So that's a bridge to his earlier work in a sense. I guess Mossad might have found his porn folder or something but this whole line of thinking is pointless.\n\nYou can find more than enough problems in his earlier work itself which could, and now has, lead to this. Of course those problems are also shared by the vast majority of Marxists who haven't disavowed Marxism yet. That is more depressing, and interesting, and hopeful, than trying to sniff out soulless careerist CIA Zionist rich kid vibes.\n\nSomething was going on even in his earlier Palgrave/Oxford stuff. He equates famine deaths under Stalin to British colonialism. The latter dwarfs the former by 500x at least once you count persistent undernourishment and its consequences and not merely \"famine\" which is above average undernourishment during a specific period.\n\nHe copy/pastes Utsa and Prabhat Patnaik on colonial drain and settler-colonial absorption of European unemployment. Yet for some reason consistently omitting a major point of their analysis which is the \\*absolute dependence\\* of temperate Europe on tropical resources not producible at all or insufficiently in Europe. It's not just about cheap resources but resources that cannot be produced at all. And unless their acquisition within the domain of capitalist production is costless, capitalism won't happen, both then and now.\n\nAlso doesn't mention that the Columbian Exchange caused pandemics and subsequent depopulation and weakening of indigenous societies which made the actual conquest and genocide following it possible. Both of those things rule out an innate \"power\" of capitalism that Europe acquired then used to dominate and plunder the world (and eventually redistributed to the proletariat back home). Opposition to colonial \"plunder\" of resources and settlerism as the basis of hitherto existing capitalism is not necessarily opposition to capitalism, let alone the transhistorical structural logic of CAPITAL aka the rule of alienated wealth over society.",
            "score": 8,
            "replies": [
                {
                    "author": "vimingok",
                    "body": "The first sentence of Cope's 'The Wealth of (some) nations':\n\n>The traditional Marxist view that capitalism thrives upon the imposition of repressive conditions on workers is correct, but historical capitalism (that is, ‘actually existing capitalism’) has largely displaced these conditions away from the core countries of the international capitalist economy and onto the subject peoples of its colonial and neo-colonial ‘periphery’.\n\nIf this were true the wealth of social problems in the first world wouldn't exist. If capitalism could simply displace its contradictions there would have been no war, Kautsky would have been right etc. The reverse is true, capitalism was able to operate and develop despite being untenable as a social system due to a historically unprecedented conjuncture of irresolvable internal and external contradictions. \\*It survived precisely because it did not, and could not, export those contradictions wholesale to the third world.\\* It was parasitic upon pre-capitalist modes of production which it changed and modified to its purposes, or introduced entirely new forms of non-capitalist exploitation (slavery), in the process rendering them likewise unsustainable and binding all people to a single global system in terminal crisis which can only be resolved by irreversibly breaking with the rule of Capital itself, and not just 'capitalism'.\n\nThose people in the first world who are net beneficiaries of imperialism are also, by definition, personifications of capital. Slave owners, not slaves. It doesn't matter whether they have to work for a living or just sip martinis all day. Just like it didn't matter that feudal lords had to fight and die in wars and sometimes even perform manual labour. Those first worlders that are exploited do not need to earn the same income as \\[commodified image of gritty tear-jerking third world poverty\\] in order to be exploited by capital. And distinguishing beneficiaries of exploitation from its victims isn't hard, even in a first world context. You don't need to understand an elephant's anatomy to know it's an elephant.\n\n'Divided world divided class':\n\n>Marx argues that under socialism, the principle of distribution is not one of precisely equal distribution of the social product to all citizens but, rather, “from each according to her abilities, to each according to her work performed.” As such, those who contribute more value to society through their labour may expect to receive more of the social product than those who contribute less ... by conceiving economics as a zero-sum game between haves and have-nots, strict egalitarianism as a kind of “theory of the production relations” (as opposed to the theory of the productive forces criticized by anti-imperialist Marxism) is opposed to historical materialism.\\* The central thrust of the latter situates class struggle within an economic system conditioned by, and in turn conditioning, the development of the productive forces. Where these are maintained at a low level, the predominance of small-scale and individual units of production must tend to engender social inequalities and class divisions that may only be combated through high levels of state coercion.\n\n>Nonetheless, socialism undoubtedly aims towards conditions of international equality. Indeed, enduring inequality between peoples has been correctly and forcefully denounced by socialist theoreticians and politicians as a sure sign of national oppression and national exploitation, just as enduring inequality within socialist nations has been understood as signaling a material basis for the restoration of capitalism.\n\n'Capital':\n\n>The relation of a portion of the surplus-value, of money-rent . . . to the land is in itself absurd and irrational; for the magnitudes which are here measured by one another are incommensurable - a particular use-value, a piece of land of so many and so many square feet, on the one hand, and value, especially surplus-value, on the other. This expresses in fact nothing more than that, under the given conditions, the ownership of so many square feet of land enables the landowner to wrest a certain quantity of unpaid labour, which the capital wallowing in these square feet, like a hog in potatoes, has realized. But prima facie the expression is the same as if one desired to speak of the relation of a five-pound note to the diameter of the earth.\n\n>However, the reconciliation of irrational forms in which certain economic relations appear and assert themselves in practice does not concern the active agents of these relations in their everyday life. And since they are accustomed to move about in such relations, they find nothing strange therein. A complete contradiction offers not the least mystery to them.\n\nThe fact is that even under Cope's generic interpretation of the socialist principle of distribution according to Marx (even though contradicted by other things said by Marx), anything more than marginal inequality would become impossible if applied consistently. The only way to get around that conclusion is to tacitly replace equality i.e substantive equality with \"the stablest, most efficiently managed inequality\". Which is, despite all pretensions to the contrary, nothing more than capital's self-criticism, a phenomenon as old as capital. \"The reconciliation of irrational forms\".\n\nIt's down to whether one understands capitalism primarily as the latest phase of class struggle, development of productive forces etc, or as the crisis of capital (=unequal involvement in the management of society) as it relates to the unsustainable way those things necessarily unfold within capitalism. Opposition to \"capitalism\" solely on the grounds of political action is going to \"betray\" itself sooner or later, and there is no evidence to the contrary.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "hysimon",
            "body": "I found this on the X. Manny has foreseen Cope's going rogue.\n\n[https://x.com/Huck1995/status/1823933497469182216](https://x.com/Huck1995/status/1823933497469182216)",
            "score": 7,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Well if people were waiting for Immanuel Ness's response, he appears to be a typical Dengist. Twitter is worse than I remember and all the Dengist \"content creators\" are feasting at the corpse. \n\nThe shame in all this is that Cope's work was actually useful, whereas Ness's work is typical academic filler (proudly endorsed by Richard Wolff). Since we're speculating, it's worth pointing out Ness has a stable academic job whereas Cope does not, unsurprising given the latter's work. I'll give JMP credit. He is also an insecure academic worker but his revisionism occured through actual practice. His work is pretty consistent, albeit not very good.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "ernst-thalman",
            "body": "https://cosmonautmag.com/2023/07/in-defense-of-unequal-exchange-critique-of-paul-cockshotts-first-worldist-ignorance/ \n\nhttps://unequalexchange.org/\n\nThis might be a good place to start re-evaluating DWDC.",
            "score": 8,
            "replies": [
                {
                    "author": "whentheseagullscry",
                    "body": "The first article is good but the complaints over measuring value transfer is pretty anti-marxist, granted I'm influenced by personally knowing the author and their own anti-marxist viewpoints. I think work like Zak Cope does ID a lot of broad truths that the American left ignores, but there's some difficulties in fully representing these truths in a Marxist framework.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ernst-thalman",
                            "body": "I’ve been looking at Ashlars contributions to cosmonaut somewhat optimistically so I’d be curious to hear more background on where he stands in the wider movement",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "t_dahlia",
            "body": "Aw man and I just picked up a second hand copy of \"...(Some) Nations\" for cheap the other day. I guess that's opened up a (very thin) slot in the \"economics\" area of my bookshelf.",
            "score": 3,
            "replies": []
        },
        {
            "author": "emokidmaoism",
            "body": "Its insane going from a rather decent marxist theorist to \"actually the nazis were socialist!\" the only explanation here is that this is a grift and he wants that libertarian think tank money",
            "score": 4,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "That's not the only explanation by far. Have you even read the thread?",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}