{
    "title": "What are some of the wildest things Chris Cutrone (the guru of the Platypus Affiliated Society) has said?",
    "author": "LeGranMeaulnes",
    "subreddit": "communism",
    "rank": 341,
    "score": 0,
    "upvote_ratio": 0.24,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/communism/comments/1fc1bza/what_are_some_of_the_wildest_things_chris_cutrone/",
    "id": "1fc1bza",
    "selftext": " g",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prickly_Cucumbers",
            "body": "they still exist? who even cares about them? i’m failing to see what of any value could possibly be gained from this.",
            "score": 8,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "Isn't Grover Furr associated with them?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Prickly_Cucumbers",
                            "body": "from what i can tell by an admittedly cursory search on the internet, he provided an [article](https://platypus1917.org/2012/04/01/learning-from-communist-movement/) to their “Platypus Review 45” in 2012.\n\n\nas well as speaking at a [panel](https://platypus1917.org/category/international-series/what-is-socialism/) held by their Berkeley chapter in 2018.\n\nsorry for the digression, but the description of the latter gives warning signs. for some reason they state that “in the neoliberal era, however, the division between reform and revolution has been blurred if not erased”. they invoke “SYRIZA, Podemos, Jeremy Corbyn, and Bernie Sanders” in the very next sentence. confusing.\n\nin fairness, they couch this idea with some doubt, alluding to the historical splits between social democracy and marxism-leninism, but i don’t know what could have possibly been going through their heads.\n\n\ni couldn’t find any further association between furr and platypus",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeGranMeaulnes",
                    "body": "Are they outdated?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LeGranMeaulnes",
                    "body": "I have a friend who may be falling into their rabbit hole. They scare me",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Ambitious-Humor-4831",
                            "body": "https://sublationmedia.com/historys-alternative-to-genocide/\n\nSend this to your friend. See if cutrone is appealing after he tells Palestinians to give up and that they've lost everything and can't do anything about it.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Fit_Needleworker9636",
                                    "body": ">Palestinian workers should have gone to the Israeli kibbutzim not for hostile reconnaissance but labor solidarity: to work alongside Israelis and others, not target them for killing, as before October 7.\n\nI appreciate how overtly out of touch with reality this is, since the Israelis were obviously never interested. Millions of Palestinians flooding into the kibbutz is what settlers have nightmares about and no Israeli political party has ever entertained this idea. Any Palestinian could tell you first hand that they have gotten essentially nothing in return for the PLO's attempts to capitulate to Israel, the author himself is unable to name anything tangible that they ever received from this state of affairs other than \"tens of thousands\" of conditional work permits (in proportion to the millions of other Palestinians who he expects to surrender unconditionally and gain nothing). As an exceptionally weak and petty imperialist power, Israel genuinely does not have the resources to integrate its colonial subjects into its domestic labor market. France objectively made far more concessions to the Algerians than Zionists ever made to Palestinians and had far more resources to work with yet they were still unable to achieve this. Israel cannot afford to incorporate Palestinians into imperialism and even the poorest kibbutzim will never tolerate being reduced to the same socioeconomic status as their Palestinian victims who they would never trade places with.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "urbaseddad",
                                    "body": "What a dogshit article. Even the style is shit ",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "HemploZeus",
                                            "body": "it's actually astonishing that people pay him money to write",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "paconinja",
                                                    "body": "he's a glowie too so he's making bank",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "HemploZeus",
                                                            "body": "shady and dangerous folks grow ever more powerful in the modern age",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "D00MRB00MR420",
            "body": "Listening to him and Varn together for 2 hours, you will feel the deepest nihilistic, pedantic, resigned left melancholia you will ever hear.",
            "score": 1,
            "replies": []
        }
    ]
}