{
    "title": "FACAM: Condemn the intensified intimidation of Maad Bachao Manch activists (India)",
    "author": "None",
    "subreddit": "communism",
    "rank": 331,
    "score": 10,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 2,
    "url": "https://redherald.org/2024/09/10/india-facam-condemn-the-intensified-intimidation-of-maad-bachao-manch-activists/",
    "id": "1fdypx6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": ">On 3rd September 2024, NIA conducted multiple raids in Narayanpur district of Chhattisgarh under the pretext of attempting to conspire to kill police parties and cease their weapons in March 2023. The NIA had named 35 adivasis as accused in this case and revealed that in further investigation they found names of multiple CPI(Maoist) supporters and workers.\n\n>They have slapped UAPA and charge-sheeted Lakma Korram, the leader of the Maad Bachao Manch as a Maoist and have declared Maad Bachao Manch a frontal organization of the Maoists, which is a democratic organization sitting on peaceful protest across Chhattisgarh demanding to stop building military camps in their villages and forests. No contact can be established with Maad Bachao Manch at this time. Due to this, there is suspicion of multiple arrests and raids on the adivasis protesting under the banner of Maad Bachao Manch. Thousands of Adivasis were practicing their democratic right to protest against the setting up of camps and fake encounters in Bastar by the CRPF and police forces, for a long time under the banner of Maad Bachao Manch. These raids and tagging of an organization peacefully protesting against state repression and corporate loot in Bastar is another way for the state to make inroads for corporates into Bastar and its untapped resources. The information blackout in Bastar is one of the biggest reasons that democratic organizations and Adivasis peacefully protesting for their rights to land and resources, and against militarization and corporatization can be thwarted and labeled as Maoist which makes it easier for the state to curb any resistance by the Adivasi peasants of Bastar.\n\n>The red-tagging of Maad Bachao Manch and other Adivasi peasants is a continuation of the state’s McCarthyian policies of equating anyone struggling for the democratic rights of the people as a Maoist and manufacturing a picture of any resistance by Adivasi peasants as an act of terrorism. Using draconian laws like UAPA the Indian state is trying to red tag and curb any act of resistance that it sees speaking against the genocidal war and corporate loot in Bastar, this is a practice that has been seen with the Jews in Germany where being a jew equated with communism and used as a way to curb dissent and further genocidal war by the state.",
            "score": 7,
            "replies": []
        }
    ]
}