{
    "title": "We Are Not Democrats: The Marxist Doctrine of Dictatorship against \"Modern Mythology\" | Counter Attack Journal",
    "author": "manulinrocks",
    "subreddit": "communism",
    "rank": 324,
    "score": 12,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.counterattackjournal.org/issues/vol_2/issue_1/we-are-not-democrats-the-marxist-doctrine-of-dictatorship-against-modern-mythology",
    "id": "1ff46q2",
    "selftext": "\"Which class will exercise state power is never determined by majority vote but by the material balance of organised forces. A favourable balance of such forces may or may not be ratified by the majority vote of either a universal or a class exclusive electoral body at a given time. Regardless, to see the result of the vote and not the balance of forces as the determining factor is to fall victim to democratic metaphysics in theory and to the violence of the counter-revolution in practice.\"",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": "https://www.counterattackjournal.org/issues/vol_2/issue_1/for-workers-defense-against-ethnic-violence-statement-of-counter-attack-editorial-committee-on-the-gaza-genocide-and-the-october-7th-massacre\n\nTrotskyists just can't help themselves. No coincidence you post in r/stupidpol and find racists and fascists to be the best company. Anyway there's no shortage of Trot parties so why does this journal exist?",
            "score": 29,
            "replies": [
                {
                    "author": "Particular-Hunter586",
                    "body": "> the spurious idea of a “collective responsibility” of the German people for the crimes of National Socialism was a hallmark of Stalinist opportunism which served to justify a criminal practice of ethnic cleansing in post war Eastern Europe\n\nImagine thinking that political issues in Germany post-WWII were caused by *too much* denazification. I have to laugh.\n\n(Also, calling October 7 a “blood sacrifice” is perhaps not a new kind of acute settler-chauvinism and racism, but it’s certainly a shocking new way of expressing it.)",
                    "score": 28,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "Holy fuck. The elimination of settler colonialism is ethnic cleansing now. New low for Trots ",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Globalcult",
                                    "body": "It's pretty common accross the \"left\" hardly a new low",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "That's why I said Trots",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fit_Needleworker9636",
                    "body": "Funnily enough, equating attacks on settlements with Nazi ethnic genocide is identical to the rhetorical arguments made by the Zionist entity's domestic fringe right. I wish at least one of these people had the guts to actually say this to the face of a Palestinian and not in the good company of other white settlers. Obviously no one is bold enough to apply this to a retrospective historical analysis of the Algerian liberation, either.\n\nWhat's interesting is that Zionist narratives about the \"religious\" or \"ethnic\" nature of the conflict are currently so pervasive yet all of this is going to be completely discarded in the garbage bin of history after these points are no longer relevant to upholding settlerism. The French settlers made all the exact same arguments for how they are \"native\" to Algeria, how they have a \"deep connection\" to the land, how they are defending themselves against \"islamism\" and \"ethnic violence\" etc. yet this is barely even remembered as it is all obviously objectively untrue and those people's grandchildren have no interest in defending these narratives now that their oppressor class interest no longer hinges on it.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "You don't get to avoid responding and self-promote",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "That article is such a good example of the way trots can be utopian. I mean that in a technical tense, not to be dismissive. There's no grappling with how the world actually works or real political strategy.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "The only thing worse than Trots are social fascists in the DSA. Please do not group my critique in with your reactionary garbage justified by how \"the world actually works.\"",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I'm disappointed in this sectarian response. Even beyond your lack of consideration of DSA as an arena of struggle. A majority of our highest elected body are anti-imperialist Marxists and the future of the org is uncertain and is going to be decided by its active members, the majority of whom are Marxists. Most importantly, the org is largely internally democratic and getting moreso every year. To write off working within an org in active flux feels ... like a lost opportunity.",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "secret_boyz",
                                            "body": "I have yet to meet a social-fascist that doesn’t love to abuse the word “sectarian” (or any similar words like dogmatic). It was especially silly in this case since in your previous comment you were being “sectarian” by referring to “trots” as “utopian.” But apparently calling out the DSA for its social fascism crosses the line in what is sectarianism and what isnt? On what basis is something “sectarian”? E: ironically the article that smokeup posted and its use of the term “ethnic-sectarian rackets” provides insight into why DSA members use the term sectarian to refer to anyone who call them out for their reactionary politics",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Fit_Needleworker9636",
                                                    "body": "\"Sectarian\" in this context obviously just means anything that swims against the tide of petty bourgeoisie politeness, but if you actually think about the accusation being directed at indigenous people here that they are \"sectarian\" in relation to their settler-oppressors in the literal meaning of the word it becomes utterly absurd. How many white French people have any interest in trading their French passport for an Algerian one, living in the same neighborhoods as the Algerian masses and being paid an average Algerian salary of around 2,802 euros annually? Obviously the answer is zero, French people aren't even interested in the prospect of living in Algeria as a privileged \"digital nomad\" with a first world income. The reason there are still settlers in South Africa is because they are still squatting on a disproportionate share of the country's wealth and resources but being reduced to equal socioeconomic status and living conditions as that of the Zulu or Xhosa masses is unthinkable to them and they will all vacate the country long before that happens. Attacking indigenous people for being unfairly \"sectarian\" and exclusionary towards the settlers who want nothing to do with them and will ditch the country for elsewhere in the imperial core the moment they are actually forced to live alongside their former colonial subjects as equals is the position of someone who, if not performing vulgar apologia for settler colonialism, is profoundly detached from reality. In this case it is obviously the former as they directly clarify that what they are complaining about is Hamas killing a small number of Zionist soldiers and reservists during the historic Al Aqsa Flood operation.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ambitious-Humor-4831",
                                            "body": "The dsa is not a leninist organization and so it's incapable of revolution. I don't care if it's internally democratic, is the party accountable to the masses? Also the dsa is objectively social fascist.",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "ernst-thalman",
                                            "body": "MUG member I presume",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}