{
    "title": "Is my rough analysis of a capitalistic \"cycle\" correct?",
    "author": "Ok-Imagination-3019",
    "subreddit": "communism",
    "rank": 250,
    "score": 0,
    "upvote_ratio": 0.3,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/communism/comments/1gl6e0g/is_my_rough_analysis_of_a_capitalistic_cycle/",
    "id": "1gl6e0g",
    "selftext": "From what I have gathered so far I realised that the capitalistic cycle (rise,plateu, fall, catastrophe) is sth that is doomed to repeat itself.\n\nImo the cycle works like this and is thus doomed to fail.\n\nIn capitalism the sole purpose of a company is growth. New markets, more sales, more money in the pockets of the Bourgeois. While the economy of  a society is able to grow, to gather new markets, bigger spheres of influence, new consumers, new products to throw at the people and is undisrupted in a sense, libertarian policies are allowed to endure (at least in the imperialistic core, at the same time \"these new markets\" and \"spheres of influence\" are stomped by the foot of imperialism.\n\nNow there is a point where no more growth is possible. There are no new markets to gain, at least not without open war against another strong power. There are no more new people to enslave. At least not profitable.\n\nNow what is the best option to first broaden the imperialistic sphere of influence and second anwser the question \"How could we still increase our productivity, how can we increase our profits without overflowing markets with already existing products?\"\n\nThe anwser is war. How can such a war be started? Fascism. Fascism arises when a capitalistic state is weakened.\n\nIn this case-> Overproduction. Fascism is the answer to how to create a \"stable\" capitalistic state in unstable times and how can we justify war and war is the anwser to the need of rising productivity and profits.\n\nAfter the next great war breaks out, million people are crushed, minorities killed, enslaved and robbed the winning imperialistic states can broaden their spheres of influences. The capital of the former states and the victims of the imperialistic winners gets concentrated into fewer and fewer Bourgeois. \n\nThe rebuilding of the economy controlled by fewer people. The ability to ascend to new markets and so on guarantee times of rising productivity and profit and the capitalistic hegemonoy is once again secured until overproduction, saturation of markets and expansion has once against reached its limits and it explodes once again.\n\nFascism is imperialism turned inwards.\n\nI know that this analysis is formulated roughly and it is probably at least discusable but I want to know what you think.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": "I have no idea where you derived this theory. The capitalist cycle refers to the relation between the rate and mass of profit and a collapse of the latter as a cleansing of the former through the destruction of value. It has nothing to do with \"libertarian\" or \"fascist\" politics except that these loosely correlate with periods of crisis in the past (and not with others).  \n\nI'm not actually sure what \"libertarian\" politics are and your theory of fascism makes no sense. If the primary issue is the conquest of new markets, why would this necessitate fascism turning \"inwards?\" Capitalist states are perfectly capable of conducting war without fascism and there is no contradiction between freedom at home and genocide abroad (except for the moral one) that demands immediate negation. New markets are an important aspect of crisis but only one of many (destruction of value can just as easily take place through austerity) and the rise and fall of hegemonic nation-states is an entirely separate issue (I don't know where this \"world systems theory\" poison came from that's suddenly popular, it's surely not an explosion of people reading thousands of pages spread across the volumes of *The Modern World-System*). The concentration of capital is a necessary consequence but you lack a basic causal mechanism (since the absorption through conquest is only a minor aspect of capital concentration).\n\nI'm not asking rhetorically, this is a very complex theory that accounts for politics, economics, international relations, and a theory of crisis and monopoly. Where did it come from? I like to stay on top of the system of \"content creation\" as it filters into \"left\" common sense.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Phallusrugulosus",
            "body": "The current upsurge of fascism in the u.$. isn't some plot by the big/multinational bourgeoisie, and is likely something they'd rather avoid. They'd prefer to deal with their falling rate of profit by cutting costs and continuing business as usual as long as it's feasible to them, but the \"problem\" is where some of those costs get cut: in wages, benefits, and higher-paid positions. In other words, the status of the labor aristocracy is a cost, and they're getting cut. Fascism is a response to their declassing, because while they can correctly identify their problems, their interests are still too bound up with capital for them to correctly identify it and its inherent logic as the source of those problems. Trump's specific fascist policy, which claims to be isolationist, also speaks to the interests of the petite and [middle bourgeoisie](https://archive.ph/w0j9w), who need protection against the big bourgeoisie, and especially against foreign capital.",
            "score": 8,
            "replies": []
        }
    ]
}