{
    "title": "The Australian MLs",
    "author": "Dirt-surfer",
    "subreddit": "communism",
    "rank": 249,
    "score": 1,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/communism/comments/1glpalw/the_australian_mls/",
    "id": "1glpalw",
    "selftext": "The CPA, ACP, and CPA-ML, all self describe themself as ML parties.\n\nThe CPA generally accepts market socialism, and has been accused of being Labor shills, the ACP is internally undemocratic (so ive heard them been accused of) and do many soup kitchens, and the cpaml is an underground org mainly.\n\nThe ACP and CPA have past beef which lead to the ACP's creation, but the two generally cooperate with the cpaml (im unsure about each other).\n\nWhat I dont know is whether these parties, all of which have their own CC, general programs, etc, are actually ML parties. Does/can the CPA change their stances, or is the party just an australian cpusa, a radical liberal org. Is the ACP just a quirky CPA? Is the cpaml actually doing anything, united and coherent?\n\nI ask because there are many folks in ALL 3 that do good work. What is stopping these supposedly ML parties from merging? Stubborn individualism? Dogmatic sectarianism? Severe revisionism? Short sighted 'careerism'?\n\nTo me it feels like the cpa is stuck in social democracy trying to support AES, the acp is stuck doing charity since thats their signature thing that the cpa-acp beef centered around, and the cpaml is stuck being careful trying to protect its members.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": ">Does/can the CPA change their stances, or is the party just an australian cpusa, a radical liberal org. Is the ACP just a quirky CPA? Is the cpaml actually doing anything, united and coherent?\n\nIf you can't answer which of these (if any) authentically represent Marxism-Leninism, then you either need to spend more time vetting each of their stances and programs, or (more likely) spend more trying to actually grasp Marxism-Leninism and what it is, rather than taking it at name value.  \n\nThe dialectical materialist method says that you should trace each of these parties back to their point of origin to understand how and where and when they came into being and why, and then trace their existence through history to understand what the formation in the present is and actually represents. \n\n>I ask because there are many folks in ALL 3 that do good work\n\nThis would be a very poor understanding of Marxism-Leninism and anti-revisionism.  If three different parties calling themselves communist have three different programs and outlooks, then *at least* two of them are necessarily incorrect, revisionist, and thus doing bad work, and are enemies of communism, regardless of how nice they are or whether they do 'good work' by liberal standards.\n\n>To me it feels like the cpa is stuck in social democracy trying to support AES, the acp is stuck doing charity since thats their signature thing that the cpa-acp beef centered around, and the cpaml is stuck being careful trying to protect its members.\n\nEven from this description alone, it's not hard to see which one might actually have some potential to the authentic claim of being the actual communist party, and be the one worth investigating, but since it doesn't spring out at you, this might be a sign that you aren't actually ready to join an organization and should go back to study until you understand Marxism-Leninism more correctly.",
            "score": 15,
            "replies": [
                {
                    "author": "Dirt-surfer",
                    "body": "I am supporting the cpa-ml currently, however I was looking for more information on the other two due to a lack of information beyond understandably vague and generic programs to get a gauge on their rank n file.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xeder6",
            "body": "How popular are any of these parties among Australian workers? \nAustralia is quite an important country for international communist movement (it takes up an entire continent), but it seems to me (and I could be wrong) that the population in general is leaning towards right-wing politics. Even if all these communist parties combine their efforts, it'll still be a drop in the ocean of Australian politics.",
            "score": 1,
            "replies": [
                {
                    "author": "Dirt-surfer",
                    "body": "That is very true. No party is really big or overly influential, hence why i hope for a merge of sorts to better centralise current MLs and more easily follow one line and grow one party\n\nAussies are 100% right leaning, though not as bad as the US. Atm...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dodedliper",
                            "body": "Within 30 days of you writing that reply, it’s gotten worse",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}