{
    "title": "Do you have any good book recommendations for Communist China?",
    "author": "Mints1000",
    "subreddit": "communism",
    "rank": 238,
    "score": 39,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/communism/comments/1gq9mgv/do_you_have_any_good_book_recommendations_for/",
    "id": "1gq9mgv",
    "selftext": "I’ve been learning about China under Mao Zedong at college, however after looking at different sources I’ve found a lot of information is omitted from my textbooks, and some of the things I’ve been taught are false or from an incredibly biased perspective. Do you know any good books that look at Mao’s rule more objectively, focusing on the positives as well as the negatives, and the impact he had on China today?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Karsa_1312",
            "body": "You should watch the documentaries “How Yukong moved the mountains”. It’s 12 different documentaries filmed in the 70’s in China. Very interesting and shows you how the society and the production was organized collectively after the cultural revolution.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Particular-Hunter586",
            "body": "Seconding the recommendation of *Fanshen*, as well as *Prisoners of Liberation* by Rickett & Rickett. From a less narrative and more analytical perspective, *From Victory to Defeat* by Pao-yu Ching gives a lot of insight on capitalist counterreformation. Also, *Hundred Days War: The Cultural Revolution at Tsinghua University* is well-regarded, though I haven't read it.",
            "score": 13,
            "replies": []
        },
        {
            "author": "turning_the_wheels",
            "body": "*Fanshen* and later *Shenfan* by William Hinton",
            "score": 9,
            "replies": []
        },
        {
            "author": "GonzaloThought",
            "body": "Not exclusive to China, but Foreign Languages Press (Paris) has a number of newer books out in their Tales From the Front collection about \"life in ___\" including some from Hinton and others. Not all of them are about China though.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": "https://bannedthought.net/China/MaoEra/index.htm",
            "score": 10,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "> A friend of this website who located the above volumes notes that the geographical scope of the work is from Ottoman Turkey to the Far East. And he adds: “There is no doubt that this book represents to a great extent many views at the end of the Stalinist era. I think that in addition to the historical value of this book, what is more valuable is how the Soviet Union viewed Tsarist Russia’s role in history at that time. After careful study and comparison, I found that the book does contain a large number of passages that try to downplay or even beautify Tsarist Russia’s aggression when it comes to Persia, Ottoman, Qing China, Mongolia, etc. The book even states that although Tsarist Russia’s aggression in some areas was subjectively bad, it objectively promoted historical progress, etc. In addition, approaching Lenin’s era, the book had to condemn and point out a large number of aggressive activities by Tsarist Russia. Despite this, the book repeatedly implies that Tsarist Russia’s activities are ‘more popular with locals’ and ‘less harmful’... In addition, the concept of ‘China’ is simply equated with ‘the dynasty established by the Han people and ruling the main part of China’, which is also a major problem in the book. In this case, it is easy to draw a conclusion close to Han chauvinism - ‘Only Han-oriented nations and things are Chinese.’ In this way, the unique characteristics of China’s ethnic minorities are obliterated. In any case, there are still too few works that reflect the systematic discussion of history during the Stalin era. Although this book has many problems (objectively reflecting the expansion of Great Russian nationalism during the Stalin era), it is still of good reference value.”\n\nThis isn't the first time I've seen this website do anti-Stalinism. Where does this anti-Stalinist strand of \"Maoism\" come from?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DashtheRed",
                            "body": "I know it was a trend in French Maoism in the 60's (pro-Lenin, anti-Stalin, pro-Mao), but I'm not familiar enough with the people behind bannedthought to know if that is where they got it from.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bolchebeat",
            "body": "This website is mainly in Spanish, but in this page you'll find a number of books in English about China: [https://real-com.org/biblioteca/](https://real-com.org/biblioteca/)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Interesting-Context2",
            "body": "“Coalitions of the Weak” by Victor Shih, I love this book, it explains a lot things",
            "score": 1,
            "replies": []
        }
    ]
}