{
    "title": "Mandel",
    "author": "Civil-Nectarine1630",
    "subreddit": "communism",
    "rank": 205,
    "score": 1,
    "upvote_ratio": 0.54,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/communism/comments/1h2y6yi/mandel/",
    "id": "1h2y6yi",
    "selftext": "I read a work of Ernesto Mandel where he support socialista pluripartitism. What do you think about?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Do you mean a variation of multi party system/competition under socialism/DOP?",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Civil-Nectarine1630",
                    "body": "In an other works, he mention Trotsky about the necessity of exclude bourgheoise parties. I think he support a multiparty system between socialist parties. I'll give you the part of his work that I mentioned.\n\"Nor is it true that the need for democracy of producers/consumers, that is, the need to extend human rights and freedom to the economic sphere, can in any way conflict with the unrestricted freedom of the press. The economic freedom of producers to gain control over their lives, their working and living conditions, does not depend only on the suppression of private ownership of the (large) means of production and exchange. It implies not only their emancipation from the domination of market laws and the profit motive, from the demands of capital accumulation, from any set of \"laws\" imposed on them against their will. It also depends on their real right and power to escape the alternative \"either state despotism or market despotism\". It depends on their ability to decide freely, collectively and consciously what to produce, how to produce and how to distribute at least a significant part of current production. But the mass of producers/consumers is not completely homogeneous in its interests, nor in its consciousness, in the ways in which it understands these interests. So differences of opinion on priorities and therefore on key decisions are inevitable. If multi-party and multi-platform democracy and freedom of the press are in any way limited, sectors of the working class, not of the residual capitalist class, are limited in their economic freedom as producers/consumers. Economic freedom at the macroeconomic and macrosocial levels implies the possibility for workers to choose between alternative proposals for economic development and alternative and internally coherent models of development plans. This cannot be achieved without the most complete freedom of discussion and of the press.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElliotNess",
            "body": "I think it's great that you're reading.",
            "score": -1,
            "replies": [
                {
                    "author": "Civil-Nectarine1630",
                    "body": "What do you want to say? I read a lot",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}