{
    "title": "Tiananmen square and the cia",
    "author": "ungratefulcreator30",
    "subreddit": "communism",
    "rank": 111,
    "score": 32,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/communism/comments/1i1medk/tiananmen_square_and_the_cia/",
    "id": "1i1medk",
    "selftext": "Who has those cia documents litterally stating that the \"Tiananmen square massacre\" of 1989 was legit underwhelming and that most of the stuff we hear in America is false? \nI remember seeing it like 2 years back and can't find it",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "liewchi_wu888",
            "body": "What you are thinking of is not CIA documents, per se, but Wikileak cables from certain diplomats which more or less confirms the Chinese numbers or hundreds of death rather than the Western numbers of hundred of thousands of deaths, with no death occuring within the premises of Tian'anmen itself.\n\n[https://wikileaks.org/plusd/cables/89BEIJING18828\\_a.html](https://wikileaks.org/plusd/cables/89BEIJING18828_a.html)\n\n[https://www.counterpunch.org/2017/06/06/tiananmen-the-empires-big-lie/](https://www.counterpunch.org/2017/06/06/tiananmen-the-empires-big-lie/)\n\n[https://www.telegraph.co.uk/news/worldnews/wikileaks/8555142/Wikileaks-no-bloodshed-inside-Tiananmen-Square-cables-claim.html](https://www.telegraph.co.uk/news/worldnews/wikileaks/8555142/Wikileaks-no-bloodshed-inside-Tiananmen-Square-cables-claim.html)\n\nHowever, before we start praising the sagacity of the oriental wisdom of Deng Xiaoping and the leadership of the CPC, it should be remembered that even the numbers that the Chinese government insists, 300 is still a pretty high body count. Needless to say, the propaganda of the west, of Tian'anmen being an unfanthomably large number is, of course, the sort of atrocity propaganda that we hear from places that are on our \"naughty list\", and some of the more idealistic members of three letters agency may have well believed in all the humbug about how liberalization necessarily means \"democratization\", or at least having a government totally under the heels of American imperialism.\n\nI think Li Minqi's retrospective analysis of the events of June Fourth (he was part of the student movement, but was jailed, read Marx, Engels, Lenin, and Mao, and came out pro-Mao) is the most interesting:\n\n[http://johnshaplin.blogspot.com/2009/05/tiananmen-square-by-minqui-li.html](http://johnshaplin.blogspot.com/2009/05/tiananmen-square-by-minqui-li.html)\n\n[http://digamo.free.fr/minqili08.pdf](http://digamo.free.fr/minqili08.pdf) (most pertinent is the preface, \"My 1989\")\n\nThere was essentially two protests- the student protest, which was petit bourgeois/bourgeois in nature, and wanted a combination of more \"democracy\", i.e. more liberalization of the economy, more personal freedoms in terms of dress and consumer products, etc., which was joined by a more working class movement, which was not so much political, as it was about the increasing hardship due to the Dengist shock therapy, such as getting rid of price caps and causing the price of foodstuff in the cities to rise. While Beijing was one of the most notable, it was not the only \"rebellion\" of this kind. Nevertheless, as Lenin teaches us, the working class alone cannot achieve the clarity that can only come from being organized by the party of the Working Class, the Communist Party. So, while there was potential for there to be an overtly political character to the movement had it been led by a Communist Party, it was mostly an expression of widespread discontent that came to be defined primarily by the \"student leaders\" who were as indifferent to the suffering of the working class as Deng and his revisionist capitalist roaders were. Hence why many of the \"dissidents\" who fled to the west, or else made their money in the west, often turn to become right wing stooges for AmeriKKKa.",
            "score": 47,
            "replies": [
                {
                    "author": "Careless_Owl_8877",
                    "body": "so glad i can save replies on this app",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "ungratefulcreator30",
                    "body": "Ahhh I was mistaken then haha thank you brother",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Management_6387",
            "body": "What did American hear then?\nIMO if a Chinese claiming themselves \"communist\" while supporting the what gov had done in 1989, they are not communist. Simple as that.\nWe see the gov as revisionist when Deng took the power",
            "score": -6,
            "replies": []
        }
    ]
}