{
    "title": "21st Century Red Scare?",
    "author": "Alessandr099",
    "subreddit": "communism",
    "rank": 110,
    "score": 71,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/communism/comments/1i1ywlo/21st_century_red_scare/",
    "id": "1i1ywlo",
    "selftext": "Hello all! With the TikTok ban developing, a large amount of users are swarming to Rednote. Some, with the intention of giving the finger to the American government or just to maintain a source of  media free from American propaganda and corporate interests. A lot of Americans are embracing Chinese culture and going as far as learning mandarin to interact more with the existing culture on their platform. The Meta stocks have dropped significantly as users are not returning to Instagram and Facebook. \n\nI’m hoping to have a discussion about how this will be perceived and recommunicated by anticommunist entities like much of American media. Are we likely to have another red scare? How would it look differently from what we’ve seen before? President-elect Turmp has already sowed seeds regarding the “enemy within”, among other rhetoric. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "IllService1335",
            "body": "Red scare and the cold war have never stopped.",
            "score": 54,
            "replies": []
        },
        {
            "author": "miquiliztlii",
            "body": "I don't really know what's going to happen next. I think that things overall in our society cannot possibly continue the way they are, but as things get worse the ruling class is just going to dig in it's teeth deeper. And only time will tell what that entails for us \n\nI do think that for now, it's good that Americans are joining Rednote & trying to have discussions with Chinese people firsthand. I do think it's kinda dumb it took Americans joining Rednote en masse to realize Chinese people aren't the enemy but it is what it is I guess ",
            "score": 30,
            "replies": []
        },
        {
            "author": "No-Eye1302",
            "body": "As a Chinese, I am surprised, but we welcome everyone to come. However, please note that the censorship system is quite strict. You can ask me about this. I remember that some American soldiers even posted the use of weapons on Xiaohongshu.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Comosellamark",
            "body": "We’ve already been in a red scare. Remember BLM? Abolish the Police? How everyone was scared of “riots”? How everyone hated antifa? Or what about the fact Latinos are still a scapegoat in America?",
            "score": 14,
            "replies": [
                {
                    "author": "ollie_soma",
                    "body": "I don’t think you know what the red scare is..",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Comosellamark",
                            "body": "It’s just a witch-hunt by another name",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ollie_soma",
                                    "body": "No pal it’s really not",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "RadicalPenguin1949",
                    "body": "This is a type of metaphysical thinking that permeates \"communist\" spaces that is really counter productive, which conflates mass action with multiplied individual action: \"it would be great if a lot of people / everyone were to do X, so I'm going to do X as an individual and tell others to do the same!\". You see this error everywhere:\n- If everyone became a vegetarian, factory farming would go away so I'm going to become a vegetarian\n- If everyone stopped using Twitter, Musk would go broke so I'm gonna stop using Twitter\n- If everyone were a communist, we could build socialism so I'm gonna be a communist\n- If everyone went on strike we could do a revolution, so I'm gonna be strike ready and tell others to support mass strikes!\n\n\n\nThere is next to nothing in common between  mass action/boycotting and individual action/boycotting. Mass action doesn't occur when a bunch of individuals just volunteer to independently, mass action occurs as a result of deep organizing work and conscious strategy informed by practice. If you want everyone to abandon twitter (which isn't even a very useful revolutionary strategy but let's roll with it), you need to actually use creative effort to organize people on mass to do so, not just hope it happens or act as an individual.\n\n\nAt best, this sort of thinking is an honest error that mistakes multiplied individual action for mass action. At worst, this is a way to _avoid_ revolutionary work by substituting individual consumerism for revolutionary praxis.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "Trap_Ritual",
                            "body": "Ok, I totally get it. I guess I was just brainstorming and thinking of tiny ways to “chip away” at the ruling class. For example, if one boycott by the proletariat leads to a factory shutting down so that it could somehow become a co-op run by workers, that is, in my opinion, a small victory and taking a step towards more revolutionary tactics.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "RadicalPenguin1949",
                                    "body": "It's great that you're actively thinking of ways to fight. The process of working through problems is core to building communism, because a lot of the problems we need to solve haven't been solved yet. Fortunately, a lot of problems _have_ been solved, or at least have very good work done towards thinking through them.\n\n\nHere's an exercise: consider how capitalism can be most effectively chipped away at, bit by bit. How would this strategy work? How might it fail? Is it feasible? Optimal? Really think it through and write down your thoughts. Then, read [this article](https://revolutionaryinitiative.wordpress.com/2021/11/01/revolution-has-vanished-replaced-with-fantasies-of-dual-power-counterpower-base-areas-abolition-and-other-bottom-up-bourgeois-democratic-illusions/) on the topic, and see if you came to the same or different conclusions and why.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Trap_Ritual",
                                            "body": "I totally understand, great article btw, I just finished reading it. I was super into all of this stuff years ago, then I moved out of USA and was experiencing a different life due to free healthcare, free education, easy-to-get jobs, etc. cheaper living cost. I returned to the U.S. last year and, seeing all of the horrible things literally going wrong and falling apart day by day, I've returned to my socialist/communist studies and I am trying to sort out in my head how the working class can really take power at some point. We are at a huge crossroads right now. I feel many in America have become very disillusioned with both sides of the \"allowed\" political spectrum and are actively seeking out other options. I'm going back and reading the manifesto, capital I & II & state and revolution. What I was thinking of specifically was not \"handing out food and setting up urban gardens etc.\" I was more talking about dismantling the big tech giants piece by piece, as I feel that now, with Musk, Zuckerberg & Bezos basically running American politics and making HUGE decisions, a major revolutionary 'sector' in the fight to demolish the state and set up a dictatorship of the proletariat, is online. My question is this: How can revolutionary communist brothers and sisters fight online against capitalism? This will hit them the hardest, look at the amount of money that they get via websites and social media etc. When their online supremacy is toppled, then the revolution can begin in the streets.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "RadicalPenguin1949",
                                                    "body": "Revolutionary communist brothers and sisters can't fight online against capitalism. We're not going to tweet, DDoS, or hack our way to socialism. We need to organize real people in real life. Online \"organizing\" is just a way to avoid actually connecting with the masses. Go talk to 20 proletarians (more than just pleasantries) before posting online about communism again, and see how it changes you.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Trap_Ritual",
                                                                    "body": "I argue that if Marx or Lenin were alive today, the priority of revolutionary action towards a socialist USA (for example) would be to destroy the big tech/online powers that be. There are no real streets or face-to-face meetings nowadays like there once were.... Everyone is glued to their devices and c\\*v1d made it even worse. We need to drastically shift the masses (online) to thinking about the best interests of the working class. Our society today is like 90% online, gaming, social media, apps etc. these need to be changed and reconstructed in order to motivate the working class to actually leave their homes, take to the streets and take back what is theirs.",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShockerBoyV",
            "body": "What is needed is a l world wide civil war ￼against the government’s of this planet ￼as we transferred into a communistic society with a single world government operated through the United Nations, No longer separated by nation.\n\nFor far too long we’ve been divided by country, by religion, by ethnicity, by politics, by gender, by sexuality, by language, by class… Yet here, right now in this modern world with the internet we are more connected than ever before. And never more divided than ever before. \n\nYou wanna be mad at somebody, be mad at the powerful and hyper wealthy predator psychopaths who think they are elite and keep trying to divide us so they remain in power and stack their bank accounts… We are your brothers and sisters, we are all of one blood. We’ve been so conditioned to be at odds with one another, to focus on our differences and not our commonality. It is not each other we should be fighting, it is the people who continuously try to pit us against each other as they manipulate the system for their financial benefit and control. WE THE PEOPLE of the world are not each other’s enemies! WE STAND TOGETHER! We are the human race. NO LONGER DIVIDED.",
            "score": -3,
            "replies": []
        }
    ]
}