{
    "title": "Chinese fan groups condemn Yosuke's Japanese VA",
    "author": "Witty-Ad5429",
    "subreddit": "PERSoNA",
    "rank": 6,
    "score": 358,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 87,
    "url": "https://www.reddit.com/r/PERSoNA/comments/1je331n/chinese_fan_groups_condemn_yosukes_japanese_va/",
    "id": "1je331n",
    "selftext": "Not long ago, Yosuke's Japanese VA Showtaro Morikubo, attracted hatred from the Chinese for participating in a reading play \"命がけの証言\" related to the China’s Uyghur detention camps. At present, Chinese games such as Genshin Impact and Arknights have decided to replace the characters he is responsible for. At the same time, the Chinese Persona community also strongly requested Atlus to replace Yosuke's Japanese VA in the future Persona 4 Remake and Persona 5: The Phantom X. Considering that Persona 5: The Phantom X is a game that Atlus cooperated with the Chinese production team, maybe this is possible? What do you think of this uproar?",
    "comments": [
        {
            "author": "ulape00",
            "body": "I would expect him to be replaced on P5X (which after all is developed by a Chinese studio) but not in any P4G remake.  \n\nFirstly, any P4 x P5X crossover is likely to happen fairly soon, but a P4 remake is likely years away.  Not to mention there would be uproar in Japan if he were to be removed by a *Japanese* company, given the status JP VAs have in that country.\n\nIf he's being wholesale replaced in Chinese games, it's a good chance that that has come down from the government, so the P5X developers wouldn't have a choice.  This is the country that prohibits mentioning Winnie-the-Pooh, because Xi got that as a nickname.\n\nPerhaps it would even be split and he'd be redubbed for the CN P5X server, but retained for the KR and TW ones.",
            "score": 230,
            "replies": [
                {
                    "author": "Adam_The_Actor",
                    "body": "Indeed Persona 5X has a completely different voice cast for the Chinese than it does for the Japanese but given it is being worked on by a Chinese Developer, there is little to no chance he will be seen in 5X. As for overseas developers I don't see this happening at all because it would be promoting condemnation against those who depict any such real events and it'd be a global issue much like Blizzard when they cowardly banned the HeartStone player for wishing for the freedom of Hong Kong. Outside of that though I don't see anything happening. \n\nTypically though when the Chinese player base throw a tantrum they will do so on Weibo there social media platform but it doesn't really seem to have happened there nor has Persona 4 Golden been review bombed on steam which makes me think his removal from Genshin likely was a request from higher up. Naturally Genshin is a chinese developer as well so I can understand why it'd happen in that particular game.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "Takamurarules",
                    "body": "Wait, I need context on the Winne The Pooh one lol",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Agitated_Spell",
                            "body": "There was a joke going on that said Xi Jingping looks a lot like Winnie the Pooh. The man malded over it and banned Winnie the Pooh in China, I believe?",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "RMarques",
                                    "body": "Winnie the Pooh the character isn't banned, just the memes.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "WillTheExplosiveFish",
                                            "body": "No he’s banned on everything in China, I believe.  A while back I saw a leak for the Disney game Kingdom Hearts III showcasing 100 Acre Wood (when it was still in development) and any part that was supposed to show Winnie the Pooh was blocked out in a white blur.  The whole situation is really weird.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Morghi7752",
                            "body": "Opposite to what u/Agitated_Spell said, Winnie is NOT banned in China, the claim was started by Kingdom Hearts 3 since it was supposedly \"banned\" in China due to Winnie's memes, but the game was sold anyways on stores like Chinese PSN, where it's listed as [CHINESE/Korean version](https://youtu.be/YYbafJinwp0?t=161) ([this infamous image](https://imgur.com/this-is-real-screenshot-from-chinese-version-of-kingdom-hearts-iii-5H8Wbf5) is mistakenly considered legit, but I admit it's hilarious)! The fact about Xi Jingping was pissed about the memes is true though, lol.\n\nAnyways Kim Il Sung did WORSE in North Korea when he declaired JAMES FREAKING BOND a STATE FREAKING ENEMY because he watched Die Another Day 😂😂😂😂😂 (he 100% did it because the North Koreans were the bad guys, but I love to think that he hated the film because it was SO BAD 😂)",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dgshockwave",
                    "body": "I can see them getting a new guy for the CN servers, while keeping the OG for everyone else. It wouldn't be the first time a game has a completely different VA for a character in a game's CN version",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CringeExperienceReq",
            "body": ">persona 4 is about uncovering truths\n\n>china tries to cover up truth about uyghur turks\n\nmfw",
            "score": 346,
            "replies": [
                {
                    "author": "New-Doctor9300",
                    "body": "Xi Jinping is Adachi???",
                    "score": 107,
                    "replies": []
                },
                {
                    "author": "redditmodloservirgin",
                    "body": "Unfathomably based comment",
                    "score": 43,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrashedWreck",
            "body": "Artists are free to pursue their art in anyway they want, no one should censor art because they disagree with the message.",
            "score": 291,
            "replies": [
                {
                    "author": "redditmodloservirgin",
                    "body": "There's no disagreeing about truth. The voice actor stated a fact and reality of China, which culturally they do not tolerate.",
                    "score": 90,
                    "replies": [
                        {
                            "author": "CrashedWreck",
                            "body": "This changes nothing in my original reply, like it or not, this is the world we live in, where people are led to believe that tragedies aren't real, thus there is disagreement over real and factual things.\n\nArt serves many purposes and one of them is spreading the message of what is happening in the world to the uninformed.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "YetAnotherJake",
                                    "body": "But it's no coincidence that those who hate and hide the truth and facts also hate and censor true and meaningful art",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "CrashedWreck",
                                            "body": "No shit",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "YetAnotherJake",
                                                    "body": "Therefore, \n\nA) Any \"open-minded\" arguments you make that concede facts into the realm of opinion in order to appeal to the censoring, lying side on the grounds that they shouldn't ban artists in general due to opinions will fall on deaf ears, and\n\nB) We should not cede facts into the realm of opinion, which\n\nC) definitely should change your original statement \n\nThink harder.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "CrashedWreck",
                                                            "body": "Nowhere in any of my comments have I conceded facts as just personal opinion. It is FACT that people disagree on events in history that have been proven to be true, e.g holocaust revisionism.\n\nIt doesn't mean I agree with these people, or think it's correct to question historians without an extended knowledge and academic background on said issue.\n\nWhat about my original statement should I change according to you ?\n\n\"Artists are free to pursue their art in anyway they want, no one should censor art because they disagree with the message.\"",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "redditmodloservirgin",
                                                                    "body": "The point he was trying to make is you can't logically disagree about a fact. That's why it's a fact. Chinese oppression of Uyghurs is a fact and not an opinion. This is the exact nonsense the CCP encourages.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "CrashedWreck",
                                                                            "body": "I'm not saying it's an opinion ffs, IM SAYING YOU CAN DISAGREE WITH THE SPREADING OF CERTAIN MESSAGES BE THEY TRUE OR FALSE. I'm saying that's WRONG, what's so confusing about this, I'm not a fucking ccp drone.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElecXeron20XX",
            "body": "I mean like Square Enix they keep Cloud's Japanese VA for future FF VII games despite his controversy.  Alongside Bandai Namco & Sunrise with Code Geass.",
            "score": 35,
            "replies": [
                {
                    "author": "Witty-Ad5429",
                    "body": "I hope so, cause I really like Yosuke's voice（；へ：） . But the difference is that P5X is a gacha game, made by a Chinese company together with Atlus, and it has been confirmed that it will collaboration with P3 characters. So there is a high possibility that P4 characters will also be included in the game... I am worried that Atlus will succumb to the profit.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ElecXeron20XX",
                            "body": "Btw it is \"Atlus\" I mean I think the most recent is Metaphor having I think More's Japanese VA changed due to also controversy.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Witty-Ad5429",
                                    "body": "Oh shoot, sorry for the typo, I was distracted by other things. Thanks for correcting me, I will correct it right away ( ﹡ˆoˆ﹡ )",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "supaikuakuma",
                    "body": "What did Clouds Japanese VA do?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Surfeydude",
                            "body": "Cheated on his wife for over 10 years and the woman he had the affair with didn’t even know he was married.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Blanche_Cyan",
                                    "body": "For whatever reason my mind jumped to Takahiro Sakuria and wpuld you believe it I hit the jackpot... also, didn't his wife take him back after he asked for forgiveness or something? It was a relatively good ending I guess...",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "ChunkyButtNutter",
                                    "body": "The sad thing is, I don't even know who you're talking about because there's been a good few VAs who admitted to cheating on their wives.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "EdelgardQueen",
                                            "body": "I mean, being married for nearly 20 year, which was not disclosed to the public, and having an extramarital affair for 10 years with the intention to marry, without her knowing that he was married, is not that common among VA and the general population.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ChunkyButtNutter",
                                                    "body": "You say that, but I can name three different Japanese male VAs who were involved in and confessed to having an extramarital affair with other (sometimes younger) women.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EdelgardQueen",
                                                            "body": "Good for you but I don't really follow VA, except I heard about it in that case.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ChunkyButtNutter",
                                                                    "body": "I'm just telling you what I know man, that's all there is to it. 🤷🏾‍♀️",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Turbulent_Creme_1489",
                    "body": "Wait what did my boy Cloud do? I think his JP Va is good please don't make me dislike him ;(",
                    "score": 0,
                    "replies": [
                        {
                            "author": "dogis32",
                            "body": "He cheated on various women for years, mainly his wife with his secretary, could be worse but still awful, great actor tho\nGoogle Takahiro Sakurai for more info",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RadiantAd768",
            "body": "If Atlus had any spine they'd double down. Makes me like him more lmao",
            "score": 213,
            "replies": [
                {
                    "author": "atelierjoh",
                    "body": "Unfortunately China is a huge market which is why many companies and celebrities (including outside of Japan) take great care in not pissing them off. The Chinese government isn’t exactly known for not being petty, and even their own people aren’t exempt from any punishments they feel is just.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "AnEggInDenial_",
                            "body": "China's huge market vs Japan's VA loyalism. VA's in Japan almost never get switched and if they do, its either if they died or if the person did something terrible like being caught with drugs or any other socially disrespected crime. \n\n\nI bet on Japan. I hope Atlus won't give in to China.",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "Evening-Initial3110",
                                    "body": "Worst case scenario they mute yosuke in p5x",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ortegism",
            "body": "Fuck them is what I think. Good on Morikubo for shedding light on a genocide that is happening in broad daylight and that nobody seems to care about. It's worth losing a gig over, if Atlus really wants to bend over for China.",
            "score": 232,
            "replies": [
                {
                    "author": "ytzfLZ",
                    "body": "If no one cares about it, is it possible that it is a lie, and China's enemies will take this opportunity to condemn China more frequently?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "SomnicGrave",
            "body": "God that's rough considering China is a market that companies find extremely difficult to ignore.   \n  \nI respect Morikubo for having empathy for people in need. \n\nAnd I'd prefer if Atlus stood their ground and protected Morkubo but at the end of the day, they are a company. Money is their bottom line.\n\nMindless patriots are such a pain in the ass.",
            "score": 39,
            "replies": [
                {
                    "author": "redditmodloservirgin",
                    "body": "The extent to which Chinese citizens do it is notable. It's brainwashing. People can be dumb about American patriotism but not to this same degree imo",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "HyruleSmash855",
                    "body": "Do video games really sell that well there? Everything I’ve ever heard is that the majority of sales are still in the United States or Japan for most games or Europe. As far as I’m aware most games don’t have a significant percentage of their sales coming from China because of how restrictive the country is, talking about single player not online multiplayer games",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TotalInstruction",
            "body": "\"How dare you criticize our ethnic cleansing!\"",
            "score": 58,
            "replies": []
        },
        {
            "author": "theangryepicbanana",
            "body": "that's pretty based tbh, good on him",
            "score": 66,
            "replies": []
        },
        {
            "author": "Artemis7973",
            "body": "China occupies such a dual position in my mind. I like so much of their stuff and they are so good at optics that you can often forget forget about a lot of the bad stuff that is going on. You just never hear about it and a sort of amnesia just sets in. I'm really happy to see whenever anyone raises awareness about something that just goes ignored and forgotten in the collective conscious.",
            "score": 67,
            "replies": [
                {
                    "author": "makyura212",
                    "body": "Well it is an authoritarian government, and now a dictatorship, essentially. The chairman for life position makes the person there de facto dictator.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Doc-Wulff",
                            "body": "If Mao could see what's become of the Middle Kingdom Under Heaven he'd be aghast and ashamed",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "DaFatGuy123",
                                    "body": "HAHA no, Mao was the worst thing to happen to China since WWII. Mao was so much worse than Xi has ever been. Not that either was good.\n\n^^ As a Chinese with parents who lived through the cultural revolution.",
                                    "score": 20,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Adam_The_Actor",
                    "body": "Indeed they've got a rich history and culture but bullying those for representing history they'd rather bury is frankly a disgrace. The developers of Genshin Impact I would say should be ashamed of themselves but they are based in China and exploiting every penny out of it's citizens come first I guess. No other region on earth should touch these claims with a 10 ft pole.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "redditmodloservirgin",
                    "body": "I certainly don't forget. Noone should.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "leckmichnervnit",
            "body": "Fuck China",
            "score": 59,
            "replies": []
        },
        {
            "author": "Hanabi_Simp",
            "body": "That's kinda the gist when you work on anything related to China, you cannot say anything about them because they have weaponized their population to do this kind of shit against anyone that dares to talk about anything bad their government does.\n\nSadly Chinese developers are under the thumb of the CCP and have little to no power do anything, but if Atlus does get rid of the seiyuu just to please the Chinese zealots then they can go fuck themselves.",
            "score": 31,
            "replies": []
        },
        {
            "author": "Oldyooda",
            "body": "I feel so happy and grateful that he recognised the genocide that is happening in Uyghur",
            "score": 21,
            "replies": []
        },
        {
            "author": "CertainDerision_33",
            "body": "\"Chinese fans throw pathetic nationalist tantrum over absurd issue\" edition 99999",
            "score": 37,
            "replies": [
                {
                    "author": "Inksplash-7",
                    "body": "Probably Winnie The Pooh forced them to do so",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "exboi",
                    "body": "A similar thing is going on with the Paradox sphere of games. They’ve been review bombing Stellaris and I assume other Paradox games because of an expansion in EU4 lmao.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "flairsupply",
            "body": "Once again I am baffled how people can play and enjoy Persona games and not realize oppression and injustices are quite literally antithetical to the games message.\n\nLike how any American could have played Persona 5 and then voted for irl Shido…",
            "score": 20,
            "replies": [
                {
                    "author": "exboi",
                    "body": "Just a few days ago I saw a pro-“Shido” conservative with a P5 profile pic 🤦🏾‍♂️",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MinatoKiri",
                    "body": "The same way someone can play simulators or management games where you improve your health and gett better at working or, or starting successful businesses or relationships, only for IRL you to be an unhealthy NEET",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TerribleTerabytes",
            "body": "The gaming market really does not need China. For many years developers didn't even bother because they didn't want to deal with the strictness of the CCP. We should keep it that way. They're all fucking bullies.",
            "score": 16,
            "replies": []
        },
        {
            "author": "sswishbone",
            "body": "Censorship supporters can suck it, people have recommended I play Genshin, they can fuck off now",
            "score": 12,
            "replies": []
        },
        {
            "author": "redditmodloservirgin",
            "body": "Based, fuck them denying evil",
            "score": 5,
            "replies": []
        },
        {
            "author": "lurkingmania",
            "body": "Lol. Lmao even. Rofl, perchance.\n\nIf Atlus is stupid enough to give in they don't deserve anyone's money. I don't think anything will come of this. Chinese fans are always seething about something so let them screech into a void.",
            "score": 15,
            "replies": [
                {
                    "author": "Agitated_Spell",
                    "body": "Also, it is extremely unlikely for a Japanese company like Atlus to change their voice actor, unless they died or got into a really big controversy. We'll have to see if the Chinese pressure is enough to make an exception, but I personally find it unlikely to happen anytime soon.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adam_The_Actor",
            "body": "They can take a running jump, we've seen entitled BS plastered all over Weibo in the past and it's been an utter disgrace to both art and industry with the likes of what happened with The Devotion developers. If you don't want his work in their country, that's fine but if they're actually demanding this man gets his life erased from the face of the earth then uh... no. That being said if they were really being that hard on him I'd expect Persona 4 Golden to be review bombed into oblivion which doesn't seem to be the case.\n\nWe know the Chinese gaming are more than happy to down-vote and bully developers and publishers through sheer numbers so I gotta question what the source for this actually is? Genshin Impact doesn't surprise me, it's a chinese developers looking to exploit 2 billion children with the kind of slop you'd expect from any moba. Atlus though, they don't have to.",
            "score": 9,
            "replies": [
                {
                    "author": "Witty-Ad5429",
                    "body": "Well, a Chinese friend of mine shared it with me. It's a platform called Tieba, which is a bit like Reddit. The community there has gone viral. I can understand a little Chinese, and my friend also translated it for me. It's full of vicious words, even including a statement that Morikubo is hoped to be killed... As for Weibo, you should check the hot searches about Genshin Impact, which has caused widespread controversy because of the role change.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Adam_The_Actor",
                            "body": "Bless you Wit, I appreciate the insight. I know of Weibo but I definitely didn't know about Tieba. As for what's being said, it's disgusting and I could only hope if Atlus ever catch this they kindly tell them to >!fuck off!<. If they don't want him to be a part of games or art released that's fine they're welcome to they like but anyone actually wishing death on the man for just doing his job is not someone worth acknowledging. That said, I hope that doesn't cause offence to you or your friend and I appreciate you sharing it. \n\nAs for what Atlus will do, they really don't have to do anything as I don't think he's been announced for 5X and if they have issues with P4G they can just delist it in China. I don't think they'd ever blacklist Mr Morikubo given he's done absolutely nothing wrong and as for 5X I'm just going to assume he won't be introduced into the game even if P4 is as I think changing the VO would only highlight the issue rather than fix it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Julio4kd",
            "body": "I know for a fact that in many places of the world, many people were condemned just for being Russian. \n\nSo, this is nothing we see everyday, everywhere.",
            "score": 11,
            "replies": [
                {
                    "author": "Adam_The_Actor",
                    "body": "That's tragic as hell. People not being treated as people but as part of the whole, taking the fallout for those above them. Know not everyone supports Putin but they follow him anyway because he's a bully who has the power and they don't.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "makyura212",
            "body": "No, they should not replace him. China can run its authoritarian regime as it wishes, I suppose. It's wrong but we can't do anything about it. Yet they don't get to dictate what a company based in Japan, a country that does have free expression, should do b/c one of its hired talent spoke out about some wrongdoing in another country.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Either-Condition4586",
            "body": "Sooo people in China are fine when some group of people is imprisoned and slowly dying out?That just perfect",
            "score": 5,
            "replies": []
        },
        {
            "author": "ShokaLGBT",
            "body": "The dude did nothing wrong and atlus should NOT condemn the voice actor for what he did but i fear that they won’t want to upset the Chinese players as their whole goal with P5X releasing in China first was to get on their good side and make money from their players… also they did censored some persona designs for the Chinese version but not the others versions like Korean and Taiwan so that means maybe they’ll have a different VA For the Chinese version only. But anyway there are Chinese voice acting and Japanese voice acting in the game so they should just play with the Chinese voices and just stop bothering companies like this for nothing…",
            "score": 4,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to r/Persona! For additional information about the series or sub, please check out our wiki!\n\nGeneral: [Rules](https://www.reddit.com/r/PERSoNA/wiki/rules) | [FAQ](https://www.reddit.com/r/PERSoNA/wiki/getting_started)\n\nGame Specific: [P1](https://www.reddit.com/r/PERSoNA/wiki/p1) | [P2](https://www.reddit.com/r/PERSoNA/wiki/p2) | [P3](https://www.reddit.com/r/PERSoNA/wiki/p3) | [P4](https://www.reddit.com/r/PERSoNA/wiki/p4) | [P5](https://www.reddit.com/r/PERSoNA/wiki/p5) | [PQ](https://www.reddit.com/r/PERSoNA/wiki/pq)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PERSoNA) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Evening-Initial3110",
            "body": "If the camps are real, then China should stop being butt hurt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "leicamaniac520",
            "body": "Fuck these cunts is what I think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mike_Jonas",
            "body": "If atlus replaces the VA like some Chinese gacha games did(Genshit),  I will not support atlus anymore. But considering atlus is always greedy and China is a huge market to them, I guess that will be the way it is.",
            "score": 1,
            "replies": [
                {
                    "author": "Agitated_Spell",
                    "body": "Nah, don't count your eggs just yet. Replacing a VA in Japan industry is a big deal, and it is only done if the original VA had passed away, or they got into some fucked up controversy. I don't think Morikubo will be replaced so easily.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "EdelgardQueen",
                            "body": "Yeah i don't think so too. Anyways, Persona is a japanesse series, only p5x was ever released in china and it is by far not comparable in term populary to Genshi impact",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Arc_Confident",
            "body": "Pero pa victimizarse si son buenos",
            "score": -1,
            "replies": [
                {
                    "author": "Adam_The_Actor",
                    "body": "Sí, aparentemente el bullying no existe cuando son ellos los que lo hacen.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Puzzleheaded-Care250",
            "body": "They got made for participating in a reading play in which he would be acting or just reading",
            "score": 0,
            "replies": []
        },
        {
            "author": "shvuto",
            "body": "Tbh Chinese people not getting along with Japanese folks is to be expected especially when Japan doesn't admit to the war crimes they did to China and pretend that China made it up 💀 like they do the same shit to Korea its crazy",
            "score": 0,
            "replies": []
        },
        {
            "author": "AirInTheHair",
            "body": "I think it is between japanese and chinese people to decide. Lets not forget that Japan as a country still didn't recognise WW2 warcrimes agains China.\nSo let's stop deciding for them, especially if you are an american and don't have any experience in how the world works.",
            "score": -17,
            "replies": [
                {
                    "author": "MoncheroArrow",
                    "body": "This is different. Showtaro is speaking out against a literal genocide going on in China (research the Uyghur camps and you'll see) that not enough people are bringing attention to. This is just cruel and unfair, for the Chinese people to try and get Yosuke's VA fired from Atlus. \n\n  \nIt's like if you were an entertainer in the 1940s, and you spoke out against Hitler so German people tried to get you fired from your job as an entertainer, you wouldn't say \"Oh this is for the German people to decide\". \n\n  \nThis is unfair to Showtaro Morikubo specifically. This isn't a matter of Japanese or Chinese being the ones to decide. \n\n  \nThe mindset that if you aren't Japanese or Chinese you shouldn't have a say or opinion in a situation like this is stupid, I'm sorry. Besides Persona is a series played by millions around the world, this affects us to even if you aren't Japanese or Chinese.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "AirInTheHair",
                            "body": "I think you are an american.\nLet me expand on story, you are entertainer in 1940ties from Belgian Congo, and you speak against Hitler. You would feel that they are just hypocrite. \nLet them decide it.\nWe should condemn genocide and not choose slides in a culture war",
                            "score": -8,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}