{
    "title": "The Chinese Hearthstone community needs dedicated communication channels with game designers for feedback. Without using VPNs, we are completely unable to make our voices heard by the official development team",
    "author": "mgss4444",
    "subreddit": "hearthstone",
    "rank": 18,
    "score": 100,
    "upvote_ratio": 0.72,
    "num_comments (reported by reddit)": 61,
    "url": "https://i.redd.it/gd7cvdf4xfpe1.jpeg",
    "id": "1je3two",
    "selftext": "Examples include Hostage Mage, Seedlock, Hooktusk Rogue, Libram Paladin, and Reno Holy Wrath Paladin. These extreme deck archetypes degrade the gaming experience far more than typical decks due to their polarizing win conditions.\n",
    "comments": [
        {
            "author": "noxx1234567",
            "body": "Hearthstone Devs are impartial at taking feedback , they don't listen to anyone anyway",
            "score": 146,
            "replies": [
                {
                    "author": "ReflectionSevere5364",
                    "body": "That's not just a hearthstone thing, it's a blizzard thing.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "d_chs",
                            "body": "That’s not just a Blizzard thing, it’s an AAA+ studio thing. It’s the nature of the beast.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "VelvetMoonlightsword",
                            "body": "Absolutely, take for example OW which is even worse, there has been thousands of posts complaining for about a decade about Mercy in lower ranks and casual matches (70% of the playerbase) it makes matches immensely annoying to play when paired with high agency dps, like Pharah or Sojourn, or auto-chess characters like Winston, and sure 70% of playerbase could learn to aim or you could rework a character that is playable in both high and low elo, but how will any of this help to sell skins?",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "asian-zinggg",
                    "body": "Isn't there literally a creators discord where devs talk to creators about player sentiment? Zeddy has literally spoken on this in a video before. The devs do actually listen. They just don't pander to every single complaint because the reality is we actually don't know better than the people who's literal job is to make Hearthstone. Are they perfect? Hell no. But no dev team with frequent updates with additional content really is.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Oniichanplsstop",
                            "body": "They don't listen, they use the creator discord as another flavor of reddit, it's gauges sentiment from a handful of players. You have people like Dane who want Wild to have 0 patches, and people like Zeddy who want every Tier 3 or higher wild deck constantly nerfed for being \"unfun\", while he also plays one of the most \"unfun\" decks in the format.\n\nThe same way that Reddit doesn't always agree because of how vastly different the players are from what they want out of HS(casual, comp, meme combos, etc) or what they find a problem(attrition, combo, OTKs, aggro, mana cheat, etc)\n\nUsing your own example, Zeddy has time and time again said that they don't actually listen to them via the feedback/balance or suggestions(especially for Twist) unless it aligns with what they were already going to.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "asian-zinggg",
                                    "body": "Zeddy is usually complaining about over powered decks like pre nerfed Demon Seed because it does actually have a toxic play pattern. That's completely fair of him. Idk why you're trying to frame him as someone who only complains about tier 3 decks. I can tell that your bias is showing.\n\nWhen it comes to the creator discord, yeah, they aren't going in there and going \"hey creators, tell us everything we need to do and we'll do it.\" They just want feedback from people deeply into their game and deeply follow the community's sentiments. You have zero proof that devs make changes based on their own opinions. If anything, we have plenty of patches with notes where devs explicitly talk about nerfing cards because of community outcry. Take Quasar as a very notable example. You're just confidently making things up based on vibes.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Oniichanplsstop",
                                            "body": "Because Zeddy still complains about post-nerf Demon Seed when it's a legit garbage deck.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "asian-zinggg",
                                                    "body": "You're cherry picking examples. He was absolutely in the right for wanting it nerfed to begin with. And he's been right about a ton of other nerfs being needed. Honestly I just don't care about his disagreements with current seedlock. He also isn't making a huge push for it. He just casually makes side comments about it. He isn't trying to be taken seriously when it comes to demon seed. If he was, you'd see a bunch of videos about it. He isn't though.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "Oniichanplsstop",
                                                            "body": "No one is talking about pre-nerf Demonseed besides you? He's literally, as of last week, still complaining about a Tier 4 demon seed. He still complains about Libram Paladin when it's like a 30% winrate deck top legend. etc etc.\n\nYou're the one cherry picking by finding examples of when his whining is justified, rather than the excessive whining he does every single time he plays ladder. Which is why he barely plays ladder anymore.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "asian-zinggg",
                                                                    "body": "????????? Libram at 30% winrate? This is how I know you're talking out your ass. Libram is a tier 1 deck in wild, which is what he's talking about with Librams. For the pre-nerf seedlock, what are you even yapping about? The deck was a menace in wild and reauired multiple nerfs. Wtf are you even talking about me being the only one talking about pre-nerf seedlock? \n\nAnd I'm absolutely not just cherry picking. It's gonna sound like I'm memeing, but you're literally falling for anti-zeddy propaganda. The dude is by no means perfect. But he 100% gets way more hate than he gets. He makes lots of great points but you all just yap the regurgitated \"Zeddy bad\" because everyone on the sub says so without concrete proof.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Oniichanplsstop",
                                                                            "body": "Yes, Libram is horrible at top legend in wild. It has good stats in diamond/dumpster legend because it farms bad decks/bad players and has 0 positive matchups vs Tier1/2 decks in top legend.\n\n> For the pre-nerf seedlock, what are you even yapping about? The deck was a menace in wild and reauired multiple nerfs. Wtf are you even talking about me being the only one talking about pre-nerf seedlock?\n\nAnd I'm talking about post-nerf Seedlock. Literally no one is talking about pre-nerf seedlock besides you? He's complaining about 12/12/12, glareless demonseed, and wants it nerfed again. Does that make it easier for you to understand or do you need it dumbed down even more?\n\n>And I'm absolutely not just cherry picking. It's gonna sound like I'm memeing, but you're literally falling for anti-zeddy propaganda\n\nI literally watch zeddy myself lmfao.\n\nBut I guess \"guy pointed out flaw about my favorite streamer so I have to go full defense mode as if he said mean thing about me\" is your entire personality.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "asian-zinggg",
                                    "body": "This has nothing to do with covid. But maybe covid broke your brain I guess. \n\nI didn't even say anything crazy about defending devs. I'm simply stating information that I have been told while also keeping it honest about what we've seen the devs actually do. If your immediate reaction to a discus about devs is that we should be harshly laying into them about how they're doing, you're a chronically online person. These are real humans trying to do their best job at making a game while also having to deal with greedy CEOs try to steer their games into the ground through predatory mechanics meant to drive engagement or shop offerings. \n\nAnd before you say something like \"oh no I didn't say to harshly lay into them\" you absolutely did because you felt the need to respond to my level headed response about devs.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "asian-zinggg",
                                                    "body": "Don't play stupid with me. You know damn well you're creating a catch-22 situation. If nobody calls you out, then you're \"correct\" by default with your opinion. If someone does call you out, you get to say \"SeE yOu ArE jUsT pRoViNg My PoInT.\" \n\nGet real.\n\nEdit: I got blocked. Bro couldn't handle being wrong. I can't with these grown ass people acting like children.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OddlyFactual1512",
                                    "body": "What the F does COVID have to do with any of it?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "OddlyFactual1512",
                                                    "body": "So, absolutely nothing. You just have decided that COVID is a political lens through which you view everything, even how people evaluate the responsiveness of developers of a card game to player's input. That's a sad little false reality you created for yourself.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "FrankFT",
                                                            "body": "Found the \"everything is political\" guy",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SplashyB",
                                                    "body": "real",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "andrewshi910",
                    "body": "0 racism involved.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alucardra12",
            "body": "Don’t worry , they don’t really listen to NA and EU players much too. Only their higher ups and shareholders have any sway over them.",
            "score": 51,
            "replies": []
        },
        {
            "author": "Catopuma",
            "body": "Looks like this is all Wild decks.\n\nOf the list, Libram is getting a hit on their burst from Holy Glowstick.\nIt's still strong and can pop off early but it'll remove their burst.\n\nI haven't had as much problem with Seedlock since the nerfs hit it. It's so much slower now unless you're playing a non proactive deck without much disruption. It's much easier to pressure their life total now.",
            "score": 18,
            "replies": [
                {
                    "author": "Oniichanplsstop",
                    "body": "CN wild players love playing shit piles, and Seed/Libram destroy shitpiles.\n\nHostage Mage/Reno Pally are valid complaints though.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fen_",
            "body": "1.  People outside of China have those same complaints.\n\n2.  The only feedback they care about is financial, which they *do* have access to for all regions.  If line goes up, they don't give a shit.",
            "score": 4,
            "replies": []
        },
        {
            "author": "akiva23",
            "body": "That kind of sounds more like an issue with the Chinese government than an issue with Blizzard but I'm rooting for you buddy.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Hungry-Common-7236",
            "body": "I agree with the sentiment but you would just be having the feedback translated so they can ignore it in English, I think some of the devs probably do care about this stuff but they simply won't be ordered to work on it. \n\nas long as it doesn't hurt their bottom line, the higher ups will always allocate their work hours to rolling out new, fancy things to keep the ball rolling, they are not interested in building a strong foundation, it's why the client has been a failing grade Unity student project for about a decade",
            "score": 3,
            "replies": []
        },
        {
            "author": "MythicalCreatureBone",
            "body": "As if the dev team listens to anyone about anything",
            "score": 5,
            "replies": []
        },
        {
            "author": "Most-Catch-5400",
            "body": "Sounds like China's fault, not Blizzard's tbh",
            "score": 11,
            "replies": [
                {
                    "author": "tolerantdramaretiree",
                    "body": "> China’s fault, not Blizzard’s\n\nFully stripped down of context, perhaps. But Blizzard *chose* to do business in China, and that business is booming. Blizzard chose to do this fully aware of all existing barriers.\n\nIt’s perfectly right to demand the same quallity of community management as we get in the english-speaking community.\n\nBlizzard is not the first US company to do business in China. Communications have long been figured out. Blizzard only needs to employ them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jotaechalo",
                            "body": "It’s profitable for blizzard to switch to platforms that have allowed government censorship/interference to solicit feedback, but it’s not a requirement for them to do so. Especially since, as OP alluded, people can just use VPNs which are widespread anyway.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tinkererer",
                    "body": "That's dumb. It's much easier to set up a dedicated forum than to *change the laws of the biggest country in the world*. It's a good suggestion.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mgss4444",
            "body": "Hearthstone designers just need to choose one platform from China's numerous social media platforms to create an account, right?",
            "score": 2,
            "replies": [
                {
                    "author": "ALittleShowy",
                    "body": "For a start, that would mean hiring multiple social media staffers fluent in English, Simplified and Traditional Chinese. A cost of hundreds of thousands each year. There are so many things to consider when creating a brand presence in a new country.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "buhead",
            "body": "How r ppl saying this is a china problem, this is a blizzard problem lol. They barely balance wild cards.",
            "score": 6,
            "replies": [
                {
                    "author": "Most-Catch-5400",
                    "body": "Because the entire issue is China banning their citizens from communicating on normal channels? Blizzard don't make special channels to communicate with any other country either, the whole problem is China's censorship.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Oniichanplsstop",
                    "body": "It's a China problem because OP is complaining that they have no way to communicate with Blizzard on the usual channels without VPN''ing because China literally bans half of the internet unless they VPN.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "flaks117",
            "body": "Loving the condescending \"that's a you or china problem\" when the constant complaint posts here from a clearly western audience beg to differ.\n\nThe Chinese community is huge for Blizzard and Hearthstone in particular so I think you'll be able to push for changes with strength through numbers OP. I'm not sure if X/Twitter is still big in China but that seems to be the most effective avenue to make your voices heard even here in the West.\n\nFight the good fight. Something changed at Blizzard back to their old ways. We saw back in 2022 a change towards catering to the players over the last 2 years and their games were booming for it from WoW to Hearthstone and even Diablo 4. But since the end of last year they've gone back to just ignoring any and all feedback and churning out more and more slop more quickly. Might have something to do with Microsoft.",
            "score": 6,
            "replies": [
                {
                    "author": "sopunny",
                    "body": "> I'm not sure if X/Twitter is still big in China but that seems to be the most effective avenue to make your voices heard even here in the West.\n\nIt's straight up banned in China, along with half of the Internet including Reddit. That's why OP says they have to use VPNs, and why it's not Blizzard's fault but China's.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Most-Catch-5400",
                    "body": "People complaining on Reddit is completely beyond the point, I honestly don't understand how you think that's relevant unless you have completely missed the point of the post.\n\nIt's not their fault that they have complains or balance suggestions, but it is China's fault for not allowing their citizens to post on normal social media. If China didn't have so much censorship then Chinese posters could just air their complaints here along with every other nationality instead of requiring dedicated channels. It is blatantly China not allowing their people to communicate, not Blizzard uniquely refusing to listen to them. Hence why it is China's fault.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kennypovv",
            "body": "The problem is that different players have different opinions. I personally don't think any of those decks degrade the gaming experience, and I personally dislike shadow priest more than any of them.   \nGood devs know how to weigh different parameters when deciding on balance, and not kneejerk reactions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "coy47",
            "body": "I don't see how the picture is relevant and aren't some of these decks wild decks?",
            "score": 5,
            "replies": [
                {
                    "author": "HereBeDragons_",
                    "body": "Wild is very popular in China",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "BekaSSTM",
                    "body": "I know that wild doesn’t have many players, but it doesn’t mean that devs shouldn’t balance it a bit",
                    "score": 7,
                    "replies": [
                        {
                            "author": "coy47",
                            "body": "I agree but devs put so little into things which aren't standard or battlegrounds I very much doubt they will make many changes outside or once every few months. They will just try and push unhappy players to standard instead",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "BekaSSTM",
                                    "body": "China probably has way more wild players though",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "HabeusCuppus",
                                            "body": "yes, based on the relative sizes of the servers, even if wild was 'only' as popular relative to standard in china as it is in the west, China would still have more wild players than NA+EU has standard players *combined*.\n\nMy understanding is that wild is relatively more popular there so it's even more exaggerated than that.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bronyatsu",
                    "body": "Orimge cat grabs my attention any time.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Low-Phase-8972",
                    "body": "Chinese grown adult men and women LOVE to use cat and dog memes. You think Asian men and women are tougher and more mature? No, on the opposite. Chinese people are the most naive people I’ve ever met. They have a liking for being childish and I’m not even joking.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Captain_Bignose",
            "body": "Why do you think your feedback is more important than anyone else's? None of us outside China have any of these channels either",
            "score": 5,
            "replies": [
                {
                    "author": "Tinkererer",
                    "body": "We do, though. You can see that devs read places like this subreddit, Twitter, and other social media.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ALittleShowy",
                            "body": "But I still wouldn't call this an official dedicated communication channel with the devs. This is a community for the game that some devs read sometimes.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tinkererer",
                                    "body": "The point of the post is that we have lines to the Devs, while Chinese players don't. This can be solved through having an official channel in China.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ALittleShowy",
                                            "body": "For a start, that would involve hiring a lot of social media staffers who are fluent in English, Traditional and Simplified Chinese. That's already a cost of hundreds of thousands a year. You'd be hard pressed to find a company willing to invest a good deal of money to fix a problem that doesn't exist, as far as they're concerned.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mekzo103",
            "body": "Play bad decks, tank your mmr, and you won't have to play against these decks much.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Klee__the_Terrorist",
            "body": "老吴 老吴 老吴",
            "score": 2,
            "replies": []
        },
        {
            "author": "evopanda",
            "body": "Been to a Hearthstone tournament at the Blizzard Arena where I could even talk and play a developer and when I held a sign for a nerf for a card I got laughed at. Card eventually got nerfed but then it got reverted back to its original state. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mgss4444",
            "body": "Thank you to the bro who came to support.🌻",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "Tinkererer",
                    "body": "God, this sub is absolutely insufferable if China is ever even mentioned.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}