{
    "title": "Raza Signature",
    "author": "Mattendo_",
    "subreddit": "hearthstone",
    "rank": 10,
    "score": 48,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 14,
    "url": "https://i.redd.it/v537yyvpcipe1.jpeg",
    "id": "1jef0ib",
    "selftext": "I don’t know what to do with my signature. I’m so angry and frustrated with this rework entirely ruining the spirit of the card, a card that I actively sought and grinded a signature for cause it was so cool. But now it’s a dud that has no connection to Raza whatsoever, and that’s so dumb for a card with such amazing art. Do I just take the 3200 or enjoy the signature for what it could have been ",
    "comments": [
        {
            "author": "Tengu-san",
            "body": "They could revert next year when it rotates out, keep it for now",
            "score": 34,
            "replies": [
                {
                    "author": "ReadMedakaBox",
                    "body": "Then, he won't have a full refund. (Idk if the system works differently for signatures, I never tried to disenchant a signature, maybe I should disenchant my amogus rogue signature legendary to see how it works...)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Flooping_Pigs",
                            "body": "I got a Don Hanzo and Elise Starseeker wanna give me 1600 dust apiece so they just gonna stay lookin pretty",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flooping_Pigs",
                    "body": "There *is* a lot of bullshit in Wild... Can't wait to see the \"approved, approved, hmmm I don't know... An excellent argument, approved\" meme lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "APinkFatCat",
            "body": "As much as I hate disenchanting signature legendaries, Raza was never usable in standard, and likely will never be, so I'm not gonna look the free 3200 dust gift horse on the mouth. Saves on pulling a ton of packs next set if you think about it",
            "score": 22,
            "replies": [
                {
                    "author": "Mattendo_",
                    "body": "Yah normally I try to scrounge up enough for a preorder, but I couldn’t this expac so this is screaming 2 free new legendaries to me",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fearless_Cupcake_114",
            "body": "I just disenchanted it. I don’t see any reason to keep it.  Plus it’s two free legendaries. Win some lose some.",
            "score": 12,
            "replies": []
        },
        {
            "author": "VelvetMoonlightsword",
            "body": "I would keep it, maybe we get a way to exploit the effect with some bullshit way.",
            "score": 3,
            "replies": []
        },
        {
            "author": "KresoZadar",
            "body": "This is probably your only chance to disenchant it\nJust saying",
            "score": 3,
            "replies": []
        },
        {
            "author": "Javaddict",
            "body": "I'd take the 3200 but I don't care about golden or signature cards at all.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thearmedlemon",
            "body": "First sig Tony, now sig Raza... at least let me reroll it!",
            "score": 2,
            "replies": []
        },
        {
            "author": "anhhuy2502",
            "body": "ahhh u reminded me i have the signature too, not that i ever played the card more than twice lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roykebab",
            "body": "Since everyone thinks its going to be horrible, there will definitely be a meta deck with raza :)",
            "score": 1,
            "replies": [
                {
                    "author": "D3adInsid3",
                    "body": "This kind of effect won't make or break a deck.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}