{
    "title": "This is fake right?",
    "author": "No-Alternative7997",
    "subreddit": "Anarcho_Capitalism",
    "rank": 38,
    "score": 255,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 150,
    "url": "https://i.redd.it/kubudydwo5ie1.jpeg",
    "id": "1illbii",
    "selftext": "",
    "comments": [
        {
            "author": "michaelterron5",
            "body": "I literally have never seen this",
            "score": 283,
            "replies": [
                {
                    "author": "LiberalAspergers",
                    "body": "I have seen this. It is stupid, but SLIGHTLY less dumb than the Biden version, since Trump atually campaigned on bringing down grocery prices, starting on Day One. \n\nIt was a dumb promise that he had to know he couldnt keep.",
                    "score": 104,
                    "replies": [
                        {
                            "author": "AilsaN",
                            "body": "Most everyone knows that he can't magically reduce prices on day one. He meant he would start advancing policies that would eventually reduce prices. The tariffs notwithstanding (most have been cancelled or paused except for China), any attempt to reduce inflation and overregulation should result in lower prices.",
                            "score": 108,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "But that isnt what he said over and over on the stump. \n\nIf he meant that, he sure didnt say it.\n\n\"When I win, I will immediately bring prices down, starting on Day One,\"\n\nThat was the stump speech. It isnt unfair to hold a lying politician to account for their lies.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "Lickem_Clean",
                                            "body": "In 2023/24 the Biden administration was blaming inflated grocery prices on corporate price gouging and covid. That seems more worthy of ridicule.",
                                            "score": 51,
                                            "replies": [
                                                {
                                                    "author": "Midnight-Bake",
                                                    "body": "What no one blamed was the massive expansion of the money supply in 2020 which was largely a bipartisan effort. Although there were clashes, Trump wanted his name on stimulus checks, praised the rock bottom interest rates and by close of 2020 was blaming Democrats for not printing enough money.",
                                                    "score": 31,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "That is ALSO worthy of ridicule. Quite a bit of inflation was COVID related (used car prices, for example were very much a side effect of new car chip shortages, which was COVID related), but grocery prices were not.\n\nThat in no way makes Trumps grocery price claims less worthy of ridicule. Mock them all, they deserve it.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "ParticularAioli8798",
                                                            "body": "The most common sense response here.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "crankbird",
                                                    "body": "Depends on what you mean by “COVID”, if you say it’s COVID and the policy responses to it, then saying Covid caused inflation that’s pretty fair. \n\nLockdowns killed productivity in a whole bunch of sectors, most notably transport. Money was pumped in to keep the credit system afloat while a bunch of other things got scarce because of global supply chain problems. \n\nReduced revenue volumes (because of reduced supply) in the face of static or increased costs means business has to increase prices to maintain profitability which the market was able to support due to the money getting pumped into it.\n\nOnce the supply chains were fixed, the price inflation should have returned to “normal” it didn’t despite things being more or less the same as they were when inflation was running low .. cue multiple theories as to why … blame <whoever you don’t like at this point>",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Wrathofsteel",
                                                            "body": "The supply chains were already in shambles before covid because of the trade war with China that was taking place 2 years prior.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "crankbird",
                                                                    "body": "Yeah but not “no toilet paper on the shelves” level of shambles. \n\nI was in Oz during the plague, and there were some things that used to be no-brainers that became really hard to get, weird stuff like filters for my fish tank, or lithium battery replacements for my tools. Then there were chip shortages or parts for my wife’s Fiat or even replacements for said “car”. I really should have sold it when I had the chance when it was worth more 2nd hand than I paid for it when it was new. \n\nOTOH, I bought NVIDIA stocks because of the automotive chip shortage, ended up making a tidy profit. #plague-profiteer",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Wrathofsteel",
                                                                            "body": "That started in 2018 it just overlapped with covid.\n\nhttps://www.fusionww.com/insights/blog/the-global-chip-shortage-a-timeline-of-unfortunate-events",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "tim310rd",
                                            "body": "He said that he would work to bring prices down on day one. No one says or thinks that even if he did everything possible to reduce prices on his first day in office, the prices would go down on day 2. Farmers haven't started planting stuff yet in a lot of the country, and chickens don't just magically appear in 1 day or 3 weeks that didn't exist before.",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "Agreed. Ha cant do it. He knew when he promised to do it that it couldnt be done. It was a blatant lie from the moment he said it. But there is no reason to let a lying politician off the hook for a lie because it was a blatant and obvious one.",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "author": "tim310rd",
                                                            "body": "I guess it depends on how you interpret his use of immediate in reference to \"starting on day one\". Did he mean immediately after day one? Or did he mean \"immediate\" as in \"early into his term\". There is a strong argument for either interpretation, but I think common sense favors the latter.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "ParticularAioli8798",
                                                                    "body": ">I guess it depends on how you interpret his use of immediate in reference to \"starting on day one\".\n\nDumbest shit I've read all day. I mean, if that's your response to the above comment. Admit that he's a lying politician like the rest. \n\n>but I think common sense favors the latter.\n\nYou're trying really hard not to hold Trump (and politicians like Trump/all politicians accountable).",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tim310rd",
                                                                            "body": "Trump is an exaggerator but so far he's been keeping his promises and actually doing the shit the people who voted for him wanted him to do. Trump is the greatest sledgehammer to the federal government we will probably have for years and is the change libertarians have been asking for for years. If he is able to dismantle the DOE that will be the biggest victory libertarians have had in decades. His defense secretary has promised to make the DOD pass it's audits, and he, unlike other heads of that department, in independent of the military. He is also probably going to shut down the federal reserve. The person he is trying to emulate is Javier Milei of all people, and that guy makes Gary Johnson look like a statist chump. \n\nHe said he would burn it down, he is doing it, and I'm not going to call him a liar, or say that he is like all the other politicians, because in some areas he exaggerated about the pace he would do it at.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "LiberalAspergers",
                                                                    "body": "Common sense would favor the latter. His constant speeches on the stump clearly referred to the former.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "denzien",
                                                            "body": "Anyone who understands the world knew prices weren't falling literally on day one. He said many times that his plan was to reduce energy prices to lower the cost of goods, and he signed EOs on day one that he believes will lower the price of energy. The change won't happen overnight. Anyone who thinks otherwise is either stupid or arguing in bad faith.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "LiberalAspergers",
                                                                    "body": "I knew they werent coming down day one. But Trump went out of his way in his speeches to say they would. And lots of his voters were stupid enough to believe it. \n\nPT Barnum was right when he said no one ever went broke underestimating the intelligence of the average American, and no one ever lost an election that way either.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Mybuttitches3737",
                                                            "body": "Your username checks out. Hyperbole and sarcasm is hard.",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ParticularAioli8798",
                                                            "body": "WTF. Why are people downvoting this? The only explanation is that there are a lot of Republican Party bootlickers here among us.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "G0sp3L",
                                            "body": "Can you link me where he said that? I've never heard him say on day 1. In fact, I've heard him say there would be some temporary discomfort.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "https://amp.cnn.com/cnn/2025/01/28/economy/trump-inflation-price-promises\n\nBack in August he was saying Day one. He did a preas conference at Bedminster about it.\n\nOnce he won, he started backpedaling on that hard.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Der1kon",
                                                            "body": "I followed your link, mostly because I was curious if/how media has taken words of a politician out of context this time. Which is very common for both sides, to be fair. \n\nThe article you linked says:\n> “When I win, I will immediately bring prices down, starting on Day One,” he said at the time.\n\nAnd it cites this article https://www.cnn.com/2024/12/12/economy/grocery-prices-inflation-trump-interview/index.html\nWhich in turn says:\n> Speaking in front of a table of packaged foods, Trump used an August press conference to draw attention to food inflation during his campaign for president. “Grocery prices have skyrocketed,” he said.\n“When I win, I will immediately bring prices down, starting on day one,” Trump continued.\n\nHere’s the video of that conference: https://youtu.be/mZFjBFrYGhY?si=GDFNliTKL1RhooWl\n\nKind comments on YouTube have a timestamp to where he makes that statement (no way I’d watch all 1.5 hours to find it), the statement starts at around 27:30 mark\n\nWhat Trump actually says: “So when I win, I will immediately bring prices down, starting on day one we will end Kamala’s war on energy and … “. \n\nIn my opinion you need to be disingenuous to assume that “starting on day one” was related to prices and not to ending Kamala’s war on energy.\n\nI should also say I have no idea whether he kept his promise on ending energy related policies. I’d just notice that I haven’t seen him being called out on it. ",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "crankbird",
                                                                    "body": "“When I win I will immediately bring prices down” sets a pretty concrete expectation, on the level of an executive order for price controls ala Executive Order 8734 \n\nHe didn't use the typical weasel words like “begin working on” which most Trump supporters are now saying were always implied. They may have been, but I'd wager a decent bottle of good single malt that a large number of the people who voted for him expected him to work miracles because they don't understand how power really works, but they do understand categorical statements from strongmen.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "gvs77",
                                            "body": "Starting to bring down prices.  There is no way any reasonable person believes that can be done in a day.  I don't trust Trump (nor Biden), but this is just throwing accusations.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GravyMcBiscuits",
                                    "body": "I think you vastly underestimate how gullible his worshippers are.\n\nYou know that group of goofs that think Biden magically made the economy better with his \"Bidenomics\"? Trump/GOP has their group of koolaid drinkers who fall for this crap too.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AilsaN",
                                            "body": "You aren't wrong.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Null_zero",
                                    "body": "Deporting half the farm workers isn’t going to help and it’s not going to be offset by better tax policy any time soon.  Especially since there has been zero movement on taxes except for tariffs so far.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bluefootedpig",
                                    "body": "Ah the good ol' defense of Trump from the first term. \"He didn't mean it like that, I understand what he really meant, let me tell you\" and then everyone tells you a different meaning. \n\nWe could reduce egg prices, drop the tariffs on imported eggs. Like his now 25% tax on egg imports, those aren't helping.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AilsaN",
                                            "body": "It would also help if we stopped mass killing healthy egg-laying chickens domestically in an overreaction to bird flu (which occurred during the Biden administration).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Agitated-Can-3588",
                            "body": "Reducing the cost of energy is still better than a plan of ending price gouging when there isn't any price gouging going on except by consumers that resell items.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "Profif margins for egg producers who HAVENT had a bird flu outbreak are through the roof. If you call that price gouging depends on your definition of gouging, bit it is certainly a windfall profit. Chicken breeders are seeing even bigger windfalls, as producers need to buy millions of chicks to replace the culls.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Agitated-Can-3588",
                                            "body": "Isn't that because of the reduced supply caused by the ones that did have outbreaks? Price gouging is when consumers take advantage of emergency shortages and buy as much eggs or toilet paper as they can and sell them above market price. It's also temporary during a shortage not something that lasts for years and affects almost every product like inflation does. Retailers can't price gouge unless they have control of the market or are engaging in price fixing.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "bluefootedpig",
                                                    "body": "Wasn't Kamalas price control about only emergency and short term problems? I recall reading up on her plan and it had nothing to do with long term price controls. It was all around the price surging due to things like a flu or flood.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Agitated-Can-3588",
                                                            "body": "Well she framed it as a way to bring down the price of all groceries  which she claimed was going up because of corporate price gouging. When in reality the price of all goods had been increasing for years not during an emergency because of inflation not price gouging.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Shadowguyver_14",
                            "body": "To be fair after the bird flu went through most of our flocks of poultry nobody was lower in that price for a while. They slaughtered a huge amount of them and just keeping up with demand is got to be difficult.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "Agreed, but the President just doesnt controll egg prices, or grocery prices, and they all know that. If you make a promise about those prices, you know it is one you dont have the ability to keep.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Earth2Moon-2021",
                                            "body": "I missed where he said “Promise”!!  Can you show me?",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Shadowguyver_14",
                                            "body": "Well that's not really true either. Previously after covid that price was inflated with corporate greed. This time however it's environmental factors. President can do a few things lower the prices being reduction of regulations taxes and stimulus. Trump has done some of those but you still need the eggs in order to sell them.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "A president promising to lower egg prices or gas prices is like me promising my kid we will have a white Christmas. Both are almost entirely based on things outside our control, so it will only be kept if we get lucky. Which, IMO, makes it a lie.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Shadowguyver_14",
                                                            "body": "Wow what a bleak view of the world. It's not luck we've known about the bird flu for 4 months or so. But it's only recently that it got into the US's bird population. This is also not something that happens every single year or even every 5 years. Nora the high prices on eggs. What you're saying doesn't really make logical sense. It more just sounds like you're reveling in that bad things happened.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Click_My_Username",
                                                            "body": "But he can actually reduce those prices immediately by removing tarrifs, taxes and regulation. Like, this isn't some kind of mystery that no one understands.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ian_Campbell",
                            "body": "He did open up the oil and natural gas rights on day 1. But they have to actually achieve the drilling and get the stuff to market before it reduces trucking costs.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "Crude production was at record highs already in 2024. If prices dont break 80 a barrel, you wont see much more drilling regardless of the rights available.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kevin_Xland",
                            "body": "Yeah, I had a feeling it wouldn't go down day 1, probably not ever. If prices aren't up another 50% in the next 4 years, that's a win in my book tbh.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "If he keeps inflation under 3%annually  without a recession, so about 13% in 4 years, that would be a win.\n\nTotal inflation under Biden was about 23% over 4 years, so to call it a win needs to be significantly better. IMO.\n\nI susoect inflation will stay down, unless he puts someone new at the Fed who just slashes interest rates. Recession, OTOH seems likely.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Kevin_Xland",
                                            "body": "Completely agree, I won't lie though, I'm still skeptical about the 23% number. Feels like everything I care about is up closer to 50% (food, fuel, ammo)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "Food certainly went up dramatically.\n\nWe also have a tendency not to pay attention to things that DONT go up.\n\nClothing, household goods, electronics, phone and internet services, health care, and tuition are the major categories that rose well below the overall inlfation rate.\n\nEveryone bitches about health insurance rates when they go up. No one notices when they DONT go up and everything else does. Same with tuition, and phone bills.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Kevin_Xland",
                                                            "body": "Also housing/rent has risen lots, that could just be my area though, not sure what nationwide is. But yeah I'll admit definitely harder to anecdotally gauge stuff like electronics and household goods since you replace it pretty infrequently.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "LiberalAspergers",
                                                                    "body": "Seems like a top end phone has been just under 1000 dollar for about 20 years. That 999 price point seems REALLY sticky.\n\nA pair of jeans still seems to be around the same price as when I was a teen 40 years ago. \n\nEducation costs affect a distinct subset of the population, so we dont notice them as much, but it is acutally a big segment of the economy, about 5.5% of GDP.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Kevin_Xland",
                                                                            "body": "Honestly, getting hard to even know what the price of a phone is. Feels like they inflate the price just so they can then discount it for \"their best deal ever!\" And then they also try and get you by upgrading your plan or something too. But yeah, somewhere in the ballpark of $1000, it does feel like they used to start at $1000 and be discounted to like $600 and now they're like $1500 and discounted to like $990.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tinathefatlard123",
                            "body": "I would argue stopping gas exploration and canceling pipeline construction along with selling oil reserves to foreign countries raised gas prices in a much more direct way than anything Trump has done or failed to do",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "Trump is also advancing policy positions that directly increase consumer prices, and especially food prices.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "AgainstSlavers",
                                    "body": "My hope is that it will be offset by income tax reduction and government spending reduction.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "It won't.  Trump is using the specific discretion the executive branch has over foreign trade to increase our tariffs, but he has no discretion over income tax or most forms of spending, and he has no meaningful plan to drive any of the necessary legislation through.  He's trying to do everything by executive fiat, and *isn't* working with Congress in a way that could achieve lasting results.\n\nThe immigration policies he's advancing are also going to have a particularly severe impact on agricultural labor, and will result in supply-side issues that increase the price of food.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "AgainstSlavers",
                                                    "body": "You may be right, and it is good to hold his feet to the fire.  I am mostly happy with what he's done so far though. It's much more than we could have hoped for from democrats or libertarians, the latter having no chance of winning the presidency any time soon. Simply moving the overton window in the right direction is a huge victory.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ILikeBumblebees",
                                                            "body": "I wish we had a way of holding his feet to the fire.  I'm happy with *some* things he's done, but the tariff stuff more than tilts the scale in the other direction.\n\nMaybe all of this chaos will ultimately help us to get actual libertarians into positions of power.  The incompetence and corruption of both major parties has never been as apparent and consequential as it is right now.\n\nMoving the Overton window is an important thing, but we need to make sure we're doing that, and not letting Trump and his followers push the Overton window in a direction that normalizes nationalism and executive overreach at the expense of individual liberty.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AgainstSlavers",
                                                                    "body": "I think it's possible to be proud of most of American culture while opposed to statism.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ILikeBumblebees",
                                                                            "body": "Of course it is, but I'm not sure how that relates to this discussion -- could you elaborate on what you mean?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AgainstSlavers",
                                                                                    "body": "We may be working with different definitions of nationalism. I think it is possible to be nationalist anarchist, which I would define as pride in the national culture especially insofar as the culture is libertarian.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "ClimbRockSand",
                                                                    "body": "Trump, with his megalomania, is susceptible to pressure from his base.  I think that's the main reason he has engaged positively with some libertarian ideas.  Thus, we can hold his feet to the fire by calling him out publicly when he promotes statist ideas that will hurt his base.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CapeTownMassive",
                    "body": "I have seen them prices go up thoooo ⬆️",
                    "score": -1,
                    "replies": [
                        {
                            "author": "SteakAndIron",
                            "body": "I went shopping on January 19th. The prices are the same now as they were that day.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DMBFFF",
                                    "body": "That's 20 days ago.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "SteakAndIron",
                                            "body": "Yes. But they're saying prices went up. They didn't.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "DMBFFF",
                                                    "body": "If that's the case, then they erred.\n\nLet's hope the prices stay low.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Jesterial",
                                                    "body": "Ya i mean gas prices in my town have went from 3.09 to 2.89 in the last 2 weeks. Where are these prices going up?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Earth2Moon-2021",
                            "body": "Day 1 of Bidens adm the prices of everything skyrocketing. And I mean EVERYTHING!!",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "DMBFFF",
                                    "body": "no exceptions, absolutely no exceptions.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "When you see all that text in yellow, you’re about to read some of the stupidest shit you’ll come across all day.",
            "score": 106,
            "replies": [
                {
                    "author": "wbg777",
                    "body": "It’s an Instagram account called occupydemocrats. They’re always posting some asinine propaganda",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "thermionicvalve2020",
            "body": "Lol prices be high because of the state they are defending.",
            "score": 29,
            "replies": []
        },
        {
            "author": "AilsaN",
            "body": "He's been in office less than a month. No person with at least average intelligence attributes the prices in grocery stores to his policies.\n\nThat said, I have not seen one of these stickers.",
            "score": 85,
            "replies": [
                {
                    "author": "LiberalAspergers",
                    "body": "I have seen 2, both on egg displays. But I do the grocery shopping for our household.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "boblobchippym8",
                    "body": "Tarrifs?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "thesauciest-tea",
                            "body": "Which tariffs and what prices are higher in the past 3 weeks?",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "boblobchippym8",
                                    "body": "Didn't know most of it were paused. But if they weren't, wouldn't prices go up at least in the short term? Business need time to switch sources and during that time it doesn't make since to sell things at a loss. Of course that doesn't mean I'm forced to buy from them, simply that price increases on imports will exist if Tarrifs are actioned.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AilsaN",
                            "body": "He's paused or cancelled most of them with the exception of China. But it is important to remember that, prior to the advent of income tax, the US got all of its government funding in the form of tariffs.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Guslet",
                    "body": "I attribute them to his policies....from 2020 when he increase m2 supply by 5 trillion dollars in a year during covid and Biden continued them.",
                    "score": -7,
                    "replies": [
                        {
                            "author": "ChillumVillain",
                            "body": "Idk why you’re getting downvoted. Both Trump & Biden exacerbated inflation through money printing. It’s an inconvenient fact, but a fact nonetheless.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Guslet",
                                    "body": "I expected to get down voted, people don't want facts, they want feelings of validation. The right always harps on the left being snowflakes and how feelings drive their decision making. While that is true, the right is just as susceptible to it and use emotion to drive their thoughts and decisions.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "mhostetler66",
                                            "body": "Lmao the white guys I know that voted for trump just cause, like, the left is being meanies to them",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AilsaN",
                            "body": "I agree that was a bad move. Hopefully this term will be different.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Stunning-Ask5916",
                            "body": "COVID was spotted on a cruise ship off the coast of Chine in January, 2020.  My work went through major changes starting Friday, March 13.  Biden took office in January, 2021.\n\nTrump took actions during the onset of COVID.  Biden took actions during early recovery from COVID.  It is not fair to blame Trump for Biden's actions.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "AilsaN",
                                    "body": "Trump did get the spending ball rolling. Biden did nothing but make things worse.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ahent",
            "body": "So prices have remained the same from a few months ago but now it's Trump's fault? Where was the liberal outcry then?",
            "score": 36,
            "replies": [
                {
                    "author": "endthepainowplz",
                    "body": "The only thing I can think of is eggs, which is due to Avian Flu, and hundreds of thousands of chickens were killed, and we might be into the millions of chickens killed to try and stop the outbreak. The best criticism against Trump in regards to eggs was his decision to withdraw from the WHO as there is currently an outbreak of Avian Flu, and it has started infecting humans, though person to person infection hasn't happened yet, it could become a problem. \n\nHowever, the WHO, was like NATO, where the US is disproportionally pulling the weight, and we learned during Covid that communication about diseases is only valuable if the countries are being honest about it, which they weren't. So while it is bad optics due to the timing, I don't think it will have the effect that many people that criticize it think it will be, at least for the US. The WHO mostly benefitted smaller countries, but I'm kind of tired of the US propping up countries, why do we even need an Org to have people share information, people do that anyway when working towards a common goal.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "wmtismykryptonite",
                            "body": "It's more than hundreds of thousands.  20 million egg-laying hens are gone from last quarter.  Since 2022, it's at least 140 million.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "robot-tiger-pelican",
                    "body": "Are you seeing the same level of conservative outcry about those unchanged grocery prices under Trump as you saw under Biden?  \n\nI am not trying to rah-rah for either team, but this seems like odd criticism when it easily applies to both sides.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ahent",
                            "body": "No, but, the Trump administration isn't at fault for the prices so that alleviates one criticism from the conservatives that they had with Biden. Secondly, the conservatives have a good faith belief that the current administration is trying to fix these things but it can take time. The larger criticism that conservatives have now is that every time Trump tries to do anything to curb government waste and maybe funnel it back to something useful for Americans, his administration gets blocked by a judge and it holds up everything for weeks or months. Or, a nominee who can go into a department and start getting things done gets held up in the nomination process, for instance, Kash Patel. He has the votes and the Democrats can't stop his confirmation, but decided to hold it for 5 days. That's 5 days he could have been doing proactive stuff in the FBI, but now all he can do is sit and wait.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "robot-tiger-pelican",
                                    "body": "I agree that the efforts to curb govt waste is encouraging and can potentially position us even stronger as a financial power.  \n\nPersonally, I don’t expect that to have much impact on grocery prices, but understand your point that there are a lot of irons in the fire and results are to be seen.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ahent",
                                            "body": "Holy crap, that was a great question and a great response from you to my answer. I had to check if this was still Reddit. Thanks for the discourse internet stranger. I had started to lose hope for a bit on ever having decent conversations on Reddit again.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Glad_Firefighter_471",
            "body": "Trump hasn't had time to get credit for the economy just yet. This is all on Biden, for better or worse. Trump should get ready though because his day is coming...",
            "score": 8,
            "replies": []
        },
        {
            "author": "Acceptable-Take20",
            "body": "The left can’t meme and don’t have an original thought. Political correctness has killed any form of creativeness. They just retread the same old “safe” ideas.",
            "score": 74,
            "replies": [
                {
                    "author": "greyduk",
                    "body": "Oh come on... you know they didn't even try for originality. It's a copy not because of an inability to come up with anything - but because the whole point is to show how absurd the Biden \"I did that\" stickers were as well.  It's to make people realize they are either both correct, and their muse is just as bad as their foil, or they were both bullshit all along. ",
                    "score": 13,
                    "replies": [
                        {
                            "author": "SheriffMcSerious",
                            "body": "Biden came into office and signed a number of EOs which affected the oil futures and led to higher gas prices months later, when the stickers first became common. Seems a little premature to pin the blame on Trump for high priced consumer goods not even a month into his term, especially when he came in during a bird flu.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Uploft",
                                    "body": "When the tariffs pull thru, then the high prices will *actually* be his fault.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LiberalAspergers",
                            "body": "And Trump promised on the campaign trail that he would bring down grocery prices starting on day one. The president doesnt control grocery prices, but if you claim responsibility for something when campaigning, then you have to get the blame when your promise turns out to have been a lie. \n\nGranted anyone who wasnt a complete moron know it was a lie, but there are a lot of morons in the world.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "ToxicRedditMod",
                                    "body": "There sure is, fella.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bluefootedpig",
                    "body": "Left memes are often contains subversion, while right memes are funny because they are mean. That is the main difference in right wing vs left wing humor. Did you pull a little trick that requires you to know something to get the joke? or was the person just making fun of someone?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "endthepainowplz",
                    "body": "Neither side can meme, political memes are usually just as cringe as the Wendy's meme commercial.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lrlimits",
            "body": "They keep trying to attack Trump the same way he attacked them, but they do the same things they're attacking, so they look ridiculous. \n\nI'm not even a Trump supporter, but prices were awful under the Biden administration, even though they kept telling us how good the economy was.",
            "score": 11,
            "replies": [
                {
                    "author": "Uploft",
                    "body": "Prices are awful now too. What do we think Trump will do to lower them?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "lrlimits",
                            "body": "I think you're asking the right question!\n\nPeople have been saying \"End the Fed!\" and \"defund the IRS!\".  I won't pretend to know what would happen if it actually happened. \n\nI'm curious what you think.  Is that all just a euphemism for austerity?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mechanab",
            "body": "The stickers aren’t fake, but the “news” story is.",
            "score": 9,
            "replies": []
        },
        {
            "author": "ILikeBumblebees",
            "body": "The most accurate sticker would show Trump and Biden high-fiving and saying \"we did that!\"",
            "score": 9,
            "replies": []
        },
        {
            "author": "Character_Dirt159",
            "body": "I’ve seen some Biden stickers out in the wild but I haven’t seen any Trump. I imagine Soros or someone made a bunch in anticipation of the tariffs and when they got cancelled they went ahead with the story anyways.",
            "score": 8,
            "replies": []
        },
        {
            "author": "HKatzOnline",
            "body": "Yeah, food was high under BIden, I will let you know when they get back there - and that was before the forced chicken purge.",
            "score": 7,
            "replies": []
        },
        {
            "author": "AgainstSlavers",
            "body": "Somewhat true, but congress is also complicit. Also, trump's spending cuts more than outweigh those sins.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Click_My_Username",
            "body": "Just so we're clear:\n\n  \nJoe Biden orders massive stimulus spending whilst politicians shut down supply lines= \"The president has NO control over prices, nobody knows what causes inflation and no one can possibly stop it or cause it. Except corporations, they actually caused all this inflation. You can have unlimited demand without expanding supply and nothing bad will happen, supply and demand is a myth!\"  \nVs  \nThe department of agriculture orders millions of chickens culled = \"OMG this is all Trumps fault! I know it's not actually but I'm owning the conservatives because their valid complaints are totally the same as my temper tantrum and complete lack of understand of economics!\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "soonPE",
            "body": "Boring and infantile \n\nLike everything from the left",
            "score": 9,
            "replies": []
        },
        {
            "author": "mahvel50",
            "body": "Has the left ever come up with an original idea? it's almost always a copy of something the right did.",
            "score": 7,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "not one original idea.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kool_Gaymer",
            "body": "When do we tell them that the current prices are still a cause from the last admin",
            "score": 3,
            "replies": []
        },
        {
            "author": "SeaworthlessSailor",
            "body": "No American is doing that. Socialists are though.",
            "score": 5,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "If you are anti-Trump, you are anti-American.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SeaworthlessSailor",
                            "body": "I mean yea but to socialists doing that, generally speaking, they don’t like trump and hate America and the constitution. I’m not a ride or die with trump but I do support him.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "orberto",
            "body": "Yeah that month really shot it up. Good God they're desperate for anything to work in their favor.",
            "score": 5,
            "replies": []
        },
        {
            "author": "keeleon",
            "body": "Do you really doubt that no one is obsessed and unhinged enough to spend their time doing this?",
            "score": 2,
            "replies": []
        },
        {
            "author": "gatornatortater",
            "body": "So.. when did these prices go up?\n\nLast time I was in a grocery was Tuesday, and the prices were generally the same and going up at the same pace as they were in previous 3 years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WorkingCombination29",
            "body": "They have no originality. They are desperate to do to us what we had fun doing to them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PaperPigGolf",
            "body": "I feel like our subreddit is being brigadded by BS propaganda. What anarchist is low IQ enough to get feathers fluffed by this stupidity?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Double_Education_690",
            "body": "They wanna pretend they are as original as the Biden stickers on gas pumps . Also go ahead and put Biden on those grocery shelves for now .. once Trump has the prices increase from the tariffs then yes you may put them on . For now though just the Biden ones",
            "score": 2,
            "replies": []
        },
        {
            "author": "VividTomorrow7",
            "body": "Democrats are vile.",
            "score": 6,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "unlike Republicans.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "greyduk",
            "body": "My how the turntables.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Numinae",
            "body": "If this is true, it's so true theft (edit: lol, I meant \"Left\" but \"the theft\" seems just as appropriate, if not better) can't meme... they just copy the Right. Not to mention being a bunch of hypocrites; he's been president less than 3 weeks, lol.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kvakerok_v2",
            "body": "Mental retardation or bait?",
            "score": 3,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "![gif](giphy|Pd2W87rlmVjptTmvIK)",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "bill-pilgrim",
            "body": "I love that they went with the photo of him looking directly at the eclipse.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EconGuy82",
            "body": "Let’s not forget that a large part of “Bidenflation” was due to Trump massively expanding the deficit and the money supply at the end of his term.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Baller-Mcfly",
            "body": "Your brain on CNN",
            "score": 3,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "Fox is a far better news source. Even Newsmax and Breitbart are better,",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pap4MnkyB4by",
            "body": "At least Biden was given a chance to drop fuel prices.\n\nStop making feel the need to defend statist politicians.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adelie42",
            "body": "Unoriginal larping.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apprehensive-Ad186",
            "body": "So people care more about the price of mayo than the fact that tens of thousands of americans are dying of fentanyl overdose each year. got it",
            "score": 1,
            "replies": []
        },
        {
            "author": "crysaital",
            "body": "Bringing down grocery prices 25%. That's what happens when you put a 25 percent tariff on food and fertilizer right....right",
            "score": 1,
            "replies": []
        },
        {
            "author": "CablocoLoco_",
            "body": "it's like being fired in your first day because the guy before you did shit and now somehow you are the responsible",
            "score": 1,
            "replies": []
        },
        {
            "author": "thats-alotta-damage",
            "body": "Those who would give up essential Liberty, to purchase cheap groceries, deserve neither Liberty nor groceries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alurbase",
            "body": "Even if people did do that, that’s incredibly plagiaristic copying of the original meme. Seriously the left is bereft of originality",
            "score": 1,
            "replies": [
                {
                    "author": "DMBFFF",
                    "body": "totally bereft.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "clear831",
            "body": "They should have been doing this at the end of Trump's first stint and through the beginning of Bidens. Trump is part of the reason prices are crazy, can't print trillions of dollars without causing inflation",
            "score": -1,
            "replies": []
        },
        {
            "author": "BatteryChucker",
            "body": "His first term policies led to double-digit inflation. What's the surprise here again?",
            "score": -4,
            "replies": []
        },
        {
            "author": "myadsound",
            "body": "The ratio of those appearing has been directly proportionate to trump flags/bumper stickers diappearing around here. It makes sense based on what the dude campaigned on *specifically* (prices magically lowering if he took office)",
            "score": -2,
            "replies": []
        },
        {
            "author": "OJ241",
            "body": "I saw it joked about in the (definitely not) r/fluentinfinance sub but haven’t seen a sticker in the wild yet. Even still if the US reacted like Argentina with milei it makes fiscal sense that for a period during market correction due to reduced subsidies that prices across the board would rise for a period of time",
            "score": 0,
            "replies": []
        }
    ]
}