{
    "title": "The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.",
    "author": "ConquestAce",
    "subreddit": "Anarcho_Capitalism",
    "rank": 13,
    "score": 105,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 23,
    "url": "https://i.redd.it/ewyrekqh5lie1.png",
    "id": "1inbb35",
    "selftext": "",
    "comments": [
        {
            "author": "Rieux_n_Tarrou",
            "body": "Reddit is melting down\n\n![gif](giphy|mlpCWv8dVK2Ji)",
            "score": 30,
            "replies": [
                {
                    "author": "niem254",
                    "body": "the hive mind can't handle dissent.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Rieux_n_Tarrou",
                            "body": "Most of them are innocent hard working people who just want a decent life for themselves and their families.\n\nThey just don't realize that their brains are fully hijacked by parasites pumping them full of woke mind virus.\n\nAnd some of them actually are the parasites (and their minions) doing the creampieing.\n\nThis has been the case since the earliest days of Reddit, when Ghislain Maxwell (yes, Epstein's partner in crime) was reddits first 1M+ Karma superuser (moderating the biggest subreddits such as worldnews, health, etc)",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "lochlainn",
                                    "body": "The hive mind is mostly children, or adults with the emotional maturity of children.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Gemini_Of_Wallstreet",
                                    "body": "I would caution calling them “hard working”.\n\nMinus those active on hobby subs, no redditor works hard",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ConquestAce",
                                    "body": "How do you define woke?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Rieux_n_Tarrou",
                                            "body": "Woke started as a movement to get people to understand that much of our culture and institutions are de facto still guided and influenced by racism. Think: _The New Jim Crow_\n\nIt was and still is a valid critique of American society. A valuable conversation to be had. Also applies towards discrimination and injustice towards LGBT and autistic people.\n\nBut then lazy do-nothing politicians, journalists, and lawyers hijacked this valid point and usurped it into an ideological/cultural/political war in which they assert moral superiority in order to claw at money and power without having to earn it (by, say, making good decisions, being trustworthy, or producing values for society).\n\nBasically the same thing that Religious Funadmentalists do (if you don't agree with our stance and \"donate\" money to our cause then you're evil), but instead of a toxic theistic ideology, it's a toxic humanistic ideology. And instead of church and state being separate, the Woke Parasites are embedded throughout the Governance and Propaganda apparatuses.\n\nThat's the difference between Woke in the original sense and the \"Woke Mind Virus\"",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "loonygecko",
                                            "body": "I personally think of it as a push for politeness/respect that got polluted by virtue signaling, hijacked by the corrupt govt power structure, and weaponized into reverse stereotyping, unhinged accusations, and misplaced white knighting.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoTie2370",
            "body": "On of the videos about the \"boos\", the camera man calls trump a traitor and is booing. A guy close to him clearly says god bless you mr president. \n\nIts almost like 80k people all had multiple reactions.",
            "score": 8,
            "replies": []
        },
        {
            "author": "niem254",
            "body": "I don't know, am I supposed to believe that he was cheered or boo'd why don't you tell me? what I remember seeing were a couple of videos of people booing as they were recording, but when you watch videos of the macro, not local to a singular group or two you hear cheering.... shockingly in a group of 10's of thousands of people you don't have a monolith",
            "score": 16,
            "replies": [
                {
                    "author": "ConquestAce",
                    "body": "Believe what you see with your sees and what your hear with your ears.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "Not really believe everything you see or hear either. In Argentina we had something similar with Milei, he went to visit a shop that saved a Libertarian from being attacked by a mob of Peronistas that were pursuing him. In the videos the workers there took talking with Milei and recording themselves everyone was cheering and super excited about meeting him. \n\nThen some other videos started circling around where you could hear boos. Someone edited the videos and added boos.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "BrooklynRedLeg",
                                    "body": "Having seen the footage of Kyle Rittenhouse shooting drop on Twitter not even an hour after the event and concluding it was a clear case of Self-Defense, I was flabbergasted at the sheer number of shit-flinging baboons infesting every corner of the Internet who had not even watched 1 microsecond of the actual videos.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "b0ltscr0ller",
            "body": "This whole thing reminds me of the phrase \"Factual but not Truthful\" were some facts are used to support an untruthful narrative. So, yes, some booed. But the narrative is  clearly \"most people, if not everyone, booed him\" on Reddit. That's what it's implied. But clearly not true. \n\n\nHe was also cheered. So you could also say \"Trump was CHEERED FOR!\" \n\n\nClearly the truth is some cheered, some booed. At some points one vs the other was louder. It's almost like he has supporters and detractors. \n\n\nFrom all the videos I've seen, it seemed he was more cheered than booed in general. But, again, there are videos where the boos are louder/more prominent. Acoustics, timing of the video etc will all play into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MFrancisWrites",
            "body": "I love when y'all quote the socialist who warned of the moment capitalists and authoritarians would some day combine.",
            "score": 1,
            "replies": [
                {
                    "author": "ConquestAce",
                    "body": "I am not part of them. I am ironic-posting. (Also there a lot of bootlickers here, they should know that their views are not respected here)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ripyurballsoff",
            "body": "He was booed. Foreign media companies broadcasted the same coverage without the fox editing and there’s tons of loud booing. I’m sorry your dear leader was attacked and you feel the need to stand up for him though :(",
            "score": -5,
            "replies": [
                {
                    "author": "RacinRandy83x",
                    "body": "Is there a place where I can find videos of that? I looked earlier and had no luck",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ripyurballsoff",
                            "body": "He was cheered but did receive [boos as well.](https://youtube.com/shorts/8Oe9GHnPwYs?si=iB0hP2G3_nGOVp45)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "loonygecko",
                                    "body": "I did not hear 'tons' of booing, in fact it was cheers most of the way and only one instance of booing that was then over powered by more cheering.  When you say, \"he was booed\"and then insult others as being stupid and make it sound like booing was the main thing that happened, and then I find out that he was mostly cheered, I feel like you were just lying to me.  I don't even like Trump so I expected to actually hear a lot more booing as it's not like I can't understand people's issues with him.   But all your lying is just pushing people away bro.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RacinRandy83x",
            "body": "*Edit [I saw an edit of this video originally with the caption “They are booing me”](https://youtube.com/shorts/njzCXrFGh-s?si=rRwTP1IH_Fg4VRoa) I was bamboozled by the caption and a tired brain and believed that’s what he said. After going back and trying to find it again, I realized I was incorrect. [Here’s another angle of the video.](https://youtu.be/Tmg7OWLLeYU?si=S6XSNKqrNt_-EngN) both you can clearly hear him ask ‘Okay, where are we going?’\n\n*Original post below to be shamed*\n\nThere was a video from the field where Trump is taking pictures with the first responders and he walks away and clearly says ‘they’re booing at me’",
            "score": -3,
            "replies": [
                {
                    "author": "loonygecko",
                    "body": "At this point, you'll need to put up the video if you want to be taken seriously.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RacinRandy83x",
                            "body": "Edited my original comment. I misheard apparently\n\n\nHe was definitely both boo’d and cheered to some extent at the Super Bowl. Definitely need much more evidence before I believe the narrative that Fox edited in cheers. Could see the differing broadcasts having mic’s to pick up crowd noise in different places which leads to hearing just what the crowd in that specific area did.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}