{
    "title": "Humans crab mentality",
    "author": "CauliflowerBig3133",
    "subreddit": "Anarcho_Capitalism",
    "rank": 9,
    "score": 182,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 16,
    "url": "https://i.redd.it/g2a13yi70mie1.jpeg",
    "id": "1inf36a",
    "selftext": "Because humans have a crab mentality. We are not only selfish. We also compete with other humans for rare resources, mates, etc. Getting rid the more competent competitors are an effective ways to do so. \n\nDEI, income taxes, and Holocaust, and so on are motivated by that. Not going to say those are right or wrong but many people supported those sort of things. \n\nAnd commies are not the only ones complaining about inequality. \n\nMany of you are not commies. Fine. \n\nBut what do you think of a rich guy that has 10 spouses and 50 children? \n\nNot even libertarian people think it should be fine. \n\nIn fact there are so many laws that make those extremely and legally difficult. When crabs can vote they vote to make success difficult for other crabs. \n\nLife, for whatever reason, is not zero sum game like commies say. But it's far more zero sum than what libertarians believe. \n\n",
    "comments": [
        {
            "author": "RonaldoLibertad",
            "body": "If a man wants 10 wives and 50 children, that is fine by me, as long as it is voluntary and he pays for it all himself.",
            "score": 16,
            "replies": []
        },
        {
            "author": "ExcitementBetter5485",
            "body": "What makes you say that libertarians are against a rich guy having 10 spouses and 50 kids? I've only seen people complain about people having far more kids than they can support and how they only do so because of their reliance on welfare.",
            "score": 13,
            "replies": []
        },
        {
            "author": "OppressorOppressed",
            "body": "Quote in image is interesting, rambling above image is incoherent drivel.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Vinylware",
            "body": "What are you getting at here? I did not understand a single thing you said because of how incoherent it is.",
            "score": 5,
            "replies": [
                {
                    "author": "Rieux_n_Tarrou",
                    "body": "That is because OP is confused. The quote in the image is spot on, tho",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "rasputin777",
            "body": "A better way to put it: capitalism has an unequal distribution of wealth. Socialism has an equal distribution of poverty.",
            "score": 5,
            "replies": [
                {
                    "author": "deaconxblues",
                    "body": "I like this framing. Ironically, though, there is usually a privileged class under socialism also. The leadership class and high-ranking military and bureaucrats make out OK while the proles starve. North Korea has limped along this way for quite a while.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zealousideal-Skin655",
                            "body": "They seem to be doing okay in Norway.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "Is that the Norway that ranks [10th in the world on the Index of Economic Freedom](https://www.heritage.org/index/pages/country-pages/norway) (in comparison to the US at 25th place) in part because of its \"strong protection of property rights\" and low regulatory burden?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "deaconxblues",
                                    "body": "I’m talking about actual socialism. State socialism. Not the mixed economy that basically every developed country has, including the US, btw. The difference between Norway and the US is a difference of degree, not kind.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RonaldoLibertad",
            "body": "Based Higgs is based Higgs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElderberryPi",
            "body": "> But what do you think of a rich guy that has 10 spouses and 50 children?\n\nI think it's a bad idea on a socioeconomic level, but have no problem with it as long as it's voluntary. I don't have to live in their neighbourhood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SrboBleya",
            "body": "I do not think about such a person. he is the one with the problem, lol\n\n\nSpeaking of crabs...\n\n\n\nI think if you want to \"suceed\" you just gotta do things or go places where no one has before. \n\n\nThis comes with some uncertainty, ya know? \n\n\nSo people will make sure to inform you that you can fail so you feel discouraged. \n\n\nI think this an example of the crab mentality you mentioned.\n\n\nAnd then those words of discouragment may take a toll and the crabs may win, especially if you are facing obstacles in your journey, which is a normal part of life.\n\n\n\nSo it is important to have a growth mindset instead of a fixed mindset in the face of obstacles. The crabs may very well lose then \n\n\n\nAnd yea many are crabs in an effort to protect their egos. It is somewhat natural.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-One9890",
            "body": "Does anyone else thing the crabs in a bucket thing is really just a misunderstanding?\nLike each crab likely has no idea what influence their actions will have on other crabs. They aren't pulling other crabs back in, they just think they can climb out using that crab. I dont know that crabs rly have a concept of weight and strength and such",
            "score": 1,
            "replies": [
                {
                    "author": "ClimbRockSand",
                    "body": "many humans have the same understanding of the world as a crab.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "No-One9890",
                            "body": "But it's important to note it's not spiteful",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}