{
    "title": "Musk said the goal is to cut 2 Trillion $ in spending. That’s not nearly enough",
    "author": "Shoot_2_Thrill",
    "subreddit": "Anarcho_Capitalism",
    "rank": 10,
    "score": 11,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1inuydc/musk_said_the_goal_is_to_cut_2_trillion_in/",
    "id": "1inuydc",
    "selftext": "The federal government is spending 7.19 Trillion per year right now. If we cut it back to 5.19 trillion, that would bring us back to… 2020 levels. How is that ok? How is that the stated goal? At that point the spending and debt had exploded to unacceptable level. Two Trillion will barely put a dent into the problem\n\nHere’s the Federal Spending over the years:\n\n1980) 0.524T\n\n1990) 1.157T\n\n2000) 1.735T\n\n2004) 2.176T\n\n2008) 2.823T\n\n2012) 3.595T\n\n2016) 3.750T\n\n2020) 5.603T\n\n2025) 7.118\n\nHere’s the Federal Debt over the years\n\n1980) 0.864T\n\n1990) 2.907T\n\n2000) 5.734T\n\n2004) 7.071T\n\n2008) 9.799T\n\n2012) 14.903T\n\n2016) 19.316T\n\n2020) 25.733T\n\n2025) 36.471T\n\nAnd here’s the total government spending (Federal + State + Local):\n\n1980) 0.844T\n\n1990) 1.927T\n\n2000) 3.132T\n\n2004) 3.961T\n\n2008) 5.444T\n\n2012) 6.161T\n\n2016) 6.699T\n\n2020) 9.281T\n\n2025) 17.786T (!!!)\n\nWe went from spending $3,456 per person is the U.S. in 1980 to spending $50,261 PER PERSON. The government is spending over $200,000 per year for my family of 4. How much value am I getting from that spending? They can buy us a house every year if they wanted to. Want a waste\n\n2T at this point is a drop in the bucket. It’s not fixing anything here. We need major surgery. We need to go back to 2000 levels at least. That’s 3.265T when you adjust for inflation, and which would be an almost 4T cut. And that’s just the federal level. We need another 14.5T cut in total government spending (would be 12T cut after inflation). The states have to do their part. \n\nOn the flip side, anyone saying that cutting 2T will mean the government can’t function… um, I direct you to 2020. Going back to that isn’t that big a deal. Stop complaining liberals!",
    "comments": [
        {
            "author": "ganonred",
            "body": "Start somewhere. Inflation aka currency worthlessness also drove up our spending, so cutting $2T would be a good start. Spending shouldn't be the only metric, it should actually be on entire agencies -ELIMINATED- because like cancer, if you don't remove it entirely it WILL come back.",
            "score": 9,
            "replies": []
        },
        {
            "author": "myadsound",
            "body": "Wait till you figure out hes just spouting bullshit and all those funds actually didnt end up getting cut.\n\nRemember how the twitter files were assuredly going to reveal so much?! And then poof, nothing rose to the claims made and it all quietly went away!\n\n\nIts funny watching him rinse the same schtick over and over",
            "score": 5,
            "replies": []
        },
        {
            "author": "StedeBonnet1",
            "body": "The budget deficit in 2024 was $1.8 Trillion. Reducing spending by $2 Trillion means we have a surplus. That is a start.",
            "score": 3,
            "replies": []
        },
        {
            "author": "standardcivilian",
            "body": "Ya man our country has stage IV cancer and needs chemotherapy. A lumpectomy here and there isnt a solution but hey its in the right direction.",
            "score": 2,
            "replies": []
        },
        {
            "author": "heresyforfunnprofit",
            "body": "Gotta start somewhere. Don’t make the perfect the enemy of the good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Will-Forget-Password",
            "body": "Look at the full picture. Revenue and expense. As long as expense is lower than revenue, progress is being made. (This is not an endorsement of any government.)",
            "score": 0,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "I would have preferred harris to win and destroy it all in a few years than limp along for another decade.",
            "score": 0,
            "replies": []
        }
    ]
}