{
    "title": "Trump shrugs off Libertarianism and might hit Argentina with tariffs",
    "author": "-Longchamps-",
    "subreddit": "Anarcho_Capitalism",
    "rank": 7,
    "score": 18,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 14,
    "url": "https://i.redd.it/ylamdzekgqie1.png",
    "id": "1inukml",
    "selftext": "",
    "comments": [
        {
            "author": "deefop",
            "body": "The guy has literally never been a libertarian.\n\nIt's a mark of how fucking broken the current zeitgeist is when the average moron thinks auditing the most blatant government money laundering is \"radical libertarianism\" as opposed to simply auditing the innumerable money laundering organizations that have been stood up over the last several decades.",
            "score": 38,
            "replies": []
        },
        {
            "author": "Brutus__Beefcake",
            "body": "The goal shouldn’t be for Trump to be the first libertarian President or be mad if he is / isn’t a true one. The goal should be to get him to help shift the Overton window towards more libertarian politicians.",
            "score": 20,
            "replies": [
                {
                    "author": "CrowBot99",
                    "body": "No, yes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ghost_Turd",
            "body": "Nobody thinks Trump is now or has ever been a libertarian.",
            "score": 35,
            "replies": [
                {
                    "author": "Midnight-Bake",
                    "body": "The former chair of the LNC touted him to the liberterian party as being liberterian and he himself called himself a liberterian.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CrowBot99",
                            "body": "And I'm an aardvaark.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Secretsfrombeyond79",
                            "body": "Didn't that one steal funds from the party and was expelled/left ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ILikeBumblebees",
            "body": "Corrected headline: \"Non-libertarian Trump might hit Americans with higher taxes on products they buy from sellers in Argentina\".",
            "score": 18,
            "replies": []
        },
        {
            "author": "Spats_McGee",
            "body": "So much for Milei's \"influence\"....\n\nRemember kids, Trump's particular brand of transactional politics wins out over \"principle\" any day of the week.",
            "score": 13,
            "replies": [
                {
                    "author": "myadsound",
                    "body": "Seems like if milei had dissolved the state this could have been easily avoided",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "montero65",
                    "body": "\"BuT I tHouGht Milei waS foLloWinG TruMpS plaYbOok?\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "m3lodiaa",
                    "body": "B..but I thought Trump and Milei are part of the new global fascist shadow government?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Secretsfrombeyond79",
            "body": "Milei is traveling to the USA in the 19 of February to negotiate a free trade treaty. Since Trump can't simply make exceptions because someone is his friend I'll withhold my opinion on him being a backstabbing piece of shit until a good news about those negotiations comes up.\n\nStill Trump hitting everyone with Taxes including Argentina was within my predictions as well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "krazay88",
            "body": "Where are all the usual trump conservative shills now??",
            "score": 1,
            "replies": []
        }
    ]
}