{
    "title": "[US] Im an artist on tiktok and got my first commission request.",
    "author": "Puzzleheaded_Cat5456",
    "subreddit": "Scams",
    "rank": 3,
    "score": 20,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/gallery/1je8qar",
    "id": "1je8qar",
    "selftext": "The person who asked for a commission is offering to pay $700 for 3 drawings of his kids that are fully colored, shaded, and have full backgrounds. I told him my price for all three would be about $105 ($35 per comm), but he seems adamant to pay the $700. He started the conversation over Tiktok before asking to move over to Discord, then the first thing he asked me was where I was from. I ignored the question because it just felt like a red flag, but he kept pushing so I just told him im from the Us. He asked where I take payment and I said paypal, and when i gave him my username and email to pay, he never responded. I havent gotten any emails about a login request, and this feels just shady overall. im not sure if this is a scam and I will be sent counterfeit money, or if he’ll ask me for money back when I finish the commission and the counterfeit money will just be taken from my actual bank account. Im desperate for commissions, but I dont know if I should trust this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/Puzzleheaded_Cat5456 - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMoreBeer",
            "body": "Moving to Discord is a red flag. The weird payment systems is a big red flag. Offering you more money than you ask for is a \\*huge\\* red flag. This is an !artist scam.",
            "score": 131,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/TheMoreBeer, AutoModerator has been summoned to explain the Artist or NFT scam.\n\nThis is a variant of the advance fee scam. The scammer will often use a stolen social media account to increase their credibility. A scammer will contact an artist, and ask to purchase one of their works of art (paintings, digital media or photos), and they will offer a generous sum of money. It can take three forms: a fake payment email (in which you're instructed to pay some fee to receive the money), a fake check (in which you're asked to forward some money elsewhere), or a fake NFT minting scam.\n\nIn this latest variant, the scammer suggests to buy the art piece in NFT form. The victim is instructed to mint the NFT in a fake minting website, which charges money for the fuel (as any NFT minting service does). The difference is, the scammers control this fake website and run away with your money. After you mint the NFT, the scammer disappears without paying for the piece.\n\nThis is a scam where a scammer impersonates a client. For the scam where a scammer impersonates an artist, call the automoderator trigger (muse).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "WarpedPerspectiv",
            "body": "OP, what reasonable person would be given a price of 105 and respond with how they're gonna pay 700 instead instead of being thrilled it'd be way less than their budget?",
            "score": 48,
            "replies": [
                {
                    "author": "Puzzleheaded_Cat5456",
                    "body": "I see what you mean, in my defense though, this is my first commission ever and I’m honestly just trying to see what’s gonna happen with this, like what he’s gonna try to do from here if that makes sense.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "WarpedPerspectiv",
                            "body": "It won't matter as it's a scam. They'll either get free art out of you, the pay will be fraudulent and clawed back, or they might \"send too much accidentally\" and ask you to send them some of it back. Last one is a whole different kind of scam I forget the name of, but typically it works by relying on money being sent and not caught by fraud departments or fully cleared, victim sends money back, then gets hit with all the sent money being credited from their account when it's reversed. Then you're out the original money that was sent, and the amount you also sent as well. But they're banking on you being excited to get 700 dollars.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Puzzleheaded_Cat5456",
                                    "body": "Yeah, i was excited at first before realizing it was most likely a scam and running here to make sure before blocking them. I do know better than to send any money or art to them though, and if they sent money i was going to wait a few days before doing anything to see if it gets pulled back automatically for being fraudulent.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "elkab0ng",
                                            "body": "Since they were big on discord, Google “discord report scam”, that might have been their plan B. \n\n(Short version, they fake that your account has been reported “accidentally” and end up tricking people into losing control of their accounts)",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "GupGup",
                                            "body": "Fraudulent payments can be pulled back weeks or even months later.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Puzzleheaded_Cat5456",
                                                    "body": "I didnt know that, thank you for letting me know!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Apprehensive_Fun1078",
                            "body": "Unstandably you're excited, but don't let that fog your common sense. Your hunch is correct.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "FlipMeynard",
                            "body": "You are going to get scammed is what is going to happen",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Puzzleheaded_Cat5456",
                                    "body": "I moreso meant how they were going to try to scam me (ask for money back, give me counterfeit money, ect)",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "berneellllllllllllvu",
                                            "body": "They’re going to send you a payment with stolen details to your paypal or whatever, then probably ask for some of it back. That payment will be found fraudulent and be charged back leaving you with nothing, or negative money if you paid them back any of the “overage”",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SFAdminLife",
                            "body": "It’s not your first commission. It’s a scam.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tsdguy",
                            "body": "Sigh. You really are gonna get in trouble on TikTok",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Theba-Chiddero",
            "body": "You saw the signs of a scam, which is great. As you suspected, the money he gives you will be fake, or stolen.\n\nThey don't really care about your work, sadly. It was all a scam to steal your money. And these guys are not very creative -- they always want drawings of their \"family\" or their \"dog\" (reverse image search will often show that the photos are  taken from someone else's FB or IG page).\n\nThere are a lot of scammers out there who prey on content creators -- musicians artists photographers videographers etc. \n\nIf you want to get paid for your work, you need to find out the best and most secure ways to get paid, and stick to that. You are the seller, you set the terms. Don't let a buyer dictate to you. If you know and prefer to use a specific money transfer type, and someone tells you they can't, you're better off not doing the work for them.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Cat5456",
            "body": "Update: thank you all for the help, ive blocked them and reported them on discord and tiktok!",
            "score": 13,
            "replies": []
        },
        {
            "author": "Helostopper",
            "body": "Could be !fakepayment or just a choosing begger. Most scammers want to pay more.\n\n\nMisread they are trying to pay more 🤦‍♀️ 100% scam.",
            "score": 7,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/Helostopper, AutoModerator has been summoned to explain the Fake payment scam.\n\nThe fake payment scam occurs when someone tries to trick you into thinking that you have received a legitimate payment when no such payment has been made. The most common method they use is sending you an email meant to look like a payment confirmation. In some cases the emails will be almost indistinguishable to a legitimate email sent by the payment service. Scammers are known to also show you screenshots instead of an email. Never trust a screenshot a stranger shows you, because it is probably doctored.\n\nScammers [spoof](https://en.wikipedia.org/wiki/Email_spoofing) the 'from' email to match an official address, and make you think you received a legitimate email. To combat a fake payment scam, verify online payments by logging in directly to the service. Do not check your junk folder, and do not assume a payment is legitimate based on an email alone. If a payment isn't reflected on your account and the person you are dealing with insists they have sent it, call support and ask about it. [Here](https://i.imgur.com/X9xn8uw.jpg) is an image of a scammer trying to pull off a fake payment scam. There is also a variant of the fake payment scam where you will receive a legitimate but fraudulent payment.\n\nA variant of the fake payment email is just an advance fee scam: the scammer tries to convince you that your funds are on hold, and that you have to upgrade your account by sending the scammer some money to authorize the payment. No payment processor works like this. If you think you're dealing with a scammer, you're probably right. Always trust your gut.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apprehensive_Fun1078",
            "body": "Oh yeah. It's a scam. They want the info on PayPal to establish \"friends and family\". That way you can't claim fraud or scam cuz well, they're friends and family. Someone tried that with me when I sent them a screenshot of the QR code. They asked me for the same info, when I told them they didn't need it with the QR code I didn't hear from them again.  And there's no way they're paying $700 on a price of $105.  And why are they so concerned where you're from?",
            "score": 5,
            "replies": [
                {
                    "author": "Puzzleheaded_Cat5456",
                    "body": "Yeah, I sent a QR code instead of my email and he was saying it “didnt work”",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "filthyheartbadger",
                    "body": "The US still uses checks, most other places don’t, maybe he was choosing which payment type scam to run. After refusing the QR for whatever reason.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Apprehensive_Fun1078",
                            "body": "Possibly, in my situation though, as soon as I told them they didn't need my email address with the QR code, i got ghosted....thankfully.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sandman4999",
            "body": "This is a scam OP",
            "score": 4,
            "replies": []
        },
        {
            "author": "Theba-Chiddero",
            "body": "An artist posted here yesterday, who went further into the scam (but didn't lose money) -- read the story to see the next steps in the scam:\n\nhttps://www.reddit.com/r/Scams/s/mHxmUlRmIY",
            "score": 4,
            "replies": []
        },
        {
            "author": "Repulsive-Plan1795",
            "body": "Yea it’s likely a scam as the red flag for me is asking to move to discord why couldn’t it be kept on TikTok",
            "score": 3,
            "replies": []
        },
        {
            "author": "Butterman30",
            "body": "Them offering to pay more is basically them trying to make more money off of you",
            "score": 3,
            "replies": []
        },
        {
            "author": "Admirable_Proxy",
            "body": "Makes sure you have 2FA on your account since you shared your username and email with him.",
            "score": 3,
            "replies": [
                {
                    "author": "Trueslyforaniceguy",
                    "body": "Bump. 💯 \n\nEven the request for the email is a sign of a scam.  They need to be able to send you the fake payment email or the fake ‘expand your account’ nonsense …",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "t-tekin",
            "body": "Normally They don’t need your PayPal email, just your username.\n\nProbably they sent you a fake payment email looking like coming from PayPal. But got stuck in your spam folder.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal_Care807",
            "body": "Feels like a scam, I commissioned someone who doesn't typically do commissions before they said they didn't think their art was that good, I said I'd give them whatever price and I'd pay for the shipping, came out to 70 dollars, they talked to their dad and I paid them after we worked on the initial sketches of the art, I sent them an Amazon package with the sketchbooks I wanted them to do the art on the cover of. \n\nAlso I want to say I filled up those sketchbooks fully and I still have them to this day. \n\nThis person is likely going to ask for you to send the art before they pay you, it'll be a waste of time for you and they can sell it and they won't pay you. Your best bet is to go over a rough sketch of it with them and ask for the payment or partial payment, make sure it goes through before you finish working on it and when you send the final put a huge copywrite mark over it (slightly transparent but not easy to remove), do a pattern and make a pattern on the artwork itself so they can't just use a brush to cover it, when they pay you remove the copywrite mark. If you've seen videos of people saying \"do this so AI can't steal your art\" it's not actually for AI, it's for humans.",
            "score": 1,
            "replies": [
                {
                    "author": "filthyheartbadger",
                    "body": "Unfortunately these types of scammers have no interest in the art, they just want to run a fake payment scam. Doing all this would be a huge waste of OP’s time, but the scammers would never engage to this extent, they will just keep yammering about the payment.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Zealousideal_Care807",
                            "body": "True, I never really knew the point of those scams. But if you do partial payments up front you'll know if that part of it went through. It definitely takes a while to get art done",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}