{
    "title": "[US] Credit Card Processing With Unbelievably Good Rates Offered to Small Business (@elitebusinesssolutions on FB)",
    "author": "ACoolGuyWhoIsSoCool",
    "subreddit": "Scams",
    "rank": 10,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Scams/comments/1jeab9l/us_credit_card_processing_with_unbelievably_good/",
    "id": "1jeab9l",
    "selftext": "Hi everyone, I own a small business, and frequently have salespeople come in for credit card processing, offering much better rates than I see offered from any of the major credit card processing companies. Somebody came in today and handed me a business card for their business (Elite Business Solutions), which didn't even have a website on it, but had a Facebook link which I put in the title of this thread. I look them up and they just look like an obscure business - how would a little business like this even be able to get into the business of offering credit card processing to companies like mine, nevermind at much more competitive rates than the big national companies? \n\nI totally get scammy vibes from these folks, as they come in at least every couple months from similar companies, always with insanely good rates. There's no way I would trust all of my business's incoming revenues to some no-name company that doesn't even have a website - what if they just disappeared with all my credit card transactions?\n\nBut I do wonder if this is a known scam of some sort, and if so, how it works? Is it as simple as I route my credit cards to process through their bank account, believing I have a good deal, and then they just take off with my credit card deposits and that's it? Seems weird that they would show up in-person at my shop, on my cameras and everything. Or are they a legit business? I searched in the common scams thread and didn't see anything about this.\n\nI read and am trying to follow the How To Write a Good Post thing, so hopefully I did it right. Thank you in advance for the input!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/ACoolGuyWhoIsSoCool - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dofolo",
            "body": "Its all commission scams. They get a bonus on switching you over.\n\n\nIgnore all sales (besides customers) that walk into your door. Its never beneficial to you or your business.",
            "score": 5,
            "replies": [
                {
                    "author": "ACoolGuyWhoIsSoCool",
                    "body": "Yes, I always do. So for the scam they get the commission for switching me over, but is what they're promising actually legit? Because the numbers seem too good to be true. I definitely understand, \"If it's too good to be true, that's because it is,\" but didn't know what the 'switch' is on this bait&switch. Thank you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tsdguy",
                            "body": "Sales people don’t have to tell the truth. This has been legal for a long time - it’s sales talk. It’s your responsibility to know the actual terms. \n\nHe says lots of good things and then you sign a contract which you don’t read that has very bad terms and you’re stuck. It’s like buying a used car.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ACoolGuyWhoIsSoCool",
                                    "body": "Yeesh, that makes sense. They can say whatever you want and as long as you sign up they get their commission.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}