{
    "title": "Someone just called me ..",
    "author": "alwaysbanned5150",
    "subreddit": "Scams",
    "rank": 6,
    "score": 5,
    "upvote_ratio": 0.66,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Scams/comments/1jechw6/someone_just_called_me/",
    "id": "1jechw6",
    "selftext": "So someone just called me saying they are mediating for Gamestop from 5 years ago for over $3k and that if I didn't mediate to stay out of court they would lien my paycheck and bank account . Ive never had an account with game stop and i confirmed with comenity bank so no one stole my info and this was obviously a scam.\n\nThey first called out of the blue saying if it was collections I was at work and I hung up. They called me back from a different number saying I dont think it's collections let me give you a case number . Then they gave me the case number and an 877 number . They had my name and my last 4 of my social.  Stating that if I didn't mediate to stay out of court they would start taking money from my check etc\n\nIt scared me because they did have my last 4 of the social and my name and they sounded pretty thorough and had me call an 877 number.  Said they were Abraham's and associates. Even picked a nice Jewish law firm name lol.\n\nWhat's the best move for me to take here?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/alwaysbanned5150 - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CIAMom420",
            "body": "!debt. Stop talking to them. If they're legitimate, they'll send you something in the mail.\n\nThey can't garnish your wages unless they sue you, win their case, get another court hearing, go before a judge, make their case for why your wages should be garnished, and get a ruling. There's a process. They don't just do it. The fact that they're immediately jumping to threatening wage garnishment strongly implies they're full of shit.\n\nIf it's five years ago, there's a decent likelihood it's beyond the statute of limitations and not recoverable at all.",
            "score": 23,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/CIAMom420, AutoModerator has been summoned to explain the Debt collection scam.\n\nIf you are positive the debt you're being accused of has never existed or has already been resolved, this is a scam. Keep in mind that companies can change names and debts can be sold, so not recognizing the company you owe isn't necessarily proof of a scam; you should call the company where the debt originated to confirm a debt exists. Be mindful of debt collection laws in your state or country before engaging in any conversation with a debt collection agency, to avoid being liable for debts that may be outside their statute of limitations for collections.\n\nLike legitimate debt collectors, scam collectors may have access to your SSN, address, names of your contacts, etc. from a data breach. They may be calling your family, friends and employer relentlessly with invasive or embarrassing questions about you. They may send you threatening letters, emails and texts that state you will be sued or arrested if you don't immediately pay them X amount of dollars. These are scare tactics to rush you into paying before you have a chance to consider the situation logically. Instruct all of your contacts that this is fraud and to block the calls. If the scammers know a lot about you, you have potentially been involved in a serious data breach.\n\nHere's a guide from r/identityTheft that covers the basics of credit freeze, IRS pins, even replacement SSN and police reports: https://www.reddit.com/r/IdentityTheft/comments/pqb1za/identity_theft_recovery_101/\n\nYou need to freeze your credit through the credit bureaus: https://www.reddit.com/r/IdentityTheft/comments/uvv3ij/psa_freezing_your_three_main_credit_reports_is/ and freeze your debit line with Chex Systems https://www.chexsystems.com/security-freeze/place-freeze\n\nReport correctly referenced documents (SSN, drivers license, credit card) as stolen to the respective agencies. If you are unsure of how to move forward, request guidance from local law enforcement. Credit to user l0john51 for this script.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "alwaysbanned5150",
                    "body": "I never even owed it. I never had a game stop card . I also called comenity bank to verify my identity has never been stolen\n\nThe 4 things that were fishy..there was 4 phone numbers involved, when they called they said they represented gamestop. And not the card that issues for game stop comenity bank. They started with the threats the second I resisted . Also, a bank is gonna sell the debt if it was real and not hire a mediating company yo keep it \"out of court\" and if it hasn't been to court yet how are you garnishing my wages and bank account at the end of the month.\n\nWhat was scary is they used an official sounding case number and the last number they had me call was an 877 number and I dont know any app that can give you a fake 887 number",
                    "score": 1,
                    "replies": [
                        {
                            "author": "farmerben02",
                            "body": "Anyone can buy an 800 (or 877) number. Any VOIP provider will sign you up for $10-15 a month. Anyone can invent a fake case number that looks real but doesn't exist. This is just part of the script, don't worry, just block and ignore.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Most-Artichoke6184",
            "body": "Just hang up and block the number.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Kindly_Skin6877",
            "body": "Lock your credit and don’t respond!",
            "score": 6,
            "replies": [
                {
                    "author": "alwaysbanned5150",
                    "body": "Can I lock and unlock if I need to later?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Kindly_Skin6877",
                            "body": "Yes! You can even do it on an app on your phone. It’s like 2FA for credit stuff.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Theba-Chiddero",
            "body": "Gamestop wasn't calling you, obviously, since you never had an account with them. This is a scam, to threaten you with nonexistent legal action, and get you to give them money.\n\nAny phone number can be faked. It's called spoofing. Scam calls and texts can fake any phone number, anywhere. This means that Caller ID is not reliable. \n\nScammers use spoofing technology to fake the incoming number, so the number they call from can appear to be any number. Caller ID could show a nearby number, your bank, or your local police -- any number. But they are actually calling from somewhere else, possibly from somewhere in Asia or Africa, from a big scam call center.\n\nIts best to not answer calls from unknown numbers. But, if you answer a call that appears to be from a lawyer, or your bank, or police: say goodbye and hang up. Look up the actual contact information on the official website. And don't call a number in Google search results -- top result may be a bogus phone number (paid for by scammers).\n\nSimilarly, if you get a text message from your bank, don't call the number in the message. And don't click any links. Look up the real contact information on the official website.\n\nAlso, a sending email address can be forged/ spoofed.\n\nHow do they get your name? Your name, address, phone number, and past addresses are all publicly available, and have been forever. There are several data aggregation sites like Truecaller and Beenverified that let anybody do a phone lookup, and return your name, address, email, former addresses, and relatives. \n\nLast 4 of SSN, and other data, can come from data leaks, and all of us have had data leaked.",
            "score": 7,
            "replies": [
                {
                    "author": "alwaysbanned5150",
                    "body": "What scared me is i called them and let them hear i was recording the call and they didn't shake. They said the name of who they were calling from, they said since they spoke to me earlier they moved it to litigation and I could dispute it out of the county in which i live (they said the county by name courthouse) it'd so scary is called back comenity and they assumed me no one took a credit card out in my name and they have no information on me ever in their systems.\n\n\nThey got me freaked out. This is definitely a professional hit. This isn't some call center in India.\n\nIm worried that they have me crossed over with someone else.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Theba-Chiddero",
                            "body": "Scam call centers **are** professional. They have people who work every day, using computers, phone systems, and other technology. They build fake websites for crypto investment scams and fake shopping sites. They make videos of women and men, for romance scams. The bigger centers are compounds in southeast Asia, run by Chinese criminals, where people live and work, running a variety of scams all over the world: debt, sextortion, crypto trading, fake jobs, and more. It's big business, reportedly $64 billion per year, worldwide.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "alwaysbanned5150",
                                    "body": "Plus the shit would hit my credit and why would game stop even wait 5 years to pursue a mediation and put it into a court.\n\nThere so much illogical bit it's still got me all fucked up",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "alwaysbanned5150",
                                    "body": "I've never owed this company money . I dont know why I'm scared. I never owed the money. But they didn't shake when they knew I was recording them . \n\nBut another strange thing is that I had a case manager earlier , and now they just transfered me to some other woman (who wasnt the same woman) who said oh we spoke to you earlier so we moved it over to litigation so you can dispute it out of thr court house (they said my county's name before the courthouse) \n\nThey sound like an actual company. So much so I thought I was the victim of identity fraud but the people who handle gamestop said nope I'm nowhere in their system .\n\nIm still so freaked out and I dont know why\n I swear if I knew for a fact I didn't owe it id be super stressed.\n\nMy credit wasn't even good enough to have $3600 in credit from gamestop.\n\nDoes gamestop even give someone that much credit on a credit card?\n\nIt sounds wild.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "realbobenray",
            "body": "The last four of your social plus your phone number are very commonly included in online databases that get stolen. They bought one of those and are going down the list.",
            "score": 2,
            "replies": []
        },
        {
            "author": "belsonc",
            "body": ">a nice Jewish law firm name\n\nI don't follow - what does that mean?",
            "score": 1,
            "replies": [
                {
                    "author": "alwaysbanned5150",
                    "body": "As a Jew I am aware we make the best doctor's and lawyers lol.\n\nSo if you're gonna make up a name and have it be really scary you'd be smart to pick an Italian or a Jew name for a fake lawyers office.\n\nRelax , it wasn't an insult and I'm a Jew",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slogive1",
            "body": "Yeah. Fear is how they suck you in. Block and ignore.",
            "score": 1,
            "replies": []
        }
    ]
}