{
    "title": "[UK] Received package & inside was just a note with a tracking number?",
    "author": "KittyGrewAMoustache",
    "subreddit": "Scams",
    "rank": 14,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Scams/comments/1jedh8h/uk_received_package_inside_was_just_a_note_with_a/",
    "id": "1jedh8h",
    "selftext": "Received a small padded envelope delivered via Royal Mail 24 hr tracked service. Inside was just a strip of paper that said on it:\n\n“Dear Customer,\n\nPlease note we are unable to ship your order via this courier. We have used an alternative courier. Please see tracking details below”\n\nThen there’s a tracking number with the last 4 digits written by hand, it says it’s a Yodel tracking number.\n\nIt’s signed “Regards Admin Team”\n\nSo I’m not expecting an order that I can think of, and whenever I’ve ordered anything I give my email address so wouldn’t they just email? Why send a package? There is also no reference to an order number, company (other than Yodel the delivery company) or what the order is.\n\nSo weird. So is this somehow some kind of scam? What does it mean? Why would someone pay to send that note to my house?\n\nI’ve not looked up the tracking number because I’m wary although I’m not sure what looking it up could do.\n\nAny insight would be appreciated!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/KittyGrewAMoustache - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AngelOfLight",
            "body": "Looks like it was just sent to the wrong address. This is a scam, but you aren't the intended victim. This is a shipping scam - somebody buys an item which the \"seller\" has no intention of sending. They mail a notice like this to get the buyer to wait longer so that the time limit to file a claim runs out. It works more often than you might think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "doublelxp",
            "body": "It could be !brushing",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/doublelxp, AutoModerator has been summoned to explain the Brushing or Direct shipping scam.\n\nThe scammer is creating and shipping out fake orders in order to both boost order numbers and place false verified reviews. [Here](https://en.wikipedia.org/wiki/Brushing) is the Wikipedia page that explains brushing, and [here](https://www.forbes.com/sites/wadeshepard/2017/11/27/americans-are-receiving-unordered-parcels-from-chinese-e-criminals-and-cant-do-anything-about-it/#dc1df7c73daa) is a news article from Forbes about the scheme. Receiving packages as part of brushing doesn't mean that your private information is compromised, if the items are relatively inexpensive.\n\nIf instead you received an expensive item, such as electronics or something like that, your account may be compromised. Log into your account and see if there are orders under your name. A scammer that has access to your account would instead be using your credit card, or a stolen credit card to purchase things in your name and ship them, and then have a porch thief pick them up from your door.\n\nFor example, when Amazon accounts are compromised, orders can be archived by the thieves to hide their tracks. Go to https://amazon.com/gp/your-account/order-history?orderFilter=archived to find any of those. If that list is clean, it means that this order didn't originate through your account.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}