{
    "title": "[CAN] What could they want from sending me money?",
    "author": "goldenretrivarr",
    "subreddit": "Scams",
    "rank": 16,
    "score": 2,
    "upvote_ratio": 0.63,
    "num_comments (reported by reddit)": 8,
    "url": "https://i.redd.it/j96moihrzhpe1.jpeg",
    "id": "1jed7lp",
    "selftext": "I got DM’s from someone after posting some selfies. They said they want to send me money for being pretty. I said no, they begged. They didn’t want any bank info just my pay pal or cash app. I explained I don’t send nudes, and they said they don’t want nudes they just want to send money. \n\nI asked about crypto to see if it would change their response and they seem to be okay with crypto. \n\nWhat could this be? I really want the money lolll but I don’t wanna fall for any scam. I know when something is too good to be true. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/goldenretrivarr - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "vitaminxzy",
            "body": "Follows the same as the !sugar scam - it'll most likely be upfront payments they claim YOU need to pay to get fake money",
            "score": 13,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/vitaminxzy, AutoModerator has been summoned to explain the Sugar daddy or momma scam.\n\nSugar dad/daddy/mom/momma scams are [very common](https://www.fraud.org/sugarbaby_alert) and usually come in two varieties: fake check style scams, and advance-fee scams. Fake check style scams involve the scammer making a fraudulent payment to you that will later be reversed, and then you making some sort of payment to the scammer that will not be reversed. Common examples include the scammer sending you a fake check and asking you to buy gift cards, or to send money via Western Union, or to purchase Bitcoins. Another common example involves the sugar scammer offering to pay your bills, or offering you banking information that you will use to pay off your bills. These bank accounts are stolen and the innocent victim will reverse the charge when they notice the fraud.\n\nThe second variety of sugar scammers use advance-fee scams, where they offer you money but require you to pay first. They may ask for you to pay them to prove that you are loyal, or they may require you to pay a processing fee. It's common for sugar scammers to send spoofed emails that look like they came from services like PayPal or CashApp that will inform you that you have received money, but that also ask for a processing fee before the funds are released.\n\nIn the real world, sugar babies are sex workers that engage in in-person sexual encounters with their clients. **We do not recommend that people try to be a sugar baby, but if this is what you are looking into, check out the following subreddits for information on how to be safe: r/SugarLifestyleForum/ and /r/SexWorkers**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Theba-Chiddero",
            "body": "He's lying. Anybody who says they want to give you money for \"being pretty\" or for chatting with them, or for pictures of your feet / nails / whatever, is actually a scammer, who will take your money. The offer of free money is always a scam to get your money.\n\nThere are several ways they can get your money, one is to ask you for 50 for \"verification \" before they send you 2000. You give them 50, and they disappear.\n\nAnother scenario: They give you this generous gift, say 500. Then they ask you to send 200 to their favorite charity (which is actually them). So, you think: why not? You still have 300. Oops, you don't really, because PayPal takes back the 500 because it's stolen. End result: you gave a scammer 200, and you have nothing.",
            "score": 9,
            "replies": []
        },
        {
            "author": "RacerX200",
            "body": "Nobody ever gives away money to unknown people. People who claim to are really trying to take your money for them.",
            "score": 7,
            "replies": []
        },
        {
            "author": "grptrt",
            "body": "There will be some sort of fee you need to pay to release the funds.  You pay the fee(s) and then get ghosted.",
            "score": 5,
            "replies": []
        },
        {
            "author": "devilsadvocate1966",
            "body": "They want to 'send you money' digitally, which can be retracted, then have you send them cold hard cash, which cannot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "crabcord",
            "body": "You've heard the old saying \"if it's too good to be true, then it usually is\". Well, this is too good to be true. No one gives away their money like that, so there's a catch to it.",
            "score": 2,
            "replies": []
        }
    ]
}