{
    "title": "Is this a scam? I just want to double check",
    "author": "NIY_AH",
    "subreddit": "Scams",
    "rank": 9,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/gallery/1jefq75",
    "id": "1jefq75",
    "selftext": "For context:\nA month or two ago, I had got an email from a school staff member that asked me to fill out a form to be a student assistant for a professor (I wasn’t the only student that got this email). Today, I had received a message from the person I was supposed to work for and we did a virtual interview (I was asked 3 questions). After answering those three questions I was told that I was basically told that I was hired (now that I’m writing this, I’m starting to see that was a red flag). I was sent forms to fill out and one of those forms I entered my capital one bank account number and my email. A couple minutes ago I got an email for an e check and I’m just now starting to question the legitimacy of this whole thing. I don’t use my capital one bank account but I honestly feel silly for putting it down on the form.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/NIY_AH - Your post has been queued for moderation because our bot detected a low effort title. **Be patient until it's reviewed by a moderator.** While you wait, we suggest you thoroughly read the following guideline: [How to submit a good post to r/scams](https://www.reddit.com/r/Scams/comments/1fw44zb/guide_how_to_submit_a_good_post_to_rscams/), where we describe what a good title is for us.\n\nAs you can see in that guideline, we want posts to have a good title because Google loves Reddit. This post may be about you asking for help, it may also be you warning you about a new scam. Whatever the case may be, this post will help hundreds of other people if it's searchable. We want to make sure your title summarizes the scam being described.\n\nIf you agree that your post doesn't have a good title, delete the post yourself, and post again. If this post is about a scam website (or a potential scam website), make sure your new post contains the website address in the title (not in the post). Unfortunately post titles aren't editable, so you'll have to post again if that's the case.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "t-poke",
            "body": "!fakecheck scam. \n\nEmailed checks are never legit. That’s not how checks work.",
            "score": 8,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/t-poke, AutoModerator has been summoned to explain the Fake check scam.\n\nThe fake check scam arises from many different situations (fake job scams, fake payment scams, etc), but the bottom line is always the same, you receive a check (a digital photo or a physical paper check), you deposit a check (via mobile deposit or via an ATM) and see the money in your account, and then you use the funds to give money to the scammer (usually through gift cards or crypto). Sometimes the scammers will ask you to order things through a site, but that is just another way they get your money.\n\nBanks are legally obligated to make money available to you fast, but they can take their time to bounce it. Hence the window of time exploited by the scam. During that window of time the scammer asks you to send money back, because you are under the illusion that the funds cleared.\n\nWhen the check finally bounces, the bank will take the initial deposit back, and any money you sent to the scammer will come out of your own personal funds. Usually the fake check deposit will be reversed in a few weeks, but it can also take several months. If you do not have the funds to cover the amount, your balance will go negative. Your bank will usually charge a fee for depositing a bad check, and your account may be closed depending on the severity of the scam. Here is an article from the FTC: https://www.consumer.ftc.gov/articles/how-spot-avoid-and-report-fake-check-scams, and here is an article from the New York Times: https://www.nytimes.com/2020/02/21/your-money/fake-check-scam.html\n\nIf you deposited a bad check, we recommend that you notify your bank immediately.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "seedless0",
            "body": "A real bank isn't going to use a free gmail address.\n\nWhat exactly do you mean an e check? A check image that you print and deposit? It's likely a !fakechcek.",
            "score": 4,
            "replies": []
        },
        {
            "author": "davidgnesin",
            "body": "Don’t go near this !!",
            "score": 3,
            "replies": []
        },
        {
            "author": "borderpatrol",
            "body": "Like others pointed out, it's a fake check scam. The reason they ask for your current bank is so they can issue a check *not* at the same bank to ensure that it doesn't try and clear immediately.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Theba-Chiddero",
            "body": "You didn't get a real job, you are the victim of a scam. You haven't lost money, you saw the red flags and questioned the fake checks, which is great. Emailed checks are only used by scammers.\n\nEverything he told you is a lie. There is no professor -- he is probably working in a scam call center in Africa or Asia. \n\nAssistant for a professor or alumnus is a common fake job scam targeting students. Block the person and don't respond, he may threaten you. He is trying to get you to handle fake checks and launder stolen money.\n\nLet your school admin know about this -- the IT department should be blocking these emails from going to students.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Theba-Chiddero",
            "body": "You gave him your bank account number? You need to talk to your bank today -- call their fraud department, they will freeze your account so the \"professor\" can't take money out. Your bank may recommend closing the account and opening a new one.",
            "score": 1,
            "replies": []
        }
    ]
}