{
    "title": "Mother got half way into a bank scam. What other safety measures to take?",
    "author": "teccy366",
    "subreddit": "Scams",
    "rank": 13,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Scams/comments/1jegyv2/mother_got_half_way_into_a_bank_scam_what_other/",
    "id": "1jegyv2",
    "selftext": "My mother was initially duped by a scam call team today.  They had called ostensibly from her telecom provider to tell her that her computer was hacked and that scammers were trying to take money out of her account.  They asked for her cell # and told her that someone from her bank would call her.  I assume she told them which bank she used.  \n\nA guy called pretending to be from her bank, verified her information and told her they suspected that an employee in the local branch of her bank was the culprit and that they needed my mother's help to catch them and not to inform anyone at the local branch.  She was to go and take out 15k in cash, and at this point she sort of figured out this was wrong (bless her) so it didn't go further and I dont know exactly what they wanted her to do with the money, but I'm sure it wasn't good. The guy tried to call her back on the cell but hung up when I answered and pressed him. \n\nThe part that is freaking me out is that my mother cannot recall what information she might have given either caller when she was taken in by it.  She recalls the guy having detailed information about her bank accounts, which is TERRIFYING me because I can't think how it would have happened if true.  It's possible he was just good at what he did though and got the info out of her while making it seem like he already had it.  The guy on the phone when I answered was not smooth though.\n\nNow... I got her to change her online banking password, talked to the manager of her local branch so as to flag anything unusual with her accounts, put an alert on her credit card and changed her Google account password.  I cannot change her email account password because the verification email is a dead account, so not sure what to do with that.  Based on the above is there anything obvious we are missing in terms of safeguards?\n\nThanks in advance, and let me know if more info is needed.\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/teccy366 - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CyphrSec",
            "body": "That is a shitty situation to be in...\n\nYou’ve already taken good steps, but here are additional safety measures to cover all bases:\n\n* **Freeze Credit** – If personal info was leaked, consider a temporary credit freeze to prevent fraud.\n* **Keep an eye on her bank accounts** – Check transactions daily for anything weird. If something seems off, call the bank immediately.\n* **Turn on two-factor authentication (2FA) everywhere** – Especially for her bank and email. This makes it way harder for scammers to get in, even if they have her password.\n* **Fix her email situation** – Since her recovery email is dead, she should update it to a working one ASAP. If she can’t access it, she might need to create a new email and update her accounts.\n* **Scan her devices for malware** – Just in case they tried to sneak in spyware or keyloggers while they had her on the phone. Run a full antivirus scan on her computer and phone.\n* **Talk to her about scam tactics** – Remind her that no real bank will ever ask for secrecy, pressure her to withdraw cash, or call her out of the blue like that. If she ever gets another weird call, she should hang up and call the bank directly using the number on their website.\n\nIf anything seems off in the next few days, just contact her bank again. Better safe than sorry!",
            "score": 4,
            "replies": []
        }
    ]
}