{
    "title": "Job offer text - Affirm",
    "author": "subjectivelyok",
    "subreddit": "Scams",
    "rank": 11,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Scams/comments/1jehj9x/job_offer_text_affirm/",
    "id": "1jehj9x",
    "selftext": "Got a text from “Affirm.” lol \nWanted to give y’all a heads up.\nIt reads as follows:\n\n“Greetings! I'm Brynn from Affirm. We noticed that your background and resume have been recommended by multiple online recruitment agencies. Therefore, our company has an excellent remote online part-time/full-time job opportunity for you to help Affirm merchants update data, increase visibility and increase bookings, and we’ll set you up with free training to get you rolling in no time!\nThis is a flexible part-time and full-time job. You only need to work 2-3 hours a day, 5 days a week, and the working time and location are completely based on your personal schedule. The daily income is between $200 to $300, and you can also earn an extra $800 base salary for every 5 days of work. In addition, you will enjoy paid annual leave, and ordinary employees can enjoy 10-15 days of paid annual leave. Your salary will be paid daily. We also provide maternity leave, paternity leave and other statutory holidays.\nIf you are interested in participating, please send a text message to the mobile number ———\n(Ages 23+ welcome.)”",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "/u/subjectivelyok - This message is posted to all new submissions to r/scams; please do not message the moderators about it.\n\n## New users beware:\nBecause you posted here, you will start getting private messages from scammers saying they know a professional hacker or a recovery expert lawyer that can help you get your money back, for a small fee. **We call these RECOVERY SCAMMERS, so NEVER take advice in private:** advice should always come in the form of comments in this post, in the open, where the community can keep an eye out for you. If you take advice in private, you're on your own.\n\n**A reminder of the rules in r/scams:** no contact information (including last names, phone numbers, etc). Be civil to one another (no name calling or insults). Personal army requests or \"scam the scammer\"/scambaiting posts are not permitted. No uncensored gore or personal photographs are allowed without blurring. A full list of rules is available on the sidebar of the subreddit, or [clicking here](https://www.reddit.com/r/Scams/wiki/rules/).\n\nYou can help us by reporting recovery scammers or rule-breaking content by using the \"report\" button. We review 100% of the reports. Also, consider warning community members of recovery scammers if you see them in the comments.\n\nQuestions about subreddit rules? Send us a modmail [clicking here](https://www.reddit.com/message/compose/?to=/r/Scams).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "vitaminxzy",
            "body": "!task scam for anyone not aware\n\nThe FBI and FTC have made a psa:\n\n[https://www.ic3.gov/PSA/2024/PSA240604](https://www.ic3.gov/PSA/2024/PSA240604)\n\n[https://consumer.ftc.gov/consumer-alerts/2024/11/task-scams-create-illusion-making-money](https://consumer.ftc.gov/consumer-alerts/2024/11/task-scams-create-illusion-making-money)",
            "score": 4,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi /u/vitaminxzy, AutoModerator has been summoned to explain the Task scam.\n\nTask scams involve a website or mobile app that claims you can earn money by completing easy tasks, such as watching a video, liking a post, or creating an order. A very common characteristic (but not entirely exclusive) is that you have to complete sets of 40 tasks. The app will tell you that you can earn money for each task, but the catch is that you can only do a limited number of tasks without upgrading your account. To upgrade your accounts, the scammers will require you to pay a fee. This makes it a variant of the advance fee scam.\n\nThe goal of this scam is to get people to download the app for easy money and then encourage them to pay to get to the next level. It's impossible to get your \\\"earnings\\\" out of the app, so victims will have wasted their time and money. This type of scam preys on the [sunk cost fallacy](https://en.wikipedia.org/wiki/Sunk_cost#Fallacy_effect), because people demonstrate a greater tendency to continue an endeavor once an investment has been made, and refusing to succumb to what may be described as cutting one's losses.\n\nIf you're involved in a task scam, cut your losses. Beware of recovery scammers suggesting you should hire a hacker that can help you retrieve the money you already invested. They can't, it's a trick to make you lose more money. Thanks to redditor vignoniana for this script.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Scams) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cyberiangringo",
            "body": ">We noticed that your background and resume have been recommended by multiple online recruitment agencies.\n\nThe scammer script lingo.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DesertStorm480",
            "body": "I may have to break my \"delete unsolicited texts\" rule to make $100 an hour on my own schedule from home.",
            "score": 1,
            "replies": []
        }
    ]
}