{
    "title": "American Capitalism intrinsically favors sociopaths and cons to the top. Elon Musk is the poster child",
    "author": "IanTrader",
    "subreddit": "socialism",
    "rank": 368,
    "score": 127,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://m.youtube.com/watch?v=PU7QM3MZ2Vs",
    "id": "1in6jb1",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaronTazov",
            "body": "There’s room at the top they are telling you still.\n\nBut first you must learn how to smile as you kill\n\nIf you want to be like the folks on the hill.",
            "score": 5,
            "replies": []
        },
        {
            "author": "progenitor-x",
            "body": "This video and message needs to be spread far and wide. It is the core of what is wrong with capitalism. Not only is it false that capitalism rewards hard work and merit, it is an *inverse meritocracy* where the *least deserving* are rewarded. The sociopaths, the ones who actively harm people, are the ones that usually become wealthy. This means that society in general evolves to becomes more and more sociopathic and hateful. Bullying is encouraged more and more, and so is fascism. This is a dark future for all of humanity unless American-style capitalism is resisted.",
            "score": 1,
            "replies": [
                {
                    "author": "IanTrader",
                    "body": "Corporations are by definition sociopathic. It is paradoxical as the message given to their slaves/employees is to have feelings and emotions for a humanless entity that gives 0 fucks about one's well being. And those who make it to the top of this hierarchy, fascistic by definition, are sociopathic and psychopatic.\n\nThere is a reason they are also called \"intra species predators\". A cat can't have compassion for a prey it will east but this is needed for survival. Here degenerates member of a species prey upon their own with absolutely no compassion. And those are the CEOs and Politicians that lie every word they utter from their pie holes. And unlike Ted Bundy or other notorious criminals they are not only functioning but highly successful, at the cost of society in general.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}