{
    "title": "What are you reading? - February, 2025",
    "author": "AutoModerator",
    "subreddit": "socialism",
    "rank": 315,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/socialism/comments/1iq1xii/what_are_you_reading_february_2025/",
    "id": "1iq1xii",
    "selftext": "Greetings everyone!\n\nPlease tell us about what you've been reading over the last month. Books or magazines, fiction or non-fiction, socialist or anti-socialist - it can be anything! Give as much detail as you like, whether that be a simple mention, a brief synopsis, or even a review.\n\nWhen reviewing, please do use the Official /r/Socialism Rating Scale:\n\n>★★★★★ - Awesome!  \n>  \n>★★★★☆ - Pretty good!  \n>  \n>★★★☆☆ - OK  \n>  \n>★★☆☆☆ - Pretty bad  \n>  \n>★☆☆☆☆ - Ayn Rand\n\nAs a reminder, our sidebar and wiki contain many Reading Lists which might be of interest:\n\n* [Socialism Starter Pack](https://www.reddit.com/r/socialism/wiki/index/starterpack)\n* [Historical Events](https://www.reddit.com/r/socialism/wiki/index/historicalevents)\n* [Biographies](https://www.reddit.com/r/socialism/wiki/index/biographies)\n* [Suggested Readings](https://www.reddit.com/r/socialism/wiki/suggested_readings)\n* Black Socialists of America (BSA)'s [Resource Guide](https://blacksocialists.us/resource-guide)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary-Extent5974",
            "body": "Blackshirts and Reds by Parenti, I'm not too far into it yet but it's already quite eye-opening! The connection between fascism and capitalism seems to be extremely close indeed, which I have had an intuition of but haven't heard or read anything concrete about until now. I'm excited to learn more about topics and people in history that I know I'm completely ignorant of due to western propaganda. I also recognize that relying on just one book is not a sound strategy so if anyone sees this and has any thoughts on good reads to follow this one, please let me know!\n\nI also just read the PSL program which seems to me to be a really great overview of the state of things. I found it much more approachable than things like the Communist Manifesto which I admit I will need a few read-throughs to really understand. I'm very curious to hear if anyone has read it and has any critiques or things they'd like to add to the PSL program as an introduction to socialism.",
            "score": 3,
            "replies": []
        },
        {
            "author": "One-Reality4066",
            "body": "Profit Over People by Noam Chomsky; an amazing book",
            "score": 1,
            "replies": []
        }
    ]
}