{
    "title": "Unionization and the Fight Against Trump Starts with a Break from the Democrats",
    "author": "leninism-humanism",
    "subreddit": "socialism",
    "rank": 293,
    "score": 318,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.leftvoice.org/unionization-and-the-fight-against-trump-starts-with-a-break-from-the-democrats/",
    "id": "1iq3ylo",
    "selftext": "",
    "comments": [
        {
            "author": "RezFoo",
            "body": "Very interesting article.\n\n>When people like Sanders and UAW president Shawn Fain claim that the problem is “corporate greed,” they conceal the fact that corporations and government work together.\n\nIt also criticizes Jane McAlevey\n\n>McAlevey’s emphasis on [electing Democrats](https://inthesetimes.com/article/elect-democrats-union-workplace-power-electoral-militancy) to ensure the favors of governments and state agencies also meant playing by the rules to avoid alienating the Democrats; this leads to confusion when the rules suddenly change.\n\nAnd about how Trump's isolationism while simultaneously wanting more growth will make things worse for workers, because capitalism will have fewer places to expand:\n\n>With a contracted global market and restricted access to immigrant and cheap foreign labor, any plans for domestic growth, regardless of how successful they are, will be contingent on higher rates of exploitation.",
            "score": 33,
            "replies": [
                {
                    "author": "Giant_middle_fingr",
                    "body": "(the last part)\n\nThis is true, this is fascism. Imperialist exploitation comes home. Welcome to ukraine guys. The phillipines, Mexico, China if there wasn't a CPC, etc...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "diecorporations",
            "body": "Democrats are the enemy.",
            "score": 23,
            "replies": []
        },
        {
            "author": "nonamey_namerson",
            "body": "I agree with u/RezFoo it is an interesting article -- but there is another side to this -- a large segment of the U.S. Left abandoned solidarity with organized labor by making the election *solely* a referendum on the Palestinian genocide, despite there not being a viable pro-Palestinian candidate. Unions were hung out to dry despite increased labor militancy and a willingness to break with Dems over Palestine. \n\nWith the Left proving themselves fickle allies, the current shift in union rhetoric and positions could be due to the realization on the part of unions that they are on their own.",
            "score": -17,
            "replies": [
                {
                    "author": "msdos_kapital",
                    "body": "> a large segment of the U.S. Left abandoned solidarity with organized labor by making the election solely a referendum on the Palestinian genocide\n\nI'm sorry - what the fuck are you talking about?\n\nFirst of all, there were plenty of other reasons not to vote for Democrats. In fact if you were set on voting Democrat before the Palestinian genocide, and changed your mind after, then while I'm certainly glad you finally came to your senses, I do question your commitment to socialism or leftism *specifically* (since, I would hope, being against genocide isn't an exclusively left-wing position).\n\nBut more than that, where is this \"hung out to dry\" accusation even coming from? Was there some crucial vote or direct action that was set to succeed and aid the cause of worker unionization and the material conditions of unionized workers in this country, which was not achieved because \"the left\" didn't show up? I'd like to hear about it, if so. And I don't even know what to make of, on the one hand, chastising leftists who didn't vote for Dems over Palestine, but *also* asserting that unions were ready to break with Dems over Palestine, and that (therefore?) not voting Democratic constituted some betrayal of unions? That doesn't follow - that doesn't make any sense at all.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "nonamey_namerson",
                            "body": ">Was there some crucial vote or direct action that was set to succeed and aid the cause of worker unionization and the material conditions of unionized workers in this country, which was not achieved because \"the left\" didn't show up?\n\nI think history will judge -- we'll have to see. I'm willing to reassess as things unfold, but I imagine crippling the NLRB was just a first step.\n\nI'll be interested to look back and gauge what gains the U.S. Left makes due to breaking with labor during the last election.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "msdos_kapital",
                                    "body": "I mean, in my view stuff like the NLRB was there to integrate unions and labor in general into capitalist institutions. That's pretty much what it was sold as when it was created - it's not a coincidence that they did that stuff and then immediately got to work purging the communists. Obviously the plan now is to obliterate the labor movement altogether, and unions with it, so from their point of view it makes sense to put all of that stuff back outside the framework of capitalist democracy / bourgeois dictatorship. I don't think it's going to go down that way and I think it's just going to mean more labor militancy and, yes, the spectre of communism etc etc., but yeah time will tell as you say.\n\nBut, that's not what I was taking issue with - I still don't see what the leftist betrayal of unions / the working class is, here. By not voting for Democrats? Like, the Democrats presided over the crippling of unions as well. For the last 80 years. They've played just as much a role in undermining the labor movement as the GOP has. They're just as complicit. Maybe the NLRB would still be around if Harris had won, but like I say that's a double-edged sword in the first place and anyway, with how willing she was to listen to her rich donors (it probably cost her the election) I think she would have done with the NLRB and other institutions basically whatever they asked of her. She would certainly have been worse than Biden in this regard - and that is no defense of Biden either, he too was anti-worker despite all the \"Union Joe\" bullshit.\n\nAgain - I'm just not seeing how voting PSL or writing in \"Ghost of V.I. Lenin\" or just not voting, is \"hanging unions out to dry.\"",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "nonamey_namerson",
                                            "body": "I'm not a big fan of accelerationism, and I think where we are right now, that has to be the hope. I think we could have used a few more years with a party willing to make concessions to organized labor. Unions are popular, and a friendly organizing environment makes them bolder and easier to radicalize.\n\nI have a feeling the next few years will set us back. \n\nI also think if socialists want to have more influence with workers in unions, we can't entirely ignore what it means to act in solidarity with them. \n\nI'll be really happy to be proven wrong -- If I remember, I'll reach out, congratulate you, and celebrate you being right.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "msdos_kapital",
                                                    "body": "Okay. I still don't know what you're talking about and I don't know what you'll be congratulating me for.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "nonamey_namerson",
                                                            "body": "If abandoning solidarity with unions in the last election moves the socialist and labor movements forward I'll congratulate you on having a better understanding then mine.\n\nEdit : Some comrades can discuss/debate things they disagree on more comfortably than others -- sorry if you found our discussion difficult -- no harm was meant.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "msdos_kapital",
                                                                    "body": "Okay, I give up - like I said, \"not voting for Democrats\" does not constitute an abandonment of unions, or at least you haven't explained why you think that's the case. I've given you ample opportunity to do so, asked you several times, etc etc., and each time you've come back with these kind of non-sequitur responses that honestly read like they were written by ChatGPT. Or you're just incredibly thick, and in either case you're definitely starting to glow in the dark for me, so I'm just going to block you.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RezFoo",
                    "body": "It is too bad we are not allowed to vote on each issue separately (as in Switzerland).",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}