{
    "title": "Popular Front in the United States",
    "author": "fuckassmcgillicutty",
    "subreddit": "socialism",
    "rank": 206,
    "score": 49,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/socialism/comments/1iv2w2a/popular_front_in_the_united_states/",
    "id": "1iv2w2a",
    "selftext": "As this year progresses, I, and many others I assume, am seeing a lack of a comprehensive response to the current fascist take over of the United States government. \n\nWhat I am seeing is many small organizations planning specific actions or protests in support of specific things; like Palestinian Liberation, Queer and Trans Liberation, and POC Liberation. \n\nWhich is good! These are important issues. I am definitely not trying to say these things are bad. All of the efforts are necessary. \n\nBut the issue I am seeing most often is that the turn outs are small. Either because of low support for this specific action, it was planned at an inconvenient time for most people (seeing a lot of stuff scheduled during the work day which keeps me from getting out, as I imagine it keeps others from getting out), or other issues. \n\nI don’t mean to be a doomer, don’t get me wrong. Organizing seems super difficult, large scale organizing seems far worse. \n\nBut so many groups have different plans for different days. PSL is doing one thing, DSA is doing another, CPUSA is doing another. Not to mention smaller local groups. \n\nFrom what I know historically, popular fronts have been formed from socialists to anarchists and liberals to combat fascism and nationalism in say, Spain.\n\nIs there any merit to a coalition of leftist organizations to plan actions together with considerations for how to get the most turn out possible? Actions to resist the fascist take over as a whole, and not in support or against specific issues?\n\nSorry if these are silly questions or discussion, I’m pretty ignorant about leftist organizing and want to know more about it as I’m starting to join groups around me. \n\n(edited for using an inappropriate word, sorry guys)",
    "comments": [
        {
            "author": "DullPlatform22",
            "body": "I think our top priority should be to put all the bickering aside for the moment and focus on a common enemy.\n\nMessaging should be clearly anti-Trump and republicans. It should be not just that they are going after marginalized groups (which to be clear, they are) but also they're making the lives for the majority worse (e.g. his trade war bullshit).\n\nBut nobody seems to want to have a coalition unfortunately so idk",
            "score": 36,
            "replies": [
                {
                    "author": "CataraquiCommunist",
                    "body": "It’ll be up to party members to corral their leadership together in one room and lock them in and say they aren’t allowed out until they’ve agreed on a popular resistance 🤣",
                    "score": 14,
                    "replies": [
                        {
                            "author": "DullPlatform22",
                            "body": "I think juat rallying against Trump and the Republicans is simple enough. We can sort the other shit out later",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "tender-majesty",
                                    "body": "Sadly, there's no building a real movement on such a shit foundation. Not after decades of Dems fighting to crush their own populist wing.\n\nThings are going to have to get a heck of a lot worse before past betrayals can be truly forgotten.\n\nIf we are lucky then maybe US global dominance will crumble in the meantime —",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "DullPlatform22",
                                            "body": "I'd argue that most Americans have goldfish memory  so if the Dems were to drastically change messaging I don't think that would be an issue.\n\nThe Dem leadership doesn't seem interested in this though so it probably won't happen.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "tender-majesty",
                                                    "body": "Good point. But yeah, it doesn't seem like that is happening. Just digging in their heels as the party of compromise on behalf of the status quo —",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "DullPlatform22",
                                                            "body": "I fucking hate the fact that the Democrats are considered \"the left\" in the United States but that's the hand we were dealt unfortunately",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "tender-majesty",
                                                                    "body": "Yeah, it's a bad joke. But we def need to own up to how weak our position is. It's tempting to align with the center, but they see *us* as the real enemy. \n\nGotta start playing the long game. Talking intergenerational —",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fuckassmcgillicutty",
                    "body": "It think leftist infighting has always been an issue. It certainly has been a massive issue in space I have been involved with in the past. \n\nBut as things become worse, I’m hoping it will become less of an issue. \n\nMy fear is that we get over differences is ideology after it’s too late.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "DullPlatform22",
                            "body": "Definitely a very valid fear. I think more people should check out works promoted by r/stupidpol to get ideas on effective coalition building. Because whatever we as \"the left\" have been doing sure as shit hasn't been working.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Contact-7535",
            "body": "Fascism must be taken out of power, and there needs to be a united front against it.\n\n  \nRegardless of disagreements, Im sure all socialists agree on this, and that is why you are right, comrade.\n\n  \nWe must unite against this evil (DMs open)",
            "score": 11,
            "replies": []
        },
        {
            "author": "Dazzling-Screen-2479",
            "body": "Popular fronts generally refer to the allegience of leftists with liberals to defend democracy against fascist coups or power grabs. United fronts is a term I prefer, because it is used to describe the left uniting in action in a general sense. So it's terminology isn't limited to the struggle against fascist risings alone. United front means united in any act against bourgeois control, including fascism. \n\nThere's already been multiple united fronts that occured in America. Remember the 100 days of sustained protest in portland? Or how about the cop city? Anyone from anarchists to psl members were involved on those efforts. All throughout trumps last term you had black clergy and anarchists linking up. This is for sure a popular front. It just seems way more silent now than it did during trumps last term for an array of reasons.",
            "score": 8,
            "replies": []
        },
        {
            "author": "JoeWeydemeyer",
            "body": "A United Front, not a Popular Front:\n\nhttps://en.m.wikipedia.org/wiki/United_front#Formulation_and_early_usage_after_1917\n\nA Popular Front is a leash held by the bourgeoisie.",
            "score": 7,
            "replies": []
        },
        {
            "author": "adimwit",
            "body": "Yes. Lenin said that whenever Fascism (National Chauvinism) comes along, then the strategy needs to change to focus on defeating Fascism. That means forming alliances with anyone and everyone who is willing to fight Fascism.\n\nThis idea was later disputed by Stalin who believed the workers needed to isolate themselves from non-Marxists. But after the Nazis seized power, Stalin was forced to abandon his isolation tactic and go back to the Popular Front strategy.\n\nOnce Fascism is defeated, the workers can go back to trying to win power. Defeating Fascism is the priority, and you need to form alliances with anyone willing to fight Fascism.\n\nFascism is the primary threat because the goal of Fascism is to revert society back into a Feudal system. This means all Fascists are going to try to abolish labor unions and Democratic institutions, and then replace it with Feudal hierarchies, essentially making all of the bottom social classes into slaves of the Feudal state.",
            "score": 27,
            "replies": [
                {
                    "author": "travissius",
                    "body": "What do we read to learn about Lenin's stance on this?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "leninism-humanism",
                    "body": "> This idea was later disputed by Stalin who believed the workers needed to isolate themselves from non-Marxists. But after the Nazis seized power, Stalin was forced to abandon his isolation tactic and go back to the Popular Front strategy.\n\nThey did not return to the \"popular front\" strategy, it was something new for the seventh Comintern World Congress in 1935. The tactic before the sixth Comintern World Congress in 1928, where there was this ultra-left turn, was the united front. [The united front was predicated on proposing united fronts on concrete issues](https://www.marxists.org/archive/thalheimer/works/ufront20-23.html) with mass-organisations of the working-class, like the labor unions, and other workers' parties, like the Social-democrats in most European countries or Farmer-Labor parties in the US. These proposals was to aimed towards both the leadership and the rank-and-file. If it was refused it would should the rank-and-file that that their leaders did not want to fight for their interests. The Communists were also to remain an independent party.  \n\nThe popular front on the other hand built on a much larger \"cross-class\" popular front. [In the US this meant working with the Democrats](https://jacobin.com/2017/10/popular-front-communist-party-democrats). As opposed to before the ultra-left turn in 1928, they now for example did not try to organize an opposition in the labor unions - like with TUEL - but instead supported the labor bureaucracy. They worked to subordinate all expressions of independent working-class politics into the Democrats, from everything like unemployed organizations to Farmer-Labor parties and new industrial unions like CIO and UAW. \n\nIt also disregarded independence of the party. In countries where there were Social-democratic parties they [directed the Communist Parties to merge with the Social-democrats](https://www.marxists.org/reference/archive/dimitrov/works/1935/08_02.htm#s20). In most countries this failed but in Spain they did merge the youth-leagues. \n\n> Once Fascism is defeated, the workers can go back to trying to win power. Defeating Fascism is the priority, and you need to form alliances with anyone willing to fight Fascism.\n\nThere was no \"once Fascism is defeated\" clause in the popular front strategy, it was quickly made permanent. CPUSA is still in an endless string of \"popular fronts\" to support the [lesser evil](https://www.marxists.org/archive/draper/1967/01/lesser.htm). They dissolved the Red International of Labor Unions in 1937, and Comintern itself in 1943. The Communist Parties were now going to find their own national road to socialism, built on \"popular fronts against monopoly capital\" and \"people's democracy\".",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Marxist20",
            "body": "The problem is CPUSA and DSA form popular fronts with the Democratic Party, the class enemy of the working class....this is a recipe for disaster.",
            "score": 17,
            "replies": [
                {
                    "author": "Creepy_Orchid_9517",
                    "body": "While agreeing with you, I do think a bit of cooperation with the ideological foes on the broader font, for the short term is useful. While left leaning liberals could abuse and take the stage of \"leftwing politics\", it could be just as advantageous for building socialist numbers, possibly even converting some libs in the process. Like we don't need to baby libs, but I think we run into a problem of coming off as \"abrasive\" to non radicalized people lol, especially people that just don't know any better or really even understand capitalism fully.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Henry-1917",
                            "body": "Are we talking about the Democratic leadership, or workers who vote for Democrats?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Creepy_Orchid_9517",
                                    "body": "the people themselves, like organizations and other grassroots. The notion of stigmatizng people (libs) that don't know any better about these things, makes us look like stuck up assholes. I just hate seeing communist and socialist parties self sabotaging every second possible, because we don't wanna play a little dirty, like spending effort trying to take the lead of \"left-wing\" politics, to the average uneducated american. Like libs bad, I agree, but we need to remember that diplomacy with other people, like every socialist party ever did, bc we will always need support and numbers, like every socialist movement ever in history. the Russian socialist movement for example, the communists didn't start turning on liberals until they had a fully established position to even start a coup. They, Lenin understood diplomacy is a requirement.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "wardsandcourierplz",
            "body": "Master the dark art of necromancy and summon Fred Hampton",
            "score": 3,
            "replies": []
        },
        {
            "author": "NineTowns",
            "body": "Pop fronts always strengthen the establishment and delay socialism. Look at the last hundred years. No more cooperating with capitalist parties, how much more history do you need to recognize this?",
            "score": 2,
            "replies": []
        },
        {
            "author": "FreesponsibleHuman",
            "body": "Yes please. I’m in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theycallmewinning",
            "body": "Maybe.\n\nhttps://roadtoliberation.org/block-broaden-build/\n\nhttps://convergencemag.com/articles/refuse-resist-contest-block-build-for-the-trump-2-0-era/",
            "score": 3,
            "replies": [
                {
                    "author": "fuckassmcgillicutty",
                    "body": "Thanks for the links!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Perfect-Werewolf-102",
            "body": "This was the decision made by the Seventh Congress of the Third International in 1935. Fascism is the primary enemy, and defeating it is the highest priority",
            "score": 2,
            "replies": []
        }
    ]
}