{
    "title": "I will only die when the american empire ends",
    "author": "zepong",
    "subreddit": "socialism",
    "rank": 179,
    "score": 2945,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 36,
    "url": "https://i.redd.it/un60u4w6ooke1.png",
    "id": "1ivhkf1",
    "selftext": "Comrad Fidel!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent_Body_4576",
            "body": "its end began when it started",
            "score": 226,
            "replies": []
        },
        {
            "author": "cloutkatsuki",
            "body": "Commandante Fidel Alejandro Castro 🫡",
            "score": 228,
            "replies": [
                {
                    "author": "afrocubanjazz",
                    "body": "*Ruz  🫡\n\nLet's not erase his mother ¯\\\\(ツ)/¯",
                    "score": 46,
                    "replies": [
                        {
                            "author": "cloutkatsuki",
                            "body": "Thank you",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suariiz",
            "body": "Viva el Comandante! Viva la Revolución! Viva Cuba!",
            "score": 78,
            "replies": [
                {
                    "author": "afrocubanjazz",
                    "body": "> Viva ~~la~~ Cuba!  \n\n🫡",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Suariiz",
                            "body": "🫡 \n\n(Perdón por mi español. Es mi tercer idioma así que todavía estoy aprendiendo.)",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "afrocubanjazz",
                                    "body": "Vas bien. Cuba es como Chico Buarque. Viva Chico Buarque! 🙂",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Esnacor-sama",
            "body": "Am sure as hell american empire still exists with how many power they got over the world and how much impact they got in every continent \n\nAnd how when they are allies of some country that country got to do whatever it wants genocide killing innocent bombing...",
            "score": 92,
            "replies": [
                {
                    "author": "Locke2300",
                    "body": "They’re probably looking at it like “in 200 years when pop historians are desperate for a date that they can assign to ‘the fall of the American Empire’ so they can make some weird point about robot rights and the decline of contemporary meme culture they will choose the election of the guy who, claiming to be the return of strongman politics to US electoralism instead forced Europe to reconsider NATO and empowered Russia while ceding soft power to China, leading to a much more multipolar world”.",
                    "score": 102,
                    "replies": [
                        {
                            "author": "atoolred",
                            "body": "Exactly. In practice yes the empire still exists, but Trump is a turning point in the decline in the sense that the empire’s agenda is now entirely mask-off. Trumpism is the inevitable conclusion of GOP accelerationism. Or, Trumpism is the catalyst for a very fucked up era of anarcho-capitalism, or some neo-reactionary corporate monarchy (but I don’t think these two ideologies are mutually exclusive, given that anarcho-capitalists still accept corporate structures as “voluntary hierarchies”)",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "Dazzling-Screen-2479",
                                    "body": "It's funny how \"ancaps\" side with the jackboots and imperialists of the world after years of calling ancoms (aka just regular anarchists) true authortarians who worship the state. Meanwhile ancoms are present in every modern struggle against things like prisons, policing, and militarism where you'll rarely see ancaps. In fact you'd be more likely to find a self described ancap at a pro cop rally. \n\nIt's not shocking because anarcho capitalism isn't real, it's something that was created by capitalist propagandists to seal off the potentiality of the American appeal to \"anti authority\" individualism leading to individualists becoming keen to anarcho communist theories on individualism in relation to property. They wanted to funnel those potential people further down the opposite direction. This wasn't an accident, no, these people had ties to the cia. They knew what they were doing. They hijacked the word libertarian and anarchist, or attempted to, to seal off the public from discovering those theories. They fully succeeded in stealing the term libertarian, but never fully restructured the anarchist movement like they wished to. Anarchists were hostile to these ideas off the rip. The propagandists needed to thwart every form of communist struggle. The people who came up with ancap are the people who planned pinochets economy, so it makes sense. A classic case of fascist reactionary movements utilizing imagery and aesthetic of the left to create confusion and counter recruit.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "atoolred",
                                            "body": "I [listened to this podcast](https://youtu.be/SiBJeLrIoes?si=jpJOBFN1tRawo3aV) today that really helped me wrap my head around how ancap is one of the logical conclusions and extensions of neoliberalism, and how it’s not actually all that surprising that ancaps would support a Curtis Yarvin style “corporate monarchy” because of the value that these guys place on markets. \n\nNeoliberalism has been the defense of the martlet at all costs, which has been much more interventionist than these bastards like to admit. Rather than the classical liberal approach of small state with big market, they’ve accepted that they need a strong state to enforce the market. And what better way to enforce something than an all powerful authority such as a monarch? We already see Trump and Musk breeding like rabbits to try and find their true heirs, and acting as though law doesn’t apply to them. \n\nI don’t entirely know how to wrap this concept to my previous statement eloquently atm but I’ve been studying the roots of western conservatism lately because my education was way more focused on liberalism, in spite of the fact that I’m from a southern state (also probably just paid attention to that more because I was a shitlib back then as well). Liberals and conservatives both share a common ancestry in the US with the founding of the nation, and ideological clashes on federalism vs confederalism etc. are well documented, but I hadn’t pieced together that conservatism goes all the way back and has its roots in the Romantic Era. The era that rejected enlightenment liberal democracy, enlightenment social democrats, and opposed revolutions such as those seen in France— favoring traditions, beauty and aesthetics, nature, religious rule that preceded Nations and national borders, and hierarchies that they perceive to be “natural.” Knowing these roots, it’s helped me to understand how conservative western proletarians can be so keen on Trump ruling entirely and imposing his will on the entire nation. And much like the Counter-Enlightenment of the Romantic Era being reactionary against the intellectual elitism of parliamentary rule developed during the Enlightenment, it is completely understandable to me how we are seeing such a reactionary force in motion right now. \n\nAncap has concentrated power in the CEOs and private property, and the Dark Enlightenment provides them with a way to protect their private property \n\nI definitely recommend that podcast episode, it gets really into the weeds on neoliberal globalization and they also discuss the strange and extreme LARP behavior that these CEOs and ancap philosophers tend to do (literally LARPing irl as a practice for how they might achieve real world ideological goals; this kinda put ideologically driven communities into a new perspective for me lol)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "no you don't get it the revolution is coming for real this time guys it will happen without us",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "superchiva78",
            "body": "Prophet Fidel?",
            "score": 11,
            "replies": []
        },
        {
            "author": "linuxluser",
            "body": "Wears a [\"moral vest\"](https://youtu.be/zwjYiBatJsQ).",
            "score": 6,
            "replies": []
        },
        {
            "author": "notmuself",
            "body": "So he died because Trump started embargoing them again after Obama ended the Embargo? I don't get it.",
            "score": 11,
            "replies": [
                {
                    "author": "afrocubanjazz",
                    "body": "> So he died because Trump started...\n\n... the ending of the American empire?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "notmuself",
                            "body": "My point is that I don't think replacing US imperialism with US oligarchy and even more neo-colonialism was the kind of end Fidel had in mind.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "afrocubanjazz",
                                    "body": "Sure, but things getting worse is just a phase. A necessary premise for the final collapse, if you will. You could say F saw it all coming and decided it was time to relax. Anyway, it's just a joke and it's very likely he never said that. Here's what he actually said that could be somewhat related:\n\n>*Someday the capitalist system will disappear in the United States, because no social class system has been eternal. One day, class societies will disappear. But you can be calm, I do not foresee in a short time any change toward socialism in the United States.*\n\nsource  \nhttps://foreignpolicy.com/1977/09/15/an-interview-with-fidel-castro/\n\nweb archive source  \nhttps://web.archive.org/web/20150114022238/https://foreignpolicy.com/1977/09/15/an-interview-with-fidel-castro/",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "NotSoSmallNow",
                                            "body": "That was in 1977 though ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "afrocubanjazz",
                                                    "body": "I'm not sure what your point is. He also never said what is claimed here (that he'd die when the American empires dies). It's even written with bad Spanish, maybe because the original quote is fake and in English. I was bringing in an actual but vaguely related quote, while OP is possibly inadvertently spreading misinformation. As long as we agree not all memes are real, this whole thread is harmless and a bit of fun.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Armisael2245",
            "body": "Gracias por su servicio camarada!",
            "score": 3,
            "replies": []
        },
        {
            "author": "NewEraSom",
            "body": "American empire will not end before starting a world war sadly",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tar_Palantir",
            "body": "He didn't meant physical death, but I'll allowed it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lonely_Cosmonaut",
            "body": "Marxist Nostradamus",
            "score": 1,
            "replies": []
        },
        {
            "author": "Background_Trade8607",
            "body": "People thought trump was a secret Maoist. \n\nIt was comrade Castro playing the cards the whole time lmao.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Left-Tea-9030",
            "body": "All respect for Fidel Castro 🫡",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fine_Atmosphere7471",
            "body": "I say this to myself everytime my severe depression kicks in and I contemplate checking out...\nI wont go until capitalism and the amerikkkan empire is gone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Colombia8753",
            "body": "Makes sense. Pretty much any spiritualist that wasn't morally corrupt themselves foresaw the MAGA maggots as a dark omen. The first sign of collapse. The beginning of the end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SDcowboy82",
            "body": "Big Comrade Energy",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        }
    ]
}