{
    "title": "Tiananmen Square: Protest Against Capitalist Economic Reforms?",
    "author": "gazzahaz",
    "subreddit": "socialism",
    "rank": 189,
    "score": 57,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/socialism/comments/1ivqtia/tiananmen_square_protest_against_capitalist/",
    "id": "1ivqtia",
    "selftext": "Hello all! I was listening to Upstream Podcast's recent episode called China Pt. 1: A Socialist Introduction with Dr. Jason Hickel. https://www.upstreampodcast.org/conversations\n\nTowards the end of the teaser, Hickel asserts that:\n\n\"Most westerners assume that the Tiananmen Square protests were against communism. But in fact, the exact opposite is true: they were protesting against the U.S. backed capitalist reforms.\"\n\nI love Hickel, and really enjoyed his book The Divide. I tend to trust that what he's saying here is true and not just made up, but having lived in China and been in proximity to this history over the last 10 years, this was actually news to me. I've tried to verify it briefly online, but can't find anything. I would love to see any text or sources that back up this claim, if it is indeed true. I am fully aware that this history has been used in western imperiast propaganda many times so finding anything that challenges that narrative is probably not at the surface, but I genuinely just want to know what's true. If any of you all have knowledge of this history or where this idea comes from, please help point me in the right direction so I can educate myself better :)\n\nThanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been identified as being related to the People's Republic of China due to containing the following keyword: Tiananmen Square.\n\nDue to this subreddit's long-term experience with PRC-related threads, [low effort discussion will not be permited](https://www.reddit.com/r/socialism/comments/l5ccjb/topics_of_contention_raising_the_quality_of/) and may lead to removals or bans. Please remember that r/Socialism is a subreddit for socialists and, as such, participation must consist of conscious anti-capitalist analysis - this is not the place to promote non-socialist narratives but rather to promote critical thought from within the anti-capitalist left. Critques are expected to be high quality and address the substance of the issue; ad hominems, unconstructive sectarianism, and other types of lazy commentary are not acceptable.\n\nPlease keep in mind that this is a complex topic about which there may be many different points of view. Before making an inflamatory comment, consider asking the other user to explain their perspective, and then discuss why specifically you disagree with it.\n   \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "unity100",
            "body": "Yep. Another lie that the Western media sold to the Western public: Tiananmen was a protest against communism. Whereas the protests were led by Maoist students who thought that China had become too capitalist and they wanted the army to stage a coup to return to Maoist policies. That's why the Tankman was trying to *prevent* the tanks from exiting the square instead of preventing them from entering like in the edited BBC video. They wanted the tanks to go to the government to do a coup - not leave the square.",
            "score": 46,
            "replies": []
        },
        {
            "author": "NiceDot4794",
            "body": "I think there was a mix, woth student protesters more liberal and worker protesters more socialist probably some on both sides tho.\n\nHere are a couple articles that give some perspective on this\n\nhttps://jacobin.com/2019/06/tiananmen-square-worker-organization-socialist-democracy\n\nhttps://socialistworker.co.uk/news/china-1989-workers-in-revolt/",
            "score": 21,
            "replies": [
                {
                    "author": "AmitabhaStyle",
                    "body": "Appreciate the link to the Socialist Worker article: \n\n\n\"The involvement of workers radicalised the movement. They wanted changes at the top of society, but also changes in workplaces.\n\nGrievances included the big pay gap between workers and managers, the lack of genuine workers’ representation, poor conditions and declining living standards.\n\nOne activist said, “The state has become a free world for those with power and money, but the ordinary people don’t have a chance to benefit.”\n\nThe movement was a chance for workers to develop new forms of organisation...\"",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "AmitabhaStyle",
            "body": "Sorry, couldn't find any articles that argue completely in favor of Hickel's assertions, but these articles suggest that there may very well be a degree of truth to them [will try to look for more since it is a fascinating topic imo]:\n\n\"A call for anti-inflation measures was also high on the list [of demands]. Inflation had raged in the urban centres during the late 1980s, but the party/state leadership had shown little capacity to deal with it...\n\nThe Democracy Movement was, up until June 4, more a move for \"democratisation\". The push for \"democratisation\" leaned significantly, for political and ideological sustenance, on what was viewed, especially by Chinese students, as a contemporary trend to democratise the state and party in the Soviet Union under Mikhail Gorbachev.\n\nThe mistake, intentional or otherwise, of many foreign journalists who had flown in for the Gorbachev visit during April and had stayed on to cover the events in the square, was to assume that \"democratisation\" implied a general desire of the students to embrace Western bourgeois-democratic models within the context of a capitalist system. In reality, few students at the time had more than a very hazy theoretical notion of \"bourgeois democracy\". Many felt that, given China's poverty and other problems, transplanted \"bourgeois-democratic models\" were not appropriate.\" \n\n- https://links.org.au/china-looking-back-1989-democracy-movement-and-tiananmen-square-massacre\n\n\"The second narrative, much less influential than the first but nonetheless widely circulated among segments of the Chinese and international left, interprets the movement in the framework of “socialism vs. capitalism.” In this narrative, China’s marketization reforms in the 1980s produced severe inflation and rising inequality, which hurt the livelihoods of urban populations and gravely intensified discontent. Therefore, the 1989 Tiananmen Democracy Movement was in fact an anti-market, anticapitalist movement triggered by material grievances...\n\nThe “socialism vs. capitalism” narrative acknowledges workers’ role in the movement but obscures the fact that democratic aspirations were indeed the dominant theme. These aspirations cannot be captured by the economic dimension of “anticapitalism.” Moreover, even though discontent with marketization proved crucial in forging workers’ participation, workers in the movement did not express any wish to return to the era before marketization. Almost absent as well was any nostalgia about the Maoist era or Mao himself.\n\nWe need to simultaneously break away from both of these narratives, rejecting the exclusive focus on students and intellectuals, taking workers seriously, and at the same time acknowledging that “democracy” was the core demand of workers as well. Most importantly, “democracy” as understood by workers was different from the liberal notion embraced by students and intellectuals; it was a distinctly socialist vision of democracy premised on the agency of the working class. This dimension of the 1989 Tiananmen Democracy Movement, as a workers’ movement fighting for socialist democracy, is important both for the writing of history and politically, but has been mostly forgotten.\"\n\n- https://jacobin.com/2019/06/tiananmen-square-worker-organization-socialist-democracy",
            "score": 14,
            "replies": [
                {
                    "author": "gazzahaz",
                    "body": "This is super helpful and nuanced, thank you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Article_Used",
            "body": "it could happen here had two episodes on it, and my understanding from then is that they were pro democracy protests, rather than being pro or anti communism/capitalism.  moreso about workplace democracy & bottom up socialism than a top down implementation.\n\nhttps://www.iheart.com/podcast/105-it-could-happen-here-30717896/episode/tiananmen-and-the-question-of-democracy-97797590/",
            "score": 4,
            "replies": []
        },
        {
            "author": "DifferentPirate69",
            "body": "Hakim's [video](https://www.youtube.com/watch?v=2Oq2k066A1w) covers it.",
            "score": 8,
            "replies": [
                {
                    "author": "AmitabhaStyle",
                    "body": "Thanks, will need to check it out",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anti_colonialist",
            "body": "The US was trying to install a puppet dictator in China during that time, the same way they did Russia",
            "score": 1,
            "replies": []
        }
    ]
}