{
    "title": "What's with the current right obsession with \"owning libs\" at their own expense?",
    "author": "APEX_REAP3RZ",
    "subreddit": "socialism",
    "rank": 113,
    "score": 114,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 56,
    "url": "https://www.reddit.com/r/socialism/comments/1iyx5si/whats_with_the_current_right_obsession_with/",
    "id": "1iyx5si",
    "selftext": "Something I've noticed a lot in the right wing sphere of politics is their constant aim to troll the libs as if life is one big 2016 sjw rekt compilation. With a lot of the cuts currently being made by musk it's puzzling to see so much support when cutting funding to Institutions that are fundamental to the day to day operations of the US, and even ones that aren't as critical such as the park rangers are still part of the reasons people visit the US and boost tourism. I understand there's a wish to cut unnecessary government funding but this is also an incredibly unstable way of doing it instead of properly auditing the system and making changes in a more methodical approach. I've seen more backlash from Republican voters but I've also seen a fervent support for him that's almost fanatical, do they truly believe trump is god or is there a cult following in which people are begging to reject the truth even if it hurts them? Is the right wing just more cohesive or is it just more akin to a cult?",
    "comments": [
        {
            "author": "EscapeFromTexas",
            "body": "Rutgers University media scholar Khadijah White says the strategy serves to excuse corruption from one’s political allies by portraying one’s opponents as equally corrupt.[16] Shared enjoyment of owning the libs maintains group cohesion among a conservative voting bloc, according to Nicole Hemmer of Columbia University. Hemmer views the strategy as a substitute for the cohesive conservative ideology that existed during the Cold War.[16]\n\nhttps://en.m.wikipedia.org/wiki/Owning_the_libs",
            "score": 76,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "That's an intriguing concept, it definitely explains how there can be more corruption but they often overlook it so long as it's happening in their circle",
                    "score": 21,
                    "replies": [
                        {
                            "author": "EscapeFromTexas",
                            "body": "Rules for thee but not for me. It’s the authoritarian golden rule.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ywnktiakh",
                    "body": "THANK YOU for an actual answer.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "CheshireDude",
            "body": "Right wing policies, by definition, do not benefit >99% of right wing voters. So since Republicans getting elected does not improve the lives of Republicans, the only metric of \"success\" they have to justify that their support for the Republicans was correct is how scared, upset, and miserable it makes the \"wrong\" people, i.e. liberals and minorities.",
            "score": 37,
            "replies": []
        },
        {
            "author": "Unknown-Comic4894",
            "body": "Cognitive dissonance and self hatred.",
            "score": 25,
            "replies": [
                {
                    "author": "Outrageous_Can_6581",
                    "body": "That first part for sure. I ruined the last holiday dinner by telling my brother that he needed to start living his own values. For once, it landed, and it’s a hard thing for some people to process. \n\nBut that’s kinda a pervasive social issue. I couldn’t count the number of people I have met that overtly believe their economic disposition negates their spoken values. In my head, your actions are your values. That’s it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "hoopnet",
            "body": "Trump has some how has tricked them into finding joy in \"owning libs\" as wins, instead of actually improving their material conditions. These Republicans instead of sympathising with other workers or offering solidarity offer sentiments about they get layoff in the private sector, so Fed workers should just deal with it, whilst at the same breath idolising billionaires like Musk and Trump, who are the least hardworking people in the world who never have to suffer the consequences of their incompetences",
            "score": 21,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "Yeah I'm just struggling to see how they can support as much hypocrisy as possible even when they've seen it negatively effect them they just jump for joy too see it's upsetting someone else",
                    "score": 5,
                    "replies": [
                        {
                            "author": "hoopnet",
                            "body": "I agree, if on a purely self interested perspective it doesnt make sense. it just shows how powerful the Murdoch propaganda machine is",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "APEX_REAP3RZ",
                                    "body": "I often wonder if it is mostly people who are blinded by propaganda but it seems impossible to try and sway these people from the right, whether it's through hatred or through genuine belief they often appear stubborn to accept any other belief than the one they hold. So if facts don't work and empathy seems to fall on deaf ears as they don't have compassion for those they target what is the solution? Trying to get them to ditch the culture war in favour of the class war feels impossible.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "hoopnet",
                                            "body": "I wonder what the threshold is for conservatives being materially impacted will get them to see the that Elon and Trump are just grifters out to make money and gain power for themselves. I was reading in another sub about the measles outbreak, will take curb the anti vaxxers? Probably not sadly",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "APEX_REAP3RZ",
                                                    "body": "Unfortunately while RFK is in the government they will claim that it's fine and normal (as we've already seen him claim) and that they have someone on their side to validate their antivax claims",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mightbearobot_",
            "body": "Brainwashed by decades of propaganda",
            "score": 15,
            "replies": [
                {
                    "author": "321kontakt",
                    "body": "AM radio, Rush Limbaugh, etc. I found John Birch society handouts in my grandads papers after he passed",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "PermiePagan",
            "body": "I've read that about 30% of the population just prefers things being the way they've always been, just psychologically. This makes sense for a species, as it keeps traditions alive that might be necessary over the long term, even if they don't make sense in a given year. \n\n\nThe issue is this has been weaponized by the Oligarchs by creating a media machine that pumps a constant barrage of \"OMG the Woke Mind Virus is changing things for the worse! They're coming for your kids and traditions!\" rage bait content to keep them engaged. \n\n\nBecause it creates this \"Us VS Them\" thinking, they see anything that harms the other side as good. So \"owning the Libs\" is a net good, because it reinforces \"Team Tradition\" in their minds. When they get hurt, that's ok because they're just sacrificing so that their side \"wins\".",
            "score": 5,
            "replies": [
                {
                    "author": "ThrowRA-Two448",
                    "body": "I'd say this is part of the reason, because if you want to manipulate people, don't promise them shit you can't deliver, make them feel afraid of losing what they already have.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xFuManchu",
            "body": "It's nothing new. \n\nThere's a saying, Don't cut off your nose to spite your face. These people fall into a group that will do just that and have done forever. \n\n\"Is it hurting a group of people I don't like? yes, well then I don't care and I shall cut of my nose\".",
            "score": 6,
            "replies": []
        },
        {
            "author": "superchiva78",
            "body": "Conservatives would eat a pile of shit if it meant that we all had to smell it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "goergesucks",
            "body": "It's been interesting to watch right-wing politics circle the drain for the past couple decades, but the actual explanation is pretty elusive and probably very nuanced.\n\nMy own theory is hard to put to words, but basically, millennials. As a generation, millennials were really confronted with the reality that life on this earth is shit, we are all nothing more than meat in the grinder while an affluent few truly enjoy life. \n\nMany millennials like myself embraced radical leftism as a result. We were able to analyze why the world was shit and what should be done about it to make it better.\n\nBut many millennials embraced a sort of Joker-esque futilism, an understanding that the world was shit and a desire simply to see it burn, because anything is better than how it is. Some of the more intelligent ones were able to capitalize on this disenfranchisement - professional grifters - who further snowballed this sentiment into a petty, toxic and narcissistic movement of people who's entire identities are enjoying other people's suffering.\n\nSo no, there is no longer any right-wing ideology. Ironically, I just listened to an interesting radio segment on some public radio station from the perspective of the \"schism\" within the Murdoch family on the eve of Rupert Murdoch's forthcoming death, and how many in the family - Rupert included - have abandoned any and all ideological positions they had previously and have fully embraced the pursuit of simply vilifying and demonizing anything considered 'left'. \n\nIn my personal opinion, we have seem the collapse of conservative politics in the face of the crushing weight of contradiction. Reactionaries have now embraced a more pure and visceral anti-progressiveness for the sake of misery and suffering, and a willingness to forge a world in which the misery truly becomes the point.",
            "score": 4,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "I feel as if the left has just taken over communism and the red scare, many of the boomer generation still experienced that grew up with the cold war being fresh in their mind. The great big scary communism is now woke/liberal or whatever other buzzword they use and simply refuse to engage in any discussion with it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ThrowRA-Two448",
                    "body": "Don't make it about intelligence though. I'm a millenial, MESA member, I did my homework, I see the grifting, I see it working I see these self interest groups stuck in their own ideologies, flinging shit at each other because they are stuck in the mentality of zero sum game... in order for them to win somebody has to lose.\n\nAnd it just wants to make me see the world burn even more.\n\nBecause when things go to shit, then people pull their heads out of their asses and get back to the basics.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "etPereat_Mundus",
            "body": "Another element of tribalism. People want to see an out group suffer even if it means they also suffer.",
            "score": 3,
            "replies": []
        },
        {
            "author": "guspasho_deleted",
            "body": "Similarly liberals shot themselves in the foot by voting for Jim Crow Joe, later Genocide Joe, and doubling down on that by trying to elect Holocaust Harris.\n\nPartisan politics as a whole is a cult. Honest passion for policy goes in, nothing but amoral partisanship comes out. The corporate media invented and manipulates the political identities liberal and conservative to keep the working class divided and at war with itself.",
            "score": 5,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "And this is why it confuses me so much, it appears that nothing you do can get people to ditch the culture war for the class war",
                    "score": 4,
                    "replies": [
                        {
                            "author": "guspasho_deleted",
                            "body": "Get them off of the corporate media and away from the whole ecosystem of \"independent\" media that just tails the corp media. IMO our current task is to build a proletarian mass media to build class consciousness. We need to express our own narratives and our own agenda that is not filtered by capital, is principled, and is resilient to attack by capital. It will get easier as peoples' material conditions deteriorate.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "APEX_REAP3RZ",
                                    "body": "So then we must find some way to organise and distribute a proper left wing media source to be able to offer up to the mass media alternatives",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jackberinger",
            "body": "So when you have a candidate that you voted for that is absolutely horrendous and terrible in every way you can either admit you are wrong or say it was to own the other side. Now you know.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MonsterkillWow",
            "body": "It's cult behavior and spite. They fell for the radicalization tactics of fascism. Remember the nazi footsoldiers? Their whole volk thing and how they said it wasn't about class or wealth? The guys on the ground went against their class interests in the name of some fictitious service to the state and nation. In reality, they were transformed into glorified slaves for the capitalist class. The same thing is happening here. They are being asked to sacrifice for faith, fatherland, and their in group. It is violent chauvinism.\n\n\nBy selling people the idea that they are in crisis and that they are losing their sense of identity and purity of their society, that democracy has failed them and they need tyranny and a strong hand to purify the country and restore their sense of identity, Trump has manipulated the people against their own interests. Many people, once compelled by these arguments, are willing to sacrifice their freedom for an answer to the perceived injustice. (And in reality, there is no injustice. Any correction to unjust power is seen as unfair and a loss by the privileged, since that is what they are used to having.)\n\n\nSome people have a type of personality which caves to authoritarians, while others rebel. Those who cave tend to feel a deep internal sense of fear and distrust of outsiders. They strongly need to conform. They are the types to side with a bully, even if they themselves are bullied. \n\n\nThat's what you are seeing happening here.\n\n\nThe way to fight this is to remind people that we are all essentially the same and in the same boat. The capitalists do not actually care if you are a proud WASP. You are still just another tool for making them money. You have more in common with another worker of a different race or an immigrant than you do with Donald Trump or Elon Musk. They may be happy to punish the minorities, and to the footsoldiers, that may look like a special privilege for them, but it isn't. Behind the scenes, they are all being robbed and subjugated. \n\n\nTrump is laughing his way to the bank, as we saw with his $50 billion gain from his memecoin. As for whether Trump is actually a fascist or not, I've seen people say he isn't one because he doesn't have to be one. He's using their rhetorical methods, but there is no left opposition to violently oppose him. Fascism was brutal and bloody because it needed to be to satisfy capitalist interests and crush opposition. The gloves don't actually have to come off here. He can skip ahead to the looting phase, since there is no communist army coming to fight him.",
            "score": 3,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "We are watching the US hurtle towards fascism openly unfortunately, it is imperative that people rebel at every opportunity possible.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MonsterkillWow",
                            "body": "It's almost a kind of post fascism. Fascism emerges to crush the left opposition. In America, there is no left opposition. Trump will transform it into a rigged autocracy and loot the working people, rolling back decades of hard fought economic rights. He'll throw red meat to his supporters with his racist and chauvinistic antics. But it isn't exactly like the fascism of the past because he won't be needing to declare martial law and mass imprison and execute opposition. There is no militant opposition. Because there is no strong communist presence here. \n\n\nIt has all the flavors of fascism, but he gets to skip ahead to the good stuff for himself and his billionaire business buddies. He doesn't have to become Hitler or Mussolini. The people already surrendered.\n\n\nhttps://youtube.com/shorts/N5r0jKN350Y?feature=shared",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "APEX_REAP3RZ",
                                    "body": "I suppose the ideal fascist government is one that doesn't require a night of the long knives to get there. They were I guess duely elected and have been handed the mandate to tear America apart, the only saving grace would be the institutions and checks and balances that are supposed to slow anything like this down.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MonsterkillWow",
                                            "body": "Well, fascism or any form of autocracy is self defeating. There WILL eventually be an overthrow when the rich make life miserable enough. It's just life is still comfortable for most Americans. But when they roll a lot of stuff back and make cuts, that's when you will see a real rise in the left. \n\n\nIt's not a coincidence that people are now making Luigi jokes and talking jokingly about revolution. In 2010 or so, the tea party folks made jokes about dismantling the govt and crushing liberals. Where we go in a few decades remains to be seen, but if the current path continues, I expect the anger from working people will drive action.\n\n\nAnd THEN, we will see an authentic fascist retaliation, perhaps. But with modern technology, it may become harder and harder to get rid of the stranglehold the rich have.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThrowRA-Two448",
                    "body": "There is a economic/social/cultural crisis going on, Trump didn't invent any of that shit. The list of sympthoms is very long, if you are interested I will write you some examples.\n\nWhat Trump did is, just as Hitler he came at the right time to use it for his own devices. Unlike a lot of wannabe dictators which were born in wrong time.\n\nTrump hired Steve Bannon, which actually knows a bit or two about sociology. Steve is a big fan of[ Strauss–Howe generational theory](https://en.wikipedia.org/wiki/Strauss%E2%80%93Howe_generational_theory) he realized that we are entering a period of Crisis when people want economic socialism, strong goverment, traditional values (actual traditional values).\n\nAnd just like the Nazi manipulated this sentiment. Not only is the feeling of crisis being amplified, but it's also being redirected.\n\nInstead of socialism, we are getting social-chauvinism => olygarchy\n\nInstead of stronger goverment, we are getting actual fascist\n\nInstead of actual traditional values, healthy masculinity, spending time with family, raising children...we are getting men which treat women like meat. Trump serial monogamist, sexual predator, fucks pornstars. Elon Musk breeds women like incubators on two legs via IVF, Andrew Tate?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lexicon101",
            "body": "Essentially, they're pissed. There are real reasons they're pissed, valid reasons. They've been taught to dismiss all of these real reasons and all of the valid solutions and only given scapegoats as acceptable alternatives. So, without a way they can see to really win within the system, the only place their anger can go is to start breaking shit at random.\nPeople tend to view them as silly and nonsensical or hateful, but honestly the side they're even aware of or willing to listen to closer to the truth (dems, the other face of neoliberal party) has done nothing but sneer down their nose at them and treat them like assholes, so given the depths of the indoctrination here and the ideology of self-reliance built into that, I think thrashing aimlessly and trying to tear the whole thing down, while self-destructive, is a pretty understandable direction to take things. Nobody ever told them their anger was justified and gave them the RIGHT direction to apply it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ThrowRA-Two448",
            "body": "If you take a timemachine and travel back to 2012, you get to find out who started the trend of drinking tears.\n\nDrinking male tears - *is a phrase used by feminists to mock men who complain about reverse sexism or claim they have it hard when it comes to equal pay, discrimination, and harassment.*\n\nBut lets get back to the 2011 - Occupy Wall Street protest where pendulum was swinging in the direction of 1%, so these large media houses owned by the billionaires shifted the narrative from class struggle, by overreporting about gender issues, racism, LGBT... etc. And Dems decides their policy would be throwing some cheap bones at progressives instead of taking some from 1% and giving to the masses.\n\nThe victimhood brigade cult found themselves in position of power, where they were inventing all these new ways to be racist, sexist toward evil white men, when evil white men would feel butthurt, they would fill their cup with white men tears, take it to their safe space in campuses to drink. Which fueled the growth of the alt right... victimhood brigade pushed the pendelum to the right.\n\nNow this pendelum is coming back, really, really fast... the alt-right doesn't really give a fuck Trump is a billionaire throwing them cheap bones. They want their share of tears to drink.\n\nTL;DR - 1% turned the masses into flinging shit at each other, \"enjoy\" the shitshow.",
            "score": 4,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "Yeah I do remember the early days of feminism and the Internet. I feel like the cogs of the propaganda machine have ramped up quicker than ever especially with the more fervent hatred towards LGBT or immigrants more than ever. The sjw rekt compilations were only the beginning of them to somehow snowball towards fascism",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ThrowRA-Two448",
                            "body": "Yup, media in the US is actually infotainment, propaganda, tool used by the rich to manipulate the masses, have peasants fight among themselves. And it's fucking working, isn't it.\n\nHowever I would disagree on there being a lot of hate for LGBT, minorities, women. Majority is still supportive, what is being hated is Social-Chauvinism, like reverse racism... which is... well racism with extra letters.\n\nAlso I have no idea how much hatred immigration gets due to outright racism. And how much because certain groups are losing due to immigration (just like certain groups lose due to globalism), and people feeling like their race/ethnicity is being replaced by immigrants (does this even count as racism?)\n\nAnd yes, it's history happening all over again... just like back in the 1928 Germans voted predominately left-center, but due to foreign interference Germany couldn't form a left-center goverment. Then Nazi essentially tricked the masses with National-**Socialism,** then threw the socialist brownshirts under the train (night of the long knives) and gave a bunch of shit to 1% rich industrialist through privatization.\n\nAmericans wanted Bernie Sanders, but 1% doesn't want that. So Americans gets to chose between right and left offering two different flavours of social-chauvinism... socialism for the chosen. \"Left\" got some from dems, \n\nTrumps version is National-Socialism... a lot of billionaires and MAGA which are social-chauvinism riding together.\n\nWhat is going to happen, sorry, what is already happening? MAGA is getting thrown under the train. Egg price is not going down, promised tax breaks for middle class not included in the bill. Destroying Federal program will end up hirting red states the most, billionaires are also dismantling agencies which protected us from the billionaires... and Trump will either make US a fascist country. Or US becomes a hybrid regime, like Russia is... looks like democracy, isn't one.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "APEX_REAP3RZ",
                                    "body": "Yeah I mean if some of the things I've seen floating around like the tech city state oligarchs then we really are fucked and heading into a dystopian America. It's scary to see so many supporters of this new regime where hatred is seen as just a part of their ideology. They hate anyone who isn't maga and especially anyone who isn't in their eyes \"American\" or Christian. America is inching closer to fascism and more than ever someone needs to slam the brakes on the nazi train.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bootziscool",
            "body": "Honestly it's not that deep. Public relations is way more about trust than truth. Shitting on people you don't trust is just part of reinforcing mistrust.\n\nDoesn't really matter if in truth it's not helpful to you, because anyone who tells you that is probably not to be trusted.",
            "score": 2,
            "replies": []
        },
        {
            "author": "freedom_viking",
            "body": "It’s part of JDPON Dons long term strategy to usher in the Chinese century  (this is a joke)",
            "score": 2,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "I mean, honestly at this point he might just actually do it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rammerjamer1245",
            "body": "The biggest cult to date. Kind of reminds of something in Europe way back when",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kawaiithulhu",
            "body": "Hate and rage are addictive, but also self-quenching. Once the original rage dies down and the emptiness becomes overwhelming, only deeper rage can rekindle the feeling. It's a spiral. Forever, more and more rage is needed over time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LeftyInTraining",
            "body": "I think the \"screwing themselves to own the libs\" idea is overblown, typically stemming from a surface level understanding of people's motivations. That's just not how people work. I would venture that these sorts of people are either so disconnected from their larger society, put too much weight on the perceived advantages of a policy and not enough on its detriments, or genuinely think that they will not be negatively affected. ",
            "score": 2,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "I will agree that the majority of sensible people won't be just trying to own the libs, but those that are negatively impacted by policies have a tendency to screech about the \"lib response\" instead of questioning the policies. There's definitely a massive amount of cognitive dissonance where people are realising that they are being negatively affected but believe they shouldn't be.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "LeftyInTraining",
                            "body": "Yeah I think there's definitely something to that last part. People can go from \"X will not negatively affect me\" to \"X is negatively affecting me because some group is corrupting its implementation.\" People will make lots of excuses for why they or what they believe in aren't wrong. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "diecorporations",
            "body": "Truly strange peoples.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hawmanyounohurtdeazz",
            "body": "Medicaid and Social Security cuts should be hitting right about the time people realise there are no day laborers for their construction business",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeaglanOMulrooney",
            "body": "Libs genuinely suck though, they deserve all the owns",
            "score": 2,
            "replies": [
                {
                    "author": "APEX_REAP3RZ",
                    "body": "I mean I can agree neoliberalism is shit, but does that mean shooting yourself in the balls is worth it to shoot someone else in the foot?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "JumpinJangoFett",
                            "body": "What do you think would happen if there was another election held tomorrow?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThwaitesGlacier",
                    "body": "People on the right do it out of spite though. Liberals to us are like that naïve younger brother you tease to help him see the error of his ways.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}