{
    "title": "Can you imagine?",
    "author": "Ok_Permission2523",
    "subreddit": "socialism",
    "rank": 75,
    "score": 7,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/socialism/comments/1j12rv2/can_you_imagine/",
    "id": "1j12rv2",
    "selftext": "It'd sure be nice to see Democrats and the DNC apparatus fighting as passionately against Trump and Musk's 'tax breaks for the rich, austerity for the rest of us' approach as they have been over Ukraine these past 24 hours...",
    "comments": [
        {
            "author": "tecate_papi",
            "body": "The Dems fight for the things they want to and don't fight for the things they don't.\n\nAlso, this is r/socialism. The Dems are *not* and *never have been* a socialist party. They're liberals and capitalists. So I'm not sure this is the right place for you to whine about the state of the Democratic Party.\n\nThe only time the Dems (or the Republicans before they switched) ever actively fought to help the working classes was under FDR. The concessions he made as part of the New Deal were made to ensure the survival of the country, the upper classes and to keep the country from sliding into fascism. FDR was never a socialist. He was a politician who did what he had to do at the time he had to do it.\n\nThe Dems today have no such figure among their ranks to make the types of concessions they need to keep the country together. They offered no grand vision of the future. They offered working class people nothing. No hope. No major changes. Nothing. They've spent the last 30 years focussed entirely on identity politics and the culture war and tried to assure everybody that class was an outdated way of thinking and that class as a concept in politics had withered away with the collapse of the USSR. Francis Fukuyama told them as much in the 90s and they will be damned before they learn a new thing about the world. Turns out they were very wrong.\n\nThe libs today are too arrogant and way too complacent to acknowledge their own faults or interrogate the reasons for their own electoral failures. They are aware of the threat Trump poses but they and their backers are unwilling to make the types of concessions they need to make. They would rather lose everything by force than give up a fraction of anything by choice. And a lot of their backers, like Jeff Bezos, have already shown they can make the switch without losing any sleep.\n\nIf the Dems cared a whit about the poor they'd have said so by now. Fuck 'em. We're on our own.",
            "score": 14,
            "replies": []
        },
        {
            "author": "InspectorRound8920",
            "body": "Or against the left for 60 years",
            "score": 6,
            "replies": []
        }
    ]
}