{
    "title": "Thoughts on Ocalan’s call for the PKK to disarm?",
    "author": "EmberSraeT",
    "subreddit": "socialism",
    "rank": 68,
    "score": 13,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/socialism/comments/1j1iazm/thoughts_on_ocalans_call_for_the_pkk_to_disarm/",
    "id": "1j1iazm",
    "selftext": "and what’s next for the Kurdish struggle in Turkey and other countries?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "HenriGL",
            "body": "I think it's terrible, kurdish self-determination seems to be farther than ever.",
            "score": 5,
            "replies": [
                {
                    "author": "ShamanLady",
                    "body": "I hope Kurdish people get their rights in their respective countries but I am against ethno-states and ethno-nationalism.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HenriGL",
                            "body": "The kurdish got arabs and assyrians among their ranks, in rojava they got laws protecting ethnic minorities",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "entrophy_maker",
            "body": "While Ocalan's prison looks much nicer than the US or some other countries, I would not doubt Turkey has tried to coheirs him into saying stuff like this. So I'd take it with a grain of salt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingCookieFace",
            "body": "Not sure what to make of it, it could be good for Rojava if it helps the peace process there. But I’m not sure.",
            "score": 1,
            "replies": []
        },
        {
            "author": "manihatefascists",
            "body": "some leftists are sceptical of it because Erdogan wants to make a new constitution but needs enough people to support it, theyre trying to appeal to kurds to get DEM partys votes. the new contitution aims to strip away a lot of rights, most prevelantly the LGBTQI+ rights by essentially illegalazing them. \n\nwe will see what happens but they wouldnt try extending an olive branch if they didnt havr anything to gain, especially from one of their biggest enemies.",
            "score": 1,
            "replies": []
        }
    ]
}