{
    "title": "I think Yugoslavia was a great socialist country.",
    "author": "West-Worry-6118",
    "subreddit": "socialism",
    "rank": 40,
    "score": 167,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/socialism/comments/1j2ab83/i_think_yugoslavia_was_a_great_socialist_country/",
    "id": "1j2ab83",
    "selftext": "    Although their ending was miserable and tragic, I think the socialism implemented by Tito was excellent.\n\n    The United States is the main culprit in bankrupting them.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "PropJoe23",
            "body": "As someone who lived in it (though it dissolved not too long after I was born, but long enough that I remember lots of it) I can say it was pretty good. It has problems, it has some serious ones, but it most definitely cared more about its citizens than any of the countries that came after it.\n\n\nIt is worth noting that it was the most 'western' of all the socialist countries in Europe, and it was helped by US and other western countries because of its negative stance toward USSR.\n\n\nMy parents got their apartment after my older sister was born, from the state, like many families did. Of course that the ruling class ended up being a separate class and got rich thanks to their positions, but unlike now, it felt like like, at least to some degree, it was trying to take care of its citizens.\n\n\nI do miss it, as pathetic as that sounds.",
            "score": 121,
            "replies": [
                {
                    "author": "irishitaliancroat",
                    "body": "Nothing pathetic sounding about that to me, friend.",
                    "score": 39,
                    "replies": []
                }
            ]
        },
        {
            "author": "entrophy_maker",
            "body": "I like that they were worker owned, but they messed up by letting the workers keep all the profit and not redistributing it. When there were industries greatly succeeding or failing along the lines where different ethic groups lived it caused a rise in nationalism that led to cries for independence. Had they implemented more central planning they might still be around today.",
            "score": 77,
            "replies": [
                {
                    "author": "unansweredunpleasant",
                    "body": "This is interesting. Do you have any suggested reading material for someone who wants to understand in detail how this happened? Ideally, historical works that outline how Yugoslavia's economy was organized, and specific examples of how its decentralization ultimately enflamed feelings of nationalism. \n\nAsking because letting workers keep as much of the profit as possible seems like a good idea, on the face of it - like it would motivate people to be more productive, while reducing dependence on unaccountable bureaucracies to decide who gets what. Was it really this practice that destroyed Yugoslavia, or any number of other things?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "entrophy_maker",
                            "body": "Wikipedia isn't the best source, but it has sources sited in this one. There are lots of site documenting this as the main reason for the fall. Of course it wasn't the only factor, but it was the biggest:  \n[https://en.wikipedia.org/wiki/Breakup\\_of\\_Yugoslavia](https://en.wikipedia.org/wiki/Breakup_of_Yugoslavia)",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vladjjj",
            "body": "Yugoslavia was the closest to a socialist success. It was highly industrialized and yet a tourist haven. Not to mention that citizens were allowed to travel abroad, and without a visa for most countries.  \nNow, this was also due to geopolitics. Tito successfully played both the east and the west, while forming strong alliances with the global south, whose infrastructure was basically built by Yugoslav construction companies.  \nIt's unfortunate how it all ended, since today's republics are a mere shadow of what was once a great country.\n\nBut don't be fooled, the nationalist villains who tore the country apart were all once members of the Communist party.",
            "score": 63,
            "replies": [
                {
                    "author": "Swimming-Purchase-88",
                    "body": ">But don't be fooled, the nationalist villains who tore the country apart were all once members of the Communist party.\n\nThis is the most important lesson that every communist needs to remember. This, and how USSR fell without a resistance from the proleteriat.\n\nThe party should not fall victim to thr bureaucracy and the proleteriat must have access to it in any way possible.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "GrandProfessional941",
                            "body": "In the case of the USSR, there wasn't any resistance from the proletariat because the USSR had stopped serving them a *long* time ago.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Nylo_Debaser",
                            "body": "The truth is that the revolutionary generation of party members will be comprised of those who joined the party because of morals and ethics and wanting to build a better world. In subsequent generations of party membership there will be these types of people, however, in those generations the party will also attract those whose only motivation is their own individual power and wealth (as they will see party membership as the only path to this)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BiteClear",
                    "body": "They had to join the party to ruin it.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "IllFollowing1295",
            "body": "Interesting fact about Peter Falk, the actor who played Columbo: As a young man, he was a union member and also traveled to socialist Yugoslavia at the time, where he spent half a year helping to build a railway line.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fucksteam003",
            "body": "I firmly believe if Yugoslavia existed today, it will be a superpower in Eastern Europe and equal status as Germany. And Ukraine war will never happen.",
            "score": 4,
            "replies": []
        }
    ]
}