{
    "title": "Is it moral to own a business if you're a socialist?",
    "author": "mmm88819",
    "subreddit": "socialism",
    "rank": 22,
    "score": 36,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/socialism/comments/1j3oyp2/is_it_moral_to_own_a_business_if_youre_a_socialist/",
    "id": "1j3oyp2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "stgotm",
            "body": "If you don't steal your workers surplus labour and they can opt to be part of it in the long term via stocks or co-op partnership, sure.\n\nAlthough I think being a socialist is irrelevant in the question. It is immoral to steal the workers labour, period.",
            "score": 152,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Peespleaplease",
                            "body": "The exploitation of the working class is theft. Workers only work to receive wages and not anything else.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "PuzzlePassion",
                                    "body": "As an ex business owner turned communist I can say I knew this even when I bought the capitalism crap. Anyone who says otherwise is too far gone to waste my words.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Peespleaplease",
                                            "body": "What do we pay workers for? Everything. From construction to agriculture to medicine to everything. All funds would be put towards those who make/operate the various benefits they create. By \"growing class of people,\" I'm assuming you're talking about children? There's already funding put towards public education. What would be different under a socialist system? I guess that funding would be put to better use under that system.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "socialism-ModTeam",
                                                            "body": "Hello u/CompetitiveRaisin122!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "socialism-ModTeam",
                                            "body": "Hello u/CompetitiveRaisin122!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "socialism-ModTeam",
                            "body": "Hello u/CompetitiveRaisin122!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pagan0101",
            "body": "Depends on the size. If it's a solo-project type of thing then it's probably fine. But if you have quite a few full-time employees you should probably make it a workers' co-op if you want to uphold socialist ideals imo.",
            "score": 110,
            "replies": []
        },
        {
            "author": "Peespleaplease",
            "body": "Being the sole/an owner of an economic entity would be contradictory to socialist ideas. A workers co-op would be more ethical, but you'd still be participating in the capitalist system, competing with businesses that aren't co-ops and, more often than not, acquiring resources from such as well.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Kris-Colada",
            "body": "You can own your own business. How do you wish to go about paying your workers or how you wish to handle your business in an ethical way. This is what matters",
            "score": 11,
            "replies": []
        },
        {
            "author": "Sticks_to_Snakes",
            "body": "Morality isn't a part of the question, strictly speaking. Capitalists aren't evil, evil is ill defined and depends very much on who is saying it. Capitalists act in their own self interest, and the interest of their class. They act against the proletariat, making them class antagonists.\n\n\nJust as I'm sure there are morally dubious communists and socialists, I feel comfortable saying there are capitalists who are morally good.\n\n\nIn order to maintain coherency in ideology and thought, it is important to remember to understand the difference between opposed forces and morality. You can argue morality until you're blue in the face, but some people believe it is good and noble and morally correct to extract labor value, rent, and so on. But when you make the focus of your argument the antagonism, how they harm people, and how property deprives us of our time, money, and community, well then you've set yourself on a solid foundation.",
            "score": 40,
            "replies": [
                {
                    "author": "FreedomInsurgent",
                    "body": "who would you say is a morally good capitalist?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sticks_to_Snakes",
                            "body": "I couldn't say specifically, but I'm sure there's an investor who pays their taxes, doesn't hit their spouse, isn't homophobic, donates to charity, but never stops to consider the ramifications of capitalism. They're a hypothetical to illustrate a point. That being that morality is relative, and that makes it a poor point of critique.\n\n\nLike, in response to the question posed, it doesn't matter if it's moral to own a business or not. It's inconsistent with the class interests of the proletariat, and that's where the conversation should begin.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Potential_Cycle_8223",
            "body": "We live in capitalism, there's no moral choice while participating in it. What really matters is working on the  practical task of building the revolution.",
            "score": 22,
            "replies": []
        },
        {
            "author": "groogle2",
            "body": "Ask Friedrich Engels, inventor of (scientific) socialism. \n\nWe need people on our side from all classes, even if the revolutionary class is certainly not the business-owning one.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Uknowmmyname",
            "body": "Listen to this. She runs a business and basically let's the workers share in the profits. Great episode\nhttps://open.spotify.com/episode/6izj9sq1cz6uYksLDLSFuN?si=PyAWSfrkTFmbP0xmbZD7zg&context=spotify%3Ashow%3A7tk1sTZDeE8p9lnxYLy4Ky",
            "score": 5,
            "replies": []
        },
        {
            "author": "Grandmas_Cozy",
            "body": "I own a motel and a bar and restaurant. It’s hard to do it ethically. I actually did offer my employees a co-op and they didn’t want it.  I struggle with so many parts of it. I currently have 3 people who work for me, and it’s hard on every level. Someday when I have more spoons I’ll go into more detail and create a post about it but the bottom line is I’m operating in a moral gray area all the fucking time.",
            "score": 4,
            "replies": []
        },
        {
            "author": "VictoryToThePeople8",
            "body": "Sure. I know plenty of people in the North of Ireland who do and it helps build community.",
            "score": 10,
            "replies": [
                {
                    "author": "KlausTeachermann",
                    "body": "Dlúpháirtíocht, a chara.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VictoryToThePeople8",
                            "body": "Dlúpháirtíocht! :-)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zealousideal_Fee3510",
            "body": "Morality and ethics have nothing to do with it. It's a matter of utility. Our legal system has determined private property to be a real and defensible thing. Think of it as a resource you need to win a war.\nWe should have more socialists running businesses and here's why:\n\nOne, so there's at least an alternative place to land while we organize and eventually commit to a general strike against the corporate overlords and two, because I'd rather support that than the alternative. \n\nI get pushback against this all the time, but it's effective because people can support that easier than exhaustive politicking with little to no payoff. You build enough parallel systems and eventually you become the system. Particularly, if you draw more people to your cause without radically disrupting their day to day lives or directly challenging the government. They say you can't work within the rules to change things, but you have to at least be willing to call their bluff before you rock the boat completely. Building momentum is critical, the right amount of pressure at the right time can make a real difference.\n\nBack to your question, I'd say the ethical dilemma is how you treat people that are part of your operation. Hypothetically I've always wondered, what if we sold our labor as a business?\n\nImagine a scenario wherein everybody sets up an LLC and will only work for a non socialist company as a B2B contract arrangement versus simply being a wage employee.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AugustoSF",
            "body": "Well... Pragmatically speaking, don't worry about it. Pay your employees fairly, treat them well, be a nice boss. That's enough for now. However, if you want to deepen the discussion, things are a bit more complicated and nuanced.",
            "score": 3,
            "replies": []
        },
        {
            "author": "heppyheppykat",
            "body": "Owning a physical building where business takes place? Fine. Owning your employees and their work? Not socialist. Run as a co-op it would fit in. \nThere are still shops in the most stringent communist countries. \nMany businesses can operate within a capitalist framework while aiming for socialist ideals. ",
            "score": 5,
            "replies": []
        },
        {
            "author": "youreveningcoat",
            "body": "I think it’s okay in this current age of capitalism, as we can’t practically outright refuse to participate. A business is a framework that can be used by anyone, take for example a family owned business where the owners work in the business themselves. Or better yet, a non-profit.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MammaCat22",
            "body": "Yes! I believe if your business is a scale where you know every employee's name and you compensate fairly for their labor, then no problem.\n\nYou can share your means of production by making it employee owned or employ a co-op structure. I personally don't even have an issue if you own the means of production with a caveat: once you've paid wages (employees and yourself), paid for your means of production, put some money in savings for possible future expenses, any money left over should be across the board bonuses. Once you're ready to retire, first offer to sell your means of production at the cost that you still owe (for example property and you have an outstanding $50,000 mortgage), or donate if you fully own the means.\n\nI don't have a problem if you took a pay cut for the first few years and earn slightly more later on to recoup that. But once that is recouped then money should be shared equally as it was everyone's labor that got you there",
            "score": 2,
            "replies": []
        },
        {
            "author": "CaringRationalist",
            "body": "Engels was a factory owner, and in theory you can structure your business as a co-op or give employees another form of ownership.\n\nIf you're a sole proprietor or the business is small and ownership is divided equally among the people working there it's fine.\n\nThat said, in practice it can be more complicated than that and you may not have the means to start a business without taking in money, which always has strings attached. I've started a business in cannabis. We will be employee owned, with employees owning the second largest chunk of shares. That said, I had to give up 34% of the company to capital interests, which isn't terrible in the grand scheme of things but means at least that much surplus labor value is being stolen by definition. Now I fully intend to use profits over time to buy out those shares for employees, eventually netting non-executive employees 55% of the company making it technically fully employee owned and controlled (at which point I hope I've instilled enough class consciousness for employees to then buy out myself and my other main minority business partners).\n\nSo in the short term, no, my company isn't socialist. It's governed by socialist ideals, and we will be by far the most equitable company I'm aware of in my city, but there's absolutely surplus labor value being taken. In the long term though my goal is to have created and finished a project which employs capitalist strategies to transition the business to a truly socialist structure.",
            "score": 4,
            "replies": []
        },
        {
            "author": "WhereIShelter",
            "body": "Nothing I’ll ever have to worry about I’m a working chump",
            "score": 1,
            "replies": []
        },
        {
            "author": "liminecricket",
            "body": "Yes. It may be an imperative. In our circumstance, you have two choices. Your labor will be exploited. Its surplus value will be stolen by an \"owner,\" a \"boss.\" Or, you can seize the means of production. A trade is a good way of doing this, but not the only way. Become a tradesman. Work for yourself. Keep the full value of your labor. Be transparent with your income and expenses, pay your workers fairly, and put them into a position to do the same when they are ready. The capitalist competes, the socialist cooperates. Unionize. Assist allied tradesmen in obtaining independence--when you're a plumber, but now the job requires a carpenter, ensure the carpenter is a comrade. Conglomerate these efforts into self-governing structures of mutual cooperation. Our goal isn't record breaking profits for shareholders year after year--infinite growth in a finite system, aka cancer--our goal is independence from exploitation. Capital only matters when there's scarcity. We must obtain the means of controlling and addressing scarcity to the greatest degree. Until we do this in a concerted way, the benefits of our knowledge, skill, and effort will accrue only to the landlords.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chronically-iconic",
            "body": "Whether it's moral or not based on your sociopolitical belief isn't the right question (in my opinion) 😜 rather, it's a matter of whether or not you're able to operate morally despite being socialist. Ugh the bar is so low in the capitalist society. \n\nI've thought about this plenty, and I've decided that if I ever own a business, I want the same profit as the person employed to do housekeeping in the office. If people employed by me cannot make ends meet, I shouldn't be better off just because I \"own\" the business. Everyone who has a stake in the means of production should reap all the benefits. \n\nWith that being said, would I look down on a socialist who owns a business and makes the most profit in their company? No, because we live in an unfortunate reality where capitalism is a present fact of life and profit doesn't always equal bad (mainly because I never know what someone may need that profit for, they may be supporting sick family or something). I can't really say what is and isn't acceptable, but it's a matter of conscience for me...I am just wired this way. I'm an anarchist, so I also fully believe that other people's actions are far less important than the consequences, so looking at someone make a little more profit as the CEO of a small company is fine by me...where it starts to become annoying is where there is a massive hoarding of wealth and resources sitting in banks. Both are the same action of profiteering, but the consequences are far more severe for everyone else with the latter. \n\nI guess it boils down to moderation too...a business should be successful, but does it require a national monopoly for you to feel successful? Probably not, so just go for it I guess 🤷🏼",
            "score": 1,
            "replies": []
        },
        {
            "author": "DouchebagDictator",
            "body": "Depends. Do you allow workers, once a part of the company, to have direct ownership. Not through buying in, but getting garraunteed ownership and power through labor and performing duties as an 'employee'? That's what I think of when I think of the basics of a socialist society, everyone owns a piece of the pie they help bake, and everyone works to feed everyone else with the surplus. \n\nIf you want socialism to work in a modern setting, think of it as having every single person in a business, all having an exact, equal amount of power in rhe company no matter where they sit on the 'totem pole' of production. No ceos with 78 percent of the companies shares doing absolutely nothing of value and still siezing the means of production, no monopolistic organizations like Blackstone having monopolistic control over the working class as a whole. \n\nIn all reality, capitalism isn't about selling the product, it's about selling the worker, how little can the company give the worker to get them to work. Socialism is about ensuring the truest form of equality for all while still allowing reach through limited private equity. \n\nI'm only 21, so if I got stuff wrong here, feel free to correct below, and thanks in advance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infamous-Associate65",
            "body": "Workers' co-op > business owner",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super_Majin_Cell",
            "body": "Socialism/Communism is not about morality, is about the economic development of human society and how economic systems can become a fetter in production.\n\nIn resume, in the way business are modeled, they will prioritize profits over human development, since human development will not allow for profits in developed countries (since everything costs to much in thesw countries) or when productivity becomes so high the prices lowers, or when human development allows for better working conditions for the workers (thus, less profits for the capitalists).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sihplak",
            "body": "IMO morality isn't even a relevant question. Being a Socialist isn't premised on class background. Engels was bourgeois. Marx was intelligentsia. Kropotkin was a prince.\n\nMoreover, Lenin directly advocated for Communists to create \"local economic strong points\", giving examples of small business types of his time. https://www.marxists.org/archive/lenin/works/1905/reorg/ii.htm\n\nBeing bourgeois or proletariat is irrelevant as a Communist because Communists' job is to interface with and organize the *masses*. In fact, presuming no ulterior motives, it would be a great boon for business owners and others with wealth to back Communists since that would provide the necessary funds to do party work and mobilization. It's not the 1900s where the Bolsheviks could rely on bank robberies to acquire funds.\n\nNot only is there no moral qualm (unless you're a shitty person who abuses their employees), it's even *preferable* for Communists to have businesses owners in their numbers.",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": ">In order to achieve a great object, an important social object, there must be a main force, a bulwark, a revolutionary class. Next it is necessary to organise the assistance of an auxiliary force for this main force; in this case this auxiliary force is the Party, to which the best forces of the intelligentsia belong.\n\nJoseph Stalin. Interview with H. G. Wells. 1934.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jack_in_box_606",
            "body": "I had to scrap my business a few years ago, when I realised that in order to actually make decent money from it, it would require scaling up enough to produce more. This would require me to employ more people to do the actual work (obviously requiring to pay them less than their worth) and for me to manage them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ryuch1",
            "body": "Just pay a fair wage",
            "score": 0,
            "replies": [
                {
                    "author": "ryuch1",
                    "body": "Oh and ofc better their working conditions, less work hours, better equipment, etc",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Many_Mission_6494",
            "body": "How to raise funds as a socialist by Richard wolf",
            "score": 0,
            "replies": []
        },
        {
            "author": "Rezboy209",
            "body": "An independent business where you do the labor of your business yourself? Then you're fine because you're still a member of the Proletariat at that point and the business is your possession and you produce your own wears and are not exploiting other labor. \n\nA worker owned coop where everyone puts in their labor and gets equal returns from their labor (including you)? Then you're also fine because you are not exploiting anyone's labor for your own gains. \n\nA business where you alone profit off of the surplus created by others labor? Well now you are exploiting their labor and you are no longer a socialist.",
            "score": 0,
            "replies": []
        },
        {
            "author": "HeatNoise",
            "body": "Go to the social democracies of the world. Lots of business with social medicine etc. The totalitarian communism of North Korea, China and the Soviet Union is the aberration.",
            "score": -2,
            "replies": []
        }
    ]
}