{
    "title": "I always thought the US was an empire run on free trade, aka it didn't have to invade to control other countries. Why is Trump threatening to invade Canada and Greenland?",
    "author": "engineear-ache",
    "subreddit": "socialism",
    "rank": 30,
    "score": 0,
    "upvote_ratio": 0.39,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/socialism/comments/1j435ue/i_always_thought_the_us_was_an_empire_run_on_free/",
    "id": "1j435ue",
    "selftext": "What would he get access to that he can't get through \"traditional\" means?",
    "comments": [
        {
            "author": "Purple24gold",
            "body": "What? The US has invaded and intervened in countless countries when economic coercion, sanctions, or political subversion weren’t enough.\n\nTrump’s threats against Canada and Greenland fit within a long history of US expansionist ambitions. The US has always sought to secure resource-rich and strategically valuable territories. Trump’s rhetoric, even if it sounds absurd, reflects the reality that the US ruling class is always willing to use force when necessary.",
            "score": 26,
            "replies": []
        },
        {
            "author": "FoxTailMoon",
            "body": "The US economy is literally propped up by the military industrial complex.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Tough_General_2676",
            "body": "The US is an imperialist empire built by stealing land from indigenous peoples. Europeans literally invaded the Americas and took what they wanted. They enslaved people to build an economy, which had nothing to do with \"free trade.\" Currently, we rely on developing countries to produce most of what we consume, which is just another form of slave labor. Exploitation and stealing is the name of the game. \n\nAlso, capitalists don't want real competition....they want monopolies where they have full control of prices, wages, etc. They don't want a fair system. The US is a rigged system and we use our military to bully other countries when we want something from them. We make promises we often don't keep (e.g., protecting countries that gave up their nuclear weapons/programs, for example). \n\nAs an American, I use to believe we were generally a force for good in the world because of the all the propaganda I was fed. But more and more what I see is just another corrupt (fledging) empire that is desperate to hold onto power and relevance. And Trump is exploiting the situation because our checks and balances aren't as strong as some people thought they were. If he goes to war to steal more land, nobody within the country will stop him. \n\nAnd I will add that all large empires do the same thing the US has done. Steal, murder, exploit, rape, lie....until the empire crumbles. Then a new one will develop and the process will be repeated. Humans who seek power throughout history are often very insecure people who want to control others and have grandiose desires to very powerful. We must watch out for any world leaders who think and act like Trump does. But even leaders without less grandiosity can be dangerous, such as most American presidents because they keep the status quo going, despite it harming the planet, other humans, and other species.",
            "score": 7,
            "replies": []
        },
        {
            "author": "fubuvsfitch",
            "body": ">\"traditional means\" \n\nYou mean coups that install puppet governments? Predatory lending? Bullying at the UN level? Sanctions? Military operations? \n\nAre these what you mean by free trade and traditional means? \n\nNo offense but if you're under the impression USA built its empire on free trade and free association, you need to read a book.",
            "score": 6,
            "replies": []
        },
        {
            "author": "DeliciousSector8898",
            "body": "I thought this was a rhetorical question at first on planet doesn’t the US invade other countries?",
            "score": 5,
            "replies": [
                {
                    "author": "CarlLlamaface",
                    "body": "Their propaganda machine is a hell of a thing.  Many Americans have been led to believe that any bad thing in their country's history was actually a justified act of humanitarianism.  Ie. South Americans exercising self-determination by voting for socialist leaders?  They clearly don't understand the evils of communism and must be couped and have their resources privatised for their own good!\n\nAlternatively they just think the historical record is anti-US propaganda and it didn't really happen.\n\nAlternatively alternatively they claim the people committing atrocities weren't Americans yet, just European colonists, therefore it's nothing for them to be ashamed of.  I've been told this on more than a few occasions regarding the genocide of native Americans.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hessian14",
            "body": "Tell that to Afghanistan, Iraq, Somalia, Argentina, Bolivia, Chile, Haiti, Mexico, The Cherokee and Sioux Nations. And countless others",
            "score": 3,
            "replies": []
        },
        {
            "author": "CataraquiCommunist",
            "body": "This post gave me cancer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SeeBabaJoe",
            "body": "Its called gun boat diplomacy",
            "score": 2,
            "replies": []
        }
    ]
}