{
    "title": "How chimpanzees react to an artificial leopard.",
    "author": "Zealousideal_Art2159",
    "subreddit": "Damnthatsinteresting",
    "rank": 17,
    "score": 3278,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 207,
    "url": "https://v.redd.it/gt36w2zlw9pe1",
    "id": "1jdg8r1",
    "selftext": "",
    "comments": [
        {
            "author": "Mr_Bob_Dobalina-",
            "body": "I’m just waiting for someone to post Ace Ventura inside his observation rhino",
            "score": 310,
            "replies": [
                {
                    "author": "ThorIron",
                    "body": "As requested \n\n[Ace Ventura: When Nature Calls Rhino Scene](https://youtu.be/Q8t8Ir9SeRE?si=F8wEj8yZmz-Bp0eF)",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "RustyShacklefordJ",
                    "body": "WAAAAAARRRRRMMMMMMM",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "scottydont78",
                    "body": "Kinda hot in these rhinos.\n\nWARM!!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Claim312ButAct847",
            "body": "That was not cool of Young Fidel Castro to prank those chimps like that.",
            "score": 628,
            "replies": [
                {
                    "author": "PainfulBatteryCables",
                    "body": "That's young Bin Laden.",
                    "score": 77,
                    "replies": []
                },
                {
                    "author": "ratpH1nk",
                    "body": "Was working on his PhD at the time. Early days before he met a young undergrad Arts major named Che.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "elchavo718",
                    "body": "“It’s just a prank bro, it’s just a prank”",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "baobab_bob",
                    "body": "r/brandnewsentence",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CaptainTripps82",
                    "body": "I was a little thrown off after seeing London and France, but not his underpants, right before, that they immediately switched to ISIS footage",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Highwaystar541",
                    "body": "It wasn’t even funny.",
                    "score": -69,
                    "replies": [
                        {
                            "author": "Imaginary-Fudge8897",
                            "body": "Bet you get invited to all the coolest parties.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Highwaystar541",
                                    "body": "Fuck man it’s been awhile. I just think Fidel could up his production value.",
                                    "score": -28,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SonoPelato",
            "body": "Plot twist: those chimpanzees are masked scientists studying how a leopard react to a pack of chimpz.\n\n\nBoth those documentaries were interrupted shortly after.",
            "score": 269,
            "replies": [
                {
                    "author": "Pawl_Evian",
                    "body": "Plot twist: the valley has been replicate to study the thinking process of wild scientist in hostile environment",
                    "score": 13,
                    "replies": [
                        {
                            "author": "ReasonableHorror4073",
                            "body": "Plot twist: the cameraman is indeed a scientist observing how scientists perform their experiments in the wild",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bhyellow",
                                    "body": "Plot twist, Stalin is inside the Fidel costume.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "the_popotnik",
                    "body": "Plot twist : We are the test subjects and they posted this on reddit to see how we react to this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sirgentlemanlordly",
            "body": "That chimp is gonna get so much rep from this fr",
            "score": 133,
            "replies": []
        },
        {
            "author": "Whitekidwith3nipples",
            "body": "how chimps react to a leopard? throw shit at it apparently",
            "score": 43,
            "replies": [
                {
                    "author": "Alarmed_Horse_3218",
                    "body": "Those were some pretty terrible swings with the sticks. I know we’re a relatively weak predator but after seeing them attempt a swing I gotta say we’re not all that helpless.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Drone30389",
                            "body": "Yeah this video makes it pretty clear that humans putting talent points in \"stick\" and \"rock\" was a factor in our dominance.\n\nCan you imagine Roman legions duking it out with Carthaginians like this?\n\nOr Neanderthals trying to take down a mammoth with that throwing style?\n\nThe first human to be able to wield a stick or a stone noticeably better than the status quo must have been a god.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "DarkDonut75",
                                    "body": "Literally Zeus and his thunderbolt",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "davidjschloss",
                            "body": "Yeah they're not great with sticks. But on the other hand they literally could rip your head off your body.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "2gtbt_",
                                    "body": "Mmm no... No they cannot and I doubt they ever could unless they bite it off. Still wouldn't change the fact that it would rock almost everyone's shit up because they would be too afraid to fight back",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "grizzlybuttstuff",
                            "body": "They'll figure it out.\n\nWe did.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Designer_Librarian43",
                            "body": "They are so much stronger than humans. Our advantage against them is our ability to use tools to a much greater degree. Our ability to use tools and comprehend at such high levels, relatively speaking, makes us the most dangerous predator on the planet.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Acidbaseburn",
                                    "body": "The way our joints and muscles insertions are do allow better transfer of force with swinging and MUCH better throwing. A combination of different physiological factors (the way our muscles attach in the shoulder, higher motor neuron density allowing for precise coordinated movements between multiple muscles and joints, the length of our torso, tendons that have more elasticity, along other anatomical changes) allows us to throw very hard and accurately for an animal despite chimps being able to output more raw force\nI’d say humans can swing a stick 4-5x harder than a chimp.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Airway",
                            "body": "Pretty sure the idea was to scare it off, not beat it with sticks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Abducates",
                    "body": "Then the brain thought….what if throw thing is more hurty\n\nRest is history",
                    "score": 14,
                    "replies": [
                        {
                            "author": "DarkDonut75",
                            "body": "Thought process that unironically led to the usage of nuclear weapons",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Facts_pls",
                    "body": "It's what you would do if all you had was a stick and some balls.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Final_Winter7524",
            "body": "Space Odyssey opening scene",
            "score": 76,
            "replies": [
                {
                    "author": "fatigues_",
                    "body": "Yup. Complete with weapon use. Perhaps not *determined* weapon use, but it did not look accidental.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "DickWoodReddit",
            "body": "Chimp rolling that leopard head back to his spot to mount it up on the wall.",
            "score": 133,
            "replies": [
                {
                    "author": "Solid_Liquid68",
                    "body": "Was waiting for the spiked head",
                    "score": 8,
                    "replies": [
                        {
                            "author": "UWO_Throw_Away",
                            "body": "Where’s Bobby B Bot?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "animal1988",
                                    "body": "Or even the tyrion bot. \n\n\"Heads. Spikes. Wall.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hulkmxl",
                    "body": "I thought he was rolling it away from the body so it wouldn't stick back, vampire style where you had to separate and destroy the pieces LOL ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Veran_The_Druid",
            "body": "/r/AteMyLeopardsFace",
            "score": 24,
            "replies": [
                {
                    "author": "House_Of_Thoth",
                    "body": "r/ChimpanzeesStoleMyLeopardsFace",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Colette_73",
                            "body": "😂😂😂",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "urkermannenkoor",
            "body": "That's interesting. \n\nA documentary I watched recently taught me that chimpanzees typically react to challenges by doing loads of cocaine.",
            "score": 44,
            "replies": [
                {
                    "author": "dingo1018",
                    "body": "I the UK they drink tea, specifically just one brand but they get up to all sorts, while going about drinking tea.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "scobot",
            "body": "What I really want to see is footage of them using the artificial leopard head to prank eachother because you know that’s why they took it at the end. Could NOT wait to hide it in eachother’s favorite spots. I can absolutely picture a bunch of overly-innocent chimps saying, hey Rocko, you uh, going to hang out in the bendy tree today? That one you like so much?",
            "score": 17,
            "replies": []
        },
        {
            "author": "SatchmoTheTrumpeteer",
            "body": "In the time of chimpanzees I was a monkey",
            "score": 41,
            "replies": [
                {
                    "author": "BassoTi",
                    "body": "Butane in my veins and I’m out to cut the junkie",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Manuscribble",
                            "body": "With the plastic eyeballs, spray paint the vegetables",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PM_ME_Y0UR__CAT",
                                    "body": "I don’t get this song, or Beck. It’s kinda catchy 🤷🏻‍♂️\n\nMy favourite is how mad he gets  when people ask to hear it at shows.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CELTICPRED",
                    "body": "So open the door. I'm a lizard baby so why don't you kill me",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheHoboRoadshow",
            "body": "\"Once the leopard  is decapitated, the chimp may not comprehend that it is dead, but it clearly knows the enemy is no longer a threat.\"\n\nlol they used to think animals were so mindless. Chimps very clearly comprehend death.",
            "score": 40,
            "replies": [
                {
                    "author": "artificialidentity3",
                    "body": "Yeah, I was gonna say the same thing. Much of what the narrator says is reflective of that mindset. I'm glad to live at a time where different forms of intelligence and communication are being recognized more widely across the animal Kingdom.\n\nI'd add that the implication that chimpanzees are somehow like more primitive versions of us, which the narrator hints at, isn't true at all. Evolution isn't directed, we're not at the \"top\" of some evolutionary hierarchy, and contemporaneous species like humans and chimpanzees are both equally evolved. They're just different because of different selection pressures and evolutionary histories.\n\nEdit: sigh. Downvotes. Why do I bother? Like WTF are you downvoting, basic concepts of evolutionary biology? Get some fucking perspective.\n\nEdit: Sorry for complaining in my edit above. I got downvoted immediately after my initial comment. I felt bad because I offered what I think is a reasonable science-based opinion. I know that is just Reddit, and I shouldn’t be so sensitive. But that's just who I am. And to me it’s not about the karma or any of that stuff. I am just bummed out with the way some people just dismiss each other without any thoughtfulness about it. Like if I'm being a dick in my reply, downvote away! But if something I said was wrong, then explain it... Anyway, I didn't mean to confuse folks, because now my original comment seems to be getting many up votes. I hope that clarifies things. Have a good one everyone!",
                    "score": 29,
                    "replies": [
                        {
                            "author": "hokeyphenokey",
                            "body": "How do you see downvotes? I only see a cumulative number. One total. If it's in the positive, that's all I see.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "artificialidentity3",
                                    "body": "Yeah, sorry for being confusing. Right after I posted this it went below 0. So that what I was responding to. I got a little touchy about that, because I didn't think I was offering a particularly controversial or rude opinion. But as you said I see a positive number now, too.\n\nIt just really bugs me when I feel like I'm engaging people respectfully and offering reasonable opinions and I still get downvoted. Like, why not at least comment or offer a substantive rebuttal, you know?\n\nAnyway I will edit my comment above. Thanks!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hokeyphenokey",
                                            "body": "upvoted",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "1-_-_-_-_-_-",
                                            "body": "Downvoted.",
                                            "score": -10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MarloTheMorningWhale",
                    "body": "They most definitely understand death. Do they understand fully what is means to be dead in a scientific way? No. But they display many of the same behaviors as people do when someone close to us dies.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Crafty_Travel_7048",
                    "body": "\"Chimps very clearly comprehend death\"\n\nThat's why they carry their dead babies' rotting corpse for a week or so after it dies right?",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "TheHoboRoadshow",
                            "body": "What sort of response is this?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AverageGuyEconomics",
            "body": "Leopard pulling off the exorcist head spin made it look even more of a threat.",
            "score": 14,
            "replies": []
        },
        {
            "author": "saint_ryan",
            "body": "Moonwatcher and his tribe after the monolith.",
            "score": 14,
            "replies": []
        },
        {
            "author": "KatokaMika",
            "body": "Meh i would have reacted the same if I was minding my own business and suddenly a leopard appeared in front of me",
            "score": 9,
            "replies": []
        },
        {
            "author": "SoliloquyBlue",
            "body": "It's interesting that they follow the same sequence of ways to learn about a foreign object that I've seen in young children:\n\n1. Poke at it with a stick\n2. Poke at it with your fingers\n3. Break it",
            "score": 16,
            "replies": [
                {
                    "author": "ballplayer0025",
                    "body": "I felt that they handled it the way most families handle a spider in their house.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nanibackflip",
            "body": "Really cool how they try to scare it off first, then attempt attacks and in the end investigate and even a little sign or remorse if it is an injured animal.",
            "score": 8,
            "replies": []
        },
        {
            "author": "coconuttree32",
            "body": "They went apeshit when they saw it",
            "score": 5,
            "replies": []
        },
        {
            "author": "darkmatter343",
            "body": "😆That one ape *touches leopards groin, sniffs finger*",
            "score": 5,
            "replies": []
        },
        {
            "author": "GuideMwit",
            "body": "The leopard got beheaded",
            "score": 5,
            "replies": []
        },
        {
            "author": "Empty-OldWallet",
            "body": "\"In this episode of screwing with wildlife, we'll put a fake predator out to screw with their minds\"",
            "score": 11,
            "replies": []
        },
        {
            "author": "Mister-Ace",
            "body": "Even if it was real, couldn't they just beat the shit out of it? I understand self preservation and all but that many of them should be able to overpower anything",
            "score": 3,
            "replies": [
                {
                    "author": "OkRush9563",
                    "body": "I've seen baboons fight off a leopard who was desperate enough to try and eat one of them when it was in a group of a hundred.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Mister-Ace",
                            "body": "wow",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FlowRiderBob",
                    "body": "Yes, that many chimps can easily overpower a leopard. But it still takes guts to be the first one to make contact since they know they will likely get injured. And in the wild even a mild bite/cut can lead to death.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "MustardCoveredDogDik",
                    "body": "A leopard would be no match for a group of chimps. They attack stragglers, old, young, sick chimps. If this was a real leopard it would have retreated immediately,",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CaptainTripps82",
                    "body": "They likely expect it to have run away, which is what a real leopard would have done once discovered",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "2gtbt_",
                    "body": "A large amount of anything would beat the shit out of it. But just like people nobody would wanna be the first guy to lose their life just to take it down",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheRustySchackleford",
            "body": "wow. 2001 a space odyssey had better acting than I thought",
            "score": 3,
            "replies": []
        },
        {
            "author": "ratpH1nk",
            "body": "watching this you can get the feeling early on that 1 or 2 of them knew deep down it was some bullshit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rathemighty",
            "body": "“A mechanical leopard was instrumental in an experiment with chimpanzees, conducted by scientists from the University of Amsterdam. This experiment sought to show how goddamn hilarious it is to make chimpanzees freak the fuck out from a safe but enjoyable distance.”",
            "score": 3,
            "replies": []
        },
        {
            "author": "ga-co",
            "body": "Where’s the black obelisk?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ArbainHestia",
            "body": "[Are we really so different?](https://www.youtube.com/watch?v=olPhJnNDNT8)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hrbalz",
            "body": "Looks like my son when he goes to attack but gets scared to get too close.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Axxisol",
            "body": "Me when I see a spider🕷️:",
            "score": 2,
            "replies": []
        },
        {
            "author": "CaliKindalife",
            "body": "Didn't know fidel castro was a scientist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "i_want_waffles",
            "body": "Not sure how that would have helped them survive. Those attacks all did like 0 DPS.",
            "score": 2,
            "replies": [
                {
                    "author": "lumpboysupreme",
                    "body": "All those ranged attacks are to drive it off without putting themselves in danger; all but desperate predators will see that kind of discomfort and ‘we all see you look at all of us threatening you’ and back off.\n\nIf a leopard went in on them, whichever the first one it jumps on may be hurt, even killed if it’s unlucky, but the chimps will rip it to pieces if it tried to fight.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "i_want_waffles",
                            "body": "Interesting - so the sticks are more to try and drop aggro from the Leapard more than anything. And if the Leopard charges they all pop timers and just melt it down.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lumpboysupreme",
                                    "body": "Yes and maybe you should spend less time progging, you can probably hear the airhorn everywhere you go.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "i_want_waffles",
                                            "body": "No, I don't think I will.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "2gtbt_",
                    "body": "Teeth and an ungodly amount of violence is their real weapons",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adieady",
            "body": "Reminds me of humans during covid lockdown fighting for toilet paper",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ruenin",
            "body": "Great idea to make the chimps think that all leopards are fake. I'm sure they'll live long and healthy lives after that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DojaViking",
            "body": "I imagine the same reaction with me and my homies when a giant spider shows up",
            "score": 2,
            "replies": []
        },
        {
            "author": "lena_vernon",
            "body": "Me when I see a spider",
            "score": 2,
            "replies": []
        },
        {
            "author": "CapitanianExtinction",
            "body": "I'mma rip your head off!",
            "score": 2,
            "replies": []
        },
        {
            "author": "SolomonDRand",
            "body": "lol, I was just talking to my wife about watching this in a National Geographic special 35 years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bill_Nye_1955",
            "body": "\"Guys, they don't even have blood and guts\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "CIA_napkin",
            "body": "It's like 2001😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealisticEmploy3",
            "body": "Is this actually interesting? No shit our ancestors attacked predators",
            "score": 1,
            "replies": []
        },
        {
            "author": "swilkers808",
            "body": "While in an Amsterdam \"coffee shop\", the scientists came up with this. \"Hey, do you guys want to get some funding to build a mechanical leopard to fuck with chimpanzees and film it?\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnowledgeDelicious82",
            "body": "Is that Ordinary Things?",
            "score": 1,
            "replies": []
        },
        {
            "author": "natgibounet",
            "body": "They have the accuracy of toddlers",
            "score": 1,
            "replies": [
                {
                    "author": "2gtbt_",
                    "body": "Tbf they aren't built to have as much swinging power as us hench why they \"slap\" and not punch (which could also be because they can't form a fist I think?)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kind-Bottle-8535",
            "body": "a leopard wouldn't mess with one of these savages",
            "score": 1,
            "replies": []
        },
        {
            "author": "Technical-Reward2353",
            "body": "Are they using tools?",
            "score": 1,
            "replies": [
                {
                    "author": "Liquidust256",
                    "body": "Yes.  They are using beater sticks as a form of defense.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Faceless_Deviant",
            "body": "Interesting to see how they are encouraging eachother with pats on the shoulders and such.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andjusticeforjuicy",
            "body": "He’s keeping the head to put it on a stake as a warning to other leopards",
            "score": 1,
            "replies": []
        },
        {
            "author": "tennis_widower",
            "body": "Touch the monolith you monkeys!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FluidSprinkles__",
            "body": "\"fuck it guys, we ball\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Herps_Plants_1987",
            "body": "I’m with the one taking his war trophy home 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Luiz_Fell",
            "body": "ALISA MEU PELO",
            "score": 1,
            "replies": []
        },
        {
            "author": "GothamCityGym",
            "body": "Carried out by Che Guevara?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Day8538",
            "body": "Looks like the oldest wisest chimp when up to it to verify it’s dead",
            "score": 1,
            "replies": []
        },
        {
            "author": "DevTurtle03",
            "body": "monke",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kevesse",
            "body": "What amazing info was gained by this?  A chimp can be fooled. So can a human.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Best_Plankton_6682",
            "body": "\"A mechanical Leopard was instrumental in an experiment with chimpanzees conducted by scientists who are Jason Momoa.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "kirtash93",
            "body": "Its funny how they end learning that it is not real.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zanedewayne",
            "body": "This is exactly what I do when I see a big snake",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoonTreeSullen",
            "body": "Yo that monkey stole his head",
            "score": 1,
            "replies": []
        },
        {
            "author": "Various-Purchase-786",
            "body": "That is mean",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChaoticMornings",
            "body": "Was that chimp looking for a pulse?",
            "score": 1,
            "replies": [
                {
                    "author": "2gtbt_",
                    "body": "Inspecting it out of curiosity since it realized it had no blood or smth",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "airfryerfuntime",
            "body": "\"What do you do for a living?\"\n\n\"Scare the absolute shit out of chimps\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Randomest_Redditor",
            "body": "Man they really went *apeshit* on that fake Leopard",
            "score": 1,
            "replies": []
        },
        {
            "author": "froggywest35",
            "body": "They throw chimp after chimp at it until eventually it will get tired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kingcheeta7",
            "body": "This what all the people who’ve been vandalizing Teslas look like right now. 🙌🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "LustyArgonianMaidv4",
            "body": "Beat em with a stick is a timeless defense tactic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OutOfSupplies",
            "body": "Arthur C. Clark worked this out years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rare_Competition2756",
            "body": " Chimpanzees are terrifying",
            "score": 1,
            "replies": []
        },
        {
            "author": "stinkypirate69",
            "body": "Get those chimps some iPads!",
            "score": 1,
            "replies": []
        },
        {
            "author": "frogmicky",
            "body": "Im surprised we evolved at all acting like that lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive_Parsley47",
            "body": "´if you remove the head it stop being dangerously’",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForeignLead2221",
            "body": "I feel like we could learn a lot from these guys",
            "score": 1,
            "replies": []
        },
        {
            "author": "Masta0nion",
            "body": "Leopards are chimps natural predators?\n\nI thought chimps can rip your face off. Plus big brain",
            "score": 1,
            "replies": [
                {
                    "author": "2gtbt_",
                    "body": "They can't rip your face off unless they chew it off first and yes leopards hunt chimps but they probably only hunt a lone, injured, old and baby chimps because they're still dangerous even if they aren't that impressive strength wise if they weren't so violent and had such a dangerous bite force",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Western_perception1",
            "body": "That’s literally me when I see a snake bro",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnakesVenomLynn",
            "body": "A NEW HAND TOUCHES THE..... decapitated leopard head?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chance-Personality50",
            "body": "just keep giving it sticks and it will build a house somewhere, Genius Idea herman.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GullibleIdiots",
            "body": "Guess they also have that one person who unhelpfully screams throughout the entire ordeal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sludge_monster",
            "body": "Chimps got dem tings",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capt-J-",
            "body": "Yeah, put an artificial shark or snake (or leopard) amongst humans and watch them get terrified too.",
            "score": 1,
            "replies": [
                {
                    "author": "ErrorEra",
                    "body": "Well that's optimistic. I expect the majority that think it's real to do a stupid and try to take selfies with it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lord_Explosion",
            "body": "Those chimps are going to walk up to the next leopard confident as hell",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneHungryEye",
            "body": "Nah...they're thinking wtf is this demonic thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warm-Candidate3132",
            "body": "What an amazing troll.",
            "score": 1,
            "replies": []
        },
        {
            "author": "brothbike",
            "body": "the monkeys invent football",
            "score": 1,
            "replies": []
        },
        {
            "author": "MellyKidd",
            "body": "Pretty sure they think it’s dead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Kalos",
            "body": "That last monkey looked like he was checking for a pulse",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "Chimpanzees often react with alarm and defensive behaviors, such as vocalizing loudly and mobbing the artificial leopard to drive it away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2gtbt_",
            "body": "Ok but is it just me or do those swings with the stick look incredibly weak? I thought they had great swinging capabilities is it specifically for swinging in trees?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Firm-Drink-9206",
            "body": "* casually plays with the decapitated head *",
            "score": 1,
            "replies": []
        },
        {
            "author": "2gtbt_",
            "body": "https://www.reddit.com/r/Jaguarland/s/WQ4JHY7yJd meanwhile this is how humans react. Awfully similar don't you think?",
            "score": 1,
            "replies": []
        },
        {
            "author": "EvilMoSauron",
            "body": "Scientists: I wonder how these chimpanzees will react when they see a mechanical leopard...\n\nChimpanzees: 😱 AAAAAAAAAH! 😫 HOLY SHIT! LEOPARD! RUUUUN! 😭 AAAAAAAAH!\n\nScientists:  🤔 You know... I'm not sure what else I was expecting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreatTrollMaster",
            "body": "1970 research: that leopard probably *smells like a human;* training chimps to fear and attack humans.",
            "score": 0,
            "replies": [
                {
                    "author": "Soldus",
                    "body": "Chimpanzees are highly intelligent and have trichromatic vision i.e. they can distinguish colors like humans. Their reaction shows they recognize the leopard by visual cues, not by smell.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "slindogar",
            "body": "I love these old natural documentaries. Bittersweet reminders of an age when we thought we might can avoid the 6th extinction",
            "score": 1,
            "replies": []
        },
        {
            "author": "RevolutionaryTalk278",
            "body": "Meanwhile....\n\n\"And as we can see, the human believes that our elite actors are truly terrified of the false-leopard. This provides our advanced civilization an opportunity to gain insight into the methods of how humans conduct their research and their 'human centric' beliefs of superiority. This limits their perspectives and so has made our ability to observe them as they 'observe us' easier. We have been able to do this thanks to the brave, ongoing efforts of other elite actors, such as the camera-ape observing the human researcher. I know this one as an old friend and he has assumed the identity of Hugh Mann from Witchita. He explained to that his 'human-sona' has an interest in automobiles, likes dogs, and spends perhaps too much money on Legos, which is only mildly better, but considerably cheaper, than table-top figurines. Yes, that will be on the test next week.\n\nUnfortunately, it has been deduced that their progress has hit a bit of a slow down due to various socio-political issues, which will, as we predict, have decades of lasting impact. However, if they achieve the appropriate level of development, they may prove capable of joining our people's various research and development divisions. Ah, that is the bell, students. Please enjoy your weekend and remember your humanity studies essay is due in two weeks and will count for at least half of your grade.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Winwin10101",
            "body": "fyi our ancestors are humans",
            "score": 1,
            "replies": []
        },
        {
            "author": "VAman7",
            "body": "They act like protesters 😃",
            "score": 1,
            "replies": []
        },
        {
            "author": "NightEmber79",
            "body": "Those chimpanzees.  Very peaceful.  This was a day of love...",
            "score": 0,
            "replies": []
        },
        {
            "author": "No_Independence8747",
            "body": "Old science was so messed up. Current science is probably more of the same.",
            "score": -5,
            "replies": [
                {
                    "author": "SkellyboneZ",
                    "body": "Shit, isn't most science just fucking with shit and seeing how it reacts?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "February30th",
                            "body": "Trial and error is by far mankind’s most successful method to date.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pichael289",
                    "body": "There's a BBC documentary called \"spy animal\" narrated by David remnant, where they put anamatronic animals in with the real animal populations and while it is amazing what we discovered, it's also pretty fucked up. One was a monkey and they other monkeys took it in and one day they got too rough with it and broke it and the god dam monkeys held a fucking funeral for it and mourned for it. Incredibly interesting but also really fucked up.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Nightshade_209",
                            "body": "All of this bothers me less than vivisection.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Nanibackflip",
                            "body": "https://youtu.be/rh9PwFvMS0I?si=RyB-NWywmlmCjevb is this it?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MLawrencePoetry",
                                    "body": "Oh, David Tennant. Not \"David Remnant\".",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -1,
            "replies": [
                {
                    "author": "Drtikol42",
                    "body": "Its the Steve Irwin way:  \n\"Lets learn more about these beautiful creatures by pissing them off immensely.\"",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucid_Discoveries",
            "body": "\"Our Ancestors?\" \nWho is \"Our\"?",
            "score": -1,
            "replies": []
        },
        {
            "author": "No_Opportunity_8965",
            "body": "Cool prank bro.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ExcitedDelirium4U",
            "body": "They just gave those chimps false confidence to believe they could decapitate a real leopard lmao",
            "score": 0,
            "replies": [
                {
                    "author": "urkermannenkoor",
                    "body": "They bloody well can",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WildGeerders",
            "body": "Me when my big brother comes in my room when I'm watching porn.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BigMack6911",
            "body": "Great,  give the chimps Ptsd",
            "score": 0,
            "replies": [
                {
                    "author": "2gtbt_",
                    "body": "As if they won't deal with those predators eventually. They aren't coddled in secured homes so safe to say they would be used to such things",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GenericNinjaFight",
            "body": "Send in a real leopard, chimps are horrible.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -6,
            "replies": [
                {
                    "author": "3HaDeS3",
                    "body": "Poor Redditor, you probably would hold funeral for a dead fly",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "MadRockthethird",
            "body": "Nice make chimps think leopards are harmless. What could go wrong?",
            "score": -7,
            "replies": []
        },
        {
            "author": "Bathairsexist",
            "body": "Y'all still believe in evolution? Wtf guys it's 2025, by now Y'all should know we're in the Jesus Christ simulation.",
            "score": -2,
            "replies": [
                {
                    "author": "2gtbt_",
                    "body": "Satire? You do realize saying that on a science based comment section would just make people spite you more",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Bathairsexist",
                            "body": "Nope, just sharing my belief in the JC Simulation. It is what it is. Truth. Yours is false evolution bullshit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "scape_goat74",
            "body": "USAID type shit....",
            "score": -16,
            "replies": [
                {
                    "author": "Responsible_Bee_939",
                    "body": "Cause your daddy says so?…😂😂😂 You got some shit on your face .",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "2gtbt_",
                    "body": "Shit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable_Dog8732",
            "body": "These are just stupid chimps...Humans were created by God, as well as intelligence.",
            "score": -9,
            "replies": [
                {
                    "author": "Flowers_lover6",
                    "body": "You must not be human, then, if humans are supposed to be intelligent",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Comfortable_Dog8732",
                            "body": "It is God who can judge like you just did. Fear God and get ready for the final hour! It's coming!",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Flowers_lover6",
                                    "body": "Why fear? Why not praise, love, worship, etc? Why specifically *fear*?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Comfortable_Dog8732",
                                            "body": "That is the question only God can answer for you. Just ask with gratitude!",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "2gtbt_",
                                    "body": "Y'all have been saying that everyday lol still no apocalypse caused by divinity 🤷🏿",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Comfortable_Dog8732",
                                            "body": "That's not the point! :D The induced fear that generates income for me (as well) is the point! :P",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "2gtbt_",
                                                    "body": "Yo I knew it was satire because ain't no way someone actually says those things 😭.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Comfortable_Dog8732",
                                                            "body": "Than there is plus 1 surprise in your life waiting for you.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Liquidust256",
                    "body": "Where are the anti creationists?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Comfortable_Dog8732",
                            "body": "They have lost the elections! God is great!",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "CaptainTripps82",
                                    "body": "Because that's how science works",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}