{
    "title": "Did someone mistakenly type someone's UID wrong? Cuz, I have a welkin in my account suddenly.",
    "author": "Wonderful_Honey_2166",
    "subreddit": "Genshin_Impact",
    "rank": 2,
    "score": 3545,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 200,
    "url": "https://i.redd.it/p3d5pmh73fpe1.png",
    "id": "1je19dn",
    "selftext": "So basically, I was out the majority of yesterday and when I got home and logged on the game, there was a welkin that I didn't buy. If anyone by chance did this by mistake through codashop or lootbar, feel free to refund or please contact me on Genshin. UID -- 818976641",
    "comments": [
        {
            "author": "Epicious",
            "body": "You cannot refund this if it is bought via codashop (or other 3rd party websites). All purchases are final. Charging back also doesn't work since you'll just be dealing with the website and not your account.\n\nSo enjoy your welkin",
            "score": 2883,
            "replies": [
                {
                    "author": "geomxncy",
                    "body": "one time i talked with my bank and i got 89 euros as a refund, but lootbar blocked my credit car, now im using another one",
                    "score": 564,
                    "replies": [
                        {
                            "author": "Wonderful_Honey_2166",
                            "body": "ooh, well ngl those 3rd party apps are kinda shitty sometimes",
                            "score": 337,
                            "replies": [
                                {
                                    "author": "BleezyMonkey",
                                    "body": "not really, they have great deals and they dont require any login information, just uid. meaning there is nothing sketchy either. \n\nif someone writed their uid wrong its kinda on them",
                                    "score": 152,
                                    "replies": [
                                        {
                                            "author": "jiraineko",
                                            "body": "lootbar rug pulls stuff all the time and cannot be trusted, they aren’t officially partnered with hoyo and can also be a band risk. Codashop is the only real one because they’re directly partnered with mihoyo and hoyoverse. Plus, if you try talking about lootbar in the official genshin impact server they block it.",
                                            "score": 28,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "The_Matthew1",
                            "body": "Do you like to talk with your bank",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "geomxncy",
                                    "body": "It was just a call and they said dont worry we got this 😭😭 in 2 weeks the money was back ( i put my genshin uid instead of hsr uid)",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "DeadoTheDegenerate",
                                            "body": "How do you even manage that?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "geomxncy",
                                                    "body": "My bank told me: tell them it was an error on my account dont worry if they does not respond , (it wasnt, was my fault but it worked LOL)",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "DeadoTheDegenerate",
                                                            "body": "I mean, if it works, sure lol\n\nI'm just confused how you get the wrong UID... The region codes are different (at least, they are for me), and that's something I'd check 10 times before confirming lmao",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "geomxncy",
                                                                    "body": "i guess i was sleepy and never thought about the uid honestly, the one svaed was from the other game but never realised.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DeadoTheDegenerate",
                                                                            "body": "Ohhh yea that makes sense.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "Um well I'd feel bad to use it tbh cuz it's not mine plus the person who did it might be so clueless, ykwim",
                    "score": 76,
                    "replies": [
                        {
                            "author": "Vast-Nobody8719",
                            "body": "The is no way to not use it except for not lodging in for the period of time… and that would be just wasting it. It is yours now and nothing you can do about it really.",
                            "score": 299,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "um yeah you guys are right, I guess I might just wait for the day and hope they contact me or smth",
                                    "score": 49,
                                    "replies": [
                                        {
                                            "author": "Historical_Clock8714",
                                            "body": "What u gonna do pay for their welkin in return? Because that's the only thing u can do for them if they somehow contact u",
                                            "score": 79,
                                            "replies": [
                                                {
                                                    "author": "Vrail_Nightviper",
                                                    "body": "And how would one know it's the actual person contacting and not someone lying to try and get a free payment of primos either",
                                                    "score": 57,
                                                    "replies": [
                                                        {
                                                            "author": "Historical_Clock8714",
                                                            "body": "Yeah exactly. This happened to me (sudden welkin) but instead of asking for people to contact me I just posted a thank you on genshin leaks megathread hoping the one who bought it saw it 🙈",
                                                            "score": 22,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "BreadMTG",
                                                            "body": "hey its me ur brother",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Noman_Blaze",
                                            "body": "They can't do anything now. Can not be reversed. So just enjoy the free primos.",
                                            "score": 73,
                                            "replies": []
                                        },
                                        {
                                            "author": "cpcpcpppppp",
                                            "body": "They can't do anything to remove the welkin from your account or anything so I have no clue what you're going on about. Just use it and continue on your account as normal.",
                                            "score": 26,
                                            "replies": []
                                        },
                                        {
                                            "author": "Boi_he_bout_to_do_it",
                                            "body": "um",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "I-Try-2606",
                            "body": "You just open yourself to be scammed. Whoever did it, it's their problem not yours.",
                            "score": 62,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "yeah that's kinda true",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "OneMisterSir101",
                                            "body": "It's 100% true. And it's $6. If it hurts them that badly, they can choose to forego a bought drink for their mistake. They will learn. You get to benefit from it for once, so might as well!",
                                            "score": 21,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Zealousideal_Fix8710",
                            "body": "Don't feel bad. They had enough money to spend it on a third party website. Enjoy it",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "TwT",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Atago1337",
                            "body": "Pure.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "robertarobertson",
                    "body": "Hoyoverse be like: skill issue.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Best-Girl-Yanfei",
                    "body": "Your pfp is so cuteeee",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Epicious",
                            "body": "Thanks and indeed. Kurisu is great",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Best-Girl-Yanfei",
                                    "body": "Hell yeah! Fun fact: her name is literally my ign since I started genshin 5 YEARS AGOOO",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wonderful_Honey_2166",
                            "body": "fr i felt the same lamo",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Inspiration-5plus",
                    "body": "Would the same apply to genesis crystals?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Epicious",
                            "body": "As long as it is via a third-party website, yes. Charging back can work and get you into trouble with the website itself. They may take legal actions or dispute the charge back with the bank but the most I've seen is them blocking the card.\n\nBut the genesis crystals bought on the account cannot be refunded and will stay in the account. So if a stranger bought it for you, there's nothing to worry about.\n\nUnless your account was hacked and it was purchased directly from your account, which can be charged back and get you into negative primos and get you banned in the long run.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "redarkrai",
                    "body": "Hell yeah Kurisu pfp",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "chevroletbarbie",
            "body": "how come this never happens to me",
            "score": 847,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "dude ikr i should be happy rn but here i am freaking out",
                    "score": 323,
                    "replies": [
                        {
                            "author": "CarpinchoMH",
                            "body": "Your reaction speaks very well of your principles and good manners.\n\nIt is not possible for you to contact the person who miswrote their UID, but think of it this way:\n\nIf they did it through a third-party website and typed their UID manually, making the mistake, I assume the website would have asked if the number was correct.\n\nAdditionally, there should be some proof showing the entered data. It's a series of small mistakes that are NOT your fault.\n\nOn the other hand, if he really needed the money, he would surely try to contact you in game.\n\nJust be careful not to provide information that could harm you account.",
                            "score": 249,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "Well thanks a lot for putting your thoughts to this and idk really, I just wish I would've helped, and yes it might be a fault at their end, but I still feel responsible but you're right there is not much I can do and thanks for the warning, imma keep em in mind when i post fr thanks \\~",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "Valaurus",
                                            "body": "There’s nothing for you to feel responsible for honestly, you just randomly received this. There is literally nothing you could have done to prevent them sending it to the wrong person haha. It’s kind and good that you’re concerned, but there’s no reason for you to feel guilt or responsibility :)",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "summer_petrichor",
                                    "body": "I'm not sure if there are other platforms available, but I've bought on codashop before and it does have a pop up menu with the UID and in-game name before payment for the person to check if they got the right account. Of course there's a slim chance OP's account name is the same as the correct account, but otherwise it's pretty much on the buyer for not checking properly. \n\nThat, or it was a gift from someone OP knows but didn't tell OP. I've given the equivalent of welkin in other games for friends before (though I did tell them eventually)",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "atabar93",
                            "body": "If you are freaking out don't spend the gems right now. Wait for a couple months, until they can't request a refund and then spend them.\n\nBut as others have said, I don't think you can refund if the gems weren't bought from your account directly (such as codashop)",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Atque12345678",
                                    "body": "you cant refund welkin, only genesis crystals.   \nOP is fine and whoever did this has only themselves to blame for not rechecking the UID before proceeding to payment.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Sorcatarius",
                                            "body": "Yes and no, you can't refund it, but if the person was to issue a chargeback to their card and say it was used by someone else without their knowledge and their card was to side with them, they might claw back the primos. If OP spends them they'll be put at a negative balance. My understanding is that if you are ar a negative balance for too long or too far down you can be banned.\n\nI don't know if codashop works differently or anything, never used it myself, but there are plenty of incidents of people getting \"gifted\" a welkin, only for someone to do this and get the reciever in trouble. If OP is worried, the advice of sitting on them for 6 months (most chargebacks cap at 180 days to claim it) is sound advice.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "anxientdesu",
                            "body": "youre just a good person, OP, fly high",
                            "score": 31,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sacredfice",
                    "body": "It might happen if you put your UID here",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BadAdviceBot",
                            "body": "88133742080085",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pronounclown",
                    "body": "Bro it's 5 bucks.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "RockShrimpTempura",
            "body": "Be ready for a bunch of randoms to hit u up in genshin now, claiming to be the person who bought this.",
            "score": 436,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well true but their UID needs to be at least similar, or they need to have a proof at least hopefully",
                    "score": 149,
                    "replies": [
                        {
                            "author": "cpcpcpppppp",
                            "body": "You're requesting for the person who bought it to contact you, IF this was meant as a gift for someone else, chances are the UID of the person purchasing it isn't similar to yours.",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "well, they would still have a payment invoice, right ?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "pronounclown",
                                            "body": "Bro you have already spent more than enough time and energy on this issue. Someone made a $5 mistake. Enjoy it and move on.",
                                            "score": 76,
                                            "replies": [
                                                {
                                                    "author": "Wonderful_Honey_2166",
                                                    "body": "yeah, thats the idea for now",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cpcpcpppppp",
                                            "body": "Well, yeah, but I'm not even gonna lie even that can be faked if you loosen up too quick after the first sight of it, and we all know greedy Genshin players are willing to do any amount of trickery for money 😭\n\nBe careful if somebody does look legit, also since they bought this through a third party service they could possibly have more evidence especially if they have conversations with support\n\nBy the way have you asked everyone else you may know through Genshin if they maybe sent you it?",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "Wonderful_Honey_2166",
                                                    "body": "yeah i'll  try my best and be wary of them yes point noted, and sadly no its not my friends i did confirm. but thanks for the warnings, really appreciate it",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kaorusarmpithair",
            "body": "There's nothing you can do about it someone probably just entered their UID wrong. They'll know they made an error",
            "score": 112,
            "replies": [
                {
                    "author": "bunny_the-2d_simp",
                    "body": "But wait why are yall buying welkin on another website? 😭\n\nDont you just buy it in genshin store itself?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "leina727",
                            "body": "So you can buy it for other people. I think people use it to give streamers primos all the time.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "PikaBolt67",
                            "body": "cheaper compared to buying it in-game",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "bunny_the-2d_simp",
                                    "body": "How much cheaper we talking? Because to my autistic brain it seems like such a huge task of a mountain to have extra steps",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PikaBolt67",
                                            "body": "20% more expensive compared to codashop\nedit: ios and math",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kaorusarmpithair",
                            "body": "its when u wanna gift someone else",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ChunChunmaru11273804",
                            "body": "some stores give you a bit of money off and you only need a uid so you can use it to gift stuff to other people",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah but at least getting to talk to the would make me feel less guilty",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "WolfSong1929",
            "body": "Lol I did this once I used my UID for HSR instead of Genshin. Oh well its just 5 bucks. Just hope it was an active account lol",
            "score": 65,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well, that's a kind gesture tbh",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "bunny_the-2d_simp",
                    "body": "I bought welkin for someone who was mentally going through a though period because my autistic self doesn't know how to comfort people without feeling wrong in a way or like im just akward..",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NSLEONHART",
                    "body": "If you were playing since day one on hsr, thats likely a dead account",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sam_Woahh",
            "body": "If you didn't get it personally there is no way to refund it (unless someonevstole your hoyo account) \nSo if you haven't received a login email you can just enjoy it ^^ ",
            "score": 119,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "Yeah, I just hope to reach out to the person as they might be so lost abt it",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Sam_Woahh",
                            "body": "Yep hopefully things get resolved properly, it sucks not getting what you paid for",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "yeah, especially in the worst case someone saved it up to get their furina and just lost their saving so I can't help but feel bad abt it",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "chikaaa-",
            "body": "i want this problem",
            "score": 31,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "TwT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cherrybutton",
            "body": "Probably the case, I also know that sometimes on hoyolab (linking with twitter?) they giveaway welkins officially.",
            "score": 49,
            "replies": [
                {
                    "author": "Fontaine_Fancy",
                    "body": "Official welkins come in mail, I remember the Anni rewards, you gotta activate it ",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "I doubt that as I don't remember actively taking a part in any of them, but is it possible that someone just randomly gets it or smth ?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "ILikeDrownedFish",
                            "body": "No I dont think so, have you tried contacting support to at least warn them ? Better safe then sorry",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "yeah i might do it, thanks. i can't let someone's mistake ruin my account even if i feel bad for them",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "saberjun",
            "body": "In the end it’s just five dollars.Accept it as a happy coincidence.",
            "score": 10,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah, true but maybe it was someone's saving um yeah",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "true tho, imma just wait and if no one reaches out then imma be all happy i want to get myself furina",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "baguetteispain",
            "body": "Oh boy, I sure hope that no one will accidentally give something to the following UID:\n\n7325-",
            "score": 9,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "LMAO",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Maiden_Sunshine",
            "body": "Were you really nice to someone in co-op, or online somewhere and mentioned you UID.\n\n\nSometimes people like to gift stuff when that happens 😊. Hopefully it was intentional on their end, enjoy it!",
            "score": 7,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well usually I help a lot in servers or even in random co-op so I really have no clue, well I really doubt Abt it being intentional sadly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gabbyxo97",
            "body": "Honestly this is why you check two/three times if the UID (or email or anything) is correct when you send any form of money or something that costs money, so it doesn't go to a random person. I'd say, don't feel bad, enjoy it, free primos! (just make sure you spend it on the right characters /hj)",
            "score": 14,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah, true cuz big loss for the guy who did it, well imma totally get furina now that's for sure",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gabbyxo97",
                            "body": "Good choice, making good use of those primos, I'm proud 😌",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "golekno",
            "body": "Welkin are not refundable i think",
            "score": 3,
            "replies": []
        },
        {
            "author": "A31goz",
            "body": "I think this is better than winning a 50/50 on the banners.\n\nI think it's better to take it as an unexpected gift, and I don't think the other person can do anything to return the purchase.",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah sadly I just felt if there was anything that i can do then at least i'd feel less guilt",
                    "score": 2,
                    "replies": [
                        {
                            "author": "A31goz",
                            "body": "Welp you can buy a Welkin with a random uid so you can make happy someone.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "words of a wise man indeed \\~",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FatalWarrior",
                    "body": "30 days of 90 primos is about 16 pulls. Losing the 50/50 could mean another 80 pulls. It is objectively not better.\n\nNot to say Free Welkin isn't great.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "A31goz",
                            "body": "You're right, I was just saying it because you have to be quite lucky to get a free Welkin out of nowhere.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tar_tis",
            "body": "Enjoy your free 5 bucks. Look at it this way, if it is actually a mistake, it's just 5 bucks. If 5 bucks were to be a lot of money for you then you shouldn't be spending it on Genshin in the first place. No reason to feel bad over it. Enjoy the extra primos",
            "score": 4,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah true you do have a point there, thanks man i feel better abt it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RAlDEN_SHOGUN",
            "body": "When someone gifts you a welkin they don't tell you who gifted it? I thought they do but never tried, I was about to gift a welkin to my friend without telling it bc of his birthday, but if my name doesn't show up as the one who sent it, then I have to tell him later..",
            "score": 6,
            "replies": [
                {
                    "author": "ceos_ploi",
                    "body": "How would that even work? Genshin doesn't have an in game option to gift afaik. And if you use any web service to buy Welkin via UID it just unlocks it on their account and that's it.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Wonderful_Honey_2166",
                            "body": "yeah true, the only time I see a welkin in a mail is when it's the official giveaway by genshin",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RAlDEN_SHOGUN",
                            "body": "In the shop of the game, in the \"Gift\" section, I can definitely see the welkin to be giften, but I never tried and idk how it does work",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ceos_ploi",
                                    "body": "Ah, I see what you mean. You can only buy these \"Gifts\" for yourself. They are kinda a \"gift\" from Hoyo to you. Would love to have an actual gifting option in the game, though.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "RAlDEN_SHOGUN",
                                            "body": "That's suck.. I thought I could've gift a welkin to my friend, now I have to use third parties sites?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ceos_ploi",
                                                    "body": "Seems to be the only option currently, sadly.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "I did ask my friends abt it and they did not do anything, plus there was nothing in the in-game mail it just randomly popped up when I logged on",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "xangbar",
                    "body": "No, people usually use those other sites where it asks for a UID. So the item goes directly to your UID. If you watch some big content creators, people will randomly buy them $1 of currency every once in a while and it pops up like you buy it through the top up site while you play.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Disastrous_List_6723",
            "body": "enjoy bro",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "I wish I could, can't help feeling bad for the person who did it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Exphiant14",
            "body": "This happened to me 3x in a row. The stranger probably kept punching in my UID. I’ll never forget that day coz I thought I was being hacked",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "lmao that would have literally freaked me out, well but again that is a good gay to have some extra funds \\~",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoldenWhite2408",
            "body": "Most of thede websites show you the username of the UID youre sending it to\nSo unless this dude has a similar name AND uid to you\n\nI'm sorry that dude is an idiot\nEven IF it's censored beside the front and back few letter\n\nThere's like 3 diff checks for this\nHow tf do u STILL mistype...",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well true that's the thing, i just hope it wasn't someone's first top up or maybe a kid ? but yeah u totally have a point",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FatalWarrior",
                            "body": "A kid shouldn't be handling in-game purchases, so this would serve as a lesson (for the parents, not the kid).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShadowSwain",
            "body": "If you were nice in co op recently, might be that! I gift random people that are nice to me welkins days after they’ve done it sometimes on Europe servers",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "i do usually help ppl in servers and random co-op but it's still hella random",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ShadowSwain",
                            "body": "Indeed it is, but a possibility. I still gift people that help me explore, since it’s the only thing I really need help with 😭",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "well actually tho, that is really sweet of you like fr",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jennymyersxx",
            "body": "pls stop being dumb and just go about your day",
            "score": 6,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah, I'm trying fr it's just sad someone had to lose their welkin",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "YaoiJesusAoba",
            "body": "Nice 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "nakorurukami",
            "body": "Give my welkin back 😭 I typed it in wrong\n\n/j",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "got me in the first half ngl",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ephemeral_Dream09",
            "body": "Bro got blessed by Celestia",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "this feels illegal TwT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rexk007",
            "body": "IT SHOULD HAVE BEEN ME!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "howelleili",
            "body": "are you sure it's not a gift? ive gotten people welkins and just never told them lol",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "i usually only play with a friend, and i threatened them to ask them so aside from them idk if anybody did it who i might have known of",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "francorocco",
            "body": "if refunding was possible i wouldn't recomend trying it, usualy refunding in game purchases(in any game at all) can get you banned if you don't contact support beforehand to do the correct procedure(normaly not having used the credits you got and not touching them at all)",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "oh well that really helps, well i guess if that's the case then i would see it's all done right at least from my end and fr thanks for the info",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lkz665",
            "body": "You’re a better person than I am",
            "score": 2,
            "replies": []
        },
        {
            "author": "NabeXico",
            "body": "Did you participate in a giveaway? Because that's what happened to me months ago.\n\nI entered a TCG tournament giveaway on YouTube and received the Welkin earlier than it was supposed to be announced.",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "hm not really, I usually like to keep things my way, so I usually don't even try for them plus i only ever spent on ganyu so i really wanted it to stay like that TwT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Matthew1",
            "body": "Hey wonderful honey",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "hey Matthew",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TakeruDavis",
            "body": "I haven't done so in a while, but sometimes when I enjoy Coop with someone, I gift a Welkin.\n\nNot sure if I should be doing it though, recently I saw some posts about F2P pride",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "lmao true, well but still that's really a kind gesture",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElectronicCobbler522",
            "body": "https://www.youtube.com/live/BirUP8QTq7c?si=qhK17phqwKnYJ-BT\n\n\nMaybe this one? I won Welkin from this giveaway",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "I really don't follow any yt giveaways or tbh any sort of giveaways, but thanks for going all the way to find the vid, really appreciate it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adventurous_Page_614",
            "body": "How dafuq are you gonna commit a mistak like that",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "IKR I SERIOUSLY FEEL BAD FOR THEM",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UnamedPowa",
            "body": "Same here, I was playing when suddenly FREE PRIMOGEM.\n\nThank you unknown gift giver !",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "may god bless those who bless us",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePikeOfDestiny",
            "body": "this happened to me on christmas and it kind of annoyed me because i really wanted to stay a f2p account and i got forcefully given welkin, none of my friendlist was online at the day of the gifting either (imagine, the other genshin players i'm friends with all actually spending time with their families on christmas couldn't be me)",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "lmao it's like god took the step and wanted you to be a P2W, well still I guess that's a nice Christmas gift fr",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Icee303",
            "body": "Your sense of responsibility makes me believe in humanity a bit more. Making the post was a good decision OP, even when it turned out you can't do much.",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "its not much tbh, just doing what i can plus, I'd feel bad using them just like that without trying",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DriveOk9415",
            "body": "can someone explain to me how to actually do this? i’m having trouble actually purchasing through my xbox and i’m pretty new at playing - is there safe sites to buy welkins from?",
            "score": 2,
            "replies": [
                {
                    "author": "notthatjaded",
                    "body": "Codashop is officially partnered with Hoyo and what most people use if they’re using a third party seller. You should also be  able to use the official Hoyoverse site. Does xbox not have options to buy gems for the game in its own shop? Playstation does, at least, and you can either do it through searching the Playstation store or when you choose to buy something in the Paimon shop, it redirects you.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DriveOk9415",
                            "body": "yeah i get through to purchasing and it never works :( i’ll try the hoyo site!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Belzher",
            "body": "The only way to \"give it back\" would be to buy it to the person that bought to you I guess",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well idk if i can but seeing if the person really had to put their life saving type of shit into this then i guess ? idk tbh that's why i am tryna reach them",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hot_Abbreviations920",
            "body": "well, sometimes happens, I accidentally buy welkin for my sister's account once",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah but it's your sis, for me its random person so that's why i feel the need to be here lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Hot_Abbreviations920",
                            "body": "yes, but for a whole day I thought i donat to some random account 🤧🤣🤣🤣, until it gets to me",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_2166",
                                    "body": "lmao that must have been one hell of a day for u i can totally imagine but glad it was your sis, now u totally get to flex on her",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "necropolis42069",
            "body": "Can someone gift me 😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "crackwag",
            "body": "I did a couple times.... but like a month ago :>",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "you have my condolences TwT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FiragaFigaro",
            "body": "Best take a baseline documentation of your Primogems and Genesis Crystals. When Cognosphere penalize fraud, they deduct Primogems into a negative amount that must be through in-game purchases bought back into a positive number or the account becomes at risk of suspension/banning.\n\nIt’s unlikely this would happen, but the documentation could help save you of a lot of hassle later if and when to contact customer service for any false-positive penalties that might occur, especially in charge-back situations.\n\nThat said, it is unlikely. Sorry for their loss, but you now get to enjoy a complimentary Welkin on someone else’s mistake!",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well okay thanks for the info, i would totally take precautions from my side and i still hope it won't cause any trouble but imma be ready for it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HermanManly",
            "body": "imagine this happening on a dedicated f2p account 💀\n\nThere really should be a way to refuse these lmao",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "oh they would be doomed, it's like feeding meat to a vegan lmao",
                    "score": 0,
                    "replies": [
                        {
                            "author": "HermanManly",
                            "body": "hm I think I would either immediately alt+f4 and wait 30 days, or note down the primos and make sure to never spend them",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FatalWarrior",
                                    "body": "You know the exact amount of primos and crystals you'd have after 30 days. Convert all of them into Resin, then convert the Resin into enchancement ore, level up a random sword, then thrash it.\n\nOnly headache is getting the material ores back.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "HermanManly",
                                            "body": "actual big brain solution",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xangbar",
            "body": "I would find it funny someone bought this through a third party site as Genshin has an official top up site at this point. I'm lazy and just buy it at my PC now (unless of course a friend was trying to buy one for someone then I understand)",
            "score": 2,
            "replies": []
        },
        {
            "author": "yellowshiro",
            "body": "Ask any of your friends maybe? Maybe it's some sort of gift?",
            "score": 3,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "i did confirm it really is hella random TwT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WavyMcG",
            "body": "Future tip. Do NOT post any screenshots of your game with your UID. You will get random requests and a few are likely going to be scammers. l \n\nI would delete any that you have out there already. Next time, crop it out. It’s showing on the bottom right. Be careful out there. \n\nAs for the Welkins, just enjoy it. It won’t be the end of the world",
            "score": 2,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah imma keep that in mind and probably after a while might delete this post too, well at least I tried so. thanks for the tip",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shmimmons",
            "body": "We're going to spam you welkins now muahahah",
            "score": 1,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "NAURRRRR, like I already feel guilty enough for this one TwT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "acederp",
            "body": "f2p status ruined",
            "score": 1,
            "replies": []
        },
        {
            "author": "IloChan1",
            "body": "May this luck find me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aromatic-Tear7234",
            "body": "Pay it forward. Buy mine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Technical_Plum_3472",
            "body": "Maybe someone typed in their UID wrong and now free Welkin by their mistake?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ravensadrix",
            "body": "Lucky you man i wish if i had one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Separate-Clothes2182",
            "body": "Double it and give it to me 🥹🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "kasumi22",
            "body": "well hey free primogems at least right",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm_Village1943",
            "body": "You, are the Chosen One..",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuperLuigi1025",
            "body": "If they bought it through the 3rd party sites they can't get a refund without risking a ban from Hoyo for using a 3rd party and the 3rd party site's love to ban you for refunds.\n\nMost people aren't going to risk that unless they are really petty about spending money on someone else's account due to a typo.\n\nHowever I would be careful still by the off chance that it was someone who bought it on Hoyo's official website as far as I am aware that can be refunded.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Broxi_wew112",
            "body": "Yes it was me give it back",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrJomar",
            "body": "This never happens to me... Enjoy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DemirPak",
            "body": "I actually tried buying my friend a welkin which i\nprobably mistyped the uid but it wasnt similar to your uid so this is probably not my case.\n\nEnjoy the free welkin!",
            "score": 1,
            "replies": []
        },
        {
            "author": "VenomFilms",
            "body": "On my Genshin profile I literally have it written that if someone does this, I’ll let them enter my world. Has it happened yet? No, because you should never need to join specifically my world & I know they’re just looking for some random world material or mob drop most of the time. Of course that doesn’t apply to my friends, just randoms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VenomFilms",
            "body": "On my Genshin profile I literally have it written that if someone does this, I’ll let them enter my world. Has it happened yet? No, because you should never need to join specifically my world & I know they’re just looking for some random world material or mob drop most of the time. Of course that doesn’t apply to my friends, just randoms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DragonfruitSubject",
            "body": "I want this type of problem, enjoy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prudent-Warthog-3989",
            "body": "My account is showing as non-existent when I log in. I don't know if I've been hacked. Can anyone help me? I've already contacted support and nothing. Does anyone know anything about how to recover it? Please help me. 😖😖😖",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Adhesiveness-8178",
            "body": "Nah, just let genshin support do its work or contact it ahead. Maybe don't try to use primogem in case it is fraudulent activity.",
            "score": 1,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "yeah I haven't used anything for now and also just waiting on it",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Kasztan",
                    "body": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Competitive-Pin-8592",
            "body": "I just hope you done get band. Just report it in case you need proof later.",
            "score": 0,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "well I do hope do too, and yes i might report it just to be safe thanks \\~",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jonnevituwu",
            "body": "Honestly, do not spend it until days have passed, ppl may try to refund it and if your account stays at negative primos you risk getting banned.\n\nHard to happen but I wouldnt try my luck",
            "score": -1,
            "replies": [
                {
                    "author": "Wonderful_Honey_2166",
                    "body": "okay noted, but as far as I can understand what ppl here said, it can't be refunded as its by 3rd party app, plus yeah for the time being I would just not use it, as I do hope the rightful owner can get a refund, thanks for the warning",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IcyCartographer3461",
            "body": "Don't use the primos for a while. If it does get refunded, you primos could go into the negetive and get your account locked. It used to be a big issue. I'm not sure if they have new protections",
            "score": 0,
            "replies": []
        }
    ]
}