{
    "title": "finally",
    "author": "Exploding_END",
    "subreddit": "whenthe",
    "rank": 4,
    "score": 7908,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 46,
    "url": "https://i.redd.it/gfmwk1wvtgpe1.gif",
    "id": "1je7gtb",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# [Download Video](https://redditsave.com/info?url=https://www.reddit.com/r/whenthe/comments/1je7gtb/finally/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whenthe) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Space_veteran96",
            "body": "Or when you are excused to not go, because you have to study for exams in the Uni...\n\nI got cousins 10+ years older than me and they have 3 kids allready... (2 cousin with 3 each)... So I can't just sit there with them, but need to look after the little ones... 4 if I'm not lucky\n\nhttps://preview.redd.it/7a2llkeh0hpe1.png?width=240&format=png&auto=webp&s=362781e03186c80bf7cedf331dbb9f98353d4bf5\n\nAnd it's kinda common that 2 of them gets into a fight...",
            "score": 420,
            "replies": [
                {
                    "author": "Exploding_END",
                    "body": "no joke the last family gatherings i went to were two out-of-city weddings back-to-back and they straight up sabotaged my exams (made me miss one for the former, made me go like a week before finals for the latter, draining my mental strength).\n\nthey really regretted it later",
                    "score": 140,
                    "replies": [
                        {
                            "author": "Space_veteran96",
                            "body": "https://i.redd.it/rw618vxl2hpe1.gif\n\nIn what form did they regret it, if I may ask?",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "Exploding_END",
                                    "body": "the aforementioned \"turning out to be backstabbing jerks\"\n\nI clutched my exam problems & passed with an ok gpa, dw",
                                    "score": 107,
                                    "replies": [
                                        {
                                            "author": "Space_veteran96",
                                            "body": "Nice",
                                            "score": 26,
                                            "replies": []
                                        },
                                        {
                                            "author": "WilliesAndVagoos",
                                            "body": "Clean clutch bro",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "carlangonga",
                    "body": "Same i have to babysit everyone!! And if one of the little shits gets hurt its my fault as if i actually know how to look after 10+ kids at once",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Space_veteran96",
                            "body": "I love my cousins, and they indeed (3 of them) did babysit me and my brother... But like come on, it was a 3/2 situation and not 2/4+",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "carlangonga",
                                    "body": "The most help i can get is with my other 4 cousins 3 of them are always never there. So me and my other cousin have to sometimes babysitt 10 0-7 yo. and more if we are at an actuall Party (Wedding, birthday party etc...) thats why i hate any party i just never have a good time",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PeikaFizzy",
                    "body": "Don’t like to bad mouth you family but any parents who want other with no qualifications to baby their child is a damn big red flag",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PotentialWorldly6835",
            "body": "Sucks when your favorite cousin’s family gets cut off from the big family, then all the family events are boring",
            "score": 993,
            "replies": [
                {
                    "author": "AmaterasuWolf21",
                    "body": "Unironically man, I couldn't even say proper goodbyes to my childhood friend when moving out because the parents had a feud \n\n(And their parents wouldn't have let me hang out anyway)",
                    "score": 315,
                    "replies": []
                }
            ]
        },
        {
            "author": "StormLordEternal",
            "body": "Learning the family lore and realizing \"wtf is wrong with these people? How did you survive this long? Do you even remember where to use the toilet paper after shitting?\"\n\nConsidering how common these stories can be, it suddenly makes sense why everything is so screwed up.",
            "score": 285,
            "replies": [
                {
                    "author": "Russian_Spy_7_5_0",
                    "body": "I have a cousin, who fucking killed someone (gang), and got 8 years. Only 8 fucking years. First week after being released, his mother brought him into church, they performed an \"exorcism\", taking the \"demon\" out of him. And now he is completely forgiven by every religious family member (which is basically fucking all of them).\n\n\nI no longer go to church.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "StormLordEternal",
                            "body": "While my family (not to my knowledge at least) has never gone that far, I see that too. Somehow believing in God is basically a get out of jail free card to be a shitty person. You don’t have to actually undergo introspection or try me grow and learn as a person, just utter a prayer and all is forgiven.\n\nShit like that is why I turned away from religion.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Designated_Lurker_32",
            "body": "God, it must be nice growing up with parents who know when to just cut off toxic family members. \n\nYou know, instead of growing up with the kind of parent that goes \"yes, these people are assholes, but they're still family, so we have to excuse them for every shitty thing they do and keep visiting them several times a year because *muh blood is thicker than water.\"*",
            "score": 162,
            "replies": [
                {
                    "author": "Spirited_Worker_5722",
                    "body": "Liquid shit is also thicker than blood",
                    "score": 73,
                    "replies": []
                },
                {
                    "author": "ceo_of_brawlstars",
                    "body": "That's not even the whole saying lmao the whole saying actually states that chosen family matters more, people who use the first part are just dumbasses",
                    "score": 21,
                    "replies": [
                        {
                            "author": "apexodoggo",
                            "body": "That full quote (“blood of the convenant is thicker than the water of the womb” is the famous one on reddit) is actually apocryphal with no real source, so no it was just a bad idea at its inception that people have tried to put a spin on.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Old_Cranberry7231",
                    "body": "and then said member completely changes your family's future direction. will these parents learn? of course not.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Peterkragger",
            "body": "Literally what happened to my family recently. My uncle got mad at my dad for selling his part of family's land, on which uncle is farming on and receiving governmennt subsidies for",
            "score": 55,
            "replies": [
                {
                    "author": "SP4D3SL1CK",
                    "body": "awesome pfp",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Peterkragger",
                            "body": "Thanks",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Squeebah",
            "body": "It sucks when you're an adult and realize your parents were the assholes and now you have no family though. I hope this isn't the case for you.",
            "score": 46,
            "replies": [
                {
                    "author": "Exploding_END",
                    "body": "I'm 20 bro",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Squeebah",
                            "body": "I'm 31 and that realization came around 25.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Exploding_END",
                                    "body": "No I mean I'm old enough to know my relatives really are jerks & my parents did the right thing if not a little too late ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordSmugBun",
            "body": "Jealous of you, OP.",
            "score": 39,
            "replies": []
        },
        {
            "author": "Noodlemaster696969",
            "body": "Despite cutting off everyone on my dad's side and most people on my mom's side our family gatherings arent boring becouse my aunt can single handedly quadrouple the noise level in the room, plus she brings her doggos",
            "score": 11,
            "replies": []
        },
        {
            "author": "NotHeco",
            "body": "every dinner is a family gathering for me, no cousins no uncles no nothin  \njust parents, brother and dog",
            "score": 16,
            "replies": []
        },
        {
            "author": "KFChero1",
            "body": "i just moved across the country, problem solved :)",
            "score": 7,
            "replies": []
        },
        {
            "author": "inquisitor_steve1",
            "body": "Many such cases",
            "score": 6,
            "replies": [
                {
                    "author": "inquisitor_steve1",
                    "body": "Also one of my cousins are a redneck biker gangster who killed 6-8 people.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Mohc989",
                            "body": "Insane lore drop",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VinSh4dy",
            "body": "I will probably not be seeing my family after I start transitioning since a few of them would probably kill me if they found out I was trans. They're not the best people ever though, so I think it's fine\n\n![gif](giphy|7k2LoEykY5i1hfeWQB)",
            "score": 4,
            "replies": []
        },
        {
            "author": "Catstronaut_CPP",
            "body": "My aunt stole our entire inheritance when my grandmother died, and makes up stories about us to spread amongst other relatives. My mother let it go so she could try to \"mend their relationship,\" which has gone literally nowhere in the 30 years of my existence because one party has made it abundantly clear that they have nothing but hatred for the other, but my mother refuses to take the fucking hint.",
            "score": 3,
            "replies": []
        },
        {
            "author": "meadowsirl",
            "body": "If the amount of jerks you know exceeds a certain threshold it is very likely that you are in fact the jerk.",
            "score": 3,
            "replies": [
                {
                    "author": "orquidborgo",
                    "body": "Not necessarily, there are entire families that forgive convicted pedophiles and let them have totally unsupervised access to children just because \"they are family\" (Like mine!!! 😊 My mom cut them all off to protect me and my brother because they keep trying to get me and my brother alone with him to prove that he became a good christian man and is not a pedophile anymore)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shyguymaster2",
            "body": "you ok?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mohc989",
            "body": "My cousin disappeared man. I miss him so much, no one knows where he is since his mum passed. We are a close family and he was really close to me and it still hurts not knowing where he is\n\nIdk if he cut us off or what, or if he’s even alive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "C0urt5",
            "body": "Mom’s side of the family is the only one who does reunions and they’re alright.\n\nDad’s side of the family got some wack shit going on.",
            "score": 2,
            "replies": []
        },
        {
            "author": "IgniteThatShit",
            "body": "It was that way for the family that I hated but now it's to the family I liked and now my parents like the ones I hate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NotHeco",
            "body": "every dinner is a family gathering for me, no cousins no uncles no nothin  \njust parents, brother and dog",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rikolinoh",
            "body": "It's just epic, only to realise afterwards that means no more xmas presents D':",
            "score": 1,
            "replies": []
        }
    ]
}