{
    "title": "Doja Feet",
    "author": "BaldHourGlass667",
    "subreddit": "BlackPeopleTwitter",
    "rank": 18,
    "score": 8426,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 141,
    "url": "https://i.redd.it/ok6ax9w4h4pe1.jpeg",
    "id": "1jcwojr",
    "selftext": "",
    "comments": [
        {
            "author": "OswaldCoffeepot",
            "body": "Misquoting the best tweet that anyone has twote or will have ever twatted.",
            "score": 2594,
            "replies": [
                {
                    "author": "apple_atchin",
                    "body": "*Mistwoting",
                    "score": 168,
                    "replies": []
                },
                {
                    "author": "el_throw",
                    "body": "Twote and twatted. Thank you for the laugh, stranger.\n\n![gif](giphy|3oEjHI8WJv4x6UPDB6)",
                    "score": 450,
                    "replies": []
                },
                {
                    "author": "highkey-be-lowkey",
                    "body": "Nah I think the \"Ball up Top\" tweet is the best, but still all credit to Nore.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emergency_Brick3715",
            "body": "She was in that bitch showing feet and letting them say n*gger and everything.   Doja ain’t like us.",
            "score": 1860,
            "replies": [
                {
                    "author": "NfamousKaye",
                    "body": "Exactly why I can’t understand how she’s still famous. And her streamer boyfriend groomed minors. And she stuck up for him. I used to be a watcher of his before I found that out to boot. 🤦🏽‍♀️ like I will never support that woman ever again.",
                    "score": 159,
                    "replies": [
                        {
                            "author": "lilbuu_buu",
                            "body": "It’s a tale as old as time if your are big enough you can shot someone in the middle of fifth avenue and not lose voters",
                            "score": 102,
                            "replies": [
                                {
                                    "author": "NfamousKaye",
                                    "body": "Fucking facts. And I hate it.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "lita313",
                            "body": "Wait, I thought she was dating Joseph Quinn, the dude from Stranger Things.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Dense-Result509",
                                    "body": "She is now. They're talking about the previous bf.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "NfamousKaye",
                                            "body": "Yeah I was talking about J Cyrus. I thought they were still dating cause I haven’t been bothered to check. Even took him off my watchlist on twitch a year ago so I’m out of the loop. lol",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NfamousKaye",
                                    "body": "Oh they’re not dating anymore?! Shows you how much I pay attention to her. 😂",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "maximillianm777",
                    "body": "I remember that, she fine asf but yeah that’s craze",
                    "score": 497,
                    "replies": [
                        {
                            "author": "Emergency_Brick3715",
                            "body": "She became unattractive to me after that.",
                            "score": 593,
                            "replies": [
                                {
                                    "author": "Dreams-Visions",
                                    "body": "Oh I haven’t looked at her the same since. I just assumed people forgot. I didn’t. That kinda behavior speaks to how you feel about your blackness. I can’t fuck with that energy.",
                                    "score": 700,
                                    "replies": [
                                        {
                                            "author": "KageStar",
                                            "body": "> I just assumed people forgot.\n\nShe was really lucky that the pandemic took off and people had more important stuff to care about. She was on the way to getting canceled before it.",
                                            "score": 208,
                                            "replies": [
                                                {
                                                    "author": "877-HASH-NOW",
                                                    "body": "Nah not even just that, iirc George Floyd was murdered days after this came out and everybody completely shifted their focus to that understandably",
                                                    "score": 18,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Emergency_Brick3715",
                                            "body": "That’s the energy I’m on.",
                                            "score": 72,
                                            "replies": []
                                        },
                                        {
                                            "author": "877-HASH-NOW",
                                            "body": "Never forgot. Never looked at her the same",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "LonelySiren15",
                                            "body": "Absolutely not. She obviously has a lot of internal issues to deal with.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ChrysMYO",
                                    "body": "Yeah any picture after, her confidence in herself seems like a facade. I hoped she's worked on her mental space since then.",
                                    "score": 81,
                                    "replies": [
                                        {
                                            "author": "Solo_Fisticuffs",
                                            "body": "this is gonna seem weird but i feel like the shift happened publicly after her throat surgery",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "877-HASH-NOW",
                                                    "body": "Throat surgery?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Solo_Fisticuffs",
                                                            "body": "was vapin too much",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "877-HASH-NOW",
                                                                    "body": "Damn that’s crazy ",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "maximillianm777",
                                    "body": "I still find her attractive but the respect I have for her is gone",
                                    "score": 96,
                                    "replies": []
                                },
                                {
                                    "author": "aye-its-this-guy",
                                    "body": "Y’all would still smash tho",
                                    "score": -22,
                                    "replies": [
                                        {
                                            "author": "Sprangatang84",
                                            "body": "Nope. The way I imagine it, if your soul stank, your coochie stank too. Plenty of alternatives to inserting yourself in that kind of crazy.",
                                            "score": 48,
                                            "replies": []
                                        },
                                        {
                                            "author": "877-HASH-NOW",
                                            "body": "Nah I really wouldn’t. Not to mention that besides that being extremely unattractive she don’t look as good as she did then anyway ",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Sprangatang84",
                                                    "body": "Agreed. It's like she's slowly turning into Amber Rose, who while not 'ugly' was just never quite appealing to me.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ClaymoresRevenge",
                            "body": "I miss thick Doja when she did Moo!",
                            "score": 97,
                            "replies": [
                                {
                                    "author": "Solo_Fisticuffs",
                                    "body": "bro when she got thinner before the crazy my heart broke 🥲 this ozempic trend got me big mad in the streets and now all i got is muscle mommies and the OF girls who are thick AND funny and post booty for free sometimes",
                                    "score": -24,
                                    "replies": [
                                        {
                                            "author": "SheepishLordofChaos9",
                                            "body": "you think that was ozempic?  That was coke.  She was after what those white boys like.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "usuallycorrect69",
                                                    "body": "Yea her face was pretty much the same she was definitely hanging with old white dudes getting lit off that cola",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Solo_Fisticuffs",
                                                    "body": "nah im sayin ozempic TREND like everyone gettin thin at once. i just call it that generally cuz half of em doin it",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "SheepishLordofChaos9",
                                                            "body": "Nah, i got you man.  You're not wrong.",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "877-HASH-NOW",
                            "body": "Yeah I lost a lot of my attraction to her after that. She weird af",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TaticalSweater",
                    "body": "Its wild i figured this thread was about her before seeing title lmao",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Nandy-bear",
                    "body": "I was gonna ask is it ricIAL or racIST because if she's flashing her toes to a bunch of dudes who like black feet then hey have your fun you freaky lil toe ticklers, but nope, turns out I had too much hope for humanity.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "_Karashin",
                    "body": "Why is this such big news now. I remember back when I heard her name first, it was already rumoured she used to frequent on 4chan and that was early days 4chan with zero moderation.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Deathstriker88",
                    "body": "Her and Cardi B can fuck off. Cardi called black women/darker women roaches and monkeys.",
                    "score": 114,
                    "replies": [
                        {
                            "author": "Myymocha24",
                            "body": "HUH. When!?! Source please",
                            "score": 48,
                            "replies": []
                        },
                        {
                            "author": "Hill_045",
                            "body": "Woah. When did Cardi B ever state this? Because holy shit\n\nNot trying to discredit you, I just genuinely have never heard of this",
                            "score": 93,
                            "replies": [
                                {
                                    "author": "Kingbuji",
                                    "body": "Yea cause thats doesn’t seem like her from what I’ve seen about then i also realize where she was raised and her ethnic background and it tracks.",
                                    "score": 50,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "luckyarchery",
                            "body": "Cardi said that wack ass shit in like 2017 (or maybe that was when she started getting called out for it) but I’ve only ever heard her make excuses for it.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Far_Practice_9855",
                            "body": "ice spice too, hating on doechii and dark skin woman but the internet only cared about her shading nicki",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Competitive_Swan_130",
                            "body": "So you're just going to make shit up???",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "877-HASH-NOW",
                            "body": "Damn fr??",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lboogie757",
                    "body": "And the fact that she said she doesn't want us (black fans) to like her stuff",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "NeverDoingWell",
                    "body": "Wasnt there never any proof of that?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "noishouldbewriting",
            "body": "Sometimes it’s nice to be out of the loop.",
            "score": 641,
            "replies": [
                {
                    "author": "Whyamibeautiful",
                    "body": "Doja cat got caught doing this like a week or two before the pandemic hit and it was swept under the rug",
                    "score": 584,
                    "replies": [
                        {
                            "author": "heyhicherrypie",
                            "body": "I thought it was way before the pandemic- and she wore a T-shirt with a Nazi on it and the time she said she didn’t care about her fans got push back, reactions to her are wild",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "Whyamibeautiful",
                                    "body": "It was around the time Kobe died so Endor Jan /feb",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "I_am_Bearstronaut",
                                            "body": "Kobe just wanted to see the Ewoks",
                                            "score": 41,
                                            "replies": []
                                        },
                                        {
                                            "author": "877-HASH-NOW",
                                            "body": "I thought it was May 2020 that it came out and the blowback wasn’t so severe bc George Floyd was murdered within days after that happening?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lilbuu_buu",
                                    "body": "The chat rooms were before the pandemic and was know by a small amount of people. I remember listening to her old old stuff like 2016 stuff and it was a rumor she was into race play",
                                    "score": 44,
                                    "replies": [
                                        {
                                            "author": "heyhicherrypie",
                                            "body": "I remember I first heard about her because she tweeted about why she used the f slur and me and all my queer mutuals were like???? What? Then the chat rooms happened and I was even more confused",
                                            "score": 21,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Interesting-Wing616",
                            "body": "It was swept under the rug because she had a number one song out and it was lockdown.",
                            "score": 338,
                            "replies": []
                        },
                        {
                            "author": "Publictransitviking",
                            "body": "How can you put do this to someone, just casually sharing this specific piece of information to a soul free of it's pain.",
                            "score": 125,
                            "replies": []
                        },
                        {
                            "author": "MusicListener3",
                            "body": "Doja’s PR team plandemic confirmed",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "pizza_slayer1",
                            "body": "I'm still confused. She was in a racist chat room? What's a racist chat room? And why is her posting her feet pics controversial? Was she trolling the racist?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Stevie_draws",
                                    "body": "It's a chat room for racists. Kinda self-explanatory. The feet pics wouldn't have been as controversial if she wasn't posting them at the online Klan meeting.",
                                    "score": 82,
                                    "replies": [
                                        {
                                            "author": "pizza_slayer1",
                                            "body": "So, the controversy is that she was part of the community. I thought she was posting feet pics to make the racists mad that she's Black.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "asuperbstarling",
                                                    "body": "No. She was participating in raceplay sexual kinks. I don't know why they kept dancing around answering you. None of this was 'haha make fun', she was actively participating in the kink.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "Reasonable_Moment476",
                                                            "body": "So, she was a camgirl that catered to racists that became famous.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Stevie_draws",
                                                    "body": "It's been a lomg time, but yes, she was active in the chatrooms. There was more to it i think, but it's been like 6 years since this came out, so i don't remember the specifics",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "Dave-C",
                                                            "body": "I went looking around since I have never heard about this. She said she was a moderator in some chatrooms before she became famous. She said they are not racist chatrooms. That is all I could find out. I don't know exactly what happened but since the story died with her saying that I'm guessing there wasn't much of a story there to begin with.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "ifyoulovesatan",
                                                                    "body": "They were video chats and there are videos from them that resurfaced. [Random screenshot from a quick google](https://i.imgur.com/LUjo6ZP.jpeg).\n\nI remember watching some of them (there were several videos that resurfaced) and they seemed pretty bad. Doja Cat was (in the videos I saw) the only person in the chat who wasn't a white guy, and was basically holding court / the center of attention. And the other chatters were openly saying some really racist shit.\n\nFor context, they were like tinychat rooms (which were a thing for a while in like 2010-2015ish). There were tons of racist ones, but also for all sorta of degenerate shit but also fairly normal ones. The ones dojacat was involved in might not have been \"tinychat\" per se as there were other similar websites / platforms, but yeah. Getting into a video chat with like 5-20 other people was a thing for a while.\n\nGroups of usually teens or young adults would get together in video chat rooms and shoot the shit for hours, usually based around some kind of topic. I used to occasionally visit one that was filled with out and proud alcoholics when I was an alcoholic (though this crowd was decidedly older than most. A lot of 30-40 year olds).",
                                                                    "score": 17,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Aegean54",
                                    "body": "it was a chat room for racist white people and she is also a racist who was into being degraded by racists. and no she posted the feet pics cause she likes racists",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "author": "pizza_slayer1",
                                            "body": "What in the fuck. Maybe I should've stayed out of the loop.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "rap4food",
                                                            "body": "Receipts? this was public fucking knowledge posted everywhere bro. It was a pretty big controversy.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Ok-Key8037",
                                                                            "body": "Google it dumbass",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "xXKingLynxXx",
                                    "body": "It was a regular chat room but a lot of the people in there were white dudes who loved saying slurs, especially at her. She hung out there often and shared photos with those dudes like they were her friends.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kokokokow",
                            "body": "I don’t think it got swept, I think no one just cared enough.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Ok-Lychee6612",
                            "body": "Desus n Mero broke that story. I miss the art",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Fluck_Me_Up",
                            "body": "bro what? was it like a fetish thing for her or is that just who she is?\n\nI have work do and I’m reading about dojacat racist chat feet pics instead now, I hope y’all are happy ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "877-HASH-NOW",
                                    "body": "Probably a bit of both.\n\nEither way shit was mad weird, cringeworthy, and it turned me all the way off to her",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "877-HASH-NOW",
                            "body": "I thought it was May 2020 that it came out and the blowback wasn’t so severe bc George Floyd was murdered within days after that happening?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "batmansleftnut",
                    "body": "I have a lot of questions and I want none of them answered.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Koko175",
            "body": "Every time I see this, it reminds me how I knew about this YEARS before it came out and it makes me go -_-",
            "score": 85,
            "replies": [
                {
                    "author": "AladdinDaCamel",
                    "body": "How did you know before it came out?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Blvck_Lvngs",
                            "body": "Bruh was in the chat room slinging N words and peeping at the feet",
                            "score": 103,
                            "replies": [
                                {
                                    "author": "munrogoldy",
                                    "body": "🤣🤣🤣🤣🤣",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "usuallycorrect69",
                            "body": "I found out when worldstar posted moo for the first time some of the racist trolls knew her from 4chan.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Sunborn_Paladin",
                                    "body": "Thats deep lore",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "877-HASH-NOW",
                                    "body": "Wtf",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Intelligent_Cut635",
            "body": "![gif](giphy|2Nk9BZy04Sw80|downsized)",
            "score": 300,
            "replies": []
        },
        {
            "author": "Agitated_Meringue801",
            "body": "https://preview.redd.it/6lr5lvwom4pe1.jpeg?width=720&format=pjpg&auto=webp&s=99ae707d292781eaeb15531c6a0dbd973a6209ea",
            "score": 158,
            "replies": [
                {
                    "author": "princeparaflinch",
                    "body": "https://preview.redd.it/e0d9ioloe9pe1.jpeg?width=828&format=pjpg&auto=webp&s=18e579daf64c69c138bc8a021a563f8d7556f159",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "DogWhistler1234",
            "body": "It’s the “racial chat rooms” that gets me every time",
            "score": 87,
            "replies": []
        },
        {
            "author": "Feeltherhythmofwar",
            "body": "It’s something about about ring-eyed activity that immediately turns me into buck nasty. I respond better to people insulting me than I do to coonery.",
            "score": 23,
            "replies": [
                {
                    "author": "877-HASH-NOW",
                    "body": "Felt! And “ring-eyed” is wild 😂",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShimmerRihh",
            "body": "This is half the reason I dont support her ass. \n\nThe other half was being nasty af to her fans and being unable to say sorry or that she really does love her fans. \n\nShes lost the plot fr. Tbf she never had it though",
            "score": 106,
            "replies": []
        },
        {
            "author": "hoppingvampire",
            "body": "Doja Cat was showin them Doja Dawgs",
            "score": 40,
            "replies": []
        },
        {
            "author": "cesc05651",
            "body": "Zoomed in on the pfp…yep",
            "score": 104,
            "replies": []
        },
        {
            "author": "Tainted_Bruh",
            "body": "![gif](giphy|rtP7INl6S8fa9h0zYk)",
            "score": 22,
            "replies": [
                {
                    "author": "idgafandwhyshouldi",
                    "body": "![gif](giphy|U7cdyoIo19Cu3eC2S9)",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "makaveddie",
            "body": "That's no small feet",
            "score": 26,
            "replies": []
        },
        {
            "author": "SimonIsBombBa",
            "body": "I hate when people put something in quotes but it’s straight up wrong",
            "score": 34,
            "replies": []
        },
        {
            "author": "tamtl",
            "body": "I’m so glad to find some place on the internet where people are pissed about this and aren’t just going, “ok, but she’s really talented tho”",
            "score": 9,
            "replies": []
        },
        {
            "author": "chief_yETI",
            "body": "did we ever get a link to those feet pics BTW? asking for a friend 👀\n\n>!Just kidding i don't have friends!<",
            "score": 79,
            "replies": [
                {
                    "author": "DissentSociety",
                    "body": "https://preview.redd.it/6ell6lmj55pe1.jpeg?width=1200&format=pjpg&auto=webp&s=d166ba6dfda98033bf0b2844de643ee6981c9959",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "Danteventresca",
                    "body": "![gif](giphy|XIMAnxwOi6Bp8MnLOs|downsized)",
                    "score": 133,
                    "replies": [
                        {
                            "author": "chief_yETI",
                            "body": "yes that was the point of the post dear",
                            "score": 66,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Token_Creative",
                    "body": "I’m sure you can find them on wikifeet.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Beat9",
                            "body": "wikiwhat",
                            "score": 36,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "towyow123",
                    "body": "They look like British teeth",
                    "score": 16,
                    "replies": [
                        {
                            "author": "877-HASH-NOW",
                            "body": "💀💀💀",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "301Blackstar",
                            "body": "Ha!!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "forthefreeskii",
            "body": "the world likes to sweep this under the rug so i’m glad yall brought it back. miraculously everyone “forgot” because the george floyd stuff happened which kicked off the riots and whatnot but yeah fck doja cat.",
            "score": 14,
            "replies": [
                {
                    "author": "877-HASH-NOW",
                    "body": "Yep! George Floyd being murdered caused people to shift their attention away from this (she was the big story in the days leading up to that) and she didn’t get enough hate for that to my liking ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "VacationExtension537",
            "body": "Why are ppl still on twitter",
            "score": 15,
            "replies": [
                {
                    "author": "877-HASH-NOW",
                    "body": "Nah fr",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ommi9",
            "body": "Never actually met a musician who had a  race play fetish.",
            "score": 8,
            "replies": []
        },
        {
            "author": "SouthSideCertified79",
            "body": "Why does nobody ever mention she was in there pulling her titties out for the skinheads too?\n\nWhy do y’all just bring up the feet shit like it was just a silly little thing. \n\nThe constant attempts to give Doja Cat a soft landing …",
            "score": 12,
            "replies": []
        },
        {
            "author": "Current_Focus2668",
            "body": "She said she dropped out of school at sixteen and mostly socialised in those 4chan type chat rooms with edgelorg bros. ",
            "score": 14,
            "replies": [
                {
                    "author": "dreckdub",
                    "body": "That doesn't make you into race play etc",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "Maleficent_Nobody377",
            "body": "Ohhhhh nooooo….tf  she’s doing what?!?\n\nsomebody go save this dude\n\n![gif](giphy|iO4ptP2iuV29yui3mx)",
            "score": 9,
            "replies": [
                {
                    "author": "thelovelymissck",
                    "body": "Nah, Joseph Quinn made his bed. He can go lie in it. There's no way he wasn't aware of at least some of her bullshit.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fireball_Flareblitz",
            "body": "It's 3:30 in the morning for me, what the fuck am I looking at? Can someone tell me what's going on?",
            "score": 5,
            "replies": []
        },
        {
            "author": "speedheart",
            "body": "pandemic did not make me forget this",
            "score": 4,
            "replies": [
                {
                    "author": "877-HASH-NOW",
                    "body": "Facts",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mendopnhc",
            "body": "Wesley lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheeQuestionWitch",
            "body": "I love when people get pedantic about diss tweets! Get the quote correct!",
            "score": 3,
            "replies": []
        },
        {
            "author": "877-HASH-NOW",
            "body": "Will forever be funny.\n\nAlso we don’t talk about how weird that situation and Doja Cat is for that. She got away with it bc George Floyd was murdered days after that came out",
            "score": 3,
            "replies": []
        },
        {
            "author": "irepMiami",
            "body": "Btw Doja has some ugly ass feet too 🤢",
            "score": 2,
            "replies": []
        },
        {
            "author": "IntelligentMeringue7",
            "body": "I wish we would stop correcting non-Black people when they think they know about our culture(s).",
            "score": 10,
            "replies": [
                {
                    "author": "chief_yETI",
                    "body": "yeah, I notice that everytime and no one else has ever said anything, so I just figured it was me that was the problem for thinking that",
                    "score": 2,
                    "replies": [
                        {
                            "author": "IntelligentMeringue7",
                            "body": "Based on the downvotes, were the minority, in here anyway.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CarrtoonJack",
            "body": "And her feet are ugly at that 😒",
            "score": 0,
            "replies": []
        },
        {
            "author": "peanut47",
            "body": "Too long didnt read. I did look up her feet pics and they are not good. I think she should get a pass on all the racism allegations, its basically terrorism to racist foot fetishists",
            "score": -9,
            "replies": [
                {
                    "author": "Embarrassed_Cow",
                    "body": "Yea I'm not 100% convinced that she wasn't doing it to troll them and piss them off. Since it looks like no one here actually knows, I'm not spending energy hating someone I don't know for something I don't know they did.",
                    "score": -16,
                    "replies": [
                        {
                            "author": "877-HASH-NOW",
                            "body": "She was absolutely not doing it to troll them but okay 👍🏾",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Embarrassed_Cow",
                                    "body": "Well okay. How do we know that? I'm saying. That I don't know either way.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YEAHHHHHNHHHHHHH",
            "body": "where can I see them?",
            "score": -1,
            "replies": []
        }
    ]
}