{
    "title": "A failed industrial revolution",
    "author": "herewearefornow",
    "subreddit": "BlackPeopleTwitter",
    "rank": 19,
    "score": 7379,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 87,
    "url": "https://i.redd.it/erorrivqj4pe1.png",
    "id": "1jcx0zj",
    "selftext": "",
    "comments": [
        {
            "author": "Zenxyphen",
            "body": "Have you not spoken with a MAGAt?",
            "score": 596,
            "replies": [
                {
                    "author": "Aggravating-Alps4621",
                    "body": "DonaldGPT will be the next scam Trump runs",
                    "score": 126,
                    "replies": [
                        {
                            "author": "Turbulent-Candle-340",
                            "body": "Don’t you speak that shit into existence ",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "Easy_Fact122",
                            "body": "Don’t give him anymore dumb ideas 😂",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "thatsnuckinfutz",
                            "body": "\"it's all computerr!!\"",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "McNultysHangover",
                            "body": "Nah that would be competition for President elons AI and he can't have that.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "erikwarm",
                            "body": "Chat-GPTrump\n\n![gif](giphy|l0EQhAiNw3JDCz6kHq|downsized)",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EstablishmentFew5338",
                    "body": "My favorite may be the person insisting that [Babygirl Vance](https://youtu.be/DcZrn46IcoU?feature=shared) wasn't in drag because he was actually in a costume.\n\nOr the kid I worked with who told me he didn't brush his teeth for a decade because \"I just thought you didn't have to\" and responded \"well, what about Rihanna?!?!\" When I asked what he thought about the Trump and Epstein connections.\n\nThat story of the kid is 100% true. I told him he was onto the lies of Big Tooth and he did agree that was funny.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "iceepenguino",
                    "body": "Came here to say the same",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "SewRuby",
            "body": "AI speaks with the confidence of a mediocre white man.",
            "score": 329,
            "replies": [
                {
                    "author": "heyuiuitsme",
                    "body": "There it is .. the joke i was going to make .. anyway, here's their poster boy\n\n![gif](giphy|TIHzMj6YXRNCvmPkRw|downsized)",
                    "score": 83,
                    "replies": []
                },
                {
                    "author": "East-Worker4190",
                    "body": "Hey, I might have that confidence but I don't make up as much as ai.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "suprmario",
                    "body": "Not gonna lie, I am guilty of this sometimes, but I will at least correct myself after I realize it - and I'm barely mediocre!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "SewRuby",
                            "body": "Correcting oneself elevates you above mediocre, for sure!",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adamtherealone",
                    "body": "I had one tell me today that 30-20=20",
                    "score": 6,
                    "replies": [
                        {
                            "author": "SewRuby",
                            "body": "🤣🤣🤣 Stahp, really!? That's incredible.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PoppyseedCheesecake",
                    "body": "Exactly what I had in mind, but phrased much better",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "johokie",
                    "body": "I resemble that remark...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FistPunch_Vol_7",
            "body": "It’s a shame how bad Google Search has gotten. Shitty AI summary and fucking half the page is sponsored shit smh",
            "score": 97,
            "replies": [
                {
                    "author": "loptopandbingo",
                    "body": "If you want disable the crappy AI summary, just put the word \"fucking\" in the search.  Instead of \"how long do I boil an egg\", use \"how long do I boil a fucking egg\".",
                    "score": 51,
                    "replies": [
                        {
                            "author": "MelatoninFiend",
                            "body": "This is brilliant. It's like modern day L337speak to avoid the rudimentary chat filters in the 90s.\n\nNone of the techbros want their AI algorithms blocked in places with tight censorship and billions in capitalists like China, so they won't allow their AIs to recognize the word, lest it be repeated back in results and banned. \n\nIt took them years just to reach this point of non-functionality. Should be years before they're able to work around it.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "sadderall-sea",
                            "body": "holy shit this works thank you",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "FeloniousDrunk101",
                            "body": "Same logic that keeps my reddit NSFW alt ad-free.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Suredolikemyporn",
                                    "body": "Explain?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FeloniousDrunk101",
                                            "body": "For some reason when browsing reddit on an alt account only subscribed to NSFW subreddits I see no ads. Might be similar that AI companies don't want to be associated with NSFW words or something like that?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Itsprobablysarcasm",
                    "body": "I got called out for some bad AI recently. I got lazy and copy/pasted shit without fact-checking it.\n\nFortunately, there was no consequence beyond my own embarrassment, but it really is true you can't trust that shit at all.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "FatalTortoise",
                    "body": "google search got so bad and bogged down by SEO that the engineers at Google had to start putting reddit at the end of their questions just to get an answer.  That's why that's one of the autofill options when you search now",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Daemonicvs_77",
            "body": "AI was great until I started asking it about things I know a lot about. After that, I don't trust it as far as I can throw it.",
            "score": 175,
            "replies": [
                {
                    "author": "FatalTortoise",
                    "body": "that's literally an Elon.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Daemonicvs_77",
                            "body": "Funnily enough, I also asked ChatGPT if Elon was a smart person and it had nothing but praises for him. Kinda tells you all you need to know about AI.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "senteryourself",
                    "body": "Same. It just blatantly makes up information. I don’t trust it at all.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "blacklite911",
                            "body": "It literally tells you that it may get things incorrect. Humans will inevitably use it like a geni in a bottle though. You can't even get most people to understand what a credible source is. We're cooked.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "senteryourself",
                                    "body": "It’s not just getting things incorrect. It fabricates information stated with absolute confidence, which it then uses to draw inferences and arguments which are based on nothing. Further, it has a nasty habit of fabricating sources and even going so far as to fabricate DOI numbers on academic articles. When called out on this, AI will apologize and feed you another source which it swears up and down is the real source. It’s like catching a pathological liar lying, it cannot admit its wrong and even when it does it lies and gives another bad source.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "blacklite911",
                                            "body": "It usually admits it’s wrong when I correct it. It’ll be like “oh yea you are correct because blah blah blah…”  it would be better if it was programmed to express uncertainty when it has it.  But hey if it gives you sources then you should check em. Treat it like a college student.\n\nAnd just be like, “that source is trash, stop being a fucking idiot. “",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thatsnuckinfutz",
                    "body": "its only decent for compiling work emails in a better tone and recipes lol",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Might7Guy",
                            "body": "Yes!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zigxy",
                    "body": "I work in the car industry and daily I do quick google searches. It used to have a misinformation rate much lower than today. Everything changed a year or two ago.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Kingbuji",
                    "body": "I asked how many r’s are in the word raspberry. It said two, so I never trusted ai.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "tryfap",
                    "body": "https://en.wikipedia.org/wiki/Gell-Mann_amnesia_effect",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Daemonicvs_77",
                            "body": "That is 100% my friend with AI. He works in a sort-of adjacent field to mine and one day he'll be sending me screenshots, laughing how ChatGPT got something completely wrong and the next day he'll be like \"I asked ChatGPT how to wire-up my new induction plate to electricity.\" (eventually, he had to call an electrician)",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "coladoir",
                    "body": "Deepseek-R1 is good, IME, for philosophy stuff and Socratic dialogue. My way of telling whether an LLM is gonna be accurate for my uses is to ask it to compare and contrast Max Stirner's Egoism and Ayn Rand's Egoism. Chat-GPT, Llama, and Olmo are not good at answering this, but deepseek-R1 is the first to give me actual nuance in a response, and be able to actually express the implied preclusions of these ideologies when implemented IRL (which the rest all failed at doing). Its helped me with other things I do have good knowledge about, like chemistry and pharmacology stuffs.\n\nI think the thinking/deep thought models are gonna be a good improvement as they introduce \"doubt\" and \"confidence\" to the LLM in a more direct way, and it makes them more wary of saying things theyre not completely certain of. If trained on good data (this is the key), then these should be pretty trustworthy for general information purposes. But AFAIK deepseek is taking their model creation more seriously than companies like OpenAI, Google, and Meta which are literally dumping any and all information into the model, much to its own chagrin, frankly (like you mentioned with the suggesting rocks, or suggesting glue on pizza). Ive never had this type of issue with deepseek-R1 (yet).\n\nOverall though I still think the only real actual good use of LLMs is for Socratic dialogue. They are actually really good at this. Next time youre trying to figure out what you believe or something, talk to AI about it and prompt them explicitly to do a Socratic dialogue (i.e,. \"I want to start a Socratic dialogue to discuss criticisms of religion. [Question or assertion here]\"). \n\nThis is coming from someone who is deeply critical of LLMs btw. I detest all the \"creative\" uses for LLMs, hate how theyre stealing jobs, distrust those who are running them (which is why I run my models locally using Ollama and ChatboxAI), and hate the power/water consumption of these LLMs (also why I run local). And I definitely hate how LLMs are being used for support chatbots now; theyre worse than the old simple ass preprogrammed ones. \n\nI dont think they are to be used for most of the things people use them for, this doesnt make them useless overall though. I think Deepseek-R1 is a step in a better direction too, one which I feel will result in more accurate answers from LLMs so long as training data is somewhat curated to be actually, y'know, good data.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "stoned-autistic-dude",
                    "body": "What AI are ppl using? Not all AI is the same. That’s like saying Google and Apple make the same phone bc they both make phones. It’s not true, they each have distinct pros and cons. My rule is that if it’s the only product offered by a company, it’ll usually be better than a product offered by a company that has multiple subsidiaries it’s investing resources into. \n\nGoogle and Facebook have absolute dogshit AI. It’s the most unreliable shit I’ve ever seen. And those seem to be the ones ppl rely on the most. Google is notorious for starting projects and then quitting development so I don’t ever rely on anything by Google. Meta has the accuracy of a crackhead on a sick one. Even legal software like Westlaw and Lexis have horrible implementations bc they rushed out some half-baked nonsense.\n\nI’ve gone up with ChatGPT asking questions I know the answers to and it’s about 90% correct, from mechanics to engineering to statistics to whatever. I get the occasional wrong answer but it’s usually quickly identifiable when I do a bit more research into the sources provided. Now that shit is basically a permanent paid service bc it’s helped me so much.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Daemonicvs_77",
                            "body": "Google's AI famously advised people to eat 1-3 rocks per day for better health and I didn't even know Meta had one. I was talking about ChatGPT.\n\nAs impressive as it is, the answers are still gonna be the average of the things that a bunch of guys, often without any expertise or knowledge on the matter had to say about a specific topic on the internet.\n\nAnd while it will get a lot of things right, 90% according to your own experiences, it's the things that it doesn't get right that concern me because, I don't know what I don't know; if I'm asking it about something, it's because I don't know anything about it and if I don't know anything about it, I have no idea if the things it's telling me are in the 90% or the 10%, so I can either check every single thing it tells me (which defeats the purpose of using it) or be completely wrong about 10% of the time, which isn't an option in my line of work.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "blacklite911",
                            "body": "I'm using it for pathophysiology and medical stuff in general. CHAT GPT is like 75% correct. Claude is better at like 85%. \"Choose all that apply\"type questions  trip them up a lot. Definitely worth it. It helps you learn more efficiently if you understand the shortcomings and know how to use it effective. But thats just like anything though. Same if you google stuff, you have to understand the nuances of sourcing and all that.  Rest assured a lot of people will misuse it though because they're allergic  to wisdom and nuance.\n\nI paid for both but Claude fits what I do better. OpenAI has a better package overall now though. Gemini and Microsoft copilot are lagging behind in terms of services. But Gemini has the best natural sounding speech generator",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "stoned-autistic-dude",
                                    "body": "I’m sorry, what? My conservative estimate of 90% is unreliable? You’re on drugs, my guy. A 90% AI accuracy rate was enough for AlphaFold in determining the 3D structures of proteins. That was groundbreaking for medical advancements. And you think it’s not good enough? And that’s after 2 years of LLM model evolution. \n\nMath is a set series of principles which are established in nature. This is a learning algorithm. Comparing the two is insane.\n\nLmao",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kingtibius",
            "body": "I mean, I wouldn’t say outmatched. It’s got competition…\n\nhttps://preview.redd.it/fmd2kbhnk4pe1.jpeg?width=1170&format=pjpg&auto=webp&s=3e3aa1349f304f54d9fbed4b1e83097761da41f9",
            "score": 129,
            "replies": []
        },
        {
            "author": "-The-Grand-Zeno-",
            "body": "They get it from Siri, she used to be firing off whatever the hell she wanted. “Im not programmed to answer that” Robot Bitch I paid for apples finest, now tell me how to hot wire a 98 park avenue.\n\n![gif](giphy|4RXolveHE4bQY)",
            "score": 36,
            "replies": []
        },
        {
            "author": "Snoo_72851",
            "body": "techbros actually",
            "score": 23,
            "replies": []
        },
        {
            "author": "Five-Oh-Vicryl",
            "body": "I love how the AI parlance casually calls them “hallucinations” like it’s grandma after taking Benadryl for a rash instead of programming gone rogue",
            "score": 21,
            "replies": []
        },
        {
            "author": "Dejong17",
            "body": "Of course it gives wrong replies with no shame it's made from white dudes, that there whole personality",
            "score": 18,
            "replies": []
        },
        {
            "author": "dryintentions",
            "body": "The Math explanations are borderline treasonous😭",
            "score": 34,
            "replies": [
                {
                    "author": "herewearefornow",
                    "body": "Someone in Kenya will have to fix everything that someone in Palo Alto got wrong.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "pat_rice1",
            "body": "Then you call it out and it be like “oh, you are absolutely right”",
            "score": 13,
            "replies": [
                {
                    "author": "Kingbuji",
                    "body": "And still give you the exact same answer from before.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "NeverDoingWell",
                            "body": "Man I got stuck in a loop on chatgpt. I asked it for help with some code and it gave me wrong answer #1. I told it the answer was wrong and it then said \"Oh I'm sorry, that was the wrong answer\" and it gave me wrong answer #2. I told it the answer was wrong again and then it was back to wrong answer #1 \n\n\nIt just kept going between two wrong answers endlessly",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Kingbuji",
                                    "body": "Yup it always does that with code. And half the time the solution is a syntax(?) error that it caused.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pat_rice1",
                            "body": "Yep. \nI’ve found myself arguing with the damn robot. https://media.tenor.com/t_e3F0kScTMAAAAM/math-problems-hilarious.gif",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "pat_rice1",
                            "body": "Now we look dumb because we are arguing with the chat, trying to prove to it why it’s wrong.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KaneHusky13",
            "body": "DJT admin eyeing AI the way Goku eyes someone with really strong depression.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Meperkiz",
            "body": "I have to warn my doctoral students all the time to please fact check against a reputable source. Our newly graduating healthcare professionals are leaning way too much on AI to learn how to take care of y’all",
            "score": 9,
            "replies": []
        },
        {
            "author": "energirl",
            "body": "They must have never met a white college frat boy business major.",
            "score": 5,
            "replies": [
                {
                    "author": "Loriloves12345",
                    "body": "I have met one … talking about DEI . I was soooooooooo ready to fight him.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DudeAxeMachine",
            "body": "It's made by shitty men with no personality. What did anyone expect? Just wait until it starts a podcast.",
            "score": 6,
            "replies": [
                {
                    "author": "JaviMT8",
                    "body": "That's already a thing with google's notebookLM lol.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "bylebog",
            "body": "But very sorry and will have another earnest lie in a minute.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nic1Rule",
            "body": "That's why it's great for programming. The compiler will tell me if the code it gave me is even close to functional.",
            "score": 3,
            "replies": [
                {
                    "author": "herewearefornow",
                    "body": "Compiler? You're an old school engineer.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MiserableOwl",
            "body": "Me having to correct GPT for making up K-pop songs 🤣 I was given a “AI” created playlist by a friend and it was all made up seventeen and ateez songs",
            "score": 3,
            "replies": []
        },
        {
            "author": "Banned3rdTimesaCharm",
            "body": "I've spoke to many humans who are way more confidently incorrect. At least you can tell an AI it's wrong and it'll accept it and learn.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beautiful_Noise_",
            "body": "Confidently incorrect.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CroneofThorns",
            "body": "I listened to a really great interview wherein an AI expert (I cannot remember his name), talked about how none of this is actually AI, but a pretty basic language based learning model that is not even that good. They hype around calling it AI has more to do with getting and keeping investors hooked and believing that the big jump is just around the corner ala Tesla and autonomous driving or Holms and Theranous. Other types of AI; how is this picture different from the one before? boom cancer detected... It's not as weighty as they are leading us to believe and it's making them billions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "charlieyeswecan",
            "body": "Yea, I asked it if it even knew music cause it kept getting it wrong with confidence then tried to play it off that it does struggle with music. Yep, ya do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Either-Durian-9488",
            "body": "Ever watch a computer nerd in a literary analysis class? Same difference",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigGuyWhoKills",
            "body": "Never been on a flat Earth sub.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Isaidalrightalready",
            "body": "Have you met any mediocre white men?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrnatural18",
            "body": "Except by Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zachnikp",
            "body": "It's definitely proof that if you lie with enough confidence, someone will believe you",
            "score": 1,
            "replies": []
        },
        {
            "author": "ceelogreenicanth",
            "body": "Almost as confident as the announcers of a dog show saying the b word.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourLictorAndChef",
            "body": "it's going to be the next big advertising platform (think product placement and sponsored bias) after AI agents can access every app on people's phones and harvest 100% of users' data.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valyas11",
            "body": "Hallucinations",
            "score": 1,
            "replies": []
        },
        {
            "author": "angolaldmeris",
            "body": "Can we call it \"Alternative Intelligence\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "whiteKnightCARD",
            "body": "Hope ya white-collared mfers better be using AI at your jobs or you’ll be left behind begging for a stimmy in a few years ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ransackeld",
            "body": "No better example than the book: Rising Out of Hatred. Google Derek Black. See how education can help BREAK the racist GOP brainwashing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bellabarbiex",
            "body": "It drives me fuckin nuts I was just mad about it like 20 minutes ago. How does this result make sense? Oh my God. I use a search function a lot to look for books that I can't remember the name of and I've even tried Snapchat out of desperation and it's always some made up shit or something totally unrelated. What also pisses me off is  when people use AI to search for an answer to help someone else but they don't double check the answer AI gave them so their \"helpful\" response is BS.\n\nhttps://preview.redd.it/mqprhy2p6gpe1.jpeg?width=1080&format=pjpg&auto=webp&s=b26c70bc59cfc2a30b6a55b5c467d62f594ae79d",
            "score": 1,
            "replies": []
        },
        {
            "author": "Normal-Apricot-6832",
            "body": "idk man Karoline Claire Leavitt would like a go.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PutinBoomedMe",
            "body": "As a guy that works in a very regulated and litigious industry I learned immediately that I wasn't trusting shit from AI.... It can put together a chicken noodle soup recipe for me but that's it",
            "score": 1,
            "replies": []
        }
    ]
}