{
    "title": "12 yo Grayson Manning almost died by trying to save his dog from getting run over - a year later, he became a paintball champion",
    "author": "ansyhrrian",
    "subreddit": "MadeMeSmile",
    "rank": 85,
    "score": 38209,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 260,
    "url": "https://www.reddit.com/gallery/1j2t9vv",
    "id": "1j2t9vv",
    "selftext": "",
    "comments": [
        {
            "author": "ansyhrrian",
            "body": "More information on his amazing story [here](https://people.com/boy-nearly-died-after-being-hit-by-truck-now-paintball-champion-8758868).",
            "score": 1187,
            "replies": [
                {
                    "author": "Amonamission",
                    "body": "The dog survived!!! Good that the kid is okay, but I’M SO HAPPY THE PUPPY DAWG IS ALIVE!!!!!",
                    "score": 2031,
                    "replies": [
                        {
                            "author": "Snapdragonzzz",
                            "body": "And the puppy dawg is training to be his service dog now 🥹",
                            "score": 537,
                            "replies": [
                                {
                                    "author": "StoppableHulk",
                                    "body": "The dog's just sitting there like, \"joke's on them, I would have become his service dog even if he didn't save my life!\"",
                                    "score": 181,
                                    "replies": [
                                        {
                                            "author": "ansyhrrian",
                                            "body": "Exactly!",
                                            "score": 43,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HoldMyDevilHorns",
                                    "body": "Omg that's awesome.",
                                    "score": 62,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Trustrup",
                            "body": "Thank you. Came to the comments for this. It said \"trying to save his dog,\" and in my head, that meant the dog died. I'm so glad the dog survived. (And the kid, too, of course)",
                            "score": 557,
                            "replies": [
                                {
                                    "author": "helen790",
                                    "body": "Literally! That was a terrible way of phrasing it!",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sethroganswift",
                            "body": "Came straight to the comments for this. I hope that kid and pup have many amazing years together",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "ontour4eternity",
                            "body": "Thank you, I wasn't sure if I could click on the story out of fear the dog didn't make it.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Neither_Square_5087",
                            "body": "Thank you! This is what I really wanted to know.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Ravenerz",
                            "body": "Right? Ik happy to find out that that brave young man was able to he a hero and saved the dog. Even more happy to know that the young man was able to make a full recovery to live a normal life. He got very lucky gambling like that.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "M1l3h1gh",
                            "body": "Read all of it for that. Poorly written title.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Amonamission",
                                    "body": "I know, a little annoying. But I did my service to the Reddit community 🫡",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Equivalent-Honey-659",
                                    "body": "His head flew “black”.   What does that even mean?? Speech to text?  Or just shitty AI?",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gavinkurt",
                            "body": "The child survived!!!Glad that the pup is okay, but IM SO HAPPY THE CHILD IS ALIVE!!!",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "ScreamySashimi",
                                    "body": "The title didn't make it a question of whether or not the child survived, so of course someone wouldn't be coming to the comments to find that out. They're celebrating the dog being alive because the title insinuated that it may have died.",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "gavinkurt",
                                            "body": "I get that but I’m just relieved the child made it through.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ScreamySashimi",
                                                    "body": "I think if that were truly your only motivation you wouldn't have responded where and how you did. Plenty of other top comments talking about how relieved they are that the child is doing well. Instead you responded to someone happy about the dog in a condescending way.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "agentwolf44",
                                            "body": "That's fine and all, but the middle phrase is completely unnecessary (and kinda messed up IMO): \"Good that the kid is okay, but\". ",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "ScreamySashimi",
                                                    "body": "The way I interpreted it was someone simply wanting to express their excitement to find out the dog had survived (since the title was questionable) - but also wanted to acknowledge that they were also happy the kid was OK. But given the title and photos, the kid obviously made it through. Only the dog was in question.\n\n\nI swear some people just go around wanting to intentionally misunderstand people and assume malice.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "todadile25",
                                                            "body": "No, there comment reads that it’s fine that the kid is okay but they’re more happy that they dog is okay. If they intended otherwise there is better ways to write it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ScreamySashimi",
                                                                    "body": "No, their point is made just fine.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "todadile25",
                                                                            "body": "There’s an overwhelming amount of people who wouldn’t hesitate to save a dogs life instead of a human or would be fine with someone dying instead of a dog. \n\nOr at least that’s what a lot of people have said on Reddit posts in the past. \n\nI agree that the title was poorly written, maybe even intentionally to get more clicks to find out about the status of the dog but that persons comment was also poorly written and reads like they care more about the dog. \n\nThey quietly said it was great the kid was okay “but” they were “SO HAPPY THE DOG WAS” and used exclamation points emphasizing that they were shouting that last part. \n\nI get that might not be what they meant but it’s what they conveyed in how they wrote it",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "spaceborders",
                                    "body": "Right?!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "gavinkurt",
                                            "body": "Heck yeah. I’m thrilled the child made it out alive. And I’ll leave it at that.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Jedasd",
                                                    "body": "Kid making it through is already in the post, no need to be a passive aggressive bitch about someone expressing happiness after learning that another living thing also survived.",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ravenerz",
                            "body": "Right? Ik happy to find out that that brave young man was able to he a hero and saved the dog. Even more happy to know that the young man was able to make a full recovery to live a normal life. He got very lucky gambling like that.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Amonamission",
                                    "body": "Yeah, having the kid and the dog be okay really is amazing. And also for the driver of the truck too. Could you imagine hitting a kid and feeling responsible for that even though it wasn’t your fault? If the kid had died and I was the driver, I’d absolutely be fucked up for life just from the guilt. So knowing that the kid survived and is doing a lot better must be so relieving for the driver of the truck.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "dmartino10",
                                            "body": "Everyone walked away, and now the kid's out here winning paintball tournaments like a little badass.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "williamiris9208",
                                            "body": "It’s rare to see a situation like this end so positively for everyone. Definitely a story with a lot of luck and resilience.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "This-is-Actual",
                            "body": "And became a paint ball champion!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "todadile25",
                            "body": "Am I the only one here more happy that the kid survived?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Amonamission",
                                    "body": "I think if the title mentioned that the dog had survived I think the comments would’ve been more focused on the kid. But OP did the post a disservice by not mentioning anything about what happened to the dog.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tiots",
                            "body": "what a weird comment. this child has permanent damage for the rest of his life.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "illtakeontheworld",
                                    "body": "If the dog died, it would've made it even more heartbreaking. If I were that kid, it'd be 10x worse to have had so many injuries and my dog died anyway",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "Amonamission",
                                    "body": "Well the title made no mention of the dog’s condition, and people are just as invested in pets as other humans. I’m not dismissing the kid’s injuries or his struggles, I’m highlighting the dog’s survival since OP did the title no justice.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "tiots",
                                            "body": "everybody would easily trade the dogs life for that kid to not be permanently injured ",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Local_Cow6266",
                                                    "body": "i wouldnt",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "afternooncicada",
                                                            "body": "Sociopath.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "This_Witness4302",
                            "body": "Yahusha is Yahuah",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "deeznunchuckas",
                            "body": "This is all I needed",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ForHelp_PressAltF4",
                            "body": "Than you for posting this ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "WooorkWoork",
                            "body": "Ofcourse it even became a paintball champion. Atleast thats how i read the title.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ImWhatsInTheRedBox",
                    "body": " >“I think the power of community and prayer saved him. I’m not even a religious person, but there’s just no other explanation.”\n\nI mean, quick paramedics, surgeons, nurses, modern medicine.",
                    "score": 119,
                    "replies": [
                        {
                            "author": "FreeTucker-",
                            "body": "Not to mention that the likely reason he was hit in the first place is the trend of driving two story pick ups everywhere for no damn reason. Seriously, as a full grown adult I can't see over the grill of these fucking monsters. A kid doesn't stand a chance. It's no wonder that pedestrian deaths in the US are at a 40 year high.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "ducksgoquackoo8",
                                    "body": "As a paramedic when I see those trucks I tell my husband \"There's another kid killer.\"",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Subwayabuseproblem",
                                    "body": "> the likely reason he was hit in the first place is the trend of driving two story pick ups\n\nbecause that makes sense\n\n\"He wouldn't have got hit if roads didn't exist\"\n\nSince Le Reddit army is circle jerking the bad truck narrative, \n\n\"The boy quickly jumped into action, running into the road, when a black RAM truck struck him.\"\n\n\ndeff. the trucks fault",
                                    "score": -28,
                                    "replies": [
                                        {
                                            "author": "FreeTucker-",
                                            "body": "He wouldn't have gotten hit if the driver could see over the hood of the bigass truck. He wouldn't have gotten injured as badly if the truck's grill wasn't head height.\n\nhttps://www.npr.org/2023/11/14/1212737005/cars-trucks-pedestrian-deaths-increase-crash-data \n\nSorry about your feelings tho",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MarfanoidDroid",
                            "body": "ER doc: well fuck me then",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Key-Pickle5609",
                                    "body": "Yeah I’m an ICU RN and can say we do a fuck of a lot of work to keep people from meeting Jesus",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MarfanoidDroid",
                                            "body": "Love my nurses in the ER and ICU. The unsung heroes",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Key-Pickle5609",
                                                    "body": "And we love our docs. Such a great collegial environment compared to something like med surg!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "agentwolf44",
                            "body": "There are many situations where even modern medicine can't seem to do much to save them and survival is nothing short of miraculous. I've seen/heard of a lot of cases where doctors give incredibly low odds of survival and yet the person pulls through and completely recovers.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "ImWhatsInTheRedBox",
                                    "body": "For every one that beats those low odds and recovers there's thousands upon thousands that don't. The miracle would be modern medicine granting the body the chance to repair itself when it can't do it alone.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "FUCK_NEW_REDDIT_SUX",
                                    "body": "> I've seen/heard of a lot of cases where doctors give incredibly low odds of survival and yet the person pulls through and completely recovers.\n\nWhat a stupid comment lmao... do you not understand that very unlikely things happen literally all of the time?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "agentwolf44",
                                            "body": "Very unlikely things like a girl who can't see and after being prayed for she can now miracously see? \n\n\nVery unlikely like my cousin who had 3rd degree burns over his entire body from a house fire and told that if he survives they'll need to amputate most of his limbs and extremities and after much prayer he healed and kept everything?\n\n\nAtheists will believe anything before admitting there might be a higher power...",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SuperRayGun666",
                    "body": "I took a hit from a car this summer to save my 6 month old puppy when a driver sped through a residential stop sign cross walk.  After I was hit the driver was upset that I damaged his car called me a bunch of racial slurs and bottled me when I was down on the ground.  ",
                    "score": 19,
                    "replies": [
                        {
                            "author": "eam1188",
                            "body": "Gonna need some backstory. Were cops called?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SuperRayGun666",
                                    "body": "Bro the guy threatened to blow my jaw off. the cops were called. I was taken to hospital.  My truck was stolen a few days later.  The guy was arrested.  I picked him out of a line up.  I pressed charges.  Currently trying to sue him and his auto insurance company.  Insurance is saying they don’t cover assault.  I’m saying I was hit by a car he was driving. We didn’t know each other. Therefore it wasn’t assault until he bottled me and therefore insurance is liable. \n\nI personally believe he is part of an auto theft or drug ring.  \n\nBefore he was arrested I had a few suspicious black Acura’s parking around my house with gangster looking thugs.   Guy was driving a black tinted out Acura when he hit me. ",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "SuperRayGun666",
                                    "body": "When I first wrote about the story on reddit somebody reported me and I had my account suspended for promoting violence.  I tried to appeal it explaining I was a victim of violence but the account was still suspended because they don’t understand context.    I also had a lot of people saying I was making up stories or that it never happened.  ",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No-Respect5903",
                            "body": "> bottled me \n\nhuh? like hit you with a bottle?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "SuperRayGun666",
                                    "body": "Yeah smashed me with a glass bottle across the head and face leading to dozens of lacerations across my face neck arms and even got a chunk of the bottle caught in my blundstone so when I got up it sliced up my ankle. ",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrightonBumer",
                    "body": "This not only made me smile but made my day! What a golden boy",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Fairy-Stardust55",
                    "body": "Pets are heros sometimes.....????",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "nerdwerds",
                    "body": "That kid is a hero.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Forsaken-Age69",
                    "body": "So happy to know that the puppy and the kid is doing well! Kid is a true bestfriend, hero and now a champion! Amazing!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CanAlwaysBeBetter",
                    "body": "When does this sub get renamed r/tragicbackstories?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "calliemurofficial",
            "body": "Grayson is a true hero! Pets are more than pets, they are family!",
            "score": 524,
            "replies": [
                {
                    "author": "HelgaBorisova",
                    "body": "He is a hero, but his mom is a moron by not paying attention and letting their dog to run into the road into the traffic. She could have lost a son and a dog that day.",
                    "score": 145,
                    "replies": [
                        {
                            "author": "Inner-Conclusion2977",
                            "body": "Also, in the article she says that he started played paintball again \"against medical advice\". Like i understand you almost lost your child and that's what he loves; but how are you going to let a 12 year old dictate what he is going to do",
                            "score": 120,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Yeah that bothered me too! He’s diving and rolling all over the paintball field after a broken neck less than a year ago?  I’m saying this as someone who broke their neck in a car accident when I was 14.",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "author": "Inner-Conclusion2977",
                                            "body": "Exactly! What if he seriously reinjured himself because you couldn't tell him no",
                                            "score": 21,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "anotherpoordecision",
                                    "body": "Your kid almost died. Partially because of your actions. I think them not wanting to say no to their kid for awhile is understandable.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "fredthefishlord",
                                            "body": "...they almost died because they *didn't* stop something. If anything, that should make a parent say no more often",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "mgonzo11",
                                    "body": "Seriously, what a negative and rude comment to make. A six month old great dane puppy is going to be fast as all hell if it gets a moment to slip out!! Many, many pet owners have to learn the hard way about being very mindful of the door",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thisisthewayidiot",
                    "body": "This is the way.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "getUserName01",
                    "body": "This bs",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "IntelligentPenalty83",
            "body": "As a retired RN I love seeing these stories.  We rarely get to see the positive results of our hard work.\n\n\nIt also shows that the limitations of an injury are determined by the individual, not the people treating them.",
            "score": 212,
            "replies": [
                {
                    "author": "JJw3d",
                    "body": "> We rarely get to see the positive results of our hard work.\n\nTrue that, you guys get the rough end of the stick when it comes to all the hard work you do & halfthe amount of praise & notice.\n\n> not the people treating them.\n\nHuh? while you're right about the individual you're right about your hard work too but it sounds like you're writing your self off at the same time lol \n\nSorry if you didn't mean it like that, just how it reads \n\n& as a kid who went through a rough accident I wouldn't be here to day if it was not for everyone on that day & their hard work, from the parents who seen the accident & rushed to me to the Dr's nurses & the other patients in the hospital who looked after me like I was their little brother during my hardest moments. \n\nI can only hope to be able to do the same for others as someone who's not medicaly trained etc e.g help any way I can.\n\nY'know pay it forward n all that.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "IntelligentPenalty83",
                            "body": "Sorry,  I was more thinking about the types that say or used to say \"you will never walk again\" rather than those of us who bust butt to give someone the ability to do whatever they want to achieve.  I told my daughter, who has a daughter with a repaired heart defect that almost cost her life \"don't hold her back from anything\".  After all I saw as a heart RN that became my mantra. Don't hold them back!",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "JJw3d",
                                    "body": "oh I gotcha!\n\nAwhh I thought I was miss understanding that part. People like you are the real hero’s & celebrities in my eyes <3  I wish more could be like you all over.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "okiedokiehon",
                    "body": "respiratory therapist here!  as someone who used to work in pediatrics i immediately teared up seeing this.  but, full disclosure, i always get choked up seeing these stories, as i see so many of my former kids reflected back to me.  no matter what the actual condition was that we were treating, be it cancer, a heart condition, trauma, some anomalous genetic condition, whatever, i just think of all the resiliency and bravery that these kids fight with.  it’s truly incredible, and also why i totally understand what you mean by the limitations of the injury being determined by the patient.  as the caregiver we can only do so much, and the accomplishments of medicine are finite.  once someone gets out of the acutely ill phase, so much of their recovery is determined by them.  that’s what makes their determination so amazing, because it’s not easy!  this kid is doubly brave, as he saved his dog and then went on to fight so hard for himself.  what a little hero.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "wasd911",
                    "body": "In the article it says he had a “trapped eye”, what does that mean?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Nurseytypechick",
                            "body": "Orbital fracture trapping the eye from moving properly. Needs surgical repair usually.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "wasd911",
                                    "body": "ow :(",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TrulyCleverUserName",
            "body": "A great human!",
            "score": 24,
            "replies": []
        },
        {
            "author": "trdamateur",
            "body": "We need more of these kind of news in today's world",
            "score": 16,
            "replies": []
        },
        {
            "author": "PsilocybVibe",
            "body": "Badass dude",
            "score": 13,
            "replies": [
                {
                    "author": "god_peepee",
                    "body": "Taking notes from John wick",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HookerHenry",
            "body": "What a champ!! Hope more success to come for him in the future.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Alodylis",
            "body": "Atleast he recovered god bless",
            "score": 6,
            "replies": []
        },
        {
            "author": "toodog",
            "body": "hero he must love that dog, glad he’s ok",
            "score": 6,
            "replies": []
        },
        {
            "author": "lpkzach92",
            "body": "What a hero.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Happy_cat10",
            "body": "Incredible kid and lucky dog!",
            "score": 2,
            "replies": []
        },
        {
            "author": "BuddyBuddyson",
            "body": "Hero 👑",
            "score": 4,
            "replies": []
        },
        {
            "author": "Inevitable_Channel18",
            "body": "Trying to save his dog…did the dog die?\n\nEdit: I now see the dog survived. Awesome!",
            "score": 4,
            "replies": []
        },
        {
            "author": "COB98",
            "body": "What a fighter !! ✌️🇨🇦",
            "score": 3,
            "replies": []
        },
        {
            "author": "AmbitiousTip6513",
            "body": "Keep your head up kid!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sir-Cee",
            "body": "❤️🙏🏼",
            "score": 3,
            "replies": []
        },
        {
            "author": "Verity_Ireland",
            "body": "Well done young man.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Grammey2",
            "body": "Bless them both❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Makaveli2020",
            "body": "What a champ.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Good_Replacement_337",
            "body": "Brave kid you're a beast lil dude keep it up you're what the world needs 😎",
            "score": 3,
            "replies": []
        },
        {
            "author": "Standard-Part7940",
            "body": "Not all hero's wear capes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gracenataliexo",
            "body": "A bond that will last forever. He’s a hero!",
            "score": 3,
            "replies": []
        },
        {
            "author": "hungry-reserve",
            "body": "Let’s get it king 💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻💪🏻",
            "score": 3,
            "replies": []
        },
        {
            "author": "silverado-z71",
            "body": "Good for you little dude first you save your dog, and now you’re a paintball champion, you go my man",
            "score": 3,
            "replies": []
        },
        {
            "author": "GoodPeepsEverywhere",
            "body": "GO GRAYSON! Good people are everywhere :)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Accomplished_Leg8164",
            "body": "So he didn’t “try to save” he saved his pup. I’m sure he would do it again to save his pup",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdministrationShot77",
            "body": "Thank god he is safe, and the dog too!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "dreamatoriumx",
            "body": "HELL YEA BROTHER!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "rhalocansuckit",
            "body": "Hell yeah",
            "score": 3,
            "replies": []
        },
        {
            "author": "SunriseSurprise",
            "body": "\"Ain't no rule that says a dog can't paintball\" - what went through my mind reading the title.",
            "score": 3,
            "replies": [
                {
                    "author": "betothejoy",
                    "body": "Yep. This is too far down.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yoghurt_Man_5000",
            "body": "Sometimes I wish I had been brave enough to do this. My dog got ran over right in front of me when I was 13. He was a good dog, but was terrified of sewer grates. I was taking him for a walk and he bolted into the street to avoid a grate on the sidewalk. The sound still haunts me. Me and my buddy scooped him up and ran him into my friends kitchen where he died a few minutes later.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HappycamperNZ",
            "body": "As a parent- fuck the dog.\n\n\nWe love them, but YOU are what's important. I can't cheer for a kid, no matter how caring, that got run over and hospitalized for trying to save a dog. The thought of losing one of my kids over a pet is horrific.",
            "score": 24,
            "replies": [
                {
                    "author": "helen790",
                    "body": "This is why I will never have kids. Dogs always come first for me.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Fauropitotto",
                    "body": "100%\n \nTo think of life-changing injury or death of a human being...over a dog???\n \nUnfathomable.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "HappycamperNZ",
                            "body": "The comments here though, the justification of believing a pet has the same value as a kid... it's just... wow...",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ImaginaryPolicy6302",
                    "body": "As a person, he did what felt was right",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Dreamsnaps19",
                            "body": "No, as a kid he had poor impulse control and ran into the road without thinking, something we expect of children but we most certainly shouldn’t be encouraging. \n\nDo I get the impulse to do anything for your pet even at the risk of your own life, even as an adult? Absolutely. \n\nBut what if the car coming down ended up in a serious accident because he ran into the road? What if someone in the car died? This is not shit we encourage because it’s dangerous for not just the person who runs into the road but also for the cars on the road. If someone died because of this we wouldn’t be lauding him as a hero. We’d be talking about how his parents failed to control their dog which led to this accident",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "fuckR196",
                                    "body": "1. Trying to save someone you love from death is not poor impulse control, it's excellent impulse control. The kid jumped into action to protect the dog from something it didn't understand the moment danger became present. That dog is likely more important to that kid than 99% of people in his life.\n2. If the *black RAM truck* going down the road ended up in a serious accident because a child ran into the road to protect their dog, maybe the dipshit driver in the *black RAM truck* should have been paying attention to the road and slowed down when they noticed there's children playing with dogs on that street. Believe it or not I've never ran over a child or a dog, probably because I pay attention while driving.\n3. If you run over living creatures in the road out simply out of convenience, I can't feel any empathy for you getting in an accident. There's a shitload of deer in my area and when they jump in front of my vehicle I slow down, honk my horn, and flash my lights. I don't plow into them full speed because they're in my way and it would annoy me to do anything else. That is psychopathic behavior.\n4. You're analyzing life and death as if it was a math equation. These are thoughts that can only be made in hindsight by people who weren't there. Life is not a trolley problem. You don't get time to consider the logistics and mull over the best outcome in your head to minimize the amount of harm done to all parties. Fight or flight kicks in and you either act immediately (even if it's illogically) or do nothing at all.\n5. They're literally a child. No shit they didn't rain man calculate the best possible scenario in their head. How dare they not sit there and do nothing so they could watch their pet dog, their best friend in the world, get smashed by a dipshit in a *black RAM truck*. I wouldn't have done what he did! That's bad impulse control! What a stupid child! That child needs to be taught a lesson! I'm smarter than this child!",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "N7Diesel",
                                    "body": "Exactly. ",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "ImaginaryPolicy6302",
                                    "body": "I'm not encouraging anything, I'm saying the move he pulled was based on heroism.. I think he learned his lesson without having to be scolded",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TechieGee",
                                            "body": "He wasn't scolded. You're responding to comments online on a reddit thread that this kid will never see in his life.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "CiaphasCain8849",
                                            "body": "It's not heroism. It's just not thinking.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "IntelligentPenalty83",
                                            "body": "That's my thinking and point as well. Given a choice,  I want that kid with me going into a dangerous situation. I don't want someone who stops to question whether it's a rational decision.  Yeah, we may die, but at least we tried.\nAnd before you question whether I really would, yes I  have. Situation was a car on fire after a wreck and I along with another RN  rushed in to render aid without stopping to think about it.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Dreamsnaps19",
                                                    "body": "And fuck anyone else who may also die? \n\nWhat if the kid caused an accident where a baby died. Is that ok too? What if there was another dog in the car that died. As long as he saved his dog, it doesn’t matter what happens to anyone else? \n\nWe’re not just talking about the kid’s own life that they are risking. If you want to jump into a fire. Go for it. That’s your own business. Good for you. When you risk other lives we now have a problem.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Garfalo",
                                                            "body": "Eh, you just sound like a coward to me.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IntelligentPenalty83",
                    "body": "The point is this kid is made of the stuff heros are made of. Had that been a fellow soldier he had rescued he would have been nominated for a CMH or medal of slightly lower presidence.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "HappycamperNZ",
                            "body": "No, he would have been disciplined for an impulsive, poorly thought through decision. If he had run out, got hit as he clearly did, he would have put two soldiers lives on the line plus everyone else who had to go rescue them.\n\n\nThis is the thing - a dog isn't a soldier. He wasn't saving a soldier, he was nearly killed for a pet.\n\n\nOther replier had a good point - what if the car had swerved and hit a tree, killing the driver? Would the kid still be a hero? As it stands that driver currently knows they nearly killed a kid that just ran out infront of them.\n\n\nMovies don't tell you all that crap - he's a kid that made an impulsive, poor decision that nearly got him killed and probably affect the driver the rest of their life.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "IntelligentPenalty83",
                                    "body": "Most heroes do something stupid and I've read many WW II CMH citations as a Navy HM when in Hospital Corps school in San Diego. As a parent I see that side of it as well and would been beyond heartbroken.  It's a very fine line.\nI hope they are able to stay in touch with the driver.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "HappycamperNZ",
                                            "body": "Yes, and how many of them saved a dog?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DramaticOstrich11",
                    "body": "My first thought as well. I'd be proud of him but also so fucking angry.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "HappycamperNZ",
                            "body": "Oh absolutely. Proud you care soo much, soo fucking angry you did that.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fuckR196",
                    "body": "What kind of psycho would just stand there as their pet runs into oncoming traffic? By the exact same logic if your kid ran into traffic would you just sit there and let them get hit because YOU are what's important? Why risk two lives when only one is in danger?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "HappycamperNZ",
                            "body": "A kid is not a pet. I don't know why people seem to think it's a comparison, or a worthwhile tradeoff. As a parent, it 100% isn't me that's important - what self absorbed person would say their life is more important than their kids? \n\n\nI'd 100% stop at a road my dog is sprinting across to make sure it's safe. You seriously would blindly run across a road?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "fuckR196",
                                    "body": "If you stop to make sure it's safe, it's already too late. You either respond or resign.\n\nWould you dive into traffic if your child ran into the road? What do you think a child, who has only lived a small fraction of their life, considers the closest thing to their own child they've ever had? Something they love more than anything in the world?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "HappycamperNZ",
                                            "body": "Again, a dog is not a kid. How can you keep forgetting this?\n\n\nIf there's not enough time to stop and look before charging into a road the dogs already dead, just doesn't know it yet. So be it. If a kid is there, you better believe I'll risk the hit.\n\n\nI have chased loose dogs down road, multiple times and not mine. Never once did I run out without looking - flagged cars down, all that, never ran infront of one and more importantly - left the kids in the car where they are safe.\n\n\nYes, they are the most important thing to them at that point. So is their favorite ball, or their phone, or their wallet, or the approvalof their peers. Kids have died chasing these blindly without thinking too.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "fuckR196",
                                                    "body": "It may come to a surprise to you, but a dog is a living thing, with a heart and a brain and a surprising amount of intelligence. A ball, or a phone, or a wallet, is not.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nightpanda893",
                            "body": "Anyone who knows that a humans life is more important than a dogs life?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "fuckR196",
                                    "body": "So if the kid jumped into traffic to save the dog, you'd jump into traffic too? So not only are the dog and the kid getting hit by the car, but now you are too, plus the truck is gonna swerve off the road and the driver's gonna crash. So you're gonna throw away your life and a stranger's life because you think your child is more valuable than them? What makes them so special?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "nightpanda893",
                                            "body": "They’re a human being. If your culminated life’s experience so far isn’t enough to convince you of the significance of that, there’s no point in me trying to convince you with a few words.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "fuckR196",
                                                    "body": "You're refusing to answer the question because you know your answer is stupid.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kickflipsandbiscuits",
            "body": "🐐",
            "score": 4,
            "replies": []
        },
        {
            "author": "henrythehippie",
            "body": "Attaway young man, the worlds heart needs more of your strength young one 👊",
            "score": 2,
            "replies": []
        },
        {
            "author": "Murdof",
            "body": "Feel for the kid, I had a couple neck surgeries resulting in a halo when I was 10. Those things are a form of torture.",
            "score": 2,
            "replies": []
        },
        {
            "author": "huskyprincezeal",
            "body": "Yoooo, this was something I needed to see. I was getting down about how things are going, but this kids story towers offer l over what issue I'm dealing with today. Kudos to you,  Grayson",
            "score": 2,
            "replies": []
        },
        {
            "author": "Educational_Mud_7925",
            "body": "Sure plays a mean paintball",
            "score": 2,
            "replies": []
        },
        {
            "author": "reddituser_05",
            "body": "Would have been more impressive if the dog became the pinball champion.![gif](emote|free_emotes_pack|joy)",
            "score": 2,
            "replies": []
        },
        {
            "author": "rab006435",
            "body": "You’re a hero dude.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Poormansviking",
            "body": "Adam Devine was hit by a cement truck and look at him now. \n\nYa never know what's gonna happen when Truck-Kun pays a visit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "These-Restaurant7001",
            "body": "What a strong boy, I'm so glad he was able to save his dog and live ♥️♥️♥️",
            "score": 2,
            "replies": []
        },
        {
            "author": "doberdevil",
            "body": "My brain read this title and thought a kid saved a dog then became a pitbull champion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "quartzguy",
            "body": "This is why I hate huge pickup trucks everywhere. That kid would have gone though so much less suffering if he had gotten hit by a reasonably sized vehicle.",
            "score": 2,
            "replies": []
        },
        {
            "author": "camelbuck",
            "body": "Yeah right, how does a dog even fire a paintball gun.",
            "score": 2,
            "replies": []
        },
        {
            "author": "3ndspire",
            "body": "MVP!",
            "score": 2,
            "replies": []
        },
        {
            "author": "justzurc",
            "body": "This is a man right there, proud of you kid.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JustJCJ",
            "body": "If you can dodge a car, you can dodge a paintball... I'm going to hell",
            "score": 2,
            "replies": []
        },
        {
            "author": "eh8904",
            "body": "I absolutely misread the title and thought the dog somehow became a paintball champion. This is an amazing story and a brave kid.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DogsRDBestest",
            "body": "> Manning's now 1-year-old Great Dane is training to be a service dog, learning how to press against the boy when his anxiety attacks.\n\nDogs are our best frens forever.",
            "score": 3,
            "replies": []
        },
        {
            "author": "R0b0tMark",
            "body": "They taught a dog to fire a paintball gun?!",
            "score": 2,
            "replies": []
        },
        {
            "author": "StJimmy_815",
            "body": "Why the FUCK would you write the title “trying” to save the dog. THE DOG LIVED PEOPLE",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drake_682",
            "body": "WORLD?! CHAMP?!\n\ncongrats!",
            "score": 1,
            "replies": []
        },
        {
            "author": "DizzyHighlight5668",
            "body": "Golden boy! Proud of you..",
            "score": 1,
            "replies": []
        },
        {
            "author": "diajean112",
            "body": "💚🧡💚🧡",
            "score": 1,
            "replies": []
        },
        {
            "author": "AvocadoHank",
            "body": "What a hero",
            "score": 1,
            "replies": []
        },
        {
            "author": "grand305",
            "body": "Glad he recovered and got to do a championship. \n\nDodge the paint win the gold 🥇.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheesemangee",
            "body": "I should start jumping in front of vehicles more often. Then I can finally be good at something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cwscws2023",
            "body": "Congrats, young MAN; you've earned it!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HoneyBadgerBlunt",
            "body": "Heck yeah! Way to go!",
            "score": 1,
            "replies": []
        },
        {
            "author": "StJimmy_815",
            "body": "Good story, mother is fallacious but whatever",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental_Two668",
            "body": "Hell yeah!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeeklyEmu4838",
            "body": "MashaAllah",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tayce_t1",
            "body": "Good job Grayson!",
            "score": 1,
            "replies": []
        },
        {
            "author": "original_greaser_bob",
            "body": "i read it as PINBALL. i was like wow when they tilt they must go hardcore!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExtremeSteak3726",
            "body": "![gif](emote|free_emotes_pack|give_upvote)",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "LEGENDARY.   What an amazing kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valueduser",
            "body": "How the hell does a dog fire a paintball gun with no thumbs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "adultdiaperwearer",
            "body": "we woulda been eating roadkill if that was me",
            "score": 1,
            "replies": []
        },
        {
            "author": "This_Witness4302",
            "body": "Yahusha is Yahuah",
            "score": 1,
            "replies": []
        },
        {
            "author": "N7Diesel",
            "body": "Endangering your life for a pet is fucking dumb.",
            "score": 1,
            "replies": [
                {
                    "author": "NoteNo819",
                    "body": "![gif](emote|free_emotes_pack|poop)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HereInTheCut",
            "body": "So this kid recovered to become a real life...Paintin' Manning?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thisdarlingdeer",
            "body": "Awh what a good boy. And I hope the dog made it too. A boy and his dog ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinkcherrymiss",
            "body": "what a hero! Grayson’s love for his dog and his determination to succeed are so admirable!",
            "score": 1,
            "replies": []
        },
        {
            "author": "haya1340",
            "body": "That's awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "angusmurf",
            "body": "Fuck yeah.  Way to go!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MOTOTROOPER",
            "body": "That kid is the embodiment of “Ranger Up”",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlutoJones42",
            "body": "What a bad ass!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leafs3489",
            "body": "Little king!",
            "score": 1,
            "replies": []
        },
        {
            "author": "sw_chakal",
            "body": "That's effing awesome!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Damntainted",
            "body": "What an absolute legend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "qwerty-314",
            "body": "A selfless soul with a brave and open heart :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "EkkoUnited",
            "body": "Not that the driver probably stood a chance at stopping in time anyway, but of course it was a RAM",
            "score": 1,
            "replies": []
        },
        {
            "author": "Organic_Berry_8732",
            "body": "🙏🏾🙏🏾🙏🏾🥰🥰🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "werewolf-luvr",
            "body": "Kids got a taste for danger",
            "score": 1,
            "replies": []
        },
        {
            "author": "CapitalAd3030",
            "body": "kids a total beast!",
            "score": 1,
            "replies": []
        },
        {
            "author": "skeetskeetmf444",
            "body": "❤️‍🩹",
            "score": 1,
            "replies": []
        },
        {
            "author": "MKTheGreat42",
            "body": "Im the photographer for our county and got to meet him and his family at a benefit event in our community. So glad he has quickly recovered and thriving! When I saw him he was still in the apparatus in the second picture but still able to walk/move.",
            "score": 1,
            "replies": []
        },
        {
            "author": "R_O_Bison",
            "body": "I would watch this movie!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm_Memories",
            "body": "Dude almost became a Spirit Detective",
            "score": 1,
            "replies": []
        },
        {
            "author": "0x7E7-02",
            "body": "Kids are beautiful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpiceyKoala",
            "body": "First, I read \"pinball champion\" and got that Who song in my head. I hadn't gotten through the photos yet. 😐",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hightierian",
            "body": "Hey Grayson if you read this, you’re awesome.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Celeryface",
            "body": "What a hero 💓",
            "score": 1,
            "replies": []
        },
        {
            "author": "Responsible_Bug3909",
            "body": "It's why he lived to play the game.  Great story",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raithed",
            "body": "Good story overall, good kid!",
            "score": 1,
            "replies": []
        },
        {
            "author": "singsofsaturn",
            "body": "At first I got excited to see a dog playing paintball, then I felt a little stupid but then very glad that  Gray Man Made it through.  I had a friend lose her little girl that same way.  She was only 8, terribly sad.  RIP Charlie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "onwinter",
            "body": "Champ!",
            "score": 1,
            "replies": []
        },
        {
            "author": "tornado1950",
            "body": "Let’s see a dog picture too💕",
            "score": 1,
            "replies": []
        },
        {
            "author": "TactfulSPY_FOX",
            "body": "Hero",
            "score": 1,
            "replies": []
        },
        {
            "author": "vidiamae",
            "body": "He was already a champion ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItsBal707",
            "body": "💪🏼💪🏼💪🏼",
            "score": 1,
            "replies": []
        },
        {
            "author": "dwntwn17",
            "body": "God I suck",
            "score": 1,
            "replies": []
        },
        {
            "author": "sc78258",
            "body": "there isn’t anything in the rule book that says a dog can’t play paintball",
            "score": 1,
            "replies": []
        },
        {
            "author": "notnahv",
            "body": "bless this kids heart ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "teenyweenysuperguy",
            "body": "A dog who became a paintball champion? Now that's impressive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NameLive9938",
            "body": "I just wanna say that this article has two things totally incorrect. 1) it hasn't even been a year since the accident, and 2) the game he won in this article was in November, which was only like 3-4 months after the accident.\n\nThis kid almost died and won a fucking championship NOT a year later but a few MONTHS later. That's fucking awesome.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MilitantRobTV",
            "body": "Respect 🙏 🫡",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cangaceiro_Atomico",
            "body": "🤜🤛🤲",
            "score": 1,
            "replies": []
        },
        {
            "author": "GalaxyChaser666",
            "body": "Poor kid. Stuck with a trach scar forever. I know the feeling",
            "score": 1,
            "replies": []
        },
        {
            "author": "goofyacid",
            "body": "what a great story, thanks for sharing!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rickjm",
            "body": "Kids are bouncy as f\n\nWay to go Grayson",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dogsarebetterpeople",
            "body": "Badass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tudk420",
            "body": "Needed this more than I thought",
            "score": 1,
            "replies": []
        },
        {
            "author": "shortstack3000",
            "body": "There goes all my excuses.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImpossibleIsopod7680",
            "body": "Need to see the dog too",
            "score": 1,
            "replies": []
        },
        {
            "author": "TYBTD",
            "body": "Saved that dog and became that dawg",
            "score": 1,
            "replies": []
        },
        {
            "author": "i-piss-excellence32",
            "body": "Holy crap what a strong young man. \n\nI also didn’t know there was paintball championships which is also super cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "JamesJacks123",
            "body": "Did his dog make it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "reckaband",
            "body": "Hero and paintball champion",
            "score": 1,
            "replies": []
        },
        {
            "author": "eggywastaken",
            "body": "This is an absolute tragedy that a human endured this to save an animal. Tragic.\n\n\nNo doubt the downvotes will be relentless. But someone needed to say it",
            "score": 1,
            "replies": []
        },
        {
            "author": "flowergirl665",
            "body": "Grayson! We love you and pray for your healing and peace amen. A true testament to the lords healing. This boy is resilient! Amen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serious-Ad-2864",
            "body": "This is the best thing I've read online in a minute. That kid is going to be an amazing adult!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreeTucker-",
            "body": "I didn't even have to read the article to know he was hit by a compensation truck. People who drive those things should be required to get a special license and insurance. Ridiculous.",
            "score": 1,
            "replies": [
                {
                    "author": "NoteNo819",
                    "body": "@FreeTucker, BUT, if there was a “get hit by a truck JACKPOT” ……  lay me in front of one of those “ compensation trucks” lol.\n\n\nThat kid is a special human being, he’s still here with us because the universe had big plans for that kid. 🖤🎨🔫",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "girlliveshorror",
            "body": "I needed to hear good news today. Way to go, small warrior, Grayson! I would do wild things for my fur babies too. That fearlessness in a 12 year old is unbelievable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "NoteNo819",
                    "body": "Lies.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CiaphasCain8849",
            "body": "bruh, it's just a dog. not even worth a broken bone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JayPrim3",
            "body": "Hell yeah! You kneel to no king!",
            "score": 0,
            "replies": []
        },
        {
            "author": "joellemaecyrus479",
            "body": "First he saved his dog, then he saved the game.",
            "score": 0,
            "replies": []
        },
        {
            "author": "claufigu2112",
            "body": "I loved this post, I showed it to my family and they loved it too, we bought a projector and showed it to the whole neighborhood and they loved it too. Our lives have changed thanks to this publication. Now we are full of happiness. Thank you so much.",
            "score": 0,
            "replies": []
        },
        {
            "author": "whyhavetoopeninapp",
            "body": "Thats exactly who should own a pet. If you don’t love your pet to do this in a heart beat you shouldn’t own one. They are our babies as precious as a human baby. If you don’t agree don’t own a pet. They deserve more love and care. Well raised boy.",
            "score": -3,
            "replies": []
        },
        {
            "author": "PassionNo4773",
            "body": "Looks like his dog is the only friend he has",
            "score": -1,
            "replies": []
        }
    ]
}