{
    "title": "Tesla sites hit by arson amid DOGE cuts, Elon Musk backlash",
    "author": "Lonely-Internet-601",
    "subreddit": "politics",
    "rank": 23,
    "score": 1645,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 133,
    "url": "https://www.independent.co.uk/news/world/americas/crime/tesla-cars-power-stations-elon-musk-b2709001.html",
    "id": "1j472oi",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmericaVotedTrump",
            "body": "Is it arson though? Tesla quality is questionable at best, probably just standard Tesla operational procedure to catch fire. Nothing to see here.",
            "score": 1,
            "replies": [
                {
                    "author": "thewossum",
                    "body": "They’re actually Roman friendship fires. I suppose in modern times they’re just fires but people were making them as a sign of solidarity with the African guy. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Niznack",
                            "body": "One day soon I hope we lovers of roman history get to do to Tesla what they did to Carthage.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GreatBowlforPasta",
                                    "body": "Tesla delenda est.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "insidemytelescope",
                                            "body": "Gesundheit",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Vio_",
                            "body": "Is this a Scipio Africanus pop culture reference??",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "airfryerfuntime",
                                    "body": "I imagine it's a reference to idiot chuds calling musk's nazi solute a 'Roman solute'.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ella-W00",
                                    "body": "There was this guy in the Roman Senate and at the end of every hearing when they wanted to leave already and the speaker asked “Does anyone hast anything to say?” the guy (I think it was Plinius the Elder, but I don’t remember) would say Ceterum senseo Carthaginem esse delendam, or  the short version Carthaginem delenda est. Translation: “I want to add that I am of the opinion that we should destroy Cathargo”.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Deicide1031",
                    "body": "\nIf Tim Cook lost this much cash apples board would have booted him.\n\nHow is musk not fired by teslas board?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sovtiv",
                            "body": "Have you seen the board?  One of them is his brother",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ithinkyouresus",
                                    "body": "I’m genuinely curious who fill the other seats besides family. You gotta be rich but how much do you like losing money to stay loyal to musk?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Traditional_Key_763",
                            "body": "his family owns a majority of the stock",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RabidGuineaPig007",
                            "body": "Because the stock is still 15X overvalued and if they get rid of Musk, the stans will sell.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HonestArsehole",
                    "body": "The French are actually making an effort to resist America’s swing to fascism, unlike Americans. Let’s not erase their contributions.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Black_Otter",
                            "body": "They’ve experienced fascism and knows what it looks like, half of the US sees it and shrugs",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dravenscowboy",
                                    "body": "Half of those who voted.   It could be worse.\nThe older folks think it can’t happen here where their dads died in defense of freedom, or that systems will balance the world out as they had before.  \nThe young men think it won’t impact them and get them more girls. So they can break their incel history.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "primetimerobus",
                            "body": "The Americans are directionless and apathetic.  Small protests and resistance has happened but nothing is galvanizing people into a real protest movement.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "unrealnarwhale",
                    "body": "Who knew that Republicans were right about EVs catching on fire all the time?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Olealicat",
                    "body": "I wish /r/conspiracy was actually about conspiracy and not politics. \n\nI bet dealers/ Tesla makes more money off fires, rather than these vehicles sitting in a lot.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AlphaBreak",
                    "body": "Are we sure someone didn't just try to wash the Tesla's before they left the factory?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Rishiku",
                    "body": "Probably set it up himself to collect the insurance money.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MontyAtWork",
                    "body": "Yeah there's a bajillion videos online of Tesla vehicles combusting uncontrollably and unable to be put out. Dude uses cheap parts and be QC so honestly it's a miracle these modern Triangle Shirtwaist Factories haven't had fire issues before.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SuspiciousTotal",
                    "body": "Just like in Russia people have careless smoking habits.  Who would of thunk",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hei04",
                    "body": "You are 100% correct. Sales are slumping and its being built by nazi i am sure quality is shit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Objective_Star_191",
                    "body": "Let’s make it world wide ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FocusFlukeGyro",
                    "body": "Well usually they catch fire with people inside. And for various genius reasons the doors don't mechanically open from the inside under certain circumstances.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "well-of-wisdom",
                    "body": "Since tesla sales have hit rock bottom, this could be insurance fraud.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zeddo52SD",
            "body": "One site in Massachusetts, and one site in… France?",
            "score": 1,
            "replies": [
                {
                    "author": "lejonetfranMX",
                    "body": "Toulouse",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Trick-Asparagus3500",
            "body": "Oh my, this is so sad. How unfortunate. It would be devastating if more people did this to more Tesla sites. Geez, I hope this doesn’t happen to every Tesla site there is. That would be horrible.",
            "score": 1,
            "replies": [
                {
                    "author": "fangelo2",
                    "body": "That just means Musk will sell more of them to replace the ones destroyed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "j_calhoun",
                            "body": "Not really.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "purpleowlie",
            "body": "He probably burned it down himself, to get money from insurance before the company just tanks.",
            "score": 1,
            "replies": [
                {
                    "author": "keepthepace",
                    "body": "I dont think people realize how much value this destroys for the brand. Tesla is now radioactive.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "D-Rich-88",
                            "body": "I live in CA and a coworker of mine said he stopped driving his because the last time he did he got two seig heil’s\n\nYeah that brand is like Chernobyl right now",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JakeConhale",
                                    "body": "And if you ran them over you'd be the one going to prison..... *sigh*\n\n/s obviously",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "airfryerfuntime",
                                    "body": "I know a guy who stopped driving his and bought a Toyota because people were keying it and dumping soda on it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "misimiki",
            "body": "And so it begins...",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarlonShakespeare2AD",
            "body": "Good\n\nFuck Elmo.",
            "score": 1,
            "replies": [
                {
                    "author": "Stanjoly2",
                    "body": "I feel like this unfairly besmirches the good name Elmo, of Sesame Street. \n\nI vote we start calling him Elmer, as in Elmer Fudd, whose temperament fits musk more, I think.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pbfarmr",
                            "body": "Jus call him Twitler",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MarlonShakespeare2AD",
                            "body": "How about El Fuck face?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nasorrty346tfrgser",
            "body": "Well I feel the same when he is responding to the employee mass firing \"I am entertained\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "MayorMoriarty",
            "body": "It’s Tesla. Are we sure all this stuff didn’t burst into flames on its own?",
            "score": 1,
            "replies": []
        },
        {
            "author": "fizzlemynizzle7194",
            "body": "Shoot hope the fire is ok!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Retaining-Wall",
            "body": "Oh... No.. that's uh.. that's the shits bro. Um.. I really uh.. can't stand this uh.. um... damn... what should I make for dinner tonight?",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Swan9189",
                    "body": "OK CANADA, did you say sorry even ONCE? ;)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thebawsofyou",
                    "body": "Poutine?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "brash_one",
            "body": "People are saying Tesla set the fires to obtain insurance funds.",
            "score": 1,
            "replies": [
                {
                    "author": "_Cistern",
                    "body": "Big if true",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Present-Perception77",
                    "body": "The best people. Everyone says they are the best in the world. No people have ever been better than the best people.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "squiddlebiddlez",
                    "body": "Interesting.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClimateAncient6647",
            "body": "Burn baby, burn!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baristasaint",
            "body": "Just seeing this photo put a big smile on my face",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotNewNotOld1",
            "body": "His own cars are committing sudoku.",
            "score": 1,
            "replies": [
                {
                    "author": "MetaVerseMetaVerse",
                    "body": "Seppuku",
                    "score": 1,
                    "replies": [
                        {
                            "author": "d_pyro",
                            "body": "Bless you.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "soyurfaking",
                            "body": "Gesundheit",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PastorNTraining",
            "body": " Oh no 💅🏽\n\nMy biggest concern is all those toxins floating into our air and drinking water.",
            "score": 1,
            "replies": [
                {
                    "author": "showme_yourdogs",
                    "body": "No worries, you won't notice it with all the raw sewage we're about to drink too.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WhenTheDevilCome",
                            "body": "Hopefully all the money laundering corporations are now able to perform will pay for it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hintofinsanity",
            "body": "Eh Arson seems a bit far fetched. These pieces of junk have a long history of setting themselves on fire.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1llseemyselfout",
            "body": "On no, anyway I think it’s time to move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Plane3938",
            "body": "It's not arson... It's a symbol of love. Signaling that our hearts are on fire for the American people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarkZuckerbergsPerm",
            "body": "Thats terrible! Is the fire ok?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScubaSteveEL",
            "body": "I'm not saying it's right. I'm saying I understand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "philiretical",
            "body": "Thoughts and prayers",
            "score": 1,
            "replies": []
        },
        {
            "author": "sane_sober61",
            "body": "Huh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Octaviano305",
            "body": "That's a shame",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jokonyew",
            "body": "Has anyone targeted trump towers? Man, this is crazy",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_Cummand_U",
            "body": "Good. Burn it all to the ground.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tiddlyplinks",
            "body": "Crazy to think just last year you could still find small package individuals rolling coal in Tesla charging spots. To “own teh leeebs”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rombledore",
            "body": "how did Melania put it?\n\n\"i don't care, do you?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "R1CHARDCRANIUM",
            "body": "Oh no. \n\nAnyways. \n\nDid you know your brain burns 500 calories a day? I don’t. My son just told me this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "necro316",
            "body": "Prayers and condolences",
            "score": 1,
            "replies": []
        },
        {
            "author": "Killerrrrrabbit",
            "body": "I wouldn't want to be near any Tesla stuff these days.  It's extremely dangerous.  It could go up in flames at any moment.",
            "score": 1,
            "replies": [
                {
                    "author": "Present-Perception77",
                    "body": "If I owned a Tesla right now I’d have it wrapped to look like a Chevy or something lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "j_calhoun",
                            "body": "https://cdn.bsky.app/img/feed_fullsize/plain/did:plc:uuavp4rcsg37gps4637jyrsh/bafkreial6rr3fw4rj2qz7ix6xgytcxmhhid5ciygjsuldapx4fw555qdsu@jpeg",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Present-Perception77",
                                    "body": "Omg! Those poor people. Genius though. I feel for them .. I once really wanted a Tesla. Very grateful now that I didn’t buy it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Killerrrrrabbit",
                            "body": "I sold my Tesla 2 weeks ago and got a Chevy Blazer EV.  The Blazer is so much better.  No regrets.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Present-Perception77",
                                    "body": "I used to want a Tesla when they were really expensive… bet there are some very good deals on them now… but I’d imagine that insurance companies are about to stop covering them. \nTo think that this is who now seems to control the US government… damn",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sczezniec",
            "body": "He shouldn't have deleted \"retardant\" from his phone's autocorrect dictionary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sedatedlife",
            "body": "where can i get a large print of this photo to decorate my wall.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NetJnkie",
            "body": "And hurts all other EV drivers as well since that's, by far, the largest and best charging network. Good job?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LunaLloveley",
            "body": "goodness",
            "score": 1,
            "replies": [
                {
                    "author": "Northerngal_420",
                    "body": "Truly",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nate2337",
            "body": "Guys! Don’t burn his cars on the lot - that’s the best thing that can happen to Tesla! Dealers love hail storms, fires, theft and vanadalism…it’s like making a sale because of insurance! \n\nBoycott & protest at the dealers, but let’s not power ourselves to MAGA levels of violence and property destruction.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RebelliousInNature",
                            "body": "Yes but if insurers deem them too hot to handle (chortle) then the risk drives Tesla’s costs up, or makes them uninsurable.\n\nIt’s something to brighten your day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Angry-Dragon-1331",
                    "body": "Doesn’t Tesla have to insure their own cars because other companies won’t touch them?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Few-Influence-398",
            "body": "I knew it would happen.\nIt was just a matter of time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AtTheEndOfMyTrope",
            "body": "They can’t sell them so maybe they’re setting fire to them to collect insurance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worried_Ad_3011",
            "body": "Arson?…\n\n*HERO!!! ✊🏼🔥🔥🔥🔥🔥🔥🔥🔥",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_Ruse_Elaborate",
            "body": "I don't support arson, but I will cheer every time this happens!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apprehensive-Wash809",
            "body": "You guys realize these locations are insured and just terrorize the employees, right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grouchy_Documentary",
            "body": "I wonder how Reddit and this subreddit is trying to curb extremist behavior among its followers",
            "score": 1,
            "replies": [
                {
                    "author": "PKanuck",
                    "body": "It's a false flag.\n\nNow the dealer can collect insurance on vehicles he can't sell.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "elammcknight",
            "body": "Are they sure it’s arson? Might just be spontaneous combustion. After all people storming the Capitol with weapons and acting violent was actually just a form of protest. Did they consider lighting as a possibility? Seems shaky at best to just assume this is arson.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drunk-snowmen",
            "body": "The F and the O part",
            "score": 1,
            "replies": []
        },
        {
            "author": "lefthandsuzukimthd",
            "body": "The damage of these fires will be covered by insurance.  Now if say random charging plugs were cut off at the end and needed frequent repair, they would have to cover the cost of the repair up to their deductible amount.",
            "score": 1,
            "replies": []
        },
        {
            "author": "just_chilling_too",
            "body": "Halt and catch fire",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutisticFingerBang",
            "body": "Oh fuck yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aegenium",
            "body": "Finally, some good news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lewicki",
            "body": "It's only a matter of time before someone flies a $500 drone into a $100MM starship launch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iloveopenbar",
            "body": "Smart money says the match was lit by one of those recently fired white conservative males.",
            "score": 1,
            "replies": []
        },
        {
            "author": "amginetoile",
            "body": "That’s a shame. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "djereezy",
            "body": "Wow…",
            "score": 1,
            "replies": []
        },
        {
            "author": "improvisedwisdom",
            "body": "\"Whoops\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "disidentadvisor",
            "body": "Guess those chargers failed to send in the five bullets summarizing what they did last week.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwaway1601900",
            "body": "Keep it coming!! Fuck Musk. Fuck MAGA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bordeburgu26",
            "body": "In other words, deranged democrats are vandalizing private property.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bordeburgu26",
            "body": "In other words, deranged democrats are vandalizing private property.",
            "score": 1,
            "replies": []
        },
        {
            "author": "agoraphobicsocialite",
            "body": "That’s us hurting eachother, not the government/billionaires.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Philosophy915",
            "body": "More",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChatGPTbeta",
            "body": "In may 2024. Didn’t he fire his staff in the super charger division ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LoveIntelligent5507",
            "body": "Finally",
            "score": 1,
            "replies": []
        },
        {
            "author": "snakelygiggles",
            "body": "Good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pervocracy",
            "body": "> Hours later in Massachusetts, seven Tesla charging stations were torched Monday at a shopping center in Littleton, about 43 miles from Boston, causing heavy fire-related damage to nearby cars.\n\n\nLocal reporting and photos of the fire don't say anything about damage to nearby cars. It was only the Tesla chargers themselves that burned.\n\n\nhttps://whdh.com/news/crews-respond-to-tesla-car-charger-fires-investigators-believe-fires-were-set-intentionally/",
            "score": 1,
            "replies": []
        },
        {
            "author": "jankyt",
            "body": "Maybe the car had a frontal impact and the batteries caught fire as they are one to do at times",
            "score": 1,
            "replies": []
        },
        {
            "author": "shupershticky",
            "body": "Called this about 3 weeks ago.   I thought it would be in the summer but Americans always make me proud",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilikefatchicks88",
            "body": "Tesla is still the superior EV.",
            "score": 1,
            "replies": []
        }
    ]
}