{
    "title": "Musk’s Oval Office Stunt Puts His Shadow Presidency in Plain Sight | Donald Trump cast in a supporting role as the Musk family visited the White House.",
    "author": "Murky-Site7468",
    "subreddit": "politics",
    "rank": 3,
    "score": 3569,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 203,
    "url": "https://www.thedailybeast.com/musks-oval-office-stunt-puts-his-shadow-presidency-in-plain-sight/",
    "id": "1inr7fs",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "coatofforearm",
            "body": "The kid was wiping his boogers on the resolute desk as a display of dominance",
            "score": 1,
            "replies": [
                {
                    "author": "Venturis_Ventis",
                    "body": "Which kid, the small one who's being used as a media prop by his fascistic dad or the large one sitting by the desk while the president speaks?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Automatic_Jelly1287",
                            "body": "One was taking a shit the other was wiping his boogers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MakinChampions",
                                    "body": "Descriptions still unclear, maybe we need proper nouns to identify who's who?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Zomunieo",
                                            "body": "Wasn’t there an executive order banning pronouns?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "AtomicWulf",
                                                    "body": "I needed this today 💕",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Werbnerp",
                                                            "body": "I think Trump and Elon are more \"Con\"nouns than \"Pro\"Nouns. \n\nThey are Con\"men\" after all.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "soullow13",
                            "body": "He’s not a prop, he’s a human shield.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zflanders",
                                    "body": "\"Today, son, you're going to have the honor of protecting my junk with your skull. Also, I might ruffle your hair in an awkward display of what most humans call 'affection.' So be prepared; I might pat you like  dog, but that's likely the worst thing that'll happen to you today.\"\n\nEdit: Holy crap, the kid is named X? Aka Lil X?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DirkysShinertits",
                                            "body": "I prefer to call him Lil' Musk.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Craneteam",
                            "body": "Media prop? The way that kid is always on fElon's shoulders, he's a meat shield",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Complete_Handle4288",
                            "body": "> Which kid, the small one who's being used as a ~~media prop~~ human shield by his fascistic dad or the large one sitting by the desk while the president speaks?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Sarrdonicus",
                            "body": "The kid is body armor so the reporters don't go all professional on them with questions. That, and Trump hates the \"Very high IQ\" kid, and will concentrate on all of his actions because that kid is richer than him and gets all the ratings. Ratings = IQ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DenturedServant1024",
                            "body": "You spelled “human shield” wrong",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Duster929",
                    "body": "I know this may be weird, and I can't quite put my finger on why I feel this way, but I feel like the presence of Musk's child was enormously significant, and not in a positive way. I feel like it deeply undermines Trump and his authority.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zoophagous",
                            "body": "The kid was clearly a prop. Musk used the entire scene to send an unmistakable signal that he is in charge.\n\nHe spoke to America from the Oval Office for 8 minutes. He was behind the Resolute Desk for his address.\n\nHis child was there to humanize him.\n\nTrump slumping, sitting there dutifully listening to his owner showed the world who is in charge.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chawizawd",
                                    "body": "He also uses the kid as a human shield, ever since the united CEO was killed he started taking him everywhere publicly",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "No_Car3453",
                                            "body": "That’s going to suck for that kid in any day now at this point.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "timetogetoutside100",
                                    "body": "yep, kid was a prop, and the content of what little I saw, was chilling, I had to stop watching , within 15 seconds, I  just can't",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Guilty_Camel_3775",
                                    "body": "America wants you to interview with the other children you have prying into our personal sensitive information. \n\n\nNo Elon this was NOT your moment w John John! \n\n\nAlso there is no transparency like you stated there was on your DOGE site.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "coatofforearm",
                            "body": "Trump clearly didn't want that kid there. There was no reason for that kid to be there at all other than Elon just letting the world know he can bring him wherever he wants including the most powerful office in the world\n\n\n\nOr....just hear me out... Child care has gotten so expensive due to inflation even the wealthiest man in the world can't afford it so he had no choice!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "hahalua808",
                                    "body": "I mean, Trump 1.0 brought all his kids in, too. So one from the new president this time should be ok.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "drfsrich",
                                            "body": "Senior Advisor to the President XAEwhateverthefuck",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DirkysShinertits",
                                            "body": "The desk still has the boogers from Don Jr.s time spent there and drool puddles from Eric.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "illiter-it",
                            "body": "Trump is just the kid's babysitter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Much-Seesaw8456",
                                    "body": "It’s great to see such open and transparent government. We are not accustomed to watching our president making decisions on camera everyday. It will be even more appreciable when families begin to see the debt decreasing from the progress of team DOGE.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "g0dxmode",
                            "body": "Feels weird and bad cuz its clearly the self imposed king trotting out his little prince, just testing the waters of tyranny with a cutesy lil positive PR spin is all",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "gradientz",
                            "body": "The presence of the child subverts the traditional power dynamics between the \"boss\" (i.e., Trump) and \"subordinate\" (i.e., Musk). \n\nChildren are seen as vulnerable, which makes it more difficult for Trump to maintain an authoritarian demeanor. Kinship also overrides workplace relationships, in the sense that Musk is \"in charge\" of his own son - so the child's presence is a living monument and reminder of the limits of Trump's authority.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MakinChampions",
                            "body": "Aside from the increasing presence of his kid after Mario's Brother showed up, I wonder if he also had some delusion of grandeur (shock) and wanted parallels to JFK and Jr's Oval Office photo.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "throwawaylol666666",
                    "body": "He also appeared to tell Trump to shush, too.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "coatofforearm",
                            "body": "Reminds me of that scene in Wedding Crashers where that kid tells Vince Vaughn's charactor to make him a bicycle out of balloons \n\n\" I said make me a bicycle clown!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Chemical_Ad_4430",
                            "body": "Gotta link to that?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Adept-Look9988",
                    "body": "Remember when Trump bragged Musk knows how to screw with the vote counting computers in Pennsylvania? What did he mean? Who did Musk buy with his millions? Wake up AG of Pennsylvania!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "theMediatrix",
                    "body": "What’s going on with that gold chain on the smaller kid? Is it a leash?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DblDwn56",
                    "body": "(INCORRECT) Forget the nose picking, what about him telling Trump to \"shut his mouth\"? Kids tend to parrot what they hear in their everyday lives.\n\nEdit: Looked at some sources and it seems the kid may have said this to a reporter. I really don't want to add to the propaganda.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheRealSnick",
                    "body": "He straight up told Trump he's not the president go away...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AngelSucked",
                    "body": "He also looked at Trump and said \"Shut your mouth.\"\n\nFor real, he really did.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Patereye",
                    "body": "Apparently, Musk's son also told DJT that he was not the president and he needed to go away during the interview.\n\nNot sure how much I believe but there is audio.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Donkletown",
            "body": "This is way at the bottom of the issues with that press conference, but I can’t recall seeing someone ever dressed like that standing in the oval. Certainly can’t recall anyone wearing a freaking baseball cap. ",
            "score": 1,
            "replies": [
                {
                    "author": "creepingphantom",
                    "body": "He likes to refer to himself as \"black hat maga\". You know, like black hat hackers...honestly fitting he knows what he is at least",
                    "score": 1,
                    "replies": [
                        {
                            "author": "prettyy_vacant",
                            "body": "That's funny because all the Qanon idiots are constantly raging against the \"black hat\" deep state pedo cabal democrats.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "creepingphantom",
                                    "body": "The call is coming from inside the house",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "asshat123",
                                            "body": "From *deep* inside the house",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IllegalThings",
                            "body": "Just to be clear since not everyone knows hacker culture…\n\n- White hat hackers are hackers that follow the law and do good things\n- Grey hat hackers are hackers that don’t follow the law and do good things\n- Black hat hackers are hackers that don’t follow the law and do bad things\n\nHis intentions aren’t to ignore the law to help people, his intentions are to help himself.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mrsphillipsmom",
                    "body": "that cosplay frock coat is meant to hide his pigeon chest and womanly hips, but it just looks like he is wearing a dress.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wrong_assumption",
                            "body": "Am I crazy or does it look designed by Hugo Boss?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mrsphillipsmom",
                                    "body": "omifuck!  it really does. it rings uniform, truly.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dave3879",
                    "body": "My dad and grandfather were from a generation where you NEVER wear a hat indoors. I still take mine off.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sjbennett85",
                            "body": "At home it is at the dinner table, at the legion it was off before you cross the threshold coming in.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gusterfell",
                    "body": "Anyone else remember when a tan suit was beyond the pale?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BleachedUnicornBHole",
                            "body": "Or when Kellyanne Conway had her feet tucked under her on one of the couches?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sleepyzane1",
                            "body": "you know exactly why that was different. and it had nothing to do with the word \"pale\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "skyblueerik",
                            "body": "Pale as grey poupon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NeverStopReeing",
                    "body": "Yitler wore one in there...\nhttps://www.newyorker.com/culture/annals-of-appearances/kanye-wests-white-house-monologue-flirted-with-the-language-of-the-mens-rights-movement",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DamonDot",
                    "body": "Kanye West",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mattotodd",
                    "body": "you haven't been paying attention\n\n[https://www.cnn.com/2018/10/11/politics/kanye-west-oval-office/index.html](https://www.cnn.com/2018/10/11/politics/kanye-west-oval-office/index.html)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Donkletown",
                            "body": "It is possible my brain blocked that out as a method of self-protection. ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "deadduncanidaho",
                                    "body": "the real event was less sane than the SNL spoof.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sidekicked",
                    "body": "Musk coming out looking like the director of a stage production while Trump waits for the curtain to rise so he can hit his next cue.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rwbeckman",
                    "body": "Lawrence O'Donnell doing a deep dive on hiw billionaires dress however they want. https://youtu.be/o7s0Kl8VvmU?si=bOSrPBlsgEWrIxeQ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Comprehensive_Main",
                    "body": "I think both bush 41 and 43 wore baseball caps. Both were former baseball players though. Bush 41 met babe Ruth. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "timetogetoutside100",
            "body": "that whole thing was disturbing, and sick, I couldn't watch it,",
            "score": 1,
            "replies": [
                {
                    "author": "epanek",
                    "body": "I had to turn it off. It felt surreal to witness how low we have gone.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NebulaCnidaria",
                            "body": "This was not a legitimate election. We're witnessing the death of the US in real time. I don't think there is any coming back from this.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PointB1ank",
                                    "body": "Wtf is wrong with this sub lately? You can't spend 4 years saying how dumb republicans are for claiming the election was stolen with no proof, just to then do the exact same thing when we lose. \n\nI genuinely can't tell if it's bots, astroturfing, hypocrites, or just people getting dumber. You're going to push people away from this party more than they already are if this keeps up. \n\nWe need to continue to believe that facts and reason will prevail above all. Baseless conspiracy theories is their playbook: be better.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Day_of_Demeter",
                                            "body": "I don't believe it was stolen, but the argument believes often use is that Trump has mentioned several times that Elon did some weird shit with the voting machines, and also those times Trump told his supporters they won't have to vote anymore after this election.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "timetogetoutside100",
                                                    "body": "it was stolen with X propaganda, and Fox News , those 2 certainly did their damage",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Podwitchers",
                            "body": "I can’t even watch it. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No_Car3453",
                            "body": "I’m Canadian. \n\nYou’re all complicit as far as I’m concerned. Not a single one of you is standing up to this in a meaningful way. I can’t even explain the level of disgust I feel looking at Americans. Half of you are cheering on Nazis and the other half are shit posting fucking jokes on the internet or bitching about how powerless you are. I’ve always known your revolutionary talk was all bullshit but I appreciate you all showing me every day exactly what fucking pathetic cowards you all are.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CallMeClaire0080",
                                    "body": "I do sympathize with the shock some Americans have because despite the fact that a lot of people saw this coming a hundred miles away, i assume that it's harder to spot when you're in the thick of it. To an extent, it's the bystander effect. The larger the crowd, the less of a response because everyone assumes that someone else will take the responsibility and risk so nobody does anything.\n\nWhat I find harder to sympathize with are obviously the fascistic right wing voters and people who didn't do their civic responsibility and vote at all. It's also deeply frustrating that even as a concentration camp is being built at Gitmo, a lot of liberals (not leftists, liberals) still have such faith in the word of law. They say that it'll all be fine and over in four years, as if millions of lives weren't getting shattered and that it's crystal fucking clear that Project 2025 is happening and that they're not giving up power again.\n\nPeople need to admit that if they don't organize and fight this, that it will only get further entrenched until like in the 1940s, other countries have to step in and bomb the fascists to hell with untold amounts of death and destruction. If you're not up for a fight fine then, flee or something, but stop telling people to calm down and to stop being alarmist while deliberately keeping your head in the sand.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Upset_Tomorrow1336",
                                    "body": "Dude, completely agree. Watching Americans accept this is just fucking embarrassing.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ArchdruidHalsin",
                    "body": "Totally unrelated for legal reasons, but here's [a catchy tune to cheer you up](https://open.spotify.com/track/4d2VQ8yt4bVVwMYeNZyV9b?si=_xmli5jhTOKaNwG6XkzF9A)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JessieJ577",
                    "body": "I can’t even watch full highlight clips it’s fucking disgusting. He’s clearly high off his mind and the fact that no one in the media is questioning it openly probably because Elon will go “woah guys I’m autistic I’m totally not geeked out Ketamine is good for you.”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cryptogirlworld",
            "body": "Imagine “voting against the deep state” and the deep state is now doing briefings in the Oval Office 😂\n\nThe jokes write themselves.",
            "score": 1,
            "replies": [
                {
                    "author": "RotundMarmot",
                    "body": "In their defence, it’s not really the deep state if they’re being completely transparent about the illegal activities they’re undertaking.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cryptogirlworld",
                            "body": "No, it’s still the deep state. They’ve just realized there’s no need to hide because people like you will defend them, even without being asked, while knowing they’re billionaires who don’t care about the middle class and control the government. Why hide in secret rooms when they can now do briefs in the Oval Office? \n\nThe “boogeymen” y’all have been talking about for years are now showing their faces. They’re still the deep state, no matter what.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RotundMarmot",
                                    "body": "I think you confused my comment - I’m on your side here buddy. These assholes should be nowhere near positions of power, openly or secretively.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mdthornb1",
            "body": "Usually trump boots people out when they start to take too much of the spotlight from him.  Wonder home much longer Elon has.",
            "score": 1,
            "replies": [
                {
                    "author": "BigDuckNergy",
                    "body": "Considering Trump has said the quiet part out loud already that \"Elon was a great help in the election\" and \"He really knows his (voting) machines,\" I would wager that Elon has enough on Trump that he can do whatever he wants.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "key1234567",
                            "body": "Enough on Trump? That's a good one lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GenShanx",
                                    "body": "Trump just going to Epstein him.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SharMarali",
                                            "body": "He’s gotta make sure it’s an official act so SCOTUS has him covered.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ricorgbldr",
                                            "body": "don't threaten me with a good time",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "xTiLkx",
                                            "body": "More like the other way around",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "drfsrich",
                                            "body": "Trump admires Putin.  Elon should stay away from any windows on higher floors.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "I_AM_NOT_A_WOMBAT",
                            "body": "I feel like that depends on what the consequences would be if it was revealed that Elon ratfucked the election. There's no precedent for this, SCOTUS is MAGA, and republican congress isn't about to suddenly find integrity. For all his performative hand-wringing yesterday, Josh Hawley isn't about to say \"well, I guess Harris won, let's get her in the oval office\". My guess is the 3 branches of government would say \"deal with it, he's been sworn in.\"\n\n\nTrump and his people likely know this, so another possibility is that his dementia is getting to a point where they're Feinsteining him for appearances and to appease MAGA that their king is still around, but Elon is the one calling the shots. Vance would be a similar puppet if trump had a medical issue that they couldn't hide anymore. \n\n\nThe sad thing is that even if the election was rigged, it should not have been anywhere near close enough to be rigged. Nothing is going to change in this country until that changes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ApoplecticAutoBody",
                    "body": "He's not going away. Trump is compromised. Elon has something on trump. Either the election or something even worse",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EliteEinhorn",
                            "body": "That's what I'm thinking, it has to be something huge. He's committed fraud and raw dogged porn stars while married and he got away with it - whatever can be held over his head at this point is huge.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SkunkMonkey420",
                                    "body": "imagine this reality where Trump is actually just a dumbass who keeps falling into honeypot traps and continues to perpetually get used to further evil peoples agenda.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "semper_ortus",
                            "body": "You might find [this thread](https://www.reddit.com/r/politics/s/TAqHsMar51) interesting.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Xivvx",
                            "body": "Musk controls twitter. He could sink Trump in a second.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OnceInABlueMoon",
                    "body": "This will be the telltale sign. If we know Trump at all, he should start publicly beefing with Musk within 24 hours. If not, then we know he's Musk's lapdog.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "a_moniker",
                            "body": "Trump has always been a sycophant for those he deems to be “powerful” though. Look how long he sucked up to Putin. He’s also sucked up to a ton of other dictators like Xi and Kim Jong Un. \n\nNarcissist’s don’t necessarily have to believe they are above *everyone*, just that they are above the vast majority of people. Often, they actually thrive in hierarchical social structures, and can become near sycophantic to those they deem “superior” to themselves.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "clickmagnet",
                    "body": "He crumpled like a paper cup when Putin was in the room, and I’m sure he still would. Someday we’ll have a press conference with all three of them in the room, and Trump is going to hide under his blankie. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "a_moniker",
                            "body": "Yeah, Trump is a classic narcissist. Yes, he clearly belittle’s those he sees as below himself, but he also acts sycophantic and desperate around those believes are his superior. \n\nContrary to popular belief, people with Narcissistic Personality Disorder can be some of the biggest kiss asses in the world. They will shower those they value as better than them with excessive praise and flattery, and idealize their actions in order to justify their supposed superiority.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IdkAbtAllThat",
                    "body": "Musk owns Trump the way Putin does. He's not going anywhere. He likely helped steal the election. Trump will *never* turn on him, just as he will never turn on Putin. I guarantee it.\n\nIt's very easy to see when Trump is subservient to someone.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "skyblueerik",
                    "body": "Wonder what Elon has on Trump.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BleachedUnicornBHole",
                    "body": "We’ll see if/when Kash Patel gets confirmed. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Xivvx",
                    "body": "Trump is clearly subservient to Musk, it was clearly communicated by how little respect Musk showed for Trump and the office in general.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "larsonsofia",
            "body": "Musk running the government like a startup, and Trump just a customer support bot saying, \\`Great job!'",
            "score": 1,
            "replies": []
        },
        {
            "author": "newtoallofthis2",
            "body": "Never been clearer that Musk owns Trump completely.\n\nHis ego would never put up with this from anyone who didn't.\n\nAlso irony of Musk ranting about democracy, when no one elected him and he's making decisions based on no transparency and with clear conflicts just waved away. The Guardian absolutely nailed this:\n\n*\"Asked about possible conflicts of interest as a result of Musk gutting agencies that either are investigating his companies for regulatory noncompliance or that have contracts with his companies, such as the defense department, Musk suggested there were none.*\n\n*“First of all, I’m not the one filing the contract. It’s the people at SpaceX or something,” said Musk, the founder, chief executive, chief engineer and chair of SpaceX.\"*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ell0bo",
            "body": "I just wonder when he'll start telling Reek to be quiet",
            "score": 1,
            "replies": [
                {
                    "author": "rooktakesqueen",
                    "body": "After all, it rhymes with meek",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "InternationalBug7568",
            "body": "After all, he did buy the country, and trump made 'the most beatiful deal'",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShinyMeansFancy",
            "body": "Putin is laughing his ass off",
            "score": 1,
            "replies": []
        },
        {
            "author": "cpas2b",
            "body": "Notice how the cuckold sits while the dominant, standing male attracts all of the attention. The standing male even parades his offspring in front of the beta to reinforce his dominance.",
            "score": 1,
            "replies": [
                {
                    "author": "newtoallofthis2",
                    "body": "Musk prob dating the first lady too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LookInTheMirrorPryk",
            "body": "Trump is completely beholden to Musk since he stole the election for him. Musk is executing his own and his group's neo-reactionary techno-monarchy 'Dark Enlightenment' agenda with no oversight and at a strategically planned rapid pace to overwhelm the system.\n\n\n\n[For a look into Musk's real motivations](https://bylinetimes.com/2025/02/07/silicon-valley-whistleblowers-warn-elon-musk-hijacking-republicans-to-control-entire-us-government/)\n\n\n Meanwhile the Heritage foundation and others are executing their far right white Christian nationalist agenda through Trump's EOs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "radarthreat",
            "body": "Is Elon not able to afford a nanny?",
            "score": 1,
            "replies": [
                {
                    "author": "Thisisntmyaccount24",
                    "body": "Your kid can’t be used as a tool to attempt to humanize you to the American people if they’re with the nanny.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Craneteam",
                            "body": "Meat shield. He's constantly protecting the back of elon's head",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "vagabondvisions",
                    "body": "But how will little K3vLåR learn what Daddy does if he doesn’t act as his human shield?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Desperate-Natural110",
                    "body": "Why would Elon leave Little Kevlar at home?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ZombifiedSoul",
                    "body": "He's been bringing his kid everywhere since that other CEO was shot in public.\n\nThe poor kid is a meat shield.\n\nI wonder how the mother feels about this.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PaintByLetters",
                            "body": "Probably not great considering her little meat shield is worth a few billion if Musk dies.  She's probably more worried about the money than the kid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ZombifiedSoul",
                                    "body": "Oof. \n\nI'd hope it would be otherwise, but she did choose to be with Elon, so... Likely.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "newtoallofthis2",
                    "body": "He doesn't need one! He can do full-time  childcare on top of Tweeting endlessly, playing online games to a v high level, running Twitter, running Tesla, running SpaceX, Interfering with German politics, Interfering with UK politics, running Starling and gutting the US govt. \n\n/s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "EpictetanusThrow",
                    "body": "“Family”\n\nI’m sure the mother wants her child back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "subUrbanMire",
            "body": "Trump doesn't even like his *own* kids...🤣",
            "score": 1,
            "replies": [
                {
                    "author": "loohoo01",
                    "body": "That’s fair because neither do I",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mycartel",
            "body": "At least Steve Bannon is pulling his hair out",
            "score": 1,
            "replies": []
        },
        {
            "author": "VWbuggg",
            "body": "Trump is such a scared, dominated little boy, first by Putin then Musk. It’s ironic that the self described U.S. alpha males with lifted trucks and assault rifles and punisher decals worship such a sad little scared boy with his daily makeup, hairspray, spanks, diaper and noodle arms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vagabondvisions",
            "body": "The Resolute Desk now features a cuck chair.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deJuice_sc",
            "body": "The chain of command was always obvious for people who understand how Trump perceives the correlation of money and power.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ambercrush",
            "body": "Headline should read \"Musk, who hacked voting machines for trump, shamelessly reveals his payoff as shadow president\".",
            "score": 1,
            "replies": [
                {
                    "author": "4Ciid",
                    "body": "Add in “with his Kevlar Vest Child.”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "try2try",
            "body": "Take off your stupid fucking baseball cap in the oval office,  jackass",
            "score": 1,
            "replies": []
        },
        {
            "author": "ludixst",
            "body": "It's kind of poetic that this fucking boomer handed over everything to a grifter African with a computer.",
            "score": 1,
            "replies": [
                {
                    "author": "MetastaticCarcinoma",
                    "body": "highest tier of this scam model.  incredible.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "teddytwelvetoes",
            "body": "been very strange watching virtually all of our media outlets go out of their way to mention/show Musk’s kid despite Musk being a famously terrible/absent father. do we really need to give this ghoul free PR while he’s bricking the country for sport?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panoramixx77",
            "body": "A nazi paid his way to the oval desk, what could go wrong?",
            "score": 1,
            "replies": []
        },
        {
            "author": "inagious",
            "body": "This visual representation was damning, why is anyone else answering questions from behind the desk?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Every_Stranger5534",
            "body": "Donald was such a good boy during President Musk's press conference in the Oval Office. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Worldly_Cobbler_1087",
            "body": "It's a real life Wormtongue and Theoden",
            "score": 1,
            "replies": [
                {
                    "author": "necesitafresita",
                    "body": "Theoden had honor, Trump...is bad even without the influence of someone.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PaintByLetters",
                    "body": "That's not fair.  Trump's never had a raw tomato in his life.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "whooo_me",
            "body": "Do Musk's lips move when Trump talks?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NerdySongwriter",
            "body": "Is this the deep-state-shadow-government the conservatives were warning us about?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmbergrisArmageddon",
            "body": "Let’s start calling these policies, plans, and actions what they are: ANTI-constitutional. They don’t care about the constitution. They want to destroy it. Unconstitutional makes it sound like it’s a mistake. But it’s deliberate. I’m a linguist, words are power",
            "score": 1,
            "replies": []
        },
        {
            "author": "clickmagnet",
            "body": "“Musk insisted Tuesday that he personally won’t be the one filing for the contracts for his companies, and that DOGE is “trying to be as transparent as possible.”\n\nOh, well then, nothing to worry about. I had assumed Musk personally prepares every contract bid, right after his 8 to 5 glueing body panels crooked at the Tesla factory. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleepyzane1",
            "body": "why are you all allowing this? this is like a scene out of the original robocop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "illuminerdi",
            "body": "Remember all those complaints about the \"deep state\" and the \"shadow government\" and \"unelected officials\" and blah blah blah?\n\nPepperidge Farm remembers...",
            "score": 1,
            "replies": []
        },
        {
            "author": "SectorBudget406",
            "body": "That entire event will make it difficult to beat the President Musk allegations.\n\nMusk was standing there in the oval office, his version of confident, camera focused on him, and the majority of questions were towards him.\n\nMeanwhile Trump is sitting, suggesting subservience, raspy and boring with his responses, not the focus of attention or questions, and overall came off as a clear second fiddle.\n\nVisually, physically, and audibly Musk was clearly the alpha in the room compared to Trump and there's no debate.\n\nI wouldn't be surprised if Trump watches it back and sees how weak it made him look.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiseryEngine",
            "body": "Trump sitting in the Cuck chair watching Elon fuck his wife (America!)",
            "score": 1,
            "replies": []
        },
        {
            "author": "SOMEONENEW1999",
            "body": "When do they move in??.  Is there room for 64 children and ten wives??.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SimTheWorld",
            "body": "Neither Musk nor Congress holds the “purse strings”, the people do! US is already in debt and they need YOUR taxes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "codacoda74",
            "body": "Musk press conference allowed two babies to attend, one with boogies and the other with his little rubber stamp",
            "score": 1,
            "replies": []
        },
        {
            "author": "epanek",
            "body": "Like any relationship the idea of the USA requires us all to buy into it. If half the country doesn’t it’s fatal. Just like when your spouse doesn’t believe in your marriage.  It’s over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redredbloodwine",
            "body": "Trump is passive because Musk knows how he won the election.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Threeandtwoand",
            "body": "Big fish eat little fish. Trump is going to be smeared under a tall bus tire by the time his 4 yr stint expires by the bigger fish.",
            "score": 1,
            "replies": []
        },
        {
            "author": "haiku2572",
            "body": "A telling image indeed of a diminished, subservient Trump all too suggestive of Musk holding significant leverage over Trump—far more than his $250 million contribution to Trump’s campaign – mere chump change to Musk.\n\nI suspect that the REAL power Musk holds over Trump that keeps him in his diminished, secondary role to Musk, silently enduring his subordination stems from something far darker: that Musk - w/the help of his gang of hacker thieves - having had unauthorized access to voting machines prior to the 2024 election manipulated them to ensure Trump’s alleged “win”.\n\nJust my speculation – but one shared by many others – particularly those within the field of statistics, data science, forensic data analysis, as well as others currently investigating the legitimacy of the 2024 election results.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dmillerksu",
            "body": "Unelected official complains about other unelected officials abusing authority by claiming he is abusing his authority",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontPanic_ahhh",
            "body": "WTF is Musk doing with his hands, it's very weird",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "This submission source is likely to have a soft paywall. If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\". [More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "WardenEdgewise",
            "body": "King Musk and his orange-face clown court jester.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zombieblackbird",
            "body": "Once a puppet, always a puppet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Octavia9",
            "body": "President Hindenburg Trump",
            "score": 1,
            "replies": []
        },
        {
            "author": "RDKryten",
            "body": "When will Joe Rogan start referring to Trump as a Beta?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cutenoodle",
            "body": "I am starting to wonder if Trump is being held hostage lol “Blink if you need help!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "wranglero2",
            "body": "The kid needed a nap 💤 wonder why musk hauls that child around with him. Yes trump looked very awkward,he kept looking at him. But didn’t know how to interact with him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dbeman",
            "body": "How are the folks at “r” conservative spinning this one?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaycaprio",
            "body": " I think he’s trying to look like a JFK in White House to bring his boy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iriegypsy",
            "body": "Puppet president confirmed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theforceisfemale",
            "body": "Musk must have some deep shit on him, to get Trump to hand over the spotlight.",
            "score": 1,
            "replies": [
                {
                    "author": "semper_ortus",
                    "body": "You might find [this thread](https://www.reddit.com/r/politics/s/TAqHsMar51) interesting.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StopLookListenNow",
            "body": "First as Putin's puppet, now as fElon's felon or Musk's mouse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CurrentlyLucid",
            "body": "trump is a prop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fractal1382",
            "body": "Richest person on earth can’t afford childcare? Wtf is he doing there with his kid? Meetings like these have lots of topics not suitable for children. Does he want to talk about people getting blown up in front of a toddler?",
            "score": 1,
            "replies": []
        },
        {
            "author": "nordender",
            "body": "You know had president musk put some music on Donny could have entertained himself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hughdint1",
            "body": "He was checking up on his WFH employee.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SimplicityGardner",
            "body": "I only needed to watch a few moments of the press conference, t said something to the child, who apparently is named x?  It was clear that t wasn’t in charge anymore.  It’s a shame that my country has lost its professionalism.  I am hoping that it can be restored quickly.  All the emotional support truck drivers and maga merchandise wearing folks have been brainwashed.  It’s a shame they are so fragile and weak that they think any of these Rs think about passing policies that support them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jertheman43",
            "body": "Strong leadership my ass",
            "score": 1,
            "replies": []
        },
        {
            "author": "phinatolisar",
            "body": "He has his kid on his shoulders to show he doesn't really take this seriously.  He's spitting in the face of every American.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hawkwise83",
            "body": "People shouldn't just be asking why Musk is there.\n\nThey should also be asking why Trump is 100% ok with it and why their massive egos haven't clashed.",
            "score": 1,
            "replies": [
                {
                    "author": "obsertaries",
                    "body": "Trump looks up to actual rich people and craves their approval.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fredDAF",
            "body": "It is sad that our democracy died, not in a blaze of vicious fighting, but because trolls handed it over to own the other team. Pathetic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "That-Management",
            "body": "President Musk and his personal secretary",
            "score": 1,
            "replies": []
        },
        {
            "author": "horrified-expression",
            "body": "I guess I see things differently. Musk looks like a fall guy to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yngwiegiles",
            "body": "Dems desperately hoping for a rift between 2 egos but trying so hard that now Don is outwitting them by being an old grandpa w a stinky diaper and fine just sitting in it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katkost1",
            "body": "WTAF is that guy high on?  And do not say his power trip.  He’s trippin on something",
            "score": 1,
            "replies": []
        },
        {
            "author": "obsertaries",
            "body": "Did Rasputin ever stand next to Nicholas II like this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "smaugofbeads",
            "body": "He looked a lot like Theoden from Rohan be for his spell was lifted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "filthychuck",
            "body": "Do you remember when Obama wore a tan suit and the world was going end because of it… this goof wears a ball cap and a t-shirt and brings a snot nosed kid to the Oval Office and people are fine with it….cool I get it America seems like a fun place these days",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZavvyBoy",
            "body": "That's the presidential cuck chair",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alib668",
            "body": "I think this is the start of the end for elon.\n\nTrump hates to look like a “bitch” boy. If this press continues it will kill the elon problem.\n\nSee dominic Cummings vs boris johnson. Everyone had a narrative of him trying to run the country, bojo was forced into a its me or him and ultimately bojo had the power so chose himself. Trump will do the same, its when trump himself is threatened trump will put musk in the woodchipper",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueCap01",
            "body": "His ketamine fueled rants are going to become more unhinged. This is not the last time something like this happens",
            "score": 1,
            "replies": []
        },
        {
            "author": "fricken",
            "body": "Trump is functionally king now, he can tell anybody to go fuck themselves. What leverage could Elon possibly have over him at this point?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thresh_Keller",
            "body": "Isn't that fat nerd in the black outfit the same guy that does the nazi salute on television? \n\nWhat's he doing in the white house? \n\nIs he the president now or is it still the orange painted game show host? \n\nWhy do eggs cost more than a half a tank of gas? I thought they were going to lower the price of groceries on day one?\n\nIt seem like the price of everything has gone up in the last 30 days. \n\nI am starting to think we were lied to by this guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrbigglessworth",
            "body": "I only caught bits and pieces\n\n\nDid president Musk say that he was going to bankrupt the US????",
            "score": 1,
            "replies": []
        },
        {
            "author": "Much-Seesaw8456",
            "body": "It’s great to see such open and transparent government. We are not use to seeing our president making decisions on camera everyday. It will be even greater when families can begin to see the debt decreasing from  team DOGE’s efforts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeatriceHamad198436",
            "body": "Elizabeth better stop protesting otherwise you will be jail,for putting on evil heart. Let Elon musk family visit the white house in peace, course we want development",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeatriceHamad198436",
            "body": "There is nothing that can STOp the development. So therefore let all protesting stop immediately. Declared by Oghene Judge",
            "score": 1,
            "replies": []
        }
    ]
}