{
    "title": "Donald Trump's Pledge to Lower Costs on 'Day One' is Unravelling",
    "author": "granny_ew",
    "subreddit": "politics",
    "rank": 39,
    "score": 208,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.newsweek.com/us-inflation-rate-january-federal-reserve-trump-2029916",
    "id": "1inugro",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\nAs a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban. \n\nIf you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators.  If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jrsinhbca",
            "body": "If a plan doesn't exist, it can't unravel.",
            "score": 1,
            "replies": [
                {
                    "author": "ImmoKnight",
                    "body": "He had concepts of a plan.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "That_90s_Kid_",
                            "body": "It was project 2025. He couldn't say what the plan was as it was detrimental to the votes.\n\nYou don't sign that many executive orders on day one with the \"concepts\" of a plan.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Taint_Liquor",
                            "body": "So his mind is unraveling?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ImmoKnight",
                                    "body": "Not much there to begin with... \n\nIt's probably just an image of himself telling himself that he is the bestest and greatest.\n\nMaybe sometimes a mouse running in a wheel and himself humming while jerking of two people.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BaronGrackle",
                    "body": "4D Chess = Knocking the pieces off the table",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jtmj121",
                    "body": "Im still waiting for Mexico to pay for the wall.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImmoKnight",
            "body": "Yea... sane people REALLY believed him when he promised this.",
            "score": 1,
            "replies": [
                {
                    "author": "Wonderful_Honey_1726",
                    "body": "I hate that moderate uninformed voters completely fell for it and helped to vote him in. If people actually researched anything that he explicitly said he was going to do it was all inflationary. All he has to do is just say he will do something and these people believe it even his proposed policies say otherwise. They honestly think there is some kind of magic wand he can wave and have no interest in learning how these things actually work and why it’s been such a process to bring down inflation and avoid a recession. It was just easier to blame Biden and therefore Harris. \n\nI don’t even think I’ve heard of any attempts on bringing down prices, he’s too busy worrying about plastic straws and harassing our neighbors with tariffs. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sleeplessinreno",
                            "body": "It pretty much goes like this, \"Everything you like is good. Everything you don't like is bad. I will get rid of the bad things and make sure the good things get better. Trust me bro, no need to look behind the curtain.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wonderful_Honey_1726",
                                    "body": "Yep. I mean I know this inflation report isn’t solely Trump since he’s only been in office less than a month but since he blames Biden for everything before (and will after) I’m fine pinning it on him since he promised he would lower prices immediately. Just wait until the effects of the tariffs and removing immigrant labor fully take effect. Thankfully the Fed is ignoring Trump’s repeated requests to lower interest rates or else inflation would get even worse. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sleeplessinreno",
                                            "body": "I don't know why, but I think March will be a big blow up point.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Dearic75",
                                    "body": "And I hated it but I kind of understood the first time around.  Trump promised everything to everyone, so people just substituted in their preferred positions for his.  Cause you could find support for whatever you wanted depending on which trump statement you looked up. \n\nBut the second time around, you really should have remembered it was all bullshit to get elected. Hard to imagine someone disconnected enough that they didn’t notice.   But then there were news stories of how “did Biden drop out of the presidential race?” Was one of the top search questions in Google on November 5. \n\nSuddenly they’re no longer talking about “No taxes on tips” either.  Funny how that is.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dearic75",
                    "body": "I’m sure he’ll get around to it in two weeks.  Kind of like passing the “no taxes on tips” thing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "overbarking",
            "body": "Con man makes promises he never intends to keep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaMarr-Bruister",
            "body": "It was nothing beyond a talking point",
            "score": 1,
            "replies": [
                {
                    "author": "ResidentKelpien",
                    "body": "It  was a talking point that corporate media disingenuously pushed like it was a solid plan.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FastBalance2142",
                            "body": "People didn’t believe it. \n\nThey just didn’t want to acknowledge why they were voting for him",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ResidentKelpien",
                                    "body": "Right.\n\nHowever, we can certainly acknowledge why those flaming racists and bigots voted for the orange geezer.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Duane_",
            "body": "Unravelling? Bitch, we are THREADLESS.",
            "score": 1,
            "replies": []
        },
        {
            "author": "henryfarts",
            "body": "Lower egg prices?\n\nBest I can do is rename the Gulf of Mexico",
            "score": 1,
            "replies": []
        },
        {
            "author": "VoluptuousGinger",
            "body": "What plan? At best, it was the concept of a plan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoadandHardtail",
            "body": "In his defense, it was just a concept of a plan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldfrancis",
            "body": "He lied",
            "score": 1,
            "replies": []
        },
        {
            "author": "greyhoundbrain",
            "body": "When did he even unveil this plan? Like he just shouted words about groceries and people who feared pronouns and women voted for him. The boujee free range eggs are now cheaper or the same price as the cruelty eggs so there’s that.\n\nIf we had to have had an out of touch rich GOP person in charge for the next four years, I wish it would have been Romney instead of him because at least Romney wouldn’t be trying to actively destroy the country right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TintedApostle",
            "body": "It can unravel because he never started.  It was never a thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asahi_Hero",
            "body": "So much winning eh MAGA?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Designer-Contract852",
            "body": "He won't even lower prices on day 100 and will be actively making it worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StickAForkInMee",
            "body": "He never had a plan. Not even a concept of a plan. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ancient-Highlight112",
            "body": "He never meant it anyway.  Are you that naive?",
            "score": 1,
            "replies": []
        },
        {
            "author": "T1442",
            "body": "It fully unraveled at the end of day one.   Newsweak is weeks late.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BasicAppointment9063",
            "body": "For years, the conservative media ecosystem has pushed the intentions behind democratic policy as, \"*The secret plan to destroy America.*\" It has been annoying, in that it has been so effective with the Republican base.\n\nThe opposition to this administration need to take a page out of this book and talk about what they clearly *intend* to do, and the likely results, rather than what they say that they will do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shot-Needleworker175",
            "body": "Unraveling? We are looong past that",
            "score": 1,
            "replies": []
        },
        {
            "author": "fermat9990",
            "body": "Shocking!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hinanska0211",
            "body": "Didn't we all know that was a line of BS? Even the people who voted for him must have known it was never going to happen.",
            "score": 1,
            "replies": [
                {
                    "author": "gearstars",
                    "body": "> Even the people who voted for him must have known it was never going to happen.\n\nYou'd be surprised....",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Grimm2020",
                    "body": "Just got back from the grocery store this morning. A lady in the dairy aisle was mumbling out loud to whoever was nearby, \"Trump said he'd lower prices...and I'm not seeing it!\". It was loud enough for anyone who happened to be in that aisle could hear her...which was her intent, I'm sure. She sounded *pissed...*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ClaroStar",
            "body": "Trumpflation",
            "score": 1,
            "replies": []
        },
        {
            "author": "icameheretobserve",
            "body": "You want to look like Mother Russia? This is how you look like Mother Russia!",
            "score": 1,
            "replies": []
        },
        {
            "author": "sundropdance",
            "body": "So what's everybody's guess on who or what Trump will blame this on?",
            "score": 1,
            "replies": []
        },
        {
            "author": "annaleigh13",
            "body": "Pretty sure any concept of a plan unraveled on day 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlamingMuffi",
            "body": "It unraveled day 2 when prices weren't magically lowered",
            "score": 1,
            "replies": []
        },
        {
            "author": "politik_mod_suck",
            "body": "It never raveled",
            "score": 1,
            "replies": []
        },
        {
            "author": "mgraydpt",
            "body": "Unraveling? It flat-out didn’t happen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wet_Techie",
            "body": "Trunp has NEVER followed through on a promise to help anyone but himself. Why would this be different?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mbazid",
            "body": "OMG! Im shocked!",
            "score": 1,
            "replies": []
        },
        {
            "author": "JDogg126",
            "body": "Inflation is up higher than expected.  Tariffs are going to raise prices further.  And Trump is yelling for interest rates to be lowered which will only further increase prices.  This timeline is underscoring exactly why the president of the united states needs to have powers neutered.",
            "score": 1,
            "replies": []
        }
    ]
}