{
    "title": "I'm sure a lot of us can relate lol",
    "author": "Toxic_Squash",
    "subreddit": "KitchenConfidential",
    "rank": 2,
    "score": 2872,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 191,
    "url": "https://i.redd.it/kcivb92lpdpe1.jpeg",
    "id": "1jdxcr4",
    "selftext": "",
    "comments": [
        {
            "author": "AngstyIndie406",
            "body": "We’re really all just living the same lives huh?",
            "score": 994,
            "replies": [
                {
                    "author": "KlearColler",
                    "body": "Yes, chef",
                    "score": 350,
                    "replies": []
                },
                {
                    "author": "Toxic_Squash",
                    "body": "It really hits home eh?",
                    "score": 162,
                    "replies": [
                        {
                            "author": "GSturges",
                            "body": "\"This is Sous chef Jeremy...\"",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "reso1dsc",
                                    "body": "That fucker walked out. Bent over backwards for Jeremy, just for him to fall off on heroin. Again...ugh.\n\nYou fucking suck for this Jeremy...but i still hope you make it through. Good luck, old friend.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Purlofur",
                                            "body": "My chef is named jeremy this tripped me out a sec",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "fading_relevancy",
                                            "body": "That's Darma for ya.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "AnnasthesiaSuicide",
                                    "body": "![gif](giphy|jruizMIoc1g1cmaNxQ|downsized)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Straight_Ad3307",
                                            "body": "Who among us hasn’t wanted to serve that dish",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "bbt104",
                                            "body": "That's dark my man... accurate, but dark",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Bender_2024",
                            "body": "Holy shit man.  I got out of the industry about 10 years ago but a lot of those really were me.  I'm feeling awfully exposed for 7:30 in the morning dude.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "FHAT_BRANDHO",
                                    "body": "I got out in october and took around an 8 dollar pay cut and its hard to be motivated for less money 😭",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bike_rtw",
                                    "body": "I thank Buddha every day that I wasn't a better cook because I could very easily have gotten trapped.  I really liked it at the time, really wanted to be one of the badasses but was terrible thank god LMAO.  When they got desperate and threw me on grill it was an absolute shit show, I'd be surprised if 1 out of 10 steaks were properly temped.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DreadPirateZoidberg",
                            "body": "I escaped the life about 15 years ago and this really hit hard. I tell people I stopped cooking when I learned to love myself.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bleezzzy",
                    "body": "Hey, I drink coffee or tequila, not energy drinks!",
                    "score": 13,
                    "replies": [
                        {
                            "author": "mokujin42",
                            "body": "Coffee is an energy drink!",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Existing-Fly-283",
                                    "body": "Vodka raspberry",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IONTOP",
                    "body": "OP forgot something to go along with \"Knows the restaurant is failing\"\n\n\"Chef will accommodate my requested days off\"",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Cool-Mission-6585",
                            "body": "Chef will accommodate my “requested” days off.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "IONTOP",
                                    "body": "I got comped 3 nights at the local casino in April for the NCAA Championship game/start of baseball/before the Masters(M/T/W)...  Chef might stay with me... lol\n\nAnd I'm FOH...",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "523bucketsofducks",
                                            "body": "You can just say you're fucking the chef, the whole restaurant already knows",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sevbenup",
                    "body": "No fucking way dude. I bet we have different burn marks on our arms",
                    "score": 6,
                    "replies": [
                        {
                            "author": "murseoftheyear",
                            "body": "Uh yeah. Where else are you supposed to put out a cigarette?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SexandCinnamonbuns",
                    "body": "Heard",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "vote_you_shits",
            "body": "You have marketable skills. You can make rapid decisions in a high stress environment. You can communicate clearly in a high stress environment. You can mise en place. Yes it's applicable to more than just cooking. You can handle stress like a fucking champ. You have experience working in a highly regulated environment and enforcing those regulations. You can work on a project with a group and you have likely passed skills on to a new hire. You can create a standardized process and then perfect it over time.\n\nDon't sell yourself short and don't ever feel trapped.",
            "score": 724,
            "replies": [
                {
                    "author": "cdmurray88",
                    "body": "A few more, depending on your job responsibilities: inventory management, waste reduction, improvisation, personnel management.\n\nEvery career has its negatives, but I transitioned into healthcare and the skill set as a venn diagram is nearly a circle.\n\nETA: planning, prioritizing, and executing a constantly updating task list",
                    "score": 76,
                    "replies": [
                        {
                            "author": "LAkand1",
                            "body": "What do you do in healthcare if I may ask?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cdmurray88",
                                    "body": "I started out as an optometric technician (the person you see before the optometrist) on a whim. My state doesn't require any certifications for that particular level. I also did some patient service coordinator work (scheduling, verifying insurance).\n\nThen I started taking classes at community college transitioned to physical therapy aide. I start a PT program in August to become a licensed PT.\n\nGranted the level of education I am pursuing has some barriers to entry, there are many healthcare positions that need no prior experience, or need an associates degree and pay pretty well.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LAkand1",
                                            "body": "Might look into health care. Burnt out after 20+ years in the industry. Thanks!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Cookie_Salamanca",
                                                    "body": "Gotaa have a good backgroundp for healthcare. Many of us that feel stuck in the kitchens have made past mistakes and have records thay are also a barrier.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NoseyMinotaur69",
                    "body": "Ooh saving this, gonna change it up and edit my resume",
                    "score": 80,
                    "replies": [
                        {
                            "author": "Cocotte123321",
                            "body": "100%",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mysterious-Range-210",
                    "body": "I think more industry cats need to hear this. Line cooks to chefs. The environment beats us down to believe we could never be anything different, and it's on purpose to create a labor force that will stay despite the conditions and pay. We deserve better and have skills most people won't be able to develop. High stress environments breed ingenuity and creativity. Lots of love for this mindset.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "ketamine_denier",
                    "body": "I totally agree with your sentiment here but…are you a navy recruiter?",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Mysterious-Range-210",
                            "body": "Oh I'm recruiting but it ain't for the navy. Bring your plumbing tools. 🥴",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WHHHAAARRRGRARBL",
                    "body": "Exactly this, you'd be amazed how applicable the skills you develop in a kitchen are to other careers.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Cookie_Salamanca",
                            "body": "What are some examples?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "snydley_",
                                    "body": "could be argued that mise en place is just 5S (warehouse/manufacturing/logistics)",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Kelsenellenelvial",
                                    "body": "Inventory and waste management, sense of urgency, coordinating between departments or internal and external stakeholders, development of work processes, on-boarding/training new staff, time and resource management, maintenance and operation of specialized equipment.  If you’ve had supervisory/management experience you can add on things like managing staff and schedules, forecasting business needs, computer/office skills, etc..",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "BannedMyName",
                                    "body": "I work in a cannabis greenhouse/indoor cultivation and half of our staff are ex-kitchen, they're usually the hardest workers.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "WHHHAAARRRGRARBL",
                                    "body": "Read the comment I responded to.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Primordiox",
                                    "body": "For me, nothing gets me stressed at work now because emails piling up is a lot more manageable than the string of tickets endlessly printing, with no room on the ticket line so you just stick it on the end and let it print and hope it never reaches the floor during the busiest night of the year",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kelsenellenelvial",
                    "body": "100%. Those are also the skills that tend to be harder to teach so if one does leave the industry you’ll pick up the new skills quickly.  The work ethic of long term cooks is also seldom matched in other industries, even those claiming to be “fast paced” so you can take it easy and still be running circles around your co-workers.  Other industries have fewer/more flexible deadlines and non-perishable products, or at least much longer shelf lives than fresh meat and produce.\n\nMade the switch from cooking to electrical after 20 years.  Going back to entry level pay sucks, but 3-4 years in I’ll be making what I used to as a Sous for drastically less responsibility and better working conditions.  Sometimes you gotta do something shitty like dig a trench or crawl through an attic, but day to day is way easier and lower stress than the kitchen ever was.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Alixtria_Starlove",
                    "body": "That would be awesome if any of the literal children I work with or ancient f****** curmudgeons could do any of those things \n\nI do my best to bring order to chaos and the people around me are sitting there juggling Hot Cheetos and doing tiktoks",
                    "score": 27,
                    "replies": [
                        {
                            "author": "sixty-nine420",
                            "body": "Lol put it on the resume anyway.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "MethodicalButcher",
                            "body": "And the drool narrowly avoids their phone screens.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_BarroomHero",
                    "body": "How do you convince some HR shitdick that if you didn't already do the exact job you're applying to for double their \"required\" amount of time, you can in fact do the job because you have a valuable, practical skillset?  So far I'm 0 for hundreds.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "AppropriateAd7326",
                    "body": "But most important: Don’t trap yourself in the victim role.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "NotAnFed",
                    "body": "Write that down WRITE THAT DOWN",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "pizzalarry",
                    "body": "you can do cocaine mid work day and it's only kind of noticeable instead of extremely",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ChefMoToronto",
                    "body": "Yeah but there's only one job that really appreciates all those skills.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lawlolawl144",
                    "body": "Yeah you're right man but how does one spin this into a job in another field/higher up the chain of command?\n\nI was a line cook and am now a nurse (RPN) for 8 years. God time flies.\n\nI think about leaving bedside and trying to find a better paying, or lower liability job, but even with wildly marketable skills like you've written down, it feels like these days my only avenue for growth in the job sector is additional schooling.\n\nIt's tough out there.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "immersemeinnature",
                    "body": "This is great!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hot-Cat6061",
                    "body": "This!!! Before I became a nurse I applied for an internship. They asked me how my still in a restaurant could translate to nursing. YOU HAVE SKILLS THAT TRANSLATE TO TONS OF JOBS. Time management, ability multitask, prioritization, teamwork, ability to work long hours on your feet, managing stressful situation efficiently, etc I could literally go on all day on transferable skills. Needless to stay my interviewers were impressed. It’s all about how you market yourself.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mr_bendos_friendo",
                    "body": "Doesn't have the emotional intelligence...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MadGeller",
                    "body": "Exactly! Thank you. It is something I saw in our part of the world when covid shut restaurants down. Cooks found other work and never returned because their new employer was so happy to have a great new employee. Cooks have so many soft skills that every other industry wants. They can teach you the job, but you come equipped with everything u/vote_you_shits mentioned. Bet on yourself. You have tremendous value.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fanciestpony",
                    "body": "This! You have to sell yourself to recruiters, but they love to be sold!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fullyrachel",
                    "body": "Absolutely yes, but if we're talking stereotypes here, chef really needs to work on his anger problems and substance use before he can leave the industry. We carve out MUCH more space for these things than most fields.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LAkand1",
                    "body": "Which careers  do you think are those good for?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sciencegeniusgirl",
                    "body": "I can’t stress this enough. I hung up my apron and coat 7 years ago and got myself back into school. Got a graduate degree in social work and parlayed all my skills from kitchens into selling myself for the job I have now. Surprisingly, you can turn yourself into a fantastic substance use counselor when you spent 15 years working around functional (and sometimes not functional) addicts. There’s nothing a client is going to tell me that I haven’t already seen. My 15 years of work in kitchens gave me the ability to meet with and talk to pretty much anyone. On a relatability level, my clients really appreciate that I’m not just someone who studied some books and are now dictating how they should live. Kitchens gave me a plethora of street smarts and an insight into worlds some of my fellow graduates have never been exposed to. I landed my current job by selling those skills of having worked with substance users, the unhoused, undocumented immigrants, refugees, and the formerly incarcerated and really understanding what their day to day life is actually like. I landed my current job by talking all that up, despite being a recent graduate with no official experience in the field. I make almost twice as much as I did (even as an executive chef) but now with only a 40 hour week, benefits, holidays, weekends, vacations, and health insurance. The work is mentally taxing for sure and has its own set of systemic issues. But I’m much more comfortable and financially stable in my life now than I ever was in kitchens. \n\nI will say though, there is still a ton of foolery that occurs that many don’t expect from a “professional” environment. Co-workers still be fucking and it be hella dramatic.  Apparently that’s just an inescapable part of the human condition. Lmao.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BudgetThat2096",
            "body": "Clopens are the devil",
            "score": 101,
            "replies": [
                {
                    "author": "Any-Practice-991",
                    "body": "The trick to not getting them is to be really shitty at doing the one you don't like.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "Assassinite9",
                            "body": "I tried this with closing....and it got me \"since you need the practice, you get to close every shift\".",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Any-Practice-991",
                                    "body": "I admit it's not a 100% success rate...",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SweetGummiLaLa",
                            "body": "This is the way.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Any-Practice-991",
                                    "body": "I try to pull everyone forward to a better future.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NoGovAndy",
                    "body": "Germany has a lot of stupid laws, but the fact that you CANNOT have your employee work 2 shifts that are less than 11 hours apart is a godsend. And they take it very seriously, too. Can even become a criminal case if the employer repeats it.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Raisey-",
                            "body": "Same in the UK",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BudgetThat2096",
                            "body": "Yeah I refuse to do them now. They're a sign of shit managers. I've had them ask me to come in at 7am after getting off at 12. Said no thanks, I'm going to go home, eat dinner, and sleep for 8 hours after working 10 for you.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Comrade_pirx",
                    "body": "Who the fuck closed last night?! ... oh wait.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The32th",
            "body": "Stop drinking! It gets better and you have money sometimes. ",
            "score": 127,
            "replies": [
                {
                    "author": "Toxic_Squash",
                    "body": "Woah let's not do anything out of hand here..",
                    "score": 130,
                    "replies": [
                        {
                            "author": "TenaciousZBridedog",
                            "body": "How is *anyone* out here rawdogging life?!",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "Swashcuckler",
                                    "body": "With great difficulty",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "The32th",
                                    "body": "It does suck, but it sucks less now. ",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "maaaaawp",
                                    "body": "Gotta have at least 3 addictions at once.\n\nAlcohol, nicotine, caffeine",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Impressive-Donut9596",
                                    "body": "Clarity of mind is actually better than drinking. You’ve just forgotten.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "401kcrypto",
                            "body": "Yea. A bit much. Stop drinking? Sure. I’ll just dive head first into the fryer.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Existing-Fly-283",
                    "body": "Sober chef here. 👋🤟",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Sad-Island2185",
                            "body": "7 days here. I will not use today",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lukulele90",
                    "body": "Put down liquor bottle got dick stuck in bag of weed. Instructions unclear.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "st_st__",
                    "body": "Alot more money, everything else in the meme stays, but more money",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "2000-2009",
                    "body": "I like drinking and dislike my life too much to stop.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SignificantCarry1647",
            "body": "Sometimes you have to just walk away, you’ll be back, but the break will do you some good",
            "score": 34,
            "replies": []
        },
        {
            "author": "koolandunusual",
            "body": "Quit drinking and summarize your skills for your next CV/Resume to get out of the industry:\n\nGood at team work\n\nWorks well under pressure\n\nGood communication\n\nExcellent cleaning \n\nEfficient time management skills\n\nSelf starter \n\nAlso just throwing it out there: A resume is not a legal document, and may contain fictitious elements.\n\nMake sure you have saved enough cash to stay afloat between jobs.",
            "score": 31,
            "replies": [
                {
                    "author": "Aezon22",
                    "body": "> Make sure you have saved enough cash to stay afloat between jobs.\n\nBro I had $22.32 in my bank account and that was before I bought shots",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sanquinity",
            "body": "Ones I've experienced:\n\n\\-Lives off of smokes and energy drinks.\n\n\\-Short staff on Friday night. (multiple times.)\n\n\\-No real social life. (Not necessarily because of work though.)\n\n\\-Prep cooks didn't do shit.\n\n\\-Spends time off drinking. (I'm cutting back now, but it was bad for a few months...)\n\n\\-Wants to date a waitress. (She luckily  gently turned me down.)\n\n\\-Too busy to eat.\n\n\\-Burn marks on arms.\n\n\\-Can you come in on your day off.\n\n\n\nAt least I didn't lose my love for cooking so far? \\^\\^;;",
            "score": 38,
            "replies": [
                {
                    "author": "stcGrim",
                    "body": "I cook with hate",
                    "score": 17,
                    "replies": [
                        {
                            "author": "aviarywisdom",
                            "body": "Put a fish covered in hot sauce in the dish and walk out",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lukulele90",
                    "body": "Well, not with that attitude.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "CasperSac",
                    "body": "5 years and you never closed and open the next day or been asked to come on your day off? Happened to me probably first month on the job lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sanquinity",
                            "body": "Oh wait, I did get called in on days off before yea. But I only ever work evening shift.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "stcGrim",
                            "body": "This guy's a phony\n\nEdit. I was fucking around relax. I thought line cooks were in here.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Sanquinity",
                                    "body": "Oh yea sure. Because I live in a different country with better worker rights and treatment, not all of them apply to me, and I still have my love for cooking, I must be a phony...\n\nNot everyone has the same experience as a cook as Americans, you know.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "stcGrim",
                                            "body": "I was just fucking around bro you are great and amazing. We talk shit to eachother. I still love cooking too. For real though we can be best friends. I tell mine to fuck himself multiple times a night if we work together.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sanquinity",
                                                    "body": "Ah, apologies then. Intent/tone can be very hard to convey over text. :)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "stcGrim",
                                                            "body": "All good boss. We lash out at fairness from jealousy not hate. The dead pan sarcasm gets me through sometimes",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mrvlad_throwaway",
                    "body": "work relationships never work bro so you prolly dodged a bullet there",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Somnifor",
                            "body": "The trick is you date the people you use to work with. Not the ones you currently work with.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "trunkspop",
            "body": "every single one of these hits home cept change “wants to date a waitress” to “is dating a manager with no drama bc nobody knows” \n\n&\n\nspends time off drinking **and** gaming*",
            "score": 23,
            "replies": [
                {
                    "author": "Top_Boat8081",
                    "body": "Oh buddy, you *really* need to be careful dating your managers. Whether there's drama for you or not, it's almost always a bad idea, especially when it's a secret.\n\nAsk yourself what will or could happen if all of a sudden everyone in the joint knew. Nothing happens? Maybe not good. Something happens? *Definitely* bad",
                    "score": 12,
                    "replies": [
                        {
                            "author": "trunkspop",
                            "body": "she at a different location but yea i gen never dip my pen in company ink",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Top_Boat8081",
                                    "body": "okay okay I gotcha, that is fair honestly. Ive seen SO many people start canoodling with managers in the same location and its almost always a dumpster fire regardless of the situation lmao you know what i mean",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "trunkspop",
                                            "body": "100% know what you mean. 99.9/100 possible outcomes are terrible. but yea i temp at multiple locations randomly when theres events or its short staffed so theres not really a power dynamic at play bc i have a “home branch” and all of those locations kiss my ass for driving out there / keeping them out the weeds lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stcGrim",
                    "body": "I'm married to a waitress at my job so yeah",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ebaer2",
                    "body": "And jorking*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thefoxygrandma",
            "body": "It just takes one good chef or one self determined cook to say, \"I do love this industry, time to determine my ass into it and become a real chef\"\n\nChef life shouldn't be this stressful, it's the restaurants we work in that make it so.",
            "score": 9,
            "replies": [
                {
                    "author": "trunkspop",
                    "body": "this is basically where im at now. what would you recommend the next step be if you cant afford classes or equipment",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NesPickler",
                    "body": "Yeah you just have to full send it. There's ways to rediscover your passion for cooking.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kempff",
            "body": "You forgot 43% child support.",
            "score": 21,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 22,
            "replies": [
                {
                    "author": "Toxic_Squash",
                    "body": "Its a harsh reality for a lot of people in kitchens unfortunately. It feels amazing when you end up at a spot that you really jive with though.",
                    "score": 28,
                    "replies": []
                }
            ]
        },
        {
            "author": "phish_sucks",
            "body": "Frig off",
            "score": 7,
            "replies": []
        },
        {
            "author": "heyyouyouguy",
            "body": "I get to repost this tomorrow. Fuck it's already tomorrow.",
            "score": 22,
            "replies": [
                {
                    "author": "Toxic_Squash",
                    "body": "Its always tomorrow for us man haha",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "emueller5251",
            "body": "The clopening and the come in on your day off lines are what explain the wants to go back to school, sees no future for self lines.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_darling_clementine",
            "body": "i love him",
            "score": 3,
            "replies": []
        },
        {
            "author": "EmploymentApart1641",
            "body": "I feel attacked",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rsalamander24",
            "body": "Feel attacked:(",
            "score": 3,
            "replies": []
        },
        {
            "author": "back-in-the-highlife",
            "body": "I can’t tell you how accurate this is",
            "score": 3,
            "replies": []
        },
        {
            "author": "bmy89",
            "body": "Of course I'm reading this at 2am when I open tomorrow. All these ring true except the dating a waitress. Just celebrated 16 years with my husband yesterday.",
            "score": 3,
            "replies": [
                {
                    "author": "Toxic_Squash",
                    "body": "Congratulations!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SweetGummiLaLa",
            "body": "You forgot “has done a small amount of jail”",
            "score": 3,
            "replies": [
                {
                    "author": "Mikaela24",
                    "body": "The amount of exconvicts I've worked with 😂\n\nThought not for nothing, I'm glad there's an industry that doesn't discriminate against them. Everyone that's looking for one deserves a second chance",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Top_Boat8081",
            "body": "\"Prep cooks didn't do shit\"\n\nGOD FUCKING-\n\nI'm fine. It's fine. I'll do it. I got it. It's fine. IT'S FINE. dontlookmeintheeyeITSFINE",
            "score": 3,
            "replies": []
        },
        {
            "author": "Equivalent-Fan-1362",
            "body": "😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "86Apathy",
            "body": "Uh oh",
            "score": 2,
            "replies": []
        },
        {
            "author": "murrdaturtle",
            "body": "This hurts",
            "score": 2,
            "replies": []
        },
        {
            "author": "spandexvalet",
            "body": "Yeah that’s about right",
            "score": 2,
            "replies": []
        },
        {
            "author": "Caprice42",
            "body": "I just want my skin back.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tolan91",
            "body": "I've been unemployed near five months now, but I can't go back. I can't do it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Oshwaflz",
            "body": "ope, i guess its that time of the day! time to repost the line cook doomer meme",
            "score": 2,
            "replies": []
        },
        {
            "author": "GearDarkness",
            "body": "End of the day, it's a job. Not a lifestyle. Not a mindset. \n\nIt's a wonderful rewarding job sometimes, it makes my brain go brrr when we are stupid busy. I get into the zone, I feel purpose in it. It's what I will probably be doing my entire career honestly and I've excepted that.\n\nBut it's a job at the end of the day. If you feel like you are trapped in it, find a new career. \n\nActual blue collar work is so desperate for people right now, they will take anyone with \"no skills\" and train you. I promise if u have survived the stress of kitchens you can survive a construction site. Fuck factory work though\n\nIt's a job, we do our jobs for like 60% of our life, at least try to get something back out of it, not just financial",
            "score": 2,
            "replies": []
        },
        {
            "author": "Silly-Junket3308",
            "body": "This was me until I pulled my head out of my ass, stoped drinking, and got motivated.  You can do anything you set your mind to, including escaping the industry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any_Brother7772",
            "body": "Man, veing a cook in the us soubds like hell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alixtria_Starlove",
            "body": "After getting a culinary degree it is my experience that the average chef is addicted to at least one and a half substances \n\nOften more \n\nBut yeah all of this checks out \n\nOh but you forgot: minimum wage no tips",
            "score": 3,
            "replies": [
                {
                    "author": "bmy89",
                    "body": "Fuck minimum wage. I wouldn't stand still doing nothing for minimum wage.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Alixtria_Starlove",
                            "body": "Yeah I get paid minimum wage with a 2 year culinary degree in the same qualifications as my managers \n\nI work in fast food because I have applied to literally everything within 10 miles of me but nobody wants to f****** train anybody \n\nI don't have experience they tell me as they look at the piece of paper that says I spent the last 2 years in a culinary school I.E. a place where I spent two years waking up at 5:00 a.m. to work a 9:00 to 5:00 in a restaurant except I was paying thousands of dollars to work in a restaurant without getting paid \n\nThere's a reason that I have \"secondary\" employment...\n\nI would literally make more money in a day of selling my holes then I would in a week of basic kitchen work for some faceless f****** mega Corp \n\n2 hours of work versus 40 and I get paid more for it",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bmy89",
                                    "body": "Holy cow that's insane. I'm making over 20 as a line/prep cook. Keep applying!!! Where are you located?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mikaela24",
                    "body": "I will never forget the day I walked into my kitchen and one of my fellow cooks just blatantly asked me right in front of the sous chef if I wanted to buy shrooms.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Alixtria_Starlove",
                            "body": "Jesus!\n\nIn other news I got a last-minute interview at my favorite sushi place \n\nIf this goes well I could be going from b******* customer service at a f****** Wendy's to my favorite restaurant! \n\nI'd be a prep cook and I'd hate it but I am going to take so much pride in working my way up \n\nEspecially cuz I treat a kitchen like it's the f****** military and I like everything to be spic and span and organized and a lot of my bosses appreciate that",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mikaela24",
                                    "body": "Wishing you all the luck!!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Iatemydoggo",
            "body": "Insert “I’m in this photo and I don’t like it” meme\n\nSeriously though last Saturday at my joint we had 3 dudes on line (normally 5) and preps didn’t do shit. We were 86’ing shit that normally goes with every meal and servers were snatching each others food because they were too lazy to read their fucking tickets, while simultaneously leaving stuff in windows for ages before asking us to remake it. If it wasn’t for a dangerous dose of caffeine I’d slammed right as I clocked in I probably would’ve passed out lol",
            "score": 2,
            "replies": [
                {
                    "author": "trunkspop",
                    "body": "it blows my mind how many fking coworkers in every spot ive worked at dont bother reading literally anything lol … like how tf did you make it this far by just assuming, and predominantly incorrectly assuming at that",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Iatemydoggo",
                            "body": "I was running pantry/cold side (salad bitch) and one of our salads has a whole bunch of stuff on top of the dressing so you can’t even tell if it has dressing or not. Anyways, if I was a server and I saw three of them in the window, I’d check the ticket before just assuming they were all the same lol. That night was a headache, even worse than Valentine’s Day",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "trunkspop",
                                    "body": "yeah at that point its either apathy, ineptitude, or both lol",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "prettylittlepastry",
            "body": "Well this is just rude",
            "score": 1,
            "replies": []
        },
        {
            "author": "adamsmithapples",
            "body": "I feel so alone at work honestly. Everyone I ever befriended have quit and have seem to move on without me. It’s just me and the assholes that just stuck since day one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nick3790",
            "body": "Damn, I got really burnt out near the end of last year and have been sleeping at my parents house, I feel kinda ashamed, but I was not ok, and reading this, I remembered why. You got this guy's, but also if you ever have the chance and you're feeling this way, get out",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baddogdown91",
            "body": "This is the person who punched me in the face on Saturday...",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBilby7",
            "body": "Been there , done that, got out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheEndOfAllThings23",
            "body": "It's not for everyone but my 20+ years on the line prepared me wonderfully for education. Their is not a screaming child or behavior that I can't handle with patience, calm and level headedness. I work Elementary level, and it's the most fun I've had at work really ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Burgenstein",
            "body": "Hey hey hey whats wrong with any of theses?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Herpinheim",
            "body": "Bruh you looking into my past like a Christmas ghost or something smh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Noahms456",
            "body": "This was me 2006 to 2010",
            "score": 1,
            "replies": []
        },
        {
            "author": "weGloomy",
            "body": "If you made it gender neutral this would be me, minus the being a guy part, and wanting to date waitresses part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Itonlymatters2us",
            "body": "![gif](giphy|OtBgrMheb5m2A)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hatface87",
            "body": "I briefly worked at a high volume call center/bank, and my numbers were higher than everyone’s and wondered how I could keep up with so much. Just kinda shrugged. Job and people sucked but it was nice to know I was capable of other things. Our skills are transferable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_missfoster_",
            "body": "Lost love cooking or lost love for cooking? I see both as viable options.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blergargh",
            "body": "Idk how applicable this is anymore considering the past few weeks but at age 26 the federal govt would give you waaaaay more money on your student aid. Getting out/obtaining new skills is possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sh1ft33",
            "body": "Man, except for the waitress dating, this is my entire life, holy shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bnelson7694",
            "body": "This was me in my 20’s at my family’s restaurant. I got the hell out finally.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet-Ad9366",
            "body": "I was a line cook for 8 months. Never worked in a kitchen in my life. Now I'm at another kitchen job that is SWEET AS FUCK (not a restaurant). I work hard, show up on time, have excellent people skills and don't smoke/do drugs. \n\nI got out of prison a little over a year ago after 12 years and don't know how I'm doing better than a lot of people in this sub. Weird as hell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Admirable_Leg_478",
            "body": "No smokes, drinks, or monster but pretty close with everything else.\n\nAlso going back to school and seems like it'll end up being a waste of time and money.  Beware.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient-World-332",
            "body": "I feel attacked",
            "score": 1,
            "replies": []
        },
        {
            "author": "jalabar",
            "body": "Me but I'm guy. More like I wanna get with that hot waiter/male bartender but theyre straight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "immersemeinnature",
            "body": "Bro needs a hug",
            "score": 1,
            "replies": []
        },
        {
            "author": "wesleyhroth",
            "body": "So accurate, except it was always coffee instead of every drinks, but same shit. After 11 years I moved back to my home state and took a job as an electricians apprentice, that was 8 months ago. Change is scary but every day is a new opportunity and you only have one life, at some point you gotta make the change if it's really what you want",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArizonaGreenIcedTea",
            "body": "The burn marks on arm speaks to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vitvang",
            "body": "HEY NOW COME ON",
            "score": 1,
            "replies": []
        },
        {
            "author": "El-Mooo",
            "body": "Get out my dudes.\n\nCool if you early 20s 30s but the human body/soul was not built for long term line cooking.\n\nDo a part time course/apprenticeship/whatever.\n\nCrash with the folks to save money. \n\nGet assessed for ADHD/ADD (almost all cooks I've ever known meet the criteria)\n\nWorking a  9-5 job atm, and I don't wake up dreading existence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "77gus77",
            "body": "That was me, then decided to give college a try at 45, and now I'm about to start my first semester of nursing school. There's always an exit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rochesters-1stWife",
            "body": "Burn marks and busting my knuckles on the dishwasher edge",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhettoDharma",
            "body": "This was me till my my mid 30s, moved out to the Midwest and got a factory job, I've never been happier. Now I cook for the family and occasional potluck. Get out while you can it's not worth it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "that_random_rat",
            "body": "Bro I do culinary at VoTech and my interest in cooking plummeted 💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "FearFritters",
            "body": "Anyone else have line cooks lose it and turn on all the burners saying \"i'm gonna burn this place to the ground\" and then walk out? Just me?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BasilProfessional744",
            "body": "I’ve never felt so seen",
            "score": 1,
            "replies": []
        },
        {
            "author": "AggravatingChair8788",
            "body": "Where did you find this detailed picture of me?? Are you the feds?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lyvidian",
            "body": "I've been in the food industry for about 4.5 years, having switched over from IT because I needed a break from that while studying for certs. Enjoyed cooking so much, decided to stay in it, and leave the IT world. Ended up dating the cook that trained me at my first place, and now we're going on 5 years with a 3-year-old. I still love cooking, and so does my boyfriend (despite being in the industry since 16 and creeping up on 40). All that said, I find these stereotypes hilarious, and I've seen so much of it in just the 4.5 years I've been in the industry. 😆",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darkatlas23",
            "body": "So one time a 10 top walked in five minutes before closing and the bar tenders came back and told me to expect an order soon and I told her I won't make it, the other cook on shift agreed with me. DONT COME IN FIVE MINUTES BEFORE THE KITCHEN CLOSES, THATS JUST RUDE!\n\n![gif](giphy|5zqEZKCiua4LmOWDZZ|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "bachrodi",
            "body": "Always true",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToxyFlog",
            "body": "Huh. I should go back to school 😂💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "czarface404",
            "body": "I feel personally attacked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quote__Unquote",
            "body": "Pfft, highly inaccurate in my case (I switched from cigs to zyns 😂)",
            "score": 1,
            "replies": []
        },
        {
            "author": "EugeneV3ATX",
            "body": "I taught myself web development and spent 20 yrs at tech companies. Now I'm a restaurant owner 😁",
            "score": 1,
            "replies": []
        },
        {
            "author": "bartman2326",
            "body": "Tapped out and finally went back to school (for HVAC) and it's going great so far in my first non-restaurant job. You can make it, bros.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReallyNowFellas",
            "body": "(Stumbled in from r/all) wow so literally the only thing that has changed since the 90s is mountain dew became energy drinks. I did 9 years. One of VERY few stern pieces of advice I've ever given to my son is \"never work in a restaurant.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "L_O_Quince",
            "body": "He doesn't want the Darma? So does he want the Adharma? He wants Chaos vs. Order? Sounds about right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Profession-6007",
            "body": "😂 lived all of this. Well besides \"see no future for self.\" When I cooked I was always naive thinking that I would someday be an executive chef or own a restaurant... teenage/ early 20's dreams ya know? \n\nAlways wanted to go back to school and luckily getting laid off during Covid allowed me to do so.  Used the absurd amount of unemployment to pay for the first year of school. I am one quarter away from graduating with a B.S. in pure and applied maths.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theseekingseaker",
            "body": "Just join the military.....",
            "score": 0,
            "replies": []
        }
    ]
}