{
    "title": "Then there’s this guy",
    "author": "acreaturevoidofform_",
    "subreddit": "KitchenConfidential",
    "rank": 0,
    "score": 3795,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 101,
    "url": "https://i.redd.it/4noj4tgeufpe1.jpeg",
    "id": "1je3asn",
    "selftext": "",
    "comments": [
        {
            "author": "sideshowbvo",
            "body": "Ah fuck, I didn't feel anything about the last one, but this...shit. I definitely don't check all those boxes, but it hits a little too close to home",
            "score": 1,
            "replies": [
                {
                    "author": "henrydaiv",
                    "body": "Yes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sykadelic_angel",
            "body": "Workers together strong",
            "score": 1,
            "replies": []
        },
        {
            "author": "lucashoal",
            "body": "Based ⚒️",
            "score": 1,
            "replies": []
        },
        {
            "author": "LKennedy45",
            "body": "What does downwardly mobile America mean? ",
            "score": 1,
            "replies": [
                {
                    "author": "beckyjoooo",
                    "body": "That can't nobody get ahead in this country..",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IntrepidGnomad",
                            "body": "What about the last line on the bottom right?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "2ndmost",
                                    "body": "United we bargain, divided we beg",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CharlotteLucasOP",
                                            "body": "OH I thought mis en place!\n\n✊🏻 Solidarity with collective action for workers’ rights!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "mandyvigilante",
                                                    "body": "There's power in a factory,\n\n\npower in the land, \n\n\npower in the hands of the worker",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "aspect-of-the-badger",
                                    "body": "He doesn't realize that he's making a great case for a union.  I mean there really isn't a reason not to unionize.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jeexbit",
                                            "body": "> I mean there really isn't a reason not to unionize.\n\nbut what about the loss of profits to corporations?!\n\n/s",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "foxontherox",
                                                    "body": "Think of the ShArEhOlDeRs!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "IAm5toned",
                                                            "body": ">Think of the ~~ShArEhOlDeRs~~ executive bonuses & compensation packages!\n\n\nlets not kid ourselves.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "foxontherox",
                                                                    "body": "When you right, you right.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "chefa36",
                                            "body": "Until you work in a union kitchen. I have and absolutely hated it. Not being able to light my pilots for example drove me absolutely insane. I'm not anti union they absolutely have their place but a kitchen is not one of them.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "aspect-of-the-badger",
                                                    "body": "Must really suck to be able to tell your boss that's someone else's job.  Bet you really hated the higher pay and benefits too!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "1980Phils",
                                            "body": "Good chance the restaurant goes out of business as a result. Seems like a reason.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "graaaaaaaam",
                                                    "body": "If all restaurant workers are unionized then owners can't run a business without bargaining. Hence the \"united we bargain, divided we beg\".",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "imforsurenotadog",
                                                    "body": "It will break the current business model, yes. But there are many countries where service workers are all unionized, and somehow restaurants haven't gone extinct.\n\nDon't believe the anti-union propaganda.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "aspect-of-the-badger",
                                                            "body": "But what will those poor restaurant owners do if they can't exploit their workers?",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Equivalent-Fan-1362",
                                                            "body": "Really depends on if you’re working corporate or a small mom and pop. Idk if a union would even organize a small ass place like my old job we had like 9 employees lol but for the majority of bigger restaurants I could see it. I make a few bucks over minimum wage so I’m not rolling in the dough so whatever gives me more money by golly I’ll do it lmao union dues are a thing too tho no?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Business-Drag52",
                                                                    "body": "A union will gladly represent 9 people. Dues are nominal compared to what you get in return. I worked a union job for a while. Dues worked out to about 18 cents per hour worked. As soon as we voted to join the union and join their contract, we got a $1.75 raise and a bunch of vacation and sick time we didn't have before. We'll worth that 18 cents",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TaurineDippy",
                                                                            "body": "The problem arises when uneducated people get hired into a union that has already accomplished these things and they only see the money coming out of their check, leading them to believe the union is only taking and not giving, which is rarely if ever true. I’ve seen it happen time and time again, especially in this industry.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "l3ninsw3ak3sts0ldier",
                                                                                    "body": "that's why our unions have anti-capitalist political education as part of our weekly meetings. Political education and deprogramming the pussywhipped nature of workers under capitalism is a very effective bullwark against lickspittle ignorance.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TaurineDippy",
                                                                                            "body": "This is great. Some people won’t want to learn, but those who do deserve to be empowered by the education.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "l3ninsw3ak3sts0ldier",
                                                                                                    "body": "the people who won't want to learn wake up when they realize they're fucking with our paycheck. in fact every. single. shop. we've unionized has filed a slew of ULPs (unfair labor practices) with the NLRB. this shows that the situation is worse than just stealing the excess value of our labor, they're not even following the established rules. had a bartender who was very anti union, right up until the union found out the company was fuckign with everyone's tips",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "l3ninsw3ak3sts0ldier",
                                                                    "body": "we just unionized a small shop. actually a small shop is less likely to just shutter the doors. any place that is ripping you off for your labor value needs a union.\n\nThe mom and pop capitalist pays for the production resources, but they do not pay for the value added by labor. Workers at a coffee shop are not paid for every cup they brew. Workers are instead paid for our time, we are paid by the hour. And it is the hourly wage that misdirects our attention as workers, making us ignorant of the theft taking place. \n\nImagine a barista who works at an independent coffee shop and gets paid $17 an hour — about $500 a week after taxes. How many hours would it take for the worker to make and sell $500 worth of coffee? Subtracting production resources is simple. When a capitalist rents a storefront, buys the equipment, and orders the unprepared ingredients, they can predict how long it will take for them to use up those resources before they have to buy more. Therefore, we can come up with an average amount that the capitalist is spending per hour, per worker, on production resources and see where the rest of the money goes.\n\nIf this coffee shop spends, hypothetically, 217 dollars an hour on production resources and sells 250 dollars worth of coffee per hour, we know that the worker is adding a value of 33 dollars to the coffee sold every hour. That means that after 15 hours and 9 minutes, less than two shifts, the barista will have made enough money for the company to cover their entire week’s paycheck. So, after working for 15 hours and 9 minutes and adding $500 worth of value, does the worker get to take off their apron and go home? No. The worker will continue to work, and every additional dollar they make for every additional hour they work will go directly to the capitalist. That’s 24 hours, 51 minutes at a value of 797 dollars! But once their check is covered, the worker is now working for free. This unpaid labor time is the actual source of the capitalist’s “profits”. \n\nWe see now that capitalists are not industrious hard workers, brilliant innovators, or job creators — they are thieves, pure and simple. The capitalist regime derives its incredible, awe-inspiring wealth by stealing from you. This is why the capitalist regime is constantly spreading disinformation about the way our economy works. They can't have an honest conversation about our economy — or our politics — or even the nature of their \"mom and pop business — without exposing their guilt.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Equivalent-Fan-1362",
                                                                    "body": "I’m so confused on why my comment is downvoted lmfao I was just asking questions 💀💀",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "NojTamal",
                                                    "body": "LOL no. If they can't keep the lights on with a unionized staff, they have no business being open in the first place. Hope that boot tastes real nice!",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Flussschlauch",
                                                    "body": "Why?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NounAdjectiveXXXX",
                                                            "body": "Because wealthy would rather entrench themselves than allow even a single poor working for them have just a little bit of cake.\n\nLook at what Redzepi did when he was told he wasn't allowed to abuse cheap/free labor any more.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "l3ninsw3ak3sts0ldier",
                                                    "body": "we just unionized a shop and they closed right after. the company have all types of paperwork showing they were going to close anyway. **Stores are shuttering like wildfire**. They are **required** under the NLRB **to negotiate severance** with the Union, whereas **non-union shops can just kick everyone to the curb** without consequences.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "djingrain",
                                    "body": "It is we who plowed the prairies, built the cities where they trade  \nDug the mines and built the workshops, endless miles of railroad laid  \nNow we stand outcast and starving 'midst the wonders we have made  \nBut the union makes us strong",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Respond9231",
                    "body": "Anyone middle class or lower is getting squeezed for what little money we have by an administration that exists solely for the benefit of billionaires",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dry-Construction8502",
                            "body": "The current administration is just the tip of the iceberg. Working class is railed with or without them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok_Respond9231",
                                    "body": "Agreed, it's a structural problem, but the current administration is orders of magnitude worse than the alternative. \n\n\nDon't start the \"both sides\" bullshit when Republicans are actively raising taxes on anyone making less than 100k, ending social programs that benefit the lower classes, rolling back federal protections for workers, starting a pointless trade war with our closest trade partners, removing agricultural regulations that would've prevented the spread of avian flu, oh and removing any legal obstacles that stand in the way of complete environmental destruction by the corporate sector",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "maaaaawp",
                            "body": "Its been like this for a looooong time. Fuck anyone below upper class",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dry-Construction8502",
                    "body": "Shrinking middle class,  we're all becoming poorer.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "IndyWaWa",
                    "body": "Knowing this prevents this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SadisticJake",
            "body": "Was me before I left the industry. I had nicknames for the owner's cars that I knew bothered him. Most significantly, the batmobile. Because he thought it looked like just a badass supercar and not like the batmobile. But it certainly looked like the batmobile.",
            "score": 1,
            "replies": []
        },
        {
            "author": "squeakynickles",
            "body": "Hey that's me!\n\nOne year clean this April",
            "score": 1,
            "replies": [
                {
                    "author": "MonStar926",
                    "body": "For me it was benzos a year ago this may",
                    "score": 1,
                    "replies": [
                        {
                            "author": "robgoose",
                            "body": "Fuck yeah.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "000-f",
                    "body": "Proud of you!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ratcodes",
                    "body": "let's gooo! well done",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "2ndmost",
            "body": "Hell yeah we love this dude",
            "score": 1,
            "replies": []
        },
        {
            "author": "miguelmanzana",
            "body": "Damn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deepfreshwater",
            "body": "Has IBS and spends 20-30 minutes on the toilet after each rush",
            "score": 1,
            "replies": [
                {
                    "author": "thegodofhellfire666",
                    "body": "lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mell0_jell0",
                    "body": "Nah that's mgmt",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChesterAurelius",
            "body": "The part about the bosses houses is so true.  Worked at a spot owned by a big restaurant group for a while and everyone was constantly talking about the owners various mansions and supercars.  He owned the actual “wax on wax off car” from karate kid and would park it outside all the time.   \n\nI never understood why everyone always wanted to talk about this guy’s unimaginable wealth while we were all in there everyday busting our asses for pennies",
            "score": 1,
            "replies": []
        },
        {
            "author": "InfiniteBuddy",
            "body": "all my homies love smiling in the face of adversity",
            "score": 1,
            "replies": [
                {
                    "author": "robgoose",
                    "body": "Sweet + tragic",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YoullBruiseTheEggs",
            "body": "Lots of interest in this thread so here is a good place to start if you’re looking to unionize your area.\n\nhttps://www.ufcw.org/members/find-your-local/\n\nMay not be the right one for all of us, but we have to BEGIN TO BELIEVE we can change our own lives without the consent of our overlords and bosses.",
            "score": 1,
            "replies": [
                {
                    "author": "graaaaaaaam",
                    "body": "I know a number of kitchen staff represented by UFCW and lemme tell ya, if you like things like higher wages, days off, safe working conditions, and protections from unjust terminations, you'll love being a part of UFCW.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YoullBruiseTheEggs",
                            "body": "You absolutely had me in the comment preview haha I’m glad to hear the hype is real!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "doiwinaprize",
            "body": "I love that guy even when he relapses and shows up to work 30 mins late and super hungover like puppy with his tail between his legs. That's when you gotta manage the human element no one really appreciates outside this industry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate_Cup6414",
            "body": "How can I be/date him? lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "SignificantCarry1647",
            "body": "Id like to think that this was me coming up, I’m not perfect but I do share a large percentage of these traits. \n\nMy music in the kitchen was always a big part of setting up a good vibe and I did have a natural talent that I started tapping into it early on. Always been a counter culture damn the man kinda dude and wasn’t afraid to say something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GabagoolJunior",
            "body": "Shout out to all these legends making the job bearable",
            "score": 1,
            "replies": []
        },
        {
            "author": "Camichef",
            "body": "Shit give this bloomer a few years of HRT and I'd be way too called out.",
            "score": 1,
            "replies": [
                {
                    "author": "woodcoffeecup",
                    "body": "SAME",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ActualPerson418",
            "body": "So wholesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "Advanced-Cycle7154",
            "body": "Chewing out the manager about mold hahahahah",
            "score": 1,
            "replies": []
        },
        {
            "author": "abom-badass-mofo",
            "body": "Dude, this was me for years. I saw the Dooomer one a bit ago and knew a couple of those guys too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "danroxtar",
            "body": "dudes rock",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rugged_Turtle",
            "body": "\"Knows where they are\" the hidden gem in this one",
            "score": 1,
            "replies": []
        },
        {
            "author": "l3ninsw3ak3sts0ldier",
            "body": "don't let it just be a nice thought. take action\n\nhttps://www.multinationalcp.org/organize",
            "score": 1,
            "replies": []
        },
        {
            "author": "luckyshot98",
            "body": "This is me! But I swapped to bartending.\n\nHospitality folks, when are we gonna start organizing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comrade_pirx",
            "body": "Tbh never met this guy. But we should all aspire to be a bit more like him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FibroBitch97",
            "body": "Based on",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Alibumayefan",
                    "body": "Take me wherever you go 💙",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ohheckyeah",
                    "body": "They will get a judgement and garnish 15% of your wages, ask me how I know\n\nYes they will do it to 100 million of us if they have to",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BallDesperate2140",
            "body": "Good Guy Greg™, Line Edition",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daddy_Chillbilly",
            "body": "Love an aspirational post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GuyMcRancho",
            "body": "Change Addies to xans and you’ve got it brother :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "gumbycounsillior",
            "body": "i love when my coworkers put me onto some music i didnt know before",
            "score": 1,
            "replies": []
        },
        {
            "author": "LackWooden392",
            "body": "Damnnnnn I've never felt so recognized.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DerekWroteThis",
            "body": "![gif](giphy|l3fZFvp94ljepXoPe)",
            "score": 1,
            "replies": []
        },
        {
            "author": "jwrado",
            "body": "Me before became completely jaded and burnt out",
            "score": 1,
            "replies": []
        },
        {
            "author": "holywaser",
            "body": "this dude rules",
            "score": 1,
            "replies": []
        },
        {
            "author": "Toast_T_",
            "body": "inside me there are two wolves..",
            "score": 1,
            "replies": []
        },
        {
            "author": "muhahaha-tehe",
            "body": "Ion understand",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rab13it13",
            "body": "The shot… yup",
            "score": 1,
            "replies": []
        },
        {
            "author": "GuyMcRancho",
            "body": "Change Addies to xans and you’ve got it brother :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElessarKhan",
            "body": "This was me for about 10 years, then I became the doomer",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefiantTheLion",
            "body": "knows where they are <3",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordMemerton1",
            "body": "Is this too close to home? Or is it just cliche?",
            "score": 1,
            "replies": []
        },
        {
            "author": "wlight",
            "body": "Likely has a wealthy family, but was never pushed to achieve academically.\n\nWas probably \"gifted\" in school but never taught how to get ahead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Domin8r007",
            "body": "I like this one much more than the last one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sh1ft33",
            "body": "My soul.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darth_Gravid_",
            "body": "Wait... wait",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ouestucati",
            "body": "Oh, look. It's me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Paparigoskoni",
            "body": "Educate, Agitate, Organize!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TaxEvasionDude",
            "body": "All my coworkers love the bloomer and gloomer memes chefs kiss",
            "score": 1,
            "replies": []
        },
        {
            "author": "crook888",
            "body": "Yes",
            "score": 1,
            "replies": []
        }
    ]
}