{
    "title": "Michelle Trachtenberg and Bronson Pinchot, 1997.",
    "author": "WesleyCoolDude",
    "subreddit": "OldSchoolCool",
    "rank": 7,
    "score": 1206,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 50,
    "url": "https://i.redd.it/grw1fqh7qfpe1.jpeg",
    "id": "1je2wmf",
    "selftext": "",
    "comments": [
        {
            "author": "Financial_Sun69",
            "body": "![gif](giphy|U85Gro5AbxARO)",
            "score": 103,
            "replies": [
                {
                    "author": "Klin24",
                    "body": "Part of the original TGIF",
                    "score": 32,
                    "replies": [
                        {
                            "author": "voltr0n57",
                            "body": "It’s Friday night. And the mood is right…",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "creamcitybrix",
                    "body": "All the way from the tiny island of Mypos",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "catulus_nigrum",
                    "body": "The dance of JOY!!!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "kazmosis",
                    "body": "Every time I see Balki that guitar wail from the theme song automatically goes off in my head",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "fearlessknite",
            "body": "Its Mr. Toomy from the Langoliers!!",
            "score": 34,
            "replies": [
                {
                    "author": "JagBak73",
                    "body": "https://i.redd.it/q6g8n5tydgpe1.gif",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "mbaiz",
                    "body": "Craig Toomy?! That guy was an asshole. I hope he gets what’s coming to him.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Kumimono",
                    "body": "It was! Only just realized. The greased yuppie look really changed him.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ocTGon",
            "body": "Such a tragedy with her... RIP",
            "score": 108,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -72,
                    "replies": [
                        {
                            "author": "boooooooooo_cowboys",
                            "body": "What do you mean by this? Are you somehow suggesting that she would have survived if she had been nicer to her fans?!",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -40,
                                    "replies": [
                                        {
                                            "author": "Oryihn",
                                            "body": "There were no suspicions of drug use and was repeatedly a champion for Avoiding drinking and drugs. There were some internet rumors but friends and family have said that was not the case.",
                                            "score": 44,
                                            "replies": [
                                                {
                                                    "author": "Devium44",
                                                    "body": "Eating disorders can also damage organs.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pizza-chit",
                    "body": "Suspicious tragedy.",
                    "score": -109,
                    "replies": [
                        {
                            "author": "Persona_Non_Grata_",
                            "body": "Liver failure due to incompatibility isn't really all that suspicious, bud.",
                            "score": 74,
                            "replies": [
                                {
                                    "author": "SaccharineHuxley",
                                    "body": "When my dad was recovering from his heart transplant in hospital he had a liver transplant recipient as a roommate for a few days. Man that guy had a way rougher fight to recover. I was so glad when my dad ‘graduated’ to a different floor after a few nights. Liver transplants are tricky af.",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "Hephf",
                                    "body": "Right? Also, *most* addicts are *NOT* offered or do not qualify for organ donations for obvious reasons.",
                                    "score": 27,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "logicallychallengd",
                            "body": "Suspicious to strangers that don't know shit and like to speculate",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HereOnCompanyTime",
            "body": "The picture is from the TV Show \"Meego\" that lasted one season in 1997.\n\nSynopsis:\n> Meego (Pinchot) is a 9,000-year-old shape-shifting alien from the planet Marmazon 4.0. After his spaceship crashes, he is discovered by three children; Trip (Erik von Detten, later played by Will Estes), Maggie (Michelle Trachtenberg) and Alex Parker (Jonathan Lipnicki). They live with their single father, Dr. Edward Parker (Ed Begley Jr.) and pass Meego off as human (he does not want anyone to know that he is extraterrestrial, and tells people he is from Canada instead). Although he plans to go home as soon as his ship is repaired, he becomes attached to the children and decides to remain on Earth to care for them.",
            "score": 30,
            "replies": [
                {
                    "author": "sunbeans",
                    "body": "Are you sure this wasn’t a fever dream?! Lol",
                    "score": 16,
                    "replies": [
                        {
                            "author": "n_mcrae_1982",
                            "body": "No, I remember this one.  It was part of CBS's ill-fated attempt to compete on Friday nights with ABC's TGIF by creating the \"CBS block party\".  They also managed to lure over \"Family Matters\" and \"Step By Step\".  The other new show was a sitcom vehicle for Gregory Hines.\n\nIt didn't even last a year.\n\nEdited to add: When \"Meego\" was cancelled mid-season, it was replaced by a reboot of \"Kids Say the Darndest Things\"...\n\n...hosted by Bill Cosby!!!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kia75",
                    "body": "How can the guy from perfect strangers make a new sitcom that is somehow more perfect strangers than perfect strangers!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DuncanCraig",
            "body": "Don't be ridiculous.",
            "score": 29,
            "replies": []
        },
        {
            "author": "grantnel2002",
            "body": "Bronson is so underrated.",
            "score": 74,
            "replies": [
                {
                    "author": "zooropeanx",
                    "body": "Achmed Foley thinks so.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "PapachoSneak",
                            "body": "Achmel?  Achwell?",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "Chumbief",
                                    "body": "Would you like it with a lemon twist?",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "mattoelite",
                                            "body": "*tweest",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GriselbaFishfinger",
                            "body": "To what is it pertaining?",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "nojoblazybum",
                                    "body": "Herpes simplex 10",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pat34us",
                    "body": "![gif](giphy|ZUoPZLYloUHaMs9mvR|downsized)",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "JackTheKing",
                    "body": "He actually narrates one of my favorite books and ruins it. I liked him on perfect strangers but he was soulless and did not understand the content and seemed annoyed by it.  It was a non-fiction history book.    He must have gotten better because I just looked it up and he's narrated nearly 500 books.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "2dogsathome",
                            "body": "He's one of my favorite narrators but I usually listen to fiction; Maybe he likes reading fiction better. He's great in The President's Vampire series.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "boo_jum",
                                    "body": "Same, I love him as a narrator, but I listen mostly to fiction, and he's a popular narrator in horror anthologies (lots of Lovecraft).\n\nIt also took me ages to connect his Narrator Voice to the face/actor as I know him on screen (partly because my STRONGEST association with him as an actor is Eduardo Feliz in First Wives Club 😂)",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "2dogsathome",
                                            "body": "Every time I see his name on a book I think of Balkie.  He and Scott Brick are probably my favorite narrators. When looking for a new book, I'll search for their names to see if they have anything new out.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "boo_jum",
                                                    "body": "My 'comfort food' narrators are Michael Kramer (who reads most of Sanderson's stuff), Ray Porter (who reads most of Jonathan Maberry's stuff), and Gideon Emery (Charles Stross' Laundry Files).  If I'm unsure about a title/author because it's an unknown to me, any of those three will help tip the scales (and Pinchot is on a short list too, not quite so much influence, but he's an asset in the PRO column for sure!)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "2dogsathome",
                                                            "body": "I forgot to add Ray Porter as one of my favorites",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "koulourakiaAndCoffee",
            "body": "The Greek government should recognize Pinchot as an honary citizen.   And rename a small island to Mipos.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Dmaxjr",
            "body": "Don’t know which is my favorite character for him:\n\nBalki Bartokomos or Jean Luc Rieupeyroux",
            "score": 12,
            "replies": [
                {
                    "author": "anabasismachine",
                    "body": "No one wins a land war in Russia. Not even Balki in the unaired 9th season of Perfect Strangers.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "UnderpaidModerator",
            "body": "Dude is honestly a beast. 40+ year acting career, successful, still active, recorded 400+ audiobooks, never hear a thing from him or about him. Why can't more celebrities be like this?",
            "score": 8,
            "replies": [
                {
                    "author": "boo_jum",
                    "body": "Right?  It was like watching Weird Al's Behind the Music, when he goes into all the things he has NOT done (never been a drug addict, never dated a celebrity, never had trouble with the law, didn't drink, etc. etc.).  He's just a decent dude, making a living doing something at which he's remarkably skilled, in an industry that often chews people up and spits them out, and he's vibing and getting along and NOT BEING A HORRIBLE HUMAN.\n\nAnd when he IS in public out of character, he comes across as a genuinely nice and decent dude.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "garrettj100",
            "body": "Don’t be ridiculous.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Freedom-at-last",
            "body": "Michelle will always be Nona to me and Bronson as Mr. Toomey from The Langoliers",
            "score": 7,
            "replies": [
                {
                    "author": "muchm001",
                    "body": "Yep when Michelle died it felt like Nona died.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "fendermrc",
            "body": "...when you're rolling out the dough, you got to roll it slow...  \nThe making bibibabkas song was memorable.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Positive_Process_384",
            "body": "Balki Bartokomous!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kumimono",
            "body": "Michail Tharcheburger? You know Achmet Foley?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snoo_90160",
            "body": "Very talented, even when she was still a young girl.",
            "score": 2,
            "replies": []
        }
    ]
}