{
    "title": "The current administration is taking credit for President Biden's Infrastructure Investment and Jobs Act",
    "author": "InevitableCoast8276",
    "subreddit": "Destiny",
    "rank": 14,
    "score": 1132,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 68,
    "url": "https://i.redd.it/7pkknzx5bfpe1.jpeg",
    "id": "1je1lqs",
    "selftext": "",
    "comments": [
        {
            "author": "herbaburba",
            "body": "Literally it is this fucking stupid easy and I don’t know why Dems didn’t do this.\n\nJust SLAP YOUR NAME on everything. Small or large just take credit, not everyone reads the news or pays attention so if there is a project, or plan, or bill just put it up there. \n\nReally irritating he will take credit but he is just that shameless",
            "score": 530,
            "replies": [
                {
                    "author": "JaxDude1942",
                    "body": "I live in CT, and there are signs all over the where new construction on highways and bridges have taken place. They all say the exact same thing, except it says Joe Biden, and that it was a BI-PARTISAN INFRASTRUCTURE BILL. They literally give credit to republicans right on the fucking sign.",
                    "score": 179,
                    "replies": [
                        {
                            "author": "Dtmight3",
                            "body": "Everyone does this for all kinds of projects (especially if there *can* be foot traffic) all the time. I was working on a project and saw a sign like 5 years ago that said ~$18M in federal funds and $0 in state funds. ",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "j97hUlaO901leIoeA79l",
                            "body": "Not sure why they’d do something stupid like that. Sounds like Joe Biden and him alone. Long live the king.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "__versus",
                    "body": "They did but like\n\nhttps://preview.redd.it/u8rcup8jofpe1.jpeg?width=680&format=pjpg&auto=webp&s=457c1f047aa8d4b51d335be67bdeffa61a8ef850",
                    "score": 56,
                    "replies": []
                },
                {
                    "author": "Talib00n",
                    "body": "Seriously it is so easy. Same with rebates or pay outs out of Federal Funds. No Tax Credit bullshit, just send Checks to people's Homes WITH THE PRESIDENTS SIGNATURE AND NAME ON IT",
                    "score": 72,
                    "replies": [
                        {
                            "author": "CloakerJosh",
                            "body": "‘Scuse me - it’s not a “wet ink” signature so it’s null and void apparently",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "Nice-Technology-1349",
                            "body": "This would also be a massive saving for the government because if a Democrat president did it tons of Republicans would burn it rather than cash it.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Talib00n",
                                    "body": "Lmao actually true",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BoogerDaBoiiBark",
                    "body": "Why do that when we call every bill that a single Republican voted for a “bipartisan bill?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "PortiaKern",
                            "body": "Because they still wanna work together and get moderate and republican support.\n\nAnd they're cucks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PersonalDebater",
                    "body": "They...did do that. There was a whole deal about signs being put up with Biden's name on it.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "LoudestHoward",
                    "body": "https://i.imgur.com/t61xeBg.png",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Dismal-Bobcat-823",
                    "body": "America, folks...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Economy-Cupcake808",
                    "body": "Dems did to that but you don't care, you just have a hate boner for democrats.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mordin_Solas",
                    "body": "I just found a moral use case for vandalism of putting Bidens name on a sign and scratching out Trump",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Unfair-Lecture-443",
                    "body": "Cause dems are still trying to do politics the old way and pretend Republicans aren't insane facists.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Zenning3",
                    "body": "Dems don't do it because its tacky and reeks of tin pot dictators and dipshits.\n\nRepublicans do it now because they are tin pot dictators and dipshits.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "BazelBuster",
                    "body": "Biden even said he was stupid for not putting his name on stimulus checks like Trump",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 157,
            "replies": [
                {
                    "author": "RathaelEngineering",
                    "body": "Cross out Trump and re-write Biden.",
                    "score": 68,
                    "replies": []
                },
                {
                    "author": "suicideskinnies",
                    "body": "I am verbally upvoting your post, as Reddit is now threatening to ban me for upvoting \"hateful or abusive comments\".",
                    "score": 39,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FlashGenius",
                                    "body": "You talked about the death of the sitting president; thus, you threatened violence. The emperor will always be sitting on his throne.\n\nfuck my life\n\n40k's greatest failure is that they underestimated humanity's stupidity",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Destiny-ModTeam",
                                    "body": "Your comment or post has been removed for violating rule #3:\n\nDo not make threats of violence or encourage others to commit acts of violence or terrorism. This includes telling someone to harm themselves or openly wishing harm or violence upon others. Limited exceptions apply, such as supporting one side in a conflict, but any attempts to stretch or misuse these exceptions will not be tolerated and will result in immediate action.\n\n---\n\nYou yourself correctly pointed out that Reddit is heavy handed with bans and then added the measles comment. Chill.\nWe've had a warning pinned about this for like 2 past weeks for a reason.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Destiny-ModTeam",
                    "body": "Your comment or post has been removed for violating rule #3:\n\nDo not make threats of violence or encourage others to commit acts of violence or terrorism. This includes telling someone to harm themselves or openly wishing harm or violence upon others. Limited exceptions apply, such as supporting one side in a conflict, but any attempts to stretch or misuse these exceptions will not be tolerated and will result in immediate action.\n\nThis includes calls for vandalism.",
                    "score": -9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dismal-Bobcat-823",
            "body": "Just .. fucking sharpie it you pussies!?",
            "score": 106,
            "replies": [
                {
                    "author": "Im_At_Work_Damnit",
                    "body": "Or slap a Biden “I did that” sticker on it",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "RoundZookeepergame2",
                    "body": "legit what I was thinking",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePointForward",
            "body": "This is common here in Czechia, mostly with highways. Any current government will always take credit for finishing highway segments, even if it was two governments before them who started it.",
            "score": 87,
            "replies": []
        },
        {
            "author": "povertyorpoverty",
            "body": "Easy sharpie target, do your duty dawg.",
            "score": 68,
            "replies": []
        },
        {
            "author": "GoldenSalm0n",
            "body": "It's great when Trump does it, it doesn't really matter what it is.",
            "score": 36,
            "replies": [
                {
                    "author": "sleepybear5000",
                    "body": "Even when it's something pretty fucking fascistic like deporting a legal resident for FREEZE PEACH they'll spin it to being good and based",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Vankraken",
                            "body": "They are in a cult mentality. They got conned and can't cope with being burned so they keep doubling down until they hit rock bottom.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Nice-Technology-1349",
                            "body": "Literally none of them give the beginnings of a shit about FREEZE PEACH. They only want it for them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "343N",
            "body": "Time to add PASSED BY JOE BIDEN to the end of that sign huh",
            "score": 22,
            "replies": []
        },
        {
            "author": "Goldiero",
            "body": "Lmaoooo",
            "score": 19,
            "replies": []
        },
        {
            "author": "SirFroglet",
            "body": "Assuming Trump doesn’t declare himself Emperor of the United States & Canada through executive order and Dems are able to win the next election, they have to become absolutely shameless with this sort of thing. Take credit for everything which works in the country and plaster the president’s name everywhere",
            "score": 15,
            "replies": [
                {
                    "author": "Jake4Steele",
                    "body": "Nah, I feel like that's the wrong direction, it is good to start using some of the MAGAts winning strategies, but not those that would make you question if the Dem party is still the same party anymore.\n\nInstead, they should utterly demonize and persecute any self-declaring MAGAt. Shit should be purged like it's the KKK, like it's literal Neo-nazis, because at this point, **it's on par with both such groups.**",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Lord_Of_Shade57",
                            "body": "I have bad news for you on how purged the KKK have been",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Jake4Steele",
                                    "body": "Never too late imo",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "miikoh",
            "body": "Just let republicans talk to you about how incredible this act is for a while and THEN remind them who actually passed it. See how they squirm around admitting that Joe Biden passed legislation that they've now admitted they think is awesome.",
            "score": 13,
            "replies": [
                {
                    "author": "DurumAndFries",
                    "body": "\"Well, Trump actually made the plan happen instead of it being just words on paper\" or some dumb shit like that",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "helbur",
            "body": "Don't let him get away with this. Wave Biden's accomplishments in front of his face every chance you get",
            "score": 22,
            "replies": []
        },
        {
            "author": "hectah",
            "body": "That was always gonna be the case, Republicans are very good at taking credit for things they didn't do.",
            "score": 9,
            "replies": [
                {
                    "author": "Senator_Pie",
                    "body": "You absolutely have to be when your only accomplishment is tax cuts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZealousidealAge7459",
            "body": "I'm in Maryland, where is this? Anyone know?",
            "score": 8,
            "replies": [
                {
                    "author": "vrabacuruci",
                    "body": "Quick google search tells me Maryland is a state in the Mid-Atlantic and South Atlantic regions of the United States.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "buttamilk_jesus",
            "body": "Whoever lives near this, it is your god-given duty as an American, an inhabitant of the greatest nation mankind has ever created, to scribble out Trump’s name and put Biden’s in.",
            "score": 8,
            "replies": []
        },
        {
            "author": "gadhar321",
            "body": "To the surprise of noone. I mean to this day Hitler gets credit for the Autobahn, even tho it got initiated way before.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dgoyena216",
            "body": "Dems need to learn how to capitalize and pound that messaging on achievements. I bet you no one even knows about that infrastructure bill Biden signed and truly think this is all Trump.",
            "score": 2,
            "replies": []
        },
        {
            "author": "blueflloyd",
            "body": "Republicans have been voting against government infrastructure bills and then showing up for the ribbon cuttings to take credit seemingly since George Washington was in short pants",
            "score": 2,
            "replies": []
        },
        {
            "author": "marshalzukov",
            "body": "I don't think cans of spray paint are too expensive. Just saying.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Desperate-Fan695",
            "body": "[https://www.homedepot.com/p/Rust-Oleum-Painter-s-Touch-2X-12-oz-Gloss-Colonial-Red-General-Purpose-Spray-Paint-334030/307244800](https://www.homedepot.com/p/Rust-Oleum-Painter-s-Touch-2X-12-oz-Gloss-Colonial-Red-General-Purpose-Spray-Paint-334030/307244800)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Independent_Depth674",
            "body": "Donald Trump did the infrastructure investment and jobs act.\n\nYou may not agree.\n\nYou may in fact have evidence to the contrary.\n\nBut you have to ask yourself:\n\nIs it worth losing your funding over?\n\nDonald Trump did the infrastructure investment and jobs act.",
            "score": 4,
            "replies": [
                {
                    "author": "Jake4Steele",
                    "body": "Yes, it **is worth losing the funding over**.\n\nSo long as none of you dem pussies will be willing to put shit on the line, to actually risk some of your own skin to win, the MAGAts will keep dogwalking you and ass-raeping you in perpetuity (and at that point, I wouldn't even blame them, that's the only logical action for them to take).\n\n(By the way, that's just a gambit, he wouldn't actually pull the plug immediately on the funding, or if he did, that's another weapon to use against him)",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "jussedlooking",
            "body": "This is propaganda",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zuboronovic",
            "body": "Sus",
            "score": 1,
            "replies": []
        },
        {
            "author": "notsosurethingboss",
            "body": "Business people understand that ability doesn't matter and everything is a numbers game of public exposure. Democrats are the HR department obsessed with rules and compliance whereas Republicans are sales.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fartcloud_McHuff",
            "body": "Of course they are. They are comfortable lying about out anything and everything. We are post truth",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thirdhistory",
            "body": "This is literally exactly what Destiny said Dems should be doing lmao, how is our party so dogshit at this? We even saw Trump do it in his first term with him delaying the stimulus checks to add his signature.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rational_Disconnect",
            "body": "How is that even legal?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silent-Cap8071",
            "body": "This is shameless! And it's written there, the infrastructure investment and jobs act was Biden's bill!\n\nTrump's voters were not informed. They are ordinary workers. They will all fall for this. We must inform them! There should be a million ads about this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BenFET",
            "body": "[https://www.youtube.com/watch?v=Ox\\_v4m8PPlU](https://www.youtube.com/watch?v=Ox_v4m8PPlU)",
            "score": 1,
            "replies": []
        },
        {
            "author": "govSmoothie",
            "body": "Taking credit for Democrat policies is Republicans favorite past time. [Biden joked about this a lot while he was president](https://www.youtube.com/watch?v=Ox_v4m8PPlU).",
            "score": 1,
            "replies": []
        }
    ]
}