{
    "title": "Judge disagrees MAGA attacks.",
    "author": "overloadrages",
    "subreddit": "Destiny",
    "rank": 9,
    "score": 381,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 105,
    "url": "https://www.reddit.com/gallery/1jeai67",
    "id": "1jeai67",
    "selftext": "",
    "comments": [
        {
            "author": "destinyeeeee",
            "body": "\"John Roberts admits he can't read the room\"\n\nThe room in question:\n\nhttps://preview.redd.it/fms3i0kpihpe1.jpeg?width=733&format=pjpg&auto=webp&s=72581460c145b79fc04481ab2b344bd7d2d300e4",
            "score": 394,
            "replies": [
                {
                    "author": "TerryWhiteHomeOwner",
                    "body": "Basically. To me its the most telling reaction ",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "daywall",
                    "body": "That tweet stood out to me as well.\n\nThat is just blatant \"we want a king that agree with us and punish who we hate\".",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "gregyo",
                    "body": "To be fair that’s an a really easy room to read.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "daywall",
                    "body": "That tweet stood out to me as well.\n\nThat is just blatant \"we want a king that agree with us and punish who we hate\".",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "PuddingXXL",
            "body": "\"Putting lives in danger including that of our allies\"\n\nExcuse me you traitorous MAGA PoS but which allies are they referring to?",
            "score": 166,
            "replies": [
                {
                    "author": "MightAsWell6",
                    "body": "Russia",
                    "score": 89,
                    "replies": [
                        {
                            "author": "PuddingXXL",
                            "body": "^ This guy fucks",
                            "score": 32,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Smalandsk_katt",
                    "body": "Russia, Israel, Hungary, Niger, Burkina Faso, Nicaragua, El Salvador.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "saxguy9345",
                            "body": "Oh yes the new world order the MAGAts have been salivating over, \"no one can beat these economic partners\" 😂 fkn jebus ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "insanejudge",
                                    "body": "Voting along with North Korea in the UN opens up a world of new trade opportunities for us",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "robin7133",
            "body": "🇷🇺🇷🇺🇷🇺",
            "score": 114,
            "replies": [
                {
                    "author": "Smalandsk_katt",
                    "body": "God damn, the red white and blue 🇷🇺🇷🇺🇷🇺🏳️‍⚧️🇷🇺🇷🇺",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "str82daglurping",
            "body": "All in sync as usual",
            "score": 52,
            "replies": []
        },
        {
            "author": "Pale_Temperature8118",
            "body": "hey Chuck Schumer, this is when you said republicans would flip right? Where’s your boys?",
            "score": 94,
            "replies": [
                {
                    "author": "neeblerxd",
                    "body": "Spelling error. there’s no “h” in his first name bud",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Noobity",
                            "body": "My ass was like \"Chuck Scumer?\"",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "SignEnvironmental420",
                                    "body": "sCOOMER",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xesaie",
                    "body": "In total fairness, Twitter chuds are barely human.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "lickausername",
            "body": "Democrat voters need this amount of devotion to the message. Watch and learn.",
            "score": 96,
            "replies": [
                {
                    "author": "Soft-Outside-6113",
                    "body": "Yeah no we don’t lol I’m not trying to suck up to a king and mindlessly parrot my dear leader’s talking points at the drop of a hat",
                    "score": 15,
                    "replies": [
                        {
                            "author": "TrumpsPissSoakedWig",
                            "body": "But we do need widespread enthusiasm for a by and large newer, younger, more progressive Democratic party, and leadership structure with a more well defined plans and policies.\n\nWe won't worship, but we need 18-35's, and more to be worked up and angry enough to get out and vote en masse, if we even have fair elections, or elections *at all* again.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Soft-Outside-6113",
                                    "body": "No doubt and I am completely in support of that. There needs to be more unity in the party, but that’s difficult when you have people from different backgrounds and beliefs. I don’t want to be part of a cult that excludes everyone that doesn’t fall in line.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hotyogurt1",
                            "body": "If the dems keep things up like they have been, you’re gonna have to lol",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Soft-Outside-6113",
                                    "body": "I’m going to have to have cult devotion to a leader and not think for myself? The Dems need to change, but acting like MAGA is not the answer.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Relative-Ad-6791",
                    "body": "Its a hive mind",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Stop_Sign",
                            "body": "Its a bot net",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rimsky225",
            "body": "The distraction politics is unreal. Even if impeaching this judge was the correct move, which it isn’t, the real story here is that the Trump admin is OPENLY DEFYING AN ACTIVE COURT ORDER. Never forget above all else this is the story.",
            "score": 31,
            "replies": []
        },
        {
            "author": "adakvi",
            "body": "These maggats saying “convince me otherwise” as though they would accept ANY empirical evidence. \n\nThese are traitors who make money and gain influence off of ruining the West, destroying everything the enlightenment stood for, and spreading their nazi ideology. I hope karma is real",
            "score": 42,
            "replies": [
                {
                    "author": "Watch-it-burn420",
                    "body": "https://preview.redd.it/6ths8dolohpe1.jpeg?width=1170&format=pjpg&auto=webp&s=eac74acfee432da0ed976e7becc9e0f90bc62038",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Godobibo",
                            "body": "> posting pcc in rDestiny\n\nfade me",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "CoachDT",
                            "body": "Pizza cake is an awful person but her political comics are so accurate.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Watch-it-burn420",
                                    "body": "I don’t really follow her. I just found this offhandedly posted somewhere and copied it because I thought it was funny and accurate.\n\nMind updating me on the artist I don’t know anything about her ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CoachDT",
                                            "body": "Its not that deep so maybe i'm embellishing when I say AWFUL, but she made a weird comic about \"if men were told the things women were\" and one panel was about sexual assault. When men who have been assaulted or raped tried to speak to her about how that stuff does happen and how hurtful it is when it does, instead of saying \"oh my bad\" she just doubled down, said she had male friends and a son etc. And then she got the mods on the comics sub to perma anyone who even remotely criticizes her for said comic, AND THEN went on a crusade against another couple of subs who spoofed her comics, threatened legal action and what not.\n\n  \nEither way she's on a Lebron-esque run when it comes to political comics. And in general even people who I dislike can/should get props when they do well.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Watch-it-burn420",
                                                    "body": "Wow, that does sound awful. I see post all the time about people getting banned from /comics. All of the time and other sub Reddit for the most monotonous nothing burgers I’ve ever seen. So I just don’t really look at that sub very often or if I do see it on occasion I just never comment.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "voyaging",
                    "body": "They're anti-everything good in the world. They just look for everything good and go, \"I'm actually against that.\" Reason, compassion, generosity, introspectiveness, and surprisingly even tradition, all bad things to these people.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "JustAVihannes",
                    "body": "I'm really starting to believe Americans are uniquely regarded. We are so so so far beyond parody at this point.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Artistic_Farmer195",
            "body": "how long till he gets back on his knees?",
            "score": 11,
            "replies": [
                {
                    "author": "muhpreciousmmr",
                    "body": "24 hours by American standards",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "maringue",
                    "body": "The second one of these cases lands before the Court.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SuggestionMedium6998",
            "body": "Not a cult btw",
            "score": 7,
            "replies": []
        },
        {
            "author": "Truman2500",
            "body": "read the room baby WERE DOING AUTHORITARIANISM, what you want the gallows as well??? stfu and be quiet in your little supreme court tm",
            "score": 8,
            "replies": []
        },
        {
            "author": "Bovoduch",
            "body": "Genuinely evil people",
            "score": 8,
            "replies": []
        },
        {
            "author": "Glasskey117",
            "body": "NPC's got the new anger program installed",
            "score": 7,
            "replies": []
        },
        {
            "author": "Skabonious",
            "body": "We need to call this the Rittenhouse effect. It's the first example (IIRC) where they mobilized in unison against one of their own as soon as they stepped out of line even slightly",
            "score": 7,
            "replies": [
                {
                    "author": "chemicalfire99",
                    "body": "When did they turn on rittenhouse?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "listgarage1",
                            "body": "He said he was thinking about not voting for Trump because he was bad for gun rights.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "morganshen",
                            "body": "https://www.cbsnews.com/chicago/news/kyle-rittenhouse-wont-vote-for-donald-trump/",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AngryFace4",
            "body": "Jesus Christ. And Robert’s is one of their strongest soldiers. Wild, this practically far left levels of self consumption.",
            "score": 7,
            "replies": []
        },
        {
            "author": "chudcam",
            "body": "THEY MAD MAD LMAO",
            "score": 5,
            "replies": []
        },
        {
            "author": "Competitive-Bank-980",
            "body": "I wonder if this will act in our favor, against us, or not at all.",
            "score": 6,
            "replies": [
                {
                    "author": "muhpreciousmmr",
                    "body": "Roberts is saving himself here.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "down-with-caesar-44",
                            "body": "Yea, I think so too. The guy signed the immunity ruling. Trump behaving in such an unrestrained way is in no small part thanks to that ruling. He will never face any accountability thanks to Roberts and the hyper-partisan conservative majority.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Elipses_",
                            "body": "I don't care about him having selfish reasons, so long as those reasons lead him to standing against Trump.\n\nUntil the Cult Leader is no more, there are very few i would turn away.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Routine_Complaint_79",
            "body": "All coordinated...",
            "score": 4,
            "replies": []
        },
        {
            "author": "CrimsonThunder34",
            "body": "He can't read the room = He won't obey our king.",
            "score": 5,
            "replies": [
                {
                    "author": "Turing33",
                    "body": "The king that Roberts created by granting him immunity.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DeathandGrim",
            "body": "They literally all share the same programming",
            "score": 3,
            "replies": []
        },
        {
            "author": "HellBoyofFables",
            "body": "Actually anti-American AF",
            "score": 3,
            "replies": []
        },
        {
            "author": "muhpreciousmmr",
            "body": "I was wondering how long it would take for any of the SC judges to do anything as Trump began attacking and defying fed judges openly and asking for them to be impeached. I mean Roberts sees the writing on the wall. But this is where were at. Because Roberts knows his career is in question if they dont stammer out some sort of \"line\".",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pale_Temperature8118",
            "body": "The last post is really funny when you consider that what they are talking about actually exists, but it’s the Federalist Society and they actually love it",
            "score": 2,
            "replies": []
        },
        {
            "author": "agon_ee16",
            "body": "George Wallace is now deep state, Left-Wallacites are so back!",
            "score": 2,
            "replies": []
        },
        {
            "author": "theseustheminotaur",
            "body": "These guys write their own fanfics for life and demand we all live in them",
            "score": 2,
            "replies": []
        },
        {
            "author": "Green-Draw8688",
            "body": "Goddamit OP, add punctuation or “and”s to your title. I wasted 20-30 precious seconds of my like trying to work out what your title meant based on the context.",
            "score": 2,
            "replies": []
        },
        {
            "author": "An0n087",
            "body": "Can someone catch me up on what happened? \n\nWasn’t Trump sucking off Roberts at that Pseudo-SOTU address a few weeks back?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Spotter01",
            "body": "The inhibitor chip has designated a new target",
            "score": 1,
            "replies": []
        },
        {
            "author": "TerryWhiteHomeOwner",
            "body": "\"He can't read the room\" - out of all the reactions I feel like this is the most pertinent and honest to what's happening in the wider GOP rn. A bunch of lawmakers and judges have read the room, they know the endgame and what's at stake if they don't fall in, and Roberts doesn't. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "agon_ee16",
            "body": "George Wallace is now deep state, Left-Wallacites are so back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "agon_ee16",
            "body": "George Wallace is now deep state, Left-Wallacites are so back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redditfront2back",
            "body": "I personally love the fact that maga is alienating not one but 2 justices that previously were firmly in their camp. Maybe they can go so far that they never rule with the other dipshit red judges again. It would be so satisfying if online deranged Trump dick sucks fix the SC for us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "voyaging",
            "body": "Integrity is no longer a moral value for half the country. It's really fucking sad, man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xesaie",
            "body": "Saying Roberts is the reason we're in this mess is pretty incredibly spot on though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QTEEP69",
            "body": "They're still doing the whole deep state swamp thing with multiple billionaires influencing the current president? Interesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BainbridgeBorn",
            "body": "The Party of Small Government, Justice, and Police (only when it’s in their side)",
            "score": 1,
            "replies": []
        },
        {
            "author": "GWstudent1",
            "body": "My favorite part about this is that Trump could just seal team six Roberts (and might if the right person gets in his ear) and because of Roberts’s ruling, he can’t even be investigated for it. Playing yourself on the deepest level possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuffysPowerfulCoC",
            "body": "Wait, did he just disagree on impeaching another judge? That's it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PluckyAurora",
            "body": "How long until we actually get a night of the long knives situation. The MAGA maggots would of course support and defend it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Granitehard",
            "body": "He didnt even strike anything down or impede Trump in any way, he literally just said he didnt like something Trump said lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "CoachDT",
            "body": "The more that I see these types of reactions the more that I think they're being funded by someone to spread this rhetoric. \n\n\nEven among groups that are politically aligned you'd expect some sort of disagreement. But on EVERY single issue the usual suspects are all lockstep in preaching the exact same narrative. \n\n\n\nWhich for the BIG things I could totally understand. But I'm suspicious because even tiny shit like attacking chess.com for the lighthearted bishop tweet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MalekithofAngmar",
            "body": "It's crazy seeing guys with PFP's of Jefferson and Bastiat backing this lunatic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stanel3ss",
            "body": "yeah.. you guys are actually fucked  \nlike literally heading for another civil war",
            "score": 1,
            "replies": []
        },
        {
            "author": "OgreMcGee",
            "body": "Never fails to amuse me that these screencaps always have 1-2 regarded NFT/Cryptobros losing their mind. \n\nThis time in history will be studied so closely. Its a bizarre case of how people can hold so many contradictory beliefs. \n\nThe libertarian to fascism pipeline is the weirdest case and the 'decentralized currency' to avoid gov authority being in favor of Trump of all people is just another chapter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LouisFuton",
            "body": "There is no level MAGAts won’t sink to. Trump could announce they’re rounding up all left leaning citizens for “national security” and they will find a way to convince themselves it’s totally fine. This isn’t hyperbolic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "babrovsky",
            "body": "Each passing day makes it harder and harder for me to not think that things are about to get violent very quickly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoBunch4224",
            "body": "MAGA pisses and shits anytime anyone says we shouldn’t do Auschwitz",
            "score": 1,
            "replies": []
        },
        {
            "author": "GuyWithOneEye",
            "body": "these people are hopeless\n\nhttps://preview.redd.it/59icatx12ipe1.jpeg?width=640&format=pjpg&auto=webp&s=6200371d7443dd85741d40ad762d358688a68bbe",
            "score": 1,
            "replies": []
        },
        {
            "author": "tarpex",
            "body": "Fuck, I hope there's lists made of these traitorous maga scum, so they don't get just to play dumb once this is inevitably over, and *I cannot say what I want to say*",
            "score": 1,
            "replies": []
        },
        {
            "author": "carrtmannn",
            "body": "Cool, we all hate Roberts now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YeeAssBonerPetite",
            "body": "I like the one where they say \"John Roberts\" is trying to destroy the judicial branch - to me, it sounds like blaming him for when Trump tries to destroy it because it wont do what he says.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpiffySyntax",
            "body": "This absolute banana town. It’s so frightening to see this happening right in front of you. They are completely incapable of seeing themselves what is happening here",
            "score": 1,
            "replies": []
        },
        {
            "author": "Always4am",
            "body": "\"Any judge that doesn't agree with me should be impeached\" is what they are actually saying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeySkeksi",
            "body": "Why are these white guys all so angry?  Do their lives suck that much? \n\n  \nLike play some fucking video games and eat a pizza, what a bunch of losers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bendol90",
            "body": "This feels like Russian state actors all over X sowing these dog shit takes and attacks. It feels like there's a conspiracy going on with Elon and Trump that is insanely treasonous. It's all vibes on X and parrots but I can't shake the feeling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RemoveAnnual2689",
            "body": "I will never understand how Americans, to be precise MAGA and Americans like them, are so regarded that they have to make up conspiracy theories when there are real, pending and concerning problems right in front of their noses? Are they masochists? Is it some soft of escapism unique to them? Haven't they heard of entertainment? Or does entertainment remind them how shit their lives are? ",
            "score": 1,
            "replies": []
        },
        {
            "author": "OnlyP-ssiesMute",
            "body": "and people say conservatives dont purity test",
            "score": 1,
            "replies": []
        },
        {
            "author": "Johnnyboy1029",
            "body": "Destiny was right, all the Supreme Court cares about is maintaining and expanding power, the moment Trump impeaches any judge its absolutely game over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamthedave3",
            "body": "Party of law and order BTW",
            "score": 1,
            "replies": []
        },
        {
            "author": "DonDaTraveller",
            "body": "It is the sweet, sweet sound of consequences ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "vvestley",
            "body": "the bot farm videos look more organic than the coordinated tweets these doofuses put out together",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldenSalm0n",
            "body": "Just curious, what happens if a judge actually decides to go off the deep end and become unhinged and intransigent. We just allow them to imoose their power even though they are hellbent on destroying the fabric of society, because Congress says so?",
            "score": 1,
            "replies": []
        },
        {
            "author": "maringue",
            "body": "The Brown Shirts got the talking points.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unfair-Lecture-443",
            "body": "Wasn't Roberts the guy who invented Presidential immunity to save Trump or am I mixing up my Justices?",
            "score": 1,
            "replies": []
        }
    ]
}