{
    "title": "Apparently the people sent to El Salvador aren’t even gang members.",
    "author": "No_Match_7939",
    "subreddit": "Destiny",
    "rank": 18,
    "score": 125,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/Destiny/comments/1jeetmq/apparently_the_people_sent_to_el_salvador_arent/",
    "id": "1jeetmq",
    "selftext": "To early to confirm but according to this news article; https://amp.miamiherald.com/news/local/immigration/article302251339.html \nThree of the undocumented immigrants sent to El Salvador didn’t even have gang ties. This administration is truly evil. ",
    "comments": [
        {
            "author": "Alypie123",
            "body": "If only we had some sort of hearing where we could document a set of facts and come to a conclusion.",
            "score": 141,
            "replies": [
                {
                    "author": "AdCrafty9098",
                    "body": "No, better to shoot first then shoot again. That way anyone asking questions is 'deported'.",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "Final545",
            "body": "Can you imagine being sent to that shithole for no reason? I bet even if they try to recover them now (they won’t) they are not even accounted for, going in there is practically a death sentence, they have no way to get out, no recourse. It’s insanity",
            "score": 66,
            "replies": [
                {
                    "author": "TeQuila10",
                    "body": "Cruelty, point, etc.\n\n\nThis shit is actually barbaric, and anyone involved in making this happen should be jailed. Forget the constitution, this is violating human rights.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "ConsiderationEasy723",
                            "body": "We think it's cruel, MAGA gets off at the idea.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "General-Woodpecker-",
                                    "body": "His popularity keep rising.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "adjective-noun-one",
                            "body": "They don't have human rights if they're brown actually\n\ndumbass libtards can't grasp this simple concept smh my head",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "General-Woodpecker-",
                    "body": "They knew what they were doing, they bragged about it on the White House twitter account and Americans loved it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ipityme",
                    "body": "The US government is paying to house people in offshore labor camps without due process. \n\nHow much worse does it need to get?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mephistotles",
            "body": "https://preview.redd.it/aelvjnj4dipe1.jpeg?width=512&format=pjpg&auto=webp&s=c6573063a82a308379a8aa3edfb95d354d0f3eef\n\n>Unexpected",
            "score": 25,
            "replies": []
        },
        {
            "author": "Apathetic_Zealot",
            "body": "Selling slaves to work in Salvadorian labor camps and sweat shops.",
            "score": 23,
            "replies": [
                {
                    "author": "AiurHoopla",
                    "body": "dude that prison is not a labor camp or a sweat shop. Its legit nothing. You cant do anything all day. You are stuck in a huge cell with tons of people. The whole point is you can't do shit. They don't even have visits. There's nothing. [https://www.youtube.com/watch?v=H42zWaD4A4s&t=3s](https://www.youtube.com/watch?v=H42zWaD4A4s&t=3s)\n\n  \nThere's no rec room or TV.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ichydrew",
                            "body": "Ya once you walk in the prison you never get out. Rec time is in the big aisle in the middle where they mostly do prayers and shit. Those guys are fucked",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Extension_King5336",
                                    "body": "We're sending dudes to purgatory holy shit",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Smile_6942",
            "body": "At what point do immigrants self deport to avoid being wrongfully declared a gang member and being sent to one of these Salvadorian labor camps (that is what they are they are prisons that rely on labor of the imprisoned to fund their existence). Like this is terrifying you can just get sent there with no recourse and die in that labor camp. We are Russia but with extra steps now.",
            "score": 12,
            "replies": [
                {
                    "author": "mrfuzee",
                    "body": "This is the right question, and it’s likely the entire reason they’re doing this. Just like with the whole child separation thing when the DHS secretary basically said they were being as cruel as possible to deter people from coming or staying here.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "RepresentativeBug535",
                    "body": "At what point? They're already doing it. \n\n[https://youtu.be/52Ipm0YWKTo](https://youtu.be/52Ipm0YWKTo)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AcadiaDangerous6548",
            "body": "Well they were brown weren’t they? If not gang banging, they were probably doing something else illegal",
            "score": 23,
            "replies": [
                {
                    "author": "No_Match_7939",
                    "body": "That’s maga logic",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Affectionate_Wind_97",
                    "body": "![gif](giphy|d3mlE7uhX8KFgEmY)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yee4Prez",
            "body": "Waaaaat you’re telling me they were hiding their faces because they were just regular people? Fake news, banned from the Oval Office",
            "score": 7,
            "replies": []
        },
        {
            "author": "rasta_a_me",
            "body": "I wish more dictators atleast have half a brain cell of the likes of Putin and Chinese Winne the poh.",
            "score": 3,
            "replies": [
                {
                    "author": "General-Woodpecker-",
                    "body": "Putin is kind of the same kind of the same type of moron.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RandoDude124",
            "body": "God the idea of this happening to you…\n\n**It makes me sick.**",
            "score": 3,
            "replies": []
        },
        {
            "author": "rotciv0",
            "body": "Yeah, it's bad, what do you want me to say?\n\n-\"centrists\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "overthisbynow",
            "body": "So assuming the rule of law and sanity even comes back at this point about how many years you figure till America can be considered a decent, trustworthy nation again?",
            "score": 3,
            "replies": [
                {
                    "author": "clark_sterling",
                    "body": "I can’t go into full detail without getting banned, but we wouldn’t be able to even start that conversation without truly punishing these people in a way that shows the world what we’re about. If we are to take this as a preview of the absolute desecration of human rights that is to come, then everything between McCarthyism and the Nuremberg trials must be on the table immediately. Anyone from the administration all the way down to major influencers. I’m sorry. At this point, these people will not learn if we just forgive and forget. They cannot walk away from their crimes without the fear of god being put into them.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "overthisbynow",
                            "body": "Yep should've happened after last time. Lock em up!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sinisgood",
            "body": "Yeah, but did you consider the fact that they might have brown skin? And that’s like, REALLY scary",
            "score": 5,
            "replies": []
        },
        {
            "author": "jpl2045",
            "body": "Not at all surprising. They just want the bodies to deport so they can make a bunch of videos of it and pretend like they're fixing a problem, to their base.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ilmalnafs",
            "body": "“Apparently”\n\nThis was evident from day 1.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vagrant_Liberal",
            "body": "Well now the only answer is to send Jimbob and BigTim from Alabama to the detention facility right? Just randomly sweep rednecks that might in the wrong light look brown enough? Eye for an eye or some shit?….",
            "score": 1,
            "replies": [
                {
                    "author": "cocacole111",
                    "body": "Start rounding up conservatives at random and just claim that it's for national security. No explanation needed. Just claim plenary military powers and national security powers and just call it a day. If inherent military powers can't even be reviewed by courts and supersede due process, then why not? If pushed, just make up some nonsense about support for Proud Boys and other white nationalist domestic terrorist organizations",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "osse14325",
            "body": "Look you need to brake some eggs to make an omelet and if that means some people would slip through the cracks, it's a sacrifice they are happy to take",
            "score": 1,
            "replies": []
        },
        {
            "author": "carrtmannn",
            "body": "Were all of them undocumented? Were any of them green card or visa holders?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpl2045",
            "body": "Not at all surprising. They just want the bodies to deport so they can make a bunch of videos of it and pretend like they're fixing a problem, to their base.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuniorAct7",
            "body": "It’s okay their deportation was legalized by a bill of attainder",
            "score": 1,
            "replies": []
        },
        {
            "author": "General-Woodpecker-",
            "body": "I mean, it is quite obvious that they were dragging just a bunch of Venezuelan people and sending them to concentration camps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joeman180",
            "body": "The most I heard was 23 people were gang associated. That means atleast 100 non gang members are now is a work camp with no hearing, no convictions and conservatives think it’s based.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TaZe026",
            "body": "Is Destiny's community this braindamaged? This was already obvious.",
            "score": 1,
            "replies": [
                {
                    "author": "No_Match_7939",
                    "body": "I’m trying to be precise on my criticism towards this administration. Hit them with actual facts and sources. Because the minute we get caught in a lie (mind you maga lie all the time) they hold that against us and make the narrative that we have TDS.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "angstrombrahe",
                            "body": "They are going to dance around you on this topic constantly.\n\nWhen they say that all of these people were gangsters, they are telling the truth in their mind, because they have defined the foreigner as being a gangster.\n\nYou are coming in trying to be hyper precise with your wording. They will use their definition whenever it helps them in the argument. They will use your definition whenever it helps them in the argument.\n\nIf you're debating in front of normies you'd do a lot better trying to find their hypocrisies like that and force them to say the quiet parts out loud, not that'll it help anymore since apparently everyone likes the quiet parts now. But trying to \"well akshually\" with them on 3 of hundreds of people here not being \"technically\" gangsters is just going to make you look weak",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}