{
    "title": "Getting into game dev-ing",
    "author": "-Minci",
    "subreddit": "godot",
    "rank": 15,
    "score": 15,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/godot/comments/1jefim2/getting_into_game_deving/",
    "id": "1jefim2",
    "selftext": "I’m considering a small personal project to try and create my own game, just to see if I actually have the ability to, really. \n\nI’m hoping for a 2d/2.5d game. What other software would I need, or guides to look over whilst trying to learn? I’m an utter newbie, but this is sort of a childhood dream of mine and I’d like to finally pursue it. ",
    "comments": [
        {
            "author": "DevFennica",
            "body": "*”try and create my own game, just to see if I actually have the ability to”*\n\nNo one is born with the ability to make games. If you want to learn, you follow the same three step program as everyone else:\n\n1. *Learn the prerequisites.* You can’t make games without having a basic understanding of programming. So learn programming in general first. Language doesn’t matter.\n\n2. *Get familiar with the tools.* The best way to get started with Godot is by going through the Getting Started section of the documentation.\n\n3. *Practise.* Start with something that you can already make (e.g. Pong), and gradually increase complexity until you reach the level of whatever you want to make.",
            "score": 11,
            "replies": []
        },
        {
            "author": "yaboistevelmao",
            "body": "There’s many tutorials on the basics of Godot. I don’t remember any specific ones, but in general there are many like 1-3 hour vids explaining basic Godot functionality to help you understand the general average flow of Godot game dev.\n\nBut ngl, after understanding what scenes are and how to use the scene tree ur good!! Even if you write bad code or do stuff in a “bad” way, if it works it works!\n\nAlso don’t forget to look at Godot documentation",
            "score": 5,
            "replies": []
        },
        {
            "author": "avidtomato",
            "body": "https://www.youtube.com/watch?v=LOhfqjmasi0\n\nThis is an EXCELLENT video on learning how to make a 2d video game.",
            "score": 4,
            "replies": [
                {
                    "author": "peko_",
                    "body": "Hell yeah",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hmprf",
            "body": "For a first project I would recommend going for 2d with parallax background, it can be really easy to implement and the result is often very nice! \n\nFor 2d assets there is plenty of software, it mostly depends on what you are the most familiar with I guess. For me it is pyxeledit for pixel art, figma/illustrator for vector stuff, and photoshop/procreate for illustration. For 3d, blender is perfect for my taste !\n\nGood luck on your project !",
            "score": 3,
            "replies": []
        },
        {
            "author": "Wakellor957",
            "body": "Don’t try, just create that game. Google stuff you don’t know, if you learn about/notice something new - note it down as well as how to do that thing for later.\n\nYou will learn how to make games by… well… making games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Classic_Valuable93",
            "body": "I'm on the same journey as you! I think anyone can do it if they learn the editor and things like that. Glad you're here and using Godot!\n\nFor a 2D/2.5D game, try out Aseprite for sprite animations. It's not absolutely necessary, but I've found it's a great tool for making sprites. It is 20 bucks though unfortunately. \n\nHave fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "phil_davis",
            "body": "Godot, Blender for doing 3D (it's free), Aseprite for pixel art (not free but I think there's something similar that's free, also it's probably on sale on steam right now). Check sites like itch.io for free assets. Humble Bundle sometimes has game asset bundles. I think there's one going on right now but it's primarily 3D. I recommend Adam C. Younis's youtube channel for pixel art tips. Check out the \"ultimate introduction to godot\" tutorial on youtube. You'll know it's the one because it's like 11 hours long.",
            "score": 1,
            "replies": []
        }
    ]
}