{
    "title": "I was really dreading making a tutorial, but Godot made it so much fun!",
    "author": "LittleBigEars_Games",
    "subreddit": "godot",
    "rank": 14,
    "score": 9,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://v.redd.it/pj6mgbwvijpe1",
    "id": "1jekfqh",
    "selftext": "",
    "comments": [
        {
            "author": "LittleBigEars_Games",
            "body": "If you want to check it out, I've just released v1.4 of the demo for Glory On Pluto with the full tutorial in! [https://store.steampowered.com/app/3495250/Glory\\_On\\_Pluto/](https://store.steampowered.com/app/3495250/Glory_On_Pluto/)\n\nI wasn't sure why I thought it was going to be such a pain to do, but once I got through figuring out how to structure it, I made a really satisfying stack of tutorial nodes that I could update resources for and re-order at any time I wanted to change the flow of the tutorial. It ended up being way more pleasant of an experience than I expected.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElegantMechanic-com",
            "body": "Looks cool, will try the demo!",
            "score": 2,
            "replies": [
                {
                    "author": "LittleBigEars_Games",
                    "body": "Awesome! Let me know how you get on!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "z3dicus",
            "body": "this game looks awesome. I hate that the crt filter or whatever creates a black border around the screen. Immersion breaking, but other than that, looks sick and wishlisted.",
            "score": 1,
            "replies": [
                {
                    "author": "Miserable_Egg_969",
                    "body": "I think the border is fine but the problem is that the graphics effects go into the border instead of respecting it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LittleBigEars_Games",
                    "body": "Thanks! Yeah I’ve had mixed comments on the border. I think I’ll either ditch it or add a toggle for it in the options.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "z3dicus",
                            "body": "trust me dude, it's super bad! you'd be very hard pressed to find examples of this border on successful games. no one wants it! IIRC the most successful CRT filtered game is Loop Hero? no black border",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}