{
    "title": "My grandma worked in the 90' in chocolate factory,please help me find it.",
    "author": "MeasurementDry5145",
    "subreddit": "germany",
    "rank": 5,
    "score": 359,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 34,
    "url": "https://i.redd.it/f5jorrpckbpe1.jpeg",
    "id": "1jdom07",
    "selftext": "Servus! Been thinking a lot about my grandma who died in 2003 when I was 4 but my dad never really talked about her because he lost himself when she died of colon cancer. I know that she worked in chocolate factory in Mülheim an der Ruhr. I found this recognition for her work in my dads house but I wonder which chocolate factory was that. My mom said it was big factory back in 90's. I'd be very grateful if someone helps me. I hope they have some kind of photos of her or old archives that I can read or see.Since I had my daughter,I cant stop thinking about her and wondering how was she with her friends and colleags. Danke!",
    "comments": [
        {
            "author": "geheimrattobler",
            "body": "Well, the factory name is written there!\n\nWissoll Werke Wilh. Schmitz-Scholl\n\nextensive history: https://www.geschichtsverein-muelheim.ruhr/die-gruender-der-unternehmensgruppe-tengelmann-die-familie-schmitz-scholl/ (in German, pls use Deepl or Google Translate)\n\nThe company was transformed into Tengelmann which is a large group but the factory in Düsseldorf no longer exists. \n\nYou could contact the https://www.geschichtsverein-muelheim.ruhr/kontakt/ club that has written about the company and ask whether there is an archive somewhere but I would not expect this.",
            "score": 290,
            "replies": [
                {
                    "author": "MeasurementDry5145",
                    "body": "Oh god. I was trying my hardest to read firmen name but gave up. Thank you very much I contacted them,sent them an email,no high hopes,but I do thank you for your time and answer :)",
                    "score": 78,
                    "replies": [
                        {
                            "author": "hahaxd3",
                            "body": "so you asked them if there still have informations about your gandma? \n\n\\> i  cant stop thinking about her and wondering how was she with her friends and colleags.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "MeasurementDry5145",
                                    "body": "Yeah. If they have any info or photos of her maybe,doubt it,but tried it",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OYTIS_OYTINWN",
                    "body": "Wow, first time I see on a website of a German company an honest admission of using forced labour (even if with a weird remark that they were well-fed).",
                    "score": 9,
                    "replies": [
                        {
                            "author": "JeLuF",
                            "body": "That's not a company website. This is the local history society.",
                            "score": 90,
                            "replies": []
                        },
                        {
                            "author": "Broad_Philosopher_21",
                            "body": "All big companies have had projects with historians to investigate their past and have information about that on their websites. A few somewhat random examples\n\nhttps://www.press.bmwgroup.com/deutschland/article/detail/T0309193DE/%E2%80%9Eein-ort-der-erinnerung%E2%80%9C:-ausstellung-im-bmw-museum-widmet-sich-der-zwangsarbeit-waehrend-der-ns-zeit?language=de\n\nhttps://www.siemens.com/de/de/unternehmen/konzern/geschichte/unternehmen/1933-1945.html\n\nhttps://group.mercedes-benz.com/unternehmen/tradition/geschichte/unsere-geschichte-unsere-verantwortung.html\n\nhttps://www.rheinmetall.com/de/unternehmen/historie/zwangsarbeit-im-ns-staat",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "ViciousNakedMoleRat",
                                    "body": "https://www.krupp-stiftung.de/alfried-krupp/",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Broad_Philosopher_21",
                                            "body": "That’s not the company website though, that would be here: https://www.thyssenkrupp.com/de/unternehmen/historie",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "zirfeld",
                                    "body": "FTFY: SOME / MOST big companies. \n\nThere are still some companies and insitutions who won't do it. Billionaire Kühne for example is doing his best to not do it. His dad transported all the stuff the Nazi sstole form the Jewish people.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Broad_Philosopher_21",
                                            "body": "I’m sure there are. Kühne + Nagel is technically not one of them. They handle their past particularly bad but they did investigate their history before (like 10 years ago, https://newsroom.kuehne-nagel.com/kuhne—nagel—bekenntnis-zu-seiner-geschichte/), the current discussion is particularly based on this report.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "StockExchangeNYSE",
                            "body": ">(even if with a weird remark that they were well-fed).\n\nIt's common to say that. As a way to soften the image blow and to help appease the conscience of those that profited directly. \n\nMy grandparents/great-grandparents were pretty rich farmers back then. Not as big as the noble landowners but industrial machinery big. They absolutely used forced labour. My grandma has always justified this with \"We fed them well and saved them from death\". They don't see themselves as bad people but more akin to saviors like Oskar Schindler (not comparable and I doubt my grandmother knows who he was). Ironically part of the family ended up in a former nazi labour camp. Just now under soviet management. So in their minds they were the victims of the soviets while under Nazi rule everything was great.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "Schlummi",
                                    "body": "You are right that such statements have to be taken with care.\nPeople that treated forced laborers well often received thankfull letters from them after the war was over or even got visited by them after WW2. When there are no such letters it speaks volumes.\n\nBut for small companies and farms would I be generally careful when they used forced labour: they lost all/most of their workers (most germans got sent to war). At the same time were companies pressured by nazis to keep up production/produce war time goods/food etc. As replacement for their germans workers was the SS sending forced laborers. You still had to pay \"rent\" for them to the SS (which wasn't necessarily cheaper than regular wages). Many smaller companies weren't happy about this \"deal\" and would have prefered to keep their usual workers.\n\nThis does not apply to big companies, which negotiated terms and conditions with the SS. Many of these bigger companies profited heavily because of cheap forced labour. \n\nMany farmers around 1900 were also known to treat even their regular workers terrible (see working and living conditions of \"knecht/magd\"). So you really need to look into the details of each individual case. But rule of thumb: big players profited heavily and treated forced laborers terrible. And if a small business/farm had sudden growth during WW2 this also speaks volumes.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "EquivalentLarge9043",
                                            "body": "Pole here, existing because my abducted ancestor had a German farm family that treated their slave worker as human being.\n\nI wouldn't trust a big company if they'd say piss is yellow, slave labour was obviously a crime in itself by the German government and was often accompanied by brutal treatment or even full on extermination.\n\nYet not every German - individual or company - was a Nazi, using provided workforce during a war wasn't optional, and I'd take their claim seriously if they provide evidence.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "OwnerOfABouncyBall",
                            "body": "Nothing unusual from my experience. My company even employed historians to write about the history of the company during Nazi-Germany. There are books available about this where the use of forced labour and also its role in the production of \"Zyklon B\" is documented.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Fellhuhn",
                            "body": "Like https://www.rheinmetall.com/de/unternehmen/historie/zwangsarbeit-im-ns-staat ?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "kerenski667",
                            "body": "The slave-laborers being well-fed was by no means standard, so it does bear mentioning.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aalsammler",
            "body": "It's the Wissoll Werke Wilhelm Schmitz-Scholl (says it right on the certificate). Today it's called Wilh. Schmitz-Scholl GmbH. Here is a article about the new use for the old chocolate factory: https://www.iz.de/projekte/news/-die-alte-schokoladenfabrik-wird-zur-parkstadt-muelheim-2000000660\n\nCouldn't find any more right now. Hope this helps!\n\nEdit: you can also find pictures on the website of the Bundesarchiv (bild.bundesarchiv.de). There you can search for \"wissoll\" and you'll find pictures. (The site loads pretty slow though)",
            "score": 30,
            "replies": [
                {
                    "author": "MeasurementDry5145",
                    "body": "Thats so crazy,it took yall 5 minutes to find it,but for me I was searching for hours lol thank you very very much!!",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Aalsammler",
                            "body": "No worries! Probably really hard to read or find not knowing the language. I hope you find some nice pictures. :)",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wisstiger",
            "body": "https://www.geschichtsverein-muelheim.ruhr/die-gruendung-der-firma-wissoll/",
            "score": 22,
            "replies": []
        },
        {
            "author": "lukas_brinias",
            "body": "I have some remote connection to their (Tengelmann) current management and pointed them to your post on Reddit, asking if this is something they can help with.\n\nThey might have some people in mind who can help put you in touch with direct co-workers of your grandmother. I'll reply to this comment if they come back to me with any ideas 🙂",
            "score": 20,
            "replies": [
                {
                    "author": "MeasurementDry5145",
                    "body": "Oh wow! Im flattered :) Cant wait for your reply!! Thank you",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "tsuribito",
            "body": "I have been in there often and I have a book about the factory. I will see if I can find it tomorrow.",
            "score": 14,
            "replies": [
                {
                    "author": "MeasurementDry5145",
                    "body": "Oh wow,thank you.. Any information is good :)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "tsuribito",
                            "body": "Here are some period appropriate photos of the place from the book. \n\n[https://imgur.com/a/1EkCOv9](https://imgur.com/a/1EkCOv9)  \nMost of the post-war photos from the production spaces are from the 1950s but i doubt they changed as much until the 60s.\n\nWhen I was there, it was already converted to office space with only a small chocolate production remaining for gifts essentially. Parts of the factory were essentially museums to the history of the company. You can possibly reach out to the Tengelmann 21 people as they used to have quite extensive archives and tried to preserve the history of the company but I am not sure how much of that survived the move in recent years.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MeasurementDry5145",
                                    "body": "Thank you very much for your time!! I have this one polaroid of her and I think she was in this little lunch area. So crazy",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YouWeatherwax",
            "body": "The chocolate factory has been part of the Tengelmann Group.\n\nThe cocoa and chocolate factory Wissoll (named after Wilhelm Schmitz-Scholl) was founded in 1912 in Speldorf (which is a district of Mühlheim an der Ruhr). \n\nOn June 30, 2003, Wilh. Schmitz-Scholl Schokoladen- und Zuckerwaren GmbH (Wissoll) was taken over by the Dortmund-based confectionery manufacturer van Netten GmbH. van Netten filed for insolvency on October 18, 2012; after an unsuccessful search for an investor, the company went into liquidation in June 2013.\n\nInfo from German [Wikipedia](https://de.m.wikipedia.org/wiki/Tengelmann_(Unternehmen))",
            "score": 8,
            "replies": []
        },
        {
            "author": "LXVIIIKami",
            "body": "Ayy that's right next door from me, they now call it Parkstadt Mülheim, trying to build some new infrastructure on the old factory premises. If you need any info, my mom worked there too",
            "score": 7,
            "replies": []
        },
        {
            "author": "smndhm_",
            "body": "https://www.geschichtsverein-muelheim.ruhr/die-gruender-der-unternehmensgruppe-tengelmann-die-familie-schmitz-scholl/",
            "score": 3,
            "replies": []
        },
        {
            "author": "Skipper0815",
            "body": "Additional history about Wissol on the [Tengelmann](https://tengelmann21.com/en/company/) webpage (insolvency is missing)",
            "score": 4,
            "replies": []
        },
        {
            "author": "BenMic81",
            "body": "Here is a link about that company. Use DeepL for translation (my favourite):\n\nhttps://www.geschichtsverein-muelheim.ruhr/die-gruendung-der-firma-wissoll/\n\nAnd here (paywall though):\n\nhttps://www.waz.de/staedte/muelheim/article216189141/ausstellung-zeigt-erinnerungen-an-schokoladenfabrik-wissoll.html\n\nThe brand still exists and you can find it at Edeka afaik for example in Germany. A famous product is also these fruit gums:\n\nhttps://www.officio.de/bueroartikel/wissoll-bonbons.167088.html\n\nThey are thrown from the wagons at carnival and given as free candy at a lot of hotels or other stuff for children and adults…\n\nThe chocolote products branded Wissoll were quite common and the firm was named for the founder of Tengelmann which was a supermarket chain that sold the chocolates.\n\nHere’s a commercial from them for sale:\n\nhttps://www.ebay.de/itm/354093087632?srsltid=AfmBOooWxcFCWIsyV6rsEwkWFIbFIrz2wR5o3oPAbt__8SfR00sWWKtf",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wonderful_Net_9131",
            "body": "I was soo confused about it having the Coat of Arms of Essen, not Mülheim.\nThe respective Handwerkskammer being here in Essen makes sense tho.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}