{
    "title": "Employer Deducting Pay, Claiming My Uniform is Missing",
    "author": "middle_universe",
    "subreddit": "germany",
    "rank": 10,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/germany/comments/1jecv5g/employer_deducting_pay_claiming_my_uniform_is/",
    "id": "1jecv5g",
    "selftext": "I quit my job at the end of February and my last day is the 31st of March. Because I'm on burnout leave and quitting at my doctors' recommendation, and won't be returning to work I collected my things and turned in my keys the same day I quit.\n\nNow, 3 weeks later my employer is telling me that my uniforms are not there and I need to bring them in. I have never brought them home and I do not have them. \nAll of the office uniforms are kept in one drawer in the kitchen at the office.\nI haven't been there in weeks. How can I be responsible for what has happened to my uniform when I haven't been there?\n\nThey want to deduct the cost of the 3 uniforms from my final paycheck. What can I do?",
    "comments": [
        {
            "author": "geheimrattobler",
            "body": "You should reply to them in written form.\n\nHallo, Herr/Frau Mustermann,\n\nam xx.02.2025 hatte ich meinen letzten Arbeitstag. Ordnungsgemäß habe ich Ihnen die Firmenschlüssel zurückgegeben und meine persönlichen Dinge mit nach Hause genommen.\n\nKeinesfalls habe ich jemals Arbeitskleidung mit nach Hause genommen, daher gibt es auch nichts, was ich zurückbringen könnte. Das würde ich selbstverständlich tun, aber ich habe keine 3 Uniformen in meinem Besitz. Meiner Kenntnis nach war die Kleidung immer in einer Schublade in der Küche.\n\nNur ungern möchte ich auf einen Teil meines noch ausstehenden Gehaltes wegen dieser Angelegenheit verzichten müssen. Daher wäre ich Ihnen dankbar, wenn Sie dieses Missverständnis aufklären könnten.\n\nMit freundlichen Grüßen\nVorname Nachname",
            "score": 12,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}