{
    "title": "Journalist hit me up",
    "author": "emb_girl",
    "subreddit": "germany",
    "rank": 6,
    "score": 5,
    "upvote_ratio": 0.62,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/germany/comments/1jed2xg/journalist_hit_me_up/",
    "id": "1jed2xg",
    "selftext": "Okay so, a Journalist asked me to join a interview or a video series (I don’t know since they didn’t give me much details yet) about military - I am interested in military and they want someone who wants a career in the military (wich I want) and I thought about doing it but im not so sure. The person seems to be an actual journalist from RTL (due to her social media where the official RTL journalist’s account follows her back) but im not sure if it could be a scam or not. She asked me over my TikTok account since she saw a few of my comments under a few TikTok’s from the german military, wich is kinda suspect for me because why would u just hit up a random girl from the comment section? It is weird for me, I’m only a teenager and got hit up by a journalist (as it seems) already and I honestly don’t know what to do. I asked her to give me more information about the content they would make but theres no answer yet. I honestly don’t know if I should do it since it could ruin my future, if they post clips without context or make me seem having a weird opinion it could be picked up wrong and my future company where I work could use that against me.\n\nWhat do I do? Is RTL trustworthy with military stuff or such kinds of things? I barely watch it.",
    "comments": [
        {
            "author": "DefiantlyDevious",
            "body": "If you are interested ask for credentials and their supervisor's email (check if it's proper email). You can literally explain that it seems shady, and if they really wanna talk to you they will nake it easy tonprove themselves to you, journalists will always do that.\n\n\nIf you're not interested- ignore or block or both.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Normal-Definition-81",
            "body": "„Thanks for asking, but I’m not interested.“",
            "score": 23,
            "replies": []
        },
        {
            "author": "Vannnnah",
            "body": ">journalist from RTL\n\ndon't, RTL is mainly scripted reality and proper reality trash TV and your fear for your reputation is justified. Their \"news\" are on the same level. RTL made headlines with giving TV contracts to a prominent covid denier nutcase and his at the time barely-of-age wife for a show. You don't want your name anywhere near it.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Quirky-Plantain-2080",
            "body": "You can choose to do nothing. \n\nDoing nothing is also doing something. \n\nIf it doesn’t advance your interests, and could be a minefield, why would you go blundering into it?",
            "score": 4,
            "replies": []
        },
        {
            "author": "rewboss",
            "body": "> The person seems to be an actual journalist from RTL (due to her social media where the official RTL journalist’s account follows her back)\n\nDid she introduce herself as an RTL journalist?\n\n> why would u just hit up a random girl from the comment section?\n\nThat might depend on what you said and what her report is about. I once left a comment on a news website defending a well-known British comedian, and the actual comedian tracked me down on (what was at the time) Twitter just to say thanks. Sometimes random comments get read and are appreciated.\n\n> I asked her to give me more information about the content they would make but theres no answer yet.\n\nIf it's genuine, she'll answer your questions. If you're a minor, she'll need the consent of a parent or legal guardian.\n\n> it could ruin my future, if they post clips without context or make me seem having a weird opinion\n\nFor sure. So if you're not 100% certain about this, you can always say \"No.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "GearUo",
            "body": "Just... say 'no' and be done with it?",
            "score": 10,
            "replies": []
        },
        {
            "author": "Cirenione",
            "body": "If you are that concerned about the whole situation in regards to several issues, why entertain the thought doing it? Just say no, or ignore them. They dont force you to do an interview.",
            "score": 5,
            "replies": []
        },
        {
            "author": "AutAcademic",
            "body": "It is okay to say no",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyPigWhistles",
            "body": "I personally would not talk to trash tv \"journalists\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "score": 0,
            "replies": []
        },
        {
            "author": "CombinationEnough624",
            "body": "Do it!\n\n\nWe need to show people how awesome the Bundeswehr (German army) is to recruit younger audiences.\n\n\nThe Bundeswehr is searching for all kinds of Fachkräfte (specialist workers) and can provide loads of career opportunities.\nSince we desperately need young recruits to defend Germany against evil forces (e.g. Russia, China, Drumpf's US) and for upcoming wars, this is actually a good thing to do. Thank you for you're service!",
            "score": 0,
            "replies": []
        }
    ]
}