{
    "title": "Can my employer refuse to pay my overhours?",
    "author": "Aetzalven",
    "subreddit": "germany",
    "rank": 12,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/germany/comments/1jegbph/can_my_employer_refuse_to_pay_my_overhours/",
    "id": "1jegbph",
    "selftext": "Hello everyone, I'm currently searching for an advice and answers to questions I have about the situation I am in. \nSince I moved out to Germany I've been working in a well known brand hotel - year in housekeeping and 7 months now as housekeeping supervisor. Though the intermediary company that employs me have some ways of functioning that strikes me an odd.\nThe contract I signed very clearly states I'm earning 13,95€ per hour, yet as a cleaner I was being paid per amount of rooms done one day (e.g. we have as standard set 30min to clean one room so hourly wage = two rooms cleaned). If you spent longer working on your rooms and done overhours that time was never paid in any form.\nI got then promoted to being a supervisor and started to get paid normally for the hours I was doing, but heres where comes the fun part. \nFebruary is not the most occupied month in the hotel industry so I was getting some extra free days, I thought that was normal way of going down of the overhours we're making and that's still 100% paid time since me and my colleagues work on average at least 10h daily. This month my salary came short of 300€ to what I was normally earning. I asked my manager about it, and turns out we're still not getting any overhours paid in any way. \n So heres some questions I have:\n- If you had a job in housekeeping, how was your company paying for your work? Is it normal to always get paid for the amount of rooms done, or does some places actually pay per hour no matter how many rooms you service?\n- Can my employer provide me less working hours monthly than we actually agreed for on contract? My fiancé told me if there is not enough work for all the employees these months normally some of them could have be sent on kurzarbeit.\n- Is it legal and allowed at all, to not pay the overhours in any way to your employees? Are there any legal steps I can take?\nThank you in advance for all the words and informations on this subject. ",
    "comments": [
        {
            "author": "VariousWar2922",
            "body": "Whats written to overhours in your contract?",
            "score": 6,
            "replies": [
                {
                    "author": "Aetzalven",
                    "body": "That I might be required to do overhours if given demanding situation and that more work or failing working hours can be compensated for by shortening or extending the specified weekly working hours on other working days within one month. That's about it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VariousWar2922",
                            "body": "Okay..so no pay for overhours. Its called \"Freizeitausgleich\" in Germany",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "knitting-w-attitude",
            "body": "I'm confused. You said that February is less busy, so you aren't working overtime, right? That means your paycheck would just be your baseline rate, i.e. less than months where you are paid overtime, right? \n\n\nI'm not clear on what's happened with your paycheck. ",
            "score": 1,
            "replies": [
                {
                    "author": "Aetzalven",
                    "body": "February is less busy so I was working less days - yes, but once at work I'd still spend 9-10h there on average. From what it looks like to me I was paid only for 8h every of these days I was scheduled for, so I didn't hit the norm as I wasn't given 5 working days every week.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "knitting-w-attitude",
                            "body": "Ok, so basically you worked fewer days but still long days when you worked them. But the issue for you, if I understand correctly, is that even though you worked more than 8 hours, you were only paid for working 8 hours? Or was it that they paid you for the full number of hours that you worked but the extra hours in a given day were not treated as overtime (which is often compensated at a higher rate than standard hours)?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aetzalven",
                                    "body": "Yes, the issue is that even if I work more than 8 hours I am still only paid for 8, so all this extra time i'm spending working is not paid at all.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MyPigWhistles",
            "body": "I can't answer the first question.    \n\n\nIt's not possible to force an employee into Kurzarbeit if it's not part of the (individual or union negotiated) contract.      \n\n\nUnless your contract specifies that overhours will be compensated with payment, you can't force the employer to do so. But the alternative is to compensate the additional time by working less on other days. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Cup1308",
            "body": "I used to work in a hotel as Cleaner same as you. My contract was for minijob. And the payment rules were similar to you, depending on number of rooms one had cleaned. i think it´s normal .  \nI used to work more than minijob hours  during the peak season but receive the payment only for minijob. During the exam, I used to take break or work less than minijib hours.. But got paid for minijob.. We used to keep the datasheet and compensate accordingly.",
            "score": 1,
            "replies": []
        }
    ]
}