{
    "title": "Job finding and career developing",
    "author": "Resident-Fall5858",
    "subreddit": "germany",
    "rank": 9,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/germany/comments/1jejc1c/job_finding_and_career_developing/",
    "id": "1jejc1c",
    "selftext": "Hi there 21 years old in germany fluent german speaker, i want to work for BOSCH or any company that allows me to work and has a possibility where i can learn a profession even if i have to learn after work even i have to pay for learning i am up to it, because all my life i have worked for call centers and i dont know to do anything other than speak german in my life. What chances do i have?",
    "comments": [
        {
            "author": "mightygodloki",
            "body": "If you speak fluent German there are a lot of opportunities (in my opinion) to do an Ausbildung. I work for a bank and I see a lot of young people like yourself who have joined to do an Ausbildung. Maybe you could do that. As far as I know there are a lot of positions open for Ausbildung if you keep your mind open about what kind of training you want to do for ex. Banking, software etc.",
            "score": 2,
            "replies": [
                {
                    "author": "Resident-Fall5858",
                    "body": "I need to be working i cant do a ausbildung because the wage is very low",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Anagittigana",
                            "body": "You will forever be paid minimum wage without any qualifications. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "\n**Have you read our extensive wiki yet? It answers many basic questions, and it contains in-depth articles on many frequently discussed topics.\n[Check our wiki now!](https://www.reddit.com/r/germany/wiki/index)**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/germany) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}