{
    "title": "I have a cat- when can my dog start sleeping out of the crate?",
    "author": "Ok_Working2093",
    "subreddit": "Dogtraining",
    "rank": 399,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i4ysov/i_have_a_cat_when_can_my_dog_start_sleeping_out/",
    "id": "1i4ysov",
    "selftext": "For reference, I adopted my cat 2 years ago and adopted a 2 year old dog 6 months ago. I have been working with trainers with my dog and he’s really such a good boy. Originally, I had him in the crate a lot, and then we started crate and place, and now he still in his crate, and spends time on place, but he also gets to roam around a bit(with a leash). (My cat is free roaming)\n\nThey have been introduced, but my dog loves to play and so now when he’s roaming and sees my cat- he goes up to him a bit excitedly and wants to sniff him/play(not all the time). I’ll let my dog sniff my cat a bit, but when my cat walks away i tell him to leave it. My cat doesn’t seem super interested in him. \n\nBasically, my concern is if I let my dog start sleeping in the bed with me- which my cat already does- i’m scared that he might try to play with him OR (biggest concern) that my cat will be uncomfortable/stressed because obviously cats love their space. (There has been ONE occasion where i fell asleep while he was out of the crate and he just slept on the ground by me the whole time, but still)\n\nSo does anyone have any advice for this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Ok_Working2093",
                    "body": "I read the wiki for introducing dogs and cats, which I have done, but my question is more about when I can let my dog sleep out of the crate, since I also have a cat and I want to respect my cats space as well",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}