{
    "title": "What resource/video did you learn a focused heel from?",
    "author": "uwlee96",
    "subreddit": "Dogtraining",
    "rank": 139,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iimnea/what_resourcevideo_did_you_learn_a_focused_heel/",
    "id": "1iimnea",
    "selftext": "Training for our PDC and need good videos to follow for competition heeling. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rebcart",
                    "body": "Fenzi is good, the other trainer you mentioned we would not recommend per Rule 2.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silent-Rhubarb-9685",
            "body": "Fenzi!",
            "score": 1,
            "replies": []
        },
        {
            "author": "therealcimmerian",
            "body": "I didn't.   Did it myself.   Spent a lot of time just saying name if they look reward.    Then with heel walking say the name look gets reward.  Next reward is on my chest and the focused heel begins. A few steps and reward a few more and reward etc.   Your goal is to get them to be looking at you the entire time they are walking.  The treat on the shoulder is to get their attention.   You then move to there being no treat there and just your fingers are on your shoulder.  It gets to where you just say look or whatever command you choose makes them watch you and focus heel",
            "score": 1,
            "replies": []
        }
    ]
}