{
    "title": "Why is my dog sometimes ok home alone but other times not?",
    "author": "Escapetheshape",
    "subreddit": "Dogtraining",
    "rank": 107,
    "score": 22,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ijwvz3/why_is_my_dog_sometimes_ok_home_alone_but_other/",
    "id": "1ijwvz3",
    "selftext": "When Otto was 5 months he was fine being alone for about 3 hours, no matter the time of day. Thanks to a lot of training with leaving him alone for longer and longer periods of time.\n\nAt 8 months he suddenly wasn't at all anymore. So we started the training all over again. 5 minutes alone, 10 minutes and so on.\n\nNow, at 1 year and 3 months, 85 % of the time he's fine home alone for 3-4 hours if we first go for a long walk in the early morning, then leave him alone downstairs for about an hour and then leave the house. But if we do the same ritual any other time of the day that's not the morning, it doesn't work at all. He howls, barks, paces, ...\n\nWe don't know what to do anymore. We feel like we've tried everything: training of couse, lick mat, crate, thundershirt, calming music, boring arrivals, silent departures, closing the blinds, ... And sometimes he's totally fine alone so I'm at my wits end. Help?!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "* **Plan to leave them somewhere they are comfortable.** \\--> doing this\n* **Make your departures unremarkable. Make your arrivals boring.** \\--> doing this\n* **Tucker them out!** \\--> doing this\n* **Get outside help!** \\--> doing this but not always possible, dog walker is not enough and we can't always get a pet sitter or family member to be in our house\n* **Train and practice independence.** \\--> Done\n* **Offer up some attractions.** *-*\\-> Doesn't work and chew toys are not for him since he bites through anything so I don't leave him with them unattended\n* **Prevent unwanted distractions from stimulating your dog.** \\--> Doesn't work\n\n* **Identify the triggers.** \\--> I don't see them. We follow the exact same ritual every time. But it just not being morning seems to be a trigger by itself. Although mornings don't work 100 % of the time either.\n* **Control and manage exposure to the triggers with desensitization.** \\--> Have tried this a bit but could do more. Although again: sometimes he is fine with us leaving so the triggers apparently don't always trigger him.\n* **Fake 'em out.** \\--> Done\n* **Do not leave food or chews for the dog**. --> We don't anymore\n* A behaviourist may also suggest an appeasement pheromone or an anti-anxiety wrap in cases where there's no risk of harm to the dog. Early intervention is important. --> Doesn't work",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unfair_Flow8911",
            "body": "Are you using a crate or is he just roaming the house?  Sometimes they feel like they are protecting and guarding the house and if you’re in a busy area, there’s always something to defend against. Crates or at least confining the area sometimes help reduce their stress because they don’t have such a big area to guard. Not sure of the breed of the dog but this is sometimes hard wired so draining energy and limiting space is a good tactic to see if it helps",
            "score": 18,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "He's a border terrier in stays in a fenced off area of the living room. We tried the crate but he didn't respond to it well at all when left alone. He's okay in there at night and when he was younger he'd nap in there a lot. But staying alone it it seemed a no go.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Feeling_Charity778",
                            "body": "Recondition the dog to make crate a positive experience",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChickenVest",
            "body": "We had the same issue, we regressed a lot at the same agd, so we started back at the basics and my dog loves his crate more than ever. He is waiting for me to put him in it when he sees us put our shoes on. It has been great. I'm now starting to put him in his crate but leave the door open. So far so good",
            "score": 6,
            "replies": [
                {
                    "author": "Onetruegracie",
                    "body": "Puberty can often cause a second \"fear phase\" in dogs where they become overly cautious again, its a survial mechanism so they are cautious during the period they are fully separating from mum.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Lizdance40",
                            "body": "YES!   Most dogs don't fully mature till their second year.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Escapetheshape",
                    "body": "Good for you that things are starting to go better again! The crate doesn't seem to work for our dog, at least not to stay home alone. He whines much more in there. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "-kykypy3ka-",
            "body": "Dogs love rituals, and repeating the same activity at a different time is no longer a ritual - it becomes a source of stress. If you usually take long walks in the morning but suddenly take one in the afternoon instead, your dog may think that something is wrong, causing stress levels to spike.",
            "score": 6,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "I hadn't looked at it that way. I thought it was good to do the same ritual and make sure he's recently had a decent walk. Would you suggest I then don't walk him before leaving?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "-kykypy3ka-",
                            "body": "No one knows your dog better than you. I was simply pointing out that you’re right: dogs need rituals, but  changing the time of their walk breaks that ritual.  I can also assume the sleep disruption, due to a more stressful outside (more traffic, more people etc) during later hours.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Antique-Professor263",
            "body": "6-18 months is adolescence in dogs. Fear and anxiety can make an appearance during this age.",
            "score": 3,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "Unfortunately 🥲 I just don't know if it will get better still. And I can't keep staying home all the time until he's mentally an adult (at 2,5 years for his breed).",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Greigebananas",
            "body": "It's good he's ok with being alone at all. I'd gradually expose him to tiny two second moments of being alone without the routine. Like if possible just walk out the door without even putting on your shoes, turn back after closing it after a couple of seconds, and go back in preferably before the panic. Then eventually he would learn sometimes you guys leave without the usual ritual but you'll be back before it's scary\n\nI'd also contact a positive reinforcement trainer",
            "score": 2,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "Hmm, I might try this. I thought routine was good but maybe it's too much now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Greigebananas",
                            "body": "Routine is good but too much can cause some problems too. Like say you feed them 8am every day. You might end up with a dog barking angrily at you at 8am one day you're unwell with the flu and struggling to get out of bed. It depends on the dog too of course",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WittyNomenclature",
            "body": "8 month olds are doing a lot of brain rewriting, and weird stuff can happen. They really aren’t settled until 18 months or more, depending on the breeds and personalities. \n\nWhen regressions pop up, go back to basics. Don’t give up! A settled dog is so worth all the earlier stress.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RegularFun3",
            "body": "He’s a teenager maybe? He’s neutered?",
            "score": 1,
            "replies": [
                {
                    "author": "Escapetheshape",
                    "body": "Yes he's a teenager, not neutered though. The breeder told us it's best not to for his health. ",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}