{
    "title": "Dog is overly excited to go to new places (New dog owner)",
    "author": "BreadSeason",
    "subreddit": "Dogtraining",
    "rank": 72,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1imdp2o/dog_is_overly_excited_to_go_to_new_places_new_dog/",
    "id": "1imdp2o",
    "selftext": "Hi! My pup is turning one, and he is right in his adolescence. I need some advice!\n\nMy dog learns fast and listens pretty well. However, when I bring him to places, he becomes hard to manage as he gets wayyy too excited, not following or listening to us. We make sure to take a walk and play with him before we head out, but it doesn't seem to help. He's gotten more reactive for a lil while, so maybe it's a phase, but I'd rather work on it with him. \n\nToday, I brought him to the pet store. He was SO excited to go. In the car, screaming/whining (he does that when he's very happy), outside the car he was still screaming and tugging at the leash. I didn't let him go to the pet store right away, as I was trying to calm him down first by asking him to sit down. He could hardly sit still for more than 2 seconds, and he would continuously scream and whine. I understand he's super excited, but I can't imagine what the other people around think is going on when they hear his banshee screams, lol.\n\nAsking for some advice I can try it before contacting my dog trainer! Thanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "BreadSeason",
                    "body": "Question not answered in guide. I have looked at the impulse control stuff and calmness stuff, and have already practice those with my dog at home. He is great at them!But he lacks that outside the home and with specific triggers\n\n He is also tired out with exercise before we go out with him to try to minimize his excitement, to no avail\n\nMy dog is perfectly healthy and gets checked periodically.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZZBC",
            "body": "Break it into steps. Can he be calm and focused on your front step?  In the front yard?  In the car in the garage? And practicing going new places and making it boring. Go and just sit in one spot. Do nothing other than reward relaxation.",
            "score": 3,
            "replies": [
                {
                    "author": "BreadSeason",
                    "body": "He can stay pretty chill around the house and our yard and all.\n\nBut the making the outing boring is a good idea! I think his behaviour got worse ever since winter began, maybe because we never have \"sit down and do nothing at the park\" anymore. When spring rolls around and it gets warmer, I'll go make him do long boring activities, eheh.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "looseleashdog",
            "body": "My dog used to get like this going to the vet. He loves the vet! Something I did was take him to the budling when they were closed. One, to save me from embarrassment, but also to teach him that just because we go there doesn't mean you going to see your best friends. It really makes it easier to take your time and work on relaxation protocols if there isn't anyone else around.",
            "score": 4,
            "replies": [
                {
                    "author": "BreadSeason",
                    "body": "Oh, that could be good to try! My boy also loses his mind at the vet because he loves them so much, they are closed on Sundays so I could go train then. Thanks for the suggestion!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adorable_Warning_785",
            "body": "Love the other two comments but also came to say make sure Youre also using higher value snacks for harder asks. I used fish skins exclusively for recall because it was important to me snd my dog is a beagle mix so she struggled with it. Rewarding for calm in small steps like the other comment suggested and also remembering in new environments, you’re gonna have to step back to level zero because they’re going to be exciting all over again. Practicing when it’s closed is great. I would even suggest not bringing them into the store until they were able to be calm in the parking lot. Just work on it in the parking lot then bring them home and try again until you’re able to get them into the store. Maybe you’ll only be able to get 10 feet into the store then bring them home but they’ll get better every time",
            "score": 2,
            "replies": [
                {
                    "author": "BreadSeason",
                    "body": "Oh, that's true about the snacks. I'll bring him some new snacks for when I go train with him! Thank-you :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Horsedogs_human",
            "body": "I agree with the other comments - go when it is closed for a start, and break it down into smaller steps. \nAnother thing I have done is instead of asking for a sit, I walk a figure 8. Just a small one - even with my large breed dog we can do the figure 8 pattern in a space smaller than an empty car park. I also use this to move further away from the exciting place, and gradually return if calmness remains.",
            "score": 2,
            "replies": [
                {
                    "author": "Horsedogs_human",
                    "body": "This may mean that the excursion is to an empty carpark, where we park on the opposite side to the \"fun place\" and we only get half way there before we leave again! \n\nIt goes get better with practice.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BreadSeason",
                    "body": "Thank you for the suggestion! I'll go try that out this weekend with my dog :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Horsedogs_human",
                            "body": "My 10 month old rhodesian ridgeback seems to be able to focus better if he is moving, so the figure 8's start from there.  When my first ridgeback was about the same age, it once took us 30 minutes to get 50 m from where we had parked to the river where we were meeting our friend.  We did a huge amount of circling, turning around and walking away and so on to until he was able to remember how to keep his shit together!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}