{
    "title": "First 3 days of 3-3-3",
    "author": "Fit_Substance2514",
    "subreddit": "Dogtraining",
    "rank": 61,
    "score": 19,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1imhmrv/first_3_days_of_333/",
    "id": "1imhmrv",
    "selftext": "I adopted a 3-year-old Jindo mix girl a couple days ago, and we’re on day 2 of 3 of the 3-3-3 rule. The rescue strongly emphasized this and, given that she’s quite anxious, I want to make sure I’m adhering to it.\n\nThat being said, I’m finding she’s very much seeking out affection when she’s out of the crate. Her foster said she’s a very sweet girl who loves a good ear scratch, and I’m finding that’s so, but I want to make sure I’m striking a balance between honoring to hands-off approach to the first 3 days and not denying her affection-seeking impulses. We’re meeting with a trainer over the next few days as a requirement of the rescue and will address this all then, but I wanted to put it to the internet first.\n\nSo my question is: How much should I be ignoring those behaviors? Should I be? Or is she establishing a level of comfort that I should encourage?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Fit_Substance2514",
                    "body": "I have found information about the importance and flexibility of the 3-3-3 rule, but nothing about the first 3 days specifically.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "duketheunicorn",
            "body": "The 3-3-3 thing is a guideline, not a rule, if the dog would like to be physically affectionate, let them lead the way! Just practice consent checks—pet a few times, then stop and look for the dog to lean toward you, look at you, poke you or in some way encourage you on. If they stay still or leave, they’re done.",
            "score": 51,
            "replies": [
                {
                    "author": "RoamingDad",
                    "body": "My dog isn't super affectionate so I always consent check after a few pets. Usually she's like \"yep that was fine but I'm done\"which is sad...  but occasionally she'll force her nose under your hand and demand more and I love that we do consent checks because she's making it so clear she wants my love at that moment. 🥰",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "colieolieravioli",
                    "body": "Totally this\n\nThe guideline is more of a \"hey sometimes dogs don't show their true selves for a while, be patient\" \n\nLet the dog lead the way. If pup comes to you, you say \"yes pup this is good I am good, here have some love\"\n\nI think back to being 9y and my brother and I got gerbils. To anyone unfamiliar, gerbils will pop off the end of their tails (a one time defense) under extreme duress. Well us idiot kids learned about this defense mechanism day one and I don't think we were doing anything too wild, just too much for day 1.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Darth_Phrakk",
            "body": "As long as you’re not the one forcing the interaction, it’s all good. You shouldn’t ignore her when she comes to you.\n\nIt’s just about allowing her space if she wants it and not forcing her to come to you. Kids have trouble with this, so I think that’s why it’s so emphasized.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Accomplished-Wish494",
            "body": "IME if the dog is seeking attention, you can and should provide it. You should avoid soliciting it, bribing, or cajoling. You can/should discourage really needy behavior like climbing up onto your lap or whining. Basically if you wouldn’t want to dog doing it this time next year, don’t allow/reward it now. \n\nFor timid dogs that are hiding, absolutely pretend they don’t exist. That doesn’t sound like your dog though!",
            "score": 14,
            "replies": []
        },
        {
            "author": "Rainier_Parade",
            "body": "Look up consent tests. As long as you're letting the dog initiate and check in often while you're petting I think you should be good :)",
            "score": 6,
            "replies": []
        },
        {
            "author": "PrettyLittleSkitty",
            "body": "Could I ask how the rule was described to you and their recommendations? Not to imply they’re somehow wrong, but it might be helpful for clarification purposes! I love that your rescue educated you with this. \n\nTypically in the first 3 days, this is something you’d want to see. If your new dog is intentionally seeking out attention and affection in this way, I’d recommend giving that to her in respectful ways! Consent checks are also great (ex; stopping petting to see if she initiates again) for confidence building. It’s really awesome that you’re going at her pace and not rushing, but you don’t have to withhold attention/affection if she’s seeking it in an acceptable way. \n\nI usually recommend to folks that in the first three days, plan to be at home and create a relaxing, inviting space for the dog to explore and decompress. Allowing them to go at their own pace with seeking out their new humans can be great for confidence building. This is a great time to introduce the first steps for cues like “watch me” (eye contact on a cue) and “touch” (target touching the hand”, also for confidence building. Some pups find eye contact and initiating touch to be a little intimidating, so setting up small training sessions that coincide with meal times can help with this; while also promoting bonding, mental enrichment, etc.",
            "score": 6,
            "replies": []
        },
        {
            "author": "None",
            "body": "The most important thing in the first few days of rescuing a dog is not 3-3-3, it is so well intended but as you go through your dog-owning journey you will soon find out that nothing is a one side fits all. I think it's way more important to focus on expectations, not what you expect of them, but what they can expect of you. What do you want them to know you for? What boundaries do you have? When an anxious dog knows that you are there to help them meet their needs, you've got a good thing going! -E x",
            "score": 3,
            "replies": []
        },
        {
            "author": "significantotter1",
            "body": "If she's seeking out affection I don't think there's anything wrong in giving it to her! Something you can do though if you're feeling unsure is a consent test. I found this blog post really useful when we adopted our girl a couple of months ago because she was also pretty affectionate with us from the jump\n\nhttps://eileenanddogs.com/blog/2012/08/29/does-your-dog-really-want-to-be-petted/",
            "score": 2,
            "replies": []
        },
        {
            "author": "Otherwise_Mix_3305",
            "body": "If she is seeking affection from you, please give her affection! This is a good thing. It means that she trusts you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OnyxNoire",
            "body": "We are 1 month in to the 3-3-3 rule, our 9 month old little rescue mongrel (we are not sure what mix she is but she is so cute - deffo SBT in there). Her little personality is shining through and honestly feel she knows she is home now which is usually at the 3 month mark. Still we are letting her adjust at her own pace and making the boundaries clear. One thing I am still doing is not allowing her to always dictate affection engagement as to not develop any form of separation anxiety and also make my comings and goings in and out of rooms as boring as possible. When she hints that she wants a scritch while I am reading on the sofa, I wait for her to get bored and settle down. After a few minutes of her being calm in her basket, I either get up and sit with her and give a jolly good fuss or call her over. It is a good balance and she has learnt quickly to settle down herself without feeling neglected. Next is trying to mask the sound of the treat cupboard as she tends to teleport under your feet while in there (cold storage room so has our dry goods and hoovers in there too!).\n\n(edit: When I say I ignore her request for affection it is now a 50:50 ratio (previously 80:20)  - maybe sometimes more in her favour as who can resist those big eyes when the head is on your knee! she is such a snuggle bug, she would live on your lap if you let her :D)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fit_Substance2514",
            "body": "Appreciate all the advice, folks! She’s doing really well and is growing more confident as the days go on. She’s definitely into pets and encourages us to keep going when we stop by nudging or pawing at our hands. The trainer we met with agreed she was ready for more engagement, and she even learned “sit” and “down” in about 10 minutes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "R_Eyron",
            "body": "For my fosters so far the 3-3-3 rule has held true, but in the sense that the first 3 days is about decompression and for most of them that means forming a new bond with their caretaker and getting reassurance that everything will be okay. One was really shy and needed the 3 days of being mostly ignored, but the rest really needed that affection before they were confident to be a bit more hands off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kimchimandu",
            "body": "We had the same issue with our Jindo when we first got her. Days 1-2 she was very skittish and wary, and even growled/lunged at us when we would go to let her out of the crate. Then day 3 she stopped doing that and started rubbing her body and head on us which looked like she was looking for pets. We consulted our trainer and she said that this was very common behavior and to refrain from giving in and petting her during the first three days to even the first week. \n\nHer reasoning was that your dog is still going to be decompressing and anxious even if she doesn’t show it. And the anxiety may present itself in submissive behaviors such as rubbing her body or head on you and licking you. If you start petting/scratching ears, which are positive interactions WHILE she is still very anxious/nervous, she might end up associating your petting her with her anxiety. \n\nWe actually waited a full week until we would pet her, even when she initiated physical contact and after 3 weeks, we started initiating petting/rubbing ourselves and now she loves it AND she doesn’t come to us immediately for affection when something else triggers her anxiety. She will go to her crate to self soothe.\n\nYou don’t have to discourage her attention-seeking behavior but my advice would to be as sterile as possible in your interactions with her at least in the beginning. Your trainer will likely have more specific advice based on meeting her and seeing where she’s at.\n\nIt’s sooooo hard because she’s probably sooooo cute, but I think ultimately it will be for the better to not give in to the pets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aubs7",
            "body": "The only reason I would ask someone not to engage with their dog is if the dog is becoming more anxious or aroused during the interaction. If that were the case, I would ask them to determine how to change the interaction to ease the dog’s anxiety rather than contribute to it. If there is a behavior that you don’t like (like jumping up), you can always interrupt and redirect to the positive solution (sit here instead and get food). But you don’t need to ignore behaviors that you want to see more of. If the attention-seeking seems needy or anxious, perhaps there is more to think about there. If it’s sweet and gentle, no issues! You’re establishing that comfort in each other, just like you said. The first three days “rule” is just a reminder that it might take a few days for your new dog to begin to settle in and not be on such high alert — by day three, they have usually learned to regulate any new stressors and have processed the changes in their environment. It's also about “decompression,” which means allowing the dog to decompress from past stress and regulate the new stress without adding additional pressure. It sounds like you're doing a great job 😊. If she was in a foster home, she is probably already a bit adjusted. If you’re hanging and she’s coming up for scratches and pets, that’s great! Like everyone says, practice the consent test to see if she’s still into it. I would also be sure to practice “alone training,” whether that’s starting with a gate, separate room, or crate. 🤍",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Cursethewind",
                    "body": "Please do not invite people to message you privately. It robs other sub members of the benefit of your advice and prevents the mods from being able to filter out bad advice.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}