{
    "title": "Need Help/Tips For Training a Rescued Puppy – Want to Keep Him as a Support Animal",
    "author": "spicyoral",
    "subreddit": "Dogtraining",
    "rank": 55,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1in5vk2/need_helptips_for_training_a_rescued_puppy_want/",
    "id": "1in5vk2",
    "selftext": "I known nothing about dogs, i've never owned one, I would also welcome general advice and tips if anyone has any!!\n\n**Problems I Need Help With:**\n\n1. **Barking for Food & Treats** – He barks non-stop whenever I eat and constantly demands treats.\n2. **Harness Freakout** – He attacks me when I try to put a harness on him.\n3. **Leash Pulling** – He pulls so hard on the leash and collar that I worry it will hurt him.\n4. **Chewing Everything** – He ignores all teething toys and chews on anything else he can find.\n5. **Is It Even Possible to tire out a puppy!?!?!?**\n\n**Background:** I found a cockapoo puppy (estimated 16 weeks old) abandoned in the loading bay of my apartment building. He was filthy, freezing, and barely moving. I took him in, warmed him up, fed him, and got him to a vet the next morning. He was malnourished with a minor infection but otherwise okay.\n\nI’ve now chipped him and gotten most of his shots (just one more before puppy school). He’s an incredibly loving and energetic little guy who follows me everywhere, sits on my desk while I study, and never runs out of energy.\n\n**Why This Is Important:** I’m a university student with a hectic schedule and live alone in a dog-friendly building. I desperately want to keep him, but I need to train him well enough to register him as a support animal so I can take him to class and on campus with me. If I can’t do this, he’ll be alone too often, which isn’t fair to him. (already got the okay from the university - IF hes registered)\n\nAny advice on positive training methods to address these issues would be greatly appreciated. What has worked for you in similar situations?\n\n\n\n  \n\n\n**Full Story for Those Interested:** I found this little guy one evening, freezing in the loading bay of my apartment building. He was filthy, barely moving, and clearly abandoned. He let me pick him up, so I took him inside, fed him, and warmed him up. After a bath, he became much livelier. I made him a laundry basket bed for the night and took him to the vet first thing in the morning.\n\nTurns out he’s a cockapoo, about 16 weeks old. He was malnourished and had a minor infection but was otherwise healthy. Now, he’s chipped and almost fully vaccinated. He’s an absolute menace, but I love him with all my heart. He shadows me everywhere, sits on my desk while I study, and never runs out of energy.\n\nI want to do right by him, but I need to make sure I can meet his needs. Training is my top priority, and I’d love any help or advice!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "spicyoral",
                    "body": "I  read  the relevant wiki pages on: barking, leash walking, chewing, and harness training. Here’s what I’ve already tried and where I’m struggling:\n\n1. **Barking for food/treats** – I’ve read the wiki on barking and have tried ignoring him, rewarding quiet behaviour, redirecting him with a chew toy, but he continues to bark persistently.\n2. **Leash pulling** – I’ve tried stopping when he pulls and rewarding loose-leash walking, but he still lunges forward constantly.\n3. **Chewing** – I have provided a variety of teething toys, but he ignores them and chews on furniture, cables, and shoes instead. **he also LOVES the bitter / anti chew spray. I swear this man would drink it if i let him**\n\nANSWERED:  \n**Harness issues** – I have not followed the desensitization steps by introducing the harness slowly with treats, i will implement this right away .\n\n**Since I’m trying to train him as a support animal, I want to make sure I’m using positive training methods and addressing these behaviors properly. Any additional guidance would be greatly appreciated!**",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}