{
    "title": "TVesday Thread",
    "author": "AutoModerator",
    "subreddit": "CasualUK",
    "rank": 0,
    "score": 6,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 50,
    "url": "https://www.reddit.com/r/CasualUK/comments/1jdzc2d/tvesday_thread/",
    "id": "1jdzc2d",
    "selftext": "Morning all. What TV shows and/or movies have you been watching this week? Have you enjoyed them? Come in and tell us all about it.",
    "comments": [
        {
            "author": "dedido",
            "body": "Waiting for the finale of Severance to not answer any questions.",
            "score": 13,
            "replies": []
        },
        {
            "author": "trotzki",
            "body": "Marianne. It's a French horror series on Netflix. Great storyline and some truly terrifying scenes. Highly recommend for horror fans",
            "score": 8,
            "replies": []
        },
        {
            "author": "TeenySod",
            "body": "Resident Alien on Netflix right now - bit of a one trick pony with Alan Tudyk making funny faces. I like Alan Tudyk though and there's enough to keep me interested for now as far as 'light watching' goes.",
            "score": 8,
            "replies": [
                {
                    "author": "MrTwemlow",
                    "body": "I've been watching this too, I love it. Yeah, his funny faces are a bit over the top sometimes, but I do like the humour in it.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "a-liquid-sky",
            "body": "**Adolescence**. Bloody brilliant.",
            "score": 12,
            "replies": [
                {
                    "author": "itsmattp",
                    "body": "Am I right in thinking a lot of the series was done in one take?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "a-liquid-sky",
                            "body": "Each episode was done as one take, I believe.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "itsmattp",
                                    "body": "Impressive, i would hate to the be the one who made a mistake!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_QuirkyTurtle",
                    "body": "Unbelievable watch. There’s some behind the scenes videos doing the rounds and it’s so interesting how they captured some of the stuff.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "E-Step",
                    "body": "I was really surprised the final episode >!didn't turn out to be a courtroom drama!<\n\nAlso having just watched 1000 Blows it was funny to see so many of the same cast all over again",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tocitus",
                    "body": "It's honestly incredible.\n\nJust finished episode 3 and think that might be one of the best things I've seen on TV in a long time. Probably the most I've ever liked an episode of TV since \"Long, Long time\" episode of The Last Of Us.\n\nHonestly, the idea of the weaponisation of young men against women is something we've been talking about in my friendship group for a while due to recent events, and this series captures the danger to a whole new level.\n\nIncredible TV",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PiggieSmalls-90",
                    "body": "I'm watching this but struggling to stay. The Phycologist is annoying me lol.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Parking_8",
                            "body": "really, that was the best episode in my opinion. Erin Doherty is fantastic in it.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "X_Trisarahtops_X",
                                    "body": "Me too! The range of emotions that episode had me going through was crazy. For an episode that is largely just 2 people having a chat, it was incredibly gripping.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "StumbleDog",
            "body": "**Beau Is Afraid** Wasn't sure about this at first but absolutely loved it by the end, been thinking about it a lot since. I think it's the sort of film where I'll notice  even more details with each re-watch. Had some really crazy dreams that night though. \n\n\nE1 S1 of **Severance** because it was available free on Amazon. No idea when I'll be able to watch the rest but I enjoyed it. Did seem a little predictable so far but still interested in seeing more. So far it also reminds me quite a bit of **Maniac** on Netflix so I'd like to recommend that if you haven't seen that yet. \n\n\n**The Matrix**. I'm sure I watched this not long after it came out but I didn't remember any of (apart from the famous bits). Thought it might have aged terribly,  esp considering how much it's been satirised and lampooned but it's still brilliant. I loved it. SFX still hold up, awesome soundtrack. \n\n\n\n\nRewatched **Snowpiercer**. I just adore this movie. ",
            "score": 6,
            "replies": [
                {
                    "author": "Rock_Me-Amadeus",
                    "body": "The Matrix holds up really well IMO. Some of the CGI looks ropey now and the bullet time stuff looks pretty primitive but that's only because it's been done better since by people who developed on the ideas. Standing on the shoulders of giants and whatnot.\n\nStory wise I still love it",
                    "score": 7,
                    "replies": [
                        {
                            "author": "DogmaSychroniser",
                            "body": "I regularly watch it over and over. At least once a month.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Braythor_",
            "body": "Not really seen much recently, though I did watch **Sisu** last night, and that was pretty damn good. Bit like a Finnish mash up of John Wick and Inglourious Basterds.",
            "score": 5,
            "replies": []
        },
        {
            "author": "neohylanmay",
            "body": "I know this isn't the Thursday thread, but it's TV related and I need to whinge.\n\nITVX's desktop player needs keyboard shortcuts. I should be able to pause the video by hitting Space instead of faffing around with the mouse to click on the world's smallest pause button.\n\nOn the plus side, still enjoying **Captain Scarlet 2005**.",
            "score": 5,
            "replies": []
        },
        {
            "author": "jsosmru",
            "body": "Worth checking your Tesco clubcard account to see if they've given you free 3 months of Disney+ with ads, I got it recently, and last year too. I don't know if guaranteed for everyone, but just mentioning.\n\n\nWatched and enjoyed:\n- friendly neighbourhood Spiderman \n- Buffy (finished seasom 4)\n- angel, nearly finished Season 1.\n- older Spiderman, I think 1994, watched some as a teen.\n\n\n\n- not enjoying the new daredevil that much, but will give it a chance. \n- didn't like Moana 2 that much",
            "score": 4,
            "replies": [
                {
                    "author": "Rock_Me-Amadeus",
                    "body": "I found Buffy aged pretty badly and definitely suffers from the \"Seinfeld isn't funny\" effect (TV Tropes). The Whedon dialog is very cheesy.\n\nBut there are still so many good moments.\n\nI always thought Angel surpassed it in every way",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Kisrah",
                            "body": "I wasn’t a big fan of Angel when I first tried to watch it, but I gave it another try with a box set a few years ago and damn. I love BtVS, but Angel is the better series.\n\nI always thought the vamp faces looked off in the first season though. Like they were using CGI instead of practical makeup?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "drempire",
            "body": "Silent sea, South korean show about earth loosing its water & we all get allocated a specific amount of water depending on our pay grade. \n\nKorean scientist discoverd water on Luna (moon) that could help the water shortage on earth.   But the water is not water as we know it on earth.\n\nWont give to many details as it is a brilliant show and any more details will spoil the show",
            "score": 3,
            "replies": [
                {
                    "author": "aGoryLouie",
                    "body": "I've had Silent Sea on the watchlist for years now, will get it watched by end of the week\n\nIt'll at least fill the gap until the end of this seasons Severance",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Cow_3431",
            "body": "Finished **The Other One** last night, think we did both series in the space of a week. Good, inoffensive TV  \n  \nSlowly working through **Reacher** but S3 is quite painful with all jarring CGI  \n  \nWe (along with half the UK it seems) started **Adolescence** last night. Fuckin hell it's a bit uncomfortable isn't it. In absolute awe at the fact that each episode is single shot/take, that takes some serious planning and professionalism, especially when working with kids",
            "score": 4,
            "replies": []
        },
        {
            "author": "DogmaSychroniser",
            "body": "I wanted to watch Community but it's off Netflix where I am. Ended up alternating between Simpsons and Sense8. Recently watched Nobody Wants This , which was good. Atypical was good too, I rather liked the fella though it felt like it ended a bit weak. Love with Gillian Jacobs was pretty great. Slogging through Buffy season seven mostly out of a completist desire than any joy. \n\nWriting all that out I realise I watch a lot of TV during the work day in the background! 😂",
            "score": 4,
            "replies": [
                {
                    "author": "J8YDG9RTT8N2TG74YS7A",
                    "body": "> I wanted to watch Community but it's off Netflix where I am.\n\nYar har fiddle di de.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "E-Step",
            "body": "Mickey 17 - found it a bit all over the place but it was very funny and enjoyed Pattinson in the lead(s) \n\nMonkey - completely hilarious\n\nDaredevil Born Again - really enjoying this one being back",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rock_Me-Amadeus",
            "body": "Reacher (love it, much better than season 2)\n\nDaredevil Born Again (also love it, third episode was especially good)\n\nThe blacklist. I somehow got it into my head I wouldn't like it so nevee watched, but I was hooked as soon as I started. Watching James Spader chew the scenery never gets old\n\nRewatching The Expanse and Lower Decks for the umpteenth time",
            "score": 3,
            "replies": [
                {
                    "author": "ohnoheforgotitagain",
                    "body": "My mrs was really in to Blacklist and whenever I saw it James Spader's character seemed deeply annoying - is it actually good?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Rock_Me-Amadeus",
                            "body": "Well I think so, but if you find James Spader annoying then you won't like it. Watching him James Spadering all over the place is the best part.\n\nThey quite often shoehorn in some political point, similar to Boston Legal and those moments can come across as preachy.\n\nThe other characters can be a bit bland. Harry Lennix is good but I might be biased because I loved him in Dollhouse.\n\nI enjoy the senseless violence. They're not shy about just killing people.\n\nThere's also an overarching mystery about who the protagonist's father is which they've so far dragged on for four seasons and it's starting to get old.\n\nI'm not painting it in the best light but in the vein of crime procedurals like Law & Order, Chicago PD and so on I would say it holds its own",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ohnoheforgotitagain",
                                    "body": "Thanks, I'll give it a go!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tigralfrosie",
            "body": "Not been a lot of TV that I've been drawn to recently. May I stretch the thread to extend to radio? For a change, I've been listening to a (literally) fantastic series hosted on BBC Sounds which takes inspiration from the fantasy/horror world of HP Lovecraft and presents new stories in the form of a podcast. I found what I initially thought was a gimmick to be a clever and effective method of delivering multi-character, multi-plotline stories which I would otherwise have found a struggle to keep up with; the podcast narration, exposition and recap is blended with realistic dialogue/sound engineering.\n\nThe series is called The Lovecraft Investigations and has been out for a few years now, but is still on BBC Sounds if you fancy giving it a go.\n\nhttps://www.bbc.co.uk/sounds/series/p06spb8w",
            "score": 3,
            "replies": []
        },
        {
            "author": "PiggieSmalls-90",
            "body": "I haven't watched anything that's really hooked me lately but been watching Black Summer and it's pretty good. I like the way it's filmed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Equivalent_Parking_8",
            "body": "I obviously watched Adolescence it's unbelievably good. \n\nI have also started watching some of the other Last one Laughing series (Ireland, Aus just started Canada) in anticipation of the UK version coming out this week. it's watchable but very cringe, hopefully the UK version will be better than Australia. \n\nToxic town is pretty good on netflix, just got he last 2 to watch.",
            "score": 2,
            "replies": [
                {
                    "author": "Ok_Cow_3431",
                    "body": "Last one Laughing Ireland was unexpectedly good entertainment. Some of it was really try-hardy and it's amazing how wooden some comedians can seem when there's no reciprocal laughter.   \n \nMight have had a bit of a crush on Amy Huberman after that.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Equivalent_Parking_8",
                            "body": "Yeah she was googled.. I knew of Diedre o kane before but not her. The canadian one has promise, Tom Green, Mae Martin and Colin Mochrie, plus the aunt frmo Sabrina the teenage witch.. Australia was unhinged.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sideone",
            "body": "Watched **The Electric State**. It was fine, the visuals are mostly great (as you'd expect from the budget) but there were a few jarring CGI bits that didn't work. The alt-90s retrofuturism is cool. The story is pretty meh. CrispRat is the same in everything.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kisrah",
            "body": "Finished Resident Alien over the weekend. Hope Netflix gets the third season at some point.\n\nWaiting for the season two finale of Severance to drop on Friday before I watch all that from the start. In the meantime I’m rewatching The Good Place.\n\nNot so much TV, but on YouTube I’ve been caught up in watching Scammer Payback’s videos. Brilliant stuff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheseBones",
            "body": "I have been loving **What We Do In The Shadows** series 5 on Iplayer; first few episodes were not as good as I remember the previous series being, but then it ramped it. I am absolutely in love with those Gizmo frogs..\n\nAlso been watching **The Apprentice** for all of my sins on a Thursday night, it is so daft but addictive. Gutted that the new **Dave Gorman** series is already over, was really enjoying that.",
            "score": 2,
            "replies": [
                {
                    "author": "Robtimus_prime89",
                    "body": "There was supposed to be another Dave Gorman episode - but unfortunately it was pretty reliant on Greg Wallace so they decided to pull it",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TheseBones",
                            "body": "Yeah I heard that, gutted!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "byjimini",
            "body": "Binged Severance season 2 because everyone at work is waiting on the finale and want to talk about it. Really liked it, even if I thought the 9 episodes really could have been 4 or 5 really. I assume it would be another Homeland after stringing out the  Season 1 finale in similar fashion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "blathers_enthusiast",
            "body": "I've been enjoying Escape to the Chateau and The Dog House recently!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HairyMechanic",
            "body": "I was super into **Snowpiercer** *(the TV series)* and had been begging for someone to pick up the fourth season so it'd be on Netflix elsewhere. \n\nI'd gone down a rabbit hole on Wikipedia and ended up on an actor's page who had been on it and it turns out that season four was out last year? Where the hell was I?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Robtimus_prime89",
            "body": "Like many, I’ve started watching **Adolescence**.  In awe of the single take approach - everything had to have been so meticulously planned and executed (especially *that* shot in episode 2)",
            "score": 1,
            "replies": []
        },
        {
            "author": "faa19",
            "body": "I have watched a few documentaries this week:  \nBoth **Can Elon Musk Rule the Worl**d and **Miyazaki, Spirit of Nature** were interesting, but did not provide much new information on their relevant subjects.\n\nI binged through **Mystery of the Bitcoin Billionaire**, it was an interesting look at the people and ideas behind bitcoin and tech bros thinking.\n\nFinally watched S3 of **Big Boys**. \\*That\\* opening part of E6 was incredibly moving and had me bawling. Jon Pointing is so underrated as an actor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "byjimini",
            "body": "Binged Severance season 2 because everyone at work is waiting on the finale and want to talk about it. Really liked it, even if I thought the 9 episodes really could have been 4 or 5 really. I assume it would be another Homeland after stringing out the  Season 1 finale in similar fashion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrskristmas",
            "body": "Watched the latest episode of The White Lotus earlier. This series is a slow burner but I'm really enjoying it.\n\nLast night I watched The Bikeriders, which has been on my watchlist for a while. It was pretty good. Well acted, interesting story, Jodie Comer is great in it. \n\nI might give Adolescence a go tonight after all the hype. I usually avoid hyped-up shows at the time but end up watching them years later (only saw Squid Games last year), but I think I'll give it a watch. Stephen Graham is always fantastic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SerendipitousCrow",
            "body": "I've started rewatching The Walking Dead because it's on Disney plus and I got a few free months \n\nNot sure I'll make it through 11 seasons but it's actually really decent. I'm on season two and had forgotten half the things that happen",
            "score": 1,
            "replies": []
        }
    ]
}