{
    "title": "What's the most impressive church or cathedral you've visited in the UK?",
    "author": "Upstairs_Drive_5602",
    "subreddit": "CasualUK",
    "rank": 11,
    "score": 142,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 387,
    "url": "https://www.reddit.com/r/CasualUK/comments/1je36s9/whats_the_most_impressive_church_or_cathedral/",
    "id": "1je36s9",
    "selftext": "https://preview.redd.it/dbsy782asfpe1.png?width=2048&format=png&auto=webp&s=c37e1eb18ec27296c0908a743d258f623f900ef9\n\nThere are lots to choose from, but one of my favourites is Ely. Well worth a visit and not too touristy. ",
    "comments": [
        {
            "author": "DaveBacon",
            "body": "Lincoln Cathedral. Huge and imposing building.",
            "score": 153,
            "replies": [
                {
                    "author": "Breakwaterbot",
                    "body": "My home town and something I really took for granted when growing up there. Definitely the best cathedral I've been to in the UK. \n\nAlso, as is tradition, someone will come along very soon to tell you the fact about it being the tallest building in the world at one point.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "DaveBacon",
                            "body": "I was going to add it to my comment but I thought I’d look like a smart arse.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Breakwaterbot",
                                    "body": "Ha, that's why I included it in my comment. It's the first thing people come along with on here when Lincoln Cathedral is mentioned. I've been hearing it all my life so get quite bored of it. Thought I'd nip it in the bud.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SpencerIvy",
                                            "body": "I went there on a school trip in the 90s and it always stuck with me. Super cool experience that I maybe took for granted for a while\n\nTo be fair to the played out trivia though, wasn't it the tallest building in the world for quite a long time?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Breakwaterbot",
                                                    "body": "Yeah it was just shy of 240 years. Would've been longer if the spire hadn't collapsed (another 330 years). Quite impressive really. \n\nAlthough there are doubts that the recorded height with the spire is completely accurate.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Reality-Umbulical",
                                                            "body": "You have become that which you hate",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Breakwaterbot",
                                                                    "body": "You either log off a hero or stay on Reddit long enough to see yourself become the villain.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SilyLavage",
                                            "body": "It’s got a bit exaggerated anyway. We don’t know how tall Lincoln’s central spire was, but based on comparison with other spires it may have been taller than the Great Pyramid.\n\nI suppose that isn’t as snappy, though.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Regular-Whereas-8053",
                            "body": "Not quite my home town but I’m a yellowbelly born & bred and went to Lincoln college, so do have a soft spot. Not quite my favourite though. That goes to St Machar cathedral in Aberdeen, 15th century and quite small for a cathedral but a lovely space.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "giddystratospheres1",
                            "body": "Lincoln kicks the arse of York Minster",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheZestyPumpkin",
                    "body": "Lincoln was the only one I saw as a school kid in the days before the internet threw pictures of every grand building in the world at you daily. It was awe-inspiring back then when you're three foot tall and looking up in amazement having been surrounded by terraced houses and office blocks.\n\nThen my friend asked the vicar if I was going to hell because I wasn't christened. Never been so embarrassed, cheers mate, made the school trip.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "MrMikeJJ",
                    "body": "I love seeing it when you approach Lincoln from the South. \n\n\nI rarely come from that direction, so is a novelty. Seeing it appear on the hill in the distance is spectacular.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Minimum_Possibility6",
                            "body": "On a clear day too can see it from Sheffield ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "loveswimmingpools",
                    "body": "It is really beautiful.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Hopeful_Stay_5276",
                    "body": "And it's survived earthquakes and fires.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "concretepigeon",
                            "body": "It did used to be much taller though. It was the tallest building in the world for a long time and only lost the title when its biggest spire fell off.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "difficult_Person_666",
                    "body": "But what a steep walk up to it!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Car-Nivore",
                    "body": "Yes, it is very impressive, especially the acoustics. Graduated from there and also (sadly) attended the funeral of a fallen brother.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dixieglitterwick",
            "body": "Probably Salisbury. It’s a tourist town - there’s a famous cathedral there. Salisbury cathedral.\n\nIt’s famous for its 123-metre spire, it’s famous for its clock - the first clock to be invented in the world, and it’s still going.",
            "score": 283,
            "replies": [
                {
                    "author": "willfoxwillfox",
                    "body": "Sounds like you’ve got those facts well-rehearsed, comrade.",
                    "score": 247,
                    "replies": [
                        {
                            "author": "MotherEastern3051",
                            "body": "Well worth visiting, even from afar and just for a couple of hours.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "michamp",
                            "body": "This comment is not getting enough love.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IJBLondon",
                    "body": "Wipe off your door handles when dixieglitterwick is around.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "AnxiousBiped",
                    "body": "I am not at all religious, and I'm generally suspicious of very prominent modern additions to churches - but the font at Salisbury genuinely moved me. Just magical. The whole place is a wonderful testament to the continuity of faith over the centuries.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Wonderful_Forest",
                    "body": "I find Salisbury Cathedral beautiful, and I love seeing the spire towering above the horizon from afar. It sits in a lovely close too, interesting history.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "eogreen",
                    "body": "[The clock claim is highly contested.](https://en.wikipedia.org/wiki/Salisbury_Cathedral_clock#%22Oldest_working_clock%22_claim)",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Andythompson78",
                            "body": "Alleged oldest surviving striking [clock ](https://en.m.wikipedia.org/wiki/Salisbury_Cathedral_clock)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "eogreen",
                                    "body": "That’s the link I sent except I had it jump to the section where lots of other churches argue theirs is older. \n\nIt’s a cool clock, but we’re unlikely to be able to say it’s the world’s oldest of its kind.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sarahspangles",
                    "body": "We need you to do the PR for Wakefield Cathedral - tallest spire in Yorkshire! It’s actually the shortest cathedral in England, all the big churches in Yorkshire are Minsters.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Available_Fact_3445",
                    "body": "Salisbury cathedral's unspoiled setting is just so beautiful. Grassy sward, mature trees, dwellings for a Trollope canon or two. Really wonderful spot",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "verzweifeltundmuede",
                    "body": "Came to find this comment and wasn't disappointed ",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "square--one",
                    "body": "Also nearby is the Hovis advert street. I only know this because I went on a school trip once and our geography teacher was very excited to inform of this.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sarahc13289",
                            "body": "The Hovis street is Gold Hill in Shaftesbury, about 20 miles from Salisbury.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "square--one",
                                    "body": "My bad I got the two muddled. Is there a cathedral in Shaftesbury too?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "difficult_Person_666",
                    "body": "Nice perfume shops too nearby…",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "YchYFi",
                    "body": "Chesterfield has a cool spire.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "cybot2001",
                    "body": "Oh God, don't make me laugh like that I have a sore chest.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "dmc1972",
                    "body": "We went in the summer and there was a couple getting married.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Appropriate-Sound169",
                    "body": "Don't forget the font and the magna carta",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InevitableFox81194",
                    "body": "Its also a really popular hot spot with PokemonGo players. 😆",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheWinterKing",
            "body": "Durham. I’m in no way a religious man, but that building makes my soul soar. The view from the riverbanks of the cathedral perched on its hill is one of the greats.",
            "score": 155,
            "replies": [
                {
                    "author": "kindaadulting87",
                    "body": "Finally going to Durham in May and so excited to see it!",
                    "score": 14,
                    "replies": [
                        {
                            "author": "cAt_S0fa",
                            "body": "Make sure that you go to the exhibition in The Monks Dormitory while you are there.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "PandosII",
                                    "body": "Are they frat bro monks, pulling pranks on each other and doing “keg stands”?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "cAt_S0fa",
                                            "body": "Sadly not. But there are hog back tombstones!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "kindaadulting87",
                                    "body": "Ooh thank you!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bucket_of_frogs",
                            "body": "https://preview.redd.it/l4uqiambdgpe1.jpeg?width=800&format=pjpg&auto=webp&s=173ec098765d48af6f122535b4c4597be8675037\n\nTry and go in November for the Lumiere Festival!\n\n[https://www.lumiere-festival.com/](https://www.lumiere-festival.com/)\n\n[https://youtu.be/5L8GBJdjuc0?si=0peEVAengDGyd6nI](https://youtu.be/5L8GBJdjuc0?si=0peEVAengDGyd6nI)",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AudioLlama",
                    "body": "Yeah. Durham is an unbelievably magnificent structure. It's hard to imagine what impact it would have had on the average 12th-century soul.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Brickie78",
                    "body": "Durham is great, and it's architecturally so different from most English cathedrals. Big, blocky, solid Normam architecture, zigzags and patterns cut into the pillars.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "SilyLavage",
                            "body": "I don’t want to be pedantic, but several other cathedrals do contain Norman architecture and they’re well worth looking at – Norwich, Peterborough, and Winchester are some of the best. \n\nWhat sets Durham apart is that it’s not been greatly altered except for an eastern transept and the towers, whereas the other cathedrals have significant Gothic additions. I totally get why it blew you away, because it is spectacular. \n\nDurham’s pillars were also quite influential, and you can see similar patterns at Lindisfarne Priory and Dunfermline Abbey. The spiral pattern was itself taken from St Peter’s Basilica in Rome, so you can see it as a direct link between what was then the periphery of Christendom and its heart.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ask_Me_What_Im_Up_to",
                    "body": "One can also pay one's respect to the Venerable Bede, the father of English history.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "oistroplex",
                    "body": "Definitely Durham among cathedrals. As for churches, St Mary's, Itchen Stoke is a stunning surprise.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "BabbageUK",
                    "body": "Definitely. I regularly visit and I'm not religious in the slightest. It's a marvel of engineering and a humbling place to visit.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Zo50",
                    "body": "I feel the same way about Salisbury. \n\nI'm a committed atheist but that cathedral is a thing of beauty.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tmbyfc",
                    "body": "Yeah. Durham and Wells, but there's quite a few I haven't seen like Lincoln or Ely",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tmbyfc",
                    "body": "Yeah. Durham and Wells, but there's quite a few I haven't seen like Lincoln or Ely",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thepatiosong",
                    "body": "Yes! Went there once 20+ years ago, was overwhelmed. Gorgeous place in general.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dbltax",
            "body": "Wells",
            "score": 51,
            "replies": [
                {
                    "author": "wholesomechunk",
                    "body": "Do they still have a baby eating bishop?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Eddie_D87",
                            "body": "\"Bend over, Blackadder!\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dr_Frankenstone",
                    "body": "I love Wells Cathedral too.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PromotionLoose2143",
                    "body": "Wells is so amazing, I think it was one of the earliest - inside it seems so unadorned and yet something beautiful.  Outside it's mental.\n\nIt has a really really old clock (2nd oldest) which has jousting knights that have been knocking each other down for 600 years\n\nAnd it also has the incredible moated bishops' palace which is easily overlooked.  Wells the city is gorgeous too.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Eddie_D87",
                            "body": "I'm not a churchy/cathedral person, but I could stare at Wells Cathedral for hours. So much detail on such a vast building. Mental indeed!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "johnmk3",
            "body": "Lincoln cathedral\n\nLived in Lincoln till I was 11 and then went back at 18 for uni. Beautiful building.",
            "score": 35,
            "replies": [
                {
                    "author": "ShuckingFambles",
                    "body": "I always chime in with the useless fact that it was the tallest building in the world for a while, taller than the pyramid in Giza, and I always look at the cathedral and imagine the pyramids are a bit shit and a letdown like Stonehenge, but this time I fact checked and didn't realise there was a spire on top that blew off the all cathedral in a storm, so maybe the pyramids aren't so shit after all lol",
                    "score": 3,
                    "replies": [
                        {
                            "author": "claridgeforking",
                            "body": "Was tallest for almost 250 years until it's spire collapsed, but nothing taller than its original height was built until 1890 (679 years).\n\nMust have been a crazy thing to see in the 1300s.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DiscussionOk1098",
            "body": "Extra Mature cathedral, when I visited my oven and saw that thing of beauty melting so lovely on my toast. I thought I had reached the golden gates",
            "score": 113,
            "replies": [
                {
                    "author": "mwfn",
                    "body": "Cheesus Crust",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Dr_Frankenstone",
                            "body": "And the Holy Toast…",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "No-Strike-4560",
                                    "body": "And the archangel Babybel",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Dr_Frankenstone",
                                            "body": "And Gouda our Father",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Boh3mianRaspb3rry",
                                                    "body": "I brielieve",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Andy_McNob",
                                                            "body": "Blessed are the cheesemakers.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "wholesomechunk",
                                            "body": "The babybel eating bishop of bath and wells.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Dr_Frankenstone",
                                                    "body": "Stinking Bishop!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vectorman1989",
            "body": "St. Magnus in Orkney. Not the biggest or anything, but they managed to build this huge cathedral on Orkney in the middle ages.\n\nhttps://preview.redd.it/o3ixaor0agpe1.jpeg?width=4288&format=pjpg&auto=webp&s=cef4ac60ca049b9f2ed5244935dd16f0b858c9d0",
            "score": 32,
            "replies": [
                {
                    "author": "sunheadeddeity",
                    "body": "That was my choice too - built by Vikings!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackleydynamo",
            "body": "Ely is magnificent, no doubt, but my vote is going to Durham or Lincoln, because of their position dominating the surrounding countryside. Both are stunning buildings to visit, and look incredible even now, in an age when we're used to seeing huge building. But just imagine you're a 13th century peasant living in a wattle and daub hut, and you go to the market in either town for the first time, and you see *that* rising out of the mist ahead of you.",
            "score": 27,
            "replies": [
                {
                    "author": "Brickie78",
                    "body": "Ely also dominates the surrounding countryside to be fair.\n\nIt's just that a man standing on a chair would dominate the surrounding countryside.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "blackleydynamo",
                            "body": "Yeah that did occur to me about Ely - I could stand on a breadcrate and see Belgium 😂\n\nOne of the most spectacular views of Durham is approaching from the south by train, you get the full glory of the cathedral on its rocky outcrop.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wiltix",
                    "body": "I had the exact same thought about Gloucester cathedral. If you take the road from Hartpury into Gloucester you are coming down a hill and you see the valley Gloucester sits in, even today the cathedral dominates the view, can’t imagine what that looked like to some farmer on the hills 200 years ago",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LordGeni",
                    "body": "https://preview.redd.it/3wk4t6ym4ipe1.jpeg?width=400&format=pjpg&auto=webp&s=85af2ba9a6d9455d4662a67c3748afe8ced559de",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tmr89",
            "body": "Salisbury Cathedral, with its magnificent 123 metre spire",
            "score": 21,
            "replies": []
        },
        {
            "author": "Commontreacle1987",
            "body": "https://preview.redd.it/688276mjxfpe1.jpeg?width=1035&format=pjpg&auto=webp&s=aab46299f97884096891936799a0d5e8899dbc39\n\nLincoln without a doubt. Of a night it’s lit up beautifully.",
            "score": 20,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Lovely cathedral. Steep Hill is a bit off-putting, but lots of pubs to enjoy once you make it up to the top!\n\nhttps://preview.redd.it/b6gyq0txyfpe1.png?width=320&format=png&auto=webp&s=1e83d60c7dc3dc8faed00f1f561447212babe4c3",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Commontreacle1987",
                            "body": "That hill is something! I had a stroke, learnt to walk again and walked up that hill within 4 months. I was determined! Pubs are lovely and definitely a good stop gap for catching your breath that’s for sure. 😀",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "No-Strike-4560",
                                    "body": "Last time I went there , with the car parked at the top near the castle , my dog decided she didn't want to walk anymore and made me carry her all the way up. \n\n\nThought I was going to die haha.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Commontreacle1987",
                                            "body": "Oh no!!!  please don’t tell me she is a great Dane 🤣 to be fair to your dog I didn’t want to walk anymore either but my partner refused to carry me haha! You deserve a medal 🥇",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "No-Strike-4560",
                                                    "body": "Only a medium sized dog, thankfully, but was still a struggle ! ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MahatmaAndhi",
            "body": "I'm biased, but Peterborough. It's such a good cathedral with an interesting history and two queens buried there(although one was relocated). \n\nBecause it's in such a flat area, you can see for miles from the tower. You can even see Ely cathedral too.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Andy_McNob",
            "body": "I've always quite liked Coventry Cathedral. The juxtaposition of the bombed out shell with its replacement, the sculpture of St.Michael, the hastily assembled cross from the burned woodwork and that massive tapestry. They also used to have a sculpture of Christ's head made from the wreckage of fatal car accidents. I found all that impressive when I was a nipper.",
            "score": 19,
            "replies": [
                {
                    "author": "wildOldcheesecake",
                    "body": "Went to Warwick for uni  but naturally visited cov a lot. Loved taking a walk through the cathedral. Lots of student events were held in the ruins part too",
                    "score": 2,
                    "replies": [
                        {
                            "author": "OSUBrit",
                            "body": "> Went to Warwick for uni but naturally visited cov a lot\n\nAnd by 'a lot' I assume you mean *every day you went to class*.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "wildOldcheesecake",
                                    "body": "How confidently wrong you are and that’s not quite right at all. The uni is in Warwickshire. It’s a campus uni, therefore my classes were on campus.\n\nEdit: turns out I’m wrong and stand corrected. But my comment was based on my visiting the city centre and the cathedral is just before you reach centre. My classes were no where near the area",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "OSUBrit",
                                            "body": ">How confidently wrong you are and that’s not quite right at all. The uni is in Warwickshire. It’s a campus uni, therefore my classes were on campus.\n\nBig oof - talk about confidently wrong.\n\nGibbet Hill is the boundary between the West Midlands (/Coventry) and Warwickshire so while the halls are in Warwickshire the campus itself is in Coventry.\n\nA fact the University itself is very clear on:\n[\"Although our campus is situated in Coventry\"](https://warwick.ac.uk/study/postgraduate/whywarwick/localarea/)\n\nYou merely adopted Warwickshire; I was born in it, molded by it. I didn't see Northamptonshire until I was already a man.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "wildOldcheesecake",
                                                    "body": "Okay that’s fair, I accept I am wrong here. But when I said I was in cov often, I meant the city centre. My mentioning of walking to the cathedral cements this. Your response was really playing into pedantry. My classes were most definitely not in the city centre.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "chicken-farmer",
            "body": "Exeter is gorgeous",
            "score": 18,
            "replies": [
                {
                    "author": "UMCOAB",
                    "body": "Contains the oldest cat flap in the world too.\n\nBBC News - Exeter Cathedral door hole could be world's oldest cat flap - BBC News\nhttps://www.bbc.co.uk/news/uk-england-devon-66665613",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dhandes",
                            "body": "I read that as flat cap initially.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "UMCOAB",
                                    "body": "Cat flat cap.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MushyBeans",
                            "body": "https://en.m.wikipedia.org/wiki/Hickory_Dickory_Dock",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SirDooble",
                    "body": "Agreed. I'm perhaps now biased to it, but it's one of the most easily recognisable UK cathedrals to me on account of its shape.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "OverTheCandlestik",
            "body": "York minster \n\nNothing really compares to it tbh",
            "score": 75,
            "replies": [
                {
                    "author": "SilyLavage",
                    "body": "York is probably the single best church for medieval stained glass in the country; Canterbury is its main rival. There’s just so much of it, and it’s reasonably well-preserved even after all this time. It also shows that the Middle Ages could be very colourful:\n\nhttps://preview.redd.it/vy6obygl7gpe1.jpeg?width=2400&format=pjpg&auto=webp&s=2f9a0b3b7618290e0cc900977bb4b5f09045e4cd",
                    "score": 18,
                    "replies": [
                        {
                            "author": "scrabble71",
                            "body": "If I remember rightly York Minster contains over half of the UK’s medieval stained glass. However some of the medieval glass in Canterbury is slightly older.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "SilyLavage",
                                    "body": "I suspect the York figure is a bit exaggerated, as a fair bit of glass survives elsewhere – including in York’s other churches – but it’s certainly one of the more complete collections.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "concacanca",
                    "body": "Agreed. Lots of amazing cathedrals out there but yorkminster really dominates the landscape around it and it's as impressive inside as out.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "FireFingers1992",
            "body": "St Davids, bonkers compared to the size of the \"city\" it is attatched to.",
            "score": 16,
            "replies": [
                {
                    "author": "sairemrys",
                    "body": "Was waiting to see if anyone put this answer! I live in Pembrokeshire and it was used as a means for school trips so many times.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I visited many years ago. Only about 1500 people live there. It's a lovely setting though.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kayyeww",
                    "body": "I visited it in July last year and it had been grey all day, when the sun broke out behind the clouds it looked so beautiful",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jin-shei",
            "body": "Gloucester. The history is great and they have an amazing medieval library",
            "score": 16,
            "replies": [
                {
                    "author": "PromotionLoose2143",
                    "body": "Yes, Gloucester!  There is so much to see and it's stunning.  Of course Harry Potter filmed there too.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Appropriate-Sound169",
                    "body": "This is on my list, must get my arse into gear",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Jin-shei",
                            "body": "Time it to book the library tour. Totally worth it. And the crypts and tower",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GeekGamerG",
                    "body": "The comment I was looking for.\nSaw a few people mention Durham which i live near to now but, Gloucester is magnificent. Could see it for miles away as well, so always knew when we were getting near home when we could see it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "OrganOMegaly",
                    "body": "Gloucester has my vote too. Bit biased as I grew up in Gloucester and though I’m not religious myself my Granny would often take me to light a candle in memory of my grandad. Visited recently for the first time in years and it just felt.. soothing. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Jin-shei",
                            "body": "It is just the calm of ages",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ShotInTheBrum",
            "body": "Worcester is lovely.",
            "score": 16,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Yes I agree. It has some great pubs too!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silver_SnakeNZ",
            "body": "I've only recently arrived in the UK, but of the dozen or so I'm cathedrals I've seen here my favourite is probably Litchfield. Totally unexpectedly impressive for a relatively small town.",
            "score": 14,
            "replies": [
                {
                    "author": "Woodfield30",
                    "body": "Can’t believe how far I had to scroll for this! \nVisited earlier this year - it is stunning. So intricate.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beowulf_98",
            "body": "The one in St Alban's is pretty cool",
            "score": 13,
            "replies": [
                {
                    "author": "Hythy",
                    "body": "I love that it is such a patchwork of roman bricks, romanesque and gothic, Norman and Victorian.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "rizozzy1",
                    "body": "Another vote for the St Albans massive! Because it is huge! \n\nPlus the Abby gate down the road is an awesome addition.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "OSUBrit",
                    "body": "I graduated in that cathedral!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "obbitz",
            "body": "Wells.\n\nhttps://preview.redd.it/8oo9g71kagpe1.jpeg?width=674&format=pjpg&auto=webp&s=83d2ebf7a965e5bd1700975aabc05b246fc3e6a2",
            "score": 15,
            "replies": [
                {
                    "author": "YchYFi",
                    "body": "OK I have to visit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "initiali5ed",
            "body": "Paddy’s Wigwam",
            "score": 24,
            "replies": [
                {
                    "author": "julesharvey1",
                    "body": "Love the Anglican cathedral in Liverpool but love the wigwam too. They knew they couldn’t compete with the Anglican so went for something completely different which really works",
                    "score": 10,
                    "replies": [
                        {
                            "author": "KeyLog256",
                            "body": "I still think it's a shame they didn't go for the original plan - a massive design, I think would have been the biggest church building in the world, that would have made the Anglican look small by comparison. \n\nCost a fortune though, and even the Catholic church couldn't hoodwink enough out of the working classes who were expected to pay for it.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "OrganizationOk5418",
                            "body": "You can go up to roof, might be a small charge, breathtaking and scary. \nYou go above the bells on the way up and they have little nooks with artifacts to see on the way. Definitely worth it.\n\nI exist because of it, Great-granddad came as a stonemason from Wales.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "thecraftybee1981",
                            "body": "They did try to compete with the Anglican and the winning design would have been the biggest Cathedral in the world.  The current Anglican one is the biggest Protestant cathedral in Europe and they wanted the Catholic one to be bigger than it and bigger than even the Vatican.  Sadly WW2 bankrupted the country and they couldn’t afford to complete the pre-war design and went with the modernist Paddy’s Wigwam instead.  There was a model of the original in the Museum of Liverpool iirc - it would have been a huge Byzantine domed church of white Portland stone and red sandstone.\n\nhttps://en.wikipedia.org/wiki/Liverpool_Metropolitan_Cathedral#/media/File:LPoolLutyens-wyrdlight-802726.jpg\n\nOnly the basement/crypts were built.  Paddy’s Wigwam was built on top of a small section of it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bulbasaurus__Rex",
                    "body": "Ugly on the outside but so impressive on the inside",
                    "score": 9,
                    "replies": [
                        {
                            "author": "thecraftybee1981",
                            "body": "It’s grown on me, but the blue light from the windows gives off a wonderful glow inside.  I’m a devout atheist, but even I felt somewhat spiritual in there.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Linfords_lunchbox",
                            "body": "Still nicer than the Anglican Cathedral which looms with foreboding on the horizon.",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Quality_Cabbage",
                    "body": "Twinned with the atmosphere processor from Aliens.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "initiali5ed",
                            "body": "I say we nuke it from orbit",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Significant_Wind_778",
            "body": "York",
            "score": 9,
            "replies": []
        },
        {
            "author": "Nekododdy",
            "body": "Buckfast Abbey",
            "score": 10,
            "replies": [
                {
                    "author": "Maximum_Scientist_85",
                    "body": "I never want to visit, I think it’ll shatter my illusions of the holiest of holy sites, where god’s own nectar is formed. The Buckfast monks, protecting the sacred Vino al Fresco, asking passing tourists if they would care for a square go, …",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I'm trying to place it. Near - or at least not too far - to Totnes?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Nekododdy",
                            "body": "Yes fairly close by not far from the a 38",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "I played there once (the organ) many years ago.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SimianSimulacrum",
                                            "body": "I find my organ doesn't work too well after a few buckfasts",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thepatiosong",
                    "body": "Those stained glass windows are something else.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "moon-bouquet",
                    "body": "Lovely garden, as well!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "johnsangster999",
            "body": "I'm not religious but I love history. Here are my top three\n\n1. Durham\n\n2. Canterbury\n\n3. Worcester\n\nAlthough not a cathedral special mention for Tewkesbury Abbey",
            "score": 9,
            "replies": [
                {
                    "author": "Breadcrumbsandbows",
                    "body": "I'm super biased because I was lucky enough to graduate in Canterbury Cathedral, so no tourists and just super special. I did wear stupid heels though and had to sort of outrun the boy behind me who was catching me up down the aisle.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "johnsangster999",
                            "body": "One of my kids studying Architecture there. It was nice there every time. I think it is easy to fall down all those stairs in high heels ha ha",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I know Tewkesbury and Worcester, but not the other two. My guess is that Canterbury is probably swarming with tourists in the summer, perhaps not so much Durham.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "johnsangster999",
                            "body": "Hi, opposite actually. Durham is smaller so it feels more crowded, but it is free unlike others, like York. Canterbury is so big that tourists are spread out.\n\nI found York to be worst for tourist density and it was expensive for what it was compared to others.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "When I was there last year, the centre of York seemed to be full of tourists visiting Ye Olde Harry Potter type shops, but the Minster is very fine. Durham is certainly on my wish-list.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "johnsangster999",
                                            "body": "Durham is nice and the castle is opposite. Queen Victoria often made the train stop on the bridge so she could look at them.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PromotionLoose2143",
                    "body": "Went to Tewkesbury Abbey for a Space illuminations event.   Very impressive.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bobzilla2",
            "body": "Winchester",
            "score": 10,
            "replies": []
        },
        {
            "author": "Sarahspangles",
            "body": "Durham, York, Lincoln, Norwich, Peterborough, Ely, Wells, Gloucester - all wonderful.\n\nMost moving - Coventry.",
            "score": 8,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I know them all apart from Durham and Wells. I'm looking for an excuse to visit these two.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sarahspangles",
                            "body": "Durham is definitely worth visiting because its setting is so interesting. The actual Cathedral tour was good too.\n\nWells is just completely OTT!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Takver_",
                    "body": "Yeah, I'm biased but Coventry with the two cathedrals side by side and the 'Father forgive' story are very moving .\n\nhttps://www.coventrycathedral.org.uk/our-story/the-story-of-coventry-cathedral",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dronee",
            "body": "Liverpool Cathedral for me, very impressive.",
            "score": 17,
            "replies": [
                {
                    "author": "DoctorOctagonapus",
                    "body": "Ooh yes. I remember standing in front of the high altar there and feeling very small!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "dobbynobson",
                    "body": "This place took my breath away. It's apparently the UKs largest cathedral. But more than that, it's 1920s stripped down gothic revival by Giles Gilbert Scott (he of the power station which is now Tate Modern) so feels unlike older and more embellished churches. It's like being in a Dune or Game of Thrones set. Monumental walls and arches of sandstone, with amazing angles and sight lines, and beautiful arts and crafts style flourishes to the woodwork too (doors, chairs, pulpit, stairs). Well worth visiting.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "nonsense_potter",
                            "body": "And he of the phone boxes",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Clivewilliams",
                    "body": "Yes, me too. And the acoustics during evensong are out of this world.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I-SHAVE-MINE-X-x",
            "body": "Hereford",
            "score": 7,
            "replies": [
                {
                    "author": "PromotionLoose2143",
                    "body": "Yes, we have a chained library ( not as impressive as it sounds honestly but nice to see) and the Mappa Mundi which is wonderful and whilst it is behind glass you can get right up close to it",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "IntrovertedArcher",
            "body": "Gloucester cathedral is amazing. Pretty much any historical or period drama that needs a decent looking cloister films at Gloucester. We had a tour of the crypt too which was fascinating. I’m not in any way religious but I love old impressive buildings. Castles for preference but churches and cathedrals are cool too.",
            "score": 8,
            "replies": []
        },
        {
            "author": "C5Galaxy",
            "body": "Liverpool Cathedral. Never been in one that big before. I believe it is the biggest in the UK.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Shadow_Demon999",
            "body": "As a yellow belly, Lincoln cathedral is incredible. Awesome is very overused these days, but it applies here.",
            "score": 7,
            "replies": []
        },
        {
            "author": "phxntomation",
            "body": "Liverpool Cathedral. Absolutely beautiful inside. Stones all came from a single Quarry.",
            "score": 14,
            "replies": [
                {
                    "author": "The_Yellow_King",
                    "body": "Love this one. So massive and imposing.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "josh5676543",
            "body": "Lincoln cathedral was at one point the tallest building in the world",
            "score": 7,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Yes interesting. I've just found this:\n\nLincoln Cathedral has a rich history of falling down and being rebuilt. It is easy to identify the different time periods by the size, color, and weathering of the stonework that make up the cathedral. The cathedral was started in 1072 but caught on fire in 1124. Only to be rebuilt and destroyed in 1185 by, of all things in Lincolnshire, an earthquake. Between the years 1192 and 1235, the cathedral was again rebuilt, alas they didn't have [BIM](https://www.bricsys.com/bim/) back in those days. The construction was somewhat experimental and so, just two years later, in 1237, the central Tower collapsed.\n\nAt this stage, you might think they'd give up, but no! In 1255 Henry III declared that the cathedral, once again, be rebuilt. In 1311 thanks to the wooden and lead spire on the central tower, Lincoln Cathedral became the tallest building in the world.\n\nFor 237 years the cathedral stood until disastrously, the central spire collapsed in 1548. If you consider how experimental the design was at the time, that's darn impressive. It is now a more modest 83 meters (272 ft).\n\nhttps://preview.redd.it/1rabqhoh2gpe1.png?width=620&format=png&auto=webp&s=ce6f3c9343d1ea18acbe9c7637353b9a1abd1451",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "thedrape",
            "body": "I really liked Chester.\n\nThere's also a little Serbian Orthodox Church near Cadbury's World in Bournville that's really pretty inside and pretty incongruous in that residential part of Birmingham.",
            "score": 8,
            "replies": []
        },
        {
            "author": "MrsKebabs",
            "body": "https://preview.redd.it/m6c2zhwrmgpe1.jpeg?width=904&format=pjpg&auto=webp&s=16d5ccf370bbe12eddcdc17543e03552e7c5055c\n\nProbably this one in Liverpool. Which is apparently one of the biggest in the world",
            "score": 8,
            "replies": []
        },
        {
            "author": "godstar67",
            "body": "I live in Canterbury and as a kid explored the entire cathedral including climbing the spire and even gaining access to the library for research for a school project. I’m not a believer but it is a remarkable piece of human work. \n\nBut I’d say Salisbury just edges it with Winchester and Ely close behind. And a special mention to the beautiful cloisters at Gloucester. \n\nThat said, I’m yet to visit Paddy’s Wigwam.",
            "score": 7,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Both the Liverpool Cathedrals are well worth visiting. I know another nick-name for PW - the Mersey Funnel.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "godstar67",
                            "body": "My family are from Manchester so any trips to the area end up being to there - I’ve always wanted to visit Liverpool (partly because I’ve never met a Scouser who wasn’t a lovely person) and have planned my week off in September to go, so I’ll visit both cathedrals than. Thanks for the recommendation.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "jawide626",
                                    "body": "Both cathedrals are definitely a must-see and are about a 5 minute walk away from each other as there's a single straight road (Hope Street) between the 2. I suggest also stopping halfway along and visiting the Philharmonic pub with its [Grade-I listed toilets](https://www.theguardian.com/artanddesign/2020/feb/07/liverpool-pub-with-spectacular-loos-becomes-first-to-be-grade-i-listed#img-1)",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "godstar67",
                                            "body": "Appreciated. Will take due note.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pieboy8",
                    "body": "Yeah it's sad to find such little love for Canterbury, although the price tag is a bit much these days. \n\nHaving free entry as a local resident has been amazing, I've really come to appreciate it. \n\nI used to regularly pop in and use their cafe to get lunch when my office was in the city centre. It helped avoid the lunchtime rush crowds outside, and the views were pretty special.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "naypenrai",
            "body": "Not the most, but worth a mention, I’m going to say Peterborough. Also a shout-out to Liverpool Cathedral.",
            "score": 6,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Both great buildings!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrBananaStand1990",
            "body": "Canterbury… only because I graduated in there and shock the Archbishops hand",
            "score": 6,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "That's impressive! We had Rowan Williams (Archbishop about ten years ago) here in Salisbury not so long ago. Massive BOOMING voice and interesting speaker.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MaaaaxPower",
            "body": "Winchester Cathedral is a really good visitor experience",
            "score": 14,
            "replies": [
                {
                    "author": "TheFleasOfGaspode",
                    "body": "Can't believe I had to scroll down so far for Winchester cathedral. It's the longest medieval cathedral in the world and a Victorian diver saved it from collapsing.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "thesaharadesert",
                            "body": "I think all schoolchildren in our area learned about William Walker",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "samwise2210",
                            "body": "Holy crap, made my way to Wikipedia to read into this, absolutely incredible what William Walker did.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "merrycrow",
                    "body": "Not as impressive from the outside as some of the others (square blocky tower instead of a soaring spire) but inside it's immense. Makes other cathedrals seem a bit pokey in comparison.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Feline-Sloth",
                    "body": "Nearby Romsey Abbey is an impressive Parish Church",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "obernius",
            "body": "I'll say Ely too, but I'm biased because I'm local",
            "score": 5,
            "replies": []
        },
        {
            "author": "cAt_S0fa",
            "body": "I'm going to go with a rather unknown Cathedral- Peterborough. \n\nIt's got the most amazing painted ceiling.",
            "score": 5,
            "replies": []
        },
        {
            "author": "palishkoto",
            "body": "Hampton Court Chapel's interior and blue ceiling is magnificent.",
            "score": 6,
            "replies": []
        },
        {
            "author": "PintsAndPies82",
            "body": "Gloucester Cathedral.",
            "score": 5,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Really lovely!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wonderful_Bath_1904",
            "body": "I really like Salisbury. The grounds there in that square are really pretty.",
            "score": 6,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I agree. I'm a next-door-neighbour to that very cathedral! I can see the top of the spire from where I'm sitting now.\n\nhttps://preview.redd.it/baq74g8hugpe1.png?width=1600&format=png&auto=webp&s=a30ff99fd1c1aed2baab82c75e1157b37d94a8ed",
                    "score": 3,
                    "replies": [
                        {
                            "author": "InevitableFox81194",
                            "body": "Which direction is this taken from. I'm trying to work out where in Salisbury this was captured.. it looks like it's from the grounds of Bishops.\n\nAlso, fellow salisbury resident here 👋",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "👋 Have you lived here long? I arrived at the end of last year.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "InevitableFox81194",
                                            "body": "Moved here 10 yrs ago from abroad. I think it's such a beautiful quaint little city..",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Upstairs_Drive_5602",
                                                    "body": "Yes, I like it too. I also moved from abroad (although I was a year in Worcester first). I took a risk moving to a place where I knew nobody, but wanted to retire to a flat within walking distance of a cathedral that I could afford. That's tricky! My first choice was Lincoln and then Ely, but I couldn't find accommodation under 1,5m, which is a little beyond me.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "InevitableFox81194",
                                                            "body": "I can imagine. I like salibaury because it is small, I miss the hustle and bustle of the big European metropolitan city, but it's only a short car journey or train ride to get that fix. Salisbury has an odd charm to it. I live on the outskirts in wilton, in a cottage older than the American constitution with a river in the garden. \n\nThe best decision I've made in a long time was this move. Although I miss my home country a lot, especially the food, I still for now wouldn't change what I've got.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Upstairs_Drive_5602",
                                                                    "body": "That sounds very idyllic. We'll have to meet up for a pint.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "InevitableFox81194",
                                                                            "body": "Id love that. I'm always in the cathedral grounds as its my happy place. Plus the riffles museum does the best coffee 😆",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Upstairs_Drive_5602",
                                                                                    "body": "That's almost next door!",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "The back of the Mediaeval Hall. It's around the corner from this photo: \n\nhttps://preview.redd.it/igcrnbmg0hpe1.png?width=1024&format=png&auto=webp&s=6db824e9c1c8ec018c9ee640fc804355cbddbe3f",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "redbullcat",
            "body": "Used to live 10 mins walk from Winchester cathedral so I'm going to say that, but I'm probably biased.",
            "score": 8,
            "replies": [
                {
                    "author": "merrycrow",
                    "body": "The first house I lived in (until about age 4), was on St Thomas Street and as a baby I was taken for daily walks around the outside of the cathedral. My mum used to swear that my first word was \"gargoyle\".",
                    "score": 4,
                    "replies": [
                        {
                            "author": "redbullcat",
                            "body": "Haha, amazing! Until recently we lived very close to the college. Loved it. But it's also a stupidly expensive area and we couldn't afford to buy around there, so we moved somewhere we could afford.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Additional-Weather46",
            "body": "There’s a little chapel in a place near Ludlow in Shropshire, it’s set down a little path and on top of a sloping hill that looks down into the valley and the hills long distant. The chapel is really pretty basic, it appears to have been built to not distract from where it is. \n\nIt is of course now for sale.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SilyLavage",
            "body": "https://preview.redd.it/r4685kp15gpe1.jpeg?width=2448&format=pjpg&auto=webp&s=57ff710ef6d3b6b0496a104905293783a8da4b96\n\nI’ll say St David’s, albeit as much for its location as the building itself. The original church was built in a little hollow to help hide it from coastal Viking raids, so the whole place has the air of a little idyll cut off from the world.\n\nIn truth I couldn’t pick a favourite, though, as the UK is full of wonderful churches.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Juan_in_a_meeeelion",
            "body": "The font at Salisbury Cathedral is incredible. And it’s got the tallest spire in the UK… according to Russian travel guides.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Acceptable-Sentence",
            "body": "St Pauls is pretty impressive",
            "score": 4,
            "replies": []
        },
        {
            "author": "Prof_Black",
            "body": "Kings College Chapel, Cambridge",
            "score": 5,
            "replies": []
        },
        {
            "author": "Claire1075",
            "body": "Liverpool Cathedral is pretty impressive!",
            "score": 4,
            "replies": []
        },
        {
            "author": "leobeer",
            "body": "St David’s. I visited once and there was a string orchestra playing Fantasia on a Theme by Thomas Tallis. I sobbed like a baby",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "That's a really great piece of music. It must have been a fantastic experience for you. After reading your comment, I looked for a recording, and found one from Gloucester Cathedral, the venue for the first performance in 1910! I'm listening to it now. [https://www.youtube.com/watch?v=I\\_bdD6uMNyY](https://www.youtube.com/watch?v=I_bdD6uMNyY)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Economy_Judge_5087",
            "body": "Gonna be unpopular and say Coventry. \n\nI’ve been cathedral-bagging for decades and there’s some beautiful ones mentioned in the comments. I don’t think I’ve ever seen one I didn’t like, but they are all variations on a theme.  \n\nCoventry hits differently. The single gigantic space, the use of glass and light, the coherent single-page story and the phenomenal tapestry all combine to make it a different experience to any other cathedral I’ve visited.",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Not an unpopular choice at all (I've seen it mentioned in this thread). It's an interesting juxtaposition of the ancient and the new. Lovely organ and acoustics.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MinMorts",
            "body": "Nothing makes me more patriotic than walking past a lit st Paul's at night",
            "score": 4,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Yes it's amazing. I played a recital there once. Fantastic to experience the building at night after it is shut to the general public.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Appropriate-Sound169",
            "body": "Oh it depends on what impresses you I guess. St Thomas's in Salisbury isn't huge or anything,  but it has an amazing doom painting that always takes my breath away. \n\nhttps://archaeology-travel.com/england/doom-painting-st-thomas-church-salisbury/",
            "score": 4,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I keep meaning to visit (I'm very near). This is my view \n\nhttps://preview.redd.it/xf1isp7vugpe1.png?width=1600&format=png&auto=webp&s=c046eb734ef415e0d1ab34445f2a59a82c208712",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Appropriate-Sound169",
                            "body": "Is that the same church? I mean the one on silver st in town. It doesn't have grounds that big 🤔",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "InevitableFox81194",
                    "body": "I love St Thomas's it's such a beautiful and impressive church. I walk past it daily and every day I'm thankful I live nr such stunning architecture.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 9,
            "replies": []
        },
        {
            "author": "dixieglitterwick",
            "body": "Rosslyn Chapel",
            "score": 7,
            "replies": [
                {
                    "author": "Strawberry_Spring",
                    "body": "Came here to say this - it's not the most physically imposing building, but the carvings are breathtaking \n\nJust happened to be there yesterday, and it was really stunning with the sunlight streaming through the stained glass (perishing cold, but can't have it all!)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "dixieglitterwick",
                            "body": "It’s absolutely breathtaking inside.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dixieglitterwick",
                                    "body": "https://preview.redd.it/4rxc4lyt6gpe1.jpeg?width=1557&format=pjpg&auto=webp&s=b90f55cd6a024f0267c4b5fd3e5141bc51fa7421\n\nMy last visit",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "thesaharadesert",
                                            "body": "FUCK ME YOU CAUGHT A GHOST ON CAMERA!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Prestigious-Garbage5",
                            "body": "I also came here to say the same. Anyone visiting Edinburgh should definitely take the time to visit this 15th century Chapel which featured in Dan Brown's Da Vinci Code, and supposedly had connections with the Knights Templar. Regardless of whether you believe these connections, Rosslyn has a rich verifiable history. The chapel is stunning and the carvings themselves are full of symbolisms and absolutely stunning.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Welshyone",
                                    "body": "I actually got married in there! On the templars thing, me and my best man were hanging about before the service and a bloke in tracky bottoms and t-shirt came up to congratulate me. I thanked him and asked him if he had been to the chapel before. He had a broad Essex accent and I asked him if he was up on holiday and he said “sort of mate - we’re a visiting chapter of Knights Templar”. \n\nThis would have been 2005, so I think about a year after the Da Vinci code was released.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Welshyone",
                    "body": "I got married in there! We booked the wedding about a year before the Da Vinci code came out - it was pretty quiet before that. Was not as quiet 2 years later on the big day, but still brilliant!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dixieglitterwick",
                            "body": "Ah, congratulations! It used to be so quiet - I loved going but it’s so busy now. I saw a play in it once as part of the fringe.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Welshyone",
                                    "body": "When we first visited there was a guy doing a brass rubbing and us and the priest.\n\nWe visited the following year (with another year to the wedding) and the book had been released by then. Place was heaving (literally over 100 people inside and outside), so we asked if we would be able to keep the doors closed for the service. A wedding is apparently a public service, so you aren’t allowed to keep people out and the Mrs was a bit upset.\n\nOn the day though, we just put my brothers on the doors and they asked if people would mind holding on until the ceremony was finished and everyone did. This meant that we got to walk out of the church into a big crowd of strangers. Felt like a celeb!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "dixieglitterwick",
                                            "body": "Sounds amazing ☺️ Hope you have many happy years ahead x",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Useful_Shoulder2959",
            "body": "It’s a cathedral in Cardiff. Begins with L, sorry I suck at Welsh. \n\nHas a very interesting tomb stone carving inside. ",
            "score": 3,
            "replies": [
                {
                    "author": "OzyTheLast",
                    "body": "Llandaff",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Maximum_Scientist_85",
                            "body": "I know the Dean there. Really lovely guy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LucDA1",
                    "body": "Probably llandachllwrwbchllanfanllo or me when I choke on a piece of sweetcorn.\n\nLove your language Welsh people I'm sorry 😭",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Useful_Shoulder2959",
                            "body": "This is honestly the best representation of a non-welsh person. \n\nWe do bloody love you leek loving warriors 🏴󠁧󠁢󠁷󠁬󠁳󠁿\n\nPopty-Ping!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "stinkybumbum",
            "body": "Durham or York for me. Both astounding",
            "score": 3,
            "replies": []
        },
        {
            "author": "JustJezebeluk",
            "body": "Wells. It’s astounding.\n\nhttps://preview.redd.it/jwrymmlqagpe1.jpeg?width=3024&format=pjpg&auto=webp&s=e637054c94eba340707406988307a49e7d1c5d43",
            "score": 3,
            "replies": []
        },
        {
            "author": "samchef",
            "body": "St Wilfred's Church in Preston. Bit unassuming on the outside apart from the line of swastikas (pre ww2) on the wall. The inside is gorgeous, especially the way the windows capture light, makes you feel like you're in a holy place.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Magpie213",
            "body": "York Minster\n\nAbsolutely huge and gorgeous\n\nThere was one stone statue of Mary that escaped Henry  VIII during the dissolution of the monasteries",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beowulf_98",
            "body": "We've got two in Norwich, but the one in Tombland (Really old part of Norwich) has a pretty extensive history and is pretty spectacular!",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Yes both are interesting in their own ways. I've read that the catholic cathedral was built by the Duke of Norfolk and the mediaeval cathedral, not dissimilar from Salisbury, has an impressive spire and a great setting down by the river. Talking of Norwich, you have a wonderful Victorian post office (I think now it's been turned into flats).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "notlits",
            "body": "The octagon tower (made of wood not stone) at Ely is amazing, well worth the tour up it. I’ve been told it couldn’t be made today as there aren’t enough suitable sized oak trees in the UK. Given the relative size and remoteness of Ely the giant cathedral seems quite incongruous.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SufficientAnonymity",
            "body": "Also a big fan of Ely - the internal structure of the lantern is so cool!",
            "score": 3,
            "replies": []
        },
        {
            "author": "PullUpAPew",
            "body": "Worcester not only has a stunning location, right on the east bank of the Severn, but you can go up the tower and enjoy a cracking view",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "It's fun watching the swans too!\n\nhttps://preview.redd.it/gn0hxgbisgpe1.png?width=1024&format=png&auto=webp&s=6a03af31c7a6ed540e09e7f20d2ab26cc4d8a9b0",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SkipperTheEyeChild1",
            "body": "I grew up in both Lincoln and Durham so thought they were just normal Cathedrals. Didn’t realise how wonderful they both are until moving away. I think Lincoln has the edge personally. You can see it for fucking miles!",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Helped a little by the STEEP hill. I don't know Durham at all. I'll have to visit one day.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Affectionate-Award46",
            "body": "Lincoln, for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "stanley_ipkiss2112",
            "body": "Salisbury would be my choice, but I have a spft spot for Winchester.",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I have never been to Winchester, I'd like to visit one day.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "stanley_ipkiss2112",
                            "body": "Very good library, has a nice crypt with a Anthony Gormley statue in it and great walks around 🙏🏻",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "Salisbury has Edward Heath in a transept. I amuse myself by saying \"I'll meet you on Edward Heath\". \n\nhttps://preview.redd.it/cwrxnuecahpe1.png?width=1000&format=png&auto=webp&s=c58f549eaf15fc4c67418c06a15b132c5cba7ad7",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "hasthisonegone",
            "body": "I was lucky enough to visit York Minster when they had removed all the pews, which meant you could just wander around staring at the windows and roof, no danger of running into anything. That left an impression. I also really liked Liverpool Cathedral, it’s got a weird way of making you feel very very small as you walk around it.",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Both great buildings, I agree.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pieboy8",
            "body": "Salisbury cathedral. I went with some Russian friends and it simply took my breath away.",
            "score": 3,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Russians seem to like Salisbury.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrsdontknowwhoiam",
            "body": "I’m not a religious person at all but there is something incredibly serene and calming about buckfast abbey.",
            "score": 3,
            "replies": []
        },
        {
            "author": "stanagetocurbar",
            "body": "Chesterfield Spire. I've lived here for 15 years and still have a little chuckle every time I look up at it. Really surprised it's not more famous.l (Google 'Chesterfield Spire' if youve never heard of it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Wubnado",
            "body": "Warhammer world has a load of dioramas of Cathedrals",
            "score": 10,
            "replies": []
        },
        {
            "author": "arioandy",
            "body": "Bath",
            "score": 6,
            "replies": []
        },
        {
            "author": "Linfords_lunchbox",
            "body": "Not the most impressive, but I do like the interior of Paddy's Wigwam.\n\nAlso a shout out to the splendid ceiling of Carlisle Cathedral.\n\nDurham Cathedral is good. I'd love a replica of the lion doorknocker.\n\nBut with considerable personal bias (I had family living there growing up so I visited many times), [Hemingbrough Church](https://en.wikipedia.org/wiki/St_Mary_the_Virgin%2C_Hemingbrough?wprov=sfla1) in North Yorkshire.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ArtemisLi",
            "body": "Came to say Ely! Used to play at the Carol concerts there, the acoustics are lovely. And I love finding the secrets in the carvings and paintings.",
            "score": 2,
            "replies": [
                {
                    "author": "DoctorOctagonapus",
                    "body": "That statue of Mary though..",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ArtemisLi",
                            "body": "Certainly a... choice, shall we say 😅 But, if I'm remembering rightly, there's a hidden Green Man in the carvings around that room, which I always enjoy trying to spot when I visit.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iCowboy",
            "body": "Going to have to say Coventry - the glass - especially in the Baptistry and the quality of the modernist stonework is just sublime. Followed by the Metropolitan Cathedral in Liverpool - again for its gorgeous glass.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WorldlinessNo874",
            "body": "Wells cathedral, took my breath away.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoTurkeyTWYJYFM",
            "body": "York Minster. It's just insanely big",
            "score": 2,
            "replies": []
        },
        {
            "author": "RaveyDGravy",
            "body": "Daventry",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Interesting. I'd never heard of it and had to look it up! [https://en.wikipedia.org/wiki/Holy\\_Cross\\_Church,\\_Daventry](https://en.wikipedia.org/wiki/Holy_Cross_Church,_Daventry)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AbuBenHaddock",
            "body": "Not the most impressive, but massively overlooked: Llandaff Cathedral, just outside Cardiff.  Very impressive inside, and the walk along the river from the city centre is lovely.  \n\nFuck you, _Visit Wales_, for doing such a shite job of promoting the country and its cultural sites.",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "The only cathedrals I know in Wales are Bangor (very old and small, but tbh I thought a bit dull), St. Asaph and St. David's. Llandaff would be fun to visit.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AbuBenHaddock",
                            "body": "In a bid to get more people in, they often hold candlelit concerts. It's really worth checking out if you're visiting Cardiff.\nAnd there's a nice Indian restaurant and a tearoom nearby.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "Thanks for the tip. A question (probably daft), but does Cardiff have its own cathedral in addition to Llandaff?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Golden-Wonder",
            "body": "Hereford is impressive, listened to an Elgar concert there once!",
            "score": 2,
            "replies": [
                {
                    "author": "furrycroissant",
                    "body": "Hereford has nothing on Worcester",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea-Still5427",
            "body": "Norwich! Best for families as plenty to intrigue young minds. It has a copper font that came from the Rowntrees factory where it was used to make caramel. The roof bosses in the cloister are an interesting mix of bible stories and folklore, which says something about the medieval mind. There's also graffiti on the walls from naughty choirboys and monks centuries ago.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PromotionLoose2143",
            "body": "Kilpeck Church in Herefordshire.  It's famous for its stone carvings which are incredible and include some very saucy  sheelanagigs",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Interesting. I don't know it at all. [https://en.wikipedia.org/wiki/Church\\_of\\_St\\_Mary\\_and\\_St\\_David,\\_Kilpeck](https://en.wikipedia.org/wiki/Church_of_St_Mary_and_St_David,_Kilpeck)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weird_Surprise6221",
            "body": "Chaldon church which uncovered the mural on the wall when it was being renovated many many moons back, visited it with the school 40 odd years ago and it’s insane. \n\nIt’s only a tiny church too, but too often overlooked",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "Interesting. I don't know it. [https://en.wikipedia.org/wiki/Church\\_of\\_St\\_Peter\\_and\\_St\\_Paul,\\_Chaldon](https://en.wikipedia.org/wiki/Church_of_St_Peter_and_St_Paul,_Chaldon)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Weird_Surprise6221",
                            "body": "It’s a beautiful tiny 11th century church and photos don’t do the mural justice, it’s incredible that was just ‘found’ under the plaster and it’s absolutely ancient, definitely worth a look if you’re able 👍",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "Thanks for the tip!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Feline-Sloth",
            "body": "For impressive Parish Churches I would have to say Romsey Abbey and Christchurch Proiry",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I've heard about Romsey, but have never been.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Feline-Sloth",
                            "body": "It's worth it in my humble opinion",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "Not far from where I live, so I'll have to go one day.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "itsjustjust92",
            "body": "Can’t remember what church it was but had a great churchyard for dogging",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lady_Hamthrax",
            "body": "Ely is by far the best, I never tire of seeing it across the landscape. And when I’ve been travelling it is my sign I’m nearly home. \n\nAlso, just wondering in one day and listening to a rehearsal of Mozart’s Requiem under the octagon was an amazing experience.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Defiant-Tackle-0728",
            "body": "I love York Minster \n\nBut Westminster Abbey too is up there. \n\nI'm also a huge fan of the mosaics in the RC Westminster Cathedral",
            "score": 2,
            "replies": []
        },
        {
            "author": "InevitableFox81194",
            "body": "I'd say Salisbury, but im biased as I'm a resident. \n\nI have to say I like the red brick of Chester cathedral, though. We aren't a religious family, but my daughter and I had a thing for visiting cathedrals as she did a Level Architecture, and she loved the imposing feel Cathedrals gave off.",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I like the city centre and know the cathedral. Years ago I lived for a time in North Wales, so know that area fairly well.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "InevitableFox81194",
                            "body": "Ironically my daughter is now at uni in Wales. It was the best thing she's ever done. She's absolutely in love with the place.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "Interesting. Which one?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "InevitableFox81194",
                                            "body": "Aberystwyth.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Upstairs_Drive_5602",
                                                    "body": "OK. I don't know it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "InevitableFox81194",
                                                            "body": "We've found people either respond like you just did, or not only know it but either went or had a family member or friend thay went and rave about it. \n\nIt's a beautiful seaside town hidden on the other side of the brecon beacons and is one hell of a car ride. It's the only university in the UK to do the course my daughter wanted.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "puffinrust",
            "body": "Lincoln for me\n\nhttps://preview.redd.it/wp63lkbg9hpe1.jpeg?width=3264&format=pjpg&auto=webp&s=8d2197798bb5a4313496bd71db862227604e212d",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "The pub on the corner is handy for evensong.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "puffinrust",
                            "body": "That’s one way to describe it ..",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "In your photo above. I've no idea what it's called.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "puffinrust",
                                            "body": "Sorry, I was pulling your leg, describing a trip to the pub as ‘evensong’ .",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Upstairs_Drive_5602",
                                                    "body": "😂 I often combine the two",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MISSION-CONTROLLER1",
            "body": "Salisbury Cathedral",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I live next door and am just on my way to evensong there!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "puffinrust",
            "body": "Honourable mention for St. James church Louth",
            "score": 2,
            "replies": []
        },
        {
            "author": "BeanOnAJourney",
            "body": "It may not be well known or very big, but St. Mary Magdalene church in my town Launceston, Cornwall has the most exquisite carved exterior and I think it's beautiful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GoldenKettle24",
            "body": "I remember going to some fancy Christmas Carol service at St Pauls Cathedral when I was about 9 or 10, and it was mighty impressive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OrganizationOk5418",
            "body": "I love impressive churches and it's a terrible affair when they are left to go to ruin.\n\nBut I can't help thinking about the poor people who almost certainly died building it. Probably on some daft promise of \"salvation\".",
            "score": 2,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "That's very true. There must have been many fatalities.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "colinah87",
            "body": "York Minster",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mook_138",
            "body": "The Yorkminster or St Pauls",
            "score": 2,
            "replies": []
        },
        {
            "author": "Glitterkelxo",
            "body": "Canterbury Cathedral, I recently worked at the silent disco they held there with 800 people singing 80’s tunes. Was fab!\n\nhttps://preview.redd.it/o73ymlqcxhpe1.jpeg?width=4284&format=pjpg&auto=webp&s=fc27e40041b1bb0734b170cccf510fe34caa83df",
            "score": 2,
            "replies": []
        },
        {
            "author": "uffington",
            "body": "https://preview.redd.it/29ujzjfsthpe1.png?width=450&format=png&auto=webp&s=69a306af58a5e21aa12c11c08abf3e84e006b12d\n\n  \nSt Enodoc, Cornwall. It looks like it was left too close to a radiator, it's in the middle of a posh golf course, and Sir John Betjeman is buried there.\n\nIt's quiet and lovely, though. And I love Betjeman.\n\nLast time I visited, a few years ago, it was late autumn and there was a overflowing basket of veg, herbs, eggs etc left in the porch. I got Wicker Man sacrifical vibes, so gently added a KitKat for the oncoming Winter.\n\nThat night in a pub in Padstow, a local told me that people did this to get fresh produce to each other without having to drive.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpasmodicSpasmoid",
            "body": "Westminster",
            "score": 4,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I think Westminster Cathedral (near Victoria Station) is more impressive on the outside than the inside. The Abbey both inside and outside.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheScarletCravat",
            "body": "So funny to see people saying anything other than the gargantuan Liverpool Anglican Cathedral.\n\n\nOnce you've been inside that, it's game over. Pack up. ",
            "score": 1,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I know it well. It's massive and the pipe-organ there is the biggest in the country. Well worth hearing (and playing).",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SilyLavage",
                    "body": "Bigger doesn’t always mean better. I like Liverpool, but it’s pretty cavernous and it doesn’t feel like every space has a purpose.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mustbejoking_13",
            "body": "Wrexham Parish Church. \nI remember doing a school project that meant I had to go on to the roof at some point. Spectacular views.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleeplaughter",
            "body": "I went to [St Mary's](https://www.stmarys-daltonholme.co.uk/) in South Dalton (East Yorks) the other week.  Small church in a \"blink and you'll miss it\" village with fantastical delusions of grandeur.  Like a mini Salisbury Cathedral.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gandyg",
            "body": "York Minster is amazing as it looms over you as you approach it.\n\nIn terms of smaller cathedrals, the blue and yellow stars of Carlisle Cathedral ceiling are simple but stunning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "discotheque-wreck",
            "body": "Rosslyn Chapel's probably the most unusual.\n\nIt's difficult to stand out as a church when they're all pretty much designed to be the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldenArchmage",
            "body": "Westminster Cathedral is interesting - partly because most people don't know it even exists and partly because it's still not finished more than a hundred years after being built (there's blackened brick in a lot of areas where there's supposed to be elaborate mosaic tiles).",
            "score": 1,
            "replies": []
        },
        {
            "author": "bopeepsheep",
            "body": "Gloucester cathedral; the Italian Chapel on Orkney. Very different, but both beautiful.",
            "score": 1,
            "replies": [
                {
                    "author": "Appropriate-Sound169",
                    "body": "Ohhh you just reminded me of the Italianate church in Wilton\n\nhttps://www.britainexpress.com/attractions.htm?attraction=4562",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "angelofjag",
            "body": "St Laurence's Church, Bradford-on-Avon\n\nBeautiful in its simplicity",
            "score": 1,
            "replies": []
        },
        {
            "author": "Status_General_1931",
            "body": "St Giles Edinburgh or Rosslyn Chapel, the attention to detail on the carvings and the acoustics are outstanding",
            "score": 1,
            "replies": [
                {
                    "author": "Welshyone",
                    "body": "Can’t believe I had to scroll all the way down here for St Giles! The building itself is amazing, but the way it forms part of a complex of other medieval buildings is amazing.\n\nLove Rosslyn Chapel too. So much so that I got married there!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "byjimini",
            "body": "We happened across the church at the top of the hill above Aysgarth Falls in North Yorkshire - there’s a stone carving of the last supper behind the alter which is absolutely stunning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShuckingFambles",
            "body": "Check out Chapel Of St. Mary The Virgin, Clumber Park. It's a stunning gothic revival style church, set on its own in parkland. Has amazed me for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kank84",
            "body": "I'm bias because it's where I grew up, but I love Bath Abbey",
            "score": 1,
            "replies": []
        },
        {
            "author": "MuttonDressedAsGoose",
            "body": "I think I enjoyed Canterbury most. It's got a lot going on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trollied",
            "body": "The Pitcher & Piano in Nottingham.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaurusUK",
            "body": "Maybe a bit biased because it's my home town, but Hereford. Also the Mappa Mundi within it is quite something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "armandricemabbit",
            "body": "Malmesbury Abbey is worth a gander should you be in the area - I still can't understand why Elmer The Flying Monk isn't a member of an as yet unrealised cinematic universe of inept clergy",
            "score": 1,
            "replies": []
        },
        {
            "author": "RonLondonUK",
            "body": "St Paul's cathedral in London is awesome 👍😎 especially the service",
            "score": 1,
            "replies": []
        },
        {
            "author": "gang-747",
            "body": "I’ve only been to a few…\n\nCanterbury I liked\nWells was beautiful, the whole place I mean \nChelmsford…well…yeah \nSheffield….again\nRochester is nice, but compact \n\nMay have been to more but forgotten so can’t have been that good!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accurate_Till_4474",
            "body": "St Nicholas, Little Braxted, Essex. Outwardly an unassuming small Essex church, but the interior is truly amazing. Father Ernest Geldart transformed it over 20 years. There is not a surface that isn’t painted, stencilled, engraved or gilded.",
            "score": 1,
            "replies": []
        },
        {
            "author": "That_Organization901",
            "body": "From outside, I’m partial to Arundel, especially from the train. \n\nAlso St Michael’s Mount isn’t on here which is odd.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Coldgunner",
            "body": "Peterborough is very underrated. Take a tour of the upper levels and roof and you'll see so much that you can't see as a drop in visitor. Peterborough is also incomplete in that one of the towers was never finished, so it's slightly uneven.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sunheadeddeity",
            "body": "St. Magnus in Kirkwall. Built by Vikings.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SinsOfTheFurther",
            "body": "Rosslyn Chapel",
            "score": 1,
            "replies": []
        },
        {
            "author": "giantquail",
            "body": "The brutalist cathedral in Bristol. Awe inspiring, even for an atheist like me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Norwich_BWC85",
            "body": "Norwich. If you have a thing for places of worship Norwich has the most churches per sq mile of any city in Europe. \n\nNorwich Castle is about to reopen too after 4+ years of renovation, the view from the battlements give you a clear view of all of the churches to be found across the city.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cathairpc",
            "body": "Ages ago Chester cathedral did a candle lit tour at night, and it was magical/spooky/awe-inspiring. I've never felt so transported back in time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oh-Its-Him-",
            "body": "Small shout out for Norwich Cathedral. Really like Norwich as a city to visit and the cathedral and surrounding areas are so lovely and quaint.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oh-Its-Him-",
            "body": "Small shout out for Norwich Cathedral. Really like Norwich as a city to visit and the cathedral and surrounding areas are so lovely and quaint.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThickTadpole3742",
            "body": "I love Ely Cathedral, the stained glass is amazing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual_Neck_4205",
            "body": "St  Beuno's, Culbone. Its actually England's smallest church. The impressive thing about it is its age and location, its a pre-Norman picture postcard fairytale church",
            "score": 1,
            "replies": []
        },
        {
            "author": "Usual_Neck_4205",
            "body": "St  Beuno's, Culbone. Its actually England's smallest church. The impressive thing about it is its age and location, its a pre-Norman picture postcard fairytale church",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrganizationOk5418",
            "body": "First time I saw Ely Cathedral was approaching it from the north on a train, truly imposing the landscape.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brief-Freedom734",
            "body": "york or chester are both very impressive",
            "score": 1,
            "replies": []
        },
        {
            "author": "silversurfer63",
            "body": "All hallows by the Tower - not because of grandiose stature which a claim could never be made but due to age and history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bluejeansseltzer",
            "body": "Winchester, but I’ve not been to many",
            "score": 1,
            "replies": []
        },
        {
            "author": "olagorie",
            "body": "York Minster",
            "score": 1,
            "replies": []
        },
        {
            "author": "jawide626",
            "body": "Liverpool Anglican Cathedral - biggest cathedral in the UK and 8th biggest in the world, it's absolutely majestic to walk around the inside and the garden bit outside. As it gets dark the building gets lit up and can be quite imposing, but regardless of day or night time it's a beautiful building.\n\nAnd at the other end of the road is the Liverpool Metropolitan Cathedral, AKA 'Paddy's Wigwam' which is a uniquely shaped cathedral which isn't as majestic inside or outside as it's Anglican counterpart but is still a lovely building to walk around.",
            "score": 1,
            "replies": []
        },
        {
            "author": "homemadegrub",
            "body": "I'm going to say Exeter cathedral bc it's the only one I've been to, do I need to see more?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Button_Slight",
            "body": "Llandaff. Love or loathe it the Epstein Majestas is a talking point.\n\nhttps://preview.redd.it/duka4savaipe1.jpeg?width=1024&format=pjpg&auto=webp&s=fb8e49da46a57db9517e5ea92c84b86a5bb3ff0a",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tackit286",
            "body": "Norwich\n\nWinchester",
            "score": 1,
            "replies": []
        },
        {
            "author": "Apollo_satellite",
            "body": "It's small, but Howden Minster is lovely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sunshinetrooper87",
            "body": "Ely,  I was confused and scared by the vast amount of moris dancers about. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrDaxon",
            "body": "I really like the visible differences in eras from the extensions on St Albans cathedral.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timely_Atmosphere735",
            "body": "Winchester cathedral is nice.\n\nChurches - St Thomas a Becket church in Brightling East Sussex - there is a pyramid tomb to a politician from the 18th century.\n\nSt Augustine’s in Brookland on the Romney Marsh in Kent, it has a unique steeple.\n\nhttps://preview.redd.it/ppxhkpbwmipe1.jpeg?width=1290&format=pjpg&auto=webp&s=80f65ebdf91121c704147747dca35ba372d40704",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpongeBazSquirtPants",
            "body": "Ely stands out all the more because the rest of the town is so tiny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crumblingruin",
            "body": "Chichester Cathedral - not so much for the building, although it's beautiful, but because it has a Chagall window, the tomb of Gustav Holst, and THAT tomb described in Larkin's famous poem An Arundel Tomb.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_dancing_hamster",
            "body": "Liverpool had two, both unique but the red sandstone one is absolutely breathtaking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Preacherjonson",
            "body": "Canterbury certainly is something. \n\nThe relics, the design, the ambience. 10/10",
            "score": 1,
            "replies": []
        },
        {
            "author": "furrycroissant",
            "body": "I'm biased but Worcester is my favourite",
            "score": 1,
            "replies": []
        },
        {
            "author": "aslat",
            "body": "Let's not forget the wayside chapels and churches that are usually maintained by local enthusiasts. Saxons and Norman churches, musty smell, coupled with a few commonwealth war graves",
            "score": 1,
            "replies": []
        },
        {
            "author": "abigailgabble",
            "body": "cool. haven’t been but good to see as i’ve recently finished Tom’s Midnight Garden with my son.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReleaseTheGrease",
            "body": "Funny to think how many houses or hospices all that stone, glass and money couldve built\n\nBut nah, lets build monstrosities to keep them empty",
            "score": -6,
            "replies": [
                {
                    "author": "Upstairs_Drive_5602",
                    "body": "I don't think it is nearly as simple as you suggest. \n\nWhile it's easy to look at cathedrals today as vast, largely ceremonial spaces, their original purpose was far more functional. These were not just places of worship but also vital community hubs. Cathedrals and monastic institutions ran schools, provided medical care, offered shelter to the poor, and played a key role in preserving and spreading knowledge. Unlike secular wealth, which was often hoarded by the monarch and nobles, much of the wealth tied up in these buildings actively benefited society for centuries.\n\nThe real shift came with the Reformation. Henry VIII’s dissolution of the monasteries stripped these religious institutions of their land, income, and ability to serve the public. What had once been centres of charity, education, and healthcare were left as oversized churches, many struggling for purpose in a world where their wider societal functions had been dismantled. In that sense, their decline wasn’t due to their construction but to their later disempowerment.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wholesomechunk",
                            "body": "They didn’t ruthlessly collect tax then?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ReleaseTheGrease",
                            "body": ">These were\n\nIndeed. Thank you for emphasising my point.\n\nIt's time to repurpose.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Upstairs_Drive_5602",
                                    "body": "I'm simply saying that Henry VIII stripped these ancient monastic establishments of much of their original purpose. These days they are used in many - but different - ways. None that I'm aware are supported by the government or tax revenue. I live near to Salisbury Cathedral and know that it costs about £20k a day to keep the building running. All of this money comes from donations, the collection plate and visitors. The cathedral is important for propagating exceptional music, but also provides a space for the city to stage concerts etc.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}