{
    "title": "How much have you roughly spent on house maintenance over the last 10 years?",
    "author": "Exchangenudes_4_Joke",
    "subreddit": "CasualUK",
    "rank": 17,
    "score": 16,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 71,
    "url": "https://www.reddit.com/r/CasualUK/comments/1jeat5r/how_much_have_you_roughly_spent_on_house/",
    "id": "1jeat5r",
    "selftext": "Currently writing a budget for a possible house move and want to make it as realistic as possible. Appreciate house maintenance costs can vary massively due to size, age, condition and location of a house, but wanted to get a feel for what people have actually spent over a long period (hence 10 years as some jobs such as replacing carpet/flooring we'll only probably do once in that time period). That way I can average out over to an annual cost.   \n\nAnd an idea of what you routinely do and/or pay someone to do would be useful too; such as annual boiler service, cleaning gutters that sort of thing.  \n\nAnd finally I'm not looking for costs related to 'big' home improvements like a new kitchen, new decking or an extension, I've got a separate budget line for that.  \n\nCheers! ",
    "comments": [
        {
            "author": "andrew0256",
            "body": "Without knowing anything about the house or your DIY skills, or even how long you intend to be in the house, start at about £1K per annum. This is for maintenance mind, not major replacements or refurbs.",
            "score": 37,
            "replies": [
                {
                    "author": "Gaunts",
                    "body": "£1k per annum god damn landlords be raking it in eh? rents nearly 1k a month for most lol",
                    "score": -2,
                    "replies": [
                        {
                            "author": "coldazures",
                            "body": "You're paying their mortgage you dafty.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ForwardImagination71",
                                    "body": "My landlord hasn't got a mortgage on the house I rent from him.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "entered_bubble_50",
            "body": "Budget for roughly 0.5 to 1% of the value of the house per year. There will be years where you spend less, but eventually, everything in a house needs to be replaced if you're there long enough. Kitchens, bathrooms, windows are the big ticket items.",
            "score": 17,
            "replies": [
                {
                    "author": "imtheorangeycenter",
                    "body": "Apply a location and taste (poncyness?)) un-multiplier though, identical mid-terraces in Islington and $town are going to be multiples in price away from each other but require the same essential upkeep.\n\n\nIf you've got kids though, all rules are useless!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "pm_me_your_amphibian",
            "body": "Not much in 8 years, few grand to paint the exterior and gardening etc.\n\nAs of year 8, treated ourselves to a nice new bathroom (13k) then in a grand and unrelated fashion, the shit hit the fan.\n\n50k+ bill incoming. Flooded multiple times. Half the roof needs replacing. All the second floor had to get ripped up to troubleshoot and fix some electrics which also ruined the walls in the lounge downstairs. Carpets ruined ripping up the floors. I can’t handle a single extra thing.",
            "score": 8,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "Blimey, sorry to hear that. Was the flooding not covered by insurance?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "pm_me_your_amphibian",
                            "body": "Sadly not, no. We can’t prove where the water came from, so therefore can’t prove it isn’t groundwater, therefore not covered. It’s a horrible situation honestly - no avocado on toast for us for a while.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ki1664",
                    "body": "Holy crap how old is the house",
                    "score": 3,
                    "replies": [
                        {
                            "author": "pm_me_your_amphibian",
                            "body": "The building itself is partly late 1700’s but has two extensions done in the 2000’s. Flooding is purely climate changes we think - groundwater. Insurance computer says no. \n\nUtterly miserable.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FaceMace87",
            "body": "I have only lived in my house for 6 years but I figure that is enough to get a rough idea of cost.\n\n**Essential Maintenance -** Only around £150 for a boiler service\n\n**Choice Maintenance -** About £7,000 on plastering walls in 3 rooms, new carpets, new floor for the entire downstairs, 4 new doors and door frames, a new bay window seat (the old one was literally rotten), all new electrical sockets and a few other more minor bits.\n\nWe also had a new kitchen, garden decking and driveway but none of those were maintenance.",
            "score": 8,
            "replies": [
                {
                    "author": "Manovsteele",
                    "body": "Surely boiler maintenance is choice too? Maybe I'm just cheap but we've not had ours done since we moved in 7 years ago.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "FaceMace87",
                            "body": "I see maintaining the boiler as something that needs to be done. I am sure most Brits do the old \"I'll leave it until it breaks\" routine however,",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Exchangenudes_4_Joke",
                                    "body": "Yeah I see an annual boiler service as essential too, not least to mitigate CO concerns and keep the efficiency as high as possible",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Regular_Zombie",
                            "body": "My home insurance won't pay out for a bunch of incidents if the boiler hasn't been serviced in the last 12 months.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Puzzleheaded_Drink76",
                            "body": "Voids my warranty if I don't ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "heresanupdoot",
                            "body": "Do you mean maintenance or a service? No boiler service invalidates many insurance policies",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "squashed_tomato",
                            "body": "Seeing as a renter our boiler is by law supposed to be checked once a year I'm assuming 7 years is pushing it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EyeAlternative1664",
            "body": "TBH only about 8k, which was replacing all windows. Have spent more on side return, loft and bathroom but none of those were maintenance. \n\nNow I am worried something will break.",
            "score": 10,
            "replies": []
        },
        {
            "author": "judochop1",
            "body": "The only things we've had so far:\n\nNew roof - 15k, ripped off and lied to on this one, should have been 10k max\n\npainting the house twice ourselves - few hundred\n\nnew kitchen -  3k\n\nnew bathroom - 5k\n\nrepointing and some yard work and other bits and bobs - 4.5k\n\nregular servicing and bits and bobs of various crap - few hundred\n\n  \nso about 25-30k. 3k a year, sounds about right!",
            "score": 3,
            "replies": [
                {
                    "author": "FaceMace87",
                    "body": "A kitchen for 3k? Did you fit it yourself?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "therealtimwarren",
                            "body": "\"Fit\" might be a bit strong!\n\nhttps://preview.redd.it/8u2s4k3byhpe1.jpeg?width=700&format=pjpg&auto=webp&s=3ac09b0fd583b72ef260a426548a2f261ebe90a5",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zeeterm",
                    "body": "3K for a kitchen? Even self fitted that sounds like a steal. Quotes from the big suppliers seem to start at 20k even though I assume that's a \"haggle us down\" price, that's still so far from 3k.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "judochop1",
                            "body": "teeny tiny kitchen tbh",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "double-happiness",
                                    "body": "[TFW](https://www.thetoycentre.co.uk/wp-content/uploads/LHTZ004-retro-kitchen-lifestyle-eliana-1.jpg)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "notouttolunch",
                            "body": "I installed my own kitchen. Quite a lot of it. 3500 including worktops. DIY kitchens.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "FaceMace87",
                            "body": "We recently had a kitchen fitted and it came to £7.5k and that is still with us shopping around for cheaper worktops etc.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Zeeterm",
                                    "body": "Which worktops did you get? It's a big factor in my stalling out ordering and it's not the sort of thing I trust online \"reviews\" for.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FaceMace87",
                                            "body": "We went for African Teak in the end, it is on the higher end of the solid wood worktops but has been worth it so far. If you want a cheaper solid wood option Oak is perfectly fine, you will just need to stain it if you wanted it darker, you can get 3m lengths of it for £200 from Wickes. \n\nPeople recommended Quartz to me but it feels so cold all the time and I didn't want to spend that much.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Chaoslava",
                                                    "body": "I have quartz (or granite? Yeah it’s granite) when we moved in and I love it. When you’re cooking a roast and you need somewhere to put a hot pan that’s come off the hob or out the oven and you can just bang it on the counter with full confidence, it’s brilliant!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "buzz_uk",
            "body": "Over the time we have lived in our current house, excluding extensions, major refurb and new equipment we spend between 750 and 2000 a year on repairs and maintenance. Hope that helps in its vagueness :) good luck with your new place",
            "score": 4,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "No not vague at all, it's all useful as £2/£3k a year seems to be the average so far.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "redunculuspanda",
            "body": "Maybe around 30k.  Most of that was fairly major roofing work and an over priced bathroom. \n\nI should probably replace the kitchen in the next few years that’s going to be painful.",
            "score": 3,
            "replies": [
                {
                    "author": "ac0rn5",
                    "body": "I'm too scared to add up how much we've spent.  \n\nWe also had to have a new roof and some new windows.  \n\nThe only thing I can admit to is some new fencing which cost about £800. It's already lasted longer than the DIY repairs my husband did on the old(er) fence, which kept falling over in the wind. We opted for concrete posts and concrete gravel boards.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "byjimini",
            "body": "1% of the value of the house per year is usually the norm, even though house values are even more made up these days. \n\nWe’ve spent about that on new windows and front door since they were knackered and leaking heat.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Reasonable-Fail-1921",
            "body": "I’ve been here nearly 6 years, I was a single first time buyer so I’m only recently being able to afford to do bigger stuff. House was dated but in decent condition so there’s a lot of stuff that I’d like to do but have only done the necessities & things I can easily do myself. For context it’s a 1950s semi detached. \n\nI’m quite lucky that I know trades through work, I’ve had a plumber in 3 times for various things and he refused to take any money from me, so that’s kept costs down too. \n\n- £1800 for a new fence that was falling down. \n- £300 to install a modern fuse box.  \n- £100 to install new shower (This & fuse box was done at same time by a sparky I know)\n- £300 boiler repair not long after I moved in, then a year later I paid around £180 for 2 call outs under my boiler cover for another repair to it. Monthly boiler cover is £16. \n- £250 for 2 rounds of gutter clearing. \n- £200 for repair of crumbling point around one of the windows \n- £1000 est. decorating costs : I’ve painted most of the rooms once, done the kitchen twice & includes the kitchen where I removed all doors, sanded down and repainted, then installed the sticky back plastic stuff on the insides of the cupboards and drawers to update it all - this was mostly time cost really, £1k is an estimate for all paint, brushes, accessories etc \n- £200 est. maintenance for old garden fence before replacement, and for garden shed which needed sanding back to bare wood and redoing. Includes price of buying a decent sander. \n- £300ish on new window coverings throughout\n- £100 for tree surgeon to take back neighbour’s large overgrown hedge to boundary fence \n- Have spent a decent amount on my garden with plants, edging, tools, etc as I’m a keen gardener, I couldn’t even estimate a cost for that but obviously not an essential!",
            "score": 2,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "Cheers for the comprehensive breakdown, really useful. Including the boiler cover that works out to about a grand a year on average, you're lucky you've got a trades contact!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Reasonable-Fail-1921",
                            "body": "Oh absolutely, I dread to think what I would’ve had to pay for a different plumber! He unblocked my outside drain for me, capped off some pipes under the sink which had been previously ‘sealed’ with a gob of blue tack and some masking tape (I wish I was joking!) by the previous occupant and also finished changing a tap I had started myself as the connections under the sink were so random he’d actually never seen them in his entire career!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "urban_shoe_myth",
            "body": "In 7 years, we've:\n\nEntire house decorated before moving in, 1k\n\nReplaced boiler and some of the pipe work, about 2k\n\nNew front door and window, £1.5k\n\nReplaced tiled floor in bathroom, £200ish (DIY)\n\nReplaced section of kitchen ceiling due to bathroom floor incident above, probably another £200ish (DIY)\n\nDecorated each room again once in that time, £500ish (DIY)\n\nReplaced fridge freezer, dishwasher and oven because they all died over the same weekend - it was so weird, they were all integrated and installed when the kitchen was fitted well before we moved in, their life spans just happened to be identical? Crazy. Anyway, about £1.3k\n\nNew carpets upstairs, £650 fitted. Got some good roll end deals. \n\nWe've been very lucky I think. Aside from minor jobs like replacing a broken toilet flush, a slightly leaky pipe joint under the sink, or some broken door handles we've spent a grand total of about £7k. We know the whole house needs new windows and back door which would have knocked it up another £8k ish, but instead of doing that we decided to move. They can be the next people's problem.",
            "score": 2,
            "replies": [
                {
                    "author": "sallystarling",
                    "body": ">Replaced fridge freezer, dishwasher and oven because they all died over the same weekend - it was so weird, they were all integrated and installed when the kitchen was fitted well before we moved in, their life spans just happened to be identical?\n\nThat's bizarre! I guess it makes sense for them to have vaguely similar lifespans, but down to the day?!\n\nWe're getting a whole new kitchen as we speak. We inherited a load of landlord specials when we bought our house (formerly a rental) and nothing was worth keeping. I guess I'll psych myself up for a hideous weekend at some point in the (hopefully very distant!) future when all my nice new things that I've just bought die at the same time!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "heresanupdoot",
            "body": "Oh boy where to start!\n\nOld 2 bed cottage. North.\n\n X2 chimney rebuilds (we knew when buying we had to do this) 4k. \n\nIn the past 4 years.\n Y1 Rebuild front wall and new path 8k.\n\n Y2 Re roof outhouse 2k. Removed loft insulation due to mice nesting eating wires (no cost other than time). Wiring repair £200. Plaster repairs £800.\n\nY3 Fix leaking water pipe 1k. Re setting loose flag £500. Repointing work 1k. Fixing windows and door £500. Replace rotten sash window 2.5k. New insulation and decided to board out and new ladder hatch as damage to ceiling during process 1k.\n\nY4 Rebuild part of dry stone wall (free as we did this but usually £50psqm)  fix gutters £80. replace electric shower and broken screen and tiles £2k.\n\nThis year so far. New replacement of wooden door to match existing. Fix stone step. £3.6k. \nInstalled positive ventilation air unit to manage mould and humidity (game changer) £385.\n\n\nBoiler and electrics cover £400PA includes annual service. This covered cost of fixing our immersion and boiler once.",
            "score": 2,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "That's an average of about £7k pa, ouch! Then again assume you had an idea of the forward costs when you got it as it was an older cottage?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "heresanupdoot",
                            "body": "I'm an architect working on old buildings, so I had a bit of an idea what to expect. It's a lot for such a small building, really, but it's a labour of love.\n\nHopefully, our costs will reduce a bit once these big ticket items are done. I'm hoping for averaging of like 3 to 4k like others mention for future years!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "putonghua73",
            "body": "8 1/4 years. 3 bedroom semi with an annexe (extra bedroom and en-suite), so 4 bedrooms and 3 toilets! \n\n\n- Boiler replacement £2.5k\n- Roof repair £1.5k\n- Replacement garden fence £800\n- New toilet drainage £600 + £300 investigation and fixes\n- New toilet £700\n- Bathroom taps £300-400 ish\n- Couple of toilet escapades [annexe] £500\n\n\nTotal: c£7.5\n\n\nI don't include renovations - only maintenance.\n\n\n\nWe will probably need 2 toilet repairs (main bathroom and downstairs) this year at some point. \n\n\nAll but the fence, taps and toilet escapades where in the last year. We also pay approx £75-100 for annual boiler service.\n\n\nI'd budget for £1k per annum and start saving when you can rather than putting it off to avoid the situation when all the big bills occur at once.",
            "score": 2,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "Yeah £2k pa seems to be the average looking at others' posts. Plus I need to factor in that the majority of costs will come in the first year or two as and when I discover stuff that needs fixing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mikeytee1000",
            "body": "Probably £800 a year on average I’d say for my 4 bedroom detached house, 25 years old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mikeytee1000",
            "body": "Probably £800 a year on average I’d say for my 4 bedroom detached house, 25 years old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zeeterm",
            "body": "You'll want to learn as much DIY asap.\n\nI've not even been in my place a year and spent far too much. I struggle to understand how to get decent tradespeople and feel like I get ripped off every turn. \n\nI don't know how people on \"homes under the hammer\" are like, \"yeah we redid the bathroom, kitchen, redecorated 3 bedrooms and put in a new en-suite\" and then \"But we went over our budget and spent 12k rather than the 10k we wanted\".\n\nWhile I just needed one toilet flush system replacing and getting quoted over a hundred plus parts.\n\nOr changing a light fitting, which should be easy enough to do myself but I don't fully trust myself with mains voltage rewiring so that's another £60 + VAT. ( I'm justifying it by having a bunch of other electrics done at the same time, but that's still another few hundred set on fire for something I ought to be capable of learning to do myself).",
            "score": 1,
            "replies": [
                {
                    "author": "bennasaurus",
                    "body": "I'm not in the UK anymore but over here in .nl I've not found a decent tradesperson for anything. It's got to the point where I just watch some YouTube but a tool and do it myself.\n\nAt least then if it's a shitty job I didn't pay someone €800.\n\nI'm not 100% confident with mains electrics but I can do the basics like sockets and light fittings etc.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ForwardImagination71",
                            "body": ">It's got to the point where I just watch some YouTube but a tool and do it myself.\n\n>At least then if it's a shitty job I didn't pay someone €800.\n\nI'm going to remember this and live by it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "itchyfrog",
            "body": "Last 10 years, new boiler, about £1500, new windows, about £1200, paint maybe £300, roof repair £1500...then then the odd lock change and bog fix etc.\n\nBut that's doing all the work myself or for swaps.\n\nHaving said that the house hasn't really been maintained as such, now the kids have mostly buggered off I am going to have spend a shitload getting it up to scratch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itchyfrog",
            "body": "Last 10 years, new boiler, about £1500, new windows, about £1200, paint maybe £300, roof repair £1500...then then the odd lock change and bog fix etc.\n\nBut that's doing all the work myself or for swaps.\n\nHaving said that the house hasn't really been maintained as such, now the kids have mostly buggered off I am going to have spend a shitload getting it up to scratch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anabsentfriend",
            "body": "I moved in 10 years ago and spent approx £8 within the first six months.\n\nSince then, it's probably averaged out at about £500 per year.\n\nThe largest job was repointing last year that cost me about £3k.\n\nOther than that, it's just been decorating, really.\n\nMy boiler and shower pump will need replacing in the next two years, I should think.\n\nThe kitchen and bathroom have a bit of wear and tear. But I will probably sell up in five years, so I won't replace them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldDirtyBusstop",
            "body": "I’ve spent £22k in 3 years as I have a house that needs some attention. Included new windows. Some roof work, decorating 2 bedrooms and 2 bathrooms and a load of minor works (re-do garage flooring, replace taps in the kitchen etc. )",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Site_1231",
            "body": "Lord….probably about £50k over 10 years and that’s doing a lot myself. A fair bit of that is garden. Plus the £120k for a ground floor refurb. We don’t pay anyone for maintenance unless it requires a certification or significant skills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrsdontknowwhoiam",
            "body": "Every house is different but in the 7 years of being in our current home which was an ex rental property we’ve changed all the windows and doors as they were wood frame and half way to rotten,replaced all carpet and flooring,took the bathroom back to brick and put in new,modernised the downstairs wc,and most recently had a new boiler fitted and then all the other little cosmetic things inbetween which I’d estimate has probably cost £20-£25k over that span. \n\nWe still need to do the kitchen as it’s still the original from when the house was built in 1996 but it’s functional so can wait and my biggest thing is wanting to change the internal doors which there are 10 of and change the stair banisters which again won’t be cheap as we have 3 flights of stairs but it will get done eventually as will having the ceilings skimmed. \n\nIt’s never ending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dottymouse",
            "body": "New kitchen and bathroom - £15k\nNew conservatory roof - £10k\nNew front door - £1.5k\nPainting and decorating - £1k (plus many hours)\nSanded and treated lounge floor - £700\nSolar panels and battery - £10k\nGarden - £5k\nWindows - £4k\n\nStill got an ensuite to do and we're taking out the chimney breasts which is going to be a big replastering/decorating project in the next year or so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "24647033",
            "body": "Just spent the big ticket reburb costs after 15 years, so that was boiler, 2 full bathrooms, downstairs W/C and new Kitchen about 45k in all so if your gonna be there a while this will come round every 15 years or so and generally about 1k a year on average for other stuff, painting ect ect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BanditKing99",
            "body": "I can’t do anything at all and have spent thousands. Any trade for any job is wanting £400 plus these days for anything",
            "score": 1,
            "replies": []
        },
        {
            "author": "imtheorangeycenter",
            "body": "Last 3 houses with price, years and total spent over those years. \n\n\n225k / 4 / 4k (carpets, boiler change)\n\n\n\n425k / 4 / 2k (redecorating, rejig bits of kitchen)\n\n\n\n1m / 5 / 6k (redecorating mostly)",
            "score": 1,
            "replies": []
        },
        {
            "author": "koneki6",
            "body": "£800 in the last month for boiler repairs and electrical issues separately. Not for the faint of heart!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SurprisedCoot23",
            "body": "New boiler 1100, roof repairs about 800, 2 new ovens 1500, washing machine 120ish, carpets and bathroom floor about 1000. New bath taps 100ish. Plastering and decorating about 600.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CricketPuzzleheaded8",
            "body": "I’ve heard before that 10 year maintenance on a house should cost roughly 10% of its value. This includes repairs and modernisations etc, likely a new kitchen/bathroom in that time too",
            "score": 1,
            "replies": []
        },
        {
            "author": "double-happiness",
            "body": "About 11k on my previous flat in 4 years, then I moved to a house and I've spent over 7k in 5 months! 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "midweekbeatle",
            "body": "About 12k. But it was all jobs i wanted to do",
            "score": 1,
            "replies": []
        },
        {
            "author": "Martinonfire",
            "body": "Most useful book I’ve ever bought … https://www.amazon.co.uk/Readers-Digest-Repair-Manual-Maintenance/dp/0276000064\n\nSave you a fortune on home maintenance",
            "score": 1,
            "replies": []
        },
        {
            "author": "NinaHag",
            "body": "We bought a flat that was a decade old where nothing had been upgraded/fixed in those 10 years.\nWe had to change the radiators, fix some electrics, repaint, and change half of the flooring as soon as we moved in. That was around 5k.\nThen the washing machine died (£700 ish?), then we had to replace all the hinges in the windows, as well as having the balcony door frame removed, a tiny leak underneath fixed, and reset. The building insurance paid for that so can't remember, I think about 2k?\n\nThe boiler needed to have some parts replaced, there was a leak from a waste pipe and we had to replace the bathroom floor.\n\nI think in 7 years we have spent max 9k, some of it covered by insurance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeremyascot",
            "body": "10k a year approximately",
            "score": 1,
            "replies": [
                {
                    "author": "Exchangenudes_4_Joke",
                    "body": "Cheers. That seems really high, is that over a prolonged period and were you aware of the maintenance costs when you got the house?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jeremyascot",
                            "body": "- House rewire. \n- New kitchen / extension \n- Loft conversion \n- Garden office \n- New boiler \n- everyday stuff",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}