{
    "title": "It's Late Thread [ 18 March 25 ]",
    "author": "AutoModerator",
    "subreddit": "CasualUK",
    "rank": 1,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/CasualUK/comments/1jehwrs/its_late_thread_18_march_25/",
    "id": "1jehwrs",
    "selftext": "Wahey, it's late, it's Tuesday night what's going on? Why are you still up? Being the family taxi driver? Too much cheese before bed?\n\nCome on in for a chat.",
    "comments": [
        {
            "author": "bowen7477",
            "body": "Just bought and installed assassins creed shadows. Can't play til midnight tomorrow but I'm a bit to excited to sleep atm! \n\nI'm only 51 so it's not as sad as it seems!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Etheria_system",
            "body": "Preoccupied with trying to think of names for my new wheelchair. She cost £20,000 (which is a ridiculous amount of money and I couldn’t have done it without the help of strangers via crowd funding- I got an anonymous donation of £12,000 that took me to the total needed) and the pink detailing is incredible. Suggestions very much welcomed\n\nhttps://preview.redd.it/1hwrtw9a2jpe1.jpeg?width=480&format=pjpg&auto=webp&s=f36d9abe23873550bd4eb416e103fdbe83dcb61c",
            "score": 4,
            "replies": [
                {
                    "author": "wolf_in_sheeps_wool",
                    "body": "If that was my ride, I'd call it Hotwheels",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Jasmineisamess95",
                    "body": "The rolling throne .\n\nShe is fabulous tho loving the pink.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "nongingertreeninja",
            "body": "Just got back from a rare pub catch up with a friend. Both have very busy lives so tough to line up. \n\nI’m frigging knackered now though 😆",
            "score": 2,
            "replies": []
        },
        {
            "author": "spitouthebone",
            "body": "attempt number 303123 of giving up WoW, this one may stick though as the guild I'm in are being arsey about me playing another class and I honestly can't be fucked with it \n\nso I'm strolliing through my steam library and nothing is screaming play me",
            "score": 2,
            "replies": []
        },
        {
            "author": "lifeofmammals",
            "body": "Making a powerpoint for a seminar about a very useful skill that half of my students are going to think is dead boring. I promise it will be very helpful for the ones who turn up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gypseyeyes-1973",
            "body": "I’m currently helping my Mum through her rehab after a stroke. Not staying with her but taken some time off work so I can visit her daily and do as much as can behind the scenes to make things easier- Sorting out getting her meds delivered in blister packs, big food shop to restock after long hospital stay, visit to citizens advice to see if we could find a way to speed up an application for attendance allowance, rescheduling hospital appointments for different dates and locations. The list goes on and on, just having a pre bed glass of Malbec and debating what I can achieve tomorrow! There’s got to be more, I just want her comfortable and safe ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "mondognarly_",
            "body": "I had a massive brain freeze in a uni seminar earlier and was left feeling very awkward.\n\nI've also caught a cold that isn't really happening, so I feel fine but have a couple of annoying low-level symptoms. \n\nWeird day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OwlIsWatching",
            "body": "Having some fun medical issues that are equally making me exhausted all day, and completely unable to sleep at night, so I've just been doing puzzles for the past hour. Fingers crossed some sleep soon",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jasmineisamess95",
            "body": "Im only now calming down from the visit with the parent i dont live with and now i have a worse diy job to fix. They made a simple job i asked them todo 100000 times worse to fix it might mean breaking the item that needed fixing well it needed tighting with a tool i dont own but they do . They have fucked it up soo badly so Thursday morning will be spent attempting to take it apart completely to reinstall it correctly. Fucking hate men some days haha.\n\n\nSo on dog walk went in grab some chips and they kindly gave my doggo a sausage which is incredibly kind of them. So doggo is knackered as hes never been in the chippy so hes had a good day iv not because of the above but its fine. \n\n\nOh thumb is fucking painful as i tried to undo the above and now its painful so yay.",
            "score": 0,
            "replies": []
        }
    ]
}