{
    "title": "9950X3D Undervolt, AI Cache Boost, FPS Boost Guide",
    "author": "Flashy_Library_9209",
    "subreddit": "Amd",
    "rank": 16,
    "score": 100,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 49,
    "url": "https://www.reddit.com/r/Amd/comments/1jcuidd/9950x3d_undervolt_ai_cache_boost_fps_boost_guide/",
    "id": "1jcuidd",
    "selftext": "**Tip/Guide:**  \n**Cinebench R23 – BIOS Settings - AI Cache Boost**  \nPBO = Precision Boost Overdrive\n\nStandard = 73°C → 40K Points  \nPBO (Auto → Enabled) = 95°C → 42K Points  \nPBO Enabled + Curve Optimizer -25 = 83°C → 44K Points\n\nSpecs: Asus X670E-E / Ryujin 360 AIO / D.O.C.P \"enabled\", RAM 6400MT/s.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nEnter the BIOS and navigate to **AI Tweaker → Precision Boost Overdrive**:  \n• Set \"Precision Boost Overdrive\" from \"Auto\" to \"Enabled\".  \n• Switch to \"Curve Optimizer\" and select \"Negative\".  \n• Set the values to -15 / -20 / -25 / -30 (depending on your desired undervolting).\n\nTest which setting works best for you.\n\nIt’s **IMPORTANT** **NOT TO GO** **BELOW** **-30 -** the lower the value, the more unstable the system might become.\n\nHowever, the more negative the curve, the cooler the CPU runs and the more performance is possible.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n*\\*\\*\\*Extremely beneficial in games\\*\\*\\**\n\n**AI Cache Boost / Universal Game FPS Boost (+30-40**\\-**50 FPS) \\[YOU NEED THE NEW BIOS UPDATE\\]**\n\n• Open BIOS: Press \\[Del\\] or \\[F2\\] during startup.  \n• Navigate to AI Tweaker: Find the \"AI Tweaker\" menu.  \n• Change the setting: Set \"AI Cache Boost\" from \"Auto\" to \"Enabled\".  \n• Save & Restart: Press \\[F10\\] to save and restart your PC.\n\nEnjoy a universal game FPS boost.  \n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**\\*\\*\\*IMPORTANT\\*\\*\\***\n\n**RUN A STRESS TEST WITH AIDA64 OR AND WITH CINEBENCH R23/24 AND CHECK YOUR TEMPS WITH HWINFO OR WITH THE PROGRAM YOU TRUST AFTER ALL THESE SETTINGS!!!**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nIn Cinebench R23, it will draw over 200 Watts  \nCinebench score from 40K to 44K.\n\nWithout Curve Optimizer, PBO alone reaches 95°C, throttles, and achieves only 42K points.\n\nWith PBO and a -25 Negative Curve, the temperature stays at a maximum of 83°C, while performance rises to 44K points.\n\nIf no adjustments are made, it reaches a maximum of 73°C in Cinebench R23 – extremely cool.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nPeople that have concerns:\n\nI monitored all the temperatures in HWINFO; nothing exceeds 83 degrees, and the throttle point is 95 degrees.\n\nAlso, the voltage for the CCDs stays exactly as it should, not dropping below 1 volt and not exceeding 1.3 volts.\n\nI tested **Monster Hunter Wilds, Tarkov,** and **Red Dead Redemption 2.** I also ran about 10 **Cinebench** tests, where the max temperature reached around 83 degrees. During gaming, it peaked at 67 degrees when boosting but quickly dropped to 60 or lower.\n\n[Pic 1 = AI Cache Boost \\\\\"auto\\\\\"](https://preview.redd.it/hyjaibqd25pe1.png?width=3840&format=png&auto=webp&s=2717b0e10454ffddd6f629536d7a851d042f8d1c)\n\n[Pic 2 = AI Cache Boost \\\\\"auto\\\\\"](https://preview.redd.it/ikr4ywwe25pe1.png?width=3840&format=png&auto=webp&s=512fbdc8262349d5f1bbc2c8eddaa9782b305528)\n\n[Pic 3 = AI Cache Boost \\\\\"auto\\\\\"](https://preview.redd.it/mmlhqkpf25pe1.png?width=3840&format=png&auto=webp&s=85f226d91f94a4b6ce85a538b93919c67e526dac)\n\n[Pic 4 = AI Cache Boost \\\\\"auto\\\\\"](https://preview.redd.it/6o1cwadg25pe1.png?width=3840&format=png&auto=webp&s=49d44fce43550fdf34c70c74b0523f7d360c8891)\n\n[Pic 1.1 = AI Cache Boost \\\\\"enabled\\\\\"](https://preview.redd.it/6kz8fo1h25pe1.png?width=3840&format=png&auto=webp&s=0bdd6119235b403dd6568fce77927e571add0ab5)\n\n[Pic 2.2 = AI Cache Boost \\\\\"enabled\\\\\"](https://preview.redd.it/fr0y9knh25pe1.png?width=3840&format=png&auto=webp&s=3be9fc4e0f5c6e4ee7ed1100aef3464ec8a11cd2)\n\n[Pic 3.3 = AI Cache Boost \\\\\"enabled\\\\\"](https://preview.redd.it/aeh9657i25pe1.png?width=3840&format=png&auto=webp&s=9d2c922a92b9dc8180b6e1bd9c85c1574032fb5e)\n\n[Pic 4.4 = AI Cache Boost \\\\\"enabled\\\\\"](https://preview.redd.it/xy73y3ti25pe1.png?width=3840&format=png&auto=webp&s=bbeb2da49661c24d2e3c10366b402781f9906b58)",
    "comments": [
        {
            "author": "Niwrats",
            "body": "at least advise people to stress test with AIDA64 if you tell them to run negative CO offsets.\n\nalso wouldn't suggest higher than 1x Scalar for others, as the higher settings let the CPU degrade faster. only use it if you understand and accept this.\n\nposting benchmark scores with various settings is always appreciated.\n\ni wonder what that \"ai cache boost\" does. i would generally not trust the mobo vendor single click miracle settings. who knows what the hell they do behind your back.",
            "score": 29,
            "replies": [
                {
                    "author": "myasco42",
                    "body": "I'd say these kind of \"I do not know how these work but I recommend\" posts should be banned here...\n\nPeople blindly modify stuff and then they complain that something does not work or works badly.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "garrulousone",
                    "body": "Are there any proven cases of using a higher scalar to cause degradation of the CPU? Genuinely curious since I see some people say it’s likely negligible and the CPU is likely going to be replaced before any noticeable degradation, and some saying to never touch it because it’ll just make the CPU melt in the socket over a few months if it’s higher than 1x. So what’s the deal?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Niwrats",
                            "body": "No, if your CPU dies who's gonna prove what killed it to you? Nobody. Maybe if you work at TSMC or AMD you'll have detailed knowledge of this, and perhaps you aren't supposed to talk about it then.\n\nBut it is easy to see that the degradation process is natural, so it occurs for all CPUs under use. So if you want proof, you'll have to wait and see when they start dying en masse, for a given manufacturing process. We can pretty much expect that there is a bunch of overclockers who have been running Scalar 10x since day 1, though they may just resell the CPUs as used within a year or 2 (or kill the CPU outside of the scope of the boost, with a static OC for example), so not necessarily a good source of data.\n\nNow, while I don't expect Scalar to kill CPUs in months or anything, especially if they are not under constant load, what we know is that the engineers bothered to consider the whole degradation thing when designing the boost system. So in a very simple way, if the designers of the CPU are a bit worried, then maybe we should be as well. It's not like we are upping the tjmax from 95C to something higher either, even though there is obviously a safety buffer there as well.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KuraiShidosha",
                    "body": "Does the scalar = degradation thing come from any known official sources? I'm just wondering.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Niwrats",
                            "body": "the description included here is the best i have seen so far: https://skatterbencher.com/2022/09/26/raphael-overclocking-whats-new/\n\nthere's a short section for scalar, and then FIT is listed in the \"Precision Boost Infrastructure Limiters\" section as one of the possible boost limiters. (and it is only relevant when that specific limiter is hit, just increasing scalar while you hit some other limiter won't change anything - just like with the other limiters)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KuraiShidosha",
                                    "body": "Thanks for the link great information there. I will definitely not be touching that setting even if I do plan on upgrading to a Zen 6 if it doesn't have any e-cores. Cheers buddy",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "No-Nefariousness956",
                            "body": "Well, you don't need only official sources. But  if you don't trust common knowledge, then go ahead and crank scalar 10x. Don't forget to give us feedback in 6 months to 1 year.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ulysessatheart",
                                    "body": "10x scalar isn't going to kill or degrade a CPU fast. Don't know where OP has got data about what value of scalar results in x degradation period. Reads all made up. You only have to look at Skatterbencher article and see 10x gave very little voltage gains, and gave very little gains in frequency, etc.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "The-Stilt",
                                            "body": "If you are expecting the voltage vs. number of faults within a time period relation to be even remotely linear, I'm not sure what to tell you. \n\nE.G., [MTBF, MTTR, MTTF, and FIT: Design Reliability Measures for Electronics | Advanced PCB Design Blog |](https://resources.pcb.cadence.com/blog/2020-mtbf-mttr-mttf-and-fit-design-reliability-measures-for-electronics)\n\nThe \"PBO Scalar\" scales the default \"FIT\" limit by the defined ratio (1 - 10x). Higher FIT limit means higher number of \"permitted\" faults per time period.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Flashy_Library_9209",
                    "body": "I monitored all the temperatures in HWINFO; nothing exceeds 83 degrees, and the throttle point is 95 degrees. It even runs 2 degrees cooler with that enabled.\n\nAlso, the voltage for the CCDs stays exactly as it should, not dropping below 1 volt and not exceeding 1.3 volts.\n\nI tested **Monster Hunter Wilds, Tarkov,** and **Red Dead Redemption 2.** I also ran about 10 **Cinebench** tests, where the max temperature reached around 83 degrees. During gaming, it peaked at 67 degrees when boosting but quickly dropped to 60 or lower.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Niwrats",
                            "body": "you could take screenshots of zentimings between ai cache on and off - it shows a bunch of parameters that might change with it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cal_01",
                    "body": "AIDA64 isn't bulletproof. It worked for my old AM4 system when undervolting but I ended up getting random BSODs on light loads. I ended up turning PBO off after six months of this behavior.\n\n\n(And yes, I did run that AIDA64 test for light loads. I forgot the name of it though since it's been many years...)\n\n\nEdit: I misremembered. It was OCCT. Ignore my comment :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Niwrats",
                            "body": "well even if you misremembered, it's not like i'm saying AIDA64 is bulletproof. it's just what overclockers seem to consider the best single test for negative CO tweaking currently.\n\ntechnically the issues are that we don't know how a specific stress test exactly tests the CPU. in addition, the boost mechanism covers a large array of frequency-voltage-temperature points, and the CPU \"jumps\" between those array slots in realtime. in practice, a full load test tends to only test a few of the load points and then idle points. if the curve is instable on a specific point in the middle, or if instability only occurs at low temperatures + high frequencies, having the stress test hit those points long enough to error is hard. add to the mix that SSE, AVX etc loads stress specific parts of the CPU, those would increase the combinations.. and top it with the fact that the CPU only uses the highest vcore any of its cores requests at a given moment. Way too many combinations!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cradenz",
                    "body": "I’m on Intel and even I know the “scalar will degrade the cpu” thing is bullshit and misinformation. Basically if you run a CO you are taking a lot less voltage away than you are putting up the scalar. AMD themselves recommend using scalar when using CO. \n\nThere is no proven case that this is actually a thing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lanky-Association952",
            "body": "Is AI cache boost only an ASUS thing? Thanks for the write up!",
            "score": 9,
            "replies": [
                {
                    "author": "Flashy_Library_9209",
                    "body": "Yes, I think so. It was mentioned in the BIOS update info for the new 9950X3D chip for my X670E-E.\n\nI randomly tried switching from \"auto\" to \"enabled\", thinking the 3D V-Cache and AI Cache Boost might do something—and it seems like it does\\^\\^\n\nIm very suprised about this crazy +30/40/50 FPS.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ulysessatheart",
                            "body": "Test it. I think OP hasn't got correct data, that is way too large gains IMO. I have an ASUS AM5 board will give it a go too.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SniperDuty",
            "body": "Just a note, I am running Scaler 10x with a liquid cooler at between 60-68 degrees C temperature. Probably best not to explicitly say 'Don't do that' to people wanting to explore OC settings that exist in the BIOS and are available to them.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ppennza",
            "body": "still working my oc but turning on dynamic switcher as well got me over 45K on cinebench \n\nAlso for me I noticed better results buying in pbo settings under amd overclocking menu vs the asus settings.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SniperDuty",
            "body": "The AI cache boost is insane. Was running 80FPS in KCD2 and now 120FPS",
            "score": 3,
            "replies": [
                {
                    "author": "Ok_Application_6257",
                    "body": "Can i use it for my 9800x 3d ?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raptorzaptor",
            "body": "Just tried the AI cache boost. no FPS gain in any benchmarks or monster hunter wilds",
            "score": 3,
            "replies": []
        },
        {
            "author": "Roth_Skyfire",
            "body": "AI Cache Boost seems insane, from just a quick test with Sons of the Forest, it's giving me like +25-30% FPS.",
            "score": 3,
            "replies": []
        },
        {
            "author": "cwwjr1681",
            "body": "I left my power limits to AMD default. I literally did nothing but an undervault using curve optimizer and I'm at 44k. Stock I was just shy of 42k.  I went into curve optimizerand did a Per CCD negative offset of -30 on both CCDs. 44,731 @ 78c. Im happy with it\n\nhttps://i.redd.it/69856fznv4pe1.gif",
            "score": 4,
            "replies": []
        },
        {
            "author": "LongFluffyDragon",
            "body": "What the blibber is an AI cache boost and what is it actually doing?\n\nEdit: Asus oof. The last brand i would recommend anyone lets near their 700$ CPU, for safety, stability, or performance reasons.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beautiful_Car8681",
            "body": "Would it be possible to reduce the cache and give more thermal margin to increase the clock? \n\nIt's a question that could help those who don't care about gaming but about multitasking scores (some don't benefit from x3d).\n\nAn alternative would be to use a 9950x (non-x3d), but I was curious to know if the x3d doesn't have a better thermal structure that allows a higher clock than the non-x3d version. including when the cache is nerfed, which is the opposite of what you did).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Application_6257",
            "body": "Did anyone test the AI Cache Boost in 9800x 3d?",
            "score": 1,
            "replies": [
                {
                    "author": "Opteron170",
                    "body": "Will have to test it i currently have it off",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raptorzaptor",
            "body": "Tarkov is probaly the worst game to use as a before and after as i think its arguably one of the worst optimized games ever. Did you do a before and after fps wise on MHW or red dead by chance?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ananadmin3169",
            "body": "Have u tested it in prime 95 smallest ? Im reaching 95 degree. 95.2 actually.\n\nGetting 44K point in CB, PBO enabled, -25 curve all core. Max 82-83 degree.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TinyNS",
            "body": "\"AI\" cache boost? What the motherboard can tell what data is and isn't important to keep in the NOS bottle?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cascudo",
            "body": "Does \"**AI Cache Boost**\" exists for 7950x3D? Or only 9000 series?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PiOctopus",
            "body": "Looks like AI cache boost just overclocks the infinity fabric (FCLK) to 2100mhz. Dunno if it does anything else special.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy_Scientist_4322",
            "body": "Are there any dead 9950x3d after a week?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vlyn",
            "body": "Now test it with y-cruncher and get errors five minutes in :)\n\n\nMy 9800X3D can barely do -19 CO before it throws errors (Aida is rock stable, OCCT too, but y-cruncher finds all instabilities).\n\n\nAnd for some reason just using CO without applying a higher clock speed actually makes me lose performance.",
            "score": 0,
            "replies": [
                {
                    "author": "weirdfeel",
                    "body": "So in real world simulations that OCCT and Aida run you we’re fine but when crunching the cpu there were issues.. hmm amazing find",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Vlyn",
                            "body": "Define \"real world simulations\", OCCT and Aida use very specific loads, as does y-cruncher. If you want to be fully stable you need to test everything (I don't get a single error in y-cruncher at stock), as any application you use might relies on a certain CPU feature set that OCCT might not test for example.\n\nOf course there are people who say: \"My OC is stable enough, I don't crash in games\" and that's fine too, but for me it's more important to be as close to 100% stable as possible. I don't want random crashes or data loss :)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "weirdfeel",
                                    "body": "The only time I have ever “crashed” is during some kind of stress test when iv set to low of a co and other pbo fiddly things. I’m sure you can go about your day to day business anywhere between disabled and -30",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Vlyn",
                                            "body": "Yeah, full system crashes are very rare, that's true. I rather meant your application crashes/throws an error. Just give y-cruncher a try, it finds any kind of instability :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sernamenotdefined",
            "body": "I tried to overclock mine and got it to be modestly faster. But in nothing I do it made a real difference, neither did PBO off. So now I run with PBO off saving a bit of power.\n\nECO mode was a noticable drop in demanding games and running ecomic model (using avx512, the reason I went with AMD in the first place)",
            "score": -3,
            "replies": []
        },
        {
            "author": "Pristine_Pianist",
            "body": "73 c is hot AF",
            "score": -12,
            "replies": [
                {
                    "author": "Raptorzaptor",
                    "body": "not really",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pristine_Pianist",
                            "body": "That's 163 Fahrenheit",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ReplacementLivid8738",
                                    "body": "But how many Kelvins",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Pristine_Pianist",
                                            "body": "?no idea what that means",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}