{
    "title": "9070XT w/ Rosen 7 9800X3D build",
    "author": "Stews93",
    "subreddit": "Amd",
    "rank": 12,
    "score": 707,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 84,
    "url": "https://i.redd.it/1eb2ve5zo4pe1.jpeg",
    "id": "1jcxnlt",
    "selftext": "My first almost “high-end” pc! Is it bad to have the pump cord sit on top of the gpu heat sink?\n\nP.s. pls ignore one light fans that’s off on top 😭",
    "comments": [
        {
            "author": "Chitrr",
            "body": "Super Saiyan Rosen",
            "score": 81,
            "replies": [
                {
                    "author": "Moerik",
                    "body": "\"You see, Virginia, you are not dealing with your average 16-core Super Saiyan anymore...\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stews93",
            "body": "Ryzen*",
            "score": 10,
            "replies": [
                {
                    "author": "mennydrives",
                    "body": "Autocorrupt is always out for blood, I swear.\n\nGORGEOUS build.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Motor-Platform-200",
            "body": "Love it. makes me hate that i could only end up with the black version of the xfx card.",
            "score": 15,
            "replies": [
                {
                    "author": "ItzBrooksFTW",
                    "body": "same, i wanted the white one but oh well.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "yuzuwari",
                    "body": "why not go for a black and white build then? it won’t look basic like a all white build like everyone is doing",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Motor-Platform-200",
                            "body": "that's basically what I have now, everything is white except for the motherboard and gpu. still would look better all-white, but oh well.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yuzuwari",
                                    "body": "Are you saying it’d look better all white because it’s a trend or..? Because TBH all white builds are overrated",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Motor-Platform-200",
                                            "body": "it'd look better because I would find it more aesthetically pleasing. also white will blend in with rgb better.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "KrazyAttack",
                    "body": "All white builds are terrible IMO, they need contrast so badly like a black gpu or mobo or cables.",
                    "score": -17,
                    "replies": [
                        {
                            "author": "yuzuwari",
                            "body": "That’s the thing. The average gamer nowdays lacks creativity and so they follow the latest building trends and go by that. Their PCs have no personality what so ever. This build is a replicate of a trend, nothing more. It saddens me because 20 years ago PC enthusiasts had “unique” builds.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "Tajetert",
                                    "body": "20 years ago the average pc you would see at lan parties would be a grey or maybe black box. No rgb and no glass windows, maybe some stickers on the case.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "KrazyAttack",
                                    "body": "Yeah for sure, I mean do what you want it's your money but damn does all white everything suck.",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "Atomix117",
                                    "body": "you care too much about what other people do with their own money.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "yuzuwari",
                                            "body": "I don’t give a damn about what people buy. All I’m saying is that this shit is basic as hell and it’s a trend.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Atomix117",
                                                    "body": "It sounds like you do care, otherwise you wouldn't have said anything.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "yuzuwari",
                                                            "body": "Are you illiterate? Me arguing that white builds are overrated and basic does not equate to me caring a out anyone’s financial decision",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Atomix117",
                                                                    "body": "But no one asked you bro",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "yuzuwari",
                                                                            "body": "I was having a proper conversation with someone about it though? Then you had to butt in because you’re coping hard. I assume you also followed the overrated trend and did a white build like a basic consumer?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "yuzuwari",
                                                            "body": "It’s just funny to me that these mindless people would overpay $250 for a trend though. It’s truly pathetic and companies are taking advantage of it. Very smart of them tbh. You do you though with your money.🤣",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AkaliAz",
            "body": "Rosen looking great!",
            "score": 4,
            "replies": [
                {
                    "author": "FixGMaul",
                    "body": "![gif](giphy|yJFeycRK2DB4c)",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "jackoeight",
            "body": "eh id say high end, definitely a 4k capable card",
            "score": 11,
            "replies": [
                {
                    "author": "BarnabyThe3rd",
                    "body": "I think the xx90 class cards have ruined people's perception of what high end means. I keep seeing people calling the 9070xt a midrange card and complaining about how affordable mid range cards are dead but this shit can definitely do 4k60. How is it not a high end card at this point. Same with the 5070ti.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "pewpew62",
                            "body": "It's basically a 7900xtx and the XTX is undoubtedly high end so yeah",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "jackoeight",
                            "body": "yes exactly by calling the 9070xt or 5070ti midrange your also calling the 7900xtx and 4080 super midrange but the real midrange is like a 7800xt or 4070 super",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "cognitiveglitch",
                            "body": "Yeah exactly, mine is raw dogging 4k60 Cyberpunk with RT. No upscaling or frame gen.\n\nPhenomenal card that should see me good for anything I want to play.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "r3anima",
                                    "body": "Bruh, not even 4090 can sustain 4K at 60 fps native with RT on. I get it you are happy with your card, but at least stop with ridiculous bs, you are doing disservice for people reading and clowning yourself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "cognitiveglitch",
                                            "body": "Not PT.  Just RT.  If frame gen is on it gets 120+ FPS.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "2Norn",
                            "body": "i don't think so. it's definitely not a midrange card but i wouldn't call it high either. on average at 4k it's slower than 5090, 5080, 5070 ti, 4090, 4080 super and 4080. it becomes even worse when you enable RT.\n\nit's probably the best 1440p card to buy right now especially considering fsr4. but if you're hellbent on 4k and you really want a bit of future proofing like 4-5 years at least. then you gotta get better options.\n\nconsidering how games are such unoptimized messes these days, 9070 xt would cry at 4k playing monster hunter wilds.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BarnabyThe3rd",
                                    "body": "In the first sentence you admit it's a high range card lol. This is what I mean when I say the xx90 class cards have ruined people's perception. Those aren't high range cards (well they are but only by the technicality of the word). They are far far above what people should call a high range card. They are literal monstrosities of graphics cards and it shows in their price. They are not for the average consumer.   \n  \nThe xx80 xx70 ti class cards are high range and a 9070 xt while not as good as a 5070 ti gets close enough to be able to be called a high range card imo.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "2Norn",
                                            "body": "idk i'm not into arguing semantics, fact of the matter is there are 6 cards better than it, so there is that. i used to always buy whatever is the best, 780 ti, 980 ti, 1080 ti etc. i stopped doing that as i got older cuz i don't really play that graphically intensive games anymore. if i was still at that mentality, i wouldn't even consider 9070 xt is what i'm trying to say.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry_Investigator36",
            "body": "I always wondered where's the PSU in these cases because it looks like there's no space for it",
            "score": 3,
            "replies": [
                {
                    "author": "karlzhao314",
                    "body": "It's behind the motherboard, turned on its side. These particular cases are really wide.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "GlaiveWilson420",
            "body": "I just bought the y70 infinite so stoked",
            "score": 4,
            "replies": []
        },
        {
            "author": "platomaker",
            "body": "Oh so that’s what it looks like. Never thought I’d see one of those rare ones in the wild. Gotta keep it behind glass though. Look, but never touch.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shitpost-Incarnate",
            "body": "Bro got the Rosin CPU.\nCannabis Processing unit",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pedro748",
            "body": "[Evil Twin](https://imgur.com/a/ZkkEQsE)",
            "score": 2,
            "replies": [
                {
                    "author": "Kalalicious",
                    "body": "lol - nice looking setup as well!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AngelzCursed",
            "body": "There is a switch on the GPU, I’m scared to use it does anyone know what it is for I got the same model as OP",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamtonystark5000",
            "body": "What is this pc case?",
            "score": 1,
            "replies": [
                {
                    "author": "PhotonBeem",
                    "body": "Hyte Y70 most likely.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aaron-Jaeger",
            "body": "it works so well. like, its stunning. great job!!!!!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "upnorthnathan",
            "body": "What’s the case?",
            "score": 1,
            "replies": [
                {
                    "author": "PhotonBeem",
                    "body": "Hyte Y70 most likely.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robuhster",
            "body": "Is it just me or yall also can't stop staring at the exposed side of the exhaust fan?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirOakin",
            "body": "How's the cable management?",
            "score": 1,
            "replies": [
                {
                    "author": "Stews93",
                    "body": "Haha… 🤪",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SirOakin",
                            "body": "That bad huh \n\nYea I'm not surprised, I looked at a similar case on display and it had barely any space for cables",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Stews93",
                                    "body": "I wish I did clean it up - I could’ve if I took the time but I wanted to be sure everything plugged in, no loose connections etc. once  saw everything worked out, I closed it up right away. And it has a fairly amount of space imo, just didn’t utilize it well enough lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ycFreddy",
            "body": "When you think about when in 2 years it will need to be updated",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xaendeau",
            "body": "Banging, looks about as pro as you can get.  Appears you did everything correctly, and everything looks clean.  I've built about 8 custom PCs in the last year and over a in over the past 13 years or so.  Now show us the back panel, lol.\n\n\n\nKidding, kidding, hide your sins back there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Supershypigeon",
            "body": "Rosen sounds like a nice name",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pollishedkibles",
            "body": "dang you basically built what i wanna do on my next build, white with the same fans and case",
            "score": 1,
            "replies": []
        },
        {
            "author": "F-Po",
            "body": "Well it looks real nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loriano",
            "body": "Cool. Looks like something from RE2 labs lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cognitiveglitch",
            "body": "That fan style goes great with the XFX card",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoBBLeS-666",
            "body": "Very Tron, I like it. \nEven though I’m gonna rip off the cooler at some point, I am a little envious of how nice that xfx lighting looks. I got the Gigabyte card, and it is a little bit lame looking -the light at least.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GuapoSammie",
            "body": "Is this the regular lian li o11? Is it a good case,?",
            "score": 1,
            "replies": [
                {
                    "author": "Stews93",
                    "body": "Hyte y70!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_ELYSANDER_",
            "body": "Aquarium case, which one is it ?\n\nVery impressive :)",
            "score": 1,
            "replies": [
                {
                    "author": "Stews93",
                    "body": "Hyte y70!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Result7660",
            "body": "I didnt realize how nice the vertical mount looked with this card. I might try this myself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ecth",
            "body": "If it wasn't 36cm, I'd get one for my wife and myself. Our cases are not exactly small, but 32cm is the limit. Rotating the cards we have now was... ambitious, to say the least. \n\nNow I'm afraid of the future. We'll have to buy new cases, next time we upgrade.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MightyStrife",
            "body": "Looks awesome, just built in the same case but forgot to plug in the ARGB header and only did PWM... figured I only needed that lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "LooMinairy",
            "body": "![gif](giphy|pIwSSY4FUvs0E)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deadly_Fire_Trap",
            "body": "Our builds are similar enough they could be cousins! Also like other have said I'm jelly I couldn't bag a white card to complete the rig, happy enough with the 9070XT I settled on though!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forge__Thought",
            "body": "Very nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrossyAtom46",
            "body": "Sexy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jhawk163",
            "body": "Man I gotta say a 9800x3d is a serious upgrade, even at 1440p with a 6900XT, getting over 1000fps in modded minecraft, and 140fps in BeamNG with heavy traffic is nuts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "morn14150",
            "body": "amd has rozen to be the best value gaming component",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kalalicious",
            "body": "Really nice, clean, and good looking!",
            "score": 1,
            "replies": []
        },
        {
            "author": "E_Blue_2048",
            "body": "Every rosen has its thorn.🌹😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eldorian91",
            "body": "I think you're supposed to mount the CPU cooler the other way, with pump at the bottom.  \n\nIt's better for the pump and would look better in this case, I think.",
            "score": -9,
            "replies": [
                {
                    "author": "Noeffingway2Trade",
                    "body": "The pump is lower than the rad feed so that's about as optimal for aio other than mounting rad to to of case.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Eldorian91",
                            "body": "My understanding is that air can accumulate in the top of the radiator and it's bad for the pumps to pump air instead of water.  If the tubes feed into the bottom, then no air will accumulate at the tube entrance.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "tarpex",
                                    "body": "Yeah, air accumulation at the top of the radiator and not in the pump is the idea actually. This way the air stays there. The main thing is that the pump isn't the highest mounted part of the cooling system, thus avoiding air bubbles in the pump which will kill it.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Noeffingway2Trade",
                                    "body": "Main factor is pump has to be lower that rad.  This is how most side and front mounted aio are in my experience.   Though you may get some air at the top with the pump lower it may cause a gurgling sound but that will tell you that fluid is evaporating and may be getting close to time for new aio.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Eldorian91",
                                            "body": "I do still think it would look better if the hoses were behind the GPU tho.  I literally just built a similar computer for my brother in this case, but we went with air cooling.  360mm for a single ccd ryzen is a bit overkill.",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Wheelergang127",
                                    "body": "You want the air to be in the radiator so the pump is only sucking up water and no air bubbles. Air will always try to go up. \n\nIs the same reason why vehicles have coolant expansion tanks. If pcs had coolant expansion tanks you could add much more water without the worry of air in the pump, because the air would be in the expansion reservoir. I believe that’s the idea behind closed loop systems.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RustyNK",
                    "body": "No, the pump should always be at the lowest point wherever possible. Look up \"net positive suction head\". Having the pump at a high point will create cavitation and significantly reduce the flow of coolant.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}