{
    "title": "In general, what is the Democratic position on Edward Snowden and mass surveillance programs?",
    "author": "damndirtyape",
    "subreddit": "PoliticalDiscussion",
    "rank": 57,
    "score": 131,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 387,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ief3co/in_general_what_is_the_democratic_position_on/",
    "id": "1ief3co",
    "selftext": "Edward Snowden has been in the news recently. The Senate Intelligence Committee is conducting hearings to review the nomination of Tulsi Gabbard to be the Director of National Intelligence. In these hearings, there have been some intense exchanges regarding Edward Snowden. \n\nGabbard acknowledged that Snowden's actions were illegal, and she committed to preventing any such leaks in the future. However, she declined to call him a traitor after multiple Democratic senators demanded that she do so. Some Democratic senators seemed to feel that her sympathy for Snowden should disqualify her for the role. \n\nIn light of these hearings, it leads one to wonder, what are the Democratic views towards Edward Snowden and the mass surveillance program that he revealed? Is there widespread agreement among Democrats that Snowden is a traitor? Does the Democratic Party broadly support the surveillance programs? \n\nEdward Snowden says that he was inspired to leak the information after watching James Clapper deny the existence of these surveillance programs. How do Democrats feel about previous attempts to hide the existence of these programs? \n\nThe Democratic members of the Senate Intelligence Committee seemed to have strong negative feelings towards Snowden. Is this a bias of the Senate Intelligence Committee? Or, is this a feeling that Democrats hold generally? \n\nWhat is the Democratic position on mass surveillance programs? Is this view consistent with their views in previous decades? Or, have the views of the party changed from what they were during the George W. Bush administration?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "realitydysfunction20",
            "body": "Edward Snowden did a great thing by exposing the mass surveillance. \n\nHe then tarnished himself by becoming a russian sympathizer. \n\nI understand the nuance of the situation. It still is not a good look. ",
            "score": 272,
            "replies": [
                {
                    "author": "filmandacting",
                    "body": "I guess the question would be was he a Russian sympathizer from the get go or was he pushed there due to extradition threat.  \n\nI think he originally, morally couldn't stand what was happening at the CIA.  Then when he was found to be the leak and was going to be charged with Espionage, fled, and then became a Russian sympathizer as that was the only place he knew he could stay and not get caught.",
                    "score": 158,
                    "replies": [
                        {
                            "author": "realitydysfunction20",
                            "body": "This is what I meant by the nuance. You nailed it. \n\nThe Russians exploited his desperation because they knew they could beat the US over the head diplomatically with his presence despite the irony of them being a mafia state with excessive mass surveillance and control.  ",
                            "score": 109,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "AlwaysLupus",
                                            "body": ">iirc Snowden himself has said that he doesn’t “want” to be in Russia\"\n\nIt's fine that he doesn't \"want\" to be there. However he's repeating and amplifying Russian propaganda and talking points. Shortly before the Ukraine invasion, he blasted Biden on Twitter for his \"lies\" about Russians building up troops on the Ukraine border, and it was  clearly a harmless training exercise where all the troops were simply getting ice cream.\n\n\nIf he can't live in Russia without being a Russian asset, the question becomes when did he become a Russian asset. Was it after he moved there? Because if the answer is no, then we need to ask if he was a Russian asset before his leak.\n\n\nI fall into this hole, where I want to believe Edward Snowden had to release this data as a matter of principle, even if it meant he couldn't live in the United States. But the second he's in Russia, all of a sudden he's willing to compromise to maintain status / freedom. His noble intentions only seemed to last long enough to damage the United States. I'm not saying he should have done the Chelsea Manning route, but the fact that he is inarguably posting Russian talking points raises a lot of questions.",
                                            "score": 42,
                                            "replies": [
                                                {
                                                    "author": "thecrusadeswereahoax",
                                                    "body": "His choice was be jailed or be a Russian asset. \n\nHe already saw how the US was going to treat him so he chose option b. \n\nI don’t condone it but I don’t blame him either.",
                                                    "score": 33,
                                                    "replies": [
                                                        {
                                                            "author": "kerouacrimbaud",
                                                            "body": "But I think it does undermine his activism in leaking the surveillance data. He knew the risk he was taking then, but now he’s defending a much worse regime? Idk it just doesn’t square up to me.",
                                                            "score": 16,
                                                            "replies": [
                                                                {
                                                                    "author": "Heebmeister",
                                                                    "body": "From what I understand from hearing him speak, he genuinely believed Americans would rise up about this issue, and in turn, protect him from criminal blowback of the leak.  When that didn't happen, he was suddenly facing spending the rest of his life behind bars, and made decisions in his own self interest from there.  \n\nRegardless of what we think about his actions after the leak, he had an amazing life in America beforehand.  He was living in Hawaii, earning amazing money, had job security and was in the prime of his life.  A selfish person who doesn't care about society at large, would have never leaked that information and put at risk their dream life.",
                                                                    "score": 20,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HowDoIEvenEnglish",
                                                                            "body": "This is my take as well. Snowden threw away his life to bring attention to an issue. I’m not blaming him for not wanting to spend life in whatever shorter prison the fbi would throw him in",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "samrub11",
                                                                            "body": "One action doesn’t characterize an entire person. Snowden still got international acclaim and recognition and will be mentioned in history books. He specifically knew that.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Heebmeister",
                                                                                    "body": "So it's now a bad thing to potentially want recognition for doing a noble thing? This seems like a massive reach to find an angle to criticize him.  Either way, he threw away the kind of life 80% of Americans would kill for.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "samrub11",
                                                                                            "body": "Thats fine and dandy you can say diddy threw away a life 99.9 of humans would kill for, doesn’t make him a good person. His intentions matter more than the consequences of his actions when it comes to judgement of his character. If he really was against empirical genocidal regimes then he should’ve killed himself or fake his death before even stepping foot in russia. But here we are.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "LogoffWorkout",
                                                                                                    "body": "The circumstances of being in russia weren't planned.  From my memory, he was in china, and knew usa was close to getting him, and was planning to go to somewhere in south america, he flew to russia to transfer to another flight, and before leaving russia, USA cancelled his passport.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Ich_Liegen",
                                                                                    "body": ">  Snowden still got international acclaim and recognition and will be mentioned in history books.\n\nAnd justifiably so, which is why calling him a traitor is going too far.\n\nI don't know man, being from one of the countries which were revealed to have been espionage targets of the U.S., my view of him is generally positive and I don't think his \"support\" of Russia is anything _but_ him trying to stay off of the list of potential \"spy exchange\" assets the Russians have.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "samrub11",
                                                                                            "body": "he should be like the australian whistleblower and take the fucking sentance. Support putin and another genocidal empirical regime is just as bad. He’s debased himself. Unfortunately in times like these men have to make sacrifices and he chose not to commit.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "InVultusSolis",
                                                                    "body": "You can't really judge him for taking the path that he did on that decision tree. His three options:\n\n1. Prison in the US\n2. Prison in Russia\n3. Sort-of free in Russia as an asset\n\nI mean, if you want to stay out of prison you're going to take the least shitty, but still bad option. Otherwise why bother escaping the country?",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Th3CatOfDoom",
                                                                    "body": "No it doesn't it's either this or death.\nYou want him to die?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "kerouacrimbaud",
                                                                            "body": "That is not the choice he had to make.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Iwaspromisedcookies",
                                                            "body": "Jail or Russia is a hard choice, I hate to say it but I might choose jail honestly",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Th3CatOfDoom",
                                                                    "body": "No you wouldn't.\n\nAnd it's not just jail.\n\nIt's prison in some unknown location, possibly torture and ultimately death.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ElHumanist",
                                                                            "body": "What is this based on? Your avid experience watching 24 and TV?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "thecrusadeswereahoax",
                                                                    "body": "I might choose Russia. You saw how US did Epstein. \n\nBut maybe I choose jail and hope for a strong advocacy group.\n\nAlmost nobody knows how they would act given an impossible choice.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "equiNine",
                                                            "body": "If he had truly patriotic intentions, he would have accepted the consequences of his act of civil disobedience. Instead, he willingly became a propaganda mouthpiece for a foreign adversary. You can’t be a hero and decide to cherrypick your stakes to suit your convenience.",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Real-Patriotism",
                                                            "body": "Personally, I'd rather face the music and be jailed than willingly take part in a propaganda operation that is actively harming my Country.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "thecrusadeswereahoax",
                                                                    "body": "Easy thing to say from keyboard. Especially when you consider that the the country didn’t exactly rally to him.",
                                                                    "score": 17,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Real-Patriotism",
                                                                            "body": "Fair, but I do think it's fatalistic and overly cynical to assume we're all willing to betray everything we believe in to save our own comfort.\n\nHow the US Government treated Snowden was arguably incredibly unjust, but imo that doesn't justify becoming a propaganda mouthpiece to destabilize our Nation.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Newscast_Now",
                                                                                    "body": "Yes. Edward Snowden destroyed his dissident status when he did not stand trial by taking his claims through the entire process.\n\nAmericans did rally around him quite a bit, and time almost certainly would have increased those efforts.\n\nIn the end as far as history has been written so far, Snowden accomplished nothing and got himself stuck in Russia. He can still come back and continue his activism.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Drakengard",
                                                                                    "body": "Perhaps not, but if faced with the choice of jail in the US or possibly living free elsewhere as stooge after trying to do something brave and noble (yes, technically illegal) and getting no backing from your own country, I can't fault him.\n\nHe tried to do something he though was right, found out it wasn't supported, and has decided to protect *himself*.\n\nHell, Nalvany went back to Russia and died for it in his situation.  All the respect in the world for having the balls to do it, but if you said he was also stupid to have done so then that would be absolutely correct, too.\n\nWhile the US probably wouldn't kill him like Russia does to it's people (I'm just not keen on the conspiracy theories that the government assassinates it's own people most of the time), they absolutely would have incarcerated and ruined him to make a point about daring to do the right thing.  Hell, you don't have to look far historically to see what happens when people step out of line.  The Civil Rights era is right in the rearview mirror for all of us to see.  And King *did* die so it's not like we don't have examples of things going severely wrong.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "sunshine_is_hot",
                                                                                            "body": "This assumes what Snowden did was actually noble, which I would absolutely dispute. \n\nHis actions weren’t supported because of the fact they weren’t noble, and when he realized that he hadn’t done something good and had actually betrayed his nation he fled to an adversary to become a mouthpiece. \n\nSnowden objectively did not do the right thing, and he absolutely deserves to be in jail for it. He’s a traitor and will be remembered as one.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Dull_Conversation669",
                                                                    "body": "That honestly would be pretty stupid.  You think the intel agencies would allow you to survive prison in the US after clowning them and exposing illegal actions?  I sure as shit don't.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Real-Patriotism",
                                                                            "body": "I don't give much credence to conspiracy theories such as this without evidence to support your claim that US intelligence agencies routinely assassinate US citizens in prison on American Soil.\n\nSo no.\n\nBut given you're clearly spouting right wing bs all the live long day, I have no problem dismissing your nonsensical concerns. Conservatives have no ability to put Country above Self.\n\nEdit: Since the user below *seems to have* [blocked me](https://tinypic.host/image/Screenshot-2025-01-31-at-4.32.37%E2%80%AFPM.2T3Jw5)\n\nApples and Oranges imo - Epstein was a pedophile and a rapist who had dirt on a number of other pedophiles and rapists, including the current President. Given how openly corrupt this President is, I am not surprised he had Epstein murdered to cover his own tracks.\n\nSnowden simply released a bunch of info that showed intelligence agencies were breaking the law.\n\nCall me crazy but one of those is far worse than the other -",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Phallindrome",
                                                                                    "body": "Thomas Drake had the charges against him dropped in exchange for pleading to a misdemeanor. Reality Winner served 3 years in prison and was released to a halfway house in 2021. Chelsea Manning served 7 years and was released in 2017.",
                                                                                    "score": 8,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Heebmeister",
                                                                                    "body": "lmao why did you edit your comment to say I blocked you 😂 rather than just respond to me. Is it so I wouldn't have a chance to respond? I absolutely did not block you. \n\nIf you don't think him exposing the entire US intel apparatus and destroying the government's credibility on a serious level, is worthy of assassination compared to Jeffrey having some pedo tapes of billionaires, than I'm not sure what to say.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Heebmeister",
                                                                                    "body": "> without evidence to support your claim that US intelligence agencies routinely assassinate US citizens in prison on American Soil.\n\nConsidering we just watched Epstein get assassinated in prison 8 years ago, with the most laughable see through cover story reported in media, I think it's safe to say there's very good reason to question your safety in the american justice system if you are a high value target.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Ich_Liegen",
                                                                                            "body": "I think it's kinda jarring to see people think Snowden would be safe in jail. I don't think he would!\n\nI wonder how many of those people also believe the FBI murdered MLK.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "bro_can_u_even_carve",
                                                                                    "body": "Your requirement that the hypothetical assassinations be \"routine\" is unreasonable, disingenuous and almost certainly in deliberate bad faith. Snowden would not be a routine prisoner.\n\nAs for exceptional prisoners who could have embarrassed and/or incriminated powerful people, the most obvious example would be Jeffrey Epstein, of course. What was it that happened to him in prison, again?",
                                                                                    "score": -1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "VVuunderschloong",
                                                    "body": "Some people truly value their lives over principles that at the end of the day mean more to strangers than yourself or your family.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AlexRyang",
                                            "body": "And it sounds like Russia attempted to pressure him to give them more information and he refused on multiple occasions.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "sabermagnus",
                                                    "body": "And yet he did not magically fall out of a 10th floor window or commit suicide? Ya, I got beach front property in Calgary that I can sell you on the cheap.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "InMedeasRage",
                                                            "body": "If he dies, no one else goes over?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ElHumanist",
                                            "body": "Maybe you should inform yourself before you blindly defend traitors...? Why comment on something you yourself acknowledge you are not informed about?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Unputtaball",
                                                    "body": "?? Because it’s a sub called political “discussion”. A place to *discuss*. Last I checked it isn’t called political “lecture”. If you were looking for me to be a final authority on this… I’m sorry? I’m not. Believe it or not, I **DON’T** have security clearance. But I **DO** know that the surveillance state is a problem I’m concerned about.\n\nSharing my opinion which is formed on the basis of publicly available information isn’t wrong. And this is a space where that is *explicitly* asked for. Moreover, this post ***SPECIFICALLY*** asked for the general mood of democratic voters on Snowden. I shared mine. Sounds like yours is different, and that’s okay. It’s what OP was asking for",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "VVuunderschloong",
                                    "body": "“Surveillance sure but no worries, it’s not YOUR surveillance. Did you bring money? No? But you has secrets, mmmm we like secrets too..”",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cashvaporizer",
                            "body": "It was the NSA not the CIA and he didn’t intentionally choose russia…  he was traveling from Hong Kong (where he gave the exposé interview) via Moscow with plans to transit through Cuba and then continue to Ecuador, which had offered him asylum. However, his U.S. passport was revoked while he was in the Moscow airport, leaving him stranded in Russia, where he eventually received temporary asylum.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "reasonably_plausible",
                                    "body": "Both Hong Kong and Russian authorities were notified that his passport was revoked before his flight left. \n\n>Officials added that they had informed the Hong Kong authorities that the passport had been revoked before Mr. Snowden was allowed to board an Aeroflot flight for Moscow.\n\nhttp://www.nytimes.com/2013/06/25/world/edward-snowden-nsa-surveillance-leak.html\n\nSnowden was making plans with the Russian consulate during his stay in Hong Kong\n\n>Mr. Snowden approached the Russian consulate in Hong Kong with a request for help, and even spent two days there before boarding the Aeroflot flight to Moscow with a US passport the Russians knew had already been cancelled by US officials. \n\nhttp://www.csmonitor.com/World/Global-News/2013/0826/Russian-media-report-How-Snowden-missed-his-flight-to-Cuba\n\nAnd Julian Assange has said that he worked to convince Snowden to go to Russia rather than to seek asylum in Ecuador.\n\n>Assange told Janet Reitman of Rolling Stone magazine as much in December when the Australian publisher said he advised Snowden against going to Latin America because \"he would be physically safest in Russia.\" \n\nhttp://www.businessinsider.com/wikileaks-told-snowden-to-stay-in-russia-2014-5",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "scanguy25",
                            "body": "Snowden applied for asylum elsewhere but was turned down.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "BluesSuedeClues",
                            "body": "Snowden was working for the NSA, not the CIA. A lot of Americans assume we're talking about the CIA when we talk about classified programs and such, but the NSA (largely involved in signals intel) has a budget 10 times larger than the CIA. \n\nThere are a fair number of countries that don't have extradition treaties with the US. Snowden likely picked Russia because it's industrialized and his programming skills would be marketable there. Russia certainly saw giving him sanctuary as a black eye for the United States. \n\nI don't really see his choice of Russia as being anti-American. If you look at a list of non-extradition nations, they're largely smaller, poor countries that could be easily bullied by the American State Department. His only reliable choices were Russia or China, and there's zero chance he could have gone to China without being (forcibly, if necessary) made into a state asset. It's worth remembering when he first fled the US, he went to Hong Kong. Likely he tried to broker a deal, but didn't like what he was hearing. \n\nIf Snowden had stayed in the US and allowed himself to be arrested, he very certainly would have gone to prison. There's a decent chance that he could have been pardoned at some point after that, but going to Russia and becoming a Russia citizen has made that almost impossible.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "Snowden didnt pick Russia, he PICKED Ecuador. However, he didnt make it to Ecuador before the US revoked his passport. He was changing planes in Moscow and literally couldnt get on another one because he coukdnt clear customs. He just got stuck there.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "serpentjaguar",
                                            "body": "Man, that's gotta suck; aiming for Ecuador but you end up in Russia.  I mean, I'm sure Russia is cool and all, but speaking from experience, Ecuador is a jaw-droppingly beautiful country.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "SeductiveSunday",
                                                    "body": "> I'm sure Russia is cool and all,\n\nRussia is massively dreary. Granted a big part of that is because it is under dictator rule.\n\nStill there's a reason why Russia's oligarchs live in Western countries.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "OTOH, the CIA might have managed to snatch or kill him in Ecuador. Not a risk they would take in Russia.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "serpentjaguar",
                                                            "body": "Nonsense.  Snowden is not in any way the kind of person that the CIA/military would violate another nation's sovereignty over.  \n\nThe examples when we've done such things in the past have always been against violent threats like Pablo Escobar in the case of Colombia and Osama Bin Laden in the case of Pakistan.  \n\nKilling a guy like Snowden is just bad PR, and that's not even to mention that you'd be hard-pressed to find an American covert ops guy willing to do it. \n\nDespite the stereotypes and what you may have heard, the vast majority of CIA agents are regular people like you and I who have a moral compass and aren't really the blank sociopath so often imagined in pop-culture.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ClockOfTheLongNow",
                                            "body": "Your timeline is a little off.  His passport was revoked well before he got to Russia.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "anneoftheisland",
                                                    "body": "Yeah, the passport was revoked before he boarded the plane in Hong Kong, but HK let him go anyway because it allowed them to wash their hands of a very thorny diplomatic situation they didn't want to deal with. There are differing reports on whether Russia wouldn't let him depart without a valid passport or whether Cuba (his next destination en route to Ecuador) was refusing to let the plane land in Havana if Snowden were on it, but either way, the passport problem wasn't exactly unpredictable. He knew it had been revoked already, and it was highly likely he was going to get hung up somewhere on the route.\n\nIt was also self-inflicted in the first place. Snowden could have gone straight to Ecuador or another country with no extradition with the US *before* he leaked the papers, and then leaked them once he was already safe. Deciding to leak them from HK--and then staying so long in HK after leaking them (over two weeks after his identity became public!)--was a big risk that was never necessary. \n\nI don't think Snowden was trying to end up in Russia, but it also pretty clearly isn't a situation that he was worried enough about to make *any* plans for how to avoid it. And hindsight suggests he should have been.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Phallindrome",
                                            "body": "Maybe he had a cover story in Ecuador, but I'm pretty skeptical he'd pick a country so small and so deeply inside the US sphere of influence. They would never have been able to protect him long-term.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "They were already giving Assange asylum at their embassy in London, and using Assange as the go-between had said they were willing to grant asylum.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "reasonably_plausible",
                                                            "body": "> and using Assange as the go-between had said they were willing to grant asylum.\n\nWeird, because Assange has stated that he was instructing Snowden **not** to go to Ecuador and go to Russia instead...\n\n>Assange told Janet Reitman of Rolling Stone magazine as much in December when the Australian publisher said he advised Snowden against going to Latin America because \"he would be physically safest in Russia.\" \n\nhttp://www.businessinsider.com/wikileaks-told-snowden-to-stay-in-russia-2014-5\n\nNot much of a go-between if he's saying the exact opposite of what one side is supposedly instructing him to communicate.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Phallindrome",
                                                            "body": "A foreign embassy in the capital city of a major overseas ally is a different animal from the rugged and open territory on the Central American isthmus itself. Unless Snowden was planning on living in a bunker in Carondelet Palace, he would have been much less protected than Assange was.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BluesSuedeClues",
                                            "body": "Thank you, I definitely have the timeline confused.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sapriste",
                                    "body": "Julian Assange has entered the chat room.  Didn't he live for twelve years in the Ecuadorean embassy?",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "humble-bragging",
                                    "body": "> There's a decent chance that he could have been pardoned at some point after that, but going to Russia and becoming a Russia citizen has made that almost impossible.\n\nIt's so unfair if it's true that he's being denied a pardon because of becoming a Russian citizen. Once he sought refuge there he has no powers to avoid being used for political purposes by Russia. He still had to because he had no chance of getting a fair trial in the US.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Spare-Ability-7481",
                                    "body": "\"I don't really see his choice of Russia as being anti-American\"?  No, but you do consider his spillingbUS secrets Treason; right?\nBecause that's what he teally is. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ultraviolentfuture",
                            "body": "He was a contractor, and it was NSA not CIA. I know people who worked with him. He had a huge ego, was difficult to work with, and always felt like he was owed more respect than he had earned relative to his work history ... so he leaked government secrets.\n\nI have real mixed feelings about it. I'm very happy to have a better understanding of the extent of government civilian surveillance via systems like PRISM. It's always going to be the case that I don't trust most people to be competent, benevolent, and/or unbiased in their application of these capabilities.\n\nBut it's also true that this dude straight ran into Russia's arms because he couldn't deal with the fallout of what he caused, essentially, to publicly build his own legend as a way to assuage his hurt ego.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "evissamassive",
                                    "body": "> He was a contractor, and it was NSA not CIA\n\nNSA contractor Booz Allen Hamilton, which has been accused of unethiccal and illegal activities on several occassions.\n\nFact is, the PRISM surveillance program was violating the law and the constitution. How the progam was exposed is irrelevant.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ultraviolentfuture",
                                            "body": "This isn't a question about the method of exposure, it's a question about the person who did the exposing. There's a lot of additional relevant context for that question.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "evissamassive",
                                                    "body": "I wasn't born this morning.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "-not_michael_scott",
                            "body": "Russia wasn’t his final destination. He kind of got stuck there. Eventually it became home.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "anti-torque",
                            "body": "It's fine to leak these things.\n\nIt's cowardly to do so, then run.\n\nHe knew the consequences of breaking his oath. He followed that up with breaking his honor.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ae1uvq1m1",
                    "body": "You also have to wonder how much he gave to China for them to let him transit through their territory, and then what he gave Russia in order to stay.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "reasonably_plausible",
                            "body": "I mean, we publicly know that he provided detailed information about NSA actions in China.\n\n>The South China Morning Post, a local newspaper, reported on Friday that Edward J. Snowden, the contractor, had shared detailed data showing the dates and Internet Protocol addresses of specific computers in mainland China and Hong Kong that the National Security Agency penetrated over the last four years. The data also showed whether the agency was still breaking into these computers, the success rates for hacking and other operational information.\n\nhttp://www.nytimes.com/2013/06/15/world/asia/ex-nsa-contractors-disclosures-could-complicate-his-fate.html",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "walterbernardjr",
                    "body": "He also did a lot of damage to the intelligente community and ongoing operations beyond the stuff he exposed. He released so much classified intelligence that a lot of ongoing, legal and non surveillance related operations had to stop because real Americans were at risk. - source, me, because I remember having to do a lot of work on things that had absolutely nothing to do with NSA collections for the classified work that I was doing.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Spare-Ability-7481",
                            "body": "Thank you for that.  Apparently, many do not understand that Snowden committed treason as opposed to he being a boy scout.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "evissamassive",
                                    "body": "No he didn't. Article 3, Section 3 is specific on the definition, and *shall consist only* means you don't get to decide.\n\nThe meaning of *levying War* was defined in Ex parte Bollman & Swarthout (1807). The other two, *adhering to their Enemies*, and *giving them Aid and Comfort*, were defined in Cramer v. United States (1945). Whistleblowing doesn't apply.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Whiskeywonder",
                            "body": "Dude. He exposed all the backdoors online big tech gave the NSA. He risked all for justice. Its illegal to do what the NSA did. No one was fired...",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "walterbernardjr",
                                    "body": "Yes…but he ALSO revealed top secret military operations that had absolutely nothing to do with any of that. I don’t really want to expand but there’s a lot of legitimate classified military operations that happen, that his leaks put American service members at risk.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Thesilence_z",
                                            "body": "> his leaks put American service members at risk.\n\nIs there any proof of this statement?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "walterbernardjr",
                                                    "body": "Yes. I’m one of the service members. Obviously I can’t say much about it because it’s fucking classified. I just wish people would use their brains when they read shit on the internet.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ElHumanist",
                                            "body": "People who view him as a hero always pick and choose what leaks to focus on, it really is horrific how there are so many left wing and naive people who support him with zero intellectual honesty.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bl1y",
                            "body": "Nailed it.\n\nHe did some stuff that can be justified. He did other stuff than cannot be justified.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ballmermurland",
                    "body": "I was a big fan of Snowden initially but then I learned more about the situation and he gave untested journalists troves of data that even he had no idea what was in it.\n\nHe was incredibly sloppy and could have easily exposed programs that should be secret (such as al-Qaeda/ISIL informants). For that reason, I turned on him and think what he did was unforgivable. A lot of people could have been killed because of his actions.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "PreviousCurrentThing",
                            "body": "> untested journalists \n\nWhat's an \"untested journalist\"? One that the intel community disapproves of?\n\n> A lot of people could have been killed because of his actions.\n\nBut were they? AFAIK no one in the intel community has even claimed this, let alone given evidence for it.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Spare-Ability-7481",
                            "body": "I'm just wondering why your initial assessment of him was so positive.  \nIn addition, I also wonder why the Trump administration is son enamored by him.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "evissamassive",
                            "body": "Except, he exposed the NSA's PRISM Mass Call Tracking Program \\[code-named US-984XN\\], which was launched to get around the Foreign Intelligence Surveillance Act warrant requirement and FISA court mandates. It is a violation of the constitution and FISA.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "nialv7",
                            "body": "He couldn't vet the information himself so he found journalists, basically professionals at dealing with whistleblowers, to help him do that. This is literally the most responsible thing he could have done. You are falling for the smear campaign against him.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sunshine_is_hot",
                                    "body": "He literally could vet the information himself, that was more or less his job. He even did that, since he had access to all of the information he needed to in order to do that. \n\nJournalists are not professionals at dealing with whistleblowers, especially not the ‘journalists’ he handed the info over to. \n\nThe most responsible thing to do would have been to go to the Inspector General and disclose the information there. Handing off an entire hard drive full of some of the most sensitive data in the country to a random journalist without any idea how to handle it is the opposite of responsible. \n\nCongrats, your entire comment is false.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "evissamassive",
                                            "body": ">He literally could vet the information himself, that was more or less his job.\n\nHis job wasn't to *more or less* to investigate anything, and I assure you the *random journalists* at The Guardian, Der Spiegel, Le Monde, The New York Times and The Washington Post have more investigative experience than you or I.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ClockOfTheLongNow",
                                    "body": "No, the literal most responsible thing he could have done was to go through the proper channels for whistleblower protections.\n\nInstead, he just handed off documents to the press without any real vetting or rhyme or reason, and escaping the country to do it because he knew what he was doing wasn't okay.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Dull_Conversation669",
                                            "body": "yep, obviously intel services were going to give up illegal but highly effective programs b/c of whistle blower complaints..../s",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "ElHumanist",
                                                    "body": "Why do you oppose highly effective programs that protect American lives and advance our interests abroad?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Dull_Conversation669",
                                                            "body": "Because they were an abomination against the 4th amendment rights of us citizens.  Some gains are not worth the cost.  Also how do we know they were effective?  Cause the people already violating your rights told you so.  Sheeple logic.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ElHumanist",
                                                                    "body": "You have literally no clue what the gains were... We can look at the programs Snowden told our enemies about and it is clear you have no clue what those were or don't care.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dull_Conversation669",
                                                                            "body": "Way to dance right over clear constitutional violations, nice.  Really supports your argument.  Your correct, I don't know cause till Snowden no one even knew these illegal programs existed.  Fruit from a poisoned tree is still poison.",
                                                                            "score": 6,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "evissamassive",
                                                            "body": "Prove they protect anyone.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nialv7",
                                            "body": "lol if he did that he'll be in prison and none of the information will get out to the public. he's not stupid.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "TheFlawlessCassandra",
                                                    "body": ">lol if he did that he'll be in prison\n\n...reporting institutional wrongdoing through proper channels is not remotely illegal. \n\nWhether or not Snowden exhausted proper channels is a matter of some debate but frankly I think most of the evidence points towards \"he didn't really try and just went straight for the nuclear option of giving sensitive information to the press and then Russia.\"",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Prestigious_Load1699",
                                            "body": ">No, the literal most responsible thing he could have done was to go through the proper channels for whistleblower protections.\n\nThis is easy to swallow but non-digestible. The Director of the NSA [perjured](https://www.youtube.com/watch?v=nsmo0hUWJ08) himself in front of Congress.\n\nSnowden *proved* he was lying, and the man still hasn't been held accountable. Given this sordid partnership between our elected leaders and the intelligence community, it is untenable to then suggest that back-door whistleblower channels would have ever resulted in the American people being made aware of the violations of our privacy.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "spacegamer2000",
                    "body": "He isn't a Russian sympathizer until he can come home safely and then chooses not to.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "spacegamer2000",
                                    "body": "Nobody being harbored by a dictator has their own words",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "serpentjaguar",
                                            "body": "You mean like Navalny? Not saying that he should speak out and be imprisoned, tortured and eventually killed the way Navalny was, just that Navalny's very existence gives the lie to the idea that Snowden can't speak out against Russia if he wants to. There are numerous avenues through which he could do so. \n\nHe chose to stand on principle when it hurt US interests, but now he won't when it hurts Russian interests? I don't have a strong opinion about it either way, but it's certainly the case that he hasn't exactly covered himself in glory when it comes to being morally consistent.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "humble-bragging",
                                                    "body": "> Navalny's very existence gives the lie to the idea that Snowden can't speak out against Russia if he wants to\n\nSorry dear Putin stooge bot, but Navalny's imprisonment and murder obviously shows why Snowden can't speak out against Russia which of course he would've wanted to if he could.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SeductiveSunday",
                            "body": "In order for Snowden to get Russian citizenship, he has to freely comply to Putin's terms. Russia's next dictator may not be so kind.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IceNein",
                    "body": "He's very Julian Assange in that he is super eager to make a huge deal about any minor misstep America makes, but is totally cool with a surveillance state that is far worse than anything America was doing, where there are sham elections, and where people get thrown out of windows.\n\nIt's not a nuanced situation.  If he cared, he would not be eagerly supporting a far worse system than the one he so \"bravely\" exposed.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "serpentjaguar",
                            "body": "I don't get the sense that he's necessarily as amoral and purely self-interested as Assange seems to be, but I could be wrong and haven't spent a lot of time looking into it. \n\nI do agree that it's problematic to claim that you're standing on principle with regard to the US but are willing to let it slide with Russia. That doesn't pencil out for me.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Spankety-wank",
                                    "body": "Has he claimed to be standing on principle?\n\nCould it be a principle to care about americans but not russians?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "serpentjaguar",
                                            "body": "> Has he claimed to be standing on principle?\n\nWTF?  Why else would he have released the information in the first place?  \n\nI don't think there's any question that he did it ostensibly because he thought, on principle, that people needed to know what the NSA was doing.  \n\nWhat is your theory of the case?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Spankety-wank",
                                                    "body": "He might feel obliged to help American citizens but not Russians, because of feelings of solidarity that he can't feel for foreigners to the same degree. \n\nI don't know if that amounts to a nationalistic principle?\n\nAnyway yeah I don't have any unusual theory, I'm literally just asking if he has in fact claimed to have acted on principle. I can imagine that he said something like \"I wanted to let Americans know...\", but that wouldn't make it clear what principle that's derived from, therefore we don't know if it applies to Russians.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "humble-bragging",
                            "body": "> is totally cool with a surveillance state that is far worse than anything America was doing\n\nOf course he's not in his heart supporting Russia.  But he doesn't have freedom of speech there.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "harrumphstan",
                    "body": "The correct thing to do would have been to have taken his civil disobedience to trial.  He should have honored the tradition of Thoreau and been willing to have accepted punishment for his crime, no matter how righteous his cause.  He didn’t, and by evading sacrifice, he cheapened his act of defiance, allowing it be become correctly conflated with pro-Russian espionage.  He was a weak man who did a brave thing, then became a symbol of treason that outshone what he tried to accomplish.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "LogoffWorkout",
                            "body": "He made that offer and the US refused.  Perhaps it was a bluff, but the US refused to agree to a public trial.  His only option was a private  tribunal.  In his shoes would you put any faith in getting a fair trial behind closed doors?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bedrooms-ds",
                    "body": "But, if you have the entire US as your enemy do you have a choice? Even Dems label him as a traitor.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "traplords8n",
                    "body": "I think people underestimate the type of mafia \"I'll kill you if you show any sign of disloyalty\" pressure Snowden was under thanks to the US government at the time. It's my understanding he really did not feel like he had any other option to keep himself or his family safe.\n\nI don't think there's some organized deep state to be afraid of, but I'm certain there are malicious actors at the top. How does anyone draw any other conclusion when we look at stuff like the death of Jeffery Epstein?",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ProfessionalBusRider",
                            "body": "Well, who was in control of the DoJ at the time of this death?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "traplords8n",
                                    "body": "Epstein? Bill Bar under Trump's administration.\n\nDoesn't help that Trump and Epstein have close ties either..  everything about that situation reeks of corruption.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jeffwulf",
                            "body": "You think Snowden would have killed himself because he was a rich lady guy who couldn't handle not having unrestrained access to undwraged girls to fuck?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "traplords8n",
                                    "body": "~~Epstein \"killed himself\" on suicide watch.~~\n\n~~I don't think you understand the extreme measures~~ ~~they take when putting someone on suicide watch~~\n\nI think Snowden would have died under mysterious circumstances too if he stayed here to face the music\n\nEdit: I recalled my info incorrectly. He was taken off suicide watch before he died.. but what reason did they have to take him off suicide watch when he was found with bruises on his neck that put him on it in the first place? I'd like to know the psychologists reasoning there.  And he also had 2 guards that were supposed to be watching him and it happened anyway. I might have been a bit fuzzy on the details but it is still a very questionable scenario",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "jeffwulf",
                                            "body": "Epstein was not on suicide watch when he killed himself. He had previously been on suicide watch due to an earlier attempt but had been taken off.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "traplords8n",
                                                    "body": "Oops. Was recalling information incorrectly.\n\nThe questionable thing about the suicide watch was him being taken off of it, and even then he still had 2 guards that were supposed to be watching him.. all around just a sketchy scenario",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LogoffWorkout",
                                                            "body": "And the video cameras were suspiciously not working.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "revbfc",
                    "body": "You know what I respected about Reality Winner & Chelsea Manning?\n\nThey stuck around to face consequences for their actions.  They didn’t hide under Putin’s skirts.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ClockOfTheLongNow",
                            "body": "Reality Winner didn't really have an opportunity to escape, and wasn't very smart about her leaks.\n\nChelsea Manning outright assisted Wikileaks and made a series of bad decisions that got her caught.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "robby_arctor",
                            "body": "The U.S. government revoked Snowden's passport while he was in Russia. They stranded him there.\n\nIf the U.S. government dropped the charges of sedition against Snowden, I'm sure he'd rather come home.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ElHumanist",
                    "body": "I don't think you understand the nuance of the situation at all since in one breath you praise Snowden giving Russia our national security secrets and in the next you complain about Snowden being a Russian sympathizer. You don't even know you are doing it. Snowden didn't just give Russia the means to evade our intelligence and national security data  methods that save American lives, give us an edge in diplomacy, and advance our long domestic and national security interests abroad, but Snowden also gave these tools and knowledge to China, ISIS, Al Qaeda, Iran, and every bad actor in the world that wishes us harm. He is the very definition of a traitor and he fled because he knew he would get life in prison for his crimes against the constitution and American people. \n\nNot everything he shared was good or bad but the \"bad\" was catastrophic. The \"good\" he did flowery feel good nonsense that young people go crazy over, hence the majority view being expressed in this thread being what it is.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "eddiebisi",
                    "body": "I feel for someone like Reality Winner, knew the consequences, lived with them, and has been an afterthought. Snowden could have also served as a moral steward if he faced the music. My opinion.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Polyodontus",
                            "body": "Facing the consequences of exposing programs that are illegal accomplishes nothing accept discouraging future whistleblowers. Snowden sucks as a guy, but what he did should not be prosecutable, and only is because most of our legislators had the part of their brains that cared about civil liberties cooked by the war on terror.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "reelznfeelz",
                    "body": "He also very much did in fact break the law and it’s kind of hard to get around that even if what he did helped inform not only the public but congress of a major issue.  You can’t just decide to take NSA data and share it.  Defo illegal.  So I also get why he was prosecuted.  Even though he may have been in the moral right.  Until he turned to Putin.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "NevermoreKnight420",
                            "body": "Except the government was violating the constitution by bulk collecting data on every single U.S. citizen with mass surveillance programs.  I figure it's kinda like multiplying a negative by a negative in this case, it cancels out and makes it a positive.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "dravik",
                                    "body": "If he had just exposed that program then things would be very different. He took a whole hard drive of whatever data he could grab with him when he left the country. All of that was given to Russia.\n\nThere's a big difference between a legitimate attempt at whistleblowing and using that one program as a fig leaf to give massive amounts of unrelated secrets to an enemy.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "NevermoreKnight420",
                                            "body": "I mean you would need proof of the programs being used in order to expose them no?  Otherwise everyone would think you're a loon or conspiracy theorist.\n\nMy understanding is that he turned over most of the materials to reporters in Hong Kong, got on a flight to Moscow before planning on going to South America(not many choices since most countries have extradition treaties with the U.S., think it was Ecudaor since they were also protecting Assange) and the Obama state department canceled his passport mid flight trapping him there because they wanted the optics to look like he was a traitor to control the political blowback against the admin; and trapping him in Russia was a great way to do that.\n\nHe also left conditions on how the information was supposed to be leaked because of how sensitive some of it could be for operatives which caused a rift between him and Assange.\n\nThis video covers quite a bit: https://youtu.be/PxCADovmXTU?si=VorajvkFkCllTeVL\n\nI am open to sources that show a different sequencing of events or intent if you have them?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "reasonably_plausible",
                                                    "body": "> My understanding is that he turned over most of the materials to reporters in Hong Kong\n\nHe gave much more than just the information on bulk data collection in the US.\n\n>The South China Morning Post, a local newspaper, reported on Friday that Edward J. Snowden, the contractor, had shared detailed data showing the dates and Internet Protocol addresses of specific computers in mainland China and Hong Kong that the National Security Agency penetrated over the last four years. The data also showed whether the agency was still breaking into these computers, the success rates for hacking and other operational information.\n\nhttp://www.nytimes.com/2013/06/15/world/asia/ex-nsa-contractors-disclosures-could-complicate-his-fate.html\n\n---\n\n>and the Obama state department canceled his passport mid flight trapping him there\n\nHis passport was cancelled before his flight. Both Russian and Chinese officials allowed him to board the flight without it.\n\n>Officials added that they had informed the Hong Kong authorities that the passport had been revoked before Mr. Snowden was allowed to board an Aeroflot flight for Moscow.\n\nhttp://www.nytimes.com/2013/06/25/world/edward-snowden-nsa-surveillance-leak.html\n\n---\n\n>trapping him in Russia was a great way to do that.\n\nSnowden was already in talks with Russia while he was in China\n\n>Mr. Snowden approached the Russian consulate in Hong Kong with a request for help, and even spent two days there before boarding the Aeroflot flight to Moscow with a US passport the Russians knew had already been cancelled by US officials. \n\nhttp://www.csmonitor.com/World/Global-News/2013/0826/Russian-media-report-How-Snowden-missed-his-flight-to-Cuba\n\n---\n\n>before planning on going to South America(not many choices since most countries have extradition treaties with the U.S., think it was Ecudaor since they were also protecting Assange) \n\nAssange was instructing Snowden to go to Russia and not to go to Ecuador.\n\n>Assange told Janet Reitman of Rolling Stone magazine as much in December when the Australian publisher said he advised Snowden against going to Latin America because \"he would be physically safest in Russia.\" \n\nhttp://www.businessinsider.com/wikileaks-told-snowden-to-stay-in-russia-2014-5",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheFlawlessCassandra",
                                                    "body": ">My understanding is that he turned over most of the materials to reporters in Hong Kong, got on a flight to Moscow before planning on going to South America(not many choices since most countries have extradition treaties with the U.S., think it was Ecudaor since they were also protecting Assange) and the Obama state department canceled his passport mid flight trapping him there because they wanted the optics to look like he was a traitor to control the political blowback against the admin; and trapping him in Russia was a great way to do that.\n\nThe idea that Snowden just took his hard drive full of state secrets and then randomly stumbled his way into *fucking Moscow* by sheer happenstance of a connecting flight strains credulity well beyond the breaking point. Like, to me it's so obviously a lie that not only do I not believe it at all, it makes me trust nothing else the dude says.\n\nIf Ecuador wanted to give him asylum they could have done so whether or not he had a valid passport (they could have issued travel documents for him themselves). Same for Russia. Ultimately he chose to go to Russia and become a mouthpiece for Putin and that speaks volumes about his character, or lack thereof.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JQuilty",
                                            "body": ">  All of that was given to Russia.\n\nBased on what? He gave his stuff to Greenwald. Greenwald is a borderline nazbol that likes to sniff his own farts these days, but this was well before his stupidity. He was working for the Guardian, a UK based paper.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "OMalleyOrOblivion",
                                                    "body": "What, Greenwald was a right-wing Bush supporter and neo-Nazi defender years before he pretended to be left-wing to attack the Democrats.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ClockOfTheLongNow",
                                    "body": "> Except the government was violating the constitution by bulk collecting data on every single U.S. citizen with mass surveillance programs.\n\nThat's actually hardly a given.  No doubts that it should be illegal, but the third-party doctrine combined with the leeway national security tends to get puts it most charitably in the realm of grey area.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "NevermoreKnight420",
                                            "body": "Ooo very interesting. I was/am not familar with the Third party doctrine, I would've thought that 4th Amendment protected that information to more of an extent but the cursory glance matches what you say.  \n\nI was going mostly off of what I'd read regarding the phone call dragnet that the 9th circuit ruled as not legal back in 2020, but there were quite a few other programs, and nuance to the conversation.\n\nThanks for informing me, looks like I have a rabbit hole to dive into this weekend.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "FrozenSeas",
                                                    "body": "It's basically information laundering. The arrangement is something like this: the NSA can't legally spy on American citizens without a warrant. GCHQ (or any other Five Eyes member) can't legally spy on their own citizens without a warrant in the same way. But the NSA *can* provide GCHQ with a bunch of system backdoors and then use their information-sharing agreements to go read the collected American data, because technically they didn't do the spying.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Newscast_Now",
                                                    "body": "> I would've thought that 4th Amendment protected that information\n\nAs any reasonable reading of the amendment would suggest. But the Supreme Court ignored the broad protection of the amendment and permitted indirect scooping of data from *third party* sources way back.\n\nToday with so much of our most personal data in the hands of giant internet companies, we have effectively no privacy protection.\n\nThe Fourth Amendment privacy notion is a joke.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JQuilty",
                                            "body": "His leaks and others showed that the NSA was attempting to collect literally everything, which is not targeted and has never been shown to be useful.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JoaoFrost",
                            "body": "The 3 letter agencies were also behaving illegally on a massive scale. How come consequences for Snowden but not for the agencies?\nSometimes the law is an ass.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "robby_arctor",
                            "body": "John Brown broke the law. He was executed as a traitor to the government, and his actions were heroic.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "reelznfeelz",
                                    "body": "Exactly.  It just blows peoples minds that a situation can be, complex, apparently.  Everybody wants right or wrong.  The world doesn’t always work that way.  Luckily we get to fight over it on Reddit for the rest of our lives lol.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "robby_arctor",
                                            "body": "My point to you is that judging someone for doing something illegal doesn't make sense. Sometimes really bad stuff is legal.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DeadWaterBed",
                            "body": "You understand laws are written by men, right? Flawed, ignorant, biased men. Laws do not have supernatural power of morality, and some laws should be ignored or broken. \nAnd Snowden didn't turn to Putin, he was trapped in Russia by the US to make him look like a Russian collaborator",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SeductiveSunday",
                    "body": "Snowden didn't expose mass surveillance. That was already known. Snowden is a traitor to the US. He may have been an unwitting traitor used by Julian Assange and Glenn Greenwald, but ultimately he went along with it turning everything over to Putin in exchange for citizenship and a crappy apartment.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "VVuunderschloong",
                    "body": "I would venture that he would’ve had his reputation tarnished for him otherwise.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "Snowden became a Russian asset because he was abandoned by his own country. You can’t betray your country if the betray you first. If snowden was pardoned I imagine it would be easy to get him to stop being a Russian bot on twitter.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cluefuljewel",
                    "body": "My recollection is that he leaked a whoooooole bunch of emails and secrets that were very damaging to US national security. Beyond what was needed to reveal the program. I would have had more sympathy for him if he had stayed in the country and faced the consequences of what he had done. He probably would have gotten a pardon eventually. He sure as would never get a security clearance, probably never work again he would have faced a court martial. Or gotten his own tv show. It was very very hard to forgive him for taking sanctuary from Putin who he knew was our enemy.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "evissamassive",
                    "body": ">  He then tarnished himself by becoming a russian sympathizer.  \n\nNot a Rissian sympathizer. He didn't want to be convicted for whistleblowing on the feds.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JackieChan_666",
                    "body": "What makes him a Russian sympathizer? Just being there? To me he is at no fault for ending up in Russia.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Cadet_Broomstick",
                                    "body": "I'm going to paste a comment from this thread that I think has merit: Nobody being harbored by a dictator has their own words. AND: He isn't a Russian sympathizer until he can come home safely and then chooses not to.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "JackieChan_666",
                                    "body": "These really prove nothing. The only propaganda I see is believing that interviewing the Russian president make you a Russian apologist.",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ClockOfTheLongNow",
                            "body": "He deliberately flew to Russia after he leaked literally millions of documents and after his passport had been revoked.\n\nThere's no direct evidence he was doing this *in service* to Russia, but at best, the Russians certainly didn't mind and had no issue making him a Russian citizen.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JackieChan_666",
                                            "body": "This comment is so useless",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "JackieChan_666",
                                    "body": "Bro. He leaked EVIDENCE that our own government is spying on us. He literally had to flee the country. This is a smoothbrain mentality. \nWe are all aware of the reality of our surveillance thanks to him.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Philosopher1996",
                    "body": "Imagine your own home country wanting you dead and many places denying you because of your all-mighty country’s grasp on the entire world. Russia allowed him to live, and Putin would expel him immediately if he were to openly criticize his regime. Sounds to me like the guy is just trying to survive.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "LateralEntry",
                            "body": "America doesn’t want him dead. Based on Chelsea Manning, America would put him in a cushy jail and pay for his elective surgery. Russia would kill him if he stepped out of line.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Valiran9",
                                    "body": "IIRC Chelsea Manning faced a lot of abuse by her jailers after she was arrested. They never laid hands on her, but they did resort to things like sleep deprivation in direct defiance of the rules on how prisoners get treated.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Ok_Philosopher1996",
                                    "body": "I’m talking about the initial decision to go to Russia. Now that everyone knows who Snowden is and he has spoken so openly, they will not assassinate him. But in the beginning that was a very real possibility.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Ok_Philosopher1996",
                                                    "body": "Maybe citizenship came with a deal. Neither of us have any way of knowing, I feel like “well he likes Russia” is our own government taking away from the fact that they were outed for mass surveilling us. If so, it worked bc nothing has been done to stop it in the years since.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Ok_Philosopher1996",
                                                                    "body": "The thing with America is that they disguise what are essentially secret police by using terms such as “service” or “security”. People don’t realize they are losing their basic right to privacy when it is worded to make us believe that the spying is beneficial.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Ok_Philosopher1996",
                                    "body": "Blind nationalism is one of the most devastating things humanity has to offer. I’m getting downvoted despite that I’m not even pro-Russia or pro any country really, I’m just commenting on what I think about an individual’s situation.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kerat",
                    "body": "Everyone talks about mass surveillance now and have completely forgotten about the American war crimes he exposed. At the time I remember the combat videos of American soldiers bombing civilians being the most newsworthy issue in the leaks.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Spare-Ability-7481",
                    "body": "Apparently, you did not understand well enough. Perhaps when you get older you will.\nEdward Snowden is a traitor from start to finish.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ClockOfTheLongNow",
                    "body": "> Edward Snowden did a great thing by exposing the mass surveillance. \n\nThere are right ways to do things and wrong ways to do things.  He tarnished himself by going about it the wrong way, not when he decided to escape to Russia and essentially become an asset in name.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "JQuilty",
                            "body": "So what was the right way?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ClockOfTheLongNow",
                                    "body": "Through the existing whistleblower protocols.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "JQuilty",
                                            "body": "The ones he said that he used? The ones that were shown to be ineffective in the wake of Russ Tice, Thomas Drake, and Tim Klein and required further modifications post Snowden? \n\nDrake in particular did everything to the letter of the law and was still prosecuted, still had his house raided, still had his career ruined, and was still constantly harassed. Those laws were demonstrably a joke.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ClockOfTheLongNow",
                                                    "body": "> The ones he said that he used?\n\nThere is no evidence he used any.\n\n> Drake in particular did everything to the letter of the law and was still prosecuted\n\nYou're confusing two separate incidents.  In one, he went through the typical channels and was not prosecuted.  He later went to Jane Meyer (of all people) and a Baltimore reporter with additional information.  That's what he got dinged on.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "JQuilty",
                                                            "body": "> There is no evidence he used any.\n\nIt's his word versus the NSA's. The NSA has repeatedly lied about what he did and didn't do, so their word means very little. \n\n>You're confusing two separate incidents. In one, he went through the typical channels and was not prosecuted. He later went to Jane Meyer (of all people) and a Baltimore reporter with additional information. That's what he got dinged on.\n\nAnd you think it had nothing to do with his other whistleblower activities? He never gave her any classified information. One of the docs he was indicted for retaining was determined to have been improperly classified. Another was specifically marked as unclassified but they tried to do the \"he should have assumed it was classified\" bullshit. The other docs were part of unclassified docs. For false statements, they hit him for allegedly lying about destroying evidence. The governments own expert witness said he didn't destroy anything. And then they dropped all that for a misdemenaor charge just after 60 minutes did an expose on the charges. The government also repeatedly tried to claim CIPA allowed them to redact unclassified evidence to make their case.\n\nIf you think that had nothing to do with his whistleblowing that was done by the book, I have oceanfront property in Oklahoma I'd like you to take a look at.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "ClockOfTheLongNow",
                                                                    "body": "> It's his word versus the NSA's. The NSA has repeatedly lied about what he did and didn't do, so their word means very little. \n\nI don't trust either of them, but I do trust the guy who fled to Russia less.\n\n> And you think it had nothing to do with his other whistleblower activities?\n\nNone.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sehunt101",
                    "body": "He would have been dead if he stayed in the US. Anything he says while in Russia I’ll take with a grain of salt. Snowden gain NOTHING by what he did. Now if he starts spouting off like Steven Segal, I’ll change my tune.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "Th3CatOfDoom",
                    "body": "Snowden is a hero. Period.\n\nAmerica pushed him away with their evil secrecy and desire for retaliation",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "digitalgimp",
                    "body": "A Russian sympathizer? His passport was revoked by the US government as he passed through Moscow airport on the way to Ecuador. Without a passport he literally couldn’t travel any more. \nhttps://www.foxnews.com/politics/us-revokes-nsa-leaker-edward-snowdens-passport-as-he-reportedly-seeks-asylum-in-ecuador\n\nThe US government shot themselves in the foot after they made their intentions clear. Come home and locked up forever. At best. He didn’t want to stay but was forced to.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "ddannimall",
                    "body": "Dude he wasn’t a Russian sympathizer he just didn’t want himself and his family killed by the US government…",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "randomusernamegame",
                    "body": "is being a russian sympathizer mean that you move to russia out of fear for your life?",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "klaaptrap",
                    "body": "I don’t see how not spending 30 years in prison for exposing an illegal surveillance state in operation makes him a Russian sympathiser . He gave up his life to expose a continuous violation of the fourth amendment.",
                    "score": -2,
                    "replies": []
                },
                {
                    "author": "Telkk2",
                    "body": "Sympathizer? No. It's just the only place he could go to get real protection. Obviously, he isn't going to talk shit about Putin while under his protection. That's why he focuses on the U.S and that's why Putin loves him for it. But none of that means he loves Russia. He exposed what he did for Americans because he loves America.\n\nHe's just not in a position like you or I to speak freely about Russia.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "sunshine_is_hot",
            "body": "The situation isn’t nearly as black and white as you make it out to be. \n\nSnowden called out some fairly worrying government surveillance programs. Completely unrelated to that, he literally sold out US intelligence to Russia. \n\nYou can praise him for the whistleblowing he did and criticize him for being a traitor, and both things are true.",
            "score": 55,
            "replies": [
                {
                    "author": "YouTac11",
                    "body": "What whistleblowing did he do that wasn't already exposed by USA today and Kivewire magazine?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Th3CatOfDoom",
                    "body": "His positives far out weights whatever classification of \"traitor\" anyone might give him.\n\nHe's more hero than anything else",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "robby_arctor",
                    "body": ">Completely unrelated to that, he literally sold out US intelligence to Russia. \n\nDo you have a source for this claim?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BluesSuedeClues",
            "body": "I don't see any concordance among members of the Democratic Party regarding Edward Snowden's actions. In general, I think most Americans believe we have a right to know if our government is accessing our communications without warrants. There seems to be some divide between people who think he heroically exposed that truth, and people who believe the threat his revelations posed to national security outweigh his altruism. \n\nI'm very curious how the government would have gone about prosecuting him if he had stayed in the US. Reality Winner did something very similar (in that they were both civilian contractors who leaked classified material, but not in the scale of the leaks), and only served 5 years. I can't think of any other equivalent situations, but the messy, hyper-aggressive and compromised way the government went after Ross Ulbricht (for his Silk Road website and a bunch of other antics, like murder for hire, etc.), could be a clear justification for why Snowden fled the country. \n\nSnowden's situation in Russia, having become a citizen, probably looks a great deal worse to most Americans since the invasion of Ukraine, then it did 4-5 years ago. I can't help but wonder if Snowden would have gone somewhere else, if he had known Putin would start that war, and Russia would become an international pariah state.",
            "score": 6,
            "replies": []
        },
        {
            "author": "blu13god",
            "body": "We should support the surveillance information Snowden provided, but we have a proper path and protections for whistleblowers and he did not go through those channels and he just downloaded the files for distribution to whatever journalist he saw fit. \n\nThe head of national intelligence should not be telling their employees it’s okay to leak any secret publicly when they decide it’s wrong. It should be a federal judge determining whether an action is constitutional or not an employee. \n\nWhat people don’t remember about the Snowden leaks was yes he exposed untapped unconstitutional surveillance but he also leaked our Russian and Chinese spies and our full military capabilities doing tremendous damage and putting those lives at risk. The house committee found 13 high risk cases unrelated to the surveillance system and related to China and Russia. \n\nFrom the Snowden investigation \n\n“The Committee further found no evidence that Snowden attempted to communicate\nconcerns about the legality or morality of intelligence activities to any officials, senior or\notherwise, during his time at either CIA or NSA. As a legal matter, during his time with NSA, Edward Snowden did not use whistleblower procedures under either law or regulation to raise his objections to U.S. intelligence activities, and thus, is not considered a whistleblower under current law”.\n\n“Snowden would later publicly claim that his ‘breaking point’—the final impetus for his unauthorized downloads and disclosures of troves of classified material—was March 2013 congressional testimony by Director of National Intelligence James Clapper. . . .But only a few weeks after [he became engaged in a] conflict with NSA managers, on July\n12, 2012—eight months before Director Clapper’s testimony—Snowden began the unauthorized mass downloading of information from NSA networks.”\n\nYou can read the declassified report and form your own opinions.\nhttps://intelligence.house.gov/uploadedfiles/hpsci_snowden_review_declassified.pdf",
            "score": 40,
            "replies": [
                {
                    "author": "walterbernardjr",
                    "body": "Yes, this. I was in the military, and we did classified operations that had absolutely nothing to do with the NSA stuff he exposed and we had to re-work a lot of things because our operations were compromised.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "JQuilty",
                    "body": ">The Committee further found no evidence that Snowden attempted to communicate concerns about the legality or morality of intelligence activities to any officials, senior or otherwise\n\nSnowden claims he did complain: https://time.com/53666/snowden-nsa-vanity-fair/\n\nI'm inclined to believe him given that James Clapper and Keith Alexander both flagrantly perjured themselves in the aftermath and were constantly tripping over themselves making denials only for the Guardian to publish documents directly contradicting claims. \n\nThe meat of that report is redacted, and the NSA hasn't given anyone a reason to trust them.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "blu13god",
                            "body": "We definitely need to go after people who perjure much more than whistleblowers",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "JQuilty",
                                    "body": "Clapper and Alexander, yes. Both flagrantly lied under oath to cover their own asses and were complicit in a cover up.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NegligentNincompoop",
                    "body": "When your chain of command is already aware and complicit in the illegal activities you're trying to report, reporting up the chain of command no longer makes sense. This is the whole reason why whistleblowers exist. Otherwise, the issues would have been fixed internally. This is sometimes how the government works. Think about it... you work at mcdonald's and your boss is instructing everyone to poison the burgers. Are you going to report the poisoned burgers to the same boss?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "blu13god",
                            "body": "He never tried. If he did there should be logs or documentation somewhere of his attempt",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "NegligentNincompoop",
                                    "body": "Well if he tried, then his boss would be aware that he would potentially rat, and then they could either start a cover up or blackmail him. Believing that he should have gone up the chain of command is a very idealistic view of the state of affairs of our government.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "blu13god",
                                            "body": "He would be able to show some log that he did, yet the investigation found none. Even if you claim that the investigation is biased he should be able to show the logs himself which would be even more damming to Congress",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NegligentNincompoop",
                                                    "body": "No I am not claiming there are any logs. I agree with you that he did not try going up the chain of command. I'm just explaining why",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "randomguy506",
                    "body": "This is why he is a traitor, not a hero",
                    "score": 8,
                    "replies": [
                        {
                            "author": "blu13god",
                            "body": "you're right, i amended my initial post to be more specific on which parts we should and shouldn't support",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cballowe",
                    "body": "None of his story made sense if his goal was a change. If he really thought that clapper lied, the better course would have been to reach out to the IG or someone on one of the house or senate committees with oversight roles.\n\nEven the material he presented was often out of context or incomplete - leaked in a way that painted a particular narrative. The PRISM slides, for instance, were leaked in a way that implied that companies (Facebook, Google, AOL, etc) were complicit with the monitoring claimed. The technical people who would have had to have been involved in any cooperation had no clue WTF any of that was.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "DC3108",
                    "body": "Snowden didn't leak anything to Wikileaks nor did he himself release anything to the public. He gave the documents to journalists, told them to only release what was necessary and the journalists worked with government input on what to release and not release. \n\nAlso, contractors in 2013 had very little whistleblower protections. The whistleblower protection act did not extend to government contractors and although Obama campaigned on protecting whistleblowers, his actions had proven otherwise. \n\nSnowden is an American hero.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "blu13god",
                            "body": "Title 41 was passed in 2011 under obama\n\n# 4712. Enhancement of contractor protection from reprisal for disclosure of certain information\n\n(a) Prohibition of Reprisals.-\n\n(1) In general.-An employee of a contractor, subcontractor, grantee, subgrantee, or personal services contractor may not be discharged, demoted, or otherwise discriminated against as a reprisal for disclosing to a person or body described in paragraph (2) information that the employee reasonably believes is evidence of gross mismanagement of a Federal contract or grant, a gross waste of Federal funds, an abuse of authority relating to a Federal contract or grant, a substantial and specific danger to public health or safety, or a violation of law, rule, or regulation related to a Federal contract (including the competition for or negotiation of a contract) or grant.\n\n(2) Persons and bodies covered.-The persons and bodies described in this paragraph are the persons and bodies as follows:\n\n(A) A Member of Congress or a representative of a committee of Congress.\n\n(B) An Inspector General.\n\n(C) The Government Accountability Office.\n\n(D) A Federal employee responsible for contract or grant oversight or management at the relevant agency.\n\n(E) An authorized official of the Department of Justice or other law enforcement agency.\n\n(F) A court or grand jury.\n\n(G) A management official or other employee of the contractor, subcontractor, grantee, subgrantee, or personal services contractor who has the responsibility to investigate, discover, or address misconduct.\n\nFrom the investigation specifically\n\n\"Among other things, Snowden has argued that he was unable to raise concerns about NSA programs because he was not entitled to protection as an IC whistleblower given his status as a contractor. (He was with Booz Allen at the time of his leaks to the press.) But the 1998 IC WPA applies to IC employees as well as contractors. Although the statute does not explicitly prohibit reprisals, the IC WPA channel nevertheless enables confidential, classified disclosures and oversight, as well as a measure of informal source protection by Congress. The statute specifically authorizes **IC contractors** to inform the intelligence committees of adverse actions taken as a consequence of IC WPA-covered disclosures.\"",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DC3108",
                                    "body": "None of that applied to Snowden. \n\nSnowden's disclosures were about national security surveillance practices, not directly tied to contract mismanagement or abuse. The intelligence community, including the NSA, operated under different rules.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "blu13god",
                                            "body": "It did apply to Snowden...You don't get to just change the US law because it supports you. Seems like you're just making baseless takes without actually reading the report\n\n[https://intelligence.house.gov/uploadedfiles/hpsci\\_snowden\\_review\\_declassified.pdf](https://intelligence.house.gov/uploadedfiles/hpsci_snowden_review_declassified.pdf)",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "DC3108",
                                                    "body": "You first referenced 4712, which does not apply to Snowden, so pot kettle and all that. It's not even mentioned in the report you linked.  What is mentioned is [Intelligence Community Whistleblower Act](https://en.m.wikipedia.org/wiki/Intelligence_Community_Whistleblower_Protection_Act) and if you read what is said about it, it basically does nothing. From the link...\n\n\"ICWPA doesn't prohibit employment-related retaliation and it provides no mechanism, such as access to a court or administrative body, for challenging retaliation that may occur as a result of having made a disclosure.[3] In 2006 Thomas Gimble, Acting Inspector General, Department of Defense, stated before the House Committee on Government Reform that the ICWPA is a 'misnomer' and that more properly the Act protects the communication of classified information to Congress.[4] According to Michael German with the Brennan Center for Justice, the ICWPA, \"provides a right to report internally but no remedy when that right is infringed, which means that there is no right at all.\"[3]\"",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "blu13god",
                                                            "body": "If Snowden used the ICWPA process and then was subsequently fired, he would be regarded as an American Hero for exposing unconstitutional surveillance I agree. He did not and used independent methods. If reason he didn't is because he would face retaliation, then he faced even more retaliation for blatantly breaking the espionage act. \n\nBut you're right the ICWPA should be strengthened and I'm glad it was strengthened both by Obama and Biden",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "DC3108",
                                                                    "body": "Given his actions, being fired wasn't a concern, public disclosure about government spying was. He couldn't get his superiors to do anything and at great personal and professional risk to himself he exposed the government for violating the rights of Americans. \n\nRegardless of if he did it the right way or not, he made a sacrifice for his beliefs with no meaningful incentive to do so other than it was the right thing to do. \n\nObama administration prosecute more whistleblowers under the espionage act than all previous administrations combined....so theres that.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "blu13god",
                                                                            "body": "> He couldn't get his superiors to do anything \n\nThis is where the issue is. There is zero evidence, records, or logs of him ever bringing any of this to his superiors. If his concern was public disclosure then why did he steal documents before the public testimony even happened and why did he never bring it up to any supervisor rather than downloading both his and other NSA employee files.\n\n>Obama administration prosecute more whistleblowers under the espionage act than all previous administrations combined....so theres that.\n\nWonder what was different between Obama's age and the rest of human history and why there were more? Oh right, the existence of the internet, social media, and unseen rapid dissemination of information\n\nIt 100% matters if he did the right way or not. If he did it the right way he's an American hero as a whistleblower for government unconstitutional actions. He did not do this. He did the wrong way, aided Russia and China, and is rightfully branded as a traitor for helping our adversaries.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DC3108",
                                                                                    "body": "Maybe it's just me, but when the government is caught lying, I don't then trust them to tell me the truth. \n\nFair point, but in addition to prosecuting more whistleblowers than any other president before or since (when social media and the internet was even more widespread) he didn't meaningfully strengthen protections for IC contractors like Snowden. \n\nAlso, his administration went after Julian Assange and Ive never heard a defense for that one.....",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "blu13god",
                                                                                            "body": "> government is caught lying, I don't then trust them to tell me the truth.\n\nYes I agree, we should push for independent oversight, policy reforms, court cases, and hold elected officials accountable through elections if they oppose such reforms all of which Obama and Biden has done since the disclosure.\n\nObama did strengthen protections. He passed Whistleblower Protection Enhancement Act and Presidential Policy Directive 19 to protect people who weren't meaningfully covered and implemented anonymous reporting that must be addressed within 30 days. There is a difference between leaking and whistleblowing.\n\nJulian Assange? You mean the guy that who leaked all communications between the US and foreign embassies, released hundreds of thousands of highly classified U.S. military and diplomatic documents, exposed covert foreign intelligence operations, undermining national security, jeopardizing the lives of countless informants, released sensitive military strategies, released all NATO operations.\n\nHe literally released NATO operations and communications of Ukraine to Russia who then proceeded to annex the area and then invaded the entire country. Yes they should have went after him.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DC3108",
                                                                                                    "body": "Obamas directive mostly applied to government employees, not contractors. It also did not provide protection for whistleblowers under the espionage act and left them open to prosecution even if they followed the guidelines due to \"national security\" concerns. \n\nCan't say Im surprised, but I feel like this is more about your love for Obama than your concerns over national security. He was a terrible president, this is just one example among many others.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "blu13god",
                                                                                                            "body": "Congress expanded it to include contractors in 2014. Again there’s a difference between intentional leak and whistleblowing. Is there room for improvement? Absolutely! Just like in everything else. \n\nSorry which part am I wrong about? I don’t care if it was Obama, Trump, or Bush as president it has nothing to do with Obama. I don’t think we’ve ever had a perfect president. Julian Assange declassified and released thousands of military documents for the world and especially our adversaries to see.\n\nFrankly I love my country and do not like communist China or Russia and anyone who undermines the US and supports Russia or China should be rightfully named a traitor",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DC3108",
                                                                                                                    "body": "Again, nothing meaningful was done. Mostly, the protection act let \"whistleblowers\" keep their jobs or not be demoted. but even that isn't really protected. But the process is the punishment. Whistleblowers, who follow the law, still face \"punishments\" through the process. They won't be fired, but they can be suspended without pay while the process plays out. Which is one way they disincentivize \"whistleblowers\" but claim they're protected. Whistleblowers aren't protected in any meaningful way, just on the surface. \n\nThe other problem is that there are ZERO protections under the espionage act for anyone who discloses information to the public. According to the government and the law, no matter what the government has done or is doing wrong, they get to protect there ass under \"national security concerns\" and we aren't allowed to hear about it unless someone falls on their sword, like Snowden. \n\nAssume that you're a government employee and you found out that the government was shooting American civilians in the head everyday who they determined were domestic terrorists and threats to national security. For you to be \"protected\" you cannot inform the public. So in effect the government is fully in control of government wrong doing regardless of any public interest under the EA if they says its a national security threat. There is no public interest exception under the EA regardless if you take the \"right\" steps. Legally, there is no \"right\" way to inform the public about government corruption under the EA.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "blu13god",
                                                                                                                            "body": "Yup we need more reforms just like in everything else other aspect in government",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mist_Rising",
                            "body": ">. He gave the documents to journalists, told them to only release what was necessary \n\nAnd they then leaked far more. The blame goes to the original shooter. He fired the shot by leaking the information and did a poor job vetting his journalists, he gets the blame.\n\nLegally and morally. We can't just allow anyone who wants to leak anything to absolve themselves of responsibility by saying they told folks not to do leak the \"dangerous\" stuff",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 20,
            "replies": [
                {
                    "author": "averageduder",
                    "body": "Exactly where I’m at on it.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "novagenesis",
                    "body": "I agree with everything but the last sentence about not supporting him.  It's *complicated*.\n\nI feel, to some extent, that good samaritan laws should exist for good-faith whistleblowers.  And in this case, the existance of that type of law would probably have let him stay in the US instead of becoming a long term intelligence liability in enemy hands.  Yes, it means good-faith behavior could kill people, but if it was indeed good faith behavior, we have precedents in several verticals to that effect.\n\nEDIT: Flipside, releasing the names and addresses of spies could well be separate from this, and that leads us back to a darker view of Snowden.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ClockOfTheLongNow",
                            "body": "> I agree with everything but the last sentence about not supporting him. It's complicated.\n\nIt's not complicated, though.  There are ways to be a whistleblower without becoming a Russian asset in the process, and Snowden decided to take a different path.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "novagenesis",
                                    "body": "> It's not complicated, though\n\nWhenever anyone says \"it's not complicated\" about pretty much anything, they're trying to push a position or side.  I prefer we stick to the whole story.\n\n> There are ways to be a whistleblower without becoming a Russian asset in the process,\n\nUnless you have more info than I do, Snowden never planned to become a Russian asset.  Of course IMO, he should've faced his consequences like a man after leaking the data.  \n\nBut if you're suggesting there's a better internal channel to whistleblow in the NSA, I'm not sure I'd be convinced.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "ClockOfTheLongNow",
                                            "body": "> Unless you have more info than I do, Snowden never planned to become a Russian asset.\n\nYou're right that there's no direct evidence.  It would be one hell of a coincidence for him to go to Moscow after his passport was revoked, though.\n\n> But if you're suggesting there's a better internal channel to whistleblow in the NSA, I'm not sure I'd be convinced.\n\nAll indications are that he didn't even try.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "novagenesis",
                                                    "body": "> You're right that there's no direct evidence. It would be one hell of a coincidence for him to go to Moscow after his passport was revoked, though.\n\nMy understanding is that he was in transit to Ecuador at the time, and he got detained on his way out of Moscow.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ClockOfTheLongNow",
                                                            "body": "There were days between his arrival in Moscow and his passport getting revoked.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fractalfrenzy",
                    "body": "If he had stayed in America he would have been executed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "fractalfrenzy",
                                    "body": "There is no evidence of that and there is evidence to the contrary.\n\nThere was a petition to ask Obama for a Snowden pardon with over 167,000 signatures. Obama rejected it. Maybe he wouldn't have been executed, but he would be rotting in federal prison.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mathers101",
                    "body": "Snowden didn’t directly leak the information to the internet or something like you’re making it sound. He passed the files to journalists and gave them full authority to decide what should and should not be published, all of the publishing of classified docs was done by US news outlets and the US govt had an open line of communication with these journalists about what things needed to stay classified for military purposes. His actions didn’t get any Americans killed; if you’re so sure they did, can you provide a source? I’d love to provide a source on my end but can’t exactly prove a negative",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "arcanepsyche",
            "body": "This is an issue where I think there's a big gap between \"democrat\" and  \"progressive\". Most progressives i know support Snowden.",
            "score": 22,
            "replies": [
                {
                    "author": "MissingBothCufflinks",
                    "body": "Most far left progressives i know support Russia so this checks out\n\nEdit: see eg https://www.reddit.com/r/Socialism_101/s/PHm0KRi33D",
                    "score": -13,
                    "replies": [
                        {
                            "author": "filmandacting",
                            "body": "It's almost as if Russia has coopted the far extremes of American politics and are using it as a way to destabilize our system and sow distrust in the other side.\n\nCrazy I know /s",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "DogadonsLavapool",
                            "body": "> Talks about progressives\n\n> Brings a post from hard core socialist sub filled with anarchists and MLs\n\n> Not even people in that comment section have support for Russia or say they know many people in life that do\n\nDude, progressives aren't walking around calling themselves communists. Progressivism still falls under the umbrella of liberalism, and started as a reaction *against* far leftism in the years after the Gilded Age. People like Teddy thought that corporations that were good for people should stay, while bad ones should be trust busted, and that ethos still remains. There's still private ownership. \n\nCommunists aren't walking around calling themselves progressives. Calling each other a liberal in communist circles is an insult. Most communist sects don't even like other communist sects and have *wildly* different interpretations (see MLism vs anarchism), so of course some have fringe positions like supporting Russia. Ask the furthest left anarcho communist what they think about Putin, tho.\n\nProgressives aren't posting in /r/sino. The conflation of the two movements is done on purpose to make progressive seem wildly left, and that just isn't the case",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "arcanepsyche",
                            "body": "That's some BS right there.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "[https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/](https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "reelznfeelz",
                            "body": "I’d disagree.  It’s really the furthest “left”.  I’m pretty progressive and it’s clear as day these really far left folks are just using Putin talking points because heave fallen into a disinformation bubble same as far right and maga people.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "NimusNix",
                                    "body": "What's unfortunate here is, I agree with your distinction over OP's, but I understand where OP is coming from.  The loudest voices on the progressive side are pro Snowden.  That's a problem.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "reelznfeelz",
                                            "body": "The reality is there's not an easy answer.  Snowden is at both a hero for blowing the whistle on illegal data capture on citizens, and a criminal for sharing classified data in a pretty reckless way, and a traitor for becoming a Russian sympathizer.    Of course the outcome is we just get to fight over it forever, in fact, it's a perfect wedge issue for Russia and others to keep tossing into online conversations, really.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "no true scotsman etc.  Left circles in the UK are filled with russia apologists who see russia as a foil to American imperialism.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KahnaKuhl",
                            "body": "For real?!? I thought progressives would generally be the most anti-Russian, especially when it comes to Ukraine.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "novagenesis",
                                    "body": "I'm a far-left progressive and the idea that many/most of us support Russia is bullshit.\n\nTankies tend to support Russia.  Most of us aren't Tankies.  And \"progressives\" are never Tankies; the previous poster is conflating the two (probably in good faith)",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Newscast_Now",
                                            "body": "Some of those 'leftist' types supporting Russia trying to eliminate Ukraine under the complete opposite notion of being 'antiwar' are reactionaries posing as dissidents. Glenn Greenwald is the first name that comes to mind, and he is deeply involved with the Edward Snowden situation. Others might be disaffected types who discovered that lots of money comes their way when they put on their fake dissident show. Obviously, some are just dupes.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "KahnaKuhl",
                                            "body": "Yeah, when I saw the link to the old-school socialists, I had the same thought.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "It comes from a silly conflation of being anti imperialist /anti colonial and then from that to anti western.  It does seem counter intuitive.\n\n\nSee eg: https://www.reddit.com/r/Socialism_101/s/PHm0KRi33D",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kabooozie",
                            "body": "What? Republicans are the ones who support Russia. I’m surrounded by progressive liberals daily and none of them support Russia",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "arcanepsyche",
                                    "body": "Yeah I don't know what this OP is talking about. The left does not support Russia.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "batlord_typhus",
                            "body": "Maga Republicans are far left progressives! Interesting if true!",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "horseshoe is real.  Extremists on both sides want to collapse liberal western civilisation",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "batlord_typhus",
                                            "body": "Socialists support a gangster-capitalist oligarchy?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MystikSpiralx",
                            "body": "You clearly don’t know many progressives…",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "I know plenty.  One almost became prime minister.  Anti imperialist is so often just code for anti western.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "40WAPSun",
                                            "body": "And that's code for anti-white! Right fellas???",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "MissingBothCufflinks",
                                                    "body": "No? It's a code for anti all of us?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "40WAPSun",
                                                            "body": "Not everybody lives in the west, comrade",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "luminatimids",
                            "body": "Are you not American? Idk any progressives in the US that support Russia",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "ClockOfTheLongNow",
                                    "body": "This is likely at least partially a reference to the fact that anti-war progressives are struggling to square their reflexive anti-war stance with supporting Ukraine.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "luminatimids",
                                            "body": "Im not sure what you’re saying is a reference to that. Are you saying that they would be supporting Russia normally but because Russia invaded their neighbor they’re not pro-Russia?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NimusNix",
                                                    "body": "It's because before Israel/Palestine there was a slice of the left telling America to stop supporting Ukraine because it hurts the Ukrainian people, which of course makes no fucking sense.\n\n\n\nAnother way to interpret that is it hurts the Russian war effort.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "luminatimids",
                                                            "body": "Oh they’re saying that some leftists didn’t want to support Ukraine in the war because being in war is bad and they would be prolonging the war by doing so?\n\nI don’t think I saw very many of those. The left has been pretty much all in on Ukraine from the start as far as I can remember",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "NimusNix",
                                                                    "body": "And I will be honest, there were not a lot of voices saying that but they were there.\n\n\nYou can go to this thread and sort by controversial to see some.\n\n\nhttps://www.reddit.com/r/PoliticalDebate/comments/1d31b35/how_does_the_left_feel_about_the_russoukrainian/",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RokWell89",
                            "body": "I suppose that's one way to say you don't any progressives.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "Literally linked to the socialism sub where the position is explained",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "arcanepsyche",
                                            "body": "Yes, a socialism sub is definitely real life.\n\nMove along, you're very wrong here.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "MissingBothCufflinks",
                                                    "body": "[https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/](https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/)\n\nYou are in denial.  This is one of the most successful progressive politicians of the modern era.  This isnt some fringe nonsense.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Philophon",
                                                            "body": "Again, we are discussing US politics.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MissingBothCufflinks",
                                                                    "body": "\"Progressive\" isn't a US exclusive term",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Philophon",
                                                                            "body": "That is not what I suggested.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MissingBothCufflinks",
                                                                                    "body": "I know you won't, but i highly recommend reading this:\n\nhttps://medium.com/@areidross/from-exile-to-dirtbag-edgelord-geopolitics-and-the-rise-of-national-bolshevism-in-the-u-s-84822021b0e8\n\nThe alt right and the far left United to simp for putin.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BluesSuedeClues",
                            "body": "Then you move in very strange circles, because it is right-wing agitators who have over and over been demonstrated to be taking money from Russian sources, and parroting Russian disinformation. \n\n[https://www.nbcnews.com/politics/justice-department/russian-money-was-funneled-right-wing-creators-trump-media-outlet-pros-rcna169611](https://www.nbcnews.com/politics/justice-department/russian-money-was-funneled-right-wing-creators-trump-media-outlet-pros-rcna169611)",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "MissingBothCufflinks",
                                    "body": "The horseshoe is real.   It's not like my position on this is niche:\n\n  \n[https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/](https://www.spectator.co.uk/article/jeremy-corbyn-sides-with-russia-again/)",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Philophon",
                                            "body": "This discussion is on US politics, and all of your evidence is from outside the US.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "robby_arctor",
                    "body": "Progressives are more reluctant to embrace imperialist propaganda than Democrats.\n\nMost Democrats read State Department memos like they were written by the AP.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "arcanepsyche",
                            "body": "Correct. Also, happy cake day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RCA2CE",
            "body": "I think when you're trying to pigeonhole positions or ideology you're going to find that the parties have whichever position is politically convenient for them in the moment.\n\nIt should be exceedingly evident that the actual one party system is rich people and the facade of a two-party system is to make it look like you've got some say in something.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Jen0BIous",
            "body": "Interesting question, and probably not something that will be brought up in mainstream media discussions.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok_Cauliflower4898",
            "body": "It wasn't just the surveillance leak--he collected data en mass then just leaked it all. Some of what he leaked put operatives' lives in danger. That's why a lot of people think he's a traitor.",
            "score": 3,
            "replies": []
        },
        {
            "author": "guillermopaz13",
            "body": "This is more of a warhawk intelligence state vs not, than a dem vs. Rep argument.\n\nI would say the newer guard who wants government transparency wants that pardon and discussion. Anyone around who was involved in the things being whistleblown, do not.  Which is most of the older guard in congress",
            "score": 5,
            "replies": []
        },
        {
            "author": "MsAgentM",
            "body": "I find it interesting that after that hearing, the questions you are concerned about are the views of the democrats and not the views of Tulsi. She had bold words supporting Snowden before but conveniently shed them at this hearing. Given the position she is moving to fill, that seems like the more important question here.\n\nThere are many Democrats on record condemning Snowden's actions. Whatever thr Democrats position maybe on mass surveillance, there is much more unity over the fact that they view Snowden as a traitor at most and his actions illegal at least.",
            "score": 5,
            "replies": [
                {
                    "author": "damndirtyape",
                    "body": "> I find it interesting that after that hearing, the questions you are concerned about are the views of the democrats and not the views of Tulsi. She had bold words supporting Snowden before but conveniently shed them at this hearing. \n\nI definitely noticed that. Its funny when the headlines are mainly concerned with her declining to call Snowden a traitor. But, in reality, she backpedalled quite a bit in her previous support for him. It makes you seriously question her sincerity, either before or now. \n\nI figured reddit is generally unfriendly to Trump. So, if I asked about the consistency of his appointees, mostly everyone is going to say that all of his appointees are obviously full of shit. So, that didn't seem like a worthwhile question. \n\nBut, I'm more interested in how the Democratic party is framing the discussion of Snowden and surveillance. From how the Democratic senators were talking, you might get the impression that the Democrats uniformly view Snowden as a traitor, and that this perhaps means they support the surveillance programs. I'm wondering if people support this framing and view it as representative of the Democratic party's overall feelings. \n\nThere's also a discussion to be had over whether the Republican party is tacitly backing down from their previous support of surveillance and condemnation of people like Snowden. But, I figured I'd try to keep the discussion more limited in scope.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MsAgentM",
                            "body": "I gotcha. From what I have seen, Snowden's leak was well beyond the surveillance practices and he went around normal whistle blower avenues. Those things are where Dems break. These distinction s were made at the time by Obama and HRC.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Moccus",
            "body": "I doubt most Democrats would go so far as to call him a traitor. Most would probably agree he committed espionage and should face the consequences for that.\n\n> Is there widespread agreement among Democrats that Snowden is a traitor? Does the Democratic Party broadly support the surveillance programs?\n\nIt's possible to simultaneously believe that he's a traitor for working with Russian intelligence and also that the surveillance programs were a bad thing. I personally think he could have explored more ways to get the information out to the public without risking the compromise of unrelated programs. He seems to have tried a few minimal things to raise the issue internally at the NSA and then jumped straight to fleeing the country with the data.\n\n> What is the Democratic position on mass surveillance programs?\n\nDemocrats are pretty much universally opposed to domestic mass surveillance programs.",
            "score": 7,
            "replies": [
                {
                    "author": "Mist_Rising",
                    "body": ">Democrats are pretty much universally opposed to domestic mass surveillance programs.\n\nNo they aren't. At best they might oppose certain programs that are unpopular, once they're revealed. But they're consistently on the side of mass surveillance.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GhostReddit",
                    "body": "> Democrats are pretty much universally opposed to domestic mass surveillance programs.\n\nI haven't seen any real pushback against them or effort to stop it. Both parties approve this shit all the time, it's probably something they most agree about.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "incredulous-",
                            "body": "I agree with you. It is truly a bipartisan issue.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "I think it’s reasonable to criticize how selfish Snowden seemingly was in the aftermath of the leaks, but I think that’s just a smaller deal than what he revealed. If our government responded to the screwed up actions of the intelligence community, Snowden wouldn’t have had to become a Russian asset.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Moccus",
                            "body": "If Snowden had made any real effort to tell anybody in the government with the power to respond, then they might have, but Snowden didn't do that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HowDoIEvenEnglish",
                                    "body": "Snowden says he did, the NSA says he didn’t. I can’t really trust the NSA but obviously Snowden is biased as well.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Moccus",
                                            "body": "There were options outside of the NSA, but he chose not to bother. He should have gone to Congress.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "HowDoIEvenEnglish",
                                                    "body": "He went to American journalists, which is reasonable option if your bosses aren’t listening. It was only after his passport was revoked and he had no home that he gave away information in exchange for sanctuary",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Moccus",
                                                            "body": "It wasn't reasonable to leak a boatload of sensitive information to the press when most of it wasn't relevant to what he was complaining about. It risked doing a bunch of damage if the journalist had wanted to report on more than just the mass surveillance. That's why we can't allow that sort of thing to go unpunished.\n\nOnce again, his next step should have been to go to Congress if his bosses weren't listening. There were people in Congress who would have been willing to press the issue and had the power to dig.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "trash-juice",
            "body": "Hes a preditor dressed as a lamb, hes done damage to our intel abroad as witnessed by our ppl disappearing afterwards, the rise of putin including tramp only happens after snowden\n\nWhat happened to Five Eyes? That would have protected us from subversives and infiltrator’s from within but here we are, all this post anowden. You dont get what we have now without his treason\n\nWhere is he now? Well protected and treated as a turn coat ‘hero’ for the oligarchy.",
            "score": 4,
            "replies": []
        },
        {
            "author": "11bulletcatcher",
            "body": "1. From a military perspective, US government generally speaking shouldn't allow his actions to normalize.\n\n2. HOWEVER the NSA leaks were a patriotic act and should be pardoned. Everything after that, that's on him, but for that specific action, I don't care which party does it, pardon the dude, let him come home, and if there's other shit extenuating from that then that's on him to deal with.",
            "score": 6,
            "replies": [
                {
                    "author": "OtherBluesBrother",
                    "body": "He leaked much more information than just those describing domestic surveillance, such as the PRISM program. So, sure, pardon him for that part.\n\nNow, about the thousands of documents that weakened national security for the US, that's a different story. Let him have his day in court and let justice happen.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "HowDoIEvenEnglish",
                            "body": "The NSA foreign surveillance was just as fucked up. Spying on Angela merkel, giving private  date on American citizens to Israel, doing corporate espionage well beyond the idea of national security, using this data to”improve” drone strike targeting (in reality more people got killed innocent or not). \n\nThe NSA was doing fucked ip shot from top to bottom and it wasn’t all domestic. The sheer scope of the NSA’s reach was completely unknown to the public before the leaks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "-not_michael_scott",
                    "body": "He leaked more than just the nsa spying on everyone. That’s my only problem. He made choices, albeit very difficult choices, but some of them were wrong and are deserving of punishment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CivisSuburbianus",
            "body": "I don’t think you will find many people in Congress from either party who would call Snowden a hero. On national security and defense issues, the two parties are generally in agreement- during the Bush administration, the PATRIOT Act was supported by every Republican and a wide majority of Democrats, so they haven’t really changed. It’s only progressive Democrats and libertarian Republicans who tend to be critics of government surveillance as well as military intervention and aid to other countries.",
            "score": 2,
            "replies": []
        },
        {
            "author": "shank1093",
            "body": "I think unanimously in a vacuum and without power, most advocates of Democracy itself would consider that an encroachment if personal privacy, and against our Constitution.  To limit this to one or the other party to me is derivative of the real problem and question.  Do those that currently hold office and power still feel this way.  On both sides of the aisle...most republicans I know abhor surveillance and perceived over-regulation.  Usually Dems on the outside of power, too, agree that surveillance us an affront to the American people when unwarranted and even preventative to the poor outcome of bad intelligence....",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChartIntelligent6320",
            "body": "There are a lot of good points here in the comments I think it’s a contentious issue. \n\nOne perspective can be what’s the line to be a traitor? \n\nIf you’re doing a “good” thing and being a legitimate whistleblower then of course I would say not a traitor as you’re for the people. \nBut, what if the government that’s supposed to be for the people wants to come after you for doing this? \nBut, then… AH!HA! what if that person sought asylum in and aided China and Russia when perhaps they could have sought asylum in a different non extradition country while this is figured out? \n\nIt’s a lot for me to consider so I don’t have an opinion or just both a good/bad one",
            "score": 2,
            "replies": []
        },
        {
            "author": "fractalfrenzy",
            "body": "To everyone saying Snowden is bad because he leaked more than the mass surveillance, which of these things do you think he shouldn't have leaked?\n\n# 1. U.S. Cyber Operations & Hacking\n\n* The NSA was involved in extensive cyber espionage, targeting not only foreign governments but also corporations and international organizations.\n* Operations included hacking Chinese universities and telecommunications companies, including **Huawei**.\n* The **Tailored Access Operations (TAO)** unit was revealed as an elite NSA cyberwarfare division that specialized in hacking foreign networks.\n\n# 2. Foreign Surveillance & Espionage\n\n* The NSA spied on leaders of allied countries, including German Chancellor **Angela Merkel** and Brazilian President **Dilma Rousseff**.\n* **EU diplomatic missions** and the **United Nations** were also under NSA surveillance.\n\n# 3. Cooperation with Foreign Intelligence Agencies\n\n* The **Five Eyes Alliance** (U.S., U.K., Canada, Australia, New Zealand) worked together on mass surveillance.\n* British intelligence agency **GCHQ** tapped into fiber-optic cables to intercept global internet traffic through programs like **TEMPORA**.\n* NSA provided Israel’s intelligence agency with raw, unfiltered intelligence, including private data of U.S. citizens.\n\n# 4. Corporate Collusion with the NSA\n\n* U.S. tech giants like Google, Apple, Facebook, and Microsoft were **complicit in PRISM**, a program that gave the NSA direct access to user data.\n* Telecom companies such as Verizon were **forced to hand over phone records** of millions of Americans to the NSA.\n\n# 5. NSA’s Economic and Industrial Espionage\n\n* The NSA **spied on foreign corporations** and economic summits, such as **Brazil's Petrobras** and the **World Bank**, contradicting claims that it only targeted national security threats.\n\n# 6. XKeyscore & Global Internet Surveillance\n\n* **XKeyscore** allowed the NSA to **search and analyze vast amounts of internet data**, including emails, chats, and browsing history of people worldwide, without a warrant.\n\n# 7. Undermining Encryption Standards\n\n* The NSA **deliberately weakened global encryption standards** to ensure its ability to break into secure communications.\n* The agency worked with companies to insert **backdoors** into software and hardware.\n\n# 8. U.S. Drone Strike Targeting via Metadata\n\n* Intelligence gathered from surveillance programs was used to **assist in drone strikes**, sometimes leading to misidentification and civilian casualties.\n\n# 9. The Boundless Informant Program\n\n* A global surveillance data analysis tool used by the NSA to track and **visualize the extent of worldwide surveillance operations**.\n\nThese revelations showed the NSA’s reach extended far beyond counterterrorism and exposed how deeply government agencies were intertwined with global surveillance, cyber warfare, and industrial espionage.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NegligentNincompoop",
            "body": "Idk what others believe but generally I sympathize with Snowden but don't really respect Tulsi for her sudden and convenient change in views on literally everything. It's unfortunate Snowden is getting very close to the Russians but what else can we expect? I wouldn't trust what he says now but the reason he's in this position is because he tried to be a patriot and our government didn't like that very much.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kabooozie",
            "body": "Here’s the thing with Snowden. To bravely leak this information means coming to terms with the consequences. He had options.\n\nHe chose to go to the press, and instead of facing the consequences when he was caught and maybe getting vindication and a pardon down the line, he ~~went to Russia~~ fled instead.\n\nWe can assume he’s leaked damaging secrets to the Russians in exchange for protection. That makes him a traitor.\n\nEdit: He also arguably shared more than he needed to in the original leak.",
            "score": 7,
            "replies": [
                {
                    "author": "BluesSuedeClues",
                    "body": "As has been pointed out to me, Snowden did not \"go to Russia\". He was changing planes there, on his way from Hong Kong to Ecuador, where he had been offered sanctuary. The US State Department revoked his passport while he was in the Moscow airport, which marooned him there.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "novagenesis",
                            "body": "He chose to run, knowing he had information that could hurt the US unrelated to valid crimes that he whistleblew.  \n\nIf his motto was \"do what you must, then pay the price\", everyone would be calling him a hero now.  But it wasn't.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ClockOfTheLongNow",
                            "body": "His passport was revoked days before he went to Russia.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoOnesKing",
            "body": "I think Snowden did the right thing in exposing what he did. I would pardon him of that. Nevertheless I do not think he can or should be allowed to work in any field requiring a security clearance ever again.",
            "score": 4,
            "replies": []
        },
        {
            "author": "WaltEnterprises",
            "body": "I imagine they smear him as a \"Russian agent\" since he's a whistle blower on the corporate establishment that propagandizes the US voting population.",
            "score": 4,
            "replies": []
        },
        {
            "author": "billpalto",
            "body": "I have a simplistic view of it. In general, I hate it when the US government lies, and support whistleblowers who uncover the lie. I remember the Pentagon Papers, where what the government was telling us was a lie and they were exposed.\n\nMy simplistic take:\n\n\"We don't have any spies working in Russia\" -- US government\n\n\"I know that isn't true, I worked with some of them\" -- Snowden\n\nSo far so good, I can support the expose.\n\n\"And here are their names and addresses, and how they communicate, I gave all this to the Russians\" -- Snowden\n\nBAD.",
            "score": 2,
            "replies": [
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "Ye that’s a vastly overly simplistic view. Snowden did give information to the Russians, but the scope of the leaks was much much larger than you are saying. The Snowden leaks covered domestic surveillance, data on us citizens being given to foreign intelligence companies, spying on allied leaders such as the German chancellor, the use of domestic surveillance data for use in drone strikes targeting systems, and what was essentially corporate espionage on forged corporation that posed no national security risk (unless you count the back accounts of the ruling class as a national security issue).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leather-Map-8138",
            "body": "I’m against everything Tulsi Gabbard says and does, due to continuing unrefuted allegations of deep Kremlin connections and loyalties. Moscow should not have that level of influence on our national security. \n\nI remember her running in 2020 for President, as an extreme liberal far to the left of Harris, Biden, or Buttigieg. Apparently that was a hoax too. We don’t need double agents at the top of the food chain.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Keanmon",
            "body": "Obama fumbled the ball on this one. A very clear message was sent by allowing Snowden to feel like he had to stay in exile. \n\nBiden signed an EO on the use of mass malware-based surveillance spyware like Pegasus, but from my understanding this EO only prohibited officials from using foreign born Spyware and said nothing about homebrew techniques. \n\nI think the official democratic position is indifference.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LateralEntry",
            "body": "I think most Democrats, like most Americans, appreciate that Snowden disclosed the NSA surveillance program and have concerns about it, but view Snowden himself as a traitor for going to our enemy, Russia, and presumably sharing sensitive secrets with them. It calls into question his motives in the initial disclosure.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NimusNix",
            "body": "Mass surveillance is unconstitutional.\n\n\nEdward Snowden is a traitor.\n\n\nI don't know why people find it hard to say both things.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Anglicanpolitics123",
            "body": "When it comes to Edward Snowden I haven't looked into his particular case in almost a decade but I will say this. \n\n1)It was under a \"Democratic\" president(Barack Obama) that this incident happened. In general I think Obama was one of the greatest American presidents the United States has ever had. Like many historians I put him in the top 10. However his administration's treatment of whistleblowers was awful. His administration weaponized the Espionage Act more than any other administration up until that point. \n\n2)The people saying Snowden should have \"used the proper channels\" aren't being serious. He did try to use the proper channels. He tried to use the proper channels when it came to the new media, and he tried to use the proper internal channels when it came to the intelligence community. And he was rebuffed at every turn. \n\n3)If Edward Snowden is going to be considered a bad person because he \"broke the law\" then you're going to have to include a lot of people on that list. Martin Luther King Jr broke the law for a greater principle. Muhammad Ali and many of the anti war activists during the Vietnam War \"broke the law\" when it came to the draft because they didn't want to fight and unjust war. Getting philosophical here, St Thomas Aquinas famously stated that an \"unjust law is no law at all\". So we have no business giving legitimacy to laws that are unjust, whether its laws around race in the case of MLK, the Vietnam War, or Mass surveillance that literally violated the privacy rights of American citizens guaranteed by the U.S Constitution. \n\n4)The people saying Snowden is a \"Russian asset\" are just engaging in Mccarthyite slanders. Snowden, while in Moscow, has criticized Putin on a number of occasions. One of the first criticisms he gave of Putin was Putin's own mass surveillance policies\n\n[https://time.com/68036/edward-snowden-vladimir-putin-nsa/](https://time.com/68036/edward-snowden-vladimir-putin-nsa/) \n\nHe also critiqued the corruption of the Russian government \n\n[https://www.theguardian.com/us-news/2018/jun/29/edward-snowden-describes-russian-government-as-corrupt](https://www.theguardian.com/us-news/2018/jun/29/edward-snowden-describes-russian-government-as-corrupt)",
            "score": 2,
            "replies": [
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "I’ll disagree because Snowden is at a minimum a Russian sympathizer now. He has some culpability for that, but he would have preferred to keep living in the US. Obama forced him out. I think the good he did with the leaks well outweigh the damage he did, and I understand why he went to Russia. There aren’t many countries you can expect to protect you from the US , and I wouldn’t want the intelligence community to catch me after that either.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SevTheNiceGuy",
            "body": "My personal view is that Snowden is in fact a traitor due to the fact that he ran to another country to save his ass. He wanted praise for what he did and he did not accomplish anything. \n\nThe surveillance programs still exists under different names. And they'll continue to exist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aarongamemaster",
            "body": "... in my book, we need the surveillance programs, and that Snowden blew it is a major problem.\n\nTechnology has gotten to the point where you either adopt a surveillance state or die. Simple as that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kevin_Uxbridge",
            "body": "Short version: he's a fucking traitor.\n\nLong version: he's a fucking traitor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rbrt115",
            "body": "He should have leaked them to a liberal Senator. It would have been reviewed, and he would have whistle blower protection. \n\nHe went about it wrong and is now suffering the consequences.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spankety-wank",
            "body": "I think this situation and line of attack is only indicative of opposition to Gabbard and partly to Trump. Snowden is a useful tool to use against Gabbard right now, so they will say whatever they need to about him to damage Gabbard's reputation.\n\nI'm not making any claim about Democrats' opinions around Snowden, because I don't know or care, I'm just saying these questions don't inform us in that regard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Captain_Pink_Pants",
            "body": "The \"democratic\" position can only be that he's an exiled patriot and hero.\n\nThe \"Democrat\" position is whatever the Republicans said, minus 5%.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JayBringStone",
            "body": "How should democrats feel about someone exposing Big Brother spying on American citizens? You tell me! Cause at one time, democrats would be against it. As a matter of fact, because of what Snowden did, DEMOCRATS passed laws to protect whistleblowers. WHY HAS THAT CHANGED IN 2025? Because Tulsi Gabbard left your shitty party after liberals became war hawks and after democrats lied about her being a Russian asset? SO FUCKING SEE THROUGH!",
            "score": 1,
            "replies": []
        },
        {
            "author": "evissamassive",
            "body": "The fact that Democrats are so obsessed with this is why they blow hard. There are bigger fights than Snowden. They need to pull their heads out of their 2013 ass and get on with fighting 2025 issues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FLEO321",
            "body": "If Snowden wanted to be remembered by history he can take comfort in the fact he will be enshrined along with John Walker, Ronald Pelton, Jonathan Pollard, Aldrich Ames, Robert Hansen, John Walker Lindh, Martin and Mitchell, Ana Montes, and the standard bearer, Benedict Arnold. Throw in Kim Philly, Guy Burgess, Donald Maclean, and Stig Wennerstrom on the foreign side. \nI was personally affected by Walker’s treachery during my Navy service.",
            "score": 1,
            "replies": []
        },
        {
            "author": "43664365",
            "body": "They used to love him and champion him. But now that someone under Trump believes he was a good whistleblower for the American people - the democrats have to disagree. \n\nHere’s an article in 2014 - referencing liberal New York Times articles about how Snowden is brave and should be brought back to US free. \n\nhttps://www.aclu.org/news/national-security/heres-who-thinks-snowden-should-be-allowed-home-what-about-you\n\n\nI wish I knew where the democrats stood on anything as of late. It’s just anti anything Trump or his cabinet does. When a lot of it, is popular with Americans after 4 years of Biden",
            "score": 1,
            "replies": []
        },
        {
            "author": "blyzo",
            "body": "I see it as a strategy to derail Gabbard's nomination to director of national intelligence. Because there will undoubtedly be many Republicans who hated what Snowden did so hearing Gabbard defend him could lead them to vote against her. \n\nI think what Snowden did was heroic personally. And agree with Gabbard here, but she's absolutely unqualified to be our intelligence director.",
            "score": 1,
            "replies": [
                {
                    "author": "penderhead",
                    "body": "I think it's ridiculous that you think she's unqualified for the job.  Who even is?",
                    "score": -5,
                    "replies": [
                        {
                            "author": "blyzo",
                            "body": "Negroponte was a diplomat for 3 decades, Mike McConnell ran the NSA for decades, Dennis Blair was a navy admiral, Clapper ran the Defense Intelligence Agency, Coats was a US Senator and Ambassador to Germany, Haines was Dep CIA Director. \n\nGabbard was in Congress for less than a decade and is in the Hawaii National Guard.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "banjist",
            "body": "The Democratic party perspective is that he's a criminal who tried to harm America's national security. The Dems are neoliberals, not progressives, as a general rule.",
            "score": 0,
            "replies": []
        },
        {
            "author": "soapboxoperator",
            "body": "I'm reluctant to say this but I agree with Tulsi Gabbard on this issue, and I respect the way she answered this particular question.\n\n\nI think you're asking a really important question. It seems as though, in general, our Democratic reps have done very little to look into or push back against mass surveillance programs. What I take from this is that most Democrats are supportive of them, or at least not strongly opposed to them.\n\n\nOverall, while I think that the Republican party is very dangerous, in that it is supporting an actual con man/would-be dictator/robber baron with all its energy and resources, and as such, definitely represents the greater of two evils, *Democrats seem to be in office primarily to collect a paycheck and not to do their jobs of representing the public interest. \n\n\nThat's what I think, and I could be wrong, because I'm not the most informed person, but given how things are working out, that's my impression.\n\n\n*I should add that this is at least partly because they have to spend half their time fundraising just to hold onto their seats, although I would imagine it gets easier the longer they've been around, which is a problem in and of itself because it means staid old-timers dominate both houses, and it's difficult to get motivated, new people and fresh ideas circulating in Congress. So some of them may be doing the best they can in a system which obliges them to chase the money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnowingDoubter",
            "body": "“In no sense do I advocate evading or defying the law as the rabid segregationist would do. This would lead to anarchy. One who breaks an unjust law must do it openly, lovingly . . . and with a willingness to accept the penalty.” MLK",
            "score": 1,
            "replies": []
        },
        {
            "author": "l1v1ngth3dr3am",
            "body": "I met Snowdens boss 2 years ago. He totally changed my opinion on the story - Edward was a coward and traitor. \n\nShould our government spy on us? No. But he cost folks' lives. Like they died because of him.",
            "score": -1,
            "replies": [
                {
                    "author": "JQuilty",
                    "body": "The NSA has never substantiated those claims and they lied at multiple points in the aftermath of publication. Until they substantiate those claims, they're conjecture.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "l1v1ngth3dr3am",
                            "body": "I \"hear\" what you're saying. I always find it interesting what folks will accept without empirical evidence and what they don't. \n\nThe dude literally became a Russian citizen. They are not are friends. No matter how much the gamer chats try to convince us. \n\nBut yeah, he's a great guy and we definitely should put him on a pedestal as a hero because he said the magic feel good words for folks who think that privacy exist on telecommunications lines they don't own.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_Human1st",
                    "body": "He cost folks lives…\n\nName one. Also, he explicitly gave the information to reputed journalists (at that time, anyways) and told them explicitly to reveal the information without putting anyone in danger.\n\nI’m sure Snowden’s boss is a neutral arbiter in this situation lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "l1v1ngth3dr3am",
                            "body": "You cannot name undercover operators. Even folks who watch made up shows know that. \n\nI get the hard on you have for Snowden. I did, too. And his boss doesn't even work in government anymore.\n\nYou're probably one of the dumbasses who don't even don't even know about mail cards and how the government uses the post office to spy too. I'll down vote you too.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "The_Human1st",
                                    "body": "Man, you're triggered because you can't answer my question. Sorry about that, buddy.\n\nYou claim Snowden had secret agents harmed/ killed, and yet you can't name one. You also don't address the fact that Snowden didn't publish a single document, but gave it to reporters instead.\n\nSpeaking of hardons, are you sure you don't have one for Snowden's ex-boss?",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "“I met one of the actually deep state government employees and now I believe them when they say we need to be spying on everything”",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jrecondite",
            "body": "Create spying programs that the authors state are for the greater good but break the fundamental principles and morals of the thing you are trying to “protect.”  Make sure it has no due process or oversight to really make sure it breaks everything the country stands on.  In the eyes of elected Democrats that is not being a traitor. Now we don’t have any intelligence on what side the people in these projects are on or who they may be harming with undue power and abilities but we got a solid “trust me bro.”  That should be good enough to give up your rights and have no oversight of the public they are supposed to serve, correct?\n\nReveal the extent of the damage done to the country’s values by illegal governmental activities. In the eyes of elected Democrats that is a big time traitor. How dare he reveal how the system actually works against its citizens. They work really hard covering it up and he simply reveals it. Tsk tsk. \n\nThe first group that started the whole mess. Zero punishment. \n\nThe revealer. Massive punishment(hence the escape) and expected ostracizing and shaming. \n\nUntil you can square the above it’ll be hard to get me on board with elected Democrats feelings. ",
            "score": 1,
            "replies": [
                {
                    "author": "OtherBluesBrother",
                    "body": "The documents he leaked regarding domestic surveillance were a very small subset of the 1.7 million NSA documents. Those other documents did nothing but damage our national security.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Jrecondite",
                            "body": "My national security was more damaged when the good guys broke the rules. That first unlawful act beget all the others.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HowDoIEvenEnglish",
                                    "body": "Yep. The people in charge should be more responsible than random employee. People are acting like whistleblowers need to do everything perfect or they are traitors. Maybe our bosses should be criminals in the first place",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HangryHipppo",
            "body": "Not sure on the general democratic view, but Bernie Sanders has advocated for him to get a full pardon and then wanted to end prosecution of whistleblowers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rudiseeker",
            "body": "The constitution defines treason as either waging war against our nation or aiding our nation's enemies. Snowden's crime was airing confidential information concerning the existence, and possibly scope, of the government's surveillance programs. From my understanding, in practice, the term enemy has been generally associated to declarations of war, by congress. By this narrow definition, although he committed security crimes, he is not a traitor.  \n\nSome examples to support my claim. Jane Fonda supplied emotional support for North Vietnam, yet to my knowledge was never tried for treason. And North Vietnam solders were fighting American solders. When the Rosenbergs supplied the Soviet Union with atomic secrets, they were tried, and executed, for espionage, not treason.\n\nIn this instance, Tulsi Gabbard was correct. Given that, Snowden would be subject to punishment if he ever returned to the States. Note that I am not addressing the issue of, was it the right thing to do, just the specific issue of treason. Even though I'm a democrat, I don't speak for the opinions of other democrats. I hate to speak against democratic senators; but I suspect that it had more to do with opposing Gabbard than anything else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GhazelleBerner",
            "body": "The surveillance state is a tricky thing, and on the whole, it’s a good thing we know about some of the government’s abuses.\n\nSnowden did not handle his whistleblowing in a way that suggests his primary motive was the public good, and the days, months, and years since his leak have revealed that he was likely either already a Russian asset when he performed the leak or has since become one.",
            "score": -2,
            "replies": []
        },
        {
            "author": "gormami",
            "body": "All Americans should have a negative view of Snowden, in my opinion.  Was the mass surveillance process something that needed to be reigned in or ended?  Yes.  But he did not take the steps as outlined within the bounds of the job and clearance.  There is no evidence he materially engaged with NSA legal or the Inspector General, who could have handled the issue within the bounds of the law.  If that had been done, and not resulted in any action, that would be a different manner, but the only evidence he tried was a question to NSA legal about how they interpreted their authorities.  So he was thinking about it, but chose to mass dump intelligence information rather than follow protocols.  That's the problem.  He was given a very high level of trust, and he abused it, placing assets, methods, and information at great risk.    \n\n\nVice did a very long and detailed article, and if one actually reads it, rather than the headline, you can see that Snowden thought of himself as the main character.  He made claims that were well beyond anything that could be proven.  He may have had the issues in mind, but his interactions with others did not raise the real issues.  His concerns that the law didn't protect him were shown to be false, the latest law didn't, but previous laws still in force did, he either just threw that out to raise smoke, or didn't bother to look. \n\n[https://www.vice.com/en/article/exclusive-snowden-tried-to-tell-nsa-about-his-concerns/](https://www.vice.com/en/article/exclusive-snowden-tried-to-tell-nsa-about-his-concerns/)",
            "score": -1,
            "replies": [
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "Your point of view requires you to take the NSA in good faith because the only evidence in the entire article is whatever emails the NSA decides to publish. Given the whole point is that the NSA was doing shady stuff that no one knew about, why are we supposed to believe them here?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JayKaboogy",
            "body": "Ignoring Snowden himself, I think it’s important to remember that big D Democrats are collectively center-right politically relative to the world at large, and the Democrats on the Senate Intelligence Committee very much represent that—Given their clear disdain for Snowden, I assume they know something classified that we don’t (like specific cases of dead intel assets due to what he gave Russia/China to secure his asylum). IMO (which isn’t worth much) the blood on Snowdens hands got there due to US whistleblower policy (which is bipartisan-ly terrible)",
            "score": -3,
            "replies": [
                {
                    "author": "berninger_tat",
                    "body": "Please don’t repeat this tired trope of the Democratic Party being center right relative to the world. It was tired years ago and it’s tired today.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "JayKaboogy",
                            "body": "Tired like being endorsed by Dick Cheney? I think what you mean is ‘irritating to be reminded about’",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "berninger_tat",
                                    "body": "The fact that she was endorsed by the Cheneys had nothing to do with political ideology and solely the Cheney’s belief in institutions and the rule of law. This isn’t the gotcha you think it is bud.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "JayKaboogy",
                                            "body": "To each their own I guess, but I would define the current violations of institutions and rule of law as an autocratic/oligarchic move further to the right. Cheney and the many other Republicans that endorsed Democrats did so absolutely for political ideology. And the Democrats’ acceptance of those endorsements marks their further ratcheting right to court right-leaning voters. What does a sensible person call a political ideology supportable by the Cheneys et al. that is less right of far-right?—if you put the word ‘left’ in that, you are not a sensible person\n\nTo the point of OP’s question, Dick Cheney played a massive role in creating the illegal surveillance state Snowden outed. It’s therefore vitally important context that Cheney recently  endorsed the Democratic Party…for me, it explains why we see Democrats foaming at the mouth to define Snowden as a traitor when they are supposed to be the bleeding heart lefty liberals in the room",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "berninger_tat",
                                                    "body": "Current violations and rule of law UNDER THE TRUMP ADMINISTRATION. As a person who holds extremely liberal positions, I would happily endorse a conservative who wholly goes against my ideology if the alternative was a destabilizing autocrat.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tarekd19",
            "body": "i think I'd have a lot more respect for Snowden if he owned it and stayed here. He'd likely already be released or pardoned.\n\nAs for the surveillance programs, i remember his leaks and everyone reacting to them feeling like why is this a surprise? The Patriot Act was signed like 10 years before the leaks. Its like people felt fine with surveillance if they felt it was suspected terrorists (ie Muslims) but the reaction to finding out it was actually for everyone was eyebrow raising.",
            "score": 0,
            "replies": [
                {
                    "author": "HowDoIEvenEnglish",
                    "body": "Why would you think Obama would have pardoned him. Obama was a national security war hawk as much as any president.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tarekd19",
                            "body": "Because Obama granted clemency to Chelsea Manning for a similar crime.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Outrageous-Leopard23",
            "body": "Do you realize that many entities are spying your every single move. \n\nIf Facebook, Amazon, Russia are allowed to see every part of my digital identity then it makes sense that the Federal Govt should have similar access.",
            "score": -3,
            "replies": [
                {
                    "author": "DeadWaterBed",
                    "body": "Where's your dignity, man?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VVuunderschloong",
                            "body": "Traded it in for more boots, I’m guessing. The flavor wears away eventually.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Outrageous-Leopard23",
                            "body": "It’s in the real world. You can join us.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GhostReddit",
                    "body": "Facebook, Amazon, and Russia don't have the legal authority to prosecute me in my own home, the US Federal government does, so I'm naturally more wary of them having information to concoct whatever narrative they want should I become a person of interest.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Outrageous-Leopard23",
                            "body": "I totally understand this take. Especially if you are involved in thinly veiled fraud, scams, or felonies.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Outrageous-Leopard23",
                                            "body": "Yeah. Risk tolerance is dynamic and varies over time, that’s for sure.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}