{
    "title": "How are Tariffs on Mexico and Canada going to help the US consumer and economy?",
    "author": "Jester62",
    "subreddit": "PoliticalDiscussion",
    "rank": 51,
    "score": 228,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 377,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1iet8p8/how_are_tariffs_on_mexico_and_canada_going_to/",
    "id": "1iet8p8",
    "selftext": "I understand targeted tariffs have been used in the past to protect and develop domestic industries but how does a blanket tariff on all good from literally our closest allies?\n\nWhat consequences could we expect and how soon will we see a change if any?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tronn3000",
            "body": "The tariffs are going to increase prices and lead to a stagnant economy. I wouldn't be surprised if we return to an economy similar the \"stagflation era\" that plagued the 1970s during the Carter administration except with a lot more civil unrest. I just don't see how adding a \"tax\" that makes certain goods from certain countries x% more expensive will bring prices down. The math literally doesn't math.\n\nTariffs are normally implemented when a country has a booming existing manufacturing base that it wants to protect from foreign competitors but they can't revive dead industries. It takes time to build industry. It is a huge multi year investment to build factories, design a supply chain, hire qualified workers, etc and it is no guarantee that any of this once up and running can be profitable in the long term.\n\nThe world is also much more globalized than it was back in the days that MAGA wants to return to. A Boeing 787 has its final assembly done in South Carolina but it has parts from 58 different countries from hundreds of different suppliers. Sure the US can try to make some of these parts in America but again, it takes time and money to get that up and running. Obviously this is an extreme example since a 787 is super complex but many \"Made in America things\" have some of its supply chain in other countries.\n\nAnother thing these tariffs fail to realize is there are simply some goods that just can't be \"made in America\" at the scale Americans demand them due to climate. Coffee, bananas, coconuts, avocados, etc. are all grown in more tropical climates. Sure some avocados are grown in California amd some coffee comes from Hawaii but not at the scale Americans demand.\n\nI just don't see how any way that implementing tariffs will \"Make America Great Again.\" Its just going to make shit more expensive and make us poorer.",
            "score": 73,
            "replies": [
                {
                    "author": "Hatedpriest",
                    "body": "There was a run of tariffs about 100 years ago. Plunged the world into the great depression.\n\nHere we go again.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Theinternationalist",
                            "body": "To be fair the US (and large portions of the planet) were *already* going through the great depression when the tariffs were put into place.\n\nThe tariffs simply extended it.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Hatedpriest",
                                    "body": "Both in duration and severity. Not the only cause, by any means, but widely considered one of the main drivers of it.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "spendology",
                            "body": "Smoot-Hawley Tariffs",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Foolgazi",
                    "body": "Not to mention there’s no way for the US to compete on manufacturing cost of a lot of goods/products unless we also want to compete with the 3rd world on wages.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "friedgoldfishsticks",
                            "body": "Of course Musk would love that.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "Economic moves like this unnecessary trade war will ensure US wages devolve to 3rd world levels whether that was the intent or not.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Alive_and_d_d_dot",
                            "body": "Not true. And tariffs combat that. Ignoring that, so you are arguing for us to keep other nations as 3rd world countries so we can have cheap Nike's.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "How can the US can be cost-competitive with Mexico on manufacturing without matching their 3rd world wages?\n\nAs for tariffs, of course they *could* make manufacturing more cost-competitive, as long as society is good with everything tariffed going up in price and our trading partners suffering. Since you mentioned that last part, I’ll need you to explain how the US might improve wages in countries like Mexico.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Biscuits4u2",
            "body": "They aren't going to help anyone. I'm convinced Trump wants people in this country to suffer so they'll get in the street and protest, giving him some kind of fucked up predicate for suspending the Constitution and declaring martial law.",
            "score": 615,
            "replies": [
                {
                    "author": "ThreeKiloZero",
                    "body": "I think he doesn't understand them and he cant stand to be wrong about anything. Thus he's trying to prove everyone wrong by force and will.  \n\nHe can't let it go, he must find a way to prove he's right about tariffs. He cant stand any slight to him that might make him wrong, foolish, or less than the image he has in his mind of himself. \n\nHe is a psychopath.",
                    "score": 283,
                    "replies": [
                        {
                            "author": "Tschmelz",
                            "body": "I believe Bolton stated a couple years back that people tried to take Trump aside and explain how tariffs actually work to him, and he couldn't wrap his head around it. It'd certainly fit with his character, that it's just another temper tantrum.",
                            "score": 167,
                            "replies": [
                                {
                                    "author": "Mediocritologist",
                                    "body": "He doesn’t know how they work. He just knows they exist and thinks they’re a good form of bargaining. He doesn’t have a single alternate idea so he’s hamfisting tariffs.",
                                    "score": 92,
                                    "replies": [
                                        {
                                            "author": "WISCOrear",
                                            "body": "He also knows that he gets to more of less fully control them as a president, so he doesn’t need congress to tell him no. It’s all Trump. I’m convinced that’s like 90% of why he wants to do it.",
                                            "score": 54,
                                            "replies": [
                                                {
                                                    "author": "WingerRules",
                                                    "body": "This, its the laziest way for him to do things. He doesnt actually have to come up with thought out policy and do negotiations.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Killersavage",
                                                            "body": "The sad thing is he could just golf and do jack shit. Fox and the rest would just say he is and has been doing amazing. It would actually be way better than what he is doing. He could probably bump his approval number if all he did was just shut the fuck up and only golf.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Alive_and_d_d_dot",
                                                                    "body": "His approval rating is better now than when he was elected. So he should definitely not follow your advice.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "epiphanette",
                                            "body": "Bargaining for what? What are we trying to extract out of Canada?",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "mar78217",
                                                    "body": "Trump thinks we have an uneven trade agreement because Canada spends less on US goods than the US spends on Canadian goods... it is simple economics though. We have more consumers and our consumers consume more...",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "Kiwip0rn",
                                                            "body": "This is true, just like with the UN, we spend more than the other countries on military. But they spend more per resident. Trump and Maga don't understand maths and just look at the totals.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Unlikely_Bus7611",
                                                            "body": "Trade deficits, he's looking at it like a business money coming in and money going out, however this is not a business but international trade amongst nation states. The US benefits from these trade deficits we get goods, and they get dollars that they then use to buy are debt and invest in our markets, it benefits the US economy two fold, it is the chief benefit of being the world reserve currency, Trumps plans threaten that world order, and i dont think he or MAGA truly understand this. I worked over 8 years with MAGA minded people there lack of understanding is only equal to their greed, these people haven't a clue except what's feed to them by Hate Radio and Fox News,",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "analogWeapon",
                                                    "body": "Anything that Trump can market as him making a good deal. Making deals is his brand. He just wants to be seen as a president that made good deals. I don’t think the specific thing matters to him.",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ObviousBridge4685",
                                                    "body": "A wealth of resources. Oil, energy, technology, lumber, water, minerals, etc. We’re good — we are not interested in becoming “the 51st state”. We are a sovereign nation with different cultures and different laws. Trump thinks he can strong arm us with tariffs into bowing down. Hell no.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Freckled_daywalker",
                                                            "body": "Alternately, economic uncertainty tends to lead to a rise in voters preferring strong man, authoritarian leadership. Our President is an idiot, but many of the people around him are not, and there are people who would love to take advantage of a swing to far-right sentiment in Canada. Be ready to push back.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "ObviousBridge4685",
                                                                    "body": "I take Trump both seriously and literally. I am scared. I know many people (Canadians!) that adore him—even with his threats towards our own country.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "shawsghost",
                                                    "body": "It's the maple syrup, you fool! It's ALWAYS the maple syrup!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "epiphanette",
                                                            "body": "Can we deport the canadian geese while we're playing stupid games?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "shawsghost",
                                                                    "body": "That's not quite stupid enough for Trump games. What we should  do is kidnap the Canada geese and make the Canadians pay us a ransom for their safe return. And rename them USAgeese. Everyone will love that!",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "do_add_unicorn",
                                    "body": "\"I am so smart! I am so smart! S-m-r-t! \n\nI mean S-m-a-r-t.\"",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "ARLibertarian",
                                            "body": "\"M-O-O-N!  That spells smart!\"",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Hatedpriest",
                                                    "body": "Thanks, Tom Cullen. We appreciate your assistance.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "speedingpullet",
                                                            "body": "*The Stand* feels more and more possible every day. Still one of my most fave books in the world.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "BluesSuedeClues",
                                                                    "body": "Captain Tripps would be a relief at this point. At least the slow death from a thousand cuts of Trump's incompetent Presidency would be over.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MagicCuboid",
                                    "body": "This tells me that when prices go up, he's going to blame Canada and Mexico even more for \"raising prices\"... and persist racing to the bottom and destroy the USMCA entirely",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "BluesSuedeClues",
                                            "body": "And then when the inevitable economic crash follows, his billionaire buddies will be there to buy up all the broken pieces.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Alive_and_d_d_dot",
                                                    "body": "You mean like how Bidens billionaire masters  have been doing the last four years?",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "The_Real_dubbedbass",
                                    "body": "One of his professors at Wharton said he was the worst student he’d ever had.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "Silcantar",
                                            "body": "That's cause he only got in because of DEI. Daddy's Exceptional Income.",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SlowMotionSprint",
                                    "body": "Which is terrifying because tariffs aren't particularly hard to understand at a base level.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Ok-Routine8655",
                                    "body": "Yeah, not smart...Canada supplies over half of oil for the USA, 25% of the lumber, precious elements for the military that they cant get anywhere else...bad idea",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Alive_and_d_d_dot",
                                    "body": "Bolton is a war monger.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Icy-Entertainer136",
                            "body": "The worst kind of psychopath. Spoiled, entitled, ignorant and orange.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "Ashamed_Distance_144",
                            "body": "An alternative truth about tariffs. Cheetoh can never be wrong, so he’s going to keep pushing tariffs until his cult accepts it’s because Biden screwed up.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Cjmooneyy",
                            "body": "Conservatives think hes some economic genius and he must know more than everyone else. I think you're spot on, he just doesn't understand them and is a stubborn little bitch.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BitterFuture",
                    "body": "It's not even that complicated. He just likes seeing people suffer.\n\nHe has people around him smart enough to take advantage of the situations he creates, but he himself just really enjoys the suffering he causes.\n\nRead up on the pathology of sociopaths. Inflicting suffering is the only thing that can give them a sense of happiness - and even then, only for a little while.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "jmnugent",
                    "body": "I believe thats part of it, but in the wider picture, Trump just likes being a “chaos agent”. The more turmoil the better. After all he can just say “See!, this is why you need a strong man in charge!",
                    "score": 50,
                    "replies": [
                        {
                            "author": "Imnottheassman",
                            "body": "Sounds very Russian.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "Ever since he traveled to Russia in the ‘80s his worldview has been shaped by Russian propagandists. “America first” is basically just trade protectionism that reduces America’s global influence and by extension its economic success.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LeftToaster",
                    "body": "Trump doesn't understand economics and doesn't care if it helps or hurts Americans.  He only cares about projecting his crafted image as the Boss, the Big Man, the Alpha.  He has only ever worked for his own family business where everyone else does all the work and then flatter him by having him make the obvious decision.   He believes that's how bosses work.  It's all performative posturing for the unwashed idiots who support him.\n\nIf the press were competent and independent they would refer to tariffs as a Trump sales tax. But they are just as cowed and sold out as everyone else.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "GrumblyData3684",
                            "body": "Exactly, it essentially puts a leash on the market that will prevent any breakouts. Anything good that happens has to come from him.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DontBeAUsefulIdiot",
                    "body": "Trump maybe doing some pump and dump schemes as well.  He's in a perfect position to manipulate the market for his own gains and of course, his friends as well.  \n\nAnother possible motive is that by tariffing Canadian oil, it also opens up potential spigots in Russian oil.  If things get too desperate, the public (and even in Europe) maybe changing their minds on Russia and ultimately the Ukraine war.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Ok-Routine8655",
                            "body": "Canada will build an Eastern pipeline to St John, where they have a refinery (refit it for heavy crude) and sell it to Europeans",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "anti-torque",
                            "body": "Canadian oil being rerouted to other markets diminishes the need for Russian oil. The US isn't bringing in Russian oil, so it's not a replacement for diminished trade to the north.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nanotree",
                    "body": "Based on people who know Trump, he really is just stupid. He doesn't have some master plan. He's too egotistical to let people with a plan control everything. So he's just doing all this shit he said he'd do during the campaign because he likes it when people cheer and like flaunting power. He operates in chaos, because that's what he knows how to manipulate. We're basically in a 4 year episode of the apprentice, only real lives are on the line.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Desperate_Mistake_81",
                            "body": "You think he is going to leave after four years still?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "behemuthm",
                    "body": "Plus we already tried tariffs a hundred years ago and, anyone? Anyone know what happened? Did they work? Anyone? Anyone? \n\nhttps://youtu.be/uhiCFdWeQfA?si=jm1SjeME_GApejDV",
                    "score": 6,
                    "replies": [
                        {
                            "author": "maizemachine10",
                            "body": "I get the reference, NPR planet money did a good bit on this too",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Alive_and_d_d_dot",
                            "body": "We are tariffed across the globe.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mediocritologist",
                    "body": "Against the caution from literally everybody and tons of previous examples of it not working, Trump legit believes in tariffs. He always has since before he was president. This presents an equally scary prospect: he has no clue what he’s doing.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "00CinnamonBuns",
                    "body": "So instead, let’s boycott everybody making money off this fiasco!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "jgreywolf",
                            "body": "Will you stop using Amazon? \n\nIt's a serious question.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "00CinnamonBuns",
                                    "body": "Well, start with killing Facebook, Meta, and X. If so inclined, bitcoin et al should be easy to let go of. Lots of people have let go of the Washington Post but that already loses money. Even cutting back on Amazon and buying local would help.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "maestrodks1",
                                    "body": "That's the dilemma, isn't it? Been having that internal debate for a few weeks now.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "jhuckster",
                                    "body": "Yes! Use Amazon for research, then buy direct from the manufacturer, buy local or find a substitute.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jhuckster",
                            "body": "Yes! Amazon, Meta, Tesla- they’re all public companies.  Boycott them for two quarterly reports and let their stockholders put pressure on them to cease and desist their evil ways.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_JDubb",
                    "body": "This sounds like a whacked out conspiracy theory, yet seems so fucking plausible at this point. He admires  dictatators and embraces oligarchs. What eles could they be thinking? It will surely bring the left and right together but at that point it could be to late.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Tyler119",
                    "body": "No he is using them as a tool to bully other nations. He is relying on the strength of the us economy Vs other nations.  That they can't stand firm for as long as he can.  Then they give whatever concessions he is after.  \n\n\nFor his supporters he will be labelled as being strong for America.  ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Foolgazi",
                            "body": "Except he just stated the tariffs are now about bringing down the trade deficit, and there’s nothing Canada or Mexico can do to negotiate them.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_Real_dubbedbass",
                    "body": "Yup. It’s so that we are okay with a dictator.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "unconfusedsub",
                    "body": "This is my thought as well. Same as cancelling federal grants for 1 day",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "strywever",
                    "body": "I agree with you.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jasarek",
                    "body": "I honestly don't think he's smart enough to come up with that. Well, at least not on his own.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ero_gero",
                    "body": "I think maybe it’s more fuck it up, then he’ll be like you see what they did to you? As a way to make America want to go to war for resources. But I think it backfired because the American individual is more morally good than the assumed American population and instead will be smart enough to know better.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Foolgazi",
                            "body": "I think you’re giving half of the voting public way too much credit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Prof_Tickles",
                    "body": "I think he’s got scores to settle so he’s burning everything down as a means of petty revenge.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OLDAD52",
                    "body": "You got that right, Trump is putting all the people in place to hang onto power and throw out democracy and usher in a dictatorship.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Foolgazi",
                    "body": "My current theory is he wants to tank the dollar so Bitcoin (or maybe even one of his shitcoins) becomes the de facto currency.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No-Chain1565",
                    "body": "Sadly I believe this is his endgame.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Jbowl1966",
                    "body": "Do you think anyone in the military will resist??",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Affectionate-Lead535",
                    "body": "This time he has someone who will approve shooting protesters \"in the legs\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ThrowRAboo_botak",
                    "body": "I'm at a real loss for words for how Trump's tariff policy is going to make America great (again) when this same policy will make people pay more for goods.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Shoddy-Barnacle5868",
                    "body": "Liberals and dems are the ones historically that have taken the steps to escalate tensions internally for their own political gain.\nI dont see trump as anti-constitution he's just very blunt in his opinions and policy and has a tendency to get too far ahead of himself",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Biscuits4u2",
                            "body": "You've obviously never read the constitution if that's your position.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "N0va-Zer0",
                    "body": "Then why did Canada slap back with tarrifs if all they do is hurt their citizens?\n\nMental gymnastics in three...two..",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Biscuits4u2",
                            "body": "Because fuck Trump and his illegal bullshit, that's why. Appeasement doesn't work. I'm glad they're standing up to this bullshit.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xocanarchy",
                    "body": "He's actually ramping up the security and builts concrete around the white house at the moment.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ackillesBAC",
                    "body": "Trump doesn't want anything but to be in the spot light. Putin wants the west in chaos and trump is the perfect useful idiot",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Jmakoyk",
                    "body": "No.  A tariff is not a tax per se, but ultimately it is a tax (government revenue generator).  Traditionally,  it's a way to protect an industry or even build an industry domestically.  Universal tariffs have only one purpose: generate federal revenue.  Why?  To extend/pay for a tax break for the rich in the US.  The US does not have the money to do this, so they need to generate some kind of revenue that will cover expenses and pay for the rich to get even richer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheFallingStar",
            "body": "I am Canadian. My guess is he is trying to get leverage for renegotiation of NAFTA before 2026.\n\nYou will see things becoming more expensive in US. Lumber, gasoline prices may go up. Inflation will return under him. It will also depend on how my country will retaliate.\n\nEdit: I also want to add, this is basically a big middle finger to US autos. Parts go between US/Canadian border up to 8 times before finally assembly.  Car prices will go up because of the tariff.",
            "score": 138,
            "replies": [
                {
                    "author": "eldenpotato",
                    "body": "But he’s the one that renegotiated it during his first term. Is Trump admitting that he actually sucks at negotiations and making deals?",
                    "score": 51,
                    "replies": [
                        {
                            "author": "blackadder1620",
                            "body": "you'd really think they say what they wanted different this time around. \n\nmaybe they have a concept of a plan",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "CJLocke",
                                    "body": "They do have a plan.\n\nThis is the plan. Maximum chaos, destruction and carnage.\n\nThey are literally trying to burn the country down.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "N0va-Zer0",
                                            "body": "What are you talking about? Biden isn't in office anymore.",
                                            "score": -4,
                                            "replies": []
                                        },
                                        {
                                            "author": "ItsafrenchyThing",
                                            "body": "Biden was burning the country down last 4 years by making us pay for Ukraine and all the illegal immigrants. But you mad at the fact the us imports 1.35% from Canada ? But Canada imports 35% from the US. So how does your numbers work ? Cause what you are saying makes no sense.",
                                            "score": -6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "frumply",
                    "body": "As does Mexico re: car plants. The supply chain for that stuff is absolutely massive.  Tons of parts for engines and I believe those typically cross borders, I got hired on almost in one where I’d be traveling between Texas and Mexico weekly to maintain plants.\n\nHilarious to me is that all of this could help prop up EVs I a way — IRA requirements had mfgs moving a lot of parts stateside, and we’re about to see a jump in the price of gas.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "bigmac22077",
                    "body": "NAFTA does not exist. Trump already negotiated a trade deal his last presidency called usmca.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "TheFallingStar",
                            "body": "Most of us in Canada still call it NAFTA just to annoy him. \n\nChanging thr name was such a childish behaviour\n\nMy Econ prof calls it nafta 2.0",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "bambin0",
                            "body": "You know what he means... Akchually",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "bigmac22077",
                                    "body": "Not at all. Some people genuinely don’t know Trump negotiated the most recent trade deal.",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Foolgazi",
                    "body": "You’re giving him too much credit. He doesn’t think beyond the tip of his nose.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Ssshizzzzziit",
                    "body": ">Car prices will go up because of the tariff.\n\nWhich means crime (car theft, and vandalism) will go up in places like NYC.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Happypappy213",
                    "body": "Is he not violating the USMCA agreement by doing this? \nSomebody mentioned that he could do this if he deemed it a national emergency. I don't know if that'd correct or not.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheFallingStar",
                            "body": "He is basically destroying US international reputation.\n\nWhat is the point of signing a trade agreement with US even if it is ratified by Congress?\n\nChina is going to be a more reliable partner.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xxpired_milk",
                    "body": "Or maybe it's just what he said it was - economic force towards annexation.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "x3nhydr4lutr1sx",
                    "body": "Not Tesla tho. Virtually all parts are sourced in USA. It pays to have bet on the presidency.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "escapefromelba",
                            "body": "They still source the raw materials from international suppliers.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "anti-torque",
                            "body": "?\n\nTesla tends to make its own parts... from raw materials sourced from all over the world. The truck, since they want to call it that, is Finnish steel.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Theinternationalist",
                                    "body": "What makes the Cybertruck not a truck? I know it's considered a fire hazard and such but it occurs to me I'm not sure of the technical definition.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "anti-torque",
                                            "body": "I have no idea where to put a tool box and a rack.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TheFallingStar",
                            "body": "Kind of ironic considering this administration doesn’t like EVs. They are going to make US brand ICE vehicle more expensive",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flyinoveryou",
                    "body": "Not if they become manufactured and assembled in the US. Trump speaks harsh on the auto industry moving facilities outside of the US.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "TheFallingStar",
                            "body": "Then the tariff should be targeted. What he is doing is stupid.\n\nHe makes aluminum from Quebec more expensive to import. US autos need these aluminum even if everything is assembled in the US",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "flyinoveryou",
                                    "body": "Maybe one component but overall better for the US if the jobs are kept here and most of the components avoid the tariffs. I recently saw an article about Porsche considering bringing manufacturing to the US.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "TheFallingStar",
                                            "body": "Even if it cost one million USD per job?\n\nHis previous attempt on washer means US consumer subsidized each job saved at the cost of 800,000 USD. \n\nhttps://news.uchicago.edu/story/what-washing-machines-can-teach-us-about-cost-tariffs",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "flyinoveryou",
                                                    "body": "The US own pentagon has failed every consecutive audit it has ever had. Foreigners always criticize some of the US systems like healthcare, welfare, etc. The US can’t fix any of these problems, yet they seem to throw away, hide, give away, or lose tons of our tax money every year. Most citizens are fed up with the inefficiencies of the federal government. \n\nhttps://responsiblestatecraft.org/pentagon-audit-2666415734/\n\nIf you ask someone whether they support a tariff or not is one thing, if you ask someone if they would pay $12.5 for a shirt that supports local business or $10 for a shirt that supports a foreign business, you will likely get a different result. I deal in an industry that has a direct choice and if I tell a customer that they can buy a US made product or a foreign product, the customers lean overwhelmingly to the US product even though it costs a little more.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "flyinoveryou",
                                                    "body": "Americans would rather pay a little more to keep jobs in the US than outsource when given the choice.\n\nAlso, US citizens want a shake up, that’s why Trump was voted in. The Ukraine war, whether people support it or not, opened many people’s eyes into the amount of money the federal government gives away of US citizens tax dollars in foreign aid. Many started to question whether or not that money would be better spent in the homeland first.\n\nhttps://www.usnews.com/news/best-countries/articles/countries-that-receive-the-most-foreign-aid-from-the-u-s",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "TheFallingStar",
                                                            "body": "Well that is your opinion, the last poll I read say only 29% of American support the tariff on Canada.\n\nIt is fine if you guys decide to retreat from the world, China will end up replacing you guys as the leader.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BuckFushFobama",
                    "body": "Fact of matter is Canada is really not an independent country. It has always been a prostitute nation for U.S.",
                    "score": -16,
                    "replies": [
                        {
                            "author": "anti-torque",
                            "body": "That's right... ever since our victory on the Plains of Abraham.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "algarhythms",
            "body": "They won’t help anyone. \n\nYou gotta remember he’s not smart, and it’s not that he likes to see people suffer — he’s *indifferent* to others. \n\nHis boundary-layer understanding of tariffs is:\n\n1. US makes nothing and other countries make things that we buy because they’re cheaper. \n\n2. Tariff the other countries to make their things more expensive and the US versions of stuff becomes the cheaper option. \n\n3. If we don’t make the things, we’ll build factories to make their things in like a week and it’ll be fine. \n\nSounds reasonable if you paid zero attention to any economics lesson because you never had to learn anything and had your grades bought.",
            "score": 109,
            "replies": [
                {
                    "author": "shibiwan",
                    "body": ">US versions of stuff becomes the cheaper option. \n\nUS companies, seeing that the imports are more expensive, raise their prices to match. Might as well make an extra buck. \n\nUS consumer ends up paying more for domestic products too. \n\nThis is a self-sustaining race to the bottom, and the orange jackass started this shit.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "reelznfeelz",
                            "body": "That’s what my dad said about the taxes on light trucks from what, the 70s?  That American manufacturers just raised their prices and then they both cost more.  That was the only affect from the consumers standpoint.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Low_Stress_9180",
                            "body": "Basically it's a sales tax so he can van cut taxes for the rich",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "PrithviMS",
                            "body": "Implicit price fixing at its finest.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "escapefromelba",
                    "body": "All Trump had to be was smarter than his voters.  That said I'm not really sure he's stupid. He's certainly a genius when it comes to masterminding an election campaign and manipulating the press.  He is proven pretty brilliant at positioning himself to profit directly from his public service. He overthrew the power brokers in the GOP and made the party his own.  I'm not sure many idiots could pull that off.  Hell, he has basically captured the most powerful nation and bent it to his will. \n\n\nHe's certainly no policy wonk but I think it's a mistake to question his intelligence. I think it's his motives that should be more in question.  ",
                    "score": 21,
                    "replies": [
                        {
                            "author": "serpentjaguar",
                            "body": "I think he's more of an idiot savant than some kind of secret genius. I think his narcissism and sociopathy are his super powers, not his intelligence.  \n\nHe can go out on campaign and blast the most outrageous bullshit lies for months and years on end and because he believes it, or more accurately just doesn't care, he gets away with it and is never held to account by his voters. \n\nAnd you can't fake it either. It has to be what you really believe, otherwise, as we've seen in so many other GOP leaders --Desantis is the most obvious example, but Vance is pretty good too-- you come off as stilted and awkward and playing a part.\n\nHe also fights, doesn't give a shit about norms, decorum or manners, and his supporters love it. \n\nBut here's the thing; while that makes him a great campaigner, none of it actually translates into being able to govern, and because none of it's based on real intelligence, he can't make the transition from campaigner to functional president, able to plan and execute complex policies. \n\nAs for the GOP, apart from the obvious grifters and con-artists who are willing to whore themselves out for anything they think will give them power, they did it to themselves. They had the chance to do what they all knew was right and confirm his impeachment, but in the end they took the cowardly route and hoped that public opinion would do the job for them, as surely would have been the case with any other politician.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "illustrious_d",
                                    "body": "His ability to campaign is pure instinct. He represents the worst aspects of the worst segment of our population, so they vote for him. He doesn’t understand it anymore than a dog understands how an airplane works.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Severiantheblack",
                                    "body": "A lot of conservatives on reddit are saying that Vance would be their #1 pick for the top of a ticket in 4 years. Do you think the \"playing a part\" factor you mentioned would hamstring Vance with enough voters to make it difficult to win over enough republicans to win the presidency (ignoring all the other immense factors that effect this sort of thing)?\n\nVance is slick and articulate and articulates the far-right and center-right talking points really well, but is the \"inauthenticity factor\" big enough to be a problem for him if he runs for president?\n\nAlso, if MAGA and republicans feel like they're winning a lot during these upcoming 4 years, would most republicans just vote for the guy who they think will keep giving them wins, that glorious feeling of winning, even if he doesn't have that X-factor and may even come up short in the charisma department?\n\nI would like the republicans to run Vance, because I think he's going to be a problematic candidate for a few reasons, but I'm trying to talk myself into believing that he's as weak a candidate as I'm hoping.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ok_Commercial9889",
                            "body": "He is no election mastermind, i have never seen him speak a single coherent sentence in election speeches. So basically being stupid has helped trump attract votes of stupid americans.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Low_Stress_9180",
                            "body": "Triump's father was hired Mccarthy right hand man Roy Cohn to train Trump in political takeovers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nickeless",
                    "body": "lol he definitely likes to see people suffer. At least people that he feels wronged him in anyway whatsoever. Also I think he likes all non white people to suffer. I do think that he is indifferent outside of those giant exceptions.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "urthbuoy",
            "body": "I think it is simpler. Create a drop in the stock market and let the rich feast on the low.",
            "score": 63,
            "replies": [
                {
                    "author": "Baby_Needles",
                    "body": "Ding ding ding! Avarice makes people extremely vulnerable to shortsightedness. It’s the marshmallow test ad Infinitum.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "not_sure_if_crazy_or",
                    "body": "I feel like this is \\_exactly\\_ it. I don't think Trump is capable of thinking out some massive multi-year restructuring program. The tarrifs are too generic. But in the short-run, you create a market dip the rich can profit from, and then claim hero status when you resolve your own problem near the next election cycle.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BathroomEast3868",
                    "body": "can someone explains the metaphor please ? i didn't get it :(",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "junk986",
            "body": "They will crash it so the oligarchs will be the only ones owning everything….including all housing as people bottom on. It will cause a fire sale for people just to survive.",
            "score": 26,
            "replies": []
        },
        {
            "author": "Rocketgirl8097",
            "body": "Gas prices will go through the roof on both coasts and upper Midwest since they are big users of Canadian oil. Construction costs will skyrocket since timber comes from Canada. Anyyhing made of tomatoes will go through the roof, as well as avodacoes and other vegetables that cant grow here in winter. No Mr. Trump we do not and cannot supply these things for ourselves.",
            "score": 24,
            "replies": [
                {
                    "author": "Alive_and_d_d_dot",
                    "body": "Or perhaps we start producing our own timber again instead of watching it burn every year. Construction costs will fall because enough people will get mad about the insanity of permits and school fees. Actual crops will be farmed instead of corn and soy. And Mexico and Canada are gonna have a lot of really pissed off citizens, pissed at their government because they have no money because they have no one to buy their stuff.",
                    "score": -32,
                    "replies": [
                        {
                            "author": "neverendingchalupas",
                            "body": "U.S. lumber would be incredibly expensive compared to Chinese, Russian, Brazilian, Canadian lumber.  There is no pathway for it to be successful under Republicans.  Construction costs are going to skyrocket due to fuel, material, and cost of living skyrocketing labor costs.\n\nThe bulk of the climate and soil in the U.S. isnt going to produce anything but Hay, Corn, Soybeans and Wheat.  It wont be profitable to do anything else, and the multinational investment management and private equity corporations that own agriculture would just sell off land rather than continue to take a loss, or sell foodstock to produce biofuel.  The agriculture lost will be lost for good.\n\nA global economy exists for a reason.  Trump and Republicans will be the cause of an incoming economic collapse.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Alive_and_d_d_dot",
                                    "body": "Completely false. Timber hasn't declined in the US because of profitability. It's declined because of dozens of agencies doing everything they can to annihilate any form of independence. Because of wacked out liberals who have zero understanding about the reality of ecosystems and mans part in nature. Because of globalist interests that use corruption in local governments to regulate to death and snuff out any sovereignty and force global dependency. \n\nThe United States has possibly the most diversifiable and productive agricultural land in the entire globe. From sea to shining sea. Hay is not a problem. It feeds live stock. Corn and soy are only profitable because of subsidies. They destroy the soil. Are genetically modified to toxic barren monocrop Used to make ethanol and all the toxic shit in our ultra processed food. corporate interests own some farming. But they have far from killed the farmer. The people trying to rid us of farmers are not Republicans. \n\nAn overly interdependent global economy does exist for a reason. It's a nefarious one. Trump is the only one trying to prevent the impending collapse. One that's been a long time coming. He will succeed because he's not alone. A whole lot of us have woken up.",
                                    "score": -29,
                                    "replies": [
                                        {
                                            "author": "neverendingchalupas",
                                            "body": "You have stepped so far off the deep end its really not worth my time rebutting you.  Good luck with your mental illness as Republicans dismantle healthcare.\n\nI will check back up with you in a couple months for a big fat I told you so.  So you can take comfort in that.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Foolgazi",
                                                    "body": "Give him some credit, he may have also read a summary of Atlas Shrugged",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Alive_and_d_d_dot",
                                                            "body": "No, I've witnessed it happen over decades.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PoliticalDiscussion-ModTeam",
                                                            "body": "Keep it civil. Do not personally insult other Redditors, or make racist, sexist, homophobic, or otherwise discriminatory remarks. Constructive debate is good; mockery, taunting, and name calling are not.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Rocketgirl8097",
                            "body": "It will actually be our citizens declaring bankruptcy right and left because other countries will not want to trade with the u.s. That's the only reason we are as rich as we are, is because the world is our customer. When they are not, we go broke.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Alive_and_d_d_dot",
                                    "body": "You understand what trade deficits are yes? Which way do you think trade deficits go with Canada and Mexico?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Rocketgirl8097",
                                            "body": "The fact we buy more from them than they buy from us? So what? Things like natural resources aren't available everywhere either due to planetary construction or weather patterns. For example, other than a small amount in Hawaii, the U.S. cannot grow coffee beans.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Alive_and_d_d_dot",
                                                    "body": "Neither can Canada. And mexico isn't known for coffee. Just about everything that either of these 2  provide we can produce. Except for Mexican cheap labor. But frankly, that's not a commodity I want.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Rocketgirl8097",
                                                            "body": "We can't because we don't have the labor and corporate America will not pay a living wage nor follow regulations. Keep dreaming though.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Alive_and_d_d_dot",
                                                                    "body": "Bs. Corporations want to make money. We dont have the labor because they can out source. Cheap slave labor more than offsets cost of import.  If you tariff imports, it becomes negligible. If you remove excessive tax burden, it becomes advantageous. You do understand it's not just the wage corporations pay right. They have payroll tax. They have healthcare costs. They have unemployment insurance. And They have corporate tax. On top of that our wages are taxed. As for following regulations? They absolutely love regulations. Regulations rig the market.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Foolgazi",
                            "body": "You think “permits and school fees” are the reason the US isn’t cost-competitive on timber?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Alive_and_d_d_dot",
                                    "body": "No. These are separate issues. Both feed into housing cost. We are not competitive in lumber because our industry has been deliberately shut down. We used to be the best loggers in the world. We invented the yarder.  School fees and permitting fees are astronomical. They can exceed the cost of timber.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "serpentjaguar",
                            "body": "This is a pleasant fiction.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "breakingb0b",
            "body": "Because crashing everything makes it a fire sale for billionaires. They buy up everything cheap and consolidate power. \n\nThis is the end game. Welcome to the shit show.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Latter-Leg4035",
            "body": "I think it is an economic war on our friendly neighbors for the same reason Russia invaded its neighbors.  For subjugation and to extend its borders.",
            "score": 33,
            "replies": [
                {
                    "author": "wigglex5plusyeah",
                    "body": "I don't think that's the point...but I also don't think it's not the point. I think straight corruption and insider trading type stuff is the primary point but changing the gulf of Mexico...yeah, that doesn't do anything other than change the map for the purpose of \"see, I did that\"...buying Greenland...we can't pretend you're wrong about his desires.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Tronn3000",
                            "body": "Changing the name of the Gulf of Mexico is just throwing a bone to the base to distract them and keep them happy. It's no different than yelling \"squirrel!\" for a dog.\n\nBuying Greenland is the 2025 version of building a wall that Mexico will pay for. Just a crazy idea that's unlikely to happen unless he wants to start a war, which could happen",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BuckFushFobama",
                    "body": "Wrong about Russia. Go read a book.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "bigmac22077",
                            "body": "You don’t think it’s slightly odd Russia initially attacked ukraine exactly where a top 10 oil supply was discovered a year prior? And you don’t think it’s slightly odd the territory they want to take from Ukraine in peace deals has about 80% of all that oil?\n\nThe war is completely over economic resources bud.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Hatedpriest",
                            "body": "https://en.m.wikipedia.org/wiki/Foundations_of_Geopolitics\n\nThere's a book for you to read.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Latter-Leg4035",
                            "body": "You read the wrong book, comrade.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tun-Tavern-1775",
            "body": "He admitted today prices will go up. Did anyone outside his cult believe otherwise?",
            "score": 12,
            "replies": []
        },
        {
            "author": "Striking_Economy5049",
            "body": "Easy, they won’t. These are designed to make Trump and co rich and screw you the American over.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Ordinary_Garage2833",
            "body": "Mexico and Canada account for 70% of U.S. crude oil imports…looking at between .40-.70 cents increase at the pump (days). I can see upwards of $1 if not resolved by spring, or for any other geopolitical issue.\n\nAvocados/Tomatoes - a day if not instant\n\nCars - days if not instant\n\nCar Parts - days if not instant\n\nhttps://www.eia.gov/energyexplained/oil-and-petroleum-products/imports-and-exports.php",
            "score": 10,
            "replies": []
        },
        {
            "author": "AutomaticMonk",
            "body": "The rough theory is that if it's too expensive to import things, we'll go back to making them here.  Unfortunately, we severely cut back on manufacturing and production in the U.S because it was getting expensive and it was significantly cheaper to have other countries manufacture and ship to us.  The quality might not be as good, but it's cheaper and more convenient.\n\nFor example, my wife used to do bookkeeping for a third party auto parts quality company.  One of the big auto makers would order a component, say a steering wheel, from a contractor in Mexico. When the shipment of steering wheels arrived, oh no, they used the wrong relay in the horn. So the company my wife worked for would hire a dozen temp employees to follow a three or four step procedure to remove this relay, replace with that relay, add a screw here, done.\n\nAnd to order the product, deal with importing and shipping and hiring a third party company to repair issues...was still cheaper than just having a union shop make it in the first place.",
            "score": 22,
            "replies": [
                {
                    "author": "accioqueso",
                    "body": "What many fail to realize is that the infrastructure does not exist in the US to quickly replace the manufacturing and food that we import now. It would take years to replace it, and we would, in the meantime, have to import the goods and materials just to get it back up and running. Even if we get the infrastructure back up and running we’re currently deporting our cheapest source of labor, so we would either have to pay more for the labor, or the plan is to use slave labor. \n\nThere are some who are convinced that the tariffs won’t last, and even if they don’t, the prices will not come back down once they go up. History has shown that we cannot trust the ones doing the selling to reduce prices when expenses go down because profit is too important.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Almaegen",
                    "body": "But its not just about price, it is about forcing reshoring because Covid showed us that supply chains outside of the US are a major security risk. The war in Ukraine showed the west that their lack of manufacturing is a security risk and the actions of China, Russia and Iran have shown the west that the peace is still a fragile one.\n\n\nMaking economic arguments is somewhat pointless because they are secondary.  Trump may be louder and more aggressive but this is a goal that was also pushed by the biden admin.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutomaticMonk",
                            "body": "Absolutely. We (U.S.) as a society have shifted away from manufacturing and production in favor of consumption and capitalism.  That's what Biden was working on with things like the Chips Act.\n\nIn my opinion, our society will have to grow the hell up and take responsibility for our own lives.  We need to put ourselves on a diet from the quick and cheap manufacturers overseas.  But our entire economy is based on profit margins on product that is still on a cargo ship coming from who knows where.  Stop that ship and our economy crashes before we can restart manufacturing.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gutmach1960",
            "body": "Read what happened when Herbert Hoover tried protectionist policy after the Market Crash.",
            "score": 15,
            "replies": [
                {
                    "author": "bigmac22077",
                    "body": "[the smoot-hawley act.](https://en.m.wikipedia.org/wiki/Smoot%E2%80%93Hawley_Tariff_Act) just learned about it last night. Why didn’t they teach us these things in school?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Conscious_Raisin_436",
                            "body": "Pretty sure I was actually taught that one, i was just like 15 and found it horribly boring.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "reelznfeelz",
                                    "body": "lol same.  I think they taught it in 9th grade.  This would be 1995 or so.  But I was too young to appreciate pretty much anything historical.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Ssshizzzzziit",
                            "body": "To be fair, the amazingly entertaining Ben Stein tried to teach it to you in Ferris Bueller's day off.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "forjeeves",
                            "body": "They did in high school ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ssshizzzzziit",
                    "body": "Yup. Read what Canada did in retaliation, how Smoot and Hawley both lost their seats and how the Democrats ushered in the New Deal.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Citizen_Miike",
            "body": "This hurts our economy more than it hurts Mexico and Canada. It strengthens the US dollar vis a vis Mexican Peso and CN$, which negates the impact of the tariff for Mexico and Canada.  We, US consumers, pay higher prices (a tariff is a form of sales tax).  The stronger US dollar hurts our export economy, making our products and services more expensive for other countries to buy.",
            "score": 14,
            "replies": [
                {
                    "author": "mr_cristy",
                    "body": "I'm don't really understand currency exchange. How do the tariffs strengthen the dollar?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Citizen_Miike",
                            "body": "I think it has to do with currency supply and demand.  A higher tariff means less demand for the foreign country's product, which means less demand for that country's foreign currency, which leads to devaluation relative to the home country's currency.   \"In all cases, the exchange rate moves in a direction that tends to offset the impact of the tariff: a tariff on imports appreciates the home currency and a tariff on exports depreciates it. Under our baseline calibration the exchange-rate offset tends to be larger for a tariff on exports than for a tariff on imports and to be larger under DCP than PCP.\"",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Adonwen",
                            "body": "Maybe some form of decreased flow of US currency out of the country that limits USD over supply overseas",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Citizen_Miike",
                    "body": "[https://www.sciencedirect.com/science/article/pii/S0261560624000020](https://www.sciencedirect.com/science/article/pii/S0261560624000020)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KrankyKoot",
            "body": "Its stated purpose is to bring manufacturing back but it is not even remotely possible.  Rebuilding will take years and the cost of the rebuild will get rolled into the product cost along with the 10x costs to make things here.  He knows that but its all part of the grift.  The countries will cave like Columbia did or like Zuckerberg did and pay him off one way or another.  He can then claim that he is the king of the world.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Darth_Gustav",
            "body": "In the short run, domestic producers can't immediately satisfy domestic consumer demand for the imported good, so the overall supply of the good will be in shortage relative to the quantity demanded by the consumer. Thus the price of the import heavy good will increase in the US. (The US domestic made good is already at a high price otherwise they wouldn't need the tariff). Canada and Mexico will retaliate by increasing US made goods that are imported into their countries, hence their consumers will demand less US made goods. With less foreign demand for US made goods, these US manufacturers will then have to increase prices in the US in order to offset the lost foreign revenue + or they will have to cut labor costs. Tariffs are lose lose. Trade is good because it can increase growth by each other's country gaining resources that they are weak on.",
            "score": 7,
            "replies": []
        },
        {
            "author": "JakobieJones",
            "body": "It won’t. The whole point is to crash the economy so billionaires can buy everything for Pennies on the dollar and implement a neo feudalist system where there’s only a lower and upper class",
            "score": 9,
            "replies": []
        },
        {
            "author": "ptwonline",
            "body": "Short term: it will do damage.\n\nMedium term: it will do a LOT of damage.\n\nLong-term: jobs and industry will be brought back to the US...as long as millions of foreigners are also allowed in to do those jobs since the US won't have anything close to enough workers.  And no AI is not going to make up the shortfall of workers any time soon.  The US could end up poorer overall (lower standard of living) because producing things in America will be more expensive than buying from overseas and anything imported will be more expensive than now, and foreign markets will be less accessible for American exports.\n\nIt's a lose-lose strategy which is why they normally only get used in very limited ways now.  Ironically Trump is doing it because he wants something he thinks he can \"win\" since he's obsessed with winning.",
            "score": 8,
            "replies": [
                {
                    "author": "cknight13",
                    "body": "It could actually be worse than that. If they bring the manufacturing home and its all automated. There will never be jobs on top of them being more expensive.. Think 30% unemployment being the norm.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "scottfreesp",
                            "body": "automations coming regardless you can either have the factories overseas or here take your pic",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Seaworthiness-542",
            "body": "My question is how did he go from something like a 60% tariff for China during the campaign to 10% now and 25% for Canada and Mexico?",
            "score": 3,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "Your first mistake was assuming he has any strategy other than what randomly pops into his head when he gets out of bed every morning,",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dtlacomixking",
            "body": "Lol it won't.  It's gonna stop construction (lumber mostly comes from Canada) and no one will be around to build due to deportation. They are purposely trying to destroy the economy bc then the rich then buy up everything",
            "score": 5,
            "replies": [
                {
                    "author": "evey_17",
                    "body": "Yup good luck with new construction. Good luck with food prices. Good luck with cars. If you thought post COVID inflation was bad. Beef will go up. People will eat possum soup. Lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dtlacomixking",
                            "body": "Yah they are purposely trying to crash the economy at this point. No economic person in their right mind would advise this unless he goal is to destroy the economy and purposely cause a recession. Why you ask? Who runs the govt now? Billionaires. And who gains the most when people have to sell their houses, when foreclosures happen, when stocks crash?  Billionaires. They will privatize the TSA, education, everything is for sale to the billionaire tech guys. That's why all of them donated and sat front row at the inauguration.  It's all for sale",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gr8daze",
            "body": "They aren’t. Trump lied. Get used to it. It’s going to be the daily routine for the next 4 years.",
            "score": 6,
            "replies": []
        },
        {
            "author": "pomod",
            "body": "The sooner Americans become un-enamoured with him the better. He’ll fuck up the economy so bad that people be ready to lynch him in a year and a half.",
            "score": 5,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "I’d like to think voters would treat Trump the same as they treated Biden when they’re unsatisfied with the economy, but the likely scenario is the people who voted for Trump will become even more devoted to him since “he’s the only one willing to make the hard choices.”",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SmoothWD40",
                            "body": "The capture of the main stream media has made any consequences an impossibility.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "MSM but more meaningfully all of social media",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Metal_Icarus",
            "body": "I just got back from mexico. I work for an hvac comoany that has multiple factories down there. Trump is threatening to force the company to increase prices, reduce our competitvness and thus possibly reducing my pay in the future.\n\nFuckin a trump. Stop it.",
            "score": 6,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "If it’s any consolation, these tariffs are going to screw all of us here in the US too",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "flossdaily",
            "body": "Convicted felon Donald Trump doesn't appear to understand what tariffs are. He exclusively talks about putting tariffs on other countries.  But tariffs don't go on other countries. Tariffs are paid by US companies that import foreign goods. \n\nHe's too stupid to even be allowed to talk about financial policy, and yet Republicans gave him absolute power.\n\nIt's a suicide cult, and they are bringing us with them.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EatBrayLove",
            "body": "I'm watching this happen from New Zealand and I'm just shocked that Republicans in congress and their largely wealthy backers aren't trying to put a stop to the madness.\n\nSurely everyone loses if Trump goes ahead with these tarriffs and pisses off America's most important trading partners? \n\nPutin and Xi Jinping must be having a good laugh right now watching Trump dismantle the American economy and its alliances from within...",
            "score": 3,
            "replies": [
                {
                    "author": "scottfreesp",
                    "body": "you guys really are obsessed with us huh",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nina4774",
            "body": "To understand Trump, think of what actions will bring down the US as a world power. He’s a Putin stooge.",
            "score": 4,
            "replies": []
        },
        {
            "author": "onikaizoku11",
            "body": "They aren't. Trump knows this, too, on some level. He gave the game away when he incorrectly declared Spain as a BRICS nation. \n\nA multi-polar economic world order is coming. Trump's childlike obsession with 1800's trade practices is only strengthening the hands of BRICS, the EU, and the Community of Latin American and Caribbean States (CELAC).",
            "score": 2,
            "replies": []
        },
        {
            "author": "therealmikeBrady",
            "body": "They won’t. They will be a tax from the consumers of both countries to the American government for more Military spending to create a hostile foreign relations between America and other countries so that everyone is afraid. so we will need to trust a dictators snap decisions instead of the well thought out democratic bureaucracy’s positions best for the country.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MCShoveled",
            "body": "You’re describing a classic theory of social and political manipulation—sometimes referred to as the problem-reaction-solution model (or the Hegelian dialectic in a broader philosophical sense). The idea is that chaos, whether real or manufactured, creates widespread distress, which in turn makes people desperate for stability. This desperation can then be leveraged to introduce drastic changes that might not have been accepted under normal circumstances.\n\nHistorically, this kind of pattern has been used to justify major political shifts, economic overhauls, and even war. When people feel overwhelmed by instability, they become more willing to accept extreme solutions, even those that might otherwise seem unreasonable or authoritarian.\n\nSome possible intended outcomes of the chaos we’re seeing could be:\n\t\n1.\tGreater Centralization of Power – Governments or corporations might use crises to justify increased surveillance, control, or restriction of freedoms (e.g., digital IDs, social credit systems).\n\t\n2.\tEconomic Restructuring – Financial instability can lead to calls for a new global financial system, whether it’s central bank digital currencies (CBDCs) or wealth redistribution policies.\n\t\n3.\tCultural and Social Reengineering – Rapid shifts in societal norms can be implemented more easily when people feel unmoored from tradition or uncertain about the future.\n\t\n4.\tTechnocratic Rule – Crises might be used to justify placing more decision-making power into the hands of unelected experts, AI systems, or multinational institutions.\n\t\n5.\tWar and Military Expansion – Conflict can unify people under a common enemy, justify increased defense spending, or redirect attention away from internal problems.\n\nWho benefits from the chaos? If we follow the incentives, we might get a clearer picture of what the intended outcome could be.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TrackFickle6385",
            "body": "Who will they help? The fucking billionaires, Musk, Bezos, etc. They 100% will hurt the average peon that voted for the fucknut because “but but but the price of eggs” and “woke this, woke that” so have fun struggling to make ends meet. Gas prices will increase and then so will all goods, especially food imports from Mexico.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jrexthrilla",
            "body": "They aren’t. That’s not the purpose. The purpose is to help Russia. This helps Russia",
            "score": 2,
            "replies": []
        },
        {
            "author": "M_2greaterthanM_1",
            "body": "Much damage is being done to the Canada-US relationship. As a Canadian, I have never seen this level of anger toward our southern neighbors. Cultural decoupling is happening in real time. Very bad, in my opinion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PreparationVarious15",
            "body": "I’m ready to suffer if the suffering gonna be worse on MAGA folks. I m certain that it will be based on my personal situation/finance and demographics of his base.",
            "score": 6,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "But guess who will get the most generous benefits. “To reward my beautiful red states for sacrificing their jobs so we can win this trade war, every unemployed person in a red county will receive unemployment benefits until jobs come back.” Partially kidding here, but only partially",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "tonytony87",
            "body": "I feel like nobody really understands Trump better than me , even trump supporters don’t seem to understand him. So i gotta break it down for you all.\n\nHe wants to treat the US like a business, because that’s all he knows. he’s not versed in politics or economics and doesn’t understand the fact that profit isn’t the bottom line here.\n\nSo when he sees that the US buys more from\nother countries than they buy from us, he doesn’t understand that it’s because we produce more and make more money than canada or mexico, they are smaller economies so obviously they will buy less from us. \n\nIt’s a good thing that the US buys more from canada, because they supply fertilizer, which means the US agriculture industry is so big and powerful it needs to buy a lot of that from canada… That’s good it means we make a lot of things.\n\nBut Trump is to stupid to understand that, he sees the US bankrolling a lot of projects around the world because we make more money than others and are more powerful so we can afford to project that power and stay top dog.\n\nTrump is the type of billionaire to sit at a dinner with a room full of middle class people and ask everyone to split the bill evenly, he is a stingy rich dude who thinks like an old stingy rich dude. So when he sees these figures he instantly thinks “nahhhh the other guys should pay the same” \n\nEven if they make less and the dynamic between the countries is fine and nuanced.\n\nHe is taking a sledgehammer to these intricate relationship we have built on the backs of very bright and smart people, because he doesn’t understand the nuance behind them.\n\nTrump is a very very dumb, egotistical moron with a very high confidence. That’s how he operates, he isn’t playing 4D chess, he’s tricking you into thinking he is good at his job… which AGAIN! is all part of his snake oil salesman personality! \n\nWe all need to understand this or else we are gonna be very very confused and angry the next four years",
            "score": 5,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "Seens to me just about everyone in this thread understands all that perfectly.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "mikemangodtheepicgod",
                            "body": "They  are really part of his hivemind.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdhesivenessCivil581",
            "body": "There not. They might crash the stock market and cause a recession. We are due for that anyway.",
            "score": 4,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "I think Covid pulled ahead the recession we were about to enter into. The stimulus that ensued kicked that can down the road to the next crisis, which wasn’t on the radar yet until Trump decided to introduce a bunch of unforced errors.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AdhesivenessCivil581",
                            "body": "When was the last time we had a natural business cycle recession? There was the internet bubble popping, 9/11 , the bank crash and then covid so 2000, '01 '07 '20.  They were all crisis that exposed and wiped out any leveraged trades. Or is that always how recessions start? I started investing in 2000 when the internet bubble popped, that was 100% about leverage when the real floats of those companies showed up.  The others just exposed the leverage that was in play. When the market crashed in '29 It was because people had been buying stocks, in a frenzy, with 10% down. Same reason the housing bubble popped.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "Absolutely right about external factors causing the recessions since the late ‘90s. I would say a cooldown was becoming evident in 2019, which, if worsened, could have developed into a “natural” recession, but Covid overrode all that.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlamutJones",
            "body": "They’re not. He just wants to use the proverbial big stick, because that’s a power “the President of the United States“ gets to have and he wants to prove - really prove - that he has it",
            "score": 2,
            "replies": []
        },
        {
            "author": "IrishMilo",
            "body": "Tariffs are designed to make imported goods the same price, or more expensive than imported goods, in the short term it means things can get expensive, in the longer term, if industry’s are determined that the tariffs will stay, then companies will look at manufacturing in the US, which brings jobs and investment into the country. \n\nYou as the consumer will not benefit from this directly, it will cost you more, but it may also lead to jobs and industry for many others, which benefits the country.",
            "score": 2,
            "replies": []
        },
        {
            "author": "questingbear2000",
            "body": " MOst of the responses here are only speaking about short term results.  The goal of the Trump administration is a long term attack on the very concept of globalization.  They dont WANT car parts to move eight times back and forth across the border.  They dont WANT imports of locallyproducable materials.  The goal is for a short term pain to result in long term local industrialization and US based manufacturing to return.  \n\nTheyre not wrong though, short term it IS going to hurt.  Prices for nearly everything will go up, but they believe it will force better jobs to be created locally again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mind-of-Jaxon",
            "body": "That’s the joke. It doesn’t help anyone except Trump and his cronies and business pals. They all make money.  We, the American people will be paying for the tariffs . The cost of everything will go up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HiSno",
            "body": "Isn’t this the same playbook from his first presidency? Although magnitudes more extreme… use tariffs to help finance tax cuts for the rich.\n\nI’m guessing in a few months he’s gonna attempt to pass tax legislation like he did before. Maybe at an extreme, he’ll push to abolish income tax, and perhaps he’s hoping by that time people will be more used to the effects of tariffs and will attempt to enact a flat tariff on all imports",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeakedAtConception",
            "body": "Trump is mad the people didn't vote him in in 2020 and knows he's got one foot in the grave so he's trying to ruin everyone's life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikeber55",
            "body": "They are not helping US consumers. Trump didn’t claim that. He just imposed them because he can and it seems fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FredUpWithIt",
            "body": ">How are Tariffs on Mexico and Canada going to help the US consumer and economy?\n\nThey're not going to. \n\nIt's all about power and control.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nonnomun",
            "body": "Where does the money go from the tariff? If we the consumers are paying at the register the price of said item plus the tariff amount. What happens to the money? It’s a sales tax increase at the point of sale. We need to know more about that point. What’s the plan for all that dough coming in is a question I have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stewartm0205",
            "body": "The tariffs will severely damage the economy. The first blow will be to the stock market as already seen. The next second blow will be to our pocketbooks. The third blow will be to our jobs. The second and third blows will take a few months to manifest themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "foglandia123",
            "body": "The will not help anyone.  Tariffs are bad, bad and well, bad.  Trump is not bright (incredibly stupid)  and has no understanding of the consequences of imposing tariffs.  Foreign companies will raise prices to cover the tariffs and these costs will be passed on to the American consumer.  Canada, Mexico and China will also impose tariffs on our exports.  So prices will go up and sales will go down.  Oh and inflation will go up.  Also, everyone will hate us. There is no upside to tariffs. Well, trashing our economy will lead to lots of Trump Admin infighting and hopefully Dems can flip the House back in 2026.",
            "score": 1,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "Domestic companies that import goods are the ones responsible for the tariffs, not foreign companies. But yes a good portion of that expense will be passed on to the consumer.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "foglandia123",
                            "body": "Technically, but it's the same result.  Prices on imported goods go up and eventually sales go down. A drop in sales of foreign made goods can also hurt US industries that sell to foreign manufacturers.  For example, Mexican beer prices go up, US beer sales fall and US farmers that sell barley to Mexico to make this bear also see sales fall.  There is no upside to this policy except in a few cases where building up a US industry is crucial for US security.   And of course as I said previously, Tariffed countries will simply impose tariffs on US goods with the same result.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "boredtxan",
            "body": "Remember Trump doesn't need anyone to vote for him again. He needs money and adoration  - just a few wealthy people giving him both will make him happy.  He has no reason whatsoever to consider doing good for the rest of us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExplanationFuture422",
            "body": "He's my President and Savior, I'm sure he knows more than all the experts about how World trade works and how tariffs work.  The thing about Countries he attacks with tariffs, you grab them down low any they will let you do anything.  God Bless our Fucwad President. America goose stepping into the 21st Century.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MileyKatz",
            "body": "They won't help the US consumer at all. This is a distraction while he does more sinister things like firing whole departments of justice and clerks and FBI agents. He is on a path of retribution.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuaidCohagen",
            "body": "It won't help the economy or the consumer. It will help in the transfer of wealth as consumers will be the ones paying the tariffs which will all go towards tax revenue. Taxes will then be transferred to line the pockets of the rich elites.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rpeddie17",
            "body": "It won’t y’all gotta quit asking that question. Global\nTrade is necessary. Having allies too but the US, just pissed in one of the most best partnerships in the modern era. Canada was always boys with the US. This shit will have ramifications beyond tariffs. America can no longer be trusted",
            "score": 1,
            "replies": []
        },
        {
            "author": "countrysurprise",
            "body": "Tariffs are taxes and will hurt everyone but the wealthy. Especially if they replace federal income tax with tariffs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CorneliusCardew",
            "body": "The general idea is to ruin small business owners so the large corporations can pick their bones clean. Trump wants you as his slave. Remember this is the guy who beat, urinated on, and raped underage sex slaves. This is the type of person you are dealing with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JKlerk",
            "body": "They will help the protected industry but hurt everyone else downstream of that.  Trump can also claim he followed through with his campaign promise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Mobile_60",
            "body": "Deported the people that do farming here and pay 25% more vegetables from Mexico. How will that low inflation ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mar78217",
            "body": "By increasing the costs of everything we get from Canada and Mexico. Automobiles, food, lumber, oil.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ronm4c",
            "body": "A part of me think that it actually won’t happen, the tariffs are set to take effect on Tuesday, if the market shits the bed on Monday he’ll push it back",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jester62",
            "body": "I fail to see how this will increase revenue. A tariff at the end of the day is a tax on us the consumer. \n\nBuilding these industries infrastructure takes time and with leadership changing here on shortish time lines business may just choose to pass the tax on to us and are just stuck with a higher price indefinitely without any actual jobs created here. \n\nWould this also undermine national security as it alienates trade partners and are influence on the global stage. \n\nI just think none of this will help consumers or the country in the long run and may actually be detrimental to the effort.",
            "score": 1,
            "replies": [
                {
                    "author": "Historical_Hyena1937",
                    "body": "Exactly right, OP. You're making a ton of good points. will be terrible for the country in the long run. \n\nIt will increase revenue to the federal government, though, because tariffs are taxes that go straight to the government. That money can then be used to offset tax cuts to the ultra rich, or it can just be outright embezzled. Either way, Trump's only goal seems to be to milk as much money out of the system for himself and his buddies as he can, in any way he can, and screw the consequences for anyone else.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bkinboulder",
            "body": "We always have history to check previous results of such things. Like the Hawley-Smoot Tariff Act.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jbowl1966",
            "body": "My question: are we the American people going to allow ourselves to be steamrolled or are we going to stand up?  And HOW do we stand up?",
            "score": 1,
            "replies": [
                {
                    "author": "Rook_lol",
                    "body": "People should have voted differently in November.\n\n  \nHe said he was going to do this.\n\nPeople knew what he was about and how dangerous he is.\n\nBut people didn't show up to vote for Kamala.\n\nThey did for the 34 time felon who was impeached twice already and told you exactly what he'd do.\n\n  \n*Now* people are wondering what they can do.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "swingsetlife",
                    "body": "that second question is the essential one",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "thegarymarshall",
            "body": "The best tariffs never generate a dime in revenue. They are designed to modify behavior that is detrimental to the American economy. \n\nA great example is the tariffs imposed on Japanese automakers in the 60s (or was it 70s?). They could build cars in Asia using cheap labor with fewer regulations protecting workers and with government subsidies. This allowed them to undercut American manufacturers. The Japanese companies decided that it was more economical to build car factories in North America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Fault7763",
            "body": "I think some, like on the automotive side, will shift some amount production back to the USA, and that is not a bad thing.",
            "score": 1,
            "replies": [
                {
                    "author": "Jester62",
                    "body": "It just means more expensive cars for us as consumers. Building facilities that can produce at the scale we demand takes years and millions of dollars. \n\nI think most companies will just raise the price to cover the tax and no job creation happens and we are just stuck with a higher bill.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jocas023",
            "body": "So many lobbying groups are going to push him and the cronies to end them in a week or so and he’ll claim victory over nothing like always and meanwhile consumer corporations will keep prices high",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clivecustance",
            "body": "My guess is this is Trump's way of collecting more tax dollars and blaming it all on Canada and Mexico. He wants more tax dollars to satisfy his tax breaks for his rich buddies and corporations, and he collects those dollars by claiming to be protecting America. As an Australian watching this from afar I just have to ask how the hell did your lot vote this guy in???",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Picture_6410",
            "body": "They're not. \n\nThis is by design. The new regime hates poor people. They will say it's to bring back manufacturing, which sounds awesome, but the USA doesn't have the resources, raw materials, factories, or manufacturing workforce. \nIf by some miracle we are able to pop up with factories, it's going to be sweat shop labor wages. Which is evidenced by Union Busting. We will still have to import raw materials, which will cut into corporate profits, which will immediately be remedied by cutting labor costs. \n\nThis is the new gilded age. The only way to bring the country back to prosperity is by general strikes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LearnToBeTogether",
            "body": "It will make running a business the USA and working there much more desirable. This will increase the overall productivity. See [Peter St Onge Substack](https://open.substack.com/pub/profstonge/p/trump-doubles-down-to-repeal-income)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delicious-Share100",
            "body": "He f’cking disgusts me, I can’t even speak my mind about him that’s the sad thing.\nI just shake my head, shake my head, shake my head, oh shit where’s my migraine medicine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natural-Platypus9542",
            "body": "The United States is heading toward regional isolationism in the long term. Russia and, far more importantly, China population will collapse in the next 20 years, and their manufacturing capacity will also deminish greatly. Regardless of what the right says, the tariffs are terrible short term, but are advantageous long term in the sense that they promote manufacturing within the US borders. The problem is that manufacturing facilities do not pop up overnight and the time it takes to build those plants hurt the most for the average consumer.",
            "score": 1,
            "replies": [
                {
                    "author": "Historical_Hyena1937",
                    "body": "Some jobs might certainly be created, but you're mistaken if you think prices will drop once domestic products are available. \n\nThere's historical precedent: the tariff Trump imposed on Chinese washing machines in his first term did lead to some job creation, but at a massive cost to the economy (over $800k per job). Also, prices didn't fall for consumers even after more US manufactured machines came available, because why would the prices fall? If the US companies can sell their products just slightly cheaper than the foreign imports and make more profit, of course they would do that. And that was just on ONE product. It'll take way longer to bounce back on EVERY import from your three biggest trading partners. You're about to see massive inflation, as well as America's bargaining power diminished globally. And to think you elected the guy to bring prices down, even though he was talking tariffs before the election. It boggles my mind.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "D4UOntario",
            "body": "Decrease the size of government, add tarriffs to fill his coffers then steal it all with contracts to republican shell companies for services formerly done by fed employees.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Onionbot3000",
            "body": "The tariffs are designed to pay for the tax break he’ll be giving the rich. Once again, Trump doesn’t care about the average American, he is ruling to help the rich gain control of the US.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xocanarchy",
            "body": "A Tariff war is unfolding. In such a war there are NO winners. You the conusmer in the end is the biggest loser you can be sure. \n\nSo simple.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low_Stress_9180",
            "body": "Just look up the effect of 1922 and 1929-30 tariffs.... the latter helping to create the great Depression and WW2.  Tariffs are very bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spider-zombie42",
            "body": "Controversial take: the tariffs are good even though it means higher prices for us. \n\nMy reasoning: we as consumers are ultimately the ones in charge. We choose what to buy and spend our money on. The reason so many of these companies raise their prices so high is because we have no discipline and will buy no matter what. We HAVE to take responsibility in our part, continuing to give our money to companies with bad practices is the reason they are able to take advantage of us. This is our opportunity to change our habits. Buy the cheaper brands. Give to the companies who aren't out to screw us over (where we can, of course, I know there's not many of them). \n\nMaybe this is also the younger generation's opportunity to start some competing companies. If there's a market where you can produce a product and sell it for cheaper while still making a profit AND be cheaper than all of your competitors, now is your chance. Learn to not be as greedy as them.\n\nWe're all so reliant on others. The whole point of these tariffs is to turn that around. Unfortunately as a country and society we SUCK at that now. Why? Why do we rely on every one else to fix our problems? We as consumers have power too, you know. And it's about fucking time we start exercising that power. Seriously! Do a bit of research, find better brands and companies, talk to your neighbors, make friends, rely on each other's skills and abilities to make life work. We DO need to be better. We've allowed this to happen. We can't keep blaming the government. The government's actions are a direct response to our own choices. We need to start forming those connections again with each other within our communities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarolinaMtnBiker",
            "body": "It will help by making us pay more for goods and therefor suffer. Everyone knows suffering makes you stronger.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thegree2112",
            "body": "It will help domestic producers of goods but raise prices  for consumers.  They are generally a terrible idea and I really think he’s going to tank the whole u.s. economy.  Buckle up stock market opens tomorrow.  Black Monday anyone?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CryptographerIll5728",
            "body": "Mexico just folded. \n\nNEW: Mexican President Claudia Sheinbaum folds, says she agreed to send 10,000 troops to the U.S. border after a “good” call with President Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bright_Sir9279",
            "body": "They’re not going to happen - he’s just using it as leverage to get what he wants; Mexico and Canada to do the grunt work of border protection.\nHe’s a businessman, this is what they do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kenmele",
            "body": "The tariffs are not actually mention to go in effect.  They are meant to shake down Canada and Mexico to get what he wants.  It is clear from the Mexico side, have them prevent illegal immigration, and perhaps stop the cartels. If they cannot do that then turn a blind eye as we send special forces.\n\nWith Canada, I am not so sure.  Clearly, I dont see that he wants a 51st state per se.  Would it vote Republican?  And by offending them he has spurred Canadian nationalism, making things harder.  He is not stupid, that is the mistake the Democrats always make with him.  Consider him cunning. He wants something, and Canada will probably give it, they are too weak to refuse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "islas-purple-boots",
            "body": "I recently read [this post](https://pgts.ca/2025/01/01/are-trade-barriers-good-for-business-part-1-unintended-consequences-for-innovation/) and despite feeling uneasy about the increase in costs of goods from the USA, the article also makes it really clear how these types of tariffs will force more innovation in Canada, which I do think is a positive thing. It could also create new trade routes and relationships, decreasing our reliance on the US as a trade partner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LikelySoutherner",
            "body": "It was never about the Tariffs. It was about getting Canada and Mexico to do their part to secure our common border.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hypeman747",
            "body": "It’s def to renegotiate the usmca.  Not sure about Canada though.  Mexico def has to do with doing more to stem the flow of immigrants.\n\nWhen Mexico agrees to do more to stem the illegal immigrant flow and Trump drops the tariff.  MAGA will be vindicated.  \n\nBetter usmca deal and less illegal immigrants makes MAGA happy",
            "score": -3,
            "replies": [
                {
                    "author": "GrowFreeFood",
                    "body": "They just deleted all the data. We're never going to know if he is better because we won't have any new data.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Hypeman747",
                            "body": "Yep but Trump will say it’s better and the other news networks will say it is better so MAGA will believe",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GrowFreeFood",
                                    "body": "Absolutely. They're not intrested in facts anyways. Just looking for excuses to give themselves more power.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Hypeman747",
                                            "body": "That’s what makes the future so dangerous unless you feel it personally losing your job, inflation or more crime people are reading from two different Jumbotrons",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "GrowFreeFood",
                                                    "body": "I wish there were 2 jimbotrons. There's one corporate media. You gotta really dig a find actual data.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Hypeman747",
                                                            "body": "People to busy to do it unless you in college or retired.  You prob going to believe what you see, your  FB group tells you, your friends, or the algos that bombard you",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "GrowFreeFood",
                                                                    "body": "Yes. But it bugs me that you think digging for the truth is the same watching a jumbotron.\n\nThere's no jumbotron telling the truth. There's one, it lies constantly.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anti-torque",
                    "body": "Yes, because the dude who negotiated the USMCA and called it the most perfect trade deal in history was an idiot. Trump will fix it.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TaxLawKingGA",
            "body": "My personal opinion is that Trump wants to increase manufacturing jobs in the U.S. so that many people who are going to lose White Collar jobs due to AI and Outsourcing will have something to do. In addition, many White collar workers are colleges educated and we know that voting demo has moved toward Dems, while non-college educated voters have moved toward the GOP. As such, he can both hurt the first demo and conceivably help the latter at the same time. Personally economics teaches that won’t happen, but who knows.",
            "score": -8,
            "replies": [
                {
                    "author": "armed_aperture",
                    "body": "It blows my mind people think Trump is doing anything to actually help people. He’s certainly a brilliant manipulator.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Ashamed_Distance_144",
                    "body": "Is this a concept of a plan? I think you’re giving him too much credit. How much suffering can his base endure and stay loyal? \n\nHow many people voted for the GOP based on “the economy” and inflation? It seems like he’s sinking this ship as fast as he can, certainly before the midterms. Unless they rig the elections, there could be a blue wave in 2026. Maybe he’s just hoping to get as rich as possible then golf the last 2 years.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "TaxLawKingGA",
                            "body": "I think you pose the right question; it remains to be seen what the answer is. Also never underestimate the ability of the GOP to move the ball and distract their base with the newest boogie man.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adorable-Anxiety6912",
            "body": "Tariffs are not a form of Trump negotiating it’s just Trump being a Bully. Ironically Ms. 45 agenda was against bullying. Amazing!\n\nHalf of the country didn’t vote for him. Our elections should be based upon the popular vote. Moron brother voted for Trump and heard him last night complaining how his mandate nearly closed the school where his wife worked because abuse the school depended on government loans to meet their payroll. \n\nIt won’t take long before the poor folks and the blind wake up to what they empowered to the presidency, Trump’s failures that he continues to blame Biden for. Amazing he cannot take ownership for any failed policy. Come on blind people WAKE UP! \n\nI’ve not agreed with everything Biden has done. But i do respect and thank him for serving others for 50 years. Trump has no respect for the office. Trump is a man who puts down others to elevate himself. SAD",
            "score": 0,
            "replies": []
        },
        {
            "author": "Working_Dependent560",
            "body": "In the long term Trump’s tariffs will absolutely reshaped the U.S. economy in several ways.\n\n1. Boosting U.S. Manufacturing by encouraging companies to bring production back to the states.\n2. Strengthened National Security by reducing dependence on foreign supply chains.\n3. Lowered Trade Deficits by shifting reliance from imports to domestic products.\n4. Promotes Fair Trade by making countries compete. \n5. Increased Revenue. Tariff income will fund federal initiatives.\n6. Force Innovation to stay competitive.\n\nIn the short term, Trump’s tariffs will put everyday Americans in a far worse situation financially. \n\n1. Higher Prices for Consumers: think everyday products like electronics, cars, and groceries.\n\n2. Increased Costs for Businesses which will lead to job cuts, wage stagnation, and passing costs to consumers. \n\n3. Retaliation from Other Countries making U.S. exports more expensive hurting industries like agriculture and manufacturing.\n\n4. Disruptions in Supply Chains. Remember COVID? \n\n5. Market Uncertainty & Economic Slowdown. Investors and businesses hesitate to expand during tariff wars, leading to slower economic growth and more job losses.\n\nWhile tariffs aim to protect domestic industries, they often come at a short-term cost for both consumers and businesses.\n\nBottom line, we are all in for a wild ride on the Trump train",
            "score": 0,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "The national security part is arguable. A country with strong trading partners is a country less likely to enter into conflict. Remember this thread is about Canada and Mexico, not China.\n\nFair trade is also debatable, since countries are already competing. We’re “losing” because we have a high standard of living and as such can’t compete on wages.\n\nRevenue will increase, but decreased demand due to higher costs/tighter consumer budgets will temper that outcome.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Working_Dependent560",
                            "body": "Agree with your assessment",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Bandicoot_814",
            "body": "Well I really don't get putting the Tariff on oil. I think it's a horrendous idea. But put on manufacturing good that I understand. However the current plans seems to be weak in the US dollar therefore it becomes less expensive for a country to import are goods. Therefore balancing our Trade.",
            "score": -4,
            "replies": []
        },
        {
            "author": "Elim-the-tailor",
            "body": "I think part of it is also just revenue generation for the government. He wants to keep corporate and personal income taxes low, and tariffs are like an invisible selective consumption tax.",
            "score": -1,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "The funny part about that is American corporations are the ones who will pay the tariffs. So Trump just essentially greatly increased the corporate tax on American businesses.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SummerWorker96",
            "body": "They will promote market advance in location and be modifications to law and is enforcement \n\nNew tariffs will stimulate equality and fair prices.\n\nThe migration of people will not be based on criminal profits but advances in trading.",
            "score": -2,
            "replies": []
        },
        {
            "author": "flyinoveryou",
            "body": "It will persuade the border countries to take the illegal immigration situation seriously. Mexico and Canada economies rely much more on the US than the other way around. So, even if it does raise consumer prices slightly, it’s a negotiating tactic.",
            "score": -6,
            "replies": [
                {
                    "author": "GrowFreeFood",
                    "body": "There is no immigration issue. That's pure propaganda. But the rubes eat it up because it is code for racial cleansing. If you don't believe me, just post some actual data that supports the \"immigrant invasion\" and how it actuall negatively effects america. Then after all that, justify how crashing the economy logically solves that problem.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "flyinoveryou",
                            "body": "I love 2 hours from the southern border. There is certainly an issue.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "bigmac22077",
                                    "body": "Do you know how many asylum seekers we granted the right to go before a judge every year? 50,000. That’s it. Fifty thousand. We receive about 400,000 applications and out of all those about 20,000 are actually granted asylum. \n\nThe thing is, to claim asylum you need to be caught. So they do seek out BP and don’t try to just sneak into the country and live. The only immigration problem we have is all the judges trump fired in his first term creating back logs at every point. \n\nI live about 6 hours from the border.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "flyinoveryou",
                                            "body": "Why is Mexico not taking asylum seekers? Why do these countries let them waltz through knowing their final destination is the US?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "GrowFreeFood",
                                                    "body": "Is your entire world view just based on nonsense facts you made up?",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "bigmac22077",
                                                    "body": "They can and they do. \n\nRead this \n\nhttps://immigrationforum.org/article/mexicos-asylum-system-good-in-theory-insufficient-in-practice/",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "flyinoveryou",
                                                            "body": "So the US is getting the ones rejected from Mexican approval?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "bigmac22077",
                                                                    "body": "Or they’re not applying or they don’t qualify to apply.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GrowFreeFood",
                                    "body": "I also 2 hours from the border and I have never seen an immigrant in my life. Personal experience is not a good way to judge a national issue.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Foolgazi",
                    "body": "Except Trump said the tariffs are about the trade deficit, and there’s nothing Canada or Mexico can do about them. It’s no longer about immigration or fentanyl.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Historical_Hyena1937",
                    "body": "If it was just a negotiating tactic for border security, there would have been no need to implement the tariffs on Canada, at least, after they indicated willingness to work with the US on their concerns. They're spending $1.3 billion on new border security measures, which were created after the possibility of tariffs was first mentioned. Trump won't even take the Prime Minister's calls right now. He doesn't care about border security on the Canadian side. That, and the Canada-US border accounts for less than 1% of fentanyl traffic and illegal immigration, so I doubt he was actually that concerned to begin with. It's nothing but an excuse.\n\nMy guess is that Trump fundamentally doesn't understand what a trade deficit is, nor does he understand what a tariff is and what it does. Nor, from the sounds of it, do you. \"Raise consumer prices slightly\"? I hope you have the decency to think back on this statement in a few months and feel some shame. Or better yet, go watch some informational videos on tariffs two months ago, and then vote for somebody else.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "flyinoveryou",
                            "body": "Has Canada been imposing tariffs on US goods prior to all of this?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Historical_Hyena1937",
                                    "body": "Um, no. We've been trading under the agreements of whatever Trump renamed NAFTA. Why on earth would Canada want to alienate the US?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "flyinoveryou",
                                            "body": "https://wits.worldbank.org/tariff/trains/en/country/CAN/partner/USA/product/all",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Historical_Hyena1937",
                                                    "body": "https://wits.worldbank.org/tariff/trains/en/country/USA/partner/CAN/product/all\n\nMy guess is this is all part of NAFTA. Trade agreements usually involve some small taxes. I wouldn't have thought these things are called tariffs, but I guess they are. If they're mutually agreed upon measures as part of a trade agreement, though, that's miles away from what's happening now.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Inner_Attorney3623",
            "body": "America is sick and tired of funding Canada’s socialism    We Can’t even defend our north.  Our Soldiers having to buy their own equipment",
            "score": -11,
            "replies": [
                {
                    "author": "GrowFreeFood",
                    "body": "We trade with them, they can use their money however they want. Crashing the US economy will just illustrate how much better socialism is because out capitalism will turn usa in hellscape.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "anti-torque",
                    "body": "Canada has socialism?\n\nDo Tim Horton's employees own Tim Horton's?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Historical_Hyena1937",
                    "body": "1. You're not funding us, you're buying our stuff and paying us for it. The majority of that money goes to businesses, not to the government.\n\n2. We are certainly politically left compared to you, but still very much capitalists.\n\n3. If you aren't funding your army properly, you can change that in ways that don't involve alienating your closest allies and/or biggest trading partners.\n\n4. If you think you're too poor now, wait until the effects of the tariffs hit. Have fun.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}