{
    "title": "If a U.S. president attempted to dismantle democracy or impose authoritarian rule, how would the military likely respond? Would they prioritize their oath to the Constitution or follow orders from leadership?",
    "author": "Little_Study_57",
    "subreddit": "PoliticalDiscussion",
    "rank": 43,
    "score": 473,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 383,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1iffiab/if_a_us_president_attempted_to_dismantle/",
    "id": "1iffiab",
    "selftext": "In such a situation, to what extent could we expect the military to act based on independent judgment rather than strictly following orders? Would their response prioritize the well-being of American citizens, or would self-preservation take precedence?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "_mattyjoe",
            "body": "I had engaged with people in discussions about this in the time after Trump was elected and before inauguration. Many of them are convinced that service members / officers would remember their oath to the Constitution and not obey unlawful orders.\n\nI’m not so sure about that, and the more this administration is taking shape, the more doubtful I am.\n\nThe propaganda and the brainwashing by the right is unfortunately so deeply ingrained, I’m pretty sure they’d carry out quite a lot of orders against the American people while believing it’s in the name of “National Security.”\n\nThey will be lied to any which way to manipulate them into doing this, and they’re going to comply.",
            "score": 547,
            "replies": [
                {
                    "author": "Catch_022",
                    "body": "The issue is that the Trumps are well aware of this and are going to replace people in leadership positions with yes men (they have already started).\n\nIf the President orders something, the sec def agrees, your general agrees, your colonel, your captain, etc all agree then most peoplr are going to do it, even if you feel that, maybe, it isn't right.\n\nRemember they won't say \"kill all the Dems\", it will be at the end of a long line of escalations, provocations and propaganda. Even then it will be \"need to put all the terrorists in one place away from real Americans\", and if they resist shoot them, etc.",
                    "score": 221,
                    "replies": [
                        {
                            "author": "GrumblyData3684",
                            "body": "Look at what Louisiania tried to do, making it an arrestable offense to come withing 25' of a police officer in the line of duty.\n\nYou have to remember the ideas as they come out of Trumps mouth are as detailed as they are ever going to be, from there - they are further twisted and perveted by the MAGA lackeys. \n\nThe movie Conspiracy about the meeting to finalize Nazi rules about jewish heritage goes into how the devil is literally in the details.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "schistkicker",
                                    "body": "Heck, Tennessee just made it illegal to defy Trump's deportation agenda. It's happening.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "felixgolden",
                                    "body": "Florida's Halo law went into effect January 1st. Get arrested if you are within 25' of a first responder.and have been warned. Applies on public and private property.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ewokninja123",
                            "body": "Not sure they'll get all the way down to colonel, but the effect is the same. DIsobey and get court martialled",
                            "score": 32,
                            "replies": []
                        },
                        {
                            "author": "bigred9310",
                            "body": "Don’t underestimate the U.S. Military.  Especially the enlisted ranks which outnumber the Officers Ranks.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "KoldPurchase",
                                    "body": "Look at the civil service.\n\nAnyone not loyal to Trump is set aside before an illegal order can happen.\n\nIt'll be the same with the military.\n\nHe's following Russia's playbook.",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "KoldPurchase",
                                                    "body": "What is the present purge at the FBI and DOJ?  \nDo you think the miliary is somehow special that it will be exempt?  \nEveryone that criticized Trump is being purged.  Everyone who can not show 100% loyalty toward Trump is being purged.  \nAir controllers are being sacked after a major air disaster occured.\n\n  \nAgain I ask: do you think the military is so special that it will be exempt?",
                                                    "score": 22,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Catch_022",
                                                    "body": "A week or so in and he has already purged all trans people from the military.",
                                                    "score": 18,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "harrybrowncox69",
                                                    "body": "fantasy for you perhaps, he was talking about firing woke officers",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Alive_Shoulder3573",
                                                            "body": "Presidents have fired a lot of officers in the past for not following their directives or acting in ways that are against incoming presidents directives",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "KoldPurchase",
                                                                    "body": "Please, remind me when Obama and Biden removed the security clearance and secret service detail of people facing active threats after they criticized them?  \nDid GW Bush do it?  GH Bush?  Reagan? Carter?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Alive_Shoulder3573",
                                                                            "body": "Hie many times did Biden send armed stormtroopers to arrest conservative troop followers without notice,  while only asking liberal suspects lawyers?\n\nLook up how Carter Page, was arrested,  sending armed agents at 5/6am holding his family at gunpoint.\n\nAnd you cannot compare Obama or Biden, because there were no conservative agents that came out and signed fake statements, trying to take down a president, as these agents did, v taking money from dems and networks (Biden laptop)\n\nWhen people with security clearances use their positions to lie about political adversaries, they deserve to lose their clearances.\n\nAnd speaking of obama/Biden, can you name anyone that lied or broke the law and were held responsible and were fired from their jobs? You can't because libs never hold their own to consequences to their actions.  Hell, the trans guy that was caught stealing luggage multiple times didn't even get suspended or fired for his actions till after his being charged and convicted",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KoldPurchase",
                                                                                    "body": "Remind me please what did he do to warrant an arrest?  He said Biden was a tyrant?\nAh, I don't.think so:\nhttps://en.m.wikipedia.org/wiki/Carter_Page\n\nDue process was a thing in the US until Trump.\n\nNice try, Russian troll.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Alive_Shoulder3573",
                                                                                            "body": "Biden was the only president to use gestapo tactics against his political opponents, like Russians have done for over a hundred years.\n\nDems are always accusing others of being Russian or fascists, when libs are the ones that act like fascists and tyrants.\n\nCalling others what your side does doesn't work anymore, Americans understand your tactics now, which is why Trump won by a landslide",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "KoldPurchase",
                                                                                                    "body": ">Biden was the only president to use gestapo tactics against his political opponents, like Russians have done for over a hundred years.\n\nGestapo tactics, nothing less.\n\nSo Lauren *Handjob* Boebert is being tortured in jail?\n\nMitch *I suck Vlad's cock* McConnell has had a window accident?\n\nTrump's body has been found at the bottom of the Pottomac?\n\n  \nOnly Russian trolls can be so moronic.\n\nCriminals are investigated and arrested, then sent to trial.  This is how it should work in a true democratic state.  I understand it's beyond the ability to comprehend for a majority of Republicans.  They would prefer the witch trials of Salem to any real justice system.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mayfly42",
                    "body": "[NPR's Embedded podcast did a couple of episodes about a service member who was at January 6th](https://www.npr.org/2026/01/01/1200150227/-embedded-agoodguy-trailer) and the consequences or lack thereof he faced. I think there are many in military service who are happy that Trump is president and supportive of what he's doing.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "cchristophher",
                            "body": "Yep. Maybe a handful that disagree but the vast majority are still supporters. Those that disagree will be punished.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "bl1y",
                                    "body": "A third of the military voted against Trump in 2024. It's not a \"handful\" that disagree.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Avena626",
                                            "body": "So 2/3 are on Trump's side (or apathetic and didn't vote)? I don't like those odds.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "mosquem",
                                                    "body": "I mean if it breaks down to thirds (Kamala, Trump, No Vote) then it pretty much matches the country.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thatthatguy",
                    "body": "The problem is that it’s entirely possible to dismantle the constitution within the bounds of the constitution.  So long as he’s acting within the broad and sweeping authority of the presidency, it would be very difficult for high-ranking members of the military to justify refusing orders.  If the decision to refuse is not unanimous then the resisting officers can be dismissed until an officer with greater political ambitions is found.\n\nThe pentagon can be reasonably relied on to resist impulsive and obviously unlawful instructions, but they can’t be depended on to stop a protracted scheme of using the law to subvert the law.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "OhFuuuccckkkkk",
                    "body": "This is what I thought about when he gave the 8000 soldiers who disobeyed vaccine mandates a pardon and reenlistment. He’s now got 8000 soldiers loyal to him because of what he did for them. It’s all quid pro quo, and that’s what makes this all scarier than it should be.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "bl1y",
                            "body": ">He’s now got 8000 soldiers loyal to him because of what he did for them\n\nOnly 113 rejoined.",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "Remarkable_Aside1381",
                            "body": "8k junior enlisted isn’t enough to fill out a division, it’s not something to be worried about in the slightest",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "OhFuuuccckkkkk",
                                    "body": "I think it’s the fact that they will be spread out throughout the military is what is concerning. I’m sure plenty of those soldiers are in officer positions and can easily influence others. Imagine the younger ones signing up just to learn how to shoot a gun and get enough training to make them effective in the militia they’re also secretly a part of. \n\nhttps://www.theguardian.com/world/2022/feb/09/white-supremacist-group-patriot-front-one-in-five-applicants-tied-to-us-military\n\nImagine if just 50% of those can get 2 additional people on their side. Imagine if a colonel or a major can get a small chunk of his officers to side with him. Maybe not a coup but disobeying or altering orders. Just enough to swing things in one direction or another. \n\nWe’re seeing a coup happen in real time in the government. I honestly think it will just be a matter of time until the military is affected.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Remarkable_Aside1381",
                                            "body": "> I’m sure plenty of those soldiers are in officer positions\n\nYou would be wrong. Even then, only 43 of the 8k have rejoined",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Moggio25",
                                            "body": "the 50% getting two on their side is not a legitimate framing of it,  because it works from the assumption that every member of the military is open to partaking in a coup.  In reality there is only a portion who would even be in the ballpark of potentially open to the idea.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "post_makes_sad_bear",
                            "body": "I don't think commanders are just going to simply ingest those individuals back into their units with no questions asked. That's years of an individual who is out of regs. It would require fitness regulations and knowledge retention, security clearance, not to mention a clean piss test. Do they have to be reinstated to the work area they originally were working for? What if they moved away? Who pays for relocation costs?\n\nIf anybody knows of anyone who has gone through this process, I am wildly interested to understand how these individuals have been reinstated, and at what cost. I'm in the military, and have been for more than two decades, and do not know anybody that was nonretained due to vaccination.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SpookyFarts",
                            "body": "How many of those are reenacting?\nHow many of those that reenlist will make the cut again?\nHow many.......etc.\nI wouldn't worry about it. They'll likely be fast tracked for shit jobs",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "bl1y",
                                    "body": "Only 113 have rejoined.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ebscriptwalker",
                                    "body": "Marvelous Mrs measel.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "PoliticalDiscussion-ModTeam",
                                    "body": "Please do not submit low investment content. This subreddit is for genuine discussion: Memes, links substituting for explanation, sarcasm, political name-calling, and other non-substantive contributions will be removed per moderator discretion.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pegLegP3t3",
                            "body": "You’re assuming loyal to the point of firing on Americans. There’s an entire order of magnitude that has to be crossed before that happens. Back pay is not the same thing.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "okletstrythisagain",
                                    "body": "Putting up with stupid shit like this is what got us in this situation. If the grownups just decided that it was an appropriate role for government to protect citizens from morons who refuse to vaccinate we would be only slightly less “free” and returning to the stability of the pre-MAGA status quo. But no, we let eating horse paste and demonizing Fauci become normalized. It’s all stupid and crazy and the overarching reason why we are circling the drain as a nation.\n\nIt’s unclear how to protect against legions of stupid people enthralled by propaganda, but vaccine science would have been a pretty effective and arguably non-political wedge against the damage.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Alive_Shoulder3573",
                                            "body": "Some people had honest problems with a supposed vaccine that hadn't been through testing and results that people could read.  A normal vaccine actually stops the body from getting the disease that the vaccine is for.\n\nWhen people took the polio vaccine, they were protected from it. \n\nI took the vaccine and boosters and still caught covid! Tones, so the supposed vaccine wasn't an actual vaccine.\n\nAnd just because the govt tells us something, a lot of people have lost the trust they had in them.\n\nAnd there is no constitutional amendment that says the govt is authorized to tell the populace that they had to take any medicine just because e are told to\n\nSo it has nothing to do with the adults saying anything.\n\nAnd after the fact, v there are a lot of things coming about the vaccine that even more purple would have refused it if they had known",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "Alive_Shoulder3573",
                                            "body": "And, you know nothing about vaccine science if you still believe the vaccine was ever a true vaccine\n\nThe stupid people are the ones that take something just because they are told to without any justification or treating results",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eggoed",
                    "body": "I agree with this; it’s pathetic to see how easily people down the command chain will just follow orders with minimal pushback. The water / dam release debacle in California is a good example; it was absolutely nuts and could actually have killed people, and the Army Corps of Engineers was just like “sure.”",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Brock_Hard_Canuck",
                            "body": ">I agree with this; it’s pathetic to see how easily people down the command chain will just follow orders with minimal pushback.\n\nLook how many people were \"Just following orders\" during the Holocaust.\n\nPeople love to follow orders from an authority figure, even if things might feel a little \"off\".",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Maskirovka",
                            "body": "> Army Corps of Engineers was just like “sure.”\n\nIf it's not an illegal order, what do you expect? The types of orders OP is talking about would be illegal, and everyone has an obligation to refuse those.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "AnOnlineHandle",
                                    "body": "> If it's not an illegal order, what do you expect?\n\nTo not do it because it was incredibly dangerous, wasteful, obviously served no purpose, and came from the deranged mind of a senile man child?\n\nIs that really too much to expect from other members of the human race? Is the bar really so low that people find these basic standards of how we operate in our lives a shocking thought?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Jess_me_nobody_else",
                                            "body": "The problem is, two hundred and fifty years ago, they founded a system that was supposed to prevent that But the bad people overwhelmed and hijacked the system . You can't expect the system to protect us, you can expect its rules to be ignored or explained away.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "forjeeves",
                            "body": "They will follow orders",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Psyc3",
                            "body": "This is literally how the military is designed. You have no authority if people start questioning your orders. \n\nAmerica spends most of its time bombing brown people for some cheap oil. That doesn't work if people question what you are doing.\n\nWhen there is a just reason to turn up, say stopping a genocide in Palestine, Sudan, Rwanda, or war crimes in Ukraine, they don't turn up. No oil there.\n\nLast war you had you spend 25 years achieving literally nothing in Afghanistan, it all fell to pieces on the notion the US was leaving before the planes even got off the ground.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MagicWishMonkey",
                                    "body": "This is an incredibly dumb take. The only war we’ve been involved in where the country had oil is Iraq and we never touched their oil.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "mofo69extreme",
                                            "body": "We don’t have to touch the oil, the availability of the Iraqi and Kuwaiti oil reserves on the market absolutely affects the price of oil in the US, even though we’re buying it from Mexico or Canada. \n\nWe import almost the same percentage of our oil from Saudi Arabia as we do from Iraq (~5%), but if you think our relationship with the Saudis isn’t about oil then I’m very curious what you think it is about.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MagicWishMonkey",
                                                    "body": "Of course our relationship with the Saudis is about oil, but that has nothing to do with Iraq. \n\nDo you think America is the only oil consumer/producer, or that Iraqi oil was not being sold on the market prior to the invasion?\n\nYou should read Surprise, Kill, Vanish - it’s a great book and the author covers a lot of the political dynamics in the Middle East in the decades leading up to the war in Iraq. It was a bullshit war pushed by chickenhawks, but oil wasn’t really much of a factor.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mofo69extreme",
                                                            "body": "Yes, Iraqi oil was relatively scarce on the market considering their potential output. Here is graph directly from Wikipedia, https://upload.wikimedia.org/wikipedia/commons/4/44/OilProduction.Iraq1990-2015.png, and for context Iraq had been producing 4 million barrels per a day on the eve of their war with Iran, so even between the Gulf Wars this amount of production is incredibly low. \n\nI’ll look into that book. I’ll admit that the war wasn’t principally about oil, but the fact that there region is oil-rich was a prerequisite for Iraq being on the USA’s hit list in the first place. I really don’t think the person you responded to was that off-base, our troops in Syria ex-licitly set up protecting oil-rich regions, and our willingness to help out the Saudis in their proxy wars (eg Yemen) is all tied to our desire to be close to such an oil-rich nation.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cchristophher",
                    "body": "From a human behavioral point of view, I definitely agree. Even if most service members did disagree with the orders themselves, we know herd mentality is so strong. You know how hard it will be for individual service members to resist the orders of their peers and superiors? You already see how the military treats victims of sexual assault. They’re punished for speaking out, even killed by their peers.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "KevinCarbonara",
                            "body": "> Even if most service members did disagree with the orders themselves, we know herd mentality is so strong\n\nIf it's most service members, that *is* herd mentality. Herd mentality is what Republicans would have to fight. I'm not sure you know what that phrase means.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "Usual_Ad6863",
                                    "body": "It's herd mentality and the bystander effect. Most soldiers will follow orders of a superior without question unless someone stands up. Most soldiers could internally disagree with an order but if no one stands up and voices that dissent then they all will fall in line.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "LogoffWorkout",
                                            "body": "People are naive to think that these \"illegal orders\" are going to be 'super obvious'.  Its also boiling the frog.  In a situation like this, most actions are going to seem innocuous.  They're not going to get some order that is,  \"We're creating concentration camps, like the Nazis did, so here are your Nazi orders, and go do your war crimes.\"  It will be some small part of a larger plan that isn't really that objectionable.  Posted as a guard at camps holding illegal immigrants.  Some soldiers will protest, but most will go with the flow.  You just need a majority of officers either following orders, and a very small amount ideologically tied to the presidency.  Its pretty easy for them to promote ideologically aligned people to the positions they want them in, and they've shown no problem firing any that would resist.\n\nThere will be protests by the public, in the media, etc.  but, its just going to be drowned out by all of the other crazy stuff going on.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "R_V_Z",
                    "body": "Either Obama or Biden should have blocked Fox News (and eventually OAN and Newsmax) from being aired on federal property.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "SadGruffman",
                    "body": "I kind of agree with you here.\n\nIt’s pretty ostentatious to suggest that say, Germans in 1938 just didn’t swear allegiance to a flag or constitution of some other kind and we just finally figured it out in today’s day and age.\n\nPeople in power abuse those unwilling or unable to question the use of power.\n\nSomeone who refuses to pull the trigger will just be replaced by someone who can’t afford do, or worse, doesn’t care enough not to.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "livsjollyranchers",
                            "body": "For what it's worth, the Weimar Republic was incredibly fragile and much of the citizenry didn't even believe that they should be a Republic at all, but wanted to restore a monarchy or at least something similar to what came before it.\n\nI see parallels to Germany myself but do see an element here where they don't align well, as our Republic has been entrenched for some time.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "_mattyjoe",
                                    "body": "That is correct. Our long term efforts to plant the seeds of democracy and an understanding of our rights as Americans, coupled with an education that, while flawed, still represents a better education than the vast majority of humans previously received in history, will be our saving grace.\n\nMany Americans are pretty aware of what’s happening right now and are calling it like they see it.\n\nBernie called it a “move towards authoritarianism.” Point blank.\n\nKeeping critical thinking and awareness alive is hopefully the thing that makes this different in the long run.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Unputtaball",
                                            "body": "I wish you were right, but given that 77,302,580 people in America over the age of 18 thought it was perfectly fine and reasonable to elect a convicted felon who already tried to overthrow the peaceful transfer of power; I think you’re unfortunately dead wrong.\n\nWe look back on J6 with rose colored glasses (even those of us who disagree with what happened) because J6 failed. But we were **THAT** close to having Trump break the continuity of Presidential succession. We were one unlawfully obeyed order from sliding into autocracy already. Now they get a second shot at that.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Linayt",
                                                    "body": "I strongly oppose what is happening, yet it's crucial to recognize that his voters are far from homogeneous. Some are fiercely pro-life, others were swayed by the promise of lower prices, and many perceive his words as mere rhetoric. It's a misconception to believe that most Americans have a solid grasp of economics and history. In reality, many remain unaware of the meticulously crafted propaganda aimed at them.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "FilibusterFerret",
                                                            "body": "A lot of them are zero information voters.  I know a few from work.  They rarely vote.  If they do it is only for president.  They are completely unaware of their local government, have almost zero knowledge of how the federal government works.  They may know the name of their own governor, and they may not.  They just work and pay bills and raise their kids.\n\nOne girl who voted for Trump had never even heard of J6th.  She just knew things are expensive and Biden is president.  That's it.  Those were her two points of fact.  Would she support all the racist, sexist, murderous shit Trump is doing?  No, she has no idea.  She didn't even know he was planning on deporting people.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "ChiefsHat",
                                                                    "body": "There is something deeply wrong with how information is processed in this country if you know a girl who didn't know this.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "schistkicker",
                                                                            "body": "We're here discussing this stuff in this space because we pay attention and we seek out this information. There are vast swaths of Americans who only get their information from siloed social media streams or influencers, or get it secondhand from their friends/family/colleagues who get misinformed by Fox (or worse). \n\nWhat Musk and his underlings are doing in the Treasury right now is alarming; I strongly suspect that there are plenty of information silos/algorithms that are either glossing it over or just not reporting on it at all.",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "FilibusterFerret",
                                                                            "body": "There are lots more where she came from.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "manomus",
                                                    "body": "Respectfully - what could the J6 mob actually have done? They embarrassed themselves and the country when they bummed rush the capital, sure - but they didn’t have any power or force to actually mount an actual insurrection and topple the government",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DickNDiaz",
                                            "body": "> Bernie called it a “move towards authoritarianism.” Point blank.\n\nThe whole blessed Dem party and many of the Anti-Trump coalition had warned of this, it wasn't just Sanders.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "_mattyjoe",
                                                    "body": "Not sure what your point is.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DickNDiaz",
                                                            "body": "My point is Sanders isn't the only person who said that, Liz Cheney lost her political career saying that. \n\nWhenever I see a person post \"Bernie this\", it's basically one persons own Trump. It's sort of monotheistic, one's populist to another's. It's like giving one person credit while everyone else has been working against Trump ever since 2016.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "_mattyjoe",
                                                                    "body": "No..? I merely mentioned Bernie who put out a statement on new developments 2 days ago and quoted it.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DickNDiaz",
                                                                            "body": "So he is saying that a few years too late then, when people like Ken Luttig was saying that back in 2023.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jeers1",
                    "body": "hmmmm this sounds so familiar from my history class",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "EJ2600",
                    "body": "Soldiers are socialized to follow orders. Round up in camps means round up in camp. Doubt very much you will see dissent from that group.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "_mattyjoe",
                            "body": "People inside the military have talked about how there's a large emphasis on their duty to serve the Constitution above all else. Their oath itself is to protect the Constitution. Many of them also talked about how orders given to commanders to use military force on domestic soil (which would be unlawful), would generally not be followed.\n\nAt least, not traditionally.\n\nMy concern is that the right wing narrative has become so powerful that it's begun to erode these distinctions. Their endless use of the buzz phrase \"National Security\" is a big part of it.\n\nThe Right uses this phrase to manipulate the narrative in order to accomplish all sorts of goals.\n\nIt's Orwellian. There might be a real threat from a bad actor inside the US that the US Military might need to act on. But how do we define that? Who gets to define that?\n\nRepublicans are playing a very very dangerous game by weaponizing the usage of that phrase for their propaganda.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "EJ2600",
                                    "body": "All he needs to do is proclaim martial law following the urban riots which will follow rounding up millions of people into concentration camps and then the constitution will be suspended. Then all bets are off.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Ebscriptwalker",
                                            "body": "If martial law occurs the one thing I know, is I will not be showing up to work.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "EJ2600",
                                                    "body": "Let us hope you will not be the only one.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Foolgazi",
                    "body": "Especially since anyone disobeying an order from their immediate superior will be guaranteed a pardon.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CaptainMagnets",
                    "body": "In my opinion they'll send the military to Mexico or Canada to keep them occupied while they take over.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Tex-Rob",
                    "body": "I have worried and wondered for years that the military increasingly can’t get the highest quality of candidates they used to be able to.  Every service has made concessions to allow increasingly unfit people from serving.  The Air Force I knew 1996-2000 seems nothing like now.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "_mattyjoe",
                            "body": "I’d love to know what you mean by increasingly unfit.\n\nMy perception: service members right now seem angry and hateful and very much caught up in MAGA. I don’t think they see the bigger picture of our country’s values outside of party politics as much as they used to, or upholding the Constitution.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PhantomBanker",
                    "body": "I have a question about “unlawful orders”.  Since the President is now considered immune for all official acts, would all his orders be considered lawful? If so, does that mean that all orders need to be followed under penalty of insubordination?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "_mattyjoe",
                            "body": "The immunity ruling for the President means he cannot be personally prosecuted for “official acts” while he is President.\n\nThat does not mean he cannot violate law or that his order cannot. It means he can’t be held personally responsible.\n\nThe worst that could happen is Congress impeaches and removes him from office. At that point, anything he does subsequently he no longer has immunity from because he would not be acting in his “official capacity” as President.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "schistkicker",
                            "body": "You'd have to wait for someone to sue and work it's way up to the Supreme Court for them to determine whether an act was \"official\" or not. In the meantime, whoever proactively defied that order has been court-martialed (or worse). \n\nThe current majority has set up the ultimate \"you can beat the rap, but not the ride\" in this country. It'll be one for the history books that other countries will have to write about us.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ender23",
                    "body": "The army isn't the issue here.  It's most likely neutral officially.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIt's every city/states police force who is heavily armed and not cohesive at all nationally",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "cedarpointtime",
                    "body": "Does the cia preserve that oath or do they do what they want? So, at least cia can do anything they want.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cguess",
                            "body": "Not legally on American soil. The CIA can only legally work outside the US. Anything domestic has to be handed over to the FBI (DEA, Homeland etc too). CIA is also not technically law enforcement, they're intelligence. CIA agents (I don't believe) have arrest power for instance.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "malarkioso",
                    "body": "Your perspective is terrifying",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ipsum629",
                    "body": "I think it is more likely than not that the Generals of the US army would not follow a blatantly unconstitutional and self serving order. Rank and file soldiers are taught to obey. Officers are allowed to think.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smedlap",
                    "body": "He will change the oath the day before he gives the orders to round up those who voted against him.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "wosh",
                    "body": "My concern withcl Amy of these discussions is what constitutes and unlawful order?  Like what exactly triggers something in the military to make it unlawful?",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Sneep_Snorp5",
                    "body": "Like maintaining the borders? Give some decent examples. So far I have seen nothing that is a fascia policy, and I’m convinced half the population doesn’t even understand what that word means.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "_mattyjoe",
                            "body": "I’ll keep it simple, and to be clear, I am happy to have a deeper discussion on this. \n\nThe President acts on policy that Congress passes. That means, he must “faithfully” execute the laws as Congress passed them (that comes straight from the Constituion). He also cannot legislate himself, he cannot dictate policy outside of the scope of what Congress passes through law.\n\nSeveral of his executive orders are just simply illegal, they are not within his authority, and they constitute an attempt to legislate.\n\nWhy is this a problem? Because that would make him a dictator; a head of state that unilaterally passes law.\n\nWe don’t have a dictatorship in the US. We pass law through Congress, who represent us.\n\nAdditionally, the Constitution only gives power to Congress to allocate funds. The President cannot order that funding be ceased for actions that Congress has taken. His order to freeze Federal Spending was also Unconstitutional.\n\nThis goes for all present and past actions. Laws that Congress passed previously that he might not like, only Congress can repeal those laws. It’s a process. Trump cannot unilaterally decide which laws to enforce or not enforce. That is not HIS call to make. The Constitution requires the President to “faithfully execute” the law.\n\nTo reiterate, these protections are all in place to prevent tyranny, to prevent a dictator from making orders that the country needs to follow.\n\nTrump’s actions just in these areas are fascist. Point blank. He is trying to dictate policy unilaterally. He is showing a disregard for the separation of powers, the constitution, and many other laws already on the books.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Sneep_Snorp5",
                                    "body": "The executive orders from what I’ve seen have been constitutional. A judge stopped one on a federal funding freeze, but I’m going to give that one some more time before I judge that.\n\nOther orders like pardoning the January 6th rioters was a reaction to their absurd sentences given.\n\nI think a lot of this is a reaction to policy people heavily disliked from bidens presidency; but make of that what you will.\n\nI still wouldn’t call Trump a fascist, because he’s still seems to care about the working class, and because his executive orders can still be striked down or challenged.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "_mattyjoe",
                                            "body": "You are incorrect. And you’re about to find out how much he cares about the working class with these 25% tariffs he just levied on Mexico and Canada, which will cripple portions of our economy.\n\nStocks are already being shorted by Goldman Sachs and others. The market will take a tumble tomorrow.\n\nIt’s expected our auto industry might come to a halt, because they simply cannot account for this rise in costs. People inside that industry have already said as much.\n\nTry to keep up, you’re falling behind.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Sneep_Snorp5",
                                                    "body": "The tariffs are a direct result of our neighboring countries acting like assholes to our face. People act like tariffs are brand new but something people don’t realize is how much history is ingrained here. The US essentially rewarded countries for not being close with the Soviet’s, granting them so much open trade with us. But why do we still need this policy? There is no giant enemy like the Soviet Union anymore, and countries like Canada and Mexico are not going to “retaliate” with their own tariffs.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "AmmonomiconJohn",
                                                            "body": "[https://apnews.com/article/trump-tariffs-canada-mexico-retaliation-trudeau-sheinbaum-70e067b092a3af72c2eb7ca37d532c91](https://apnews.com/article/trump-tariffs-canada-mexico-retaliation-trudeau-sheinbaum-70e067b092a3af72c2eb7ca37d532c91)",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Sneep_Snorp5",
                                                                    "body": "They can do whatever they want. It’s simply not going to last.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AmmonomiconJohn",
                                                                            "body": "Right?! It's like, what even are goalposts, dude?",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SandyPhagina",
                                            "body": "Like the one that removes birthright citizenship which is guaranteed by the Fourteenth Amendment?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Sneep_Snorp5",
                                                    "body": "The 14th amendment was applied to slaves you had kids in the United States, however there was a ruling by the Supreme Court which dictated that that applied to EVERYONE. So you have all of these schemes which arise from it like birther tourism where a pregnant woman has a kid in the US who automatically becomes a citizen who can then bring their family over. Those also happens with illegal immigrants. So yes Trump cannot remove the 14th amendment but its nuances have been called into question.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DickNDiaz",
                                            "body": "> I still wouldn’t call Trump a fascist, because he’s still seems to care about the working class, and because his executive orders can still be striked down or challenged.\n\nI don't think he cares about the working class when he has billionaires in his cabinet with a combined net worth of over a trillion dollars, and now has given Musk more power over the federal government. Plus, he doesn't care about the rule of law, he'll just plow ahead with his EO's despite the courts and take it all up to SCOTUS. He is flexing the power of the executive and he has all three branches of the government. He can use the military or flex outside of it, deputizing militias (who supposedly should be against the tyranny of government) and down to the militarized local law enforcement agencies (with those \"constitutional sheriff\" Wyatt Earp cosplayers. \n\nI mean, Dr. Phil is there during ICE Raids, this is bonkers shite.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CHUCK_C1993",
                                    "body": "But who is going to stop him when he takes Congress's power as his own? There is no one left to stop him! Those who insist that there are safeguards because of laws on the books are NAIEVE!",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Alive_Shoulder3573",
                    "body": "Exactly what orders has Trump given to the military that are unlawful and unconstitutional?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "_mattyjoe",
                            "body": "None yet, to the military. This is a hypothetical “what if” discussion.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "_mattyjoe",
                                            "body": "What is a fantasy? You’re gonna have to be more specific.\n\nWe are talking about unconstitutional Military orders here. Orders given to commanders.\n\nIf you think we are talking about his Executive Orders (different thing) then many of them are blatantly unconstitutional and unlawful. That is not a fantasy, that is real, and several judges have already said as much and blocked actions.\n\nBiden sending unconstitutional orders to the military would be a very serious offense. I am not aware of any such thing happening, you’re gonna have to clue me in.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Alive_Shoulder3573",
                                                    "body": "1) no EO given by any president is only unconstitutional when the Supreme Court decides it to be. V and since none have been tested by the court system yet, none of those he has signed are \"blatantly\" unconstitutional. Yet.\n\n2) you might be too young but then president Clinton, unconstatutionally ordered his secretary of defense at the time, Janet Reno to attack an American group in Waco Texas using the army, tanks and personnel using poisonous gas, which killed a bunch of kids,\n\nAnd not a single Democrat complained about his actions either. V so I guess there is precedent in using the army in the US.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cid_Darkwing",
            "body": "Chances are what happens is the first unit involved has someone in the chain of command who would refuse order to fire on unarmed Americans. The officer in question would undoubtedly be relieved of command (whomever it was) and then a different officer would subvert the order to fire at a different point. (seriously—try drawing ammo sometime; the clusterfuck involved of getting live rounds from an armory would give the average civilian an aneurism). \n\nThis would keep happening until there was finally a willing and enabled chain of command all the way down and at that point, when civilians are killed by the military, you would likely see a quick fracturing of the armed forces. Depending on who had proximity to SecDef and the joint chiefs and what their loyalties were would probably determine whether we ended up in a civil war/secession attempt (if they support the authoritarian takeover) or a coup attempt (if they don’t).",
            "score": 105,
            "replies": [
                {
                    "author": "BUSY_EATING_ASS",
                    "body": ">This would keep happening until there was finally a willing and enabled chain of command all the way down and at that point, when civilians are killed by the military, you would likely see a quick fracturing of the armed forces. Depending on who had proximity to SecDef and the joint chiefs and what their loyalties were would probably determine whether we ended up in a civil war/secession attempt (if they support the authoritarian takeover) or a coup attempt (if they don’t).\n\nI thought about the 'Trump fires everyone until yes man' scenario as I was writing my post in this topic but I arrived at the thought that at some point, the military is going to go \"Yeah I'm fired? How about fuck you and come get me\", the general staff bands together, and it'll just go rogue.\n\nI'm being dead serious. At some point the military as an institution is going to feel threatened and defend itself. You gotta remember that while there are definitely exceptions to the above, the military aren't politicians; they will reflexively defend its existence in a way a legislative body can't or won't.\n\n  \nCould be wrong tho idk",
                    "score": 53,
                    "replies": [
                        {
                            "author": "Elandtrical",
                            "body": "That is exactly why coups and military firing on it's own people never happen in other countries. /s\n\nI think the large problem why Americans aren't seeing what is happening is the absolute conviction that these kinds of things only happen in shit hole countries. I have been coming to the US for 10 years, now living here, And I said to my American wife that American capitalism, the type that Americans inflict on other countries, will eventually come for its own people. That started happening but it was a slow burn, every year seeing things get shittier. I did not think there would be a coup until the elections when I told my wife there has been a tech bro coup the day after.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "DontEatConcrete",
                                    "body": "Much of the american story is a complete lie. Freedom from oppression, tolerance, furthering democracy, doing the right thing. Holding people accountable, equal rule of law. It's a fairytale. I didn't realize until very recently how much of it was a fairytale, and how little these stories americans tell themselves actually matter (very little).\n\nI guess I wanted to think certain events like vietnam or the criminal invasion of iraq (based on lies) were one-offs, but no they were in fact indicative of a systemic rot, with the american flag a facade over the cancer of american culture.",
                                    "score": 23,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Interrophish",
                            "body": "Both his last term and this term: people illegally fired by DJT have just... complied. \n\nBut sure, maybe it might happen differently one time.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Popeholden",
                            "body": "and that's a military coup.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Mist_Rising",
                            "body": ">I thought about the 'Trump fires everyone until yes man' scenario as I was writing my post in this topic but I arrived at the thought that at some point, the military is going to go \"Yeah I'm fired? How about fuck you and come get me\",\n\nMore to the point, it's actually harder to fire members of the military than any other federal government employee.  You can remove them from their post, by reassignment, but they're actually protected at most levels from the president entirely. You would need to court martial them or otherwise find the legal mechanism.\n\nEven higher ranking officers are technically immune from straight firing, they just traditionally resign when asked instead of the inquiry process needed.\n\nWhile Congress could pass a law changing..oh who are we kidding Congress couldn't tell you what day of the week it is if they had to first pass a major bill.\n\nAs a result the first time a soldier says \"no sir, I do not quit\" Mr booze happy has to prove his competence and find a legal reason to eject someone. Anyone got a beer?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IrritableGourmet",
                    "body": "> (seriously—try drawing ammo sometime; the clusterfuck involved of getting live rounds from an armory would give the average civilian an aneurism)\n\nI can't find it, but there was an article a while back by a former military officer replying to some pundit who said that civilians shouldn't have restrictions on firearms because the military doesn't restrict how soldiers use weapons, and the general vibe was \"WTF are you smoking? You can't *touch* a weapon until you're trained on it and if a firearm goes missing we put the entire base on lockdown and literally turn over every rock until we find it.\"",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "ysustistixitxtkxkycy",
                    "body": "Realistically, the military is not going to be asked to fire on unarmed civilians. Historically, fascists had separate murder organizations for that, and the military was feeling ethically superior by staying out of the conflict and upholding honor, traditions and national defense. There's also the option of keeping it occupied with a few wars on the side.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Arthur_Boo_Radley",
                    "body": "> unarmed Americans.\n\nHmh.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "-ReadingBug-",
                    "body": ">when civilians are killed by the military, you would likely see a quick fracturing of the armed forces.\n\nThis is what first comes to mind in a conversation like this. I'd assume an unlawful order would eventually be followed. What happens after is what to pay attention to.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BUSY_EATING_ASS",
            "body": "The military is less partisan than you think; it's not *entirely* conservative, even if it isn't very liberal. Much of that conservatism is concentrated in the enlisted, the officer corps skew much less conservative.\n\nWhen it comes down to it, the enlisted are gonna do whatever the officers tell them to, they're not going to get court martialed over Trump in any serious numbers, and I doubt much of the officer corps who leans conservative are 'Trump Authoritarian Rule' conservative.\n\nPush comes to shove, I ultimately think they'll remember their oath. 'The military' is still pretty huge though, so I can't speak for *every* individual or unit. Shit might get weird.\n\n  \nEDIT: I guess to be more specific to what I think; some dumbass Sergeant doing a Kent State? Yeah, definitely possible. The military at large going 'It's Trump's world baby, we're just living in it' and enforcing military rule on his behalf on the whole country? Doubtful.",
            "score": 118,
            "replies": [
                {
                    "author": "j____b____",
                    "body": "What if they were fighting a righteous war against thugs, terrorists and baby killers? Because propaganda is a hell of a drug.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "BUSY_EATING_ASS",
                            "body": "I get what you're saying but the military operates differently than to be affected by that sort of thing, they're operationally not just gonna take some shit like that at face value and actually deploy soldiers  on some Fox News type shit. The military does a lot of dumb shit but not dumb shit like that. \n\n  \nWhat you're describing does not sound applicable how the military functions when I experienced it during my time in.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "j____b____",
                                    "body": "I sure as hell hope you’re right, and was arguing the same side as you yesterday. I think we’ll know for sure pretty darn soon because he loves testing boundaries. Some hold.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "BUSY_EATING_ASS",
                                            "body": "The military is institutionally more boring than people think; it's a massive organization that runs on inertia and an overwhelming head start over everyone else. \n\nBut it moves slow, is politically unsurprising, mired in bureaucracy, and extremely organizationally rigid. I'm more afraid of the military doing *nothing* than I am doing some Order 66 type shit. That's the movies.\n\nNot to say that shit might not pop off though. But not like what some people might imagine I think.",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "bilyl",
                                                    "body": "I’d be more worried about Trump’s takeover of civilian agencies like the FBI, DHS, DEA, etc. There are little guiderails for people who work there, and there’s established legal precedent for the President to oversee them with little accountability.",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "ColossusOfChoads",
                                                            "body": "I'll really start worrying when we see 'paramilitaries' that are allowed to get away with shit.  Like if the feds and state/local cops are leaned on to let the Proud Boys or the Gravy SEALs do whatever the fuck they want.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GarfieldSpyBalloon",
                                                                            "body": "The Venn diagram ain't exactly a circle but there's a metric fuckton of more overlap than anyone should be comfortable with.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Veritablefilings",
                                                            "body": "Hes already utilizing ice in this regard.  Immigration is the boogyman that he has begun sidestepping due process.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "foul_ol_ron",
                                            "body": "I feel for the officers who have to push back when he gives illegal orders. They need to be recorded for posterity. Like Stanislav Petrov and Vasili Arkhipov.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "CremePsychological77",
                                                    "body": "Yeah, Mark Milley’s security has been revoked and I can imagine Iran is absolutely salivating at the prospect of getting their hands on a recently retired four star general….. not even just four star general either, but head of the joint chiefs. Especially after Trump killed one of their generals in an air strike last time. Project 2025 calls for ejecting the apolitical upper brass and replacing them with loyalists, which if they follow suit as they did with Milley, we will have a bunch of three and four star generals just out there with no security. At that point I could see the military getting weird because people who haven’t been trained for the upper brass are going to be in those positions, taking orders from a SecDef who they probably outrank.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "talino2321",
                                                    "body": "You don't get to flag rank without being politically savvy.  With that said, I can see a case where these flag officers will quickly see which way the political winds are blowing and look to save themselves by following Trump's orders regardless of their personal beliefs.\n\nIt's a crap shoot and until that situation happens we just don't know which way they will go.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Remarkable_Aside1381",
                                                            "body": "Flag officers are also *generally* pretty smart and competent. The stereotypical gung-ho officer exists, but he has counterparts that are the polar opposite. Hell, the CO of the 24th SOW has a PhD in philosophy and a masters in PoliSci.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "talino2321",
                                                                    "body": "Which has nothing to do with the sacrificing their morals and following orders to fire on civilians especially if Trump and Hegseth decide to put in place loyalty tests (which seems to be what is beginning to happen) and anyone that isn't onboard is either dismissed or worse.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Remarkable_Aside1381",
                                                                            "body": "I think you grossly underestimate the moral compass of most officers, and the sheer amount of even just combat arms officers that would need to be replaced",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "talino2321",
                                                                                    "body": "Sadly, I am probably not in today's reality.  There are enough ambitious officers willing to do Trump's bidding. \n\nLook everyone hopes it will not come to that, but don't be surprised when it happens",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Remarkable_Aside1381",
                                                                                            "body": "PLs don't make good BN COs. You can't replace every non-trumper officer, it's not feasible",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "talino2321",
                                                                                                    "body": "You don't have to.  Easy enough to get rid of them to shit postings, or they get a letter in their personal files and no more promotions and suddenly they are relieved of their command because the Army/Marines/Navy/Air Force has lost confidence in their ability.  \n\nA good indicator is the number of flag officers either retiring, losing commands or potentially facing charges for various BS reasons.  I would expect to see a lot of that in the next 6 months.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Remarkable_Aside1381",
                                                                                                            "body": "> A good indicator is the number of flag officers either retiring, losing commands or potentially facing charges for various BS reasons\n\nKnow who replaces them? The O-6's like the one I mentioned. They get replaced by the O-5's who are career officers and less-likely to be trumpers.\n\nHow many officers do you know?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "talino2321",
                                                                                                                    "body": "Too many sadly.  I did contract work for the DoD from early 2000 through 2015 and interacted a lot with O-4 and above on development work/projects.  I'm still in contact with them informally when new contracts or projects come along that I might be interested in.  \n\nThey are all very concerned that this is not going to be a nothing burger this time.  And if your not onboard with this administration's agenda, your not going to have much more of a career.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Remarkable_Aside1381",
                                                                                                                            "body": "> I did contract work for the DoD from early 2000 through 2015 and interacted a lot with O-4 and above on development work/projects.\n\nSo none of the officers currently serving or who commissioned during the first trump presidency?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "talino2321",
                                                                                                                                    "body": "Actually some are still active O-5/6/7 and a couple are above that.  A few are now in the reserves as well.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Remarkable_Aside1381",
                                                                                                                                            "body": "And how many are willing to put trump over their country?\n\nShit, the Big Red's CO has a masters in public policy from Georgetown. You expect him to toe the line? If he's ousted, the DCO isn't going to toe the line either. My old wing's CO isn't going to follow illegal orders, nor will the Group CO.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "talino2321",
                                                                                                                                                    "body": "Honestly I would think a few of them would.  The others, well let's just say that they have been quietly feeling out the civilian job market post military career, that they know is coming if they aren't on board.\n\nBut we will never know until they are faced with the choice, will the say 'no' or just close their eyes and let it happen.\n\nLet's be real.  Hegseth was put in the DoD to put in place those commanders that will not question any order given by Trump.  And I am sure they will find those people.  Be damned whether or not they are qualified.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Remarkable_Aside1381",
                                                                                                                                                            "body": ">And I am sure they will find those people.\n\nYou think they’ll find ~10k pro-trump officers? Uh huh, sure",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "talino2321",
                                                                                                                                                                    "body": "It doesn't take 10K officers.  Just a few key positions.  What do you think will happen when the JCS are all Trump loyalists?  And the key commands in the US are also under the thumb?  \n\nDo you think the average BN is going to question any command at that point and face court martial and jail time?  How many times do you think it will happen before the rank and file realize that is the outcome?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "Remarkable_Aside1381",
                                                                                                                                                                            "body": "> . What do you think will happen when the JCS are all Trump loyalists? \n\nThat the JCS don't issue orders to CCMDs, because they have no command authority? If you think the JCS has any bearing on military orders, you're woefully unqualified to be having this discussion.\n\n> And the key commands in the US are also under the thumb\n\nWhich commands? You'd need to replace all the CCMDs, and the MAJCOM/ASCC/AF COs, and all the BN/BDE/REGT/DIV COs and DCOs/XOs. Then you have to hope that the CCs are on board, and the PLs, and the PSgts.\n\n>Do you think the average BN is going to question any command at that point and face court martial and jail time?\n\nAn infantry BN is ~1k people. Yes, a lot of them will stop and question orders they believe are illegal. They kind of really hammer the point home in Basic and pre-deployment.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "talino2321",
                                                                                                                                                                                    "body": "Tell you what, mark this conversation, and in 6 months let's see which of us is right.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": []
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "LogoffWorkout",
                                                                            "body": "I don't think we'll get to military firing on citizens.  They're not going to get packets of orders stamped with swastickas.  Its going to be slowly boiling the frog.  Very few people are equipped to resist effectively within an organization, maybe 5-10% of people are, and they're easy to remove.  Even if 50% of enlisted and officers are theoretically against the president's ideology, if everything were spelled out to them exactly what the plan is, they might be against it, but they're getting everything from a ground level view, they don't have the benefit of seeing things from 50,000 feet.  Its easy to go along with the flow and not rock the boat especially when there is nothing flagrant or obvious.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "boringexplanation",
                                            "body": "The military is an extremely independent institution separate from whoever is in the Oval Office.  Some of the smartest people I most respect in this world are military officers.  \n\nThe oath to the constitution is held extremely sacred when you go thru OCS and is reinforced through 250 years of culture that doesn’t just change overnight into MAGA.  Enlisted are another story.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DrMonkeyLove",
                            "body": "My impression is the officers are much less susceptible to such propaganda. The one I've known were all fairly well read, big history buffs, fairly even keeled people. They are all pretty well educated too. I think Trump would play a dangerous game pushing them too far.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WavesAndSaves",
                    "body": "Questions like this really grind my gears. It's basically asking \"What if everyone all agrees that the rules don't matter all at the same time?\" I suppose it's something that could technically happen, but it has *always* technically been able to happen, and the odds are so astronomical it's not even worth thinking about. \n\nThe military is made up of people. Not mindless drones. They swear an oath to the Constitution. Not to the President. No the the government. Not to Donald Trump. They all know this. Nothing will happen. It cannot happen here.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Interrophish",
                            "body": ">  It's basically asking \"What if everyone all agrees that the rules don't matter all at the same time?\" \n\nWe're watching it in-progress with the rest of the executive branch.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "BUSY_EATING_ASS",
                            "body": "Yeah, I think people really don't understand the kind of inherent decentralization the US military has in this sense. I really think people have this mental image of Trump broadcasting on every reflective surface him saying \"commence operation DIE\" and every serviceperson going all Order 66 at the same time or something.   \n  \nLike yeah there's definitely the probability of the military being party to some fucked up or weird shit but some of the stuff suggested here is bonkers bro. The real life military is literally too boring for this shit.   \n  \nDon't get me wrong, there's some stuff to fear here, but let's keep the fears realistic.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "Realistically, they will try to destroy that inherent decentralization over the course of some number of years. At that point, the military will just be another arm of Trump. After say, a decade maybe, the US military will be a monstrous parody of what it once was.\n\nClearly, they nominated Hegseth to ensure loyalty, not competence or justice.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "forjeeves",
                                    "body": "So what do u think about the prosecution of general milley",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Foolgazi",
                            "body": "We also never thought we’d see a sitting President attempt to overturn a free and fair election he lost.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bl1y",
                    "body": "The military is much less conservative than many people imagine. In 2024, the split among veterans was 61-37. In 2020 it was 60-39, and 2016 was 61-35. So basically a third of the military votes Democrat. (The surveys include former and current members, but the numbers have been pretty consistent in the last 3 elections.)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Foolgazi",
                    "body": "What if those enlisted men knew they’d be pardoned if they disobeyed an order?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Better-Silver7900",
                    "body": "you could not be more wrong.  \n\nthe modern military is very progressive.  most of enlisted leans left while most officers lean right.\n\nthe vast majority would refuse orders and/or detain/fire upon the officers.\n\nsigned a post 9/11 vet.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Foolgazi",
                            "body": "That’s the first time I’ve ever heard anyone say “most of enlisted leans left.”",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Better-Silver7900",
                                    "body": "bro the modern military is a liberal as it gets.  we’re a literal melting pot of of different races, ethnicities, genders, identities, and beliefs.  hell, some of the military aren’t actually citizens yet.\n\nbut for some reason the narrative is that we are right wing?  fuck no.  we didn’t join for some patriotic bs; we joined for job security and free education.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jllaing",
                    "body": "He’ll make them all sign a loyalty oath…of the ones who signed (everyone unless you want to get killed) how many will not comply even though they signed?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "BUSY_EATING_ASS",
                            "body": "Once things have gotten to that point, society has already fallen apart and there's too many variables to accurate predict. Otherwise, we're not going straight from now to- \"sign this loyalty oath or die\". \n\nHow many of ya'll served and know how the military works? Honestly? Some of this stuff sounds like it's from a video game.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zombie_John_Strachan",
            "body": "Depends how thoroughly the military has been corrupted. Standard despot playbook would be to replace generals with supporters and then build a loyalist military within a military. \n\nCreate a unit based only on fanatical support, led by partisan loyalist. Use them as shock troops for attacking enemies. Rinse and repeat. \n\nIt could happen in the US because it could happen anywhere.",
            "score": 26,
            "replies": [
                {
                    "author": "ColossusOfChoads",
                    "body": "> Standard despot playbook would be to replace generals with supporters and then build a loyalist military within a military. \n\nThat's how Iran did it.  They shitcanned their officer corps clear down to the fighter pilot level, and replaced them with stooges.  The Iran-Iraq War kicked off and was a shitshow for them, in large part because of that.  Everyone thought they were giant idiots, but it paid off long-term because that's the number one reason why they have complete control.\n\nThat's my non-expert understanding.  Anyone who knows more/better, by all means chime in.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Mist_Rising",
                            "body": "It's also backfired gloriously. Not to put too fine a point on it, for every Iran who managed to hold out, there are more Russians and Khmer rouges who got demolished by their enemies because they didn't have a competent army.\n\n\nMost despots have this issue. By putting loyalist lackeys in charge the army becomes loyally useless. Which is usually a problem when the despot is a despot. Not everyone just sits by and does nothing and your army is now fundamentally broken.  The Soviet union for example disposed of many of the top generals, because Stalin feared them, and then tried to invade Finland. They won, but purely with the ability to simply outlast their enemies.\n\nRather notably, Hitler did NOT go about trying to massively change the army initially and it turned out much better for him. Germany was always going to lose, the manpower and industry of the US, UK and Soviet each outnumbered the entire axis power (France should also have not been lost) but Germany wehrmacht was left largely as it was, with only a few removals to clear his way. This left him with a core of solid officers. Not overly loyal, as the original plan for the general staff was to literally lose the battle of France and toss Adolf under the bus, but very competent when the time came. They even turned an obvious loss (France) into a stunning victory. \n\nNotably the one time he did put political power over the military prior to 1939, he got Goering. Competent pilot, loyal Nazi bad leader, shit human being. Goering likely saved the British army. He definitely screwed up the invasion of the USSR by demanding air planes instead of tanks.\n\nAnd no, this isn't a Nazi good. They did plenty of other stupid shit, obviously.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DrMonkeyLove",
                    "body": "But Trump can't easily just replace generals, because the people behind them to replace them were all educated in the same way. It would be hard to find enough yes men in the officers corp. For reference, there are like 625 flag officers across the armed forces. When you get down to colonels and captains (O6s), there's like 7000. You can't just replace all that.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Zombie_John_Strachan",
                            "body": "It absolutely could happen. That’s the scary part.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WheelyWheelyTired",
            "body": "That depends very much on who is in charge and how favorably they, as well as the military at large, view their commander in chief. Caesars legions were personally loyal to Caesar, so they followed Caesar. That’s how this works ultimately.",
            "score": 14,
            "replies": []
        },
        {
            "author": "piney",
            "body": "Unfortunately, obeying an oath to the Constitution means you have to have *read* the Constitution, and that you understood what you read. Our entire legal system exists for people to argue about what is permissible under the law. Most service members, I think, would rely on the judgement of their superiors rather than raise their hand and litigate, themselves, the orders they’ve been given.",
            "score": 6,
            "replies": []
        },
        {
            "author": "clios_daughter",
            "body": "So in the aftermath of the second world war, and an attempt to understand German atrocities, the Milgram experiments (with replications) were carried out to examine the role of authority. Specifically, whether or not an individual would refuse to obey an instruction given by an authority figure even if that instruction would result in harm to the victim. Roughly a 3rd would refuse, and 2/3 would execute the instruction. There was some variability in different replications such as the proximity of the authority figure to the subject as well as what constitute an authority figure.\n\nFor an actual case study, we can look at the micro history ordinary men by Christopher Browning which looked at a German order police battalion during the second world war. The vast majority of the men in this battalion were not Nazis or at least not ardent Nazi supporters. They were generally of middle age. They were ordered to kill several villages worth of Jews throughout the war. His findings were that about a third of the battalion would take part in the shooting of Jews quite willingly, another third would take part reluctantly, and a third would avoid taking part at all. (If anyone needs the citation for this I can provide it, but it’s late and I don’t want to rummage through a book looking for page numbers right now!)\n\nThus, given your question, we can presume that about 2/3 would likely comply with authority, and a third would resist. In practical terms, dismantling democracy imposing authoritarian rule is unlikely to result in immediate death — we can argue about human rights, etc. but the deaths that these violations may eventually lead to are nowhere near a certain as squeezing a trigger, or administering a lethal electric shock. The stakes of compliance were much higher for the order policeman, and the milligram subjects. It therefore would not surprise me if the resisters were smaller in number for the conterfactual you propose.",
            "score": 13,
            "replies": [
                {
                    "author": "Brett__Bretterson",
                    "body": "dowvoted for seriously mentioning the milgram experiment in 2025",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "bl1y",
                    "body": "I don't think you can apply that study to our current situation.\n\nBefore WWII, Jews were less than 1% of the population. Meanwhile, the current US military is about 1/3 Democratic voters. The Nazis would have had a lot of trouble trying to kill all the Jews if the Jews were a third of the military.\n\nI think we can be pretty certain that the vast majority of Harris voters would not go along with Trump overthrowing democracy. A lot of the Trump voters wouldn't support it either.\n\nThere'd probably be so much opposition to it within the military that you'd get an inverse situation where people who did want to do it reluctantly oppose it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Echoesong",
                    "body": "The Milgram experiment has been torn apart numerous times. It is not a solid basis for any kind of psychological analysis.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Opinionsare",
            "body": "\"If\"...\n\n\nThis is happening in real time, right now. It is only a matter of time until the shooting begins. \n\n\nIt is inevitable that American soldiers will kill other American soldiers and innocent civilians.\n\n\nThere were active duty military in the attack of January 6.\n\n\nThe question is when and how widespread the inevitable fighting will become? \n\n\nTrump has already committed impeachable acts, but as these high crimes are Republican policy, too many of our elected representatives join his conspiracy to subvert the Constitution. \n\n\nWhat happened when a officer loyal to the Constitution and country arrests one of Trump's co-conspirators and they resist? ",
            "score": 13,
            "replies": []
        },
        {
            "author": "awcguy",
            "body": "A couple of thoughtful responses in this thread. Reality is more on the lines of “guess we will find out”. It’s cute to think about what might happen though.",
            "score": 35,
            "replies": [
                {
                    "author": "bananaboat1milplus",
                    "body": "\"Let's wait and see\" is an attitude that will allow countless Americans to be harmed. \n\nDestiny is in your hands.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "WavesAndSaves",
                    "body": "I feel like I'm taking crazy pills. I saw these exact questions and these exact responses in 2017. We're all still here.\n\nNothing will happen. It cannot happen here.",
                    "score": -35,
                    "replies": [
                        {
                            "author": "Slowly-Slipping",
                            "body": "Yeah people would have said the same about the US president betraying all of our allies,  putting tariffs on all of our allies, threatening to invade our allies, and destroying NATO. Suggesting such a thing in 2014 would have made you seem mentally unstable. \n\nBut here we are, homie. It *is* happening here.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "WavesAndSaves",
                                    "body": "What are you talking about? Trump has been talking *for years* about getting other NATO members to increase their military spending. In what way is that \"destroying NATO\"? That's like...the exact opposite of destroying NATO.",
                                    "score": -29,
                                    "replies": [
                                        {
                                            "author": "Slowly-Slipping",
                                            "body": "He's threatening to invade our allies. That's the end of NATO. What do you think threatening to invade our closest ally does? When we actually do it, what'll be your mewl then? \n\nWhere's your defense of the tariffs you would have said were impossible last week, hmmm?  How about the purge of the FBI, hmmm? Any words for the erasure of officers who he didn't like in the military? No? How about Musk having access to the entirety of the DOT, that ring any alarms? \n\nBut noooooo, it can't happen here because reasons and stuff\n\nEdit: disingenuous coward blocked me. For those reading this, these people are intentionally trying to get you to bury your head in the sand. They want this to happen, they're agents of misinformation to get you to sleepwalk into fascism.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "WavesAndSaves",
                                                    "body": "> you would have said were impossible last week\n\nI wouldn't.",
                                                    "score": -15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Donny-Moscow",
                            "body": "So your assertion is that it can’t happen because it’s never happened here before?",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "UncleMeat11",
                            "body": "Trump's criminal stealing of the 2020 election with fake electors was stopped by just a very small number of people. They all are no longer in those same positions today.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "DontEatConcrete",
                            "body": "> Nothing will happen. It cannot happen here.\n\nGosh, this is naive. I have nothing else to really ad. Terribly naive. Words echoed throughout history by those who found themselves with a Pikachu face standing in front of a mass grave in front of a rifleman.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "ManBearScientist",
                            "body": ">It cannot happen here.\n\nThat exact sentiment is why it will. The only thing that stops it is active, constant vigilance. Americans don't have vigilance, they have apathy. They believe it can't happen here, so it isn't necessary to guard against it.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "WavesAndSaves",
                                    "body": "It cannot happen here.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "ManBearScientist",
                                            "body": "That exact sentiment is why it will.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Interrophish",
                            "body": "He did put unmarked federal agents in cities last time to snatch protesters off the street.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WavesAndSaves",
                                    "body": "Nah. It cannot happen here.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "WavesAndSaves",
                                                    "body": "Not here. If it could happen here it would have happened already.",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PanickinAnakin_",
            "body": "There’s a lot of discussions internally from higher level leaders about reminding service members that their oath is to the constitution and not a person or political party. I could very well see leaders getting removed from service for not obeying an order, similar to how people were removed from service for the COVID vaccine. My concern is that they will look to rewrite what is considered constitutional to fit their political agenda. I like to think we will oppose unconstitutional actions but I also couldn’t fathom Trump winning this time either.",
            "score": 4,
            "replies": [
                {
                    "author": "EmotionalAffect",
                    "body": "Trump will be overthrown before too long.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "violetlightbulb",
            "body": "I don’t think people realize how many service members were against a certain president the first time (including service members in power) and how many MORE are against him now. \n\nThe military is made of up minorities, people with backgrounds in low income families / areas, women, and LGBTQ+ personnel. And the cis white males are surrounded by these people, so more often than not they become great friends with everyone and learn a lot. \n\nIt’s a beautiful thing about the American military that isn’t often realized. \n\nThe problem is that there is a deep dedication to the president within the military (obviously) and an even more deep dedication to following orders. In short, it will be entirely up to the top people in charge. 18 year old kids probably won’t be able to resist much without being thrown into military jail, facing military charges, and so on. The members of the military are beholden to an entire separate set of laws, 24/7. \n\nIt would be interesting to see what happens. One thing is for sure though, they would be absolutely *pissed* and, if it continued for a long  time, that president wouldn’t have a strong military for long. Not to mention recruitment would be decimated.",
            "score": 21,
            "replies": [
                {
                    "author": "HungryHobbits",
                    "body": "Thanks for this. \n\nComments like this in the thread have re-framed my (ignorant) perception of who the military is comprised of.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DontListenToMe33",
            "body": "I have lost faith in people to do the right thing.\n\nIf ordered to arrest politicians, judges or shoot at protesters, I think many in the military would comply with those orders.",
            "score": 5,
            "replies": []
        },
        {
            "author": "tosser1579",
            "body": "In theory, they would follow their oaths. \n\nIn practice, the POTUS isn't following his so expecting anyone else to is a bit hopeful.  Every member of Trump's government places loyalty to Trump over any pesky thing like an oath or a old, moldy, sheet of paper.",
            "score": 5,
            "replies": []
        },
        {
            "author": "shep2105",
            "body": "Isn't this happening right now? Isn't this exactly what he is doing?\n\n\nI keep hoping for a military coup.",
            "score": 4,
            "replies": []
        },
        {
            "author": "llordlloyd",
            "body": "History shows those with the guns will support fascism unless the soldiers are unpaid and/or starving.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ceccyred",
            "body": "I expect it would be a mixed bag. Like the civil war was. Some would draw the line at killing their own family and friends. Eventually people would stand up and say enough is enough. Like they did in the civil war. About 3 million military persons among 300 million people, it's not hard to see who would win. Then take into account that not all the military people would go along with the fascist takeover. If you rile up the American people, you do so at your own peril. Make no mistake, the thought of this keeps the billionaire's awake at night.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ptwonline",
            "body": "1. Military leaders would already be loyalists to the President\n\n2. It would be preceded by massive propaganda to rationalize the need for it or to help disguise their true intentions, and so the military members would be more likely to go along with it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "1lazygiraffe",
            "body": "It's already happening. Look at the executive orders. Look at the cabinet nominations. Look at the firings. Look at how the Republicans are allowing violation of constitutional law and overstep without stopping. When Obama was president if he farted and the smell blew in their direction he would be blasted in the news and facing litigation.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ConsitutionalHistory",
            "body": "Sadly... I fear our military is infiltrated by a 'fifth column ' o trumpets.  I hope I'm wrong but I'm sure Germans in 1930s hoped they were wrong too",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheyGaveMeThisTrain",
            "body": "axiomatic yoke repeat cause north include subtract butter follow mysterious\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 3,
            "replies": []
        },
        {
            "author": "xeonicus",
            "body": "In Trump's first term, you still had top military brass like Mark Milley who were willing to see rationality, hold the constitution above Trump, think critically, and even criticize the president.  I think influential people like that go a long way towards making the military fall in line.  They are well respected and not politicians.\n\nAnd that's exactly why Trump went after him.  And the instant Trump was inaugurated, he ordered Pete Hegseth to get rid of Milley.  He was one of the only top military brass that had demonstrated any resistance to Trump.  It's part of the current strategy to ensure only loyalists exist in every area of the government.  They are getting rid of anyone that is not on board.  \n\nThis tells me that if Trump attempts another coup, there will not be anyone in the military top brass speaking up.  Without a voice, it will fall in line.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lime_solder",
            "body": "They would follow orders. Blatantly illegal shit is happening right now and nobody's doing jack shit about it. Why would the military be any different?",
            "score": 13,
            "replies": [
                {
                    "author": "SmallRocks",
                    "body": "You think service members would follow an order to hurt their own countrymen?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "foul_ol_ron",
                            "body": "It wouldn't be their countrymen.  Trump would describe them as terrorists, insurrectionists, renegades etc. Then service members can rationalise that they're fulfilling their oath.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "101ina45",
                            "body": "Yes. I do think they would follow orders.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "bananaboat1milplus",
                            "body": "Not \"would\". \n\nThey ***have***, and will again. \n\nThe Haymarket Affair happened \n\nThe Great Railroad Strike of 1877 happened \n\nWounded Knee happened \n\nThe Homestead Strike happened \n\nThe Lattimer Massacre happened\n\nBlair Mountain happened\n\nThe Paint Creek Mine War happened\n\nThe Bonus Army Incident happened\n\nAthens, Tennessee happened\n\nKent State happened\n\nJackson State happened \n\nThe Orangeburg Massacre happened\n\nThe MOVE bombing happened \n\nWake up.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "arobkinca",
                                    "body": "Most of those are police actions.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Soldiers, like every other American right now, might be disapproving, but still comply. Nobody has any will to try to make a change or stand up for something, myself included. I can barely will myself to eat anything let alone create organized civil disobedience",
            "score": 3,
            "replies": []
        },
        {
            "author": "Enjoy-the-sauce",
            "body": "Unfortunately, I imagine Trump could just keep firing military brass until he had nothing but General Flynns left, and then they would do whatever he wanted, laws be damned.  There’s a lot in our system that depends on niceties and norms and not being outright shitty.  And… then we got this orange orangutan with a bad combover who only thinks of himself.  It won’t end well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "slo1111",
            "body": "After they complete firing those not aligned they will fully be in Trump's pocket.  Military isn't gonna help anyone but authoritarians, partly because it is a very authoritarian organization and all it takes is getting the leaders of it backing the same orders.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SunderedValley",
            "body": "I think most people in the military today see it as a way to escape poverty or deal with personal bereavement. Higher level ideals play into it about as much as working in a liquor store or working in the arms industry. It's just something that puts food on the table. This applies especially to the air force and navy.  Lots of people there fall into the \"gifted but not internally motivated + too socially awkward to make it past civilian HR\" camp.\n\n\nPlus. Uh. Well. This aren't people with many attachments outside their jobs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MsAgentM",
            "body": "I think the best we could hope for is a split. Also, based on psychological studies, people tend to follow orders, even really bad or unethical ones. \n\nThe country voted in a mad man. Military members tend to lean right. Also, most are really young, under 25. Some may speak to, but they will probably be pushed out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "swagonflyyyy",
            "body": "I think Trump will just fire them and replace them with soldiers who will.\n\nHe already started with leadership, now he will work his way down and replace good men with thugs and the like because they will do what he says.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Greyachilles6363",
            "body": "I suspect what will happen is the military will be cleansed (very slowly) of people who feel and think differently so when the hammer comes down it will be full of loyalists.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bones_bones1",
            "body": "The most likely result would be a fracturing of the armed forces. Large swaths would stand down and new units would be created out of those still willing. There will always be some willing to go along with whatever.",
            "score": 2,
            "replies": []
        },
        {
            "author": "IndustryNext7456",
            "body": "Knowing a couple, they are itching to shoot civilians. I've never seen it this bad. Police, military, all waiting to try their hardware against civilians. We've not had a war for awhile, is my theory.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alert_Illustrator484",
            "body": "Sadly, I think we are seeing the answer to your question play out right now, and it doesn’t look favorable for humanity.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bio3224",
            "body": "The majority of cops, military members, especially men, 100% support being able to fight and attack civilians on American soil. And that’s not even counting the racists, and the pseudo military Chad’s who are going to come out guns blazing because they’re given the opportunity to not attack other people.\n\nIf martial law were to be declared, I won hundred percent guarantee those tanks would be back rolling through the streets, curfews would be in effect, and anybody caught doing anything even remotely in opposition to the supreme word, would be shot with rubber bullets, pepper sprayed, beat up, or kidnapped by the state. \n\nThe only kind of safe places might be very blue states with officials who could help protect the public, but that is where the federal forces and the military are going to be focused at.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tlgsf",
            "body": "Trump is already dismantling democracy and imposing authoritarian rule.  I don't see any sort of resistance from the military.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bananaboat1milplus",
            "body": "Most military is overjoyed at the election outcome. \n\nThey genuinely believe the country was plunging into pure anarchy under Biden - completely open doors MILLIONS of foreign murderers walking the streets, children being abducted from their bedrooms at night and forcefully given gender reassignment surgery, total removal of white people from TV and movies sending thousands of white actors homeless.\n\nThey spend so much time on-base - away from the outside world - being fed this bullshit by Breitbart etc that they don't see how ridiculous these claims are. It's all they have to go off. \n\n\nThey will side with Trump. \n\nMark my words. \n\nSet a remindme.",
            "score": 9,
            "replies": [
                {
                    "author": "BUSY_EATING_ASS",
                    "body": ">They spend so much time on-base - away from the outside world - being fed this bullshit by Breitbart etc that they don't see how ridiculous these claims are. It's all they have to go off.\n\nYou're describing the lower enlisted more than the officer corps and general staff.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "bananaboat1milplus",
                            "body": "Irrelevant. \n\nHalf the army siding with a dictator rather than the whole army is still self-evidently unacceptable.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "BUSY_EATING_ASS",
                                    "body": "Definitely do not think the entire enlisted force would side with Trump and turn traitor lmao. The entire enlisted force isn't even conservative.  \n  \nI mean no disrespect but that's not even how the military is organized.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "bananaboat1milplus",
                                            "body": "You're missing the point. \n\nIt's not like millions of servicemen will willingly admit they are evil like it's Marvel's Hydra.\n\nThey don't see things like us or most people on reddit, where Trump is the one harming America. \n\nIn their view they are siding with Trump as the good guys saving America from an ongoing attack via communists, woke, violent immigrants, whatever. \n\nThey aren't \"turning traitor\" in their eyes - the people telling them to stop are. \n\nRegarding your last point, the non-Trump voters (or at least the ones willing to speak up) in the military will be pushed out very quickly.\n\nJust like Trump is doing in the upper echelons of leadership currently. The firings and replacements will flow downstream. \n\nHe already started with trans service members earlier this week.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "BUSY_EATING_ASS",
                                                    "body": ">They don't see things like us or most people on reddit, where Trump is the one harming America.\n\n>In their view they are siding with Trump as the good guys saving America from an ongoing attack via communists, woke, violent immigrants, whatever.\n\n>They aren't \"turning traitor\" in their eyes - the people telling them to stop are.\n\nI was in the military during the Trump era. Uh no. A lot of conservative people, yeah, but no. No disrespect but from my first hand perspective this is just not correct. Like I said elsewhere, a Kent State type situation I can see, but what you're describing sounds like something out a movie and not how the military organizationally functions.\n\n>Regarding your last point, the non-Trump voters (or at least the ones willing to speak up) in the military will be pushed out very quickly.\n\nUntil the (surprisingly large remainder) will go \"nah how about you come get me though.\"\n\n>Just like Trump is doing in the upper echelons of leadership currently. The firings and replacements will flow downstream.\n\nLet me know what he does with the Joint Chiefs of Staff and let's revisit.\n\n>He already started with trans service members earlier this week.\n\nMost of the servicepeople I know rallied around them. Regrettably, the percentage of trans servicepeople are SUPER small (like less than a percent) to glean any meaningful projection about how a large scale purge would go. As far as I know, no actual servicepeople have gotten separated from active duty yet either.",
                                                    "score": 9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "gregkiel",
                                                    "body": "relieved point wakeful boat bake crawl gray wild memory instinctive\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PerfectContinuous",
                    "body": "RemindMe! Six months \n\nI believe you, by the way, based on my interactions with enlisted military. Not all, but many were way right of center.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "violetlightbulb",
                    "body": "Yeahhhhhh most service members don’t support him at all. So.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bananaboat1milplus",
                            "body": "65/34 bro. \n\nThe numbers prove you wrong. \n\nOne of the most pro-trump professions. \n\n[Here](https://responsiblestatecraft.org/veterans-vote-trump/)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "jlambvo",
                                    "body": "Served in the military ≠ active service members. It should come as no shock that aging boomer veterans skew Conservative like other aging boomers. The article you link to even notes that a survey of Iraq and Afghanistan veterans was basically dead split: \n\n>\"According to the poll, these voters were going **43% for Harris, 42% for Trump**, and 15% for a third party candidate.\"\n\nAnecdotally I've heard that the officer corps skews more liberal and enlisted go the other way.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "DrMonkeyLove",
                                            "body": "The officers I've known were all very well educated, well read, intelligent people. They also took their jobs very seriously so I can't imagine them just all turning their back on their oath to the Constitution.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "bananaboat1milplus",
                                            "body": "Fair call. \n\nThanks for this.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bradleyoilermfa",
            "body": "It will be elon who was not elected, hasn’t been vetted by the senate, or given security clearance by the FBI, who dismantles the government. He walked into the treasury department today and took control of the government’s ability to make all payments.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Successful-Coyote99",
            "body": "Trump installed a SCOTUS.  \n\nTrump got Roe V Wade removed. \n\nTrump took a court case to the Supreme Court that determined Presidential immunity. \n\nTrump rigged the 2024 election with the help of Musk.  \n\nThe dismantling of the government and our democracy is underway\n\nTrump walks away Scott-free. If anyone gets in trouble it’s private citizen Musk. \n\nHow did we not-see this cominG?",
            "score": 2,
            "replies": []
        },
        {
            "author": "607vuv",
            "body": "The United States military should fight the White House and Supreme Court. I bet our military would win.",
            "score": 3,
            "replies": []
        },
        {
            "author": "core72I_",
            "body": "if its done constitutionally nothing if its unconstitutional the national guard will protect the constitution",
            "score": 1,
            "replies": []
        },
        {
            "author": "jackiebee66",
            "body": "Well I think we’re about to find out. I can only hope the military does what it’s supposed to-which is an allegiance to the Constitution. Screw the dump. May he rot!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Final_Meeting2568",
            "body": "This is something I have thought about a lot. It actually goes to the real reason we have the second amendment. the founding fathers did not want a standing army because, knowing history, they did not want a military coup. It happens sooooo often that have a word for it . Thing I say standing in way, and it's actually terrifying, is that often times people that are attracted to the police or the military tend to be right wing Authoritarian followers. That is the problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrandeBlu",
            "body": "I’ve worked in the defense sector for 20years and I have worked with all services and all ranks from pfcs to generals and senior executives.\n\nI personally have zero concerns about any substantial coup or similar action.\n\nThe general reaction if receiving unlawful or bad orders would be to seek clarification.\n\n\nEdit: clarifying substantial - of course there’s always the possibility of someone unilaterally doing seething stupid while also being a member of the military.\n\nThats not the same thing as a coup - which btw I’ve actually lived through and have personally experienced.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IsoCally",
            "body": "America is a big country with a big military. Are you asking if Trump would just take federal control of states' national guard and order them to attack protesters, disperse state governments, or something else?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AngryTudor1",
            "body": "I'm not sure why this is posed as a hypothetical.\n\nIf you want to know what the military would do, just keep your eyes open- they would do exactly what they are doing right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "fitnesswill",
            "body": "In the Roman Republic, the Senate was able to muster a significant number of forces. \n\nWhere is Congress in this scenario?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Offthetopofmyhead1",
            "body": "They won’t dismantle it they’ll integrate. It’s all about the verbiage. Army is for combat. National guard is for crowd control. Yet both military. Double check the chain of command when a national emergency is declared because that chain of command stays that way until an EO is signed removing the emergency. So on 3/13/2020 one was declared if it wasn’t removed via EO it’s been in place. The pentagon runs military federal emergency polices.\n\n**funny part is you can have an emergency for anything except terrorism",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontEatConcrete",
            "body": "There is no way to know.\n\nWhat I do know is that america has incredibly quickly embraced authoritarianism. There is no way one can confidently say that the military will deny orders to do things like blockade canadian ports just because trump had a bad morning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PuzzleheadedHumor450",
            "body": "Who would win in a fight between the US Army and the Secret Service when they have had enough of dictator Drump???",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intrepid_Whereas9256",
            "body": "There will be dissenters throughout the military if Trump tries to use them to impose his agenda. The key is whether they'll be in a high enough position to affect it.\n\nConsidering the intelligence needed to run the high tech gadgets, I would think a few smart registers there can have a huge impact. Rifle carriers, less so. Females? Likely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fafnir26",
            "body": "Well a friend once told me soldiers are despite their violent profession and oath cowardly yes men. I don´t know if I would go that far, but I am not optimistic when it comes to their loyalty towards the people over Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManBearScientist",
            "body": "One of two things would happen. A military coup, or the military acting as brownshirts.\n\nAmerican is a corrupt and apathetic country with flimsy institutions. The latter is much more likely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jaml123",
            "body": "Like everywhere else military leaders follow the money. If the bribes are high enough they have no problem slaughtering their own population. You really think they give a f. about an ancient piece of paper?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dzoefit",
            "body": "Doesn't seem likely to happen.   Turn the spigot on the war machine to off.  I think that would bring about a reaction from the military.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MRToddMartin",
            "body": "There has to be checks and balanaces to prevent this ? Don’t we have 3 branches of government for this reason. One can always check the other? Pseudo rock, paper, scissors?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealisticForYou",
            "body": "What if Trump \"creates\" his own military? \\*\\*\\*\n\nWith those Jan6th criminals that Trump recently released, would Trump attempt to create his own Military to officially overthrow democracy?? It would take a couple of years for Trump to create his own militia, but he could do that, no doubt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Michaelmrose",
            "body": "If you look at the fact that a solid majority of those who have served voted for said person after he already said he was going to do those things I think its safe to say that the majority of veterans and service members are traitors.\n\nThis is especially true for\n\nwhite men 18-44 60% Trump\nveterans 61% Trump\n\n\nWhite Men and Vets are both far redder than average. Since veterans isn't solely composed of white men looking at active service for instance  30% racial minorities roughly 20% female (varies by branch)  it is reasonable to suppose that white men who overwhelmingly fill officer roles as the intersection of those above are liable to be redder than either category above.\n\nIt is also reasonable to suppose that the entirety of the upper echelon will shortly be replaced by loyalists. What will happen is that bad behavior and harm to the people will lead to violence by at least a tiny number of individuals. This will be used to justify greater harm to the public which will inspire at least slightly more violence which justifies more force to suppress it.\n\nIf you look at calls by Trump to deport Americans and previous requests to shoot peaceful protesters this leads to concentration camps and murder and those in the military who wont go along with it face decades in prison and the real risk that that it won't be overturned in their lifetime.\n\nThe net is that if you see someone in a US military uniform you should think the same as if they were wearing an SS uniform with a swastika. They are your enemy.\n\nhttps://www.nbcnews.com/politics/2024-elections/exit-polls\nhttps://www.pewresearch.org/short-reads/2024/09/30/military-veterans-remain-a-republican-group-backing-trump-over-harris-by-wide-margin/\nhttps://www.cfr.org/backgrounder/demographics-us-military",
            "score": 1,
            "replies": []
        },
        {
            "author": "skyfishgoo",
            "body": "the military will only protect their own interests, not ours.\n\ni would not look to them for help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComprehensiveHold382",
            "body": "As more and more Republicans are just proving themselves to be Trump Supporters, and anti-government, the military will side with what ever person or group who is going to keep the government existing, \n\nIn the military it will be the person in the highest office who will be Anti-Trump, and who ever the dems says is the leader.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Employ922",
            "body": "Keeping it hypothetical xD  \nIn all seriousness I believe (hope) a coup would be enacted before a situation as such become reality.   \nThe US military is an immence force, hence the hope.   \nBr Europe",
            "score": 1,
            "replies": []
        },
        {
            "author": "All_is_a_conspiracy",
            "body": "He wouldn't stand up and say \"hey peeps. I'm gonna just erase democracy and become an authoritarian, k?!\" He would either lie for a while about crime statistics to frighten people, and start riots everywhere or systematically impoverish people by destroying the economy and people's sense of security.\n\nThen the human beings in the military, lead by men he appointed, would feel like they were just securing a riot zone. Or securing a border. Or securing the white house. Or securing a corporate headquarters that has protestors in front of it. \n\nThen they'd just follow orders to keep from being court marshaled. Then they'd follow orders just to not be on the powerless masses. Then they'd follow orders because they'd see they were still getting paychecks when millions of us are out of work, starving...and it goes on and on.\n\nSo yeah. The military will absolutely not in any way, shape, or form stand up for democracy. They will survive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Probably, most of the military would follow the new president. The rest would join the rebels in the civil war.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BRICSTrend",
            "body": "Most in the military support him. Look at 60% of them as  the third reichs wehrmacht ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-League-1106",
            "body": "The thing I always think about, if there's a constitutional crisis (and it's more or less dead) why wouldn't states like California, Oregon and Washington or NY, Vermont and New Hampshire split off and become their own states/countries. \n\nIf the democracy dies, trump is likely to be incredibly unpopular (or anyone else trying to pull it off) wouldn't it make sense for the wealthier states to do their own thing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FauxReal",
            "body": "I used to think they'd uphold the Constitution. These days they'd probably start fighting each other based on the strongest leaders and the ideologies of the soldiers that align with them. Though most likely there would be some kind of purge of the military first to get rid of non-loyalist to the administration in power.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bizarre_Protuberance",
            "body": "Some principled service members would follow their oath.  Others would happily go along with it.  That's why the key is to corrupt the senior leadership, *which is precisely what Trump is doing*.  Rank-and-file soldiers are more likely to go along with the corruption if it goes all the way up the chain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rhinosaur-",
            "body": "Open your eyes. How is the military responding right now? There’s your answer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seongchun",
            "body": "Dictator Wealth Acquisition Methods\n\n[https://chatgpt.com/share/679e8120-a7b4-8012-8714-873ba6efb358](https://chatgpt.com/share/679e8120-a7b4-8012-8714-873ba6efb358)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guy0911",
            "body": "The answer lies in the heart of each service member.\n\nTrump will undoubtedly replace all military leaders with loyalists but forcing men and women who took an oath to defend our nation from all foreign and domestic enemies is another story.\n\nIf Trump tests the hearts and minds of the men and women who serve our nation, he will destabilize our military and invite China to waltz right in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Entrepreneur-9157",
            "body": "They’re trained to follow orders and they will. I wonder how the surviving Nazi soldiers felt years later?",
            "score": 1,
            "replies": []
        },
        {
            "author": "meatshieldjim",
            "body": "Smart generals would say there needs to be a political solution and go back to base.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dull_Conversation669",
            "body": "Prolly follow along, didn't the military purge anyone who resisted the mandated covid vax?  Those were likely the guys who would stand up for the constitution as they didn't seem to be just follow the orders kind of people.  Too bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beneficial-End7899",
            "body": "Each state, the judiciary, and the senate are the competing sovereign bodies to the president, and if they all say the U.S president is legitimate, the military has no basis in overthrowing him. Unless the president becomes a tyrant, this argument is unassailable, and the generals and admirals will likely follow suit, and the soldiers will get in line.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrsRBRandall",
            "body": "They would have protected the constitution before they were all purged and replaced with loyalists. Now there is not much hope of that happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ILoveMeerkats21",
            "body": "What do you mean “if?” It’s happening now. Your question should be ”will our military act to protect the Constitution?”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strict_Inspection285",
            "body": "The greatest crimes in the world are not committed by people breaking the rules but by people following the rules. It's people who follow orders that drop bombs and massacre villages.\nBanksy, Wall and Piece",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jess_me_nobody_else",
            "body": "That won't help. They'll make the actions nominally legal. Invoke the insurrection act or declare that some other law enables these acts, or The Supreme Court will declare them constitutional, as has already happened and will probably happen again.\n\nA lady on MSNBC who is an expert said that when dictatorships take over, you can't expect institutions to protect you. It's the institutions that they undermine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snoo-26902",
            "body": "It's the courts that will stop that if anyone. Trump can only do that with the aid of the Republican party and the SCOTUS.\n\n  \nThe Military doing it would mean a civil war.\n\n  \nThe American people are the most stupid people on the planet Earth to reelect this utter immoral moron Donald Trump to wreck the country.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zz-2",
            "body": "make signs; put them on overpasses, intersections, street corners etc\n\nDigital protest; comment on social media posts, news articles/videos \n\nCALL,EMAIL AND SEND LETTERS to the representatives....!!\n\n\nEmphasize that we need to check the budget LEGALLY\nRESPECT THE CONSTITUTION \nAND REMEMBER WE HAVE CHECKS AND BALANCES FOR A REASON \n\n\nTHIS IS NOT A PARTISAN ISSUE...\nAND WE SHOULD NOT LET IT DIVIDE US",
            "score": 1,
            "replies": []
        },
        {
            "author": "pickledplumber",
            "body": "Once the president uses one of the exceptions to the posse comitatus act like saying there's an Insurrection. I don't for a minute doubt the military would fire on civilians.  Where I think they would question things is if let's say they were ordered to wipe out a city. They'd come to their senses then I'd imagine. But depending on the forces of power at play. They could feel better them than me, I'm looking to survive this so they would go ahead.",
            "score": -1,
            "replies": [
                {
                    "author": "Knowledge_is_Bliss",
                    "body": "Kent State University. \"4 dead in Ohio\" can serve as a past example.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Mist_Rising",
                            "body": "Kent was national guard, state militia not military",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Knowledge_is_Bliss",
                                    "body": "Potayto, potahto.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sloowshooter",
            "body": "He is only going to keep those in the military that declare fealty to him and nothing else.",
            "score": 1,
            "replies": [
                {
                    "author": "Mist_Rising",
                    "body": "If the troops don't agree and Congress doesn't pass a law changing things, Trump can be stymed by the world's best word. \"No.\" \n\nTrump can threaten them all they want, they have both the law and the guns. Trump would have to find a legal reason to remove them, which for the record has to be laid out in the existing legal works. Trump's not really great with that, and SecDef is only a threat to a soldier if he's given an axe. \n\nThis actually goes for federal employees too, they have protections you wouldn't believe, which is why he wants to make it hell on them so they quit. Militaries are funny, it's harder to make them want to quit due to how hard it is to quit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Falcon3492",
            "body": "Soldiers take an oath to uphold the Constitution of the United States first and foremost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise_Trust_6369",
            "body": "I'm seriously worried about this and to understand this read about the [Butterfly Revolution](https://www.reddit.com/r/TwoXPreppers/comments/1if65qo/the_butterfly_revolution/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) and take action as they're probably going for the media next: [https://www.youtube.com/watch?v=5RpPTRcz1no](https://www.youtube.com/watch?v=5RpPTRcz1no)\n\nIt's important to keep in mind that people becoming informed is not enough since we're not voting. We have to get together and STAND UP to this somehow. In my opinion the best plan for right now might be:\n\n1. Tell as many people as you can both online and off ASAP\n2. Contact as many media sources as you can to spread the info faster\n3. We need some kind of reference point for the public to gather for discussion/protests. Given the info in this video, universities might be a good source for that so try to contact a few LOCAL COLLEGE(S) in your area to alert them to this info and encourage them to scheldule meetings for the general public if possible.\n\nWhen we gather we need to make things crystal clear that we are a DEMOCRACY, and freedom loving people in this country would rather declare war on Trump/Tech Bros rather than sit back and watch our country being taken over!\n\nP.S. I know some people are pessimistic but let's just try this first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mskmagic",
            "body": "This is easy. Imagine that Joe had been able to remove Trump from the ballot, jailed him, and declared MAGA a domestic terrorist organisation - none of which was out of the realms of possibility. The likely outcome would have been mass protest and some violence. Since the RNC is MAGA, no other candidate would have been acceptable to the voters - every candidate proposed would have had to publicly claim that Trump is the rightful candidate to even get the ear of MAGA.  In light of the violence Joe suspends the election and starts jailing right wingers for incitement of violence, hate speech etc etc - the heart of the RNC is smashed and the eventual Republican candidate is someone preapproved by the DNC in order to maintain the veneer of democracy. Joe continues to govern, or rather his handlers do through him, and begins the process of criminalising MAGA rhetoric and symbolism. Etc etc.\n\nIn this case the Military would do precisely nothing. They would watch it all and carry out Joe's orders.\n\nIt's a fantasy that the military in the US holds the executive to account. Only the judiciary can.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cknight13",
            "body": "It's going to be really hard to get the Pentagon to follow unlawful orders. Couple things.\n\n1. The oath officers take is to the constitution and never mentions the president. Enlisted men take a different oath than the officers and the officers understand on a deep level what that means\n\n2. Every General needs to be confirmed by the Senate. Remember the jackass football coach from Alabama holding up confirmations of promotions of all those generals? It was like 200 couldn't get through for over a year? Yeah well the Democrats can do the same thing. So even if Trump appoints generals they can't be put in positions of leadership until they are confirmed\n\n3. Joint Chiefs etc when they leave go back to being 2 star generals and are not just promoted to 5 stars. The Joint Chiefs and Generals can only be fired by a president during what is called a state of war. Since we finally pulled out of Afganistan we are no longer in a state of war and the most a President can do is ask for their resignation. They can ask for a hearing which they have 6 months to determine if they should be removed. That being said most generals would resign but any general that is qualified to take over is going to be just like the current ones. \n\nThis shit wouldn't fly with the military",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ubputinsbtch2025",
            "body": "I started investigating if American citizens could demand military intervention. \n\nOf course it won’t happen because the Republican/Christian Extremists now own all branches of Federal Government. But it would hurt to start calling ALL Senators and House Representatives (R or D) demanding military removal of Trump/Vance all Trump executives and a recount. It might also ferret out the sleeper cells in Congress and throughout the country. Let them face our military.\n\nYes, American citizens can request a military intervention by contacting their elected officials. They can also ask their elected officials to make a Congressional Inquiry on their behalf. \n\nHow to request a military intervention \n\nContact your elected officials\nAsk them to make a Congressional Inquiry on your behalf\n\nWhat factors are considered when deciding on military intervention? \n\nNational security interests: The intervention should defend national security interests.\nPublic support: The intervention should have congressional and public support.\n\nMilitary goals: The intervention should have clearly defined, decisive, attainable, and sustainable military goals.\n\nAbility to meet other security commitments: The intervention should not jeopardize the ability to meet more important security commitments.",
            "score": 0,
            "replies": [
                {
                    "author": "DrMonkeyLove",
                    "body": "There is no Constitutional means for the military to remove a president. What you are suggesting would be a military coup.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "iFlashings",
            "body": "Considering most of the military is hardcore MAGA... then you'll probably get an answer you won't like to hear. I'd be shocked if our military actually follow their oath and not the president, but I'm not getting my hopes up.",
            "score": 0,
            "replies": [
                {
                    "author": "DrMonkeyLove",
                    "body": "They aren't hardcore MAGA though.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "iFlashings",
                            "body": "And your proof is? Most of the military voted overwhelmingly for Trump that's been reported. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BUSY_EATING_ASS",
                                    "body": ">\"According to the poll, these voters were going **43% for Harris, 42% for Trump**, and 15% for a third party candidate.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jestenough",
            "body": "Isn’t now the time to invoke the 25th Amendment? If not now, when would it ever apply? We should not wait for and defer to Trump’s military.",
            "score": 0,
            "replies": [
                {
                    "author": "dynodebs",
                    "body": "Why do you think Vance isn't the plan to implement Project 2025?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jestenough",
                            "body": "He may be the plan, but therein lies part of our challenge. We can learn from the enemy, and become their “worthy adversary.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mist_Rising",
                    "body": "Do you understand how the 25th amendment works? Because it doesn't sound like you do. It's not a \"say the magic word and president goes poof\" trick. You can't say \"25th amendment 25th amendment 25th amendment\" and Trump just magically vanishs like Beetlejuice.\n\nThe 25th only temporarily removes the president until the president declares he's fit again. That's it. That's why it's most common (only!) use has been when a president themselves uses it to pass it to the vice president while they have medical procedures done. \n\nSo if for example the current cabinet declared Trump unfit under the 25th, Trump merely needs to say \"I am fit\" or something to that form and he's back and ready to go. Probably purges his cabinet though. Vance wouldn't even get to sit in the cool chair.\n\nIf you want to remove the president you need the House to impeach (50%, nearly doable) then the Senate to Remove at 2/3rd. That one is a tough challenge. Republican couldn't even pull it off with a supermajority and a clearly violated law (unconstitutional but violated), not much chance of it currently.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jestenough",
                            "body": "Yeah, thanks for the details, Chuck Schumer. This is no time for bean counters, but it is time for responding in kind. The rule of law is in a coma, and (apologies for mixing metaphors) it’s time to break the fire emergency box. The founders gave us this Amendment and its accessory tools, but those are not exclusive when it comes to keeping the Amendment, the Constitution and our country alive.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Common-Ad6470",
            "body": "Depends.\n\nIf the constitution is ‘amended’ by the standing President that *he* and he alone has absolute power over the military and government, which will happen if Trump’s Nazi re-run of history is allowed to happen, then the military *will* follow the President’s orders.\n\nGod help us all.",
            "score": 0,
            "replies": []
        },
        {
            "author": "saylr",
            "body": "Former President Biden was asked this very question and his reply was C'mon Man! followed by a story about leg hair.",
            "score": 0,
            "replies": []
        },
        {
            "author": "dyttle",
            "body": "We have a voluntary professional military. So does the constitution pay their wages?",
            "score": -1,
            "replies": [
                {
                    "author": "Prostonasratov",
                    "body": "wages are paid out of taxes. And the system is protected by the constitution.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dyttle",
                            "body": "Fair point about taxes but don’t forget the constitution is just a piece of paper. I mean, not to me, but to the people in power right now it is.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "doubleohbond",
                                    "body": "I imagine for those willing to die for their country, the constitution isn’t just a piece of paper.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "I_luv_sneksss",
            "body": "I concur the military would rebel under Trump, but they would fold like cheap suit under a competent dictator. Following orders for its own sake is so etched into their psyche I’ve seen it follow them deep into their post-service government contracting careers.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Prostonasratov",
            "body": "To counter the president (executive branch), there is a legislative and judicial branch that will overturn most of Trump's decisions. This is democracy. \nThe army will most likely be loyal to the constitution and Trump won't get much support even in the Republican party (which will have Trump's opponents in case of conflict). Trump will simply be ousted like Peru was in 2022.\n\n\n\n\nYou have too bad an opinion of Trump, he's a common populist who talks a lot and does little. ",
            "score": -2,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "Congress is officially MAGA since the Republicans are terrified of Trump and hold a majority. The Supreme Court has at least 3 Trump bootlickers, which is way too close a proportion for me. As for Trump “doing little,” his tariffs are about to introduce an economic cooling if not outright recession, and he’s firing a major portion of the people who keep our nation’s logistics operating. That’s all just in his first *week*.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Mist_Rising",
                            "body": ">Congress is officially MAGA since the Republicans are terrified of Trump and hold a majority.\n\nMaybe, but Trump is actively hurting the one thing even Republicans in Congress may care about. Donors. Big donors. Business if you will.\n\nThe tariffs are hurting companies, and those bad boys pay congresses wages if you will. Doesn't matter who backs you at primary if the donors fuck you.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "Agreed, but seeing the lightning-fast damage Trump is doing as we speak, the country doesn’t have time to wait until the donor class decides to push back.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Decent-Inevitable-50",
            "body": "Nobody is dismantling democracy or imposing any authoritarian rule or marshall law .. live your life",
            "score": -2,
            "replies": [
                {
                    "author": "HungryHobbits",
                    "body": "Isn’t that what a lot of civilians said in democracies that were overthrown by authoritarian regimes?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Unchainedboar",
                            "body": "so many peoples response is, \"it wont happen\" despite the insane amount of similarities between what DT has been doing and authoritarians in history have done through out history.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alive_Shoulder3573",
            "body": "Not sure what you are talking about.  the Biden administration allowed states to remove voter protections strengthening the trustworthiness of the electoral process.\n\nCalifornia made it illegal to ask for voter ID, other states made it ok to ballot harvest, making the process even more untrustworthy.\n\nAnd the military along with the media allowed these things to happen without a peep.\n\nSo, if those forces are willing to allow democracy to military do anything?",
            "score": -3,
            "replies": [
                {
                    "author": "Little_Study_57",
                    "body": "It’s a straightforward question. Not sure why you're pretending not to understand. The topic is how the military would react in a scenario where a president attempts authoritarian rule. Your response doesn’t address that at all.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Little_Study_57",
                                    "body": "You're deliberately avoiding the question. \n\nThe scenario is clear: If a president attempted to impose authoritarian rule, would the military uphold the Constitution or follow orders? Pretending the question is unclear doesn't change that. \n\nWaco was a law enforcement operation led by the FBI, not a military action, so your example is factually incorrect and irrelevant. The Posse Comitatus Act restricts military involvement in domestic law enforcement and the military was not ordered to attack civilians there. \n\nIf your actual answer is that the military would follow any order, even an unconstitutional one, then say it outright instead of deflecting with unrelated events. Otherwise, engage with the real question or move on.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Alive_Shoulder3573",
                                            "body": "Waco was Not a law enforcement action. How many law enforcement agencies use army tanks and poisonous gas?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Little_Study_57",
                                                    "body": "Waco WAS a law enforcement action led by the ATF and FBI, not the military. Using military equipment doesn't make something a military operation. By that logic you're saying every SWAT team with an armored vehicle is \"the military\". And also CS gas isn't \"poisonous gas\" it's riot controlled gas used by police worldwide. \n\nUnless you can prove that the FBI and ATF are part of the military, Waco was a law enforcement raid that used borrowed military resources which is a big difference. \n\nNot saying it was a good thing, that whole raid was a disaster.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Alive_Shoulder3573",
                                                            "body": "You admit they used the army and their resources. And how do you justify using poisonous gas against American citizens?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Little_Study_57",
                                                                    "body": "We are going in circles here, it doesn't make them the military because they used military equipment. They didn't use poisonous gas.. they used CS gas.. which is not considered poisonous.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Alive_Shoulder3573",
                                                                            "body": "It was the military alongside the fbi,  so, it was the military used against American citizens\n\nThe military used tanks, helicopters, armored personnel carriers, and weapons during the Waco siege in 1993. The FBI also used modified firearms, silencers, and hand grenades. \n\nTanks \n\nCEVs: Five modified Patton tanks called Combat Engineer Vehicles\n\nM2 Bradley Fighting Vehicles: Ten M2 Bradley Fighting Vehicles\n\nM88 tank retriever: One M88 tank retriever\n\nM1A1 Abrams tank: One M1A1 Abrams tank\n\nOther weapons Machine guns, Semiautomatic firearms modified to fire in full automatic mode, AR-15 lower receivers modified to fire in full automatic mode, Silencers, and Hand grenades. ",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Little_Study_57",
                                                                                    "body": "I never said Waco was a good thing. The whole situation was a disaster, full of bad decisions and unnecessary deaths. But just because it was terrible doesn’t mean you get to rewrite history and call it a military operation when it wasn’t.\n\nYou keep listing off military equipment like that somehow proves the military was running the operation. Equipment doesn’t equal command. The ATF and FBI led Waco, not the military. They borrowed equipment under federal programs, just like how police departments get military surplus gear.\n\nThe military wasn’t calling the shots. The FBI Hostage Rescue Team was. Unless you can show me an Army general giving orders instead of the FBI, all you’re doing is listing vehicles like that changes anything.\n\nAnd acting like the FBI using modified firearms and silencers is some kind of smoking gun is just laughable. Tactical units use that kind of equipment all the time. You think they’re showing up with hunting rifles? Come on.\n\nYou can be upset about what happened, and honestly, you should be, but at least stick to the facts instead of pushing a false narrative. Try using critical thinking instead of just copy-pasting a weapons list like that proves something it doesn’t.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Alive_Shoulder3573",
                                                                                            "body": "My point was and still is, you can't be taken seriously if you never complained when liberals did the same or worse when they were in power\n\nAnd the items the military\"leant\" the fbi makes it sound like the army wasn't there, only their equipment, which is faulty reasoning because I remember seeing pics of army personnel in their tanks waiting to go in.\n\nAnd if your gas, when used, killed a bunch of kids, then your gas was/is poisonous.\nAll they had to do was wait in town for Karesh to go into town, which he did often, and then arrest him",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Little_Study_57",
                                                                                                    "body": "You're throwing out a lot of different arguments, but none of them actually prove your point. \n\n>You can't be taken seriously if you never complained when liberals did the same or worse\n\nThis is just lazy whataboutism, if something is bad, it's bad no matter who does it. Trying to frame this as a partisan issue just proves you care more about scoring political points than discussing the facts. \n\n>  \nThe military \"leant\" the FBI equipment, but I saw pics of Army personnel in tanks\n\nFirst off, yes, the military provided equipment through standard programs that also give gear to police departments. That doesn't make it a military operation. Military personnel were present for advisory roles, not command. Unless you can show actual military leadership running the raid instead of the FBI all you're doing is listing vehicles and acting like that proves something it doesn't. \n\n>If the gas killed people it was poisonous\n\nThat's not how definitions work. CS gas is classified as a riot control agent and not a poison. Just because something has deadly consequences in confined spaces (especially with fires involved) doesn't mean it was 'poisonous'. You might as well call water poisonous because people drown in it. \n\n>They should have just waited for Koresh to go into town and arrested him.\n\nSounds nice in theory, but in reality, law enforcement had been investigating Koresh for months. He knew they were watching and it's not like they didn't consider arresting him outside the compound. Acting like this was some easy, obvious solution ignores the complexities of the entire situation. \n\nYou're more interested in 'winning' an argument than actually discussing the facts. Every time one point is debunked you move the goalposts instead of engaging with what's being said. If you actually cared about what happened, you'd stick to one argument instead of shifting around to try and 'win'.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Alive_Shoulder3573",
                                                                                                            "body": "The gear that some police department gets isn't being used by the army personnel, v like it was at Waco (can you name the last unit that actually used any for riot control?)\n\nLibs are the ones that use whataboutism all of the time whenever they/you are confronted by anyone for doing something you shouldn't be found, so yes, it is OK to use it. And why is it you libs never point out when the left are the ones doing the bad things? \n\nWhen was the last time you saw anyone use gas against any riot? \n\nThose using the gas knew what it could do and the Clinton admin still used it, killing a bunch of kids.  face it,  you can't defend their use of army personnel, v army tanks and gas against American citizens. If you think it is OK, name a place where those things have been used since our before against Americans",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Entrance9308",
            "body": "This is a ridiculous concern. We still have the rule of law in this country.",
            "score": -5,
            "replies": [
                {
                    "author": "Assassin217",
                    "body": "if that was true then Trump would be in jail.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RealisticForYou",
                    "body": "No we don't \\*\\*\\*\\*\n\n\"On July 1, 2024, the Court ruled in a 6–3 decision that presidents have absolute immunity for acts committed as president within their core constitutional purview, at least presumptive immunity for official acts within the outer perimeter of their official responsibility, and no immunity for unofficial acts\".\n\nTrump could claim that military intervention is necessary because he says so. He would be immune from everything.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}