{
    "title": "Can we make it back from misinformation and conspiracy?",
    "author": "JayReddt",
    "subreddit": "PoliticalDiscussion",
    "rank": 23,
    "score": 170,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 161,
    "url": "https://www.reddit.com/r/PoliticalDiscussion/comments/1ik40fs/can_we_make_it_back_from_misinformation_and/",
    "id": "1ik40fs",
    "selftext": "I labeled this as US politics but I think this applies more broadly.\n\nWe have seen immense misinformation and conspiracy. It's to the point that there are two world views to literally everything that happens. Somehow, objectivity has been pushed to the side. I won't even talk about the most basic news events with anyone but close friends and family for fear that somehow it will be politicized. The conspiratorial thinking has been injected into everything. It's as if certain groups live in entirely different worlds.\n\n But can we be reeled back from all this? It only seems to be accelerating. I am trying to be optimistic. I want to see a path forward for regular discourse and objective truth. I am finding it very hard to see the light.\n\nHas this ever been experienced in the past? On such a large scale? History repeats itself. So what has happened? The internet and connectivity and manipulation of our minds seems a bit unprecedented. But maybe there's a path out of this that has been paved before.\n\nWhat do you think?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "[A reminder for everyone](https://www.reddit.com/r/PoliticalDiscussion/comments/4479er/rules_explanations_and_reminders/). This is a subreddit for genuine discussion:\n\n* Please keep it civil. Report rulebreaking comments for moderator review.\n* Don't post low effort comments like joke threads, memes, slogans, or links without context.\n* Help prevent this subreddit from becoming an echo chamber. Please don't downvote comments with which you disagree.\n\nViolators will be fed to the bear.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PoliticalDiscussion) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Darth-Shittyist",
            "body": "Misinformation is the ultimate weapon of demagogues. It took a lost war and the complete destruction of the country for reality to break through the web of lies and misinformation in the third Reich. Reality needs to be forced on people in a way that is inescapable. I fear that a similarly earth shattering event will be necessary to snap people out of this propaganda haze.",
            "score": 101,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "Honestly I don’t really see any other way this likely plays out. The US is actively rejecting the security coalition that defeated demagogues 80 years ago, not to mention dismantling its own democratic institutions and framework.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Foolgazi",
                                    "body": "Whatever you say komrade",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Foolgazi",
                                                    "body": "MAD is obsolete thinking. NATO is relevant and necessary outside of the old Cold War framework. And anyway I was referring more to the trade/security partnerships the US has with longstanding allies (which Trump is blowing up) than strictly NATO.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kallory",
                            "body": "I'm not convinced you're wrong but I'd like to know why you're convinced that democracy is being dismantled. I have a partial theory that most people aren't paying enough attention for that to happen, and that the US is just a massive machine right now with various entities cashing what they can, when they can, because they can. As long as they can keep that going, everything is fine.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "snakshop4",
                                    "body": "I'm not OP, but stacking the SCOTUS, removing IGs, and filling them the FBI, CIA, Justice Departments and every other relevant guardrail with sycophants and true believers seems like an excellent start. Also, allowing the world's richest douchebag to pour millions into elections  and threatening to primary all the Congressional assholes if they put up even the mildest protest when the Executive branch completely disregards Article II is right up there.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "Foolgazi",
                                            "body": "All that plus the current sitting President blatantly lied about losing the previous election, thereby taking a giant dump on the democratic institutions he was sworn to protect and encouraging distrust in it.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "author": "hahayes234",
                                                    "body": "He’s lied something like 30,000 times in the first 4 year term. Chances are if his lips are moving he’s lying.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "snakshop4",
                                                    "body": "It's hard to remember all the things.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Knowledge_is_Bliss",
                                    "body": "This is a phenomenal read that explains the Musk and tech bros whole \"move fast and break stuff\" technique. They don't believe democracy works and are looking to tear it all down and replace it with what they want. These megalomaniacs believe only they can save humanity. It's pretty fucked up where we're all headed...\n\nhttps://www.nytimes.com/2025/02/07/opinion/ezra-klein-podcast-kara-swisher.html?smid=url-share",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "neverendingchalupas",
                                    "body": "The argument that the U.S. is a democracy, is that the Congress represents the people.  Congress creates the Federal Departments in the Executive Department and gives advice and consent through the Appointments Clause.\n\nDOGE is a violation of the U.S. Constitution, only Congress can create Federal Departments.  And Musk hasnt been confirmed by Congress.\n\nTrump and Musk declaring that Federal Departments are shut down without going through Congress is again a violation of the U.S. Constitution.\n\nThe people are not being represented in this process at all.  There is no representation, you cant call it a representational-Democracy.\n\nEven if Congress was involved.  The House doesnt have enough representatives, there should be thousands of them...",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Darth-Shittyist",
                                    "body": "The people in power currently are ideologically against democracy. They are following the playbook of Curtis Yarvin. The basic idea is that democracy doesn't work, we should have billionaires be rulers of their own fiefdoms in a kind of neo feudalism. The American people need to forcefully reject this ideology and tell Elon Musk to keep his grubby hands off our government.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Yaro482",
                    "body": "I think once internet or at least all means of information is down for like a month crazy things will start to happen. We can surely recover from it but it will take time for our brain to start working properly again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Darth-Shittyist",
                            "body": "Trump is the source of most of the misinformation and disinformation in the country right now. 75% of the news media is Republican propaganda. Pull your head out of your ass.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "PoliticalDiscussion-ModTeam",
                                            "body": "Keep it civil. Do not personally insult other Redditors, or make racist, sexist, homophobic, or otherwise discriminatory remarks. Constructive debate is good; mockery, taunting, and name calling are not.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BitterFuture",
                            "body": "I can't tell if it would be sadder if you genuinely believe this or if you know it's untrue but genuinely think anyone else would believe it.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Away_Friendship1378",
            "body": "My problem is not with misinformation but with disinformation— deliberate falsehoods intended to distract and disorient the public so they give up trying to figure out what true.",
            "score": 167,
            "replies": [
                {
                    "author": "k_ristii",
                    "body": "Two things \n\nWhen they did away with the law that barred media monopolies - thanks gop/reagan\n\nIwhen Fox News admitted they were just entertainment and they still get treated like an actual news source.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "DBDude",
                            "body": "At one point MSNBC admitted they were progressive in their advertising while 85% of the content was opinion pieces.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Shipairtime",
                                    "body": "And yet when they go to court MSNBC says we were telling the truth and are willing to defend it.\n\nWhile fox news says you cant believe what we say.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JayReddt",
                    "body": "If I could edit my post, I'd change it to disinformation. That's what I intended to say.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "scootty83",
                            "body": "We are now in the “Post Truth” era.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Moist_Jockrash",
                    "body": "Ok but, what exactly IS disinformation, and how can one prove that it IS disinformation?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Away_Friendship1378",
                            "body": "Disinformation is deliberate deceit. It's analogous to defamation of public figures--lies made with actual malice or reckless disregard for their truthfulness. Enemies of democracy, both domestic and foreign, use this strategy to manipulate the information environment in ways designed to deceive, disorient, divide, demoralize and bewilder the public. Trump’s tactics include repetition, reversal (accusing the accusers), and the “firehouse of falsehoods” (confusing people with a blizzard of lies). As Steve Bannon put it, “the real opposition is the media. And the way to deal with them is to flood the zone with shit.”\n\nThese untruths have not only harmed individuals and firms. They have also damaged public confidence in the integrity of our method of selecting the President: the electoral system itself.\n\nOne way to prove is in court ( e.g. Trump's false claims of election interference lost in court because there was no evidence for them. And yet he continues to claim it it so.) For scientific claims, the test is verifiability/replication. In scholarship, it's peer review. In the public square, the traditional claim is that the marketplace of ideas will winnow out truth from falsehood. But if people can't distinguish between the two, then by definition the marketplace doesn't work. We hardly have a free market where ideas compete; instead we have boutique niches that only specialize in certain kinds of information.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Vettechjen",
                                    "body": "I appreciate your explanation of disinformation. Very well put and accurate. That being said, I want to point out that both sides are guilty of deception. Maybe it was an oversight that you only referenced Trump so I wanted to add that Biden and Harris were dishonest and said things that were completely untrue. \nI try to watch full speeches from both sides so I can understand the intent rather than relying on a news source to give me a clip that may be misleading. I’m very middle of the road on most issues and try not to let either side of media sway me with their opinions or interpretations. \nThank you for your post.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BlankM",
                                            "body": "Politicians lie about their platforms, but that is completely different from making up things to insult and harass people. This brings the bar lower for everyone and obscures objective truth. People also need to be held accountable for lies and crimes or they will simply do them again.\n\nRepublicans often refute democrats by basically never owning up to their mistakes, and instead bring the bar lower and lower. They're experts at deflecting and basically turn politics into a clown show.\n\nBesides that politics should not even be about personalities, but about policy. I don't know a single person who voted Trump that knew any of Biden's policies or what they did.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Moist_Jockrash",
                                    "body": "It was more of a rhetorical question but I don't disagree with you. \n\nWhat I was meaning is that disinformation and/or misinformation is very dependent on how an individual thinks and interprets information. What is disinformation/misinformation to you, may not be to the person you are sitting next to. It's not a universal \"this is this and that is that\" or \"you are wrong and I am right\" kind of thing.\n\nThere are always going to be the in between folks who question it all, there will be people who 100% disagree, people who 100% agree, and then those who analyze everything and form their very own opinion.\n\nAnd as for the Trump claiming election interference, I, as a non trump supporting conservative (voted RFK, btw,) am embarrassed and annoyed that he kept that up for as long as he did.\n\nBUT, he was trying to claim there was MASS interference. Which there was not and proven as such. Was there election interference on a smaller scale? Yeah, there actually was and there is a lot of proof and articles about it. Just not enough to have made any difference in the outcome, though. Either way, he is just an egotistical billionaire who can't accept defeat, and it crushed his ego lol.\n\nBut look at it this way too... Where are most people spending a lot of time - or at least enough of their time - on? It's facebook, instagram and twitter, right? Social media has a MASSIVE impact on how people vote and how/what people believe to be true/not true. Doesn't matter if it is or isn't.\n\nPre 2022, every single **major** social media platform was 100% owned, operated, and run by liberals. This includes Facebook, Instagram and Twitter. The 3 most widly used SM platforms in the world. Run by liberals. \n\nLike I said in a different comment, Zuck even admitted he was pressured into censoring conservative posts/memes/opinions leading up to the 2020 election by the Biden Admin. And yes, this is actual facts and the videos are on youtube and elsewhere.\n\nDorsey (Former Twitter CEO) was a hardcore liberal anyways and was likely also confronted by the Biden admin as well, and told to censor conservatives.\n\nElon bought Twitter in 2022 and for whatever reason, that caused a huge ordeal. My only assumption is because Elon was a Republican and much of Twitter was similar to Reddit... Overwhelmingly democrat/liberal.\n\nNow, Zuck - a liberal - is changing his views on censorship all of a sudden. He admitted he censored conservatives and is now saying he was wrong in doing so. Zuck owns FB and IG, and Elon owns X/Twitter. \n\nSo pretend for a moment that Zuck was a conservative and never censored conservatives on FB or IG, and pretend Elon - or a Republican owned Twitter pre 2020, I'd bet money that the election *may* have played out a bit differently. Not saying Trump would have won but, just saying it could have played out very differently.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "uoyevoli31",
                                            "body": "when a technofascist billionaire decides to purchase and overhaul a company where a decent percentage of americans get their news, firing a huge chunk of its workers- it tends to raise some red flags. &nbsp;\n\ni personally care about any information that is the opposite of the truth. i want the news to reflect the truth in a non-partisan way. i do not care to be bombarded with stories as entertainment 24/7. &nbsp;\n\nyou are speaking as if influence is just from our country. russian influence was huuuge in both trump elections in the flooding of misinformation through easily manipulated channels and with bot commenters. there was and is a massive benefit to outside people in power. &nbsp; \n\noverall, i’m not down for any information that is false. that doesn’t even need to be a partisan issue.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Away_Friendship1378",
                                            "body": "I agree that the question of who determines what disinformation is raises problems. I don’t want the government to decide nor the media companies.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Tiny-Conversation-29",
                                                    "body": "That's a major part of the problem - when people refuse to accept fact-checking or information because they just don't like the fact-checker. They're not complaining about the quality of the fact-checking, they're only complaining about the source and refusing to accept what the fact-checking source has to offer solely because *they just don't like them*.\n\nPeople complain about government fact-checkers because they just hate the idea of government and will always disagree with whatever they say only because it's the government saying it. They don't want to hear from mainstream media because it's too mainstream, and they hate mainstream culture. They don't want to hear from experts in their fields or academics because experts are such smug \"elitists\" who think they're smarter and better than everybody else just because they have more knowledge and experience.\n\nThen, when they're done dissing everybody and everything, they complain that they don't know who to trust to give them knowledge and information. Gee, I wonder why. /s",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Moist_Jockrash",
                                                    "body": "Yeah, that's all I was trying to get at. But I wasn't agreeing or disagreeing with you, but just debating :)",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Big-D-TX",
                    "body": "Advertising started this",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "CuckForRepublicans",
                    "body": "Then NPR and other media just repeat the disinformation on air.\n\nWe're just doomed.",
                    "score": -19,
                    "replies": [
                        {
                            "author": "Foolgazi",
                            "body": "I wouldn’t say NPR specifically repeats disinformation. At worst they occasionally lend it credence by discussing it as if it were debatable.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Petrichordates",
                                    "body": "Splitting hairs IMO. If you let a politician spread disinformation on your broadcast without pushing back, you're repeating disinformation. And unfortunately we've seen this many times.\n\nThe worst part is that even with this problem they're among the most reliable.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "BadNewsSherBear",
                                            "body": "Reporting agencies aren't academic experts and they have no real way to verify the veracity of differing claims other than to report their sources. It makes sense for them to say something along the lines of, \"In contrast to the claims of Politician X, Professors Y and Z with the ABC Organization published a study reporting evidence that ... \". News reporters claiming that they know the truth and only report that is part of where our mess comes from, to begin with.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Away_Friendship1378",
                            "body": "False posts spread much faster than truthful ones. Bots are set up for this purpose.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "eldomtom2",
                    "body": "I think you are targeting the completely wrong thing. No political partisan thinks they have given up trying up to figure out what is true, and there's little in the way of hard evidence that the more politically disengaged have either.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Fluffy-Load1810",
                            "body": "Partisans may *think* they've not given up trying to discern what is actually so, but some of them are actively fomenting disinformation. They know Biden won the election fairly but continue to claim he didn't. For them, it doesn't matter what is true. \n\nThere are also true believers in conspiracy theories (Proud Boys, Oath Keepers, etc.) They've made up their minds and are immune to their theory's lack of veracity. \n\nMore generally, in a 2024 Pew Research Poll, only 20% of Republicans agreed that human activity is contributing to climate change. Have they not stopped checking to see if that's really so?\n\nA further point on the harm caused by the Stop the Steal campaign: After the 2020 election, Republicans’ trust in the federal government fell from 36% to 8%. Prior to the 2022 election, only 56% of Republicans expected it to be administered fairly, compared to 88% of Democrats.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "eldomtom2",
                                    "body": "***None*** of that is relevant to my point.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hobo_Drifter",
                    "body": "Yes, the fact this is rampant on both sides makes it hard to trust anyone at all. ",
                    "score": -26,
                    "replies": [
                        {
                            "author": "BitterFuture",
                            "body": "This is not a \"both sides\" problem.\n\nThis is solely a problem with an ideology that has bad faith baked into it from the get-go. \n\nYou know, like when people look at someone assaulting an innocent victim and tut-tuts, \"both sides...\"",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "tlopez14",
                                    "body": "I’ve literally seen all kinds of people on here claiming Trump stole the election. Blue MAGA has basically became what they sought to destroy. I agree at one point it was more one sided but these days both sides are completely buying into misinformation.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "author": "UncleMeat11",
                                            "body": "There are idiots posting on social media.\n\nIn comparison, *Trump himself* spreads lies about Haitian refugees. \n\nThe difference is that the idiocy is deeply represented by the leadership on the right whereas on the left it remains amongst randos just posting.",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "LiberalArtsAndCrafts",
                                            "body": "Did we have a blue Jan 6th? Have prominent Democrats repeatedly asserted it was stolen? Has this become apparent party orthodoxy? What globally agreed upon massively important scientific facts are Democrats at best uncertain about?",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "okteds",
                                            "body": "This comparison should tell you that one side is far more enmeshed in disinformation. ",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "BlankM",
                                            "body": "How much have you actually looked into the interference? Look into Greg Palast, Spoonamore or Smart Elections. Just numbers and stats.\n\nTwo weeks into inauguration Elon invades the treasury with 6 young coders who all have far right views, have projects where they use AI to alter ballots, and have ties to dangerous cyber criminal groups like the com and kiwifarms. After their identities are released Elon panics and all their socials/ballotproof github gets deleted. He then proceeds to shutdown multiple reddits and harass a wired journalist.\n\nThis isn't some conspiracy these are simply objective facts. Do you want a secure election? Then why should we trust a billionaire with 3/4 the satellites in space with our private information? \n\nOne side is disingenuous misinformation like condoms for gaza in an effort to dismantle USAID, an entity that saves millions from disease, the other just wants our legal entities to DO SOMETHING to hold people accountable.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Hobo_Drifter",
                                    "body": "\"assaulting an innocent victim\"\n\n\nThis is a shit analogy. That would be true if one side was innocent but they're not so your point is invalid.",
                                    "score": -14,
                                    "replies": [
                                        {
                                            "author": "BitterFuture",
                                            "body": "They're not innocent? Who did you think I was talking about?\n\nIn this specific instance, I was thinking of conservatives persecuting defenseless children over the last few years, but I didn't think I needed to communicate that level of detail. In any case, maybe that isn't \"innocent\" enough for you.\n\nHow \"innocent\" does someone have to be before they gain the protections of the rule of law, in your mind?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Hobo_Drifter",
                                                    "body": "I did not say any side in particular. You mentioned a side being innocent in your analogy, which is not the case, so it does not work as an analogy.\n\n  \nThe comment I replied to said \"disinformation— deliberate falsehoods intended to distract and disorient the public so they give up trying to figure out what true.\"\n\n  \nIn the instance of political media, both sides are doing the same. If you ignore every bad thing one side does because the other is worse, then you are actively supporting the use of disinformation to sway voters and make their opponent look worse in comparison. This is the reason many people don't seem to give a shit about Elons nazi salute, people just assume at this point they're just trying to make the worst of any situation because that is what everyone is doing. On both sides. Yes. bOtH SidEs.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "BitterFuture",
                                                            "body": ">You mentioned a side being innocent in your analogy, which is not the case, so it does not work as an analogy.\n\nAgain, you toss out this word \"innocent,\" and say lacking it means anything goes.\n\nThat is not how politics works, it's not how the law works, and what's more - you know that.\n\n>In the instance of political media, both sides are doing the same.\n\nThis is obviously, blatantly, wildly untrue.\n\nBut I would expect nothing less from someone who spends their time objecting to calling Nazis Nazis.\n\n>This is the reason many people don't seem to give a shit about Elons nazi salute, people just assume at this point they're just trying to make the worst of any situation because that is what everyone is doing.\n\nIn fact, quite a few people do care about that.\n\nSome people may not because they've been persuaded that they should ignore politics because everyone lies to gain advantage - *because of a somewhat successful campaign by one particular ideology to champion that lie.*\n\nFunny how that works, isn't it?",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Petrichordates",
                            "body": "It's not rampant on both sides, this message itself is disinformation. The people who spread it very much want you to not know what's true and to distrust everything/everybody.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Jubal59",
                            "body": "You can't possibly believe that it is rampant on both side. In reality right wing propaganda has created a nation of idiots.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bzom",
            "body": "I'm pessimistic.\n\nIt's an asymmetric battle on many fronts. Consider a made up twitter post propagated by a bot army and retweeted by influencers. You can perpetuate this stuff at scale for almost no time or cost. Not everything has to hit.\n\nCompare that to real journalism. Years of building up sources. Months of research. Fact checking. Etc. \n\nIn a digital world where bad actors want to propogandize, they are simply at an advantage. \n\nChina and Russian censor media. Putin can have an 80% approval rating in Russia because the vast majority of the public only hears the propaganda. \n\nThose geopolitical enemies can target the US and seek to divide us or sway public opinion, shielded by the 1st Amendment laundering the stories through US persons. \n\nIf the government says \"hey that's a Russian op\", they look like they're putting their fingers on the scale of free speech.\n\nMeanwhile, we can't do the same thin back to Putin because they have the system to censor.\n\nAn authoritarian state that controls/censors media is the equilibrium. Not like North Korea - that's too far in the other direction. But allowing for limited dissent that only reaches a portion of the public works just fine for Putin and Xi. \n\nIt's going to be a long road to preserve both the 1st Amendment and have a country that isn't so divided it can't accomplish anything. And if can't accomplish anything, eventually it will give in.",
            "score": 48,
            "replies": [
                {
                    "author": "anneoftheisland",
                    "body": "Yeah, the only way to combat it would be if the social media platforms decided that they were going to ban or downrank/disincentivize misinformation. (Or if the government were to require them to, which they obviously aren't going to do.) And the platforms have made it clear that they aren't interested in getting into that business, so it won't stop.\n\nCombatting misinformation effectively requires a centralized way to control the flow of mainstream information. In the 1900s, when people tended to get their information from the same handful of TV news channels/their local paper or maybe one of a handful of major national ones, it was fairly easy to keep fringe views (which often require misinformation to sustain) out of most people's line of sight. Maybe your neighbor's brother is a flat earther, maybe somebody down the street subscribes to the John Birch Society newsletter--but it would be tough for *most* people to stumble across that information even once, let alone enough times to be converted to it. \n\nNowadays most people get their \"news\" from decentralized places like TikTok or Twitter. Not only does this make it easy for misinformation to spread, but the algorithmic structure of these sites ensures it's very easy for people to fill their feeds with people who already agree with them, which means they overestimate how mainstream their views are *and* it's very unlikely for them to ever see anything that debunks what they believe. That's a recipe for disaster in terms in terms of misinformation spread. And there is no easy way to fix it. People need to accept that this is the way things will work for the foreseeable future.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Zeppelin2k",
                            "body": "Well said. This really does feel like the root of the problem. Americans live in completely different realities based on the information they've been exposed to. We can't agree on an objective version of truth, and it's directly led to where we are now.\n\nFixing it does require some sort of centralized, unbiased source of information. Likely with government help. But I can't see something like that happening any time soon.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "trover2345325",
                                    "body": "We should try to filter out the things that cause both the left and right to become both hard left and hard right and try to make it central to appeal both wings of politics",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bzom",
                            "body": "Exactly. We didn't realize how valuable gatekeepers were until we lost them. \n\nI think the way to attack this is from a regulatory perspective where there's agreement. The goal can never be to censor speech. Instead, the goal is to protect our children and ultimately consumers from predatory algorithms.\n\nConsumers recognize that social media is addictive. We realize it's unhealthy for our kids. But the incentives on the social media side is to optimize for engagement. That means optimizing for things that make people emotional. Thus the algorithms are prioritized to enable all the bad stuff.\n\nIf we start from a \"protect our children\" angle and make it illegal for anything except dirt simple, publicly shared and regulator approved algos for anyone under 18, I think that's a good start.\n\nWe need a sort of social rebellion against what social media is doing to our lives and society. Start with things there's common ground on and don't die on hills that hurt the larger effort. \n\nFor example, I think the pragmatic left and center needs to align with red states who are requiring strict age verification for porn sites. It's impossible to argue that the 1st Amendment trade-offs of protecting grown adults from misinformation are worthwhile, but the trade offs of protecting 13-year-olds from porn isn't. \n\nDon't protect adults from misinformation on social media, regulate the algorithms to protect consumers from predatory addictive influences.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "reelznfeelz",
                    "body": "Nailed it. I think about this daily and I could have written your comment.  Sums it up perfectly.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bzom",
                            "body": "I've been thinking about this for a long time too. It's a crazy hard problem. And as soon as you throw up your hands, you're adopting the 'bad guy' position which is that the masses can't be trusted with free flowing information...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DBDude",
                    "body": "Imagine reading Reddit before the election and seeing all these upvoted posts and comments about how great Harris is, and then finding out that’s because she had a highly coordinated astroturf campaign running on Reddit.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "ApproximatelyExact",
                            "body": "Yeah must be that, couldn't be all the russian trolls on the other side for sure! And you never miss anything so whatever facts you have are all that are available.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "DBDude",
                                    "body": "No, someone actually joined the Discord they were running the astroturf from and provided all the evidence.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "ApproximatelyExact",
                                            "body": "Uhuh you mean Telegram but the rest I believe!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eldomtom2",
                    "body": "> Putin can have an 80% approval rating in Russia because the vast majority of the public only hears the propaganda.\n\nYou are very mistaken if you think a government only needs propaganda to maintain support (even assuming Russia has accurate opinion polls, which I doubt)!",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -11,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "PoliticalDiscussion-ModTeam",
                                            "body": "Keep it civil. Do not personally insult other Redditors, or make racist, sexist, homophobic, or otherwise discriminatory remarks. Constructive debate is good; mockery, taunting, and name calling are not.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CharlieandtheRed",
                            "body": "Listen man, this is sheep talk. Not saying Democrats don't have problems or also aren't sheep, but this is certainly sheepy. Odd capitalization, the verbatim words -- you're just regurgitating what you hear completely and entirely.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "PoliticalDiscussion-ModTeam",
                                            "body": "Keep it civil. Do not personally insult other Redditors, or make racist, sexist, homophobic, or otherwise discriminatory remarks. Constructive debate is good; mockery, taunting, and name calling are not.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Buckabuckaw",
            "body": "I think this (misinformation) is maybe the second greatest threat to, not just the U.S. , but the entire planet.  The greatest threat, of course, is climate change.  For the first time in my long life, I find myself wondering whether our species will survive.  \n\nThe microbes and cockroaches will do fine, of course.",
            "score": 26,
            "replies": [
                {
                    "author": "Vomath",
                    "body": "Gotta love the team up of misinformation and climate change to really make sure the situation is hopeless.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "theivoryserf",
                            "body": "The singularity is probably happening before that, even.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "theivoryserf",
                    "body": "AGI is number one by a long shot",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "aarongamemaster",
            "body": "... depends on what sort of mentality you're in when it comes to rights and freedoms.\n\n  \nIf you're of the school of 'rights and freedoms are static entities', then, no there is no way to come back from this, not without trampling on that mentality of rights and freedoms.\n\n  \nIf you're of the more realistic school of 'rights and freedoms are fluid entities', then, yes, there are ways to come back from this, though it will mean that you have to reevaluate where the rights and freedoms lie.",
            "score": 5,
            "replies": []
        },
        {
            "author": "stewartm0205",
            "body": "As long as people take comfort from believing what they want to believe this is the way it will be.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MrMathamagician",
            "body": "Reminds me of the colapse of Roman Empire and people turning to Christian fundamentalism and away from ancient knowledge.  \n\nLeaders collectively said ‘good riddance’ to the one thousand years of knowledge and culture they inherited as being heretical opting instead to burn it to the ground (sometimes literally in the case of the Christians burning the great library of Alexandria in 391).  St Augustine of Hippo captures this mindset in his seminal work “On the City of God Against the Pagans” argues that no Christianity was not ruining the Roman Empire rather it was saving it from itself and even if it collapses, so what, our paradise lives in the life beyond this one.\n\nI wish I had a more positive spin but this kind of indoctrinated close minded thinking, of course, helped usher in a thousand years of darkness in Western Europe.",
            "score": 9,
            "replies": [
                {
                    "author": "stoneman30",
                    "body": "Or is this more like the end of the republic and beginning of the empire?  I was reading [https://en.wikipedia.org/wiki/Roman\\_Empire](https://en.wikipedia.org/wiki/Roman_Empire)  the better (peaceful) years were during the empire. \n\nI also read some by Niall Ferguson. Where empires change or fall with technologies. Maybe it's like Rome ruled the world with Military advantage until they lost advantage; England ruled the world by Naval advantage until the lost advantage.; The US ruled the world by cultural advantage until we became too fragmented.  (Like that game Civilization there are several ways to win.)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "theivoryserf",
                    "body": "> Reminds me of the colapse of Roman Empire and people turning to Christian fundamentalism and away from ancient knowledge.\n> \n> Leaders collectively said ‘good riddance’ to the one thousand years of knowledge and culture they inherited as being heretical opting instead to burn it to the ground\n\nI think this is a misreading, certainly a simplification, of history - I'd recommend 'Dominion' by the historian Tom Holland on this topic.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "grinr",
            "body": "Truth only has value when there is practical impact.  Whether or not Thor is in the sky fighting ice giants or there is static buildup in the clouds doesn't make a lot of difference in understanding lightning from a simple practical position.  It starts to matter if you want other things, like not to get hit by lightning, or avoid forest fires, or if you're piloting an aircraft with 100 passengers (who themselves may care.)\n\nThe entirety of science is empirical in nature - repeatable, demonstrable phenomenon.  The claims of science are only true if they can be demonstrated consistently to be true.  There would be no science or need for science if people didn't have practical problems that mysticism and religion couldn't or wouldn't solve.  But advancements in science have made a world where almost all the problems of the previous thousands of years of humanity's experience are solved.  The day-to-day for most humans on Earth today is remarkably  free of those problems (biological needs met, environmental dangers mitigated) due to these advancements, so we're left with more esoteric problems (emotional challenges, social challenges, ethical challenges) and science is much less helpful (so far) with these problems.  \n\nWe've conflated one set with the other, so science has been undervalued for a long time and now we take it for granted, or worse, believe that it's more than it is.  In either case, that undervaluing has led millions of people to believe they don't need it, and that's made them vulnerable to not just exposure to non-empirical information, but also belief that the information is \"true.\"  In essence, they do not believe there is a need to validate information with demonstrable, repeatable phenomenon any more.  This has dramatically eroded the value of expertise, experience, and authority - replacing it instead with so-called \"common sense\" and gut feeling.\n\nThe inevitable destination of this is a return to what was before science and empirical thinking.  Disease will return, society will descend into chaotic feuding of emotional outbursts, industrial collapse, starvation, and war.  Essentially the status quo for most of human's history.  Perhaps after enough of that, the survivors will re-discover what has already been known and appreciate the value of what was lost (for a time), and we'll see the cycle begin again.",
            "score": 3,
            "replies": [
                {
                    "author": "eldomtom2",
                    "body": "I'm not sure what your point exactly is, but I'm not sure \"the only things that are true are those that can be confirmed by repeated experimentation\" is a practical attitude, or one especially relevant to present political issues.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "grinr",
                            "body": "The point is people either believe things through reason or faith.  One can be proven, the other can't. The present political state appears to be a consequence of the abandonment of the former for the latter. The search for Truth is unnecessary if the source of truth is by dictate, which is the purpose of Pravda and truthsocial (it's right there in the name) and the most popular social networks.\n\nThis isn't new, but it was greatly accelerated by the Internet.  \"I read it on the Internet, so it must be true\" is decades old, and today short videos by unknown sources are routinely used to decide what to eat, how to live, who is good and bad, what to say, and what to think about.  That isn't reason, that is acquiescence to slavery.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "eldomtom2",
                                    "body": "> The point is people either believe things through reason or faith.\n\nThis is nonsense from the get-go.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hypeman747",
            "body": "Prob not even if the demand for unbiased news come back.  The Fox News/OAN model shows it is more lucrative to deliver news based on your core audience belief",
            "score": 5,
            "replies": [
                {
                    "author": "Tiny-Conversation-29",
                    "body": "And the audience is directly at fault for that. They're getting what they want, but it's their fault for wanting it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "All_is_a_conspiracy",
            "body": "I think we really need to shine light on who the mega disinformation mongers are. We need to make media monopolies illegal again. We need to prevent through law, one entity acquiring hundreds of newspapers and local news stations.\n\nWhen guys like Tim Pool and his friends are actually taken seriously when they say they were \"duped\" to work for Russia, we have a problem. They were handed millions of dollars to spew pro Russian drivel. And they didn't consider who put up the millions to have them do it?\n\nBull. Shite.\n\nThings like that need to be discussed. A lot. More than one article the day it happened. We need to be told when the guys who make millions are lying to us. It has to be repeated and repeated loudly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Capital_Demand757",
            "body": " Its getting so I can only find detailed and factual news by visiting trade association websites.\n\n For instance,  Trump implies he wants to bring jobs back to the USA from China.  But Trumps own commerce secretary  owns a company that helps US companies move to industrial parks in Mexico.\n\n Also Trump says he wants to fix the trade imbalance between Canada and the USA, but most of that imbalance is crude oil.    Trump's reopening of the Keystone pipeline will increase US oil imports from Canada by  85000 barrels per day.",
            "score": 2,
            "replies": [
                {
                    "author": "random_guy00214",
                    "body": "He wants Canada to buy more of our stuff",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ElHumanist",
            "body": "Absolutely, we just have to have a collective movement standing up for facts, logic, and reality where we all speak out against disinformation and misinformation whenever it is being spread in public spaces. Going after bad faith YouTubers and information sources, shaming them, poisoning their wells, and organizing against them.\n\nWe have to combat the cynicism and apathy many of the comments made here promote that discourage people from engaging in rational discourse with those promoting disinformation. Russia paid trolls to prevent truth tellers from spending the time to correct disinformation, to break them down, to waste their time, to make them not care about correcting disinformation. Bannon and Trump used this same strategy. We are letting them win. Learn how to correct disinformation trolls promote without giving them their lulz or wasting your time. Drop the link that disproves them and quote the relevant part of the article because they won't read it. Then move on. The goal is to correct disinformation, not to change the idiots mind but to just have facts show up alongside falsehoods so those reading will realize what that person is saying is false.\n\nLearn how to fact check and don't be sloppy. We must foster an unrelenting pursuit of objectivity and truth in the citizenry.\n\n\nWe also need to win school board races at the local level and encourage media literacy and philosophy be taught in our schools. We should also start teaching international relations because foreign governments are exploiting our country's ignorance in such things to undermine our national security and elections.\n\n Bill Clinton said, there is nothing wrong with America they can't be fixed by what is right with America. Slow and steady wins the race.",
            "score": 3,
            "replies": [
                {
                    "author": "frisbeejesus",
                    "body": "I appreciate your optimism. I think there's a chance that the slow steady strategy may have hit some snags, but I'll try not to add to the cynicism and apathy.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ElHumanist",
                            "body": "Local school board elections are truly where a lot of the important fights against disinformation are going to take place. Learn who the Trumpers and conservatives are and do everything in your power to prevent them from winning school board races. At the same time, don't waste time on unwinnable races because we only have so much time to allocate to fight. School board races happen all the time and disinformation is being pumped into our communities 24/7. Focus on correcting disinformation in your local community, you can even build a following if you post with your real name frequently enough. You will see a lot of familiar faces and they will quietly respect you if they support you in ways you wouldn't imagine. Correcting disinformation becomes fun once you get into the routine and it does not take that much time to inject into a daily routine. 5 minutes in the morning when stories break, 5 minutes in the afternoon for new stories and replies worth addressing and then another 5 min at 7 or night. \n\nIf we all did this Russia, Republicans, and Trump wouldn't have a chance of escaping truth. By slow and steady I didn't mean sit on your hands till next election, I am saying just make peace that nothing is going to change overnight or in the next two years but mid terms will be decided by the right wing bigotry and disinformation we did or did not check NOW. The culture we all exist in that determines the bigotry, hate, and poor treatment that exists for lgbtq+ people, people of color, women, non Christians, etc is being improved or degraded every single day we breath. We can improve that and see meaningful results in how we treat one another interpersonally if we start speaking out, especially to those in our orbit and  local communities.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "discourse_friendly",
            "body": "I hope we never move it past it.\n\n  \nBecause that probably means there's heavy censorship and restriction and state sponsored \"correct think\" \n\n  \nThe good way to move past it is to have the politically charged people (myself included) admit when they are wrong and the other side was correct. \n\n  \nWe've all seen what happens when we try to convince someone with citations,  they don't like the source, so its rejected.  they have a different study, article, opinion piece they point to, or the move the goal posts. \n\n  \nWe would need to start teaching Kids 11-18 in school about admitting fault, about how science, discourse, and democracy benefits from people admitting their wrong.  \n\n  \nor I'm wrong and that wont' work either.  I dunno :(  I agree its bad, but I think the solution that is looked to the most, censorship, is worse.",
            "score": 1,
            "replies": [
                {
                    "author": "Foolgazi",
                    "body": "That’s a big part of the problem - distrust and devaluation of that type of education is part of the propaganda strategy.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Rekoza",
                    "body": "I think you're hitting the nail on the head here. It feels like a new culture of people that absolutely can't be wrong and can't fail at all costs. Despite the fact that everyone is wrong sometimes, everyone fails sometimes. Instead of being strong and growing or learning from mistakes, they warp their own perception to bury the mistake under a fake success.\n\nI genuinely think it's such a big sign of weakness. Not having the mental fortitude to face any kind of failure and therefore being incapable of growing as a person. It's such an integral part of being human and how we've progressed so far as a species, and somehow, people are losing it at an unprecedented scale.\n\nI'm not sure what is so appealing about this mindset. Maybe life is just so vast and complicated and hard sometimes that it's a safety mechanism. A mental safe space because reality is challenging to deal with. Which to be fair, it's hard in a world where we are always connected and can be aware of so much more than we ever could in history.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CharlieandtheRed",
                            "body": "It's extremely dangerous to never admit you're wrong or don't know something. It's equally as dangerous to not keep people around you to keep you knowledgeable and humble. These things might win an election in politics, but they are guaranteed to yield severely negative results in the long run in terms of governance.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "discourse_friendly",
                                    "body": "that's been a great thing about arguing on the internet.  granted only maybe 10% of the time, but I'll get someone who will argue and discourse, but not get angry or name call.  ask me to look up things, provide citations, and sometimes I realize I'm wrong. \n\n  \n:)   How unemployment stats are collected, how labor force rate is calculated,  what year the constitution was authored (its not 1776)  its like 1783? 89?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "2053_Traveler",
                            "body": "Agree completely. We’re all born basically useless, and it’s via failure that we learn ideas and behaviors that work. It’s exceptionally rare for someone to just learn on the first “attempt”\n\nWe should seek to be wrong so we can be right next time.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Emeraldxo23",
                            "body": "I agree with this statement too. Common sense is no longer common, critical thinking is no longer taught or encouraged. It seems, to me, that everyone takes offense about everything, about everyone, all the time. If you can’t have a deep conversation about views, perspectives, ideas, goals, values in your own home, its very hard to reel back from the current state of things. But it can be done, that’s one thing that is constant is change. It has to start at home because that is where you are comfortable to be your “authentic” self. I place the quotes, because not everyone has that ideal home life. But as people and as a society that now has access to a lot of technology, basing your ideas, preconceptions, confirmation bias, abuse, etc. and not taking a moment to reflect is dumb. I am a conservative, but I also understand there a lot of things I don’t agree to or subscribe to certain policies. I listen to my democratic friends when they have something to discuss about the republic party and even my independent ones. Why, because my own view is not only way to be and it’s not the way the world works. Do I hold on to my beliefs, yes, but I have to give room to other people to live their lives that way and they want to live with just as much autonomy as I do. They have a right to speak and have their own beliefs and thought process too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "the_bueg",
                    "body": "Democracy can't and absolutely will not survive Fox News/OAN, Facebook, and the Russian/Chrisofascist manipulation of it all.\n\nThe Bill of Rights was designed before it (and Facebook and Twitter) existed.\n\nNote that more modern democracies don't have such unlimited free speech as we do, and seem slightly better prepared to survive.\n\nSo the question we have to face is: Do we want a democracy with some constraints on freedom of speech? Or do we want Fascism. \n\nBecause those are our choices. You can't have both.\n\nWhat might that look like? I think it's going to take experimentation and a few failed states to figure it out. But probably something like the Fairness Doctrine expanded to cable TV and social media. \n\nBut honestly I for one don't think the USA will survive this. Some future democracy iteration might. \n\nBut I also think that disinformation will eventually result in the end of our species before we get it sorted out.\n\nSo before someone comes at me with \"but the 1A\"!: Dude - the end of democracy is basically here. The end of our species is looming. Thanks to bad-faith actors using the tools of democracy, mainly no limits on free speech, to destroy it from within. \n\nAll rights come with responsibilities and limitations. When your freedom of speech infringes on my right to life, fuck you. (Fox News.)",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "aarongamemaster",
                    "body": "... the sad reality is that this mentality is actually wrong, not right. To counter this, you need to be completely rid of privacy, install speech and information restrictions, and add ***intolerance*** to a system that has been set up to be *tolerant.*\n\n  \nOutside of the 'right' of me promising you that I won't harm you for whatever reason I could think of (and that's tentative at best), ***there are no basic rights***.\n\n  \nSadly, regulation is the only way forward because allowing mis/disinformation to run rampant is ***far worse***.\n\n  \nTo post a fixed 4X game quote:\n\n>\"As the Americans learned so painfully in Earth's final century, free flow of information ~~is the only safeguard against~~ **the best tool for** tyranny... Beware of he who would ~~deny you access~~ **give you free access** to information, for in his heart he dreams himself your master.\"\n\nPeople ignore MIT's *Electronic Communities: World Village or Cyber Balkans* paper (and, spoiler alert for those who haven't read it, they subtly argued that the Internet be regulated entirely from the onset, and the Cyber Balkans portion of the paper is outright ***prophetic***), because it had the ***AUDACITY*** to say that humans don't align with the political philosophy optimists.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "HiLineKid",
            "body": "Truth is arrived at in an adversarial environment. Truth and justice are not destinations where you arrive and stay, they are a constant struggle.\n\nThe Foundation trilogy by Asimov is based on Rome and how a small group convinced the Empire they could save it in order to seize power for themselves.\nhttps://acrobat.adobe.com/id/urn:aaid:sc:US:dbb73c8a-fb60-404e-adff-80cc8dad0390\n\nThe Power Elies is about the reality militaristic capitalism in America. https://archive.org/details/dli.ernet.507694/page/3/mode/1up\n\nThe Incubus of Intervention is about how and why Allen Dulles conspired to kill JFK. https://www.lewrockwell.com/2016/11/no_author/allen-dulless-indonesian-strategy/\n\n\nThe Mars Project is propaganda from a Nazi to use interplanetary humanity as a front for funding the rockets of war. https://archive.org/details/ProjectMars\n\n\nThere is context for everything that is currently happening, but it can't be found in mass media or textbooks.",
            "score": 1,
            "replies": [
                {
                    "author": "snakshop4",
                    "body": "Luckily, the GOP has spent decades fomenting anti-intellectualism and destroying public education so we don't need to worry about half of America picking up a book and learning any of this.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chin_Up_Princess",
            "body": "I was hopeless about this years ago. The truth is we just have to evolve through it. People will use it for nefarious reasons and weaponize disinformation. Some will survive. Some will die because of misinformation. The ones that survive will breed (hopefully). There's not much to it just natural selection and survival of the fittest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SenoraRaton",
            "body": "I honestly don't think so.  Its not in the interests of those who profit off of said misinformation and conspiracy.  It would require the populace as a whole to reject these narratives.  If that hasn't happened yet, it is unlikely to happen in the future as media literacy continues to atrophy, and material conditions continue to worsen.  If anything, its likely to get much worse, more insular, and more bombastic in its rhetoric.\nWhy would it change?  What precipitating factors would exist for there to be a shift in these continued narratives?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Simple_somewhere515",
            "body": "Stuff has just declined since 2016. Like the timeline got messed up and we're in an alternate reality where Biff Tannen is president.   \n\nPutin played the long game. He said he'd tear us apart from the inside out without firing a shot. He used social media to feed propaganda. Testing the power of social media to change the market. Created a culture of rep vs Dems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "youcantexterminateme",
            "body": "Im starting to see it, and I dont want to sound like a conspiracist myself, as some kind of health issue. I know for sure that some of my trump friends, or exfriends, definitely have psychosis. chip implants, being stalked, random strangers 100m down the street talking about them etc. I imagine its triggered by so kind of drug use, prescription or illegal, seems to be a lot of meth used in red areas for example. certainly lead doesnt help, even things like toxoplasmosis could alter a persons political beliefs. Im starting to think it has to be treated as a health issue. Its impossible to ban misinformation and in any case most sane people can easily tell misinformation when they see it. interesting times I suppose",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exaltedautochthon",
            "body": "Sure, just put legal penalties on whoever spreads blatant horseshit. \n\n  \nUnlimited first and second amendment freedoms have done far more harm than good, it's time to accept some limitations if it means we don't end up with fascist coups and murdered children in Uvalde.",
            "score": 1,
            "replies": [
                {
                    "author": "RusevReigns",
                    "body": "And what if we disagree about which side is pushing blatant horseshit? Why should the side that pushed Russiagate be given the power to be the arbiter of truth?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Exaltedautochthon",
                            "body": "Well uh, the thing about that is it was accurate and multiple members of his administration got busted for failing to disclose they were russian agents. \n\nYou can look this shit up, yknow.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RusevReigns",
                                    "body": "No it was bullshit started by Hillary camp in 2016 to counter the email scandal and then spun out of control. The Democrats constantly trying to remove or arrest Trump for the last 10 years was more like third world thuggery where politicians get banned or arrested because they're too big of a threat to the main party. That's part of the reason why the Democrats are flirting with destruction because Americans know they're supposed to be better than that.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Exaltedautochthon",
                                            "body": "Well that's not what the courts said when they busted them for it, soooooooooo...\n\n  \nAgain, you can look this shit up.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RusevReigns",
            "body": "Left wing journalists didn't translate well to social media age as they wanted to impress social media followers. As their followers got more ideological and more interested in only seeing articles that backed up the views they were emotionally attached it, it pushed the journos to just give them what they want like calling everything racist or saying how bad Trump is or how the latest development is the beginning of the end for him. Fox News was already opinion based so this left a vacuum of anyone trying to provide \"neutral reporting\" and as a result the vacuum is filled by people online and some people buy into the loudest and charismatic voice they find not the the one with the most history of telling the truth.\n\nTo get back, the best thing would probably be the end of woke which takes the pressure off the center left journos to impress them and allows them to just work hard double checking the accuracy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Present-Ear-1637",
            "body": "I was deeply immersed in conspiracy thinking for a few years. Thankfully my thinking matured to the point where I was able to question the conspiracies themselves. Upon scrutiny, it became clear just how absurd they were. I think it is possible for people who are completely and totally captivated by it to come out the other side by going through it fully, if that makes sense. Maybe, perhaps, that can apply on a collective level. I can hope that this current conspiracy trend is a symptom of a certain mental fixation that will work itself out. But I kind of doubt it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opie_the_great",
            "body": "The media today is a huge problem.  Using headlines that portray a false narrative and gotcha lines.  You have to do research any time you read an article now just to see if there is validity.  Reddit and all social media platforms are high places for misinformation or bias info.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LodossDX",
            "body": "The Republican Party has relied on misinformation for at least the last 4 decades. The problem has only gotten worse and they show absolutely no signs of letting up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "platinum_toilet",
            "body": "The attempts to reduce censorship have already started.  \"Misinformation\" has been used as an excuse to censor stories and people last time around.  The current administration is pro-free speech not pro-censorship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KitchenBomber",
            "body": "Is it more likely that China going to sit politely on their hands while we flail in the mud and then later help us bandage our grievous self-inflicted wounds? Or that they are going to pour their influence into every area where our hasty exits are leaving power vacuums and quietly rewrite international reality in their favor leaving us eternally on the outside with our faces pressed against the glass?\n\n\nPulling a goofus and letting these charlatans tear down our intelligence, finance, diplomacy, technology and trade while a challenger to our global supremacy watches and fans the flames is an unforced error that we will definitely never fully recover from.\n\n\nWhether or not our country will survive this mistake is the question we should be asking. History does repeat itself and every other empire has eventually fallen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HootHootHoot-",
            "body": "Just keep listening to the truth there are people out there telling the truth believe it or not a good one is- MEIDASPLUS.COM . If we are smart, we can make it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Telkk2",
            "body": "Yes and there's a real tangible solution to all of this. And that first, starts by reframing the problem. It's not about accuracy versus inaccuracy or freedom of speech versus restricted speech. It's about the confluence between the incentive structures of big social media companies wanting to maximize profits and third party actors using tactics that should be illegal to sway public opinion.\n\nMost on Reddit see it as millions of idiots with podcasts and blogs simply distributing information that's inaccurate or out-right false and although they act as tools within the system that creates the problem the real problem here are rich and powerful people, institutions, state actors, and others who have the expertise, resources, and money to commit very effective psy op campaigns that involve capturing credible institutions, inventing credible institutions, buying out media, social media, and troll farms and/or bots to give us that 360 degree false view of the World filled with half truths to sway our minds. \n\nThe net result? Confusion and inaction, which is by design. \n\nSo the first step is to understand that you are being duped into believing its Joe Rogans fault or Alex Jones and that to solve it, we need to have conversations about freedom of speech and sensoring misinformation. Those are consequences. Those are not the problems. \n\nThat's why I call on everyone, dumb, smart, rich, or poor to rebel by making a real concerted effort to learn about the World in as many facets as possible by examining the source of that knowledge (academia). Also, learn how to vet sources.\n\nIf not you'll either end up supporting one King or another, but you'll never support the right causes or the right people to actualize a better future.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BKong64",
            "body": "IMO it will take a very good degree of moderation on social media, which is the biggest spreader of it all. You can say legacy cable news and all of that, but most people don't even get their news and misinformation there anymore, they see it on social media. \n\n\nThis is why I'm very pro moderating the shit out of social media, it's a necessity IMO. But then you can have the flip side of that line with X where the guy who owns it WANTS misinformation to prosper. There needs to be a way for this NOT to happen IMO. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "stoneman30",
            "body": "I should reread The Square and the Tower, since I don't remember directly but I think Niall Ferguson would have said that the internet sort of democratized information.  Since WWII the US broadcast that life is good and we know what we're doing.  Since it was hard to do this, only the very best of everything got out there (or only the chosen few?).  Now it's a free for all.  You can say this is now real democracy and it allows the voices of those who have been overlooked for the past 100+ years of radio and TV to be heard finally! But I think it's raw humanity and it's not nice.  Maybe China and Russia have it right that you can't hold a diverse country together without control of media. But the downside is that rulers don't get replaced when they run out of good ideas.  \n\nMaybe Civilization 6 has it right that Corporate Libertarianism is next. Maybe you have to be hired as a citizen and then you can participate in a kind of representative governance in line with your demonstrated competence. Otherwise you play in Hunger Games.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HurtFeeFeez",
            "body": "Nope, we can't. It's probably just going to get worse. Critical thinking is a thing of the past and education has been demonized.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Recondite_Potato",
            "body": "Where have you been since, oh, I don’t know, forever?\n\n“It’s so bad now!” usually means “My side is currently losing favor and I don’t like that the other side gets just as much airplay.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opposing_Thumbs",
            "body": "Most intelligent people have always taken news sources from both sides and drawn their own conclusions.  Anyone that takes one source as gospel is easily duped.   With regards to politics, I find people deeply entrenched in one side lack reasoning skills and common sense. Doesn't matter which side, as both are equally dumb. The truth is somewhere in the middle.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bbooya",
            "body": "I don’t know if you were around for 2008, but basically crushed many people’s trust in the system. It was confusing with people saying we made money from the bailouts, but it felt pretty significantly like we were robbed. If you were retiring around that time, your savings were stolen. \n\nNow after Covid, how can we ever trust the media again?\n\nI guess my point is, any agreement on facts that existed in the past were a mirage, and they were likely a misrepresentation of what was really happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmericaneXLeftist",
            "body": "You are literally posting on the most hysterical propaganda website on the internet",
            "score": 1,
            "replies": []
        },
        {
            "author": "pickledplumber",
            "body": "The way back is to allow conversation. So much conversation doesn't happen because it's not allowed to be talked about. \n\nMaybe you have somebody who's a white supremacist and they feel unsure about it. So they go on to Reddit and then they ask a question on one of the various ask a question Subreddits. But immediately their question is taken down by some bot because it has a word in it that they don't allow. So then they try a different subreddit but when they make the post it's also removed because they're supposed to use the political mega post at the top of the page. So then they ask there at the mega post and nobody answers or they get downvoted to Oblivion and reported and removed. Then the next day they tried again on a different subway. But then because they asked on that said read it they get banned from other ones. What do you think they do at this point?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Moist_Jockrash",
            "body": "There is no such thing as \"misinformation.\" People have *opinions* and nobody's opinion is wrong. Conspiracy theories are not right, or wrong. They are literally theories. Misinformation is literally nothing more or less than one's own ***opinion*****.** \n\nAs an easy example...\n\nIf someone were to say as an opinion that, covid originated from a lab in China and was unintentionally (or maybe even intentionally) leaked - that would be *immediately* labeled as \"misinformation.\" How exactly is that \"misinformation\" when NOBODY actually knows 100% where it came from? You can't have misinformation if you can't back it up with facts and proof. Which fact checkers never do or did. Usually it was just \"missing information\" or \"this has been proven to be false\" while not referencing any proof. \n\nBesides, what is even considered \"misinformation?\" And even more importantly, WHO is \"fact checking\" this? Up until 2022, every single social media site was owned, operated, and run by VERY liberal men. Facebook/IG - Zuckerburg. Twitter - Jack Dorsey. Those three platforms alone were and still are the most widely used social media platforms on the planet. \n\nZuck even admitted he was pressured by the Biden Admin to censor conservatives and censor whatever they told him to. So that included both Facebook AND Instagram. Dorsey is a hardcore liberal and I'm sure was told to do the same. \n\nSo, because those platforms are/were owned and run by very liberal people, do you honestly believe that the \"fact checkers\" were not bias towards democrats? Of course they were. \n\nNow that Elon owns \"Twitter\" or X, it's somehow now a huge issue because he is a Republican and isn't censoring or \"fact checking\" anything. Apparently he is but, not to the extent as it was before. So now people have an issue with a REPUBLICAN censoring democrats but, it wasn't ever an issue the other way around. \n\nMy point is that, missinformation is not a real thing. It's nothing more than trying to say that your opinion is \"invalid.\" Missinformation is only missinformation to the one claiming that it is missinformation, basically.",
            "score": -3,
            "replies": [
                {
                    "author": "CharlieandtheRed",
                    "body": "No, that first example would be misinformation. It may not be wrong, but it has no *current* factual backing to it right now, so it is therefore unprovable and misinformed.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Moist_Jockrash",
                            "body": "First off, this isn't \"misinformation.\" At all.\n\nBeing misinformed versus believing something are very different things, though... People can and will believe what they choose to believe, regardless of where it came from, where they read/saw it or who said it.\n\nI'm assuming that you don't think it came from a Chinese lab, and if so, that's fine! I personally think it did but I also have no GD idea, either. There is no proof that says it did, or didn't. So how can it be misinformation if there are quite literally no factual backing as to where it came from? You can't label something as missinformation if nobody can show facts of \"right or wrong\" or \"yes, or no.\" \n\nBut what if in the next few weeks, months, years, or even a decade we find out that it 100% did come from a Chinese lab? That misinformation was nothing more/less than one's own opinion at the time as there was zero proof of where it came from. \n\nMy point is that, it's not misinformation to have an opinion or hell, even spout conspiricay theories for that matter.. Even conspiracy theories are still just an individuals opinion/thoughts.  It's an opinion and one that a lot of people happen to have but whether or not they are right, turn out to be right, or turn out to be wrong, is entirely irrelevant. \n\nYes, if someone is telling others that \"i know someone who said covid came from a lab\" or xyz... then of course that is misinformation. Or if someone says \"You can cure AIDS by just taking xyz\" then obviously that is misinformation. \n\nOPinions, thoughts, and yes, even consipiricy theories are not \"misinformation\" though.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "2053_Traveler",
                                    "body": "As another person said, you’re just arguing semantics and missing the bigger message. Perhaps a better word is disinformation. People do knowingly spread lies in order to manipulate people, and that would be disinformation. Something could even be partially true and be disinformation at the same time. For example, before we knew how rainbows worked, someone could say “a flood is coming because god is gonna punish you”. And… a big flood comes and wipes out the crops. Maybe that person says god spoke to them. And they’re lying. To try to get you to behave or believe a certain thing. But they were right about the flood. Doesn’t mean it wasn’t disinformation.\n\nAlso more things than you seem to imply can be either objectively shown or should be assumed to be true based on solid reasoning. For example, I don’t believe covid was produced intentionally or came from a lab because I have seen no evidence of that, and so via Occam’s razor it’s safe to just assume it happened in the way experts in the field say is most likely.  It due to appeal to authority but rather if the greater community says “this is how viruses work and how this happens 99% of the time” there’s no reason to assume otherwise unless there’s more significant evidence to suggest otherwise. Unfortunately folks will fall prey to confirmation bias and weigh other stuff more heavily especially things that are scary or things that blame entities they dislike. (e.g. someone who dislikes china might be more likely to accept a claim about China producing the virus even without supporting evidence)",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "JayReddt",
                                    "body": "Semantics of what we call doesn't matter.\n\nThe fact is we have increasingly divisive opinions and many opinions lack less and less basis in reality. It's damaging.\n\nIf everyone goes around believing in flat earth, alien lizard people, birds aren't real, chemtrails, and whatever other non-sensical opinions and base their world views on this... we would be in trouble. Your lens of the world can't be that skewed. Productive discussion is difficult when the two sides can't agree to basic things.\n\nI used purposely fantastical conspiracies just to get the idea across.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thegarymarshall",
            "body": "As long as there is an internet, there will be mis/dis-information. \n\nAs long as people are too lazy to vet what they read on the internet before passing it on, there will be *more* mis/disinformation than truth. \n\nDisagreement is *not* mis/dis-information. We need to be careful here, too. Disagreement and rational discussion is a good thing, in fact, it is essential as a hedge against all the bullshit. Claiming that an opinion that is different from yours is mis/dis-information camouflages the true bullshit.",
            "score": 0,
            "replies": []
        },
        {
            "author": "bloatedbussy",
            "body": "it's definitely possible in theory the main issue is that the problem isn't entirely the sides that people choose, their main source of news. the issue is with the person themselves, their own way that they view the world, and their own mental abilities.\ncan we be honest? we are mostly talking about democrats, and people that think similarly to people on tiktok and twitter, and twitter trending hashtags that hate trump whenever he goes viral right?\nso going off that there's some issues within their own people first off that ain't directly misinformation. it's the way they view the world and tia win information\n\nanyways who watches the msnbc youtube channel for example. anyone who read the title of those videos will instantly know it's biased, they hate trump, and they twist words to make something seem entirely different. and that's just with reading the title. what type of brain process do you think people who watch these types of news channels and continue watching them have? to put things simply they don't see that they are being manipulated at all for some reason. and this is an issue with themselves as opposed to the type of misinformation they are exposed to, that's my personal belief. when it's right in front of your face that someone is lieing to you but you don't see it, I see that is an issue with thought process of that person. Misinformation is a problem especially deliberate but for a person to not see blatant bias like that is an issue on another level that I don't think can be fixed\n\nthe other issue is the hivemind. twitter hashtags when trump goes viral are my favorite example to show that twitter and tiktok are obviously dominated by people who could be categorized as democrats in their beliefs. they hate trump and you'll see that pop viewing any twitter hashtag or viral tiktok video, you'll hardly see defending trump which is odd considering most people voted trump, which is why I want to make it a point that these apps are democrat dominated. Now the main issue with this is the hivemind thing, if you at all are against your peers on those apps you  are attacked and branded a racist homophobe transphobe nazi, we have all seen this it almost feels a joke typing this by how stupid it is, but it happens literally all the time even on here with subreddits banning twitter links because of their own beliefs and spite",
            "score": 0,
            "replies": []
        },
        {
            "author": "RWTwin",
            "body": "Are you talking about actual misinformation or somebody's views or opinions you just disagree with?",
            "score": -2,
            "replies": []
        },
        {
            "author": "WorksInIT",
            "body": "It's pretty pervasive, so probably not. Neither sides wants to acknowledge it happening on their own side and believe it is only a problem on the other side.",
            "score": -1,
            "replies": [
                {
                    "author": "CharlieandtheRed",
                    "body": "I feel like Democrats constantly shit on themselves and their own party. I feel like there is broad acknowledgement of their own problems, especially after the last election. Republicans however do not acknowledge their side as a problem at all -- they are lockstep. They chose to ignore elections in the past and double down (which somehow actually worked lol).",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Murky_Crow",
                            "body": "What you basically just said is that the party you relate to is fine but it’s the other party. That’s the problem.\n\nAnd I have to laugh because I’m sitting here like the Democrats never acknowledged their problems. The Republicans aren’t any fucking better of course, fuck them too. \n\nBut as somebody a little more unbiased, the Democrats absolutely do not own up to their shit ever.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CharlieandtheRed",
                                    "body": "Lol i did not say that at all. I didn't even comment on whether one is right or wrong. I commented on whether each party acknowledges their problem and the Democrats have been doing nothing but soul searching since the elections.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}