{
    "title": "Just father and daughter things ♥️",
    "author": "_DeLEON",
    "subreddit": "wholesomememes",
    "rank": 386,
    "score": 13250,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 71,
    "url": "https://i.redd.it/fc5d8bxce0cd1.jpeg",
    "id": "1e17w15",
    "selftext": "",
    "comments": [
        {
            "author": "Fun_Ambassador_74",
            "body": "Oh man that’s awesome! I’m a giant nerd with 2 athlete kids.. they make fun of me ..oh look dads playing with his magic cards!!.. you gotta counter spell for this fart old man.",
            "score": 417,
            "replies": [
                {
                    "author": "None",
                    "body": "Kids are competitive and being athletes, they focus on sports. Have a sit down with them away from distractions. The aim is to have a dad and children moment. Tell them stories of the Planewalkers. Tell them the IRL controversy of the Black Lotus.\n\nYes they will still make fun of you BUT this time this event will be imprinted in their memories that they will make fun of you lovingly for the rest of their lives.\n\nAdded: They may find it corny or cringeworthy. They will not understand it now but when you are gone and they try to recall who you were, this will come to mind. \n\nSource: Myself wishing I have known my parents as who they genuinely were than who they projected to be.",
                    "score": 91,
                    "replies": [
                        {
                            "author": "Reatina",
                            "body": "Let me tell you the tale of Time Walk.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "High-Horn",
                                    "body": "The fuck... NOW TELL ME! O_O",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Winter_Radio",
                                    "body": "Damn, now I wanna time walk that sounds so damn cool",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Netsugake",
                    "body": "Maybe I'm too idealistic, but one calm day is invite them to a game of commander with two handmade decks on the theme of sport. But I'm not in your situation and wishing you the best no matter the colors you play!",
                    "score": 22,
                    "replies": [
                        {
                            "author": "SeppeSpellmane",
                            "body": "I mean, if theyre being lil competitive dickheads give them a starter deck and stomp them with a t1.5 deck, see if they get into it just to beat the nerd.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sleepydorian",
                    "body": "That’s hilarious given that I was collecting baseball trading cards before Pokémon and MtG. And sports buffs are the most insufferable nerds I know. Just flip the script, they are just as nerdy (strats and stats bro) they just get sweaty while doing their nerd thing.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "gilesbwright",
                    "body": "You have done well cultivating their humor. That's a pretty good line. Their dad joke humor is well underway.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "The_CrookedMan",
                    "body": "Have you tried teaching them to play? Magic is probably the thing im most competitive in. It's the only thing that makes me get genuinely upset when I'm playing like shit compared to others around me. I can sit through 5 hours of being beat down by the same boss in elden ring without batting an eye. But someone puts all my nonland permanents back in my hand? we're going to war.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Arkham1798",
            "body": "That is one GOOD daughter! 😍",
            "score": 95,
            "replies": [
                {
                    "author": "Mobile-Brush-3004",
                    "body": "And one GOOD dad!",
                    "score": 46,
                    "replies": [
                        {
                            "author": "Arkham1798",
                            "body": "Such a wholesome relationship 😄",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fehrenden",
            "body": "Hands down, one of the best feelings in this world is when your child expresses an interest in your hobbies/profession/interests. My 9 year old daughter loves watching Thor Ragnarok, but doesn't like to watch the rest of the MCU. One day she asked me about Loki and why i had complex thoughts about his character.\n\nWe sat down and I gave her a three hour summary of the MCU up to Thor Ragnarok. She hung on every word. And asked clarifying questions! I didn't even notice the time passing until it was getting dark outside, and I had to go make dinner.\n\nI'll remember that day for the rest of my life. 😊",
            "score": 52,
            "replies": [
                {
                    "author": "OverDisShit",
                    "body": "The wholesome comment i needed today❤️ Wish I’d had a father like you man, keep it up!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "joelseph",
                    "body": "❤️",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CabSauce",
            "body": "Fuck, I'm old.",
            "score": 26,
            "replies": [
                {
                    "author": "IstvanKun",
                    "body": "Aren't we all?\n\nTotally worth it tho,  if you manage to raise interest for the shit you love, in your children. So far, I have failed miserably.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "MrCasterSugar",
                    "body": "r/FuckImOld",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pisangguy",
            "body": "He definately is a pokemon master in his daughters eyes",
            "score": 9,
            "replies": []
        },
        {
            "author": "dessa5",
            "body": "It's kinda crazy the Pokemon series is pushing its 30th anniversary and still attracts tens of thousands of newcomers into its IP. My cousin who introduced me to the anime and the games is now 44 and recently became a grandfather...",
            "score": 6,
            "replies": []
        },
        {
            "author": "None",
            "body": "Complete with beer in hand.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Answer_Free",
            "body": "This is the greatest feeling. I had this moment with my daughter and D&D. We've been playing on and off for about six years. She's fifteen and just recently ran a one shot with my son. He asked to learn how to play during summer break.",
            "score": 4,
            "replies": [
                {
                    "author": "MightbeGwen",
                    "body": "We have had family D&D night a lot when our kids were a in middle school. For some reason the high schoolers are too cool.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AJC_10_29",
            "body": "His inner nerd heard what she said and went:\n\n**“All my life has been leading up to this one moment…”**",
            "score": 5,
            "replies": []
        },
        {
            "author": "Flat-Structure-7472",
            "body": "Why was this deleted a few days ago? I think it's nice that her dad teaches her the Haymaker Deck.",
            "score": 6,
            "replies": []
        },
        {
            "author": "NonArcticulate",
            "body": "Still remember reading about a guy who became a father the same year World of Warcraft was released. Over a decade later he had a forum post about him being the main tank and his child being the healer in raids. So wholesome!",
            "score": 3,
            "replies": [
                {
                    "author": "Reatina",
                    "body": "\"No one ever want to be the healer. You know what? I have a great idea!\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "my5ticdrag0n",
            "body": "I get this with my nieces and nephews about Minecraft. I blow their mind when I say I played Minecraft BEFORE the crafting book",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dont-remember-it",
            "body": "Thank you to his wife for letting him continue his hobby of collecting Pokémon cards in first place.",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "Letting him?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "objectivemediocre",
                            "body": "don't you know men aren't allowed to have hobbies when they get married?",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Snoo_89085",
                    "body": "Eew… “letting him”?",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Men are boys who got older. Most act responsibly because it is expected of them by their partners, coworkers, and society. If they trust you, they will open up and be more genuine around you.",
            "score": 7,
            "replies": []
        },
        {
            "author": "digitalheadbutt",
            "body": "Most of my friends who have kids are like slowly inculcating nerdy s*** on them so they can have someone for their d&d game or board game night.",
            "score": 2,
            "replies": []
        },
        {
            "author": "n3rdchik",
            "body": "When my kids told us they’d rather go to GenCon than Disney, it made us gamer nerds so happy",
            "score": 2,
            "replies": []
        },
        {
            "author": "MacaromniM",
            "body": "Awww",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shade_Gaming24",
            "body": "Please not edgeamacation",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snackasm",
            "body": "I hope to experience this with my future kids, if it happens",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sure_Price2002",
            "body": "I want one such in my life 🥰🥰😍😍",
            "score": 1,
            "replies": []
        },
        {
            "author": "TairesBayl",
            "body": "I've got the kids, but being the nerd I am, they already know, so the surprise will never be a thing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rare_Following_8279",
            "body": "I had to be taught myself. I’m an expert now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own-Cable8865",
            "body": "My eyes filled with tears of joy at this, recalling all the times my kids have asked, \"have you heard of this band?\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "PzoidoCheckah",
            "body": "❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "EpicJoke45",
            "body": "I wanna be the very best",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Sippin on a yuengling. Atta boy",
            "score": 1,
            "replies": []
        },
        {
            "author": "azad_ninja",
            "body": "Same, but now I need my reading glasses to read the tiny font size on those cards now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional_Cycle_51",
            "body": "That’s all wholesome and good, but does he have shiny charizard?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Majestic-Boat-8756",
            "body": "This is the best",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sketchy_Vibes333",
            "body": "This is absolutely amazing🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "That's awesome. Adorable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wild-Combination-626",
            "body": "I wish my dad was like that 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "TakeTwo4343",
            "body": "Man I would love to have been allowed to be into Pokémon. My dad and stepmom ravaged me when he found out I liked that stuff. called them and me gay, took my Pokémon game away, my cards I was starting to accumulate, everything. I wasn’t allowed to watch it on tv, I wasn’t even allowed to buy or rent Pokémon books form the library or book fair. I wasn’t even allowed to say “Pokémon.” And they’re so fucking cool!",
            "score": 1,
            "replies": []
        },
        {
            "author": "veneco79",
            "body": "That's wholesome ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Business-Secret-4392",
            "body": "And he's drinking a Yuengling. My kind of guy",
            "score": 1,
            "replies": []
        },
        {
            "author": "POKEM0N_AWESOME",
            "body": "As a pokemon fan I am melting ❤",
            "score": 1,
            "replies": []
        },
        {
            "author": "Per-D",
            "body": "Education mode while drinking % Congrats -.-",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ornery-Push-728",
            "body": "Wonder if he let her take a swig",
            "score": 0,
            "replies": []
        }
    ]
}