{
    "title": "You are who you are and you are beautiful that way. ",
    "author": "tnucffokcuf",
    "subreddit": "wholesomememes",
    "rank": 316,
    "score": 2235,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 93,
    "url": "https://i.redd.it/43jz7oheo7hd1.jpeg",
    "id": "1em7giv",
    "selftext": "You are who you are and you are beautiful that way. ",
    "comments": [
        {
            "author": "None",
            "body": "Thank you. This really brightened my day. As a serial killer on death row, we don’t get this kind of positive feedback much.",
            "score": 106,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "I’m glad this is reaching all possible audiences.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "leomonster",
                    "body": "Serial killers actually have a bunch of admirers. Don't listen to the haters.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Lord-Lucian",
                    "body": "You may be on death row. But your streak will live on even after you're gone. And I think this is something positive to look forward upon.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bunny_wanton",
            "body": "Self-acceptance is so important, thank you for this.",
            "score": 25,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "You have a great day too!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "burber_king",
            "body": "Think of an artist that says their art is no good or has a lot of flaws. You can't see them because you are not the one who created the art, and you can feel like the art is really good regardless of the flaws being pointed out.\n\nYou are simultaneously the art and the artist. You are the only one who can see all your flaws and think you are not enough. The majority of people can't see them or think they are not a big deal, as you might do when you think of other people, you have to remember you are your worst critic.",
            "score": 19,
            "replies": [
                {
                    "author": "FishLoaf4Dinner",
                    "body": "I'm giving you a hug through the internet. Thank you.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "For me I'm actually well aware that I'm generally liked by most people. It's just that I don't like myself",
            "score": 10,
            "replies": [
                {
                    "author": "leomonster",
                    "body": "Maybe you're just not your type.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "SyntaXAuroras1",
                            "body": "what if i am my type? im a realist and i love how unphased i am by so many things but gawdamn do i wish to be normal and appreciate things like people, events etc. without looking at it like its another day…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "some-r4ndom-transfem",
                    "body": "Relatable",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tnucffokcuf",
                    "body": "You shouldn’t be like that to yourself. Be good to yourself!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "xHeylo",
            "body": "If that was true I wouldn't be Depressed and suffer with PTSD because I wouldn't have been or wouldn't continue to be treated worse than Dirt by my \"family\"",
            "score": 8,
            "replies": [
                {
                    "author": "Visible_Star_4036",
                    "body": "You didn't deserve that treatment. Nothing about you made them treat you that way, that was all on them for being terrible human beings. Your flaws don't merit what was done to you, and the positive statement can still be true even though you have suffered terribly.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tnucffokcuf",
                    "body": "Being depressed is okay, don’t let it affect other aspects of your life. Also don’t take others criticism to your heart, sometimes they mean well, you just need to find to be your best self.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "xHeylo",
                            "body": ">Being depressed is okay\n\nno it is not, trust me, it hurts in every aspect of life\n\n>don’t let it affect other aspects of your life\n\nBut that's like literally the medical problem with depression, it does spread everywhere\n\n>Also don’t take others criticism to your heart, sometimes they mean well\n\nNo they don't, you're just naive\n\nThe thing that I was traumatized for was being the \"wrong gender\" in the eyes of my grandparents and my parents literally stood next to me and them and let them insult me, while my parents then beat me\n\nThey don't mean well, they're just terrible people\n\n>you just need to find to be your best self.\n\nthank you for another empty platitude that doesn't mean shit",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "tnucffokcuf",
                                    "body": "I’m really sorry you feel this way. I didn’t know about your situation but I was hoping you the best!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "The Biggest lie someone have ever told me, thanks.",
            "score": 20,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Maybe I lied to make you feel bad for how you feel about yourself!",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jonshno",
            "body": "I doubt it",
            "score": 5,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "I do not!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_think_Im_hollow",
            "body": "This only applies to some. Definitely not me!",
            "score": 3,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "It applies to every being and everything on Earth.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "moneybagz1987",
            "body": "I thought people liked me...they really didnt like me at all ..i was just so self absorbed didnt see it...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Past-Bench415",
            "body": "Being yourself is one of the most beautiful things you can do. It’s your unique qualities and traits that make you special, and appreciating that is essential for true self-love.",
            "score": 5,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Thisss redditor gets it.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "donpuglisi",
            "body": "r/thanksimcured",
            "score": 5,
            "replies": []
        },
        {
            "author": "Gh0stl3it",
            "body": "🥹",
            "score": 2,
            "replies": []
        },
        {
            "author": "Szakred",
            "body": "This statement made assumption i have someone who thinks about me in the 1st place.",
            "score": 2,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "This was the intention I had.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Animelover5674",
            "body": "I'm happy you said that but now comes the question that I have a lot. What exactly is it do people, who have known me for less than a year or two, see that makes them like me that I haven't when I have spent more than a decade with myself?",
            "score": 2,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Outside perspective and appreciation for the simple (or complex) being that you are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Michaelbirks",
            "body": "[Citation Needed]",
            "score": 2,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Aw shucks, u got me. never been good at my citations in schools either.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Usual-Plantain9114",
            "body": "Unless you project your negative feelings towards others, then they are accurate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "effie_love",
            "body": "Eh it's not about if they like me it's about how crap they treat me regardless",
            "score": 2,
            "replies": []
        },
        {
            "author": "equiv00cal",
            "body": "Words are nice, but it doesn't make you feel any lighter",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vulpes_macrotis",
            "body": "Nah. In a way I hate humanity, I totally don't care what people think and say stuff that makes people angry. Because I don't care about their reaction. I only care about facts 99% of people are denying.",
            "score": 2,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Based, I like this way.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RevolutionMean2201",
            "body": "*hates you",
            "score": 2,
            "replies": []
        },
        {
            "author": "Otherwise_Sky2031",
            "body": "Thanks, I knew people like me for hating gays",
            "score": 2,
            "replies": []
        },
        {
            "author": "WildFruityRose",
            "body": "really? 🥺🥹",
            "score": 2,
            "replies": []
        },
        {
            "author": "glaucomasuccs",
            "body": "I can rationalize that to myself.  I really can.  I'm enough.  Got some stuff to work on, but I'm enough.\n\nProblem is that negative self-talk doesn't always get the memo, and it knows the right places to stick the knife.  Hard to stop yourself from beating yourself up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Milina",
            "body": "😭👍👍👍👍👍",
            "score": 2,
            "replies": []
        },
        {
            "author": "StreetDealer5286",
            "body": "I graduated  in 2010. All throughout my late Jr high- through high school I felt utterly  \\*alone\\*. I had a couple friends, but we all have our own lives. Life home was falling apart.\n\nNo one talked to me and I never talked to them. Only people who reached out were teachers, which, teenagers aren't so good at appreciating. I felt invisible, like no one knew I was there. I felt so utterly  \\*alone\\*\n\nFlash forward,  the number of people  who recognize my name from then, and remember me is astounding. It's  absolutely  surreal.\n\nTo know how I felt and have someone recognize me, not just that, but paid enough  attention to discuss what I was like. It's crazy to see.\n\nThere are a couple folks who thought I hated them, and they weren't even pinging on my radar  (which I feel awful for,  them thinking I didn't like them!). Once I explain  \"Oh man, I had no idea, life was being rough\" they understand.\n\nAdd in my mental stuff (not so good at picking up on things). It makes me wonder how many people may have wanted or tried to reach out and I just didn't  see it. \n\nA weirdly common thing was people being fascinated by how \"weird\" I was and wanting to get to know me more (but never did? They felt ignored whilst I never even noticed them reaching out?)\n\nBut, man, it's  wild to see.",
            "score": 2,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Truly is, I like to be me, straightforward for things, even though it’s hard for me to be open to people.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Specific_Attorney101",
            "body": "Hope it is real.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ice-cold-baby",
            "body": "I had a meeting online yesterday and it was with world experts in my field \n\nAnd I still hate myself for talking and expressing myself till now- I think I talked to much, too opinionated, and think too highly of myself \n\n:-(\n\nHow do I shake this feeling",
            "score": 1,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Expressing one’s self is okay, doesn’t matter why you do it. But ability to learn and assimilate from other’s input is just as much important as you being opinionated. Don’t beat yourself up for this.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Raeziel59",
            "body": "Except nobody love me",
            "score": 1,
            "replies": []
        },
        {
            "author": "umikali",
            "body": "Proove it",
            "score": 1,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "*Shows you in a mirror*",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Porkandpopsicle",
                            "body": "\\*throws up\\*",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Adept-Win7882",
            "body": "But I’m fat",
            "score": 1,
            "replies": []
        },
        {
            "author": "Funny-Performance845",
            "body": "I don’t believe you",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "unless you post motivational posts on Reddit, then you are most certainly a dungeon goblin.",
            "score": 1,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Wrong! Maybe I am a goblin.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "sell me your wares",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pancakebarber",
            "body": "False",
            "score": 1,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Falsen’t",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sillygoofygooose",
            "body": " NOT TRUE",
            "score": 1,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "Inv(NOT TRUE)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Otomo-Yuki",
            "body": "Impossible!",
            "score": 1,
            "replies": []
        },
        {
            "author": "vindicstion",
            "body": "Gaslighter",
            "score": 1,
            "replies": []
        },
        {
            "author": "rodejo_9",
            "body": "By everyone, they mean \"me, myself, and I.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Hard doubt there, champ.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iliekjokes",
            "body": "Hmmm... I disagree",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "What shattered compass you reading?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sethibus",
            "body": "Not true",
            "score": 1,
            "replies": []
        },
        {
            "author": "no_infringe_me",
            "body": "lol that’s a fucking lie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alex918YT",
            "body": "Yet another beautiful meme ruined by assholes. Thanks a lot everyone!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swaginatorr44",
            "body": "Deceit",
            "score": 1,
            "replies": []
        },
        {
            "author": "KneeEducational5886",
            "body": "Either that or the other way around. There is no in between.",
            "score": 1,
            "replies": []
        },
        {
            "author": "H-N-O-3",
            "body": "Nah most people i interacted with dislike me and i hate them !!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Revolution1571",
            "body": "Well that's not true at all. But thanks for being hopeful. In reality, everyone has many more negative things to say about me than I do",
            "score": 1,
            "replies": []
        },
        {
            "author": "OutlandishnessIll501",
            "body": "It pains me to say I can never believe that. I will never like myself as I am terrified of being perceived as selfish or a narcissist. I can acknowledge when I did good but only when others directly tell me so and I can tell they’re being genuine. I can’t, however, tell whether they’re being genuine half the time and so my default is that they’re not genuine. \nI want to work on this part of my personality but it’s really difficult because of this is reasoning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "demZo662",
            "body": "It makes sense, all the occasionally frown faces or suspicious lookings that people can end up putting out in the streets to other random people must be rethinked, thank you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "subaqueousReach",
            "body": "More being relative? So really they don't dislike me quite as much as I think?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "So you're telling me I'm wrong?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChildofFenris1",
            "body": "Thank tou",
            "score": 1,
            "replies": []
        },
        {
            "author": "cap10rob",
            "body": "Nope",
            "score": 1,
            "replies": []
        },
        {
            "author": "Terrible_Fuel_650",
            "body": "I hope so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive_Grade2056",
            "body": "Most people spend most of their  time protecting their own egos,  and like or dislike other people to  suit themselves",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turtletipper123",
            "body": "False, next question.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "tnucffokcuf",
                    "body": "How you treat yourself sets the tone for how others treat you. Always be kind to yourself, and others will follow.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}