{
    "title": "Well done Jordyn's Deli!! Inclusivity for the win!",
    "author": "Madelynn-Serene",
    "subreddit": "wholesomememes",
    "rank": 313,
    "score": 11735,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 105,
    "url": "https://i.redd.it/g9tdlvpzfehd1.jpeg",
    "id": "1en0idu",
    "selftext": "",
    "comments": [
        {
            "author": "the_nintendo_cop",
            "body": "An employer going out of their way to accommodate their employee’s disability AND being kind about it? Now that’s a pleasant surprise!",
            "score": 2221,
            "replies": [
                {
                    "author": "Akitiki",
                    "body": "I swear, you're more likely to find places like this at hole-in-the-wall spots. It's lovely. \n\nAt one point friends and I found a little diner, swung in, the food was amazing. It was gone next time we were around :/",
                    "score": 147,
                    "replies": [
                        {
                            "author": "the_nintendo_cop",
                            "body": "My general rule is that the shittier and more run-down a diner looks, the better it probably is. It’s always gonna be a lot better than some big corporation chain.",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "Gelby4",
                                    "body": "Too true.\n\nThere was a burger joint near me a few years back and it was a sticky, nasty dive and the pool table was barely playable because the floor wasn't flat. \n\nBut goddamnit if they didn't have the *best* Jucy Lucy's around. \n\n\nThen they remodeled during covid and now the place looks like management sold out to a sports bar landlord and the food fucking sucks.",
                                    "score": 33,
                                    "replies": []
                                },
                                {
                                    "author": "Sir_Micks_Alot69",
                                    "body": "This for sure! If the place looks like a shack, lightbulbs need to be replaced, there are stains on the floor, raggedy bushes and weeds out front, and that one shifty guy who seems to always be sitting in the same corner, you can usually be sure the food is going to be great.\n\nThere's a reason places like that stay open long enough to be rundown. And it's not the atmosphere or the one shifty guy.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "420PDXMatt",
                                            "body": "I am a regular at a certifiable dive bar with serious shit hole vibes. \n\n$1 tacos.\n$2.50 brisket or pulled pork tacos. \n$8 for a life changing BLT and potato salad. \n\nBut the bathroom is so gross that you can taste the smell.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sorcatarius",
                                    "body": "You can say the same thing about customer service, if you walk in and you get the whole, \"HI, welcome to (restaurant)...\" blah, blah, blah you're probably not going to get a bad meal, but it's probably not going to wow you. If you walk in, seat yourself and just get a \"Whatdoyouwant?\", they're in business for a reason, and it's not the welcoming staff, so there's a good chance it's the food.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jaiden_webdev",
                            "body": "Because those places still have the ability to be _human_ instead of being run by metrics and corporate policies. Unfortunately they tend to be put out of business by the ones that are ☹️",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "quantipede",
                            "body": "There was a little deli in my hometown whose entire building was like half the size of my apartment, and it was not really on one of the main roads either, so most people had no idea it was even there. Stopped by for lunch one day during college and it was the best sandwich I’ve ever had in my life and the workers were some of the friendliest people I’ve ever met. Went there for lunch almost weekly for a while.\n\nIt closed down shortly after I moved out of my hometown. I still think about that place probably once a week. There’s a little chicken wing place there now that is also pretty good and has managed to stay open for a while now so I wish them success, but man I miss that deli :(",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TikkiTakiTomtom",
                    "body": "Just a disclaimer as a piggyback since this is really wonderful and all but sometimes things just cant be accomodated for and that should be okay on the employer’s part. We do good so much people think that its supposed to be the norm when in fact it’s the exception",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "ournextarc",
                    "body": "They better be paying her a thriving wage, otherwise this is just a disabled person being taking advantage of because no one else is willing to work for scraps.\n\nThe accommodations are NECESSARY and nothing to praise if she works there. It'd be insane to not have them. But also, who else is cooking while that perch is in the way? Are there even any other cooks?\n\nNow if they're going the extra mile and ensuring she's making enough money to actually thrive? Like $25-33/hr, or more, then these people are truly making a difference to this amazing young woman.\n\nOtherwise, this is just more sociopathic, empty, feel good BS for those who can't see past the facade.",
                    "score": -117,
                    "replies": [
                        {
                            "author": "Pontuis",
                            "body": "I'm usually the first to point out the when \"orphan crushing machine\" stories are posted as feel good stories, but I think you're being a bit overzealous here.\n\nFirstly,  she wasn't hired as a chef, she was an employee who wanted to be a chef, they could have told her they didn't want to hire her in the kitchen and shut her ambitions down. \n\nSecondly, we have no proof she's being paid any differently to any other chef, if she is then you're correct, it's ableist, but if all the chefs make only $11 dollars an hour for example, then yeah they're all being economically exploited, but it's not due to her disability, that's because workers get fucked over by their employers.\n\nThirdly, it's really condescending to reduce her to her disability as a way to dunk on her place of employment who seemingly haven't done that, and have done a much better job of seeing her as a normal person with her own agency, which I'd wager is probably what she wants.",
                            "score": 95,
                            "replies": [
                                {
                                    "author": "ournextarc",
                                    "body": "Yes, and I'd wager what she wants is to be paid properly so she can actually have agency in her life, and I'd bet she and no one else there are paid properly.\n\nJust because she can work behind the kitchen doesn't mean they're taking advantage of her any less than others, it just means they're legally doing what they have to so she can do the job they're paying her for.",
                                    "score": -36,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "redditsellout-420",
                            "body": "Do you need a hug?",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "ournextarc",
                                    "body": "Yes, I hate seeing people being taken advantage of. Thanks, weirdo. You're the best.",
                                    "score": -61,
                                    "replies": [
                                        {
                                            "author": "marcijosie1",
                                            "body": " I love that you said \"yes\", putting the best possible spin on a comment that might have been meant as sarcastic and mean.",
                                            "score": 23,
                                            "replies": []
                                        },
                                        {
                                            "author": "redditsellout-420",
                                            "body": "Look, you see someone being taken advantage of, i see someone who gets a chance to own her disability and not have it own her, i know people who have disabilities who are bitter because they can't live a normal life, shes getting the chance to.",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JenniviveRedd",
                            "body": "I mean even with work incentives there is a chance a wage that high would likely preclude her from her social security benefits. Obviously everyone deserves a thriving wage but it's more complicated for people with disabilities to pursue thriving wages while maintaining financial based safety nets. It's always best, at least in America, to seek out benefits counseling or the work incentive network.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Shaolinchipmonk",
                                    "body": "Friend of mine ended up having to live in poverty just so he was able to keep his Medicaid and disability in order to afford his insulin.   His choices were either live in poverty and survive or get a job and die because he can't afford his medication.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ournextarc",
                                    "body": "That's truly messed up, though if she is earning enough to cover all her basic needs, then will she need the social security money? I'd vote yes for those with disabilities to have extra income still, as they likely have basic needs extending beyond what most do. And ultimately our society is a reflection of how we care for those needing the most help, or at least that sounds like a good goal to aim for.\n\nIt's crazy how much downvoting I got for suggesting she be able to actually pay her bills and live her life, instead of seeming to be stuck working for low pay and long hours. I'll point out again, I don't imagine anyone else is cooking while her perch is there - maybe I'm wrong, but that seems like a lot for 1 person if it gets busy, especially someone having to slide themselves back and forth across the perch, which looks exhausting to have to do.\n\nThis girl is amazing and I truly hope she is being cared for properly and not simply getting her base legal requirements met. You all are nuts for disagreeing.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Eaterofkeys",
                                            "body": "It's not just social security money, it's access to things like insurance and other stuff like transportation coverage to medical appointments that's part of being on disability",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "ziddity",
                                            "body": "The downvoting wasn’t about suggesting she should be able to pay her bills. It was about questioning whether she’s already being fairly compensated for her work.\n\nDo you have any evidence that she’s underpaid, or are you just making unfounded assumptions to criticize those who are pleased that her employer is going above and beyond to support her dreams?\n\nIt seems like you’re trying to portray the employer negatively without any real basis. Sometimes, it’s important to recognize and praise good actions rather than assuming negative motives. People can genuinely want to do good things.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "ournextarc",
                                                    "body": "How much are you wiling to bet that a random sandwich shop is paying their employee a thriving wage thats meaningfully above minimum wage such that she can actually thrive? If they were, I bet they would've mentioned that too because then wow - they're actually doing something out of the kindness of their hearts that the law doesn't require of them, like the bench does.\n\nTheir good motive is not getting in trouble for not providing the bench to a worker who needs it. They HAD to do it if they were going to let her cook - what evidence do you have that it was done out of the kindness of their hearts, other than the story?\n\nYou all can keep falling for these ridiculous stories, and keep getting benches and pizza parties, or you can start demanding proper fucking wages. We should only be commending jobs for providing a way for employees to actually thrive, which is ONLY done by ensuring they earn enough to provide for their basic human needs, and anything else is just smoke blown up our asses.\n\nPay this girl a thriving wage - $33/hr minimum with full benefits, then I'll be impressed. Until then, they're just avoiding going to jail or paying fines by not having the bench available.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SlugDogHundredaire",
                            "body": "Her grampa helped build it to make her dream a reality. I know I'm cynical, but gosh dang. Who hurt you, Friend? How can we help?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ournextarc",
                                    "body": "Hug me.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SlugDogHundredaire",
                                            "body": "Bring it in here buddy. I got you 🤗",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BellCurious7703",
                            "body": "This is one of the most “Redditor” comments I’ve ever seen",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RexImmortall",
            "body": "If all employers were so considerate of their employees the world would be a much better place.",
            "score": 485,
            "replies": [
                {
                    "author": "Smooth-Lengthiness57",
                    "body": "I imagine it must not be easy for a disabled person to find a job, and she looks so happy. This is how you get loyalty and respect from your employees",
                    "score": 113,
                    "replies": [
                        {
                            "author": "RexImmortall",
                            "body": "People like her are the light of this world.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "RexImmortall",
                                    "body": "Hope is a green flag",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "The_Chosen_Unbread",
                                    "body": "I watch a lot of truencrime...don't give her those red flags",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Summonabatch",
            "body": "I wasn't all that hungry until I saw that sandwich. All of a sudden I could really go for a Reuben.",
            "score": 119,
            "replies": [
                {
                    "author": "BreathLazy5122",
                    "body": "That Reuben looks amazing. I’d become a regular just to support her and the business that went above and beyond for her. This is wonderful.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 82,
            "replies": [
                {
                    "author": "Actuality_Realized",
                    "body": "I was just thinking it looks rather picturesque",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "I-am-Chubbasaurus",
            "body": "That sarnie looks like an absolute banger, too.",
            "score": 31,
            "replies": []
        },
        {
            "author": "GruxKing91",
            "body": "This place is awesome!  https://www.jordynsdeli.com/",
            "score": 21,
            "replies": []
        },
        {
            "author": "Able_Wrangler_3656",
            "body": "It's great when you're passionate about what you do, especially when you achieve positive outcomes.",
            "score": 41,
            "replies": []
        },
        {
            "author": "KikinLife",
            "body": "Wait a second. I know that girl! I went to high school with her.",
            "score": 28,
            "replies": []
        },
        {
            "author": "robbert-the-skull",
            "body": "I'm surprised the health department isn't giving them a rough time because her hands are touching the bench.\nNo shade towards her by the way, I've just dealt with a few inspectors with rusty polls up their butt over silly stuff. \nLike the fact that there's oil on the butcher block... That you're supposed to treat with oil. You'd think a health inspector would be aware of that fact.",
            "score": 16,
            "replies": [
                {
                    "author": "allisjow",
                    "body": "I think she uses her hands on the bench, then puts on clean gloves to make the food. There are ways to accommodate her that would satisfy a health inspector. We had a bucket of water and sanitizing fluid with a rag to wipe down surfaces regularly.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "unstable_tits",
            "body": "My job fired me for needing a stool so I don't Crack my head open every time I keel over",
            "score": 6,
            "replies": []
        },
        {
            "author": "rynomite1199",
            "body": "Where’s this place located? I want to go get a reuben sammich!",
            "score": 4,
            "replies": [
                {
                    "author": "llumpire",
                    "body": "Falling Waters, WV (eastern panhandle of the state). About 5-10 mins from the MD/WV line",
                    "score": 5,
                    "replies": [
                        {
                            "author": "rynomite1199",
                            "body": "🫡",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "beewoopwoop",
            "body": "lemons are not enough to make lemonade. you also need water, sugar and a vessel.",
            "score": 12,
            "replies": []
        },
        {
            "author": "tessellation__",
            "body": "🥲",
            "score": 4,
            "replies": []
        },
        {
            "author": "dreamrock",
            "body": "That Rueben looking hella tasty, tho.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TrumpsEarHole",
            "body": "No kidding! That looks like a happy person. Here we are able bodied and miserable fucks (speaking as a generality, I’m actually very happy in life), while this lady goes on making it work and being happy all along the way.\n\nI’d eat there 👍",
            "score": 5,
            "replies": [
                {
                    "author": "neeksism",
                    "body": "For real! That's my favorite sandwich, I wanna try it out.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "daseofspades",
            "body": "That Reuben looks delicious, she can throw down!",
            "score": 6,
            "replies": []
        },
        {
            "author": "GrownJaguar",
            "body": "Location would be a good addition to this post…",
            "score": 3,
            "replies": [
                {
                    "author": "llumpire",
                    "body": "Falling Waters, WV (eastern panhandle of the state). About 5-10 mins from the MD/WV line",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smooth-Lengthiness57",
            "body": "Makes relatively small accommodations to make a huge impact, plus that sandwich looks fantastic. Good job Jordyn's Deli",
            "score": 3,
            "replies": []
        },
        {
            "author": "anA6666",
            "body": "This is what engineering is about. Solving problems.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Maleficent-deviant",
            "body": "How does she move between the bench and counter without using her hands? Id be concerned about hygiene 100% (worked in kitchens b4)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Leon_Krueger",
            "body": "This is the truth inclusivity",
            "score": 5,
            "replies": []
        },
        {
            "author": "SlugDogHundredaire",
            "body": "Posts like make me want to believe in the goodness of humans again. Please let this sub continue forever. I want to believe.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GNPTelenor",
            "body": "Attagirl, Angelina! I will have a reuben!",
            "score": 2,
            "replies": []
        },
        {
            "author": "AVnstuff",
            "body": "This is great and I love employers accommodating disabilities, but as a disabled person myself I do feel the need to point out that accommodations are legally required - so let’s not lose our minds that this place met the bare minimum after having originally designed their kitchen in a way that was not already ADA compliant.",
            "score": 5,
            "replies": [
                {
                    "author": "Finbar9800",
                    "body": "Most kitchens aren’t very wheelchair accessible…",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "ertgbnm",
                    "body": "This is way beyond simple ADA compliance.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "BloodguardMhoram",
                    "body": "And not required to be ADA compliant.",
                    "score": 25,
                    "replies": []
                }
            ]
        },
        {
            "author": "Great_Examination_16",
            "body": "...damn. I doubt you'll get more motivated workers than that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nessie182",
            "body": "That’s so thoughtful!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Florissssss",
            "body": "That's really going above and beyond! Not the kind of job I'd expect to really be possible for someone with that kind of disability but really inspiring to see!",
            "score": 1,
            "replies": []
        },
        {
            "author": "prrosey",
            "body": "True inclusion is the feeling of belonging somewhere. It's the simplest thing we can do for one another.",
            "score": 1,
            "replies": []
        },
        {
            "author": "llumpire",
            "body": "Their food is really good as well",
            "score": 1,
            "replies": []
        },
        {
            "author": "morgaina",
            "body": "I would be worried about her hands touching the bench when she has to move while making food... is she really gonna switch gloves EVERY SINGLE TIME she has to move 1 foot to the left??",
            "score": 1,
            "replies": [
                {
                    "author": "ichkannkochen",
                    "body": "Dont worry. Worse is happening every day and were still standing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZeJohnnis",
            "body": "This is amazing and I fully support that place, though I have some questions about the system shown\n\nWe need more of this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "hoofcake",
            "body": "*everyone liked that*",
            "score": 1,
            "replies": []
        },
        {
            "author": "boonieOz",
            "body": "Those Ruben’s look amazeballs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Familiar-Entrance-48",
            "body": "The thing I really hate about post like this is that I am only allowed one one upvote.  Kudos and well wishes to the deli owner!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cute-Sort9520",
            "body": "Hell yeah things like this keeps dreams alive and reminds dreamers to reach for the stars. Keep up the good work. Keep making amazing Reubens",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpriteTheBirb",
            "body": "Yeah! In Brookings, Oregon they used to have this awesome place called Zola’s. It had the best pizza ever and the walls were completely sealed covered in drawings from the customers. Everybody’s got put up, it was so sweet. The restaurant is still there and the food is still the same, but they made it fancy and they took down most of the drawings and stopped adding more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirConcisionTheShort",
            "body": "I'm all for inclusivity but I hope that she doesn't work alone (mainly for her safety, but also the clients) and I'm not a fan of those self-promoting posts. Is OSHA fine with this ? The fire marshall ? The insurance compagny ? The health department ?\n\nAs an health and safety officer, I had to intervene somewhere  people with Down syndrome were taken advantage of and doing unsafe work for them...",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoBadit_Hurts",
            "body": "I’m not crying… she’s cutting onions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "L1LREDD",
            "body": "Aht aht aht!!! While this is an awesome story, in order to fully comply with the new administration’s band on everything DEI, I expect this young lady’s resignation and the removal of the equipment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cerberus_Rising",
            "body": "Angelina is a rock star!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "author": "None",
                    "body": "Yeah one call to a health inspector by a pissed off customer and boom. They are fucked.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "kesselrhero",
            "body": "I hope you got your insurance companies approval.",
            "score": -14,
            "replies": []
        },
        {
            "author": "FatheroftheAbyss",
            "body": "it’s fucked up for them to post this online, anyone agree? like using her as an advertisement disgusts me. “oh, look at how good we are!”",
            "score": -9,
            "replies": [
                {
                    "author": "bfadam",
                    "body": "To be fair it might be inspiring or uplifting for a lot of people ( we need nice things these days damn it )",
                    "score": 8,
                    "replies": [
                        {
                            "author": "FatheroftheAbyss",
                            "body": "i guess i can see that perspective, it just feels exploitative to me. like i would think we’d just want to not make a big deal out of it and treat her as normal, but i can see how talking about it could raise awareness for people or something",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Peaches_JD",
                                    "body": "I’d like to add that by sharing it he is showing other businesses a great way to handle disability in the workplace, and showing by example what the standard should be but sadly is not.\n\nPlus she doesn’t look like she minds! She wanted to cook, hopefully this draws her a large crowd daily.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "-TheManInTheChair",
            "body": "If anyone says this belongs in Orphan Crushing Machine, imma fight them.",
            "score": -13,
            "replies": []
        }
    ]
}