{
    "title": "What's the kindest thing you've done?",
    "author": "psycholol2",
    "subreddit": "wholesomememes",
    "rank": 288,
    "score": 5792,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 113,
    "url": "https://i.redd.it/dxs3pvpa81jd1.png",
    "id": "1etpkmb",
    "selftext": "",
    "comments": [
        {
            "author": "Kangarou",
            "body": "So I accept the award on my opponent’s behalf.",
            "score": 166,
            "replies": [
                {
                    "author": "deadman2382",
                    "body": "Chad move",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Smooth-Lengthiness57",
                    "body": "My opponent will be so incredibly pleased it makes me happy",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Unable-Article-1654",
                    "body": "I accept the award on everyone’s behalf. You all deserve it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neutreality1",
            "body": "I don't brag about the kind things I do",
            "score": 397,
            "replies": [
                {
                    "author": "bullymeahhh",
                    "body": "You just bragged about not bragging",
                    "score": 249,
                    "replies": [
                        {
                            "author": "inbigtreble30",
                            "body": "\"Not bragging\" isn't an example of a kind thing.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "here_we_fuckin_go",
                                    "body": "\"...the kind things I do\"\n\nHe does kind things, so he says.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "inbigtreble30",
                                            "body": "Yes. He says he does kind things. He says he doesn't brag about doing kind things. Next person says he bragged about not bragging, thus implying that \"not bragging\" is one of the kind things he does. The joke is less funny when you have to explain it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "here_we_fuckin_go",
                                                    "body": "OK you don't have to explain it to me, I can follow a simple conversation and this one was funny until you interfered 🤪",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "bullymeahhh",
                                    "body": "They went out of their way to mention that they do kind things.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Atlas1347",
                            "body": "\"not bragging\" isn't a kind thing anyway",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cylonlover",
                    "body": "Oh yeah? I do it even less than not. Look up 'Humble' in the dictionary, there's me, with the lowest profile, in your face!",
                    "score": 38,
                    "replies": [
                        {
                            "author": "Erdapfelmash",
                            "body": "The only thing I'm not good at is modesty. Because I'm great at it.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Praescribo",
                    "body": "Where's the fun in that? The worst you can do is end up inspiring someone",
                    "score": 46,
                    "replies": [
                        {
                            "author": "MommyRaeSmith1234",
                            "body": "Agree with this. Don’t go around talking about it all the time but this is literally a forum for talking about it. And I’ve definitely gotten fabulous ideas from these kinds of things.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "vxspit",
                            "body": "fr as hellll these kids need better fuckin role models. public figures dont seem to be fully digesting the impact they make on society and are just being absolute clowns out here. positive reinforcement n exposure… it be the only way. so if someone wants to celebrate doing a good thing it rlly doesnt hurt anyone so why be a hater ya kno?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 10,
                    "replies": [
                        {
                            "author": "unsolicited_flattery",
                            "body": "Exactly. There doesn’t have to be a reason leading up to it. You don’t have to known the person to be kind to them.  Just about appreciating others as our fellow human beings:)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Winged_Metal",
                    "body": "Then, instead of bragging, how about something that could be shown as an example of kindness that others can learn from?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Brilliant-Orchid-693",
                    "body": "Sure mate Live long and stay strong! 💪🏻",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Brilliant-Orchid-693",
                    "body": "Sure mate Live long and stay strong! 💪🏻",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GraciesMomGoingOn83",
            "body": "The kindest thing that was ever done for me was the day my dad died, my aunt met me at the front door of my childhood home so I didn't have to walk in alone.",
            "score": 200,
            "replies": [
                {
                    "author": "Cultural_Head_9237",
                    "body": "Sorry for your loss, and Wow, that was really sweet of your aunt. Grief is processed a lot better when you have loving family and friends around.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "GraciesMomGoingOn83",
                            "body": "Grief shared is grief halfed, that's for sure.  She's an amazing lady.  I have been blessed by a whole bunch of amazing people through a very tough time.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "For weeks, I stayed up past midnight for hours on schooldays, billing on overseas phone-call costs just to keep my friend going and convince her to keep taking her anti-depressants when she was wrought with deep, deep depression. Now she's a little more stable with a good routine to keep herself going, so I'd like to think I helped.",
            "score": 58,
            "replies": [
                {
                    "author": "Key_Part_9573",
                    "body": "\"There's a star man... Waiting in the sky...\"",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "doortju",
                    "body": "Thank you for being there for her. Everyone deserves a friend like that",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Slight-Coat17",
            "body": "I tried learning a new language to talk to the new girl in school because she was always by herself.\n\nWe're still good friends today.",
            "score": 55,
            "replies": [
                {
                    "author": "KlumseeOfficial",
                    "body": "Reminds me of a certain anime that recently came out...",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Slight-Coat17",
                            "body": "Should I claim copyright? Mine happened almost two decades ago...",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Abhishek_Pbx",
                            "body": "Alya sometimes speaks in russian?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KlumseeOfficial",
                                    "body": "Yessir!!!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "doortju",
                    "body": "What a lovely bromance",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dvdpap",
            "body": "I was flying home to Europe from Florida after a business trip and had a layover in DC. They didn't accept my debit card at the airport when I tried to get food, and i was soooo hungry. i felt like I was gonna faint. The guy behind me offered to pay for the food I ordered, and all he asked for in return was that I do the same for others. 2 years later in Europe, some american tourists were eating at the restaurant I worked at, but our machine did not accept their American Express card. I told them the story and then paid for their meal, telling them the same thing the guy told me. They were very thankful and left with a huge smile on their faces, and it made me feel good too.",
            "score": 39,
            "replies": [
                {
                    "author": "samuraiseoul",
                    "body": "Today you tomorrow me! \n\nIts a famous reddit post from like a decade ago! Very similar vibes!",
                    "score": 13,
                    "replies": [
                        {
                            "author": "milkandkaapi",
                            "body": "I’m surprised no one has made a Reddit lore bot you can invoke. We have the technology. Zero code and all that. So I hear at any rate.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "samuraiseoul",
                                    "body": "Be the change you want to see! Go make one! :D",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "milkandkaapi",
                                            "body": "I was waiting for someone to encourage me. Thank you :D",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "samuraiseoul",
                                                    "body": "You got this!!! I believe in you!",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Doot-Doot-the-channl",
            "body": "It’s incredibly rude to not show up to a planned event without canceling prior to the actual event therefore you are the nicer person",
            "score": 62,
            "replies": [
                {
                    "author": "JediTigger",
                    "body": "NB: double true for wedding invitations since most of them cost the bride and groom per head.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "WaterPrincess78",
                    "body": "But it was never said the opponent didnt cancel. So I geuss the competition all rides on whether or not they didn't. Since if they did, we would find out from staff, and they would still win",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "AmArschdieRaeuber",
                    "body": "They did that to seem rude to make you actually win and to avoid the scenario in the post",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ryancaa",
            "body": "I was dressed as Santa for a friend’s kiddos in 2020. Went to visit. Brought gifts. Lady was having a smoke out front after I left. She asked if I, Santa, would take a picture with her granddaughter. \n\nI said of course and next thing I know I’m standing on their stoop taking a pic with Ms Zianna. A 4 year old who told me she wanted an Elsa doll for Christmas. \n\nI took note of the home address and went out to  Amazon and rushed an order to her home with an Elsa Doll. $25 goes a long ways when you’re Santa ❤️",
            "score": 25,
            "replies": []
        },
        {
            "author": "flowerofhighrank",
            "body": "I would NEVER mention any of this outside this context, and I will never speak of them again, probably. But you asked.\n\nA few years ago, my wife had an extra car, slightly beat up but safe and running. I had an ex-student who had a run of tough times: got a girl pregnant, had a special needs baby who required a lot of care. He was working 2 or 3 jobs to pay the bills. My wife decided to give him the car. Turned out that he... didn't have a license and wasn't ready to be a driver.\n\nThat day, a neighbor popped up who was caring for her terminally I'll mom and needed a car for the time she'd be here. My wife sold her the car for cheap (good deed 1), then turned around and gave my student the cash. No strings, no requests, has never even met the kid or his family. Just boom, here's 3k, hope it helps.\n\nMe... I try to do things like this as often as I can. I believe that I was blessed and that I need to be the person I could have used in my youth.",
            "score": 23,
            "replies": [
                {
                    "author": "milkandkaapi",
                    "body": "Thank you for talking about this. The rich get a bad rap but some of us are kind. I see you. It’s nice when a person allows you to use your resources to help them. Whatever those resources might be.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "flowerofhighrank",
                            "body": "I'm not rich, but I know I've been lucky and a little bit smart. We do what we can!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Max7000FangKaibrawls",
            "body": "Help people when I can :)",
            "score": 18,
            "replies": [
                {
                    "author": "Hiberniae",
                    "body": "This is a great philosophy because it honors both yourself and others 💚 If you can’t, that’s cool. If you can, that is too.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Max7000FangKaibrawls",
                            "body": "Apreceate it !(I dunno how to spell that word, also English isn’t my native language)",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Putrid_Caterpillar_8",
                                    "body": "It’s appreciate",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Hiberniae",
                                    "body": "It’s mine and there are words I absolutely cannot spell 🤣",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Max7000FangKaibrawls",
                                            "body": "Good for you lol 😂",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Max7000FangKaibrawls",
                                            "body": "Good for you lol 😂",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AddisonNM",
            "body": "My dad, the day of, hours before he died...I gave him permission to let go.\nHe spent nearly 3 years in long term care, for those with dementia/Alzheimer's. I held his hand and told him \"you didn't sign up for this, you are tired and can let go now.\" \"When you sleep tonight, just rest. You don't need to stay for us-you taught us everything we need.\" \"I love you dad, am not saying goodbye, because we will meet again\".",
            "score": 17,
            "replies": []
        },
        {
            "author": "Disastrous_Pass755",
            "body": "During the heatwave here in Sacramento, I made sure my drink cooler was full of cold waters. everywhere I was if I came across a delivery driver, I would give them a cold water.",
            "score": 17,
            "replies": []
        },
        {
            "author": "abraxassmiles",
            "body": "I had a full-ride scholarship to college that covered tuition, plus a stipend for room and board. My last semester I did a study abroad program that was covered by a generous donor gift. When I got back for graduation, the bursar's office called me in and cut me a check for almost $2500 -- my stipend for room and board for that semester. I was so embarrassed that the college was paying me on my way out the door when many friends were already dreading their student loans. So I put the money anonymously into another student's account - someone who I knew was burdened by loans and going into a low-paying service career. Not a moment of regret.",
            "score": 13,
            "replies": []
        },
        {
            "author": "itskinda_sus",
            "body": "Back when I was in the 10th grade and was struggling with my studies, one of my classmates used to show up even on her study holidays to teach me chemistry. We were friends but not really close enough for her to do this. She never asked for anything but just sat there teaching me chemistry. I was not even a super nice person back then. Till this day I wonder what made her do it and it is one of the kindest things someone has ever done for me in my life. I hope she lives a good life!",
            "score": 7,
            "replies": []
        },
        {
            "author": "jamesanthony1984",
            "body": "One time a clearly methed out dude hit me up for money in a parking lot at a grocery store. He had three kids with him and only asked for a few dollars to buy some medicine for one of his sick children, I took him inside the grocery store and spent about $60 buying him anything you wanted. He was so grateful afterwards that he cried. But I told him that I was so grateful for HIM and the opportunity he had given me.",
            "score": 14,
            "replies": []
        },
        {
            "author": "xHeylo",
            "body": "Just resign from the Competition as it's unfair to your Competitor that they don't have the chance to compete just because they weren't there\n\nAlways remember if there are two people standing at a door and both are insistent on letting the other go through first, neither person is getting anywhere to a point that it's not even courteous anymore",
            "score": 13,
            "replies": [
                {
                    "author": "Saint_vamp",
                    "body": "Thats not a nice problem, refusing a gift is rude so the first person to offer gets to hold the door.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "xHeylo",
                            "body": "true true\n\nkindness is a sprint",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Daddygamer84",
                    "body": "\"I insist, you first\"\n\n*\"It's quite alright. After you\"*\n\n\"It's no problem. I'm right behind you\"\n\n*\"Oh no, I couldn't possibly\"*\n\n\"LISTEN HERE YOU LITTLE SHIT!\"",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Western_Mud8694",
            "body": "Classic 🤣🤣🤣",
            "score": 4,
            "replies": []
        },
        {
            "author": "Crazytem450_",
            "body": "Overcoming my fear of every insect and throwing the spider out the window instead of killing it😘",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ant-Tea-Social",
            "body": "I put $500 in an envelope, then placed the envelope in the tip jar of a cafe I knew was closing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RocketFosteR",
            "body": "I worked at a supermarket, and a woman came to me asking if we had any of the backpacks she was trying to buy to her little daughter. I found one on the top shelf of the warehouse. I wasn't allowed to drive the forklift. I spent 10 minutes finding someone to bring the backpack down and deliver to her. It's stupid but it's really nice to make people smile over simple things",
            "score": 3,
            "replies": []
        },
        {
            "author": "onnlen",
            "body": "Love myself finally.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "I was drunk and going for a walk at night. I saw someone sleeping on the streets. I went to a Mcdonalds, bough a combo I could afford at the moment. I return to the man, woke him up and gave him the meal.... It wasn't the smartest move to woke up someone sleeping but oh well",
            "score": 2,
            "replies": []
        },
        {
            "author": "imaverylonelyguy",
            "body": "not telling my mom what I do to not worry her that I'm trying to off myself each night",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "imaverylonelyguy",
                            "body": "6 attempts\nso many knives in my back\neven being cheated on\nI'd rather eat glass than allow anyone near me\nso thanks but no thanks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bloggerman_",
            "body": "Stopping mid shopping to help an old man who was stuck in the middle of a frozen puddle, and helping an old woman with a broken wrist carry a microwave from the store to her car.\n\n\nDoes this counts?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Embarrassed_Tour_141",
            "body": "Diabolical 🫡",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miserable-Willow6105",
            "body": "Idk, I don't quite remember. I am just trying to be nice to everyone, though it does not always perfectly work out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Small_Speaker_3159",
            "body": "Isnt it rude to stand someone up?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I swear posts like these are bots, to get users to engage and share info. See similar shit scrolling through reddit. Like zero imagination filler bot nonsense, dead internet",
            "score": 1,
            "replies": []
        },
        {
            "author": "Time-Bookkeeper-7959",
            "body": "I was commuting back home from applying for a college and had a really bad sore throat with phlegm and always coughed, so I had myself some hot cocoa on me. While walking up the bridge's steps from the overpass, there was this old guy on a wheelchair and was begging and had a Mcdonalds meal only. It was cold out because it recently stopped raining at the time, and so even if I needed to warm my throat to ease  my cough, I gave the hot cocoa to the old guy and said that it's still hot before continuing up the bridge. Hope that little thing made him feeo a bit better too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "06lele",
            "body": "A nice person competition is just a competition about who is better at making other people look bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "goddamnit_people",
            "body": "The kindest thing someone has done to me: I have always felt a little insecure from time to time in my body. I know I am pretty but sometimes it's just so hard to believe it. I was in a vacation just having fun with my boyfriend and this amazing lady just stopped me, asked me how long we are staying here, and we talked with her a bit. At the end she just told me how pretty my smile his and how it lights me up, she told me to never stop smiling and she wished me the best in life. Whoever she was I love her, i think about that often, she was a beautiful women with a pure soul and I just wish i could tell her how many times I think about this simple interaction. Now I try to do the same with other people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Informal_Custard_234",
            "body": "It's not a competition",
            "score": 1,
            "replies": []
        },
        {
            "author": "AbominationBread",
            "body": "A guy I didn't know in the window seat next to me on a plane held up his coat to block the sunlight from the window seat in front of him that was getting in my face. I have light sensitivity and he just noticed that I was trying to block it myself. It wasn't getting in his face so it was specifically for my benefit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Gave my blood to my enemy did not let him know whose blood he got",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Didn't slaughter people for them trying to blame me and sacrifice me for their sins. Cuz I know what will happen to them if they don't stop it will be THEM going to the lowest hell, not me. Don't believe me? Ask HaShem.\n\nPsalm 63:9-11\nKing James Version\n9 But those that seek my soul, to destroy it, shall go into the lower parts of the earth.\n\n10 They shall fall by the sword: they shall be a portion for foxes.\n\n11 But the king shall rejoice in God; every one that sweareth by him shall glory: but the mouth of them that speak lies shall be stopped.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IPanicKnife",
            "body": "A waitress at ihop had a couple people walk out on her without paying the bill. She was crying because she was fairly new and was worried about them coming down on her. She was in tears. I covered their check and left a generous tip.",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_love_dragons_66",
            "body": "I towed people up the hill in a snow storm. They couldn't make it up the hill with the snow, so I towed them up. I basically fixed a traffic jam. With a tractor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shady_Bebo",
            "body": "One kind thing done for me: My best friend has helped me organize my room when it has gotten really crazy over the years, she puts in a ton of error and true care and concern and time. It makes me feel like everything is going to be okay - a huge weight lifted. So much time spent just to ease my burden, that's a really kind thing for someone to do.",
            "score": 1,
            "replies": [
                {
                    "author": "Shady_Bebo",
                    "body": "Effort*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bugnmud",
            "body": "For my 10th birthday I raised money and accepted donated blankets to make a care package for the homeless in my major city. We walked around for so long handing them out and seeing the excited expressions on their faces made me so overjoyed. This one guy was sleeping curled up in a ball on the ground with nothing and I got to lay a blanket on top of him, it almost brought me to tears. I hope he’s doing better now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-EV3RYTHING-",
            "body": "I don't know. Maybe I haven't done anything notable, or maybe I did something very kind without thinking about it. I've no way to know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outrageous-Collar-09",
            "body": "A friend was scared in the middle of the night cuz of heavy rain and thunder, 2 am ish. She was alone. I stayed on the phone with her till 5 and then rode to her house. \n\nIt was only after I went there that she was able to sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silent-Yard7259",
            "body": "Lol this is a goof one",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShittDickk",
            "body": "But the real best boy is Stan Smith.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Bought a guy some food, barely understood him, don't have much myself and wasnt happy that I did it, hoping if I ever need help, the karma will reward my good deed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important_Tale1190",
            "body": "But I spent so long practicing for the games and events and now there won't be any! T\\^T",
            "score": 1,
            "replies": []
        },
        {
            "author": "PlasticMechanic3869",
            "body": "Did my 59th blood donation today. I guess that counts. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "doortju",
            "body": "I was very sick today (presumably endometriosis) and almost fainted in the train. I am very grateful for the people who came to check up on me, even if it was just a paracetamol, water and a conversation to them, it made my day a lot more bearable ❤️\n\nI know the question was what I did but I feel like today is their time to shine so I wanted to mention it anyway",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecessaryUnited9505",
            "body": "I post here describes it well but Idk how to link it so I'll say the title\n\n\nWhen your dead inside but you go out of your way to support your friend",
            "score": 1,
            "replies": []
        },
        {
            "author": "cinna_bun82",
            "body": "“Ahhh, a man of culture I see”",
            "score": 1,
            "replies": []
        },
        {
            "author": "LilyWineAuntofDemons",
            "body": "So I live in a small town, and just outside the city limits is this nice woman who runs a Doggy Daycare for really cheap. I take my dog there because I work nights, and it's unfair to have him basically be forced to sleep all day and all night because of this, so he can play all day at daycare and I can sleep.\n\nSo I was driving out of town to to pick up my dog from daycare and I see this guy walking on the shoulder barefoot. So I pull over, and ask if he needs a ride somewhere. Unfortunately where he needed to go was about an hour away, and I had work in about that amount of time, unfortunately. So I drove him as far out as the daycare, took off my shoes and gave them to him and I gave him my unopened bottle of water. I figured I couldn't take him all the way to where he needed to go, but at the very least I could make the trip more comfortable.\n\nIn hindsight, I kind of wished I'd said \"Fuck it.\" and took him, considering that job was seriously fucking me over, but hindsight is 20/20. I think about that guy every now and then, he was obviously going through some shit, and was having a rough go of it. I hope he's doing well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dragoon_khan",
            "body": "I once let a mosquito have its fill",
            "score": 0,
            "replies": []
        }
    ]
}