{
    "title": "Old-timey selfie",
    "author": "bondjimbond",
    "subreddit": "wholesomememes",
    "rank": 186,
    "score": 1182,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 16,
    "url": "https://i.redd.it/0cavzzp1xtmd1.png",
    "id": "1f8zje9",
    "selftext": "",
    "comments": [
        {
            "author": "PuzzleheadedFloor452",
            "body": "Oooo! This is really good!",
            "score": 27,
            "replies": [
                {
                    "author": "bondjimbond",
                    "body": "Thanks! I've got more wholesome comics I might share here.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "PrestigeMaster",
                    "body": "Is it wholesome? I see where maybe it might be bc the guy agreed to a labrous task for a stranger - but I’m fairly certain the point is that the painter is better at painting just like the selfie person is better at taking selfies.   \n \n I think the joke is that if you give your camera to a passerby, it is likely that you will receive pics back that don’t look good to you, the same as the artist in the picture is about to receive something that he wouldn’t really call “art”.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "PuzzleheadedFloor452",
                            "body": "I thought it was like \"hm I'm having trouble getting a portrait of myself, oh I can ask this guy!\" And him not caring if it is perfect or not, just that he was having someone else help! Kinda like when beginner artists do fan art and experienced artists are proud. I mean you can tell that the person in the last picture is trying hard",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "bondjimbond",
                                    "body": "In my first draft I had the donkey guy offer to do it for him, but I decided this version was funnier.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PrestigeMaster",
                                    "body": "If there was a frame that showed him happy to receive the finished product I would agree. I guess it’s open for interpretation as is.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Trickion1209",
            "body": "I would take art classes just to draw this fine sir requiring my help.",
            "score": 10,
            "replies": []
        },
        {
            "author": "imanoob87xd",
            "body": "There are so many new comics other than the qwest buddy and crocodile guy now i love them",
            "score": 7,
            "replies": [
                {
                    "author": "bondjimbond",
                    "body": "Thanks! I've been around for a while (October 2021), but my stuff doesn't get that much traction in the comics subs.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "imanoob87xd",
                            "body": "Yea if u wholesome ones post them here theyre very cool",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TangoAlfaKilo",
            "body": "This is hilarious! :D",
            "score": 5,
            "replies": []
        },
        {
            "author": "Watson_221B-ST",
            "body": "Hun you’re so late what took you so long!!!\n\nSorry babe, had to stop and help this guy with his selfie on my way home",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrumbCakesAndCola",
            "body": "that donkey bout to start some trouble",
            "score": 1,
            "replies": []
        }
    ]
}