{
    "title": "I was just infodumping to her about MCR a few days ago",
    "author": "BlueMoonRaccoon1",
    "subreddit": "wholesomememes",
    "rank": 147,
    "score": 9816,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 68,
    "url": "https://i.redd.it/pfggjfqmhfsd1.jpeg",
    "id": "1fuu7a4",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hey /u/BlueMoonRaccoon1! Thank you for your submission!    \n\nYour post submission to r/wholesomememes has been sent to the queue pending mod review and approval. Please do not message the mods regarding your post or delete your post while it is in the queue for review.\n\nThanks for understanding! Stay wholesome. <3\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wholesomememes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fox_McCloud_Jr",
            "body": "This made me really miss talking to my little sister, she's okay, just 2 states away and too busy with school.",
            "score": 209,
            "replies": [
                {
                    "author": "ThisIsTheBookAcct",
                    "body": "In college? I loved surprise gift boxes of random stuff.\n\nNot the same as talking, but could inspire a call/text. And they’re fun to make, imo.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Fox_McCloud_Jr",
                            "body": "Nah she's in high school. And I send her things from time to time. She really likes art and I send her art stuff here and there when I get the chance",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Ladylamellae",
                                    "body": "Barely hear from my little sister in high school as well, it's criminal the amount of busy work they have these kids doing.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SentientSandwiches",
            "body": "I love listening to my kids tell me all about their latest game, I haven’t got a clue most of the time but I listen and ask questions where I think they are needed and they can’t wait to come and tell me stuff after school. Parents say their kids don’t talk to them, but they do, it’s just you have to also listen to all the roblox, assassins creed, Pokemon Fortnite and Minecraft talk too, you learn so much about them hearing them talk passionately about things they like.",
            "score": 174,
            "replies": [
                {
                    "author": "BlueMoonRaccoon1",
                    "body": "You sound like a good parent",
                    "score": 96,
                    "replies": []
                },
                {
                    "author": "RaoulDukesGroupie",
                    "body": "I’ve always thought to myself that everyone just wants to feel heard, and that applies to little kids too. It just may require a little more patience 😂",
                    "score": 25,
                    "replies": [
                        {
                            "author": "ThisIsTheBookAcct",
                            "body": "Little adhd or nd (not sure) kids more than most. And you don’t have to actively listen, either. Just let the information flow over you, and call out the parts that don’t make sense.\n\nAt least in my house.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PieSama562",
                    "body": "This alone makes me want to have kids. Then I also look at how much everything costs annd how difficult it is to find someone then I’m instantly reminded and go “yeah… I’m good”",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "AfricanCuisine",
                    "body": "Omg, you sound like my mom! She always asks me about my fixations even though I can tell she can’t follow exactly what I mean.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "YogiKatmag",
                    "body": "Yes!!! My 23 yo Kiddo is teaching Me PokemonGo💖",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ThisIsTheBookAcct",
                            "body": "That company also makes several other games. My kids LOVE Peridot even though it’s not being updated. Pikmin Bloom is also popular.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThisIsTheBookAcct",
                    "body": "My kids have their own worlds and when they have to do something but don’t want to do it alone, they ask me to ask about [kid name] world.\n\nIn a surprise to no one, quite a bit of both of their worlds are made out of candy. But the education and political structures are vastly different.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "wendrr",
            "body": "This is me and my younger sister, except she is the one info dumping to me. Her current fixation is Dead Boy Detectives and I am glad she enjoys it. 🥰",
            "score": 52,
            "replies": [
                {
                    "author": "the_good_throwawayy",
                    "body": "Dude me and my younger sister both have adhd, i know everything there is to know about physics and computers, she knows everything about flags and minerals. We are such yappers we can just not listen to eachother and talk for hours about not anything xD. She is such an amazing person",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Daymub",
            "body": "My chemical romance?",
            "score": 27,
            "replies": [
                {
                    "author": "Tripwiring",
                    "body": "Master cummer (really)?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Piouw",
                            "body": "Martian Congressional Republic",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NotAGhost64",
                    "body": "My Cock Ravioli",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Boboriffic",
            "body": "To be fair, if someone started yapping about Master Control Relays I'd be all about it, MCRs are vital components in modern machinery",
            "score": 20,
            "replies": []
        },
        {
            "author": "AbyssalKitten",
            "body": "I wish my sister cared about my interests like this. Growing up she'd tell me she just doesn't care or question me on why I even bother telling her. So now I don't talk to her about any of my interests or hobbies. It's just not worth it. \n\nOlder sisters of the world : it's okay to poke fun at and mess with your younger sisters a bit, but please don't bully them. Please. As a younger sister, you NEVER forget the pain of wanting to love and be friends with your older sister just to be rejected your entire life. Just to be made fun of and ridiculed for daring to be interested in things your older sister isn't. Or daring to be even slightly different from her.",
            "score": 8,
            "replies": []
        },
        {
            "author": "doortju",
            "body": "Me and my eldest sibling\n\nAlso me and my boyfriend 😂 both ways\nHim talking about cars and me talking about art",
            "score": 10,
            "replies": []
        },
        {
            "author": "ParacelsusTBvH",
            "body": "Picture kinda reminds me of the whole Doom guy/Isabella thing when Doom: Eternal and Animal Crossing: New Horizons released on the same day.",
            "score": 7,
            "replies": []
        },
        {
            "author": "TheRealStevo2",
            "body": "I’m 24 and have a 15 year old sister and at this point she’s accepted the stupid random bullshit ideas that I come up with",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "Omfg my sister inteoduced me to MCR some years ago and absolutely hated my ass for how much I talked about them. Same thing with avatar the last air bender. Bitch don’t introduce me to something if u dont wanna hear me talk about it. Jkjk i needed to tone it down and now keep my shit to myself",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cogent_1",
            "body": "my chemical romance?",
            "score": 3,
            "replies": [
                {
                    "author": "BlueMoonRaccoon1",
                    "body": "It’s a band",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Cogent_1",
                            "body": "Yes, my chemical romance is a band",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Whole-Brilliant3697",
            "body": "That's me and my little sis! Although we both yap to each other about our newest interests. Hers is k-dramas, mine is genshin and occasionally some if my silly goofy stories.\nI'm proud of my small Slytherin.",
            "score": 3,
            "replies": []
        },
        {
            "author": "somewhatMonotone",
            "body": "Me and my best friend, he'll talk about a video game I've never played before and I'll have no idea what he's talking about, but I'll listen to him like he's reciting a book and I'll chime in whenever it's similar to a game I've played",
            "score": 2,
            "replies": []
        },
        {
            "author": "confusedPIANO",
            "body": "Lol me and my sister both do this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Moonjinx4",
            "body": "These kind of people are treasure of humanity and they need to be protected at all cost.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Serious-Yellow8163",
            "body": "That's me with my favourite fanfiction about an obscure character in a fandom she had left years ago. She still listens to me rambling. She is the best",
            "score": 2,
            "replies": []
        },
        {
            "author": "JustPlain360",
            "body": "Me too but my sister is mentally too young to under what I say 😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "GrandpaOwen",
            "body": "Bro that’s literally me and my cousin 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aureaux",
            "body": "This is how my little brother and I are",
            "score": 2,
            "replies": []
        },
        {
            "author": "znratliff",
            "body": "This is so my sis and I. We're like the only connecting sisters in the family (7 sibs altogether) and we rant to each other, whenever we could.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unlikely-Remove-2182",
            "body": "Wait...isn't that normal? Shouldn't friends and family every now and then spend like 45 minutes going on about silly stuff they like?",
            "score": 2,
            "replies": [
                {
                    "author": "YogiKatmag",
                    "body": "It Should be- Unfortunately not as common for some families",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LadyofDungeons",
            "body": "Ahhh MCR. my best friend and I bonded over them when we were 14. Good times. Gerard is an awesome guy. And Helena is a great piece of music.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Purple_Cat134",
            "body": "lol my brother does this all the time, it’s quite entertaining listening to him",
            "score": 2,
            "replies": []
        },
        {
            "author": "an_edgy_lemon",
            "body": "That’s wholesome, and I’m happy for you, but can anyone explain the original context of the picture? Why is Vader geeking out with an anime girl, and why is no one getting lightsabered?",
            "score": 1,
            "replies": []
        },
        {
            "author": "fuckaduck009",
            "body": "hi",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ropo040107",
            "body": "This is me but with my best friend who’s a girl.\nAnd she does the same to me as well so it’s fair game lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legitimate_Brush_426",
            "body": "I remember a few years ago I saw someone wearing a Pink Floyd shirt at school and I got too excited and started talking to her. She immediately started walking away lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Player0_Trico",
            "body": "Where can i find the OG picture?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character_Cabinet_48",
            "body": "Im a 23 yo male and find thus very accurate",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisIsTheBookAcct",
            "body": "When my kid talks about the things in minecraft that are true irl and not true irl.\n\nI’m just glad you’re excited by rocks, kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "STG_makerofskworeguy",
            "body": "From where did that photo come from?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neon_Square04",
            "body": "sadly, can't relate",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -4,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 22,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "yqyquu",
            "body": "Cring ass meme",
            "score": 0,
            "replies": [
                {
                    "author": "BlueMoonRaccoon1",
                    "body": "\\*Cringe",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mikelimebingbong",
            "body": "They used to be called “hobbies”",
            "score": 0,
            "replies": []
        }
    ]
}