{
    "title": "Everyone deserves emotional support!",
    "author": "Andrew_Pickle",
    "subreddit": "wholesomememes",
    "rank": 135,
    "score": 14363,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 63,
    "url": "https://i.redd.it/iy63g1g335vd1.png",
    "id": "1g52kex",
    "selftext": "",
    "comments": [
        {
            "author": "DryMouthKitty",
            "body": "Hello u/Andrew_Pickle can you confirm this is original content, that you made this meme, and that you are not a meat popsicle?\n\n![gif](giphy|iC3flcWuI3xkY)",
            "score": 1,
            "replies": [
                {
                    "author": "Andrew_Pickle",
                    "body": "Hello Mods, yes, I have made this meme myself. And I don't think that I'm a meat popsicle.",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "A_Texan_Coke_Addict",
                    "body": "Jokes on you, I stabbed you in the buttocks making you a meat popsicle for this exact moment",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "Andrew_Pickle",
                    "body": "😆😆 It's been a while since I heard the word \"buttocks\". What a great word.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "penisdevourer",
            "body": "Dude my bf told me today that the reason he doesn’t spend time with my family is because they are nice and spoil him.",
            "score": 177,
            "replies": [
                {
                    "author": "Less_Case_366",
                    "body": "..........maybe your username also has something to do with it. Listen imma be a little scared of a person who calls themselves penis devourer and their family too.\n\n  \nJokes aside yeah a lot of men dont know how to handle kindness because the world isnt exactly kind to us. So it becomes sensory overload and makes us exceptionally uncomfortable. Having your guard up all the time is exhausting, but it's a lot easier than constantly raising and lowering it. So we take what we love and put it in a walled garden. \"Just ...stay over on that side of the garden so im not distracted by how wonderful you are\".",
                    "score": 60,
                    "replies": [
                        {
                            "author": "penisdevourer",
                            "body": "lol HE made the account for me 🤣🤣🤣 but yeah he was abused for his entire childhood and is very pessimistic about…… everything? He’s just soooooo deserving of love and kindness and my mom saw that the first time I brought him over too so we just wanna spoil him but I’m gonna let my mom know to tone it down a bit. She owns her own company and makes good money so when we have family outings it’s always letting us loose in the mall getting whatever we want. We were really poor growing up and she’s always felt guilty about not being able to provide for us and turning to an abusive relationship in order to keep us fed. She just loves hard lol.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Less_Case_366",
                                    "body": "as a person who grew up in your boyfriends situation. It's hard. It took me nearly 30 years now to feel like im ready to really be in love with someone.\n\nas a man if you dont mind i'll give some advice.\n\n- if he cant communicate that he needs space properly than he doesnt need space he needs love (it's confusing but you likely know what i mean). e.g. he's frustrated about something but cant quite express it. a hug and a heartbeat go a very very long way. a heartbeat literally one of the most soothing things in the world to everyone, so bury his head in your arms and suffocate his face\n\n- if he can in any situation communicate he needs space it means he does need space. e.g. you're arguing or he's mad about something or sad about something and he says \"can you give me a minute/space/some time\" than back up and wait a couple hours and then ask if he wants to talk. Sometimes people who go through abuse struggle with thought organization and they just need time to process things.\n\n-  birthdays, Christmas, family outings will always be a little stressful for him when he's there because he will feel like he doesnt belong and like he's intruding. Invite him to every single one. if they're important to you drag him to them if you have to but understand that it's a mixed bag of emotions. Speaking from experience i cant remember the faces of the women i dated who always left me alone on those days but every single woman who drug me to their family events i can remember every single one of their family members names and what we did every single hour of that day.\n\n- celebrate his birthday, but let it be a subtle thing. a card goes much much farther than some extravagant gift. gifts are appreciated ofc but most people who suffer abuse try to take up as little space as possible meaning they rarely express what they want so be prepared for difficulty there. i can promise you the very basic gift of \"socks\" intended as a totally benign and \"normal\" gift is a lot funnier and memorable than say a game would be.\n\n- and if he's a handsy/active person, never let him be idle for to long. like LITERALLY drag him  out of bed if you have to. Put purpose in his hands and make him do things. If he's more of a reader/mental thinker type than pick his brain, ALL the time, especially if topics interest you guys both.\n\nPhysical health and mental health go hand in hand, but people who suffer abuse usually gives up on one or the other which then affects the other. Even something as simple as a walk and talk can be exceptionally stabilizing for most people.\n\n  \nMuch love, im rooting for you guys :)",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "penisdevourer",
                                            "body": "Thank you so much for the advice my dude 🥹",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Less_Case_366",
                                    "body": "it was literally the first thing i saw when i went to reply XD",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SilentScreamO_O",
            "body": "![gif](giphy|lqoTrRHWiUKzvSYrYt)",
            "score": 64,
            "replies": []
        },
        {
            "author": "Prince-Angel-Wing",
            "body": "That would make me move to silent treatment for a good while, even if I didn't want to. :/",
            "score": 39,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Prince-Angel-Wing",
                            "body": "Nope. I wouldn't talk to them or even look at them. My brain would tell me no.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "karllsonn_",
            "body": "This has been happening for almost a year at this point. I just don't understand why people even care about me.",
            "score": 29,
            "replies": [
                {
                    "author": "Andrew_Pickle",
                    "body": "Because you deserve support, even if you don't believe it yourself at the moment. Please remember: People don't give their support to just anyone. They see something in you that is worth supporting. And I hope that you will (re)discover that too, some day.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "GucciBear2000",
                    "body": "those who support you don’t do it just because you love/support them first. they do it because they love you for who you are, and by definition, that makes you pretty damn special. :)",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Greedy_Law_6404",
            "body": "Exactly what I would tell my friends!😤😤😤",
            "score": 11,
            "replies": []
        },
        {
            "author": "HusbandMaterial1922",
            "body": "Need it, but not all receive it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "MadamCrow",
            "body": "This is my Husband in a nutshell  - god i love this man! :D",
            "score": 5,
            "replies": []
        },
        {
            "author": "PHOENIXR426",
            "body": "And when your at your lowest point you’ll come to me!",
            "score": 4,
            "replies": []
        },
        {
            "author": "sheikhyerbouti",
            "body": "Having the core belief set in childhood that I'm unlovable hasn't really done me any favors.",
            "score": 4,
            "replies": []
        },
        {
            "author": "daysatta",
            "body": "I wish I had a man like that.",
            "score": 5,
            "replies": []
        },
        {
            "author": "LatterSituation2823",
            "body": "Emotional support? Was that a new update I never got downloaded?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Inventioner",
            "body": "I would revise that title to say, \"Everyone -- except predators, and parasites -- deserves emotional support\"",
            "score": 4,
            "replies": [
                {
                    "author": "torrasque666",
                    "body": "You can emotionally support a person without condoning their actions.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Freddy7665",
                            "body": "I think you meant *approving",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "torrasque666",
                                    "body": "Condone: approve or sanction (something), especially with reluctance.\n\nYou might be thinking I was saying \"condemn\", which is the opposite.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Freddy7665",
                                            "body": "Yeah. Think so.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ScarletteAbyss",
            "body": "I felt this so hard",
            "score": 2,
            "replies": []
        },
        {
            "author": "Superb_n00b",
            "body": "Sometimes I hate that tho?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lost-Edge-8665",
            "body": "My ex gf and me💀💀",
            "score": 2,
            "replies": []
        },
        {
            "author": "polish-rockstar",
            "body": "Not me!",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoLecture7729",
            "body": "Yes!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IridebikesImstillfat",
            "body": "'What does that mean?'\n'You know what it means.'",
            "score": 1,
            "replies": []
        },
        {
            "author": "evasivemoves",
            "body": "the kind of people we need",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lopsided-Aardvark644",
            "body": "Yeah? So where is the person who can give me some of that emotional support??? Huh? Where?? Someone I liked a lot told me he can't do long distance with me. I don't think I'm good enough. 😕",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecessaryUnited9505",
            "body": "me and my friends dynamics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sophiefox2",
            "body": "hard situation",
            "score": 1,
            "replies": []
        },
        {
            "author": "adawongfan1",
            "body": "hehe this reminds me of him..💓💓",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwoeJonson1",
            "body": "Go Michael Scott!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Case_366",
            "body": "Interesting that you say everyone, how would you emotionally support hitler during the height of the war?",
            "score": -1,
            "replies": []
        }
    ]
}