{
    "title": "Things will be easier if we stick together  ",
    "author": "DryMouthKitty",
    "subreddit": "wholesomememes",
    "rank": 85,
    "score": 7202,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 46,
    "url": "https://i.redd.it/dg09l0uozw3e1.jpeg",
    "id": "1h2x9g3",
    "selftext": "",
    "comments": [
        {
            "author": "DryMouthKitty",
            "body": "Hello friends! I hope everyone was able to hold it together yesterday, and if you didn’t, that’s okay! You will make it through even if you got burnt. \n\nAs a way to encourage original content (and defeat the evil spam bots with reposted content) we partnered up with another subreddit to present a wholesome GIF competition. Please take a moment to check it out: https://www.reddit.com/r/wholesomememes/s/ulcCq59OqO - we really appreciate it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "PokeChampMarx",
            "body": "The punch line works better with tacos",
            "score": 40,
            "replies": [
                {
                    "author": "The_Char_Char",
                    "body": "That's cus Fluffy is a great comedian! Saw him live once, dude is wholesome as fuck!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "DryMouthKitty",
                    "body": "Just depends on how you make them. Wanna taco bout it? I prefer flour tortillas, and not overloading them.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "caliphis",
                            "body": "A soft taco is just a burrito someone folded wrong.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fardough",
                    "body": "I’d like to add. When life gets messy, remember some of the best things are messy, like chicken wings and ribs. \n\nBe willing to dig in, don’t worry trying to keep things perfect, and accept a mess is often required to get to something good. Like re-organizing a closet, you make a bigger mess to restore better order.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "tackleboxjohnson",
                    "body": "If a tortilla can rise up, so can you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AUA2020",
            "body": "Awww this made my eyes teary. I get panicked alot in big thingies. Recently have been dealing with something relatively big and new for me but haven't been able to do it well enough. Thank you for the wholesomeness. Have a great day",
            "score": 25,
            "replies": [
                {
                    "author": "DryMouthKitty",
                    "body": "I have been through so much anxiety and panic attacks in the past few years. I thought it would only get better if my circumstances changed, and while unfortunately they haven’t, going to therapy and working on things and pushing through every day, while finding grace for myself and others has gotten me to a better place mentally. It’s not always easy and I still get frustrated, but I am grateful for the support I’ve had and the resilience I’ve built. Good luck with your journey!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "unsolicited_flattery",
                    "body": "I feel where you're coming from and have definitely been there. It can take a lot out of you. Alas, it's part of life and a major reason for why we need each other and should be there for each other. We're each trying to live figure out life, while here we didn't take each other for granted",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "designerjeremiah",
            "body": "S'mores aren't expected to have their shit together, answers for every question, and able to handle an infinite number of difficult situations without breaking a sweat, either.  Some of us don't have a choice, we're not allowed to crumble.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Background-Call-921",
            "body": "You stole that joke from fluffy and just replaced tacos with smores ",
            "score": 3,
            "replies": []
        },
        {
            "author": "jcarreraj",
            "body": "Same thing with tacos!",
            "score": 2,
            "replies": []
        },
        {
            "author": "JokeMundane4240",
            "body": "too bad I hate S'mores",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sawertynn",
            "body": "I think we want other things from snacks and from people. And falling apart means something different in both contexts\n\nNo, I'm not fun at parties",
            "score": 2,
            "replies": []
        },
        {
            "author": "Feminine_Marie",
            "body": "Okay, now I feel motivated again!! 🤣",
            "score": 2,
            "replies": []
        },
        {
            "author": "puwettt",
            "body": "needed this 🥺",
            "score": 2,
            "replies": []
        },
        {
            "author": "Existing-Pace5914",
            "body": "i love seeing this subreddit on my feed. this truly made me cry immediately.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChildofFenris1",
            "body": "I love this",
            "score": 2,
            "replies": []
        },
        {
            "author": "shiawase198",
            "body": "If your smores are falling apart, I think you're making them wrong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SheepherderDirect800",
            "body": "The nice thing about a smoore is it will never turn it's back on you and leave you homeless.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BomberBenny",
            "body": "Not if I drop on the floor",
            "score": 1,
            "replies": []
        },
        {
            "author": "LeapIntoInaction",
            "body": "If your graham crackers come apart like that, they're old and have gone soggy. Throw them out!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "swamptheyard",
            "body": "Facts",
            "score": 1,
            "replies": []
        },
        {
            "author": "Doctor-Rat-32",
            "body": "Aye, ye'll taste pretty much the same anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snackasm",
            "body": "Tacos are better",
            "score": 1,
            "replies": []
        },
        {
            "author": "penarhw",
            "body": "Tired of throwing punchlines, now throwing lifelines",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bubbly-Letter2719",
            "body": "Kintsugi is a beautiful principle that works this way, too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D4rk3scr0tt0",
            "body": "I'm not eaten often but thanks",
            "score": 1,
            "replies": []
        },
        {
            "author": "Easy-History4176",
            "body": "Internet really spoiled me",
            "score": 1,
            "replies": []
        },
        {
            "author": "LothTerun",
            "body": "Smore's falls apart would be a great name for a feels good cover or paordy of \"All falls apart\" from polyphia. I would do it but I cant play guittar nearly as good as tim or scott",
            "score": 1,
            "replies": []
        },
        {
            "author": "MouthfulOfSmegma",
            "body": "So true, you don't have to be stable and put together to be lov- holy shit my arm just fell off, oh God, oh fuck, I'm falling apart",
            "score": 1,
            "replies": []
        },
        {
            "author": "SomnY7312",
            "body": "taco lovers are so offended! 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "VLD85",
            "body": "but what if I'm a Boeing 747 ?...",
            "score": 0,
            "replies": []
        }
    ]
}