{
    "title": "How it started VS how it's going",
    "author": "Zachajya",
    "subreddit": "wholesomememes",
    "rank": 53,
    "score": 9250,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 169,
    "url": "https://i.redd.it/68yiwh36t9ae1.png",
    "id": "1hqqy9n",
    "selftext": "",
    "comments": [
        {
            "author": "TheCopyKater",
            "body": "2019: numb\n\n2020: numb and tired\n\n2021: numb, tired, stressed\n\n2022: numb, tired, empty\n\n2023: making plans (not the good kind)\n\n2024: therapy. I'm almost happy now, actually. How quickly things change...",
            "score": 863,
            "replies": [
                {
                    "author": "may-or-maynot",
                    "body": "hell yeahhhh 🔥🔥",
                    "score": 84,
                    "replies": []
                },
                {
                    "author": "CookieMonster_41",
                    "body": "I am so happy your still here with us my dms are always open to you if you need any support I just want to say I’m proud that you didn’t go threw or succeed",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "XEdwardElricX",
                    "body": "As someone who joined the military 2019 and got out 2023, this time line seems a perfect summary.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "SockGnome",
                    "body": "I’m glad you decided to stick around. Admitting to yourself you need a change and taking those steps via therapy is such a scary and hard thing to do. I hope you feel proud of yourself. 🫶",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Designer-Plastic-964",
                    "body": "I'm glad you pulled through. 🙂\n\nI didn't personally think it was *that* much worse than the previous 5 years. But I guess I *was* pretty busy being a heroinist. \nHeroinist, is that not an English word?  \nJunkie. I was very busy being a junkie! \nAnd that makes everything quite... Gray?\n\nBut a year ago I bought a dog. And I'm down to 20 mg. of methadone. So in that sense, 2024 was in many ways the best year for me too, in like a decade +. Go me! 😜\n\nBut here's hoping 2025 is a good, and maybe even **better** year. For you, for me, and whoever else might need it, and/or reads this. ✌️",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Schrodingers_Pizza_",
                            "body": "Heroinist. How did you make being a junkie sound like a professional job? ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Designer-Plastic-964",
                                    "body": "That's just what it's called in Scandinavia.  \nAs you can probably imagine, it just means \"addicted to Heroin\", although it doesn't necessarily mean you're injecting. Here, that's more synonymous with being a junkie.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Schrodingers_Pizza_",
                                            "body": "Oh, good to know! 😄 ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Electro313",
                    "body": "Good, I’m glad you’re getting better. Happiness can feel like an endless struggle sometimes, and honestly it really can be, but things can always get better. Keep pushing, I believe in you.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "yourallygod",
                    "body": ":D",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MamonTostado",
            "body": "Not for me, man. I'm tired.",
            "score": 423,
            "replies": [
                {
                    "author": "PookityChok",
                    "body": "Same. Hopefully we don’t have to wait another year until it will get better.",
                    "score": 59,
                    "replies": [
                        {
                            "author": "Temporary_Carrot7855",
                            "body": "You don't wait, you make it better. For the most part, the grass is greener where you water it.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Often_Uneliable",
            "body": "2nd worse year for me but I am energized for the next one and gonna force this mf to be great",
            "score": 155,
            "replies": [
                {
                    "author": "wonkboy",
                    "body": "That's the spirit",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Atlas-The-Ringer",
                            "body": "Both of you...I...huh",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "wonkboy",
                                    "body": "Yeah?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Atlas-The-Ringer",
                                            "body": "The way you're PFPs are looking at me makes me think that if I say the wrong thing to you it'll have dire consequences...",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BanangaPropaganda",
                    "body": "Screw being passive aggressive, you chose to be aggressively passive",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bl4ckp00lzz",
            "body": "Previous years were meh,  but 2024 really sucked for me",
            "score": 99,
            "replies": [
                {
                    "author": "None",
                    "body": "FR!!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 109,
            "replies": [
                {
                    "author": "Underbark",
                    "body": "Yeah, 2019 wasn't my best year by a long shot, but every year since has been worse in a rapidly escalating fashion for me...\n\n\nI just wish anything good would happen ever again.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snackasm",
            "body": "2022 was when things started to pick up for me",
            "score": 19,
            "replies": []
        },
        {
            "author": "BroodjeKroket3",
            "body": "I’m happy for you OP. You’re doing great!",
            "score": 31,
            "replies": []
        },
        {
            "author": "Greengiant00",
            "body": "I know this is probably going to sound awful, but this year went alright for me despite losing my mom in August.\n\n\nWe didn't have a strained relationship, we disagreed on quite a few things but other than that she was a great mom. The reason I say my year went alright, and something I didn't even realize until she had passed, I was always stressed out about her health. She had a lot of problems and disliked hospitals, getting her to go see a doctor was a battle. I miss her, so much, and the month after was one of the worst of my life. But once I was able to get myself back up, I felt less weight on my shoulders.\n\n\nI know she'd be glad for that as well, she always hated me waiting on her and doing things for her. I haven't said this to anyone I know, cause I don't think I'd get anyone to understand.\n\n\nBut beyond my own life, this year wasn't much if any better than the last few so I understand the sentiment from everyone else in this thread.",
            "score": 25,
            "replies": [
                {
                    "author": "MoonphaseMouse",
                    "body": "Doesn't sound awful. I'm there right now and it's so hard for both me and the relative I'm taking care of. A lot of people definitely don't get this until they are in a truly painful situation but it's the feeling of many that are. Things end. And sometimes its worse if they don't and just drag on painfully. Glad you are doing okay.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Greengiant00",
                            "body": "Thank you, I know exactly what you mean.\n\n\nMe and my dad had several arguments over the last couple years about her. He was adamant that no matter what her situation was, we had to wait and see if something was found to be able to help her. I understood his mindset, but my mom had made it clear she didn't want to be kept alive by machines.\n\n\nWhen it finally came time to decide what to do for her, he didn't have any of the fire he had in those arguments. He just silently agreed with me and my brother. I don't know if I'd have rather he at least try and argue.\n\n\nI hope you are doing okay as well, and whatever happens know that someone understands.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "MoonphaseMouse",
                                    "body": "Thank you.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "erybody_wants2b_acat",
                            "body": "My dad died Dec 5th.  We had a complicated relationship and we disagreed on a lots of things, especially regarding care for my mom.  She’s had mental health struggles for 20 years now and it’s been a battle the past several years as they were living in a rural area of NC. My dad had plenty of health issues himself. But now that it’s over, and I’m making my own peace with his sudden death, it’s definitely a relief.  He didn’t suffer and my mom is with me now and I’ll do everything I can to make sure she’s taken care of properly.  Despite everything, it’s been an okay year, except for November on.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AuthenticallySage",
                    "body": "Honestly I understand this. I’m glad you’re both able to be at peace, and I’m sorry there was so much suffering. I hope this next year can be one of growth and healing for you.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BarackTrudeau",
                    "body": "I'm sorry for your loss, but damn caretaker burnout is absolutely a thing. I hope you are able to move forward and live your life to its fullest. It's what she would have wanted for you. Somewhere she'll be happy to see you thrive, be it in heaven or in your own memories.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silver-Dentist-7106",
            "body": "Worst one yet bud",
            "score": 11,
            "replies": []
        },
        {
            "author": "Aldehin",
            "body": "Just glad to see some amphibia here",
            "score": 8,
            "replies": []
        },
        {
            "author": "WildFemmeFatale",
            "body": "This was literally my only good year TOOOOOOO \n\nTWINSIES GODDAMNNN 😭😭😭🤝",
            "score": 10,
            "replies": []
        },
        {
            "author": "loserface583",
            "body": "24 Sucked ass for me lol",
            "score": 8,
            "replies": []
        },
        {
            "author": "Flowzin64",
            "body": "I'm sure that it was bad",
            "score": 14,
            "replies": [
                {
                    "author": "Sudden_Emu_6230",
                    "body": "Yeah it was about the same. School shootings trump does some shit the wealthy get pampered to and the average Joe can go fuck themselves Elon tries to buy something people use to insult him to ruin it.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Flowzin64",
                            "body": "Is more about my life... I'm from Brazil so...",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "lmao and everyone immediately makes it about politics",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Flowzin64",
                                            "body": "I was joking about how people from other countries think that Brazil is a sh*t,but that's also true",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Zachajya",
                                            "body": "I was confused about a couple comments, then I realized people is unhappy because of Trump.\n\nI tend to forget that a loooot of people in Reddit is from the United States.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Nah a lot of people on reddit tend to forget that not everyone is from the US, me included.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "featherwolf",
                                            "body": "OMG, I know, right? It's so crazy that in a year where there were contentious elections in many countries all around the world that people would have politics at the top of their mind... Just bananas..",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Its like this all the time on reddit. Not just this year.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": "Same. At first I thought it was just me. But then I stood at the bus station, and friend was like \"Y'know? This year was definitely ass..\" And on New Year's, a lot of other friends said a lot of similiar stuff.\n\nNo surprise, tbf. We live in pretty bad \"interesting times\". Politically, Economically, Socially, safety...ly. Love to see some still having had a banging time + everything is better than 2020 (till now)...but y'know. No surprise",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OldMattReddit",
            "body": "Good for you! Wish many more years like that for you :)",
            "score": 6,
            "replies": []
        },
        {
            "author": "DolphinDoggo",
            "body": "AMPHIBIA REFERENCE SPOTTED YES WOOOOOO",
            "score": 4,
            "replies": []
        },
        {
            "author": "Prestigious_Slice290",
            "body": "Amphibia is so underrated!",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 5,
            "replies": [
                {
                    "author": "Zachajya",
                    "body": "I'm kinda shocked you apparently are not on the Amphibia subreddit with that user name.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Zachajya",
                                    "body": "Understandable.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Instruction9905",
            "body": "2024 was my year and I would love if 2025 os just like it.",
            "score": 4,
            "replies": [
                {
                    "author": "TillFit2037",
                    "body": "Same here. I believe it will be just as awesome as 2024",
                    "score": 2,
                    "replies": [
                        {
                            "author": "No-Instruction9905",
                            "body": "Then I hope your 2025 would be your best year mate",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TillFit2037",
                                    "body": "Thanks, but the best year of my life was 2016. But 2024 was definitely one of the best years I've ever had.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "No-Instruction9905",
                                            "body": "Then I hope 2025 is like 2016 for you!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "TillFit2037",
                                                    "body": "Thanks. I hope you have an awesome 2025 as well.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "N4FKreddit",
            "body": "It actually hasn't been. Was a good year for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MrCleanRed",
            "body": "The last month have been pretty bad, but the past 11 months!? Awesome",
            "score": 3,
            "replies": []
        },
        {
            "author": "redmosin1390",
            "body": "Honestly, I'm the most optimistic for a new year that I can recall since 2019. I'm starting the year off divorced, childless, making a respectable living, with not nearly as many expenses as last year, and in a house that's mostly solid.\n\nAre there a few things that could be better? Obviously. But as a whole, things are finally looking up for me",
            "score": 3,
            "replies": []
        },
        {
            "author": "YukariYakum0",
            "body": "Not to be a downer but for me, we lost Mufasa and Misty, got a fascist moron courtesy of the electorate, the holidays were harder than they've been in previous years, and my mother is apparently unaware she is enacting Cats in the Cradle. Oh and I live in Texas.\n\nSo yeah. Thinking of moving to like Colorado maybe? Or maybe just skip a few steps and go to Ireland.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Correct-Mail19",
            "body": "Unfortunately next year is lurking",
            "score": 4,
            "replies": []
        },
        {
            "author": "King_Of_BlackMarsh",
            "body": "Glad to hear",
            "score": 2,
            "replies": []
        },
        {
            "author": "throw-me-away78",
            "body": "This is exactly how it’s been for me. I hope to progress past not bad and make this year good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Plenty_Tax_5892",
            "body": "Got kicked out of my friends group of 6+ years in 2024, but at least I started an interactive webseries, I guess.\n\nGlad it went well for you though",
            "score": 2,
            "replies": []
        },
        {
            "author": "boyawsome876",
            "body": "Beginning of 2024 sucked but honestly it made a comeback for me",
            "score": 2,
            "replies": []
        },
        {
            "author": "ManicLunaMoth",
            "body": "Same for me! I finally am working on my mental health and feel hopeful for the future for the first time since childhood. I wouldn't say it was a great year, but it's the first good year I've had in a while. I'm hoping 2025 is even better!",
            "score": 2,
            "replies": []
        },
        {
            "author": "moodymug",
            "body": "2019 was pretty good\n\n2020 was scary because of covid but I played a lot at least\n\n2021 was exhausting\n\n2022 was okay-ish\n\n2023 was horrible\n\n2024 was on hardcore mode",
            "score": 2,
            "replies": []
        },
        {
            "author": "LillySqueaks",
            "body": "Maybe this year...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Life-Leg5947",
            "body": "Not for me things got progressively worse",
            "score": 2,
            "replies": []
        },
        {
            "author": "gasbottleignition",
            "body": "Pshhh, a lot of people are excited for the next four years... and me, I'm excited to see that excitement turn into regret lol\n\nIm very optimistic that I'll be telling people, \"You voted for this\" a LOT. Schadenfreude is gonna flow in 2025 😆",
            "score": 2,
            "replies": []
        },
        {
            "author": "FireManiac58",
            "body": "Best year of my life",
            "score": 2,
            "replies": []
        },
        {
            "author": "Random_FanBoiii",
            "body": "Same, after some serious problems with my choice in friends and priorities, 2023 was absolutely awful. 2024 gave me time to heal and work on myself more, and there are visible improvements. Hoping the same for 2025........",
            "score": 2,
            "replies": []
        },
        {
            "author": "Reckless_Worsnop",
            "body": "For me this is backwards, everything was fine but things just keep getting worse",
            "score": 2,
            "replies": []
        },
        {
            "author": "greyjedimaster77",
            "body": "2024 and 2023 were technically my best years since 2019",
            "score": 2,
            "replies": []
        },
        {
            "author": "Robolta",
            "body": "Every year is a little closer to things being ok",
            "score": 2,
            "replies": []
        },
        {
            "author": "MorningToast",
            "body": "Everyone I've spoken to recently said 24 was one of the worst years they've ever had. I'm glad someone did well, hope it continues for you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "RingReasonable",
            "body": "To be brutally honest, 2024 has been my worst year yet. I hope this year will be better",
            "score": 2,
            "replies": []
        },
        {
            "author": "Everydaypsychopath",
            "body": "Every year is worse",
            "score": 2,
            "replies": []
        },
        {
            "author": "Needorgreedy",
            "body": "2020: shitty but know it's going to worst (had it's moments tho)\n\n2021: it got worse \n\n2022:  depression + suddenly health starts declining towards end\n\n2023: still struggling with health then family member dies\n\n2024: health gets better but mental health dips to an all time low\n\n2025: trying to be optimistic. \n\nI really hope it's my year. I'm looking forward to moving and starting fresh.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bad_RabbitS",
            "body": "“What’s the point of living?”\n\n**“I like pizza. I want to have more of it.”**",
            "score": 2,
            "replies": [
                {
                    "author": "Zachajya",
                    "body": "Ah, Pizza Paladin... that guy appears in a 10 seconds sketch and represents \"legal good\" aligment better than most characters I know.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "konofireda98",
            "body": "2024 wasn't that bad for me, but the last few months were absolute hell for my mental and physical health.\n\nHope I'll get better during the next months.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Funny-Performance845",
            "body": "The opposite here",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wojak_smile",
            "body": "Still bad for me…",
            "score": 2,
            "replies": []
        },
        {
            "author": "Starburst420",
            "body": "2024 was one of my best years and worst years of all time",
            "score": 2,
            "replies": []
        },
        {
            "author": "dangermonke1332",
            "body": "Oh, hey, Amphibia!\n\nGood show.",
            "score": 2,
            "replies": []
        },
        {
            "author": "A_Texan_Coke_Addict",
            "body": "Trump was elected. This year has been complete shit",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ididnotaskforthi5",
            "body": "Nah this year was fucked same as all the others",
            "score": 2,
            "replies": []
        },
        {
            "author": "Majongusus_Doremidus",
            "body": "mine's exactly the opposite",
            "score": 2,
            "replies": []
        },
        {
            "author": "dsagona",
            "body": "This year I started therapy. And while my life situation hasn't really changed much, how I feel about my life has been turned upside down. For once, I'm actually really hopeful about life and what the future can bring. Thank you for this",
            "score": 2,
            "replies": []
        },
        {
            "author": "Peter_From_Space",
            "body": "This is exactly me ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Confused_Rabbiit",
            "body": "The end of it was pretty bad.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Greygoblin2",
            "body": "I cared about the future of America. Not anymore... so maybe this is a good thing and does apply on a personal level",
            "score": 4,
            "replies": []
        },
        {
            "author": "Jinn_Skywalker",
            "body": "Accurate",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ninjatroll3452",
            "body": "This is already worst year I had in my life so",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qgelfang",
            "body": "2019 sick Mil Like 17 operations sience 2018\n\n\n2020 Mil dies Fil cancer\n\n\n2021 Fil Chemo\n\n\n2022 Fil died\n\n2023 dealing with Fil death and all paperwork still \n\n2024 many Problems Money wise cause of mortgages and debts of mil and fil\n\n2025 WE will See.....",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntentionalUndersite",
            "body": "The bad is seemingly more normal than ever. It’ll get a lot worse before it gets better.. and so on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PixxyStix2",
            "body": "2nd worse year for me tbh",
            "score": 1,
            "replies": [
                {
                    "author": "rabidjellybean",
                    "body": "Only because we know 2025 is going to be pure chaos.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Educational-Top-6647",
            "body": "I’m really tired right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Life-1777",
            "body": "My new years was a bit boring \nEhh it wasn't bad\nAnyhow by the end of the year hoe old am going to be...",
            "score": 1,
            "replies": []
        },
        {
            "author": "noah683826",
            "body": "2024 got a lot lot worse, but from October till now things have been improving, hoping to keep that up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flairion623",
            "body": "2024 was probably the worst year of my life",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moder0rus",
            "body": "fucked my 2025 2026 my year for sure",
            "score": 1,
            "replies": []
        },
        {
            "author": "Positive-Scallion-74",
            "body": "This year was the worst lmfao, moved 5 times, 7 different jobs.. car accident, dropped out of college, like 5 er visits (only 1 for me lol) fuck it we ball has been my entire mental state for the last 366 days",
            "score": 1,
            "replies": []
        },
        {
            "author": "88Zarathustra",
            "body": "2023: Hate peoples...\n2024: Seriously? Really very big shit...I hate peoples more than I think",
            "score": 1,
            "replies": []
        },
        {
            "author": "Copper_snipezz",
            "body": "2020: no school, life is chill other than the threat of covid\n2021: schools back, got a ps4, mental health starts to drain without notice\n2022: mental health starts to drain faster\n2023: most of my friends left me in around October, depression at its worst so far\n2024 found new friends, grandma passes away, lost family pet\nI hope 2025 will be better",
            "score": 1,
            "replies": []
        },
        {
            "author": "tiowey",
            "body": "This is depressing not wholesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "im-cringing-rightnow",
            "body": "Nah...",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainGashMallet",
            "body": "“When you’re going through hell, keep going.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Ready",
            "body": "2024 was so ass my brain activated trauma response to deal with it",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Nuisance",
            "body": "The past couple years on my end have been **rough,** but I’d still rather be where I am now than where I used to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrequentBroccoli97",
            "body": "The first year in the past 4 that I havn't had to work 60 hours a week to survive so I'm not complaning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Faroes4",
            "body": "Cant relate lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "TillFit2037",
            "body": "Besides a bad March and a mediocre April, 2020 was decent to me, 2021 was pretty good,  but 2022 was mid as hell due to depression in the summer and fall. Thankfully, 2023 was somewhat good after a mostly rough start. The good months I had helped a lot. I got my spark back in late November, and I've been happy with my life again ever since. This past year was awesome. I will never forget 2024 as being one of my best years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dcollette",
            "body": "Honestly... same. 2024 was my personal best since 2018. Not sorry about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bigtittiedswagger",
            "body": "Real shit 2024 wasn't great but also wasn't super terrible",
            "score": 1,
            "replies": []
        },
        {
            "author": "garipkont714",
            "body": "Lol I wish I could say the same but no this year was really the worst of all for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "SenorDuck96",
            "body": "2019: I can't wait to go to Japan tomorrow\n\n2020: at least I survived\n\n2021: at least I survived\n\n2022: better than last year\n\n2023: better than last year\n\n2024: maybe next year",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZatoTBG",
            "body": "In 2024 I got diagnosed with eosinofilic bronchitis, stopped working out because my lungs would not bear it anymore. Gained weight in the process, lost my job due to it and stuck on medication for probaly the remainder of my life. I have had better years as 2024.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pyttfall",
            "body": "2019-2022 not the best years of my life\n2023- Better but still not going anywhere\n2024- Still not looking great\n2025- New job starting soon and life is slowly looking better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Norintha",
            "body": "Most of it fucking sucked but I ended up finding new love in the last couple months so silver lining I suppose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CinnamonAnna",
            "body": "Keep trying and trying ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "SILENTCORE12",
            "body": "2024 was the worst year for me yet on account I almost died in the hospital twice within a week of each other",
            "score": 1,
            "replies": []
        },
        {
            "author": "filippo_sett",
            "body": "2024 has been one of the worst years of my life, and 2025 hasn't started so well, but who knows",
            "score": 1,
            "replies": []
        },
        {
            "author": "JulioTheGay",
            "body": "Speak for yourself",
            "score": 1,
            "replies": []
        },
        {
            "author": "MilkandCookies67",
            "body": "yea, only a genocide happened throughout the year and is still on going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilikeredditjust",
            "body": "Quite the opposite for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mission_Parfait_1340",
            "body": "Literally lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "augustotourist1PC",
            "body": "2024: Flood and dengue\n\nI can say 2024 Was not my year",
            "score": 1,
            "replies": []
        },
        {
            "author": "404ErrorAbsolute",
            "body": "True... absolutely true...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Velteck",
            "body": "2024 was great until my husband was laid off for Christmas yippee",
            "score": 1,
            "replies": []
        },
        {
            "author": "pamperlily",
            "body": "CONGRATS !!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Witty-Pen1184",
            "body": "Yeah 2024 has been very good in comparison to other years",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I don’t even have words for this 😑",
            "score": 1,
            "replies": []
        },
        {
            "author": "forbritisheyesonly1",
            "body": "I’m glad for people that relate to this. I also saw the news of the tesla truck bombing and the terrorist attack so I’m deeply grieved for the families involved and that this is how it started, on the first effing day. May all of you be well and be in good health",
            "score": 1,
            "replies": []
        },
        {
            "author": "MakoShark721",
            "body": "I loved this show",
            "score": 1,
            "replies": []
        },
        {
            "author": "SUP7170",
            "body": "Well everyone \n\nIt doesn't look good for me I don't want to be ungrateful but I'm on a steady slope downhill \n\n2019 peak \n\n2024 almost down 200% then where I started",
            "score": 1,
            "replies": []
        },
        {
            "author": "JammyHorizon17",
            "body": "Yeah cause I'm not in school anymore. College was better but working damn near full time in the trades with a chill as fuck boss makes life a lot easier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wetbluewaffle",
            "body": "Aaaand back into the fire we go with 2025, prepare yourselves....the shit storm is coming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BetterRice1543",
            "body": "2024 was my worst year yet please get rid of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Halo_wolfie124",
            "body": "Man, i wish this were the case for me. Life was good till 2020, then obviously covid fucked it up, then it was ok, and now it's bad again :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "theloneknocking",
            "body": "All in all, the progress is very hard to describe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "winterflowersuponus",
            "body": "Nice to see a touch of optimism after many years",
            "score": 1,
            "replies": []
        },
        {
            "author": "EstablishmentNo2847",
            "body": "2025: Already not my year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Trick_Student_9188",
            "body": "2024 was garbage and now I’m not happy",
            "score": 1,
            "replies": []
        },
        {
            "author": "anallobstermash",
            "body": "2024, not so bad as we got trump in",
            "score": 0,
            "replies": []
        },
        {
            "author": "KeepOthersSafe",
            "body": "Day 3 and I’ve been informed of an event in my birthday. My moms planned to have her new kids baptism on the same exact same day. I asked her if she knew that day was my birthday and she said she forgot. Now I have to scrap the plans I’ve been excited to do with all my friends one last time before I leave for college. I’m more annoyed than mad. But the week prior to my bday is Valentine’s Day, and the week later is my friend’s birthday party. He’s turning 21, so I don’t want to host a last party near his. I hope the rest of the year won’t go like this, but it feels like it will.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -91,
            "replies": []
        }
    ]
}