{
    "title": "Hans Niemann confirms that Kramnik will join him in Paris as his coach!",
    "author": "Original_Parfait2487",
    "subreddit": "chess",
    "rank": 2,
    "score": 821,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 141,
    "url": "https://i.redd.it/8vco2uverhpe1.jpeg",
    "id": "1jec1kb",
    "selftext": "Today while live-streaming TT Hans Niemann confirmed that Kramnik will be accompanying him at the Paris Freestyle on Chess Tour (and potentially at the Grenke open afterwards) as his coach \n\nHe also mentioned doing a few IRL streams with Kramnik\n\nNot only Kramnik will face a lot of people he has had a hard with at Paris, but the last tournament he coached Hans, Hans achieved the highest TPR of the year (amongst all players)\n\nExciting development for chess fans who want to see some fighting chess!",
    "comments": [
        {
            "author": "throwawaycauseshit11",
            "body": "it's weird how kramnik has this conspiracy about everyone cheating yet he constantly works with and hangs out with niemann, a proven cheater. Like their only real commonality is being social pariahs in the chess world",
            "score": 1033,
            "replies": [
                {
                    "author": "MrArtless",
                    "body": "I think in Kramnik’s mind the fact that Hans admitted he cheated and it was many years ago means he likes him while the other people he accuses dont admit it becuase they werent cheating but to Kramnik they are active cheaters and liars.",
                    "score": 237,
                    "replies": [
                        {
                            "author": "yoda17",
                            "body": "You’re assuming that Kramnik’s cheating accusations are in good faith, but they are not. I doubt Kramnik really believes that Hikaru cheats because his YouTube videos have an eval bar or that Naroditsky cheats because he doesn’t stream every part of his room during TT. He also played Jospem twice irl and never apologized or retracted his accusations despite Jospem performing as expected, and he regularly accuses anyone lower rated who beats him on chesscom of cheating.\n\nKramnik doesn’t like people associated with chesscom and tries to ruin their reputation using false cheating accusations. This is also why he likes Hans, who is the poster boy of conflict with chesscom.",
                            "score": 137,
                            "replies": [
                                {
                                    "author": "Jason2890",
                                    "body": "RE: evaluation bars in Hikaru’s video:\n\nI honestly don’t think Kramnik understands how editing works and legitimately thinks (or at least thought) that Hikaru also had access to those evaluation bars while he was playing since they were visible in the video.  So I would not be surprised at all if he actually thinks Hikaru is cheating because of stuff like that.  ",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "VokN",
                                            "body": "Wouldn’t be surprised if he’s tweeting from an old USSR terminal tbh",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jjw1998",
                                    "body": "Not that Kramnik isn’t nuts but does he not also worship Magnus, who is basically Mr Chess.com? Not sure it’s a chess.com thing rather than a Kramnik being crazy thing",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Medical-Chart-6609",
                                            "body": "\\>does he not also worship Magnus  \nNo, he doesn't worship Magnus. He just doesn't take direct digs or throw cheating accusations against him cos at that point even a toddler will think you are insane. Also, he leverages Magnus as a tool in his cheating accusations. Cos you need to have some human reference or standard to compare your analysis.",
                                            "score": 25,
                                            "replies": []
                                        },
                                        {
                                            "author": "IllustriousHorsey",
                                            "body": "Yeah in Kramnik’s mind, Magnus is so fucking good that anyone that even plays at *his* level must be cheating. Like, just imagine how good you have to be for someone to see you and be like “yeah if anyone gets even close, that’s sus” lmfao",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Fluffcake",
                                                    "body": "Magnus is still significantly better than the second best active chess player.\n\nIf you get him in a setting where he is motivated, takes it seriously and play more than one game, he will still prove this to be the case.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "IllustriousHorsey",
                                                            "body": "Certainly not arguing otherwise haha",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NaoCustaTentar",
                                            "body": "Magnus is also the greatest player of all time. That probably holds a Little more weight than being in business with chesscom",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "LowLevel-",
                                            "body": "It could be both.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Madmanmangomenace",
                                    "body": "The secret is that you dont have to like Hans, Vlad or chess com. You can realize they're all cracked in some ways.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "kaninkanon",
                            "body": "Hans has proven himself beyond any reasonable doubt that he is in fact one of the strongest chess players in the world. And Hans was able to show as much when they met in person. So Kramnik has no reason to doubt him.",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "akuOfficial",
                                    "body": "This arguement falls apart once you remember that he also accused Hikaru and other top players of cheating aswell.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "chilimayobaby",
                                    "body": "Hi Hans",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Original_Parfait2487",
                    "body": "After Kramnik accused Hans of cheating (before he went insane and started accusing everyone else) Hans very politely asked for a training camp with Kramnik so he could “learn more about Hans’ chess”\n\nKramnik accepted (where the photo in my post comes from) and whatever Hans did there must have really impressed Kramnik since he stopped accusing Hans afterwards\n\nI think Kramnik set a goal that Hans’ should be a top 10 player by the end of 2024, despite him only being 2683 (and at the bottom of top 100 players) at the time \n\nThis training camp was also a turning point for Hans’ chess. As right after he had the highest tournament performance of 2023, and improved more than 50 elo points since then\n\nAt some point since then Kramnik seems to have started coaching Hans again, and they somehow have a friendly relationship despite all the odds",
                    "score": 82,
                    "replies": [
                        {
                            "author": "Bramsstrahlung",
                            "body": "Without a doubt, Hans will be paying him a lot of money as well. I'm sure that helps",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "gabrrdt",
                                    "body": "We do the procedure.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Original_Parfait2487",
                                    "body": "Kramnik isn’t exactly starving lmao \n\nYou can literally count on one hand the amount of chess players with higher lifetime prize money then him\n\nIf he invested it right any amount of coaching he will ever do from now on will be more due to personal interest then money",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "LowLevel-",
                                            "body": "> Kramnik isn’t exactly starving\n\nTrue, but he also announced that he will start a crowdfunding campaign to finance his lawsuit against Chess.com, saying that he can't fully afford it. He'll gladly take Hans' money, and at this moment he needs it.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "dc-x",
                                                    "body": "I think he knows he's just throwing money away with that lawsuit, and it's more so that he rather throw away other peoples money than his.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SuspectHumble8004",
                                                    "body": "it is not hans money",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Bramsstrahlung",
                                            "body": "Not sure what point you are trying to make here - are you suggesting you think professional chess players offer coaching and training camps for free?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "keravim",
                                                    "body": "The point is that if Kramnik didn't want to work with Hans he'd be able to say no because he's got enough money from his career as a player to not have to take up any old job opportunity",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Original_Parfait2487",
                                                    "body": "No lmao. I’m sure that Hans (patron) is handsomely compensating Kramnik for his coaching\n\nMy point is that Kramnik is a happily RETIRED boomer\n\nCould he make TONS of money coaching for a living? Sure, but he doesn’t for anyone else\n\nHe chooses to coach Hans when he could just as easily say no to the money if he didn’t want to",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cXs808",
                            "body": "> Kramnik accepted (where the photo in my post comes from) and whatever Hans did there must have really impressed Kramnik since he stopped accusing Hans afterwards\n\nturns out players are good at chess. haven't heard a peep about jopsem since he played kramnik too. he just tosses out bullshit accusations to stay relevant and then shuts his mouth once he realises people are better than he thinks.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "minimalcation",
                            "body": "I feel like people always sleep on Kramniks ability and insight.  Hans getting a ton of 1:1 time with a former champ is huge.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "BarrattG",
                            "body": "I'd love to have this unlikely relationship made into a movie.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bpm6666",
                    "body": "Carlsen on Kramnik:  \n\"Kramnik thinks he knows everything.\n\nIt’s very impressive how Kramnik reels out variations and so on, and it’s not so easy to discern if you don’t understand the game well yourself, but if you look a little deeper it’s often nonsense. He always plays very principled chess, but the biggest difference between him and me is that he makes a lot more mistakes. Often he seems to think he’s in the right, but I’m actually right.\n\nHe’s very confident. He’s not afraid of anyone. He doesn’t think I’m better than him. He doesn’t think Aronian’s better than him and he doesn’t think Anand is better than him. He actually loses games to Nakamura, but he certainly doesn’t believe Nakamura is better than him.\"\n\nSo a part of Kramnik probably wants to prove the world that he is smarter that the rest and understands Niemann better.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "1derful",
                    "body": "I honestly think Hans and Kramnik have leaned in to becoming the \"heel wrestlers' of chess. It's done wonders for them getting attention, although I don't think it's attention I would consider good.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "scrotalayheehoo",
                    "body": "I think this aligns with my theory about why Kramnik goes so crazy about others “potentially” cheating and that it’s just because he was accused himself of cheating. Probably related to Hans in the “unfair” accusations but doesn’t understand that him doing what he does is the same thing",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "2-_-3",
                    "body": "Yin and Yang",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "in-den-wolken",
                    "body": "> Like their only real commonality is being social pariahs in the chess world\n\nYes, they both (separately) feel that the entire world is **unfairly ganging up** on them. That's a powerful emotional connection.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Worldly_Comparison42",
                    "body": "This",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cheesecake_Jonze",
                    "body": "Its going to be very awkward if Hans goes through with the polygraph and it indicates he cheated. \n\nYes, polygraphs are nonsense, but Kramnik, who has never been wrong about anything in his life, has been an outspoken believer in them ever since one \"cleared\" him of cheating accusations.\n\nedit: I didn't see that Hans already backed out lol.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bakanyanter",
                    "body": "It's pretty obvious. Hans is not a current cheater. Kramnik has issue with current cheaters.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "panarkos",
                    "body": "Kramnik cheated against Topalov. That's why he's working with Niemann and going for the cheaters on chess.com",
                    "score": 1,
                    "replies": [
                        {
                            "author": "guythedude7",
                            "body": "Kramnik cheated against Topalov? Stop these trush talkings!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Maxim_2003",
                    "body": "He literally accused Hans of cheating and Hans proved to him he's legit lmao. Stop hating Hikaru fanboy",
                    "score": -16,
                    "replies": [
                        {
                            "author": "throwawaycauseshit11",
                            "body": "hans may be legit, he's also a confirmed cheater. I don't particularly like hans but that doesn't mean I have to like hikaru, they can both be immature.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "UnderstandingSea4745",
                                    "body": "I’m not defending anyone because his behavior after the game with Magnus was odd but he is a confirmed cheater on online and not over the board.\n\nA lot of high level well known chess players say the tournaments for cash prizes on chess.com have tons of cheaters in the community.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "throwawaycauseshit11",
                                            "body": "since kramnik's stance on cheaters in titled tuesday is fairly clear it's still quite ironic to me. But you make a good distinction between online and otb",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lrargerich3",
                    "body": "Hans is his subject-study.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Ok-Term6418",
                    "body": "bro you and everyone upvoting you needs to learn how the real world works. there is a thing called professionalism and emotional maturity.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "throwawaycauseshit11",
                            "body": "hans and kramnik aren't exactly beacons of professionalism and emotional maturity",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Ok-Term6418",
                                    "body": "yes because you know them personally in the real world i assume",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "throwawaycauseshit11",
                                            "body": "I don't need to know them to make a very educated guess about the emotional maturity of hans niemann. Do you genuinely think he could be very emotionally mature?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "freedisband",
            "body": "Nightmare blunt rotation",
            "score": 46,
            "replies": [
                {
                    "author": "Fresh-Ear9498",
                    "body": "honestly a blunt with these two sounds like a pretty fun night of blitz \n\n\n\n\n\nespecially if we get to trash the hotel room together afterwards",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cavillrine_",
            "body": "If Irony had a face!",
            "score": 90,
            "replies": []
        },
        {
            "author": "SpicyMustard34",
            "body": "clowns flock together.",
            "score": 138,
            "replies": [
                {
                    "author": "Gahvandure2",
                    "body": "Two assholes, one pic.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "qonoxzzr",
                            "body": "What exactly does make Hans an asshole? \n\nKramnik I understand because he accuses innocent players without actual reasons and while Hans is obviously unlikable I don't see a reason why he should be called an asshole.",
                            "score": -13,
                            "replies": [
                                {
                                    "author": "iAmPersonaa",
                                    "body": "Trashing the hotel room? Ditching mid interview after a win against magnus (cant even say it was frustration from losing)? Trash talking others who were defending him during all the drama (gotham was mostly on defending side or at least forgiving the mistakes made by a kid side when he was covering the subject, yet hand still attacked him for a while cause he associates with chess com and hikaru)?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "qonoxzzr",
                                            "body": "Yeah the hotel room is a valid point.\n\nAs for the comments against Levy I wouldn't be too harsh on Hans' because at that moment it must have felt like the entire chess world was against him and he knows very well that Levy would not side with Hans over chess com or Magnus/Hikaru.\nI also can't remember any comment made by him in that context which had me thinking like „wow Hans is such an asshole“ it was always more like „why can't this kid just simply shut up for his own sake instead of digging his own grave?“",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PixelGamer352",
                                    "body": "Even if he didn’t cheat in the OTB tournament, he has generally been an asshole about it online, posting many disrespectful and unprofessional comments. For example, he has pretty aggressively accused Gothamchess of being a chess.com puppet incapable of creating unbiased chess news",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Renozuken",
                                    "body": "What's the first word to come to mind when someone is very unlikable?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "qonoxzzr",
                                            "body": "To be honest just because someone is unlikeable I don't see the need to call them any insults.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Renozuken",
                                                    "body": "That's a whole different thing though?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "qonoxzzr",
                                                            "body": "I don't see why.\n\nBut to answer your original question, the word that comes to my mind first is obviously ‚unlikeable‘.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Gahvandure2",
                                    "body": "Lol Kramnik you can understand? Because of his behavior, right? Can you keep following that train of thought? It's really not that hard. \n  \nHans is obnoxious, petulant, flippant, dismissive, and rude. He's an asshole.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ForsakenAd2845",
                    "body": "Only thing we’ll get out of this collab are some memes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Assios",
            "body": "Kramnik has previously advocated for using lie detectors to fight cheating in chess: https://x.com/VBkramnik/status/1826982318222766286.\n\nWhen I replied to him that lie detectors are bullshit, he blocked me.\n\nNow he’s working with Niemann, who just refused to take a lie detector after losing to Dubov because \"lie detectors are pseudoscience.\" Grabbing popcorn while waiting for Kramnik's response to this one.",
            "score": 20,
            "replies": [
                {
                    "author": "Original_Parfait2487",
                    "body": "Yeah, I warned Hans his decision might put him in hot waters with his coach today on his stream…\n\nI feel that if it pisses of Kramnik he will likely at least arrange one on his own terms",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PrinceZero1994",
                    "body": "Hans refusing the like detector test for that reason is bullshit.  \n\n>I have refused to do it in Dubai and cover all  expenses. Daniil should also apologize for leaving without shaking hands, calling the match a clown show, repeatedly disrespecting me. I am exploring potential options, and am open to doing it in New York. Regardless, the chess will continue speaking for itself, I have nothing left to prove.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xelabagus",
                            "body": "Yeah he edited this, it previously said he would not be taking it. He edited it after his TT stream where virtually all of chat was calling him out for backing out. He ran from the stream.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Matt_LawDT",
            "body": "Start the procedure",
            "score": 32,
            "replies": []
        },
        {
            "author": "LowLevel-",
            "body": "There is some evil, immature genius in their attempts to fuel chaos, controversy and antagonism.",
            "score": 31,
            "replies": [
                {
                    "author": "ArcherClear",
                    "body": "Bruh relax, they're just existing",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "jtrain7",
            "body": "Two dorks",
            "score": 20,
            "replies": []
        },
        {
            "author": "Op111Fan",
            "body": "sounds like r/AnarchyChess to me",
            "score": 7,
            "replies": []
        },
        {
            "author": "GameTheory27",
            "body": "John Oliver looking rough...",
            "score": 11,
            "replies": []
        },
        {
            "author": "gablov",
            "body": "Couple: No our realitionship is not toxic at all.\n\nThe Couple:",
            "score": 16,
            "replies": [
                {
                    "author": "QMechanicsVisionary",
                    "body": "Tbh Niemann and Kramnik's relationship probably isn't toxic",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ResolutionMany6378",
            "body": "Met Hans last year when he was in Dallas, TX playing vidit and we added each other on Discord.\n\nI sent him a meme about a month later then he blocked me.\n\n10/10 would meet Hans again.",
            "score": 14,
            "replies": [
                {
                    "author": "caze-original",
                    "body": "Obviously you can't believe internet stories like this without a grain of salt, but this is so funny I want to believe it",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "buddaaaa",
            "body": "I can’t imagine a single comment here talking about it, but:\n\nThis is such a great chess pairing. Kramnik is one of the great modern players. The maturity in his style matched with Hans’ fighting spirit really makes them a great coach-student pairing.",
            "score": 29,
            "replies": [
                {
                    "author": "Original_Parfait2487",
                    "body": "THAT\n\nAfter Kramnik helped Hans prep for the tournament of peace Hans did SOOOO well that everyone thought he was cheating and were shocked when he kept winning even after they brought the metal detector and increased delays every day lmao\n\nHe ended that tournament with the highest TPR amongst all players in 2023 despite only being a lowly 2683 at the time",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Aggravating-Alps4621",
                    "body": "We need Hans + Kramnik at the candidates.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "caze-original",
                    "body": "Yeah, like I'm glad that Hans genuialy seems to get better and improve with Kramnik as coach, I just dislike them as people, that's all",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gpetrov",
                    "body": "Accused cheater accusing cheaters helping confirmed cheater, the irony here is incredible.",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrinceZero1994",
            "body": "Past world champion and future world champion !!",
            "score": 3,
            "replies": []
        },
        {
            "author": "robby_arctor",
            "body": "Just need Fischer for the unaccountable narcissist hat trick",
            "score": 4,
            "replies": []
        },
        {
            "author": "noahhova",
            "body": "Couple of clowns cutting it up!",
            "score": 9,
            "replies": []
        },
        {
            "author": "techaansi",
            "body": "The villain Arc that skak needs",
            "score": 4,
            "replies": []
        },
        {
            "author": "HamptonBays",
            "body": "Is that Edward Norton?",
            "score": 2,
            "replies": []
        },
        {
            "author": "NBAGuyUK",
            "body": "Hans gotta do the lie detector test before I watch another second of his vids/streams\n\n\nWish him all the best with his chess (quite sure he'll keep doing well!) but absolutely no interest in him as a person now.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Original_Parfait2487",
            "body": "Tbh I wonder if having his coach there will help prevent Hans from tilting if he gets a couple of bad results\n\nThe pressure he will be putting on himself will be ENORMOUS and he is known to be a streaky player",
            "score": 4,
            "replies": []
        },
        {
            "author": "Rumi4",
            "body": "what is an IRL stream?",
            "score": 1,
            "replies": [
                {
                    "author": "kruegerc184",
                    "body": "“In real life” which would clear up my question of “why do they have that god awful lighting set up?” Lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Original_Parfait2487",
                    "body": "Apparently Hans wants to hire someone to follow them around during the Paris freestyle chess tour lmao\n\nSo we would get to see a bit of the “daily live” of a pro chess player during an important tournament\n\nMight be interesting",
                    "score": 2,
                    "replies": [
                        {
                            "author": "xelabagus",
                            "body": "Woke up, studied several lines in the Taimanov, tweeted, played chess, got door dash, studied the Tarrasch, went to bed at 1:30am without brushing my teeth",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jaromir39",
            "body": "Maybe this has been discussed elsewhere and not really a chess question: How is Niemann funding all this traveling and nonsense? Is he spending his inheritance? He is not a star streamer or has big sponsors.",
            "score": 1,
            "replies": [
                {
                    "author": "Original_Parfait2487",
                    "body": "No one knows, some speculations:\n1) His family is way richer than anyone thought\n\n       - Could be but I honestly feel that’s BS, no one has been able to give a drop of evidence to indicate they are anything more than upper middle class nor that they are in good terms \n\n2) He won more money from ♟️.com then we all thought\n\n        - I feel he might have won SOME money, but I would be shocked if it was a large amount\n\n2) He has a secret rich patron (or two)\n\n        - He posted a photo with a crypto multi millionaire, I wouldn’t be shocked if the guy doesn’t mind giving money to Hans fund those matches as a hobby",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Domaramvic",
            "body": "Interesting",
            "score": 1,
            "replies": []
        },
        {
            "author": "RomiBraman",
            "body": "Stupid question but are there any spectators on this specific tournament? I live in Paris and would love to attend?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaskedBirder",
            "body": "Interesting",
            "score": 1,
            "replies": []
        },
        {
            "author": "exjwLuke",
            "body": "Interesting",
            "score": 1,
            "replies": []
        },
        {
            "author": "ABJ_TheBeater",
            "body": "The good ending",
            "score": 1,
            "replies": []
        },
        {
            "author": "Streamanon",
            "body": "Sith lord and apprentice",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clavilenyo",
            "body": "The best heel duo of the chess world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adv3nt0",
            "body": "You cannot root against these two!! Wishing them a smooth sailing",
            "score": -1,
            "replies": []
        },
        {
            "author": "Soul_of_demon",
            "body": "He has one of the strongest players as his Coach tho.He defeated Kasparov in WCC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "00juergen",
            "body": "Good for them. Still too funny",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "author": "Maxim_2003",
                    "body": "This is a chess sub Reddit, Kramnik is a former world champion and Hans is top 30 and one of the most popular chess players atm. Why should we not give them attention?",
                    "score": 31,
                    "replies": [
                        {
                            "author": "QMechanicsVisionary",
                            "body": "Hans is top 20",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "Maxim_2003",
                                    "body": "You made that up btw and it doesn't disprove what I said, they're both very relevant to this subReddit.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "Maxim_2003",
                                                    "body": "Lmaoo how is it chess drama when Kramnik is coaching Hans to PLAY A CHESS TOURNAMENT? Isn't this actual chess?",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "in-den-wolken",
                                                    "body": "I looked through the comments for your recently created account – have you posted a single thing about the actual game of chess? \n\nLike, a problem? A question about the opening? Some original analysis?",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "OkProfessional1590",
                                    "body": "Well the insane one will eventually be in the top 5 and world champion in at least one category if you like it or not.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "OkProfessional1590",
                                                    "body": "What exactly makes Hans a Putin shill?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "typeshizasmoker",
                                                                    "body": "I think many chess players at the high level are completely absorbed into chess, I genuinely doubt they really think about much else.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "OkProfessional1590",
                                                                    "body": "Well what I have been seeing from the Americans the past few weeks showed me that Trump may be the biggest Putin shill of them all.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "kaninkanon",
                                                                    "body": "I see Magnus Carlsen going to Saudi Arabia, and unlike Hans he has no excuse for it",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Diligent-Wave-4150",
            "body": "Good call. This cooperation is not only interesting but also constructive. Keep it rolling guys!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RightDelay3503",
            "body": "While Kramnik is indeed insane on calling a lot of people cheaters, I would also like to remind everyone that Hikaru is equally bad. It's just that he has more fans, and he gets away with it..",
            "score": -4,
            "replies": [
                {
                    "author": "Secure_Raise2884",
                    "body": "The last person Nakamura accused of cheating was Supi, no? That was three years ago. Kramnik does this shit weekly",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ScholarOpposite799",
                            "body": "Mas, é porque o Nakamura bate em jogador menor. Ele achou que o Supi era um qualquer, mas ele só está entre os 3 melhores do Brasil como o Fier, Krikor Mekhitarian e o próprio Supi.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hemlock_23",
            "body": "Looks like another stellar performance for Hans is incoming. After all he's got a World Champion as a Coach. Kramnik's modern chess style really seems to suit Hans' fighting chess.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lynx4ben",
            "body": "Two cheaters unite.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Term6418",
            "body": "Glad to see them working together. I am excited for Niemann and hope he enjoys his time in Paris",
            "score": 0,
            "replies": []
        },
        {
            "author": "Active_Inevitable933",
            "body": "Switzerland is expensive. No wonder Kramnik takes every gig he can get. If Hans is willing to throw cash around... Kramnik somehow has to pay those groceries.",
            "score": 0,
            "replies": [
                {
                    "author": "Original_Parfait2487",
                    "body": "Kramnik is the 5th player with the highest lifetime prize money earned lmao \n\nI wouldn’t be surprised that after appearance fees he won a comfortable 10M from chess before retiring\n\nMoney is not a issue",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "in-den-wolken",
            "body": "Perhaps Petrosian and Feller will round out the team?",
            "score": 0,
            "replies": []
        },
        {
            "author": "gabrrdt",
            "body": "The procedure is coming!",
            "score": 0,
            "replies": []
        },
        {
            "author": "ZealousidealItem0",
            "body": "ചക്കിക്ക് ഒത്ത ചങ്കരൻ 😂",
            "score": 0,
            "replies": []
        },
        {
            "author": "WolverineOpening6207",
            "body": "It seems that controversial people gravitate towards each other.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Madmanmangomenace",
            "body": "I loved Kramnik at peak but he's a whiny, old crank now. No wonder Hans chose him... If he finds a time machine and goes back to 2001, this could be a really big move!",
            "score": 0,
            "replies": []
        },
        {
            "author": "LolaSmurfRL",
            "body": "Is there a carnival in Paris or something? 🤡",
            "score": 0,
            "replies": []
        },
        {
            "author": "in-den-wolken",
            "body": "Just had an idea: what if Trump drops US sanctions against Russia, and then everyone else (including FIDE) does as well.\n\nSince Hans is already, as far as we can tell, bankrolled by some Eastern European crypto bro ... could we see him switch federations to Russia??! \"Since America is so UNFAIR.\"",
            "score": -1,
            "replies": []
        },
        {
            "author": "pfire777",
            "body": "Chess needs its Heels",
            "score": -1,
            "replies": []
        },
        {
            "author": "seledkapodshubai",
            "body": "My top two favorite players in the world! I can't tell you how happy I am to see them together!",
            "score": -1,
            "replies": []
        },
        {
            "author": "FractalShade",
            "body": "If you want entertainment -- this is the way.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Mugi1",
            "body": "That's entertainment.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ShiningMagpie",
            "body": "Well, nobody else wants to work with them. So they are stuck with each other.",
            "score": -1,
            "replies": []
        },
        {
            "author": "SQLvultureskattaurus",
            "body": "Oh wow, two idiots combining forces",
            "score": -1,
            "replies": []
        },
        {
            "author": "based_mouse_man",
            "body": "Hans needs a social skills coach more so than a chess coach.",
            "score": -1,
            "replies": []
        }
    ]
}