{
    "title": "My friends brother wrote this",
    "author": "Dragonlily6277",
    "subreddit": "Weird",
    "rank": 6,
    "score": 340,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 168,
    "url": "https://i.redd.it/qqyxi47gyape1.jpeg",
    "id": "1jdlkub",
    "selftext": "Can anybody help me decode it? For context, my friend’s brother cut off the family 2-3 years ago and my friend asked me to post this. ",
    "comments": [
        {
            "author": "Successful_Fun_2069",
            "body": "I have a son in his twenties who is schizophrenic and he would write things like this. Has he been seen by a doctor? I also don’t want to be alarmist. Obviously I cannot diagnose anyone. I’m just noting the similarities to my son’s writings.",
            "score": 529,
            "replies": [
                {
                    "author": "Upset_Pumpkin_4938",
                    "body": "Yeah these types of Schizo writings are posted here all the time unfortunately. Never really legible, just off putting.\n\nThis person needs psychiatric evaluation immediately",
                    "score": 181,
                    "replies": [
                        {
                            "author": "sumthinknew",
                            "body": "I would argue that this is very legible. Maybe not coherent, but legible.",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "Upset_Pumpkin_4938",
                                    "body": "Ok fair. It is legible, just not coherent.\n\nThe person who said word salad is correct. Words but no sense together / in context",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "authorityhater02",
                                            "body": "He crazy as a tortilla in a christmas tree",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "AshleysExposedPort",
                                                    "body": "Love this saying",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Farside3",
                                            "body": "I'm pretty sure the first couple of lines have something to do with rappers. After that, I think he's writing down where he thinks words come from.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "visitingghosts",
                                    "body": "I agree that he’s likely experiencing symptoms of psychosis or schizophrenia, but what he’s writing appears to focus on the etymology of words and his belief in their connections to God. The connections he’s drawing are very loose and disjointed, which aligns with perceiving patterns or relationships that aren’t actually there, and is a common symptom of psychosis.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Good_Strength6258",
                    "body": "I work in mental health and I’ve seen people with psychosis write similarly (doesn’t make sense but there was obviously a lot of time spent on it). Your friend’s bro should get a mental health evaluation if there are other concerning behaviors such as not showering or taking care of himself, paranoia, delusions, hallucinations, and if he doesn’t seem like himself (a drastic change from how he used to be).",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Arsenic_Bite_4b",
                    "body": "I have a psych degree from long ago, and it's truly fascinating that one can almost instantly recognize schizophrenia from this kind of writing.\n\nI too think that this person should be evaluated immediately if they haven't yet.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "dirthoarder",
                    "body": "I have a close family member with schizo-affective disorder who writes things similar to this. I’ve also worked with many individuals who have frontal brain trauma, drug induced psychosis, or SEVERE trauma who have engaged in similar behaviors. I’d place my money on the face your friends brother is experiencing psychosis or has endured some form of brain trauma.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "SilentxxSpecter",
                    "body": "Youre not overreacting. We found these type of writings in my cousins belongings when he died. The only conclusion we could reach was that he had early onset schizophrenia, due to an aunt and sister both having it.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Successful_Fun_2069",
                            "body": "My husband’s mother had schizophrenia and I’m sure that’s how our son got it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Reddit_N_Weep",
                    "body": "Alarmist actions needed in this situation.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "ducktective257",
                            "body": "False friends have different meanings though, they just sound or look similar",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Sterling_-_Archer",
                                    "body": "And schizoaffective disorder causes you to see patterns where there are none, which is why this sort of thing is so prevalent with that disorder. Imagining relationships between words that aren’t related. Also grandiosity, though I don’t see that here.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Traditional_Nebula96",
                                            "body": "I'm fully aware. Curiosity is important, not just in type mode or meditation. Everyone is different. These are root words...seeing patterns and trying to decipher things are also aspects of high IQ and writing in journals hurts no one. I don't know the family, but hope everyone is fine",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HawkingTomorToday",
            "body": "IDK, but Cockroach Cock Block would be a great name for a punk band.",
            "score": 204,
            "replies": [
                {
                    "author": "velocitas80",
                    "body": "opening track. God is Sperm.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "lordnoak",
                    "body": "How dare you, it’s already the name of my violin quartet!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Ragzad_Namoras",
                            "body": "Merely a suggestion, but a punk violin quartet, perhaps? 🤔🙃😁",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "HawkingTomorToday",
                            "body": "We can definitely be friends.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Caukblockalypse",
                    "body": "Dibs on lead vocals",
                    "score": 3,
                    "replies": [
                        {
                            "author": "HawkingTomorToday",
                            "body": "Username checks out",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AgreeableField1347",
            "body": "Mental Illness - metal Illinois - rust belt decline in auto mfg",
            "score": 145,
            "replies": [
                {
                    "author": "Aydum",
                    "body": "I laughed way too hard at this 😂",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaFinnsEmporium",
            "body": "It looks like the writings of someone suffering with mental health issues with an obsession on breaking down hidden meanings in different phrases and words. People suffering with mental health issues have a tendency to self isolate as well. They may have an interest in magic as well but I feel like this a mental health issue at it's core. I mean, he's breaking down Walker Texas Ranger on the same page as Emperor which lead to impersonator, according to him not a fraud, and on and on.\n Just try and get the guy help, there's no translation to be had in all likelihood.",
            "score": 110,
            "replies": [
                {
                    "author": "Salt-Dance9",
                    "body": "It reads like stream of conscious word association taken as divine insight. ",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dragonlily6277",
            "body": "Thanks to everyone who posted an actual answer to this. My friend is telling his family about this and scheduling a wellness check for his brother.",
            "score": 83,
            "replies": [
                {
                    "author": "CaptainFearless8579",
                    "body": "Ask his brother to ask if he's into conlang to narrow down.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Dragonlily6277",
                            "body": "What’s that",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "rosewatersss",
                                    "body": "sometimes people into linguistics as a hobby make up new languages for fun! the kind of people that would learn klingon from star trek as a legitimate language or construct an entirely new language (toki pona) through internet communities and stuff, not from cultures that actually exist. check out r/conlangs",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "jayraypaz",
                                            "body": "I was thinking the same thing. It looks like he has a word, takes a similar word (disease sounds like dizzy), looks at it in different language for contextual clues about the origin. Seems less mental illness more word breakdowns/ creating a new language to me idk",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "CaptainFearless8579",
                                            "body": "Esperanto is the most commonly known used conlang after Tolkien's LOTR aesthetic conlang.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "Kamekazekitten",
                                            "body": "I did this type of stuff (and learning multiple languages randomly) as a kid due to neurodivergence and words being weird enough as is because we just make stuff mean whatever so I broke down words to make new words and meanings just to see how it went… good to know not everyone is assuming a cluster b disorder here :/",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Vera_98",
                                                    "body": "When I looked at this post my first thought was this would be a potentially good way to work on a language for my book.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Confident-Skin-6462",
            "body": "looks like schizophrenia, as others are saying.",
            "score": 60,
            "replies": []
        },
        {
            "author": "Electronic-Tone-1927",
            "body": "He’s got cool handwriting",
            "score": 18,
            "replies": [
                {
                    "author": "CaptainFearless8579",
                    "body": "Graphology tells he's smart open minded and skeptic, inclined towards scientific methods, introverted, quiet, probably into fantasy, obsession with time themes.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Agreeable_Tax497",
                            "body": "That's made up",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FrenchPetrushka",
            "body": "Guys, it's just etymology, lexicology or something like that. It's how the words root from. \n\nVisibly he is studying the origin of words. \nFirst it looked like something weird but it got logical as I was reading it. \n\nAdd: and the more I'm reading it gets weirder. Sorry. I don't know.",
            "score": 17,
            "replies": [
                {
                    "author": "conconcotter",
                    "body": "Walk texas ranger = aliens",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deviant_Raven",
            "body": "If we take everything into account, the message seems to be: \n\n\"The world is built on hidden structures-language, numbers, and symbols hold the key to understanding reality. Power, creation, and spirituality are all encoded in these systems, but society has lost sight of this knowledge, leading to decay and confusion. To truly understand reality, one must break down language and numbers to see the deeper truths that shape existence.\"\n\nThis seems to be the ultimate meaning hidden in the notes.",
            "score": 11,
            "replies": []
        },
        {
            "author": "BOOSHMEHN",
            "body": "Trying to find connections between words and their roots and their roots' meanings?",
            "score": 8,
            "replies": []
        },
        {
            "author": "Drinkdrankdonk",
            "body": "He’s schizophrenic",
            "score": 20,
            "replies": []
        },
        {
            "author": "dystopiannonfiction",
            "body": "Does he use meth or suffer from some sort of psychosis? Perhaps both?",
            "score": 22,
            "replies": [
                {
                    "author": "Organic-Low-2992",
                    "body": "This one.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "dystopiannonfiction",
                            "body": "It reads a whole lot like my brother's writing when he was on a week-long meth binge.\nMeth would explain why he's ostracized from his family, too. Shit is WILD and scary to witness. I don't blame anyone who has to go the tough love route as a means of self-preservation",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MacGrubersMom",
            "body": "looks like he is analyzing word beginnings and endings and seeing how they relate to other words",
            "score": 7,
            "replies": []
        },
        {
            "author": "pink_soaps26",
            "body": "Religious psychosis? A lot of these words seem common, it’s odd that he’s recording definitions like he is taking notes of an epiphany or keeping track of something. I had a friend of mine who was a laid back musician who recreationally did substances but this year he got completely sober and deleted all social media posts to start posting LONGGG handwritten paper letters of bible verses and ranting. People who struggle with religious psychosis tend to have an urgency and are really obsessed with looking for meaning and writing often worrisome things like this. At first we thought he just was sober and trying to heal but there was this anger and strange messaging in his posts just like this. He even started speaking to people in very weird ways totally unlike himself. I posted a video of a band I like and he viewed it then sent a very nasty message about how as a follower of their music I’d be going to hell and that all sounds should be music for the lord only. He was extremely angry and insistent that it was all propaganda to reach people’s minds.",
            "score": 11,
            "replies": [
                {
                    "author": "Successful_Fun_2069",
                    "body": "Religious obsessions are common. My son got into an intense discussion with a monk who told him to read Revelations in the Bible. Thanks, Mr Monk. 😒",
                    "score": 7,
                    "replies": [
                        {
                            "author": "pink_soaps26",
                            "body": "I was wondering if this person is listening to something or somebody like a sermon. This looks very specific like he’s taking notes for these definitions. I wonder if OP has googled any of these to see if this is part of a specific group or speaker?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Successful_Fun_2069",
                                    "body": "The connections they make are fascinating.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "pink_soaps26",
                                            "body": "I’m curious as to how “regression” turns into… that part. Some of these make sense and others I’m like woah, where’d that come from.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Successful_Fun_2069",
                                                    "body": "Sometimes the delusions start slowly as to not even be noticeable. Then my son would start researching things and he’d tell us and become combative if we didn’t agree. He would then start trying to prove his theories which often resulted in these types of writings.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "glycophosphate",
            "body": "Your friend's brother needs psychiatric care and he needs it now.",
            "score": 6,
            "replies": []
        },
        {
            "author": "itsnotapipe",
            "body": "Word salad. It helps.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Krinkgo214",
            "body": "Most of it is word origins and those meanings in historic languages, or similar phonetic words, the Powell Power - ell bit for example. \n\nThis more looks like some sort of word game he was playing for amusement than anything to worry too much about. \n\nAs another user has said it actually looks quite organised.",
            "score": 5,
            "replies": []
        },
        {
            "author": "extraGallery",
            "body": "This looks like either schizophrenic behavior or someone excited about their own new conlang lol",
            "score": 9,
            "replies": []
        },
        {
            "author": "follow_the_rats",
            "body": "So much of this looks like how my brain processes new languages and figures out the roots/meanings of words.",
            "score": 4,
            "replies": []
        },
        {
            "author": "CaptainFearless8579",
            "body": "I am constructing my own constructed language and this is how my conlang book looks like. Making phonetics, grammars based over latin roots and specific notes in my own construct.",
            "score": 11,
            "replies": [
                {
                    "author": "x__silence",
                    "body": "I also create my own words. I don't have schizophrenia. I don't hear voices. The guy may have schizophrenia or maybe he likes creating new words. But he MUST have schizophrenia because this text looks mysterious. Easy.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "CaptainFearless8579",
                            "body": "You don't know how many times I've seen this kind of posts in world construction conlang related subs.\n\nEven more schizofrenic ones. Lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CaptainFearless8579",
                    "body": "Easily interpreted as schizo writings tbh",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alternative_Doubt768",
            "body": "Looks like etymological connections between words, phonetics, meanings etc. Some polish, greek, latin, german... Nothing to look for here really",
            "score": 18,
            "replies": [
                {
                    "author": "cowboy_rigby",
                    "body": "Some of them. Yeah. But he's also comparing walker Texas ranger to extraterrestrials and writes the n-word",
                    "score": 18,
                    "replies": [
                        {
                            "author": "afcagroo",
                            "body": "Plot twist: friend's brother is Chuck Norris. It all fits.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "trenchgrl",
                            "body": "Wait what 😭😭",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AxialGem",
                    "body": "As someone with a background in linguistics, yes there are a lot of genuine etymological connections here. This person probably spent time on Wiktionary :p\n\nHowever, just writing pages of sometimes informed, sometimes perceived connections going off on whatever tangents...I think the term for that is \"loose association,\" and this is something you see a lot in people with schizophrenic stuff going on, right?\n\nNot a psychologist obviously, but yea... pretty typical imo\n\n\nAlso, OP mentioned the person who wrote this cut themselves off from family. Social isolation is pretty typical for schizophrenia too I believe",
                    "score": 12,
                    "replies": [
                        {
                            "author": "gugfitufi",
                            "body": "If anybody is interested, you can create a list like that as well by clicking from word to word in Wiktionary. You could get from caterpillar to terrorism with enough dedication, the difference between us and the guy who wrote this is that he thinks that there is some reason to it, something meaningful and rational.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ResponsibilityLast38",
                            "body": "It also looks like free association exercises used by writers/artists. I had plenty of notebooks with stuff like this (or weirder) when I was younger. I also had notebooks of free association that I would do with my friends, passing the notebook around the room the opposite direction of the joint.  If they are handing it to people to read like they should understand it, may be mental illness. If this is just their own notes and journaling, its none of anyone elses business.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Alkemian",
                    "body": "Perhaps.\n\nBjt the rest is schizophrenia.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dark_Clark",
            "body": "He’s probably going through a manic episode. Please learn about how to properly handle such a situation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SilenceToSerenades",
            "body": "He's practicing Latin and the Necronomicon. He's somehow located deep scripts from the Satanic Church and transfered them onto his own notes.. he's trying to conjure something, or cast some type of spell.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_General_2155",
            "body": "Someone who dabbled in Mysticism and had a psychosis here. I think this might be the idea of something like all speak. Where the phonetics and symbols (letters and characters to make up the word.) have their own derived meanings and importance in themselves. Basically it's a bit of a holistic way of looking at phonetics and the world that creates those phonetics.",
            "score": 3,
            "replies": [
                {
                    "author": "ResponsibilityLast38",
                    "body": "I agree. I also think there is a fine line between madman and magician, and its not terribly unusual for someone to cross it. But in this case this looks like wordplay to me, not a mental break.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "grinwild",
            "body": "At first glance I thought the guy might be coming up with names & titles for some creative project, like a book or a comic; I do creative writing and sometimes like to come up with names for places/characters sorta in similar manner.\n\nThere's an n-word among these though, and a.. cock block cockroach? So, I dunno.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sphynxcolt",
            "body": "From \"First\" to \"Fürst\" to \"Prince\" to \"Führer energy\"\nBro is doing some weird reverse overthinking.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GreenSplashh",
            "body": "It's great that everyone can tell us schizophrenia, but I really wish people really analyzed the writings of those with it. I don't think it's all rambling as people make it out to be and there is some coherent though behind these words.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Glittering_Fox_9769",
            "body": "there's no decoding this. Looks like a schizotypal delusion behavior. Just illegible brain vomit and fixated on something. Has he had any major stressors recently? Traumatic past? Age? \n\nEither way - he needs help",
            "score": 2,
            "replies": [
                {
                    "author": "Blue_Indica",
                    "body": "Illegible? Do you need help identifying any of these perfectly shaped letters? I can help.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Glittering_Fox_9769",
                            "body": "sure, wrong word. Let's substitute it for... undecipherable",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lewd_ReadNY",
            "body": "It’s The Mentaculus.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Own_Hunter_808",
            "body": "I would love to understand what he was trying to work out. I looked at it for ages, but it doesn't make sense to me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beginning_Camp715",
            "body": "High as a kite too, I'm sure of it.  Actually seems pretty logical if you take the time to understand the importance of each Precursor. Boils down to 1's and 0's but it is very intriguing, going to save this and work at the definitions and early exhaltations to see if this man was on to something or letting a high wind down..",
            "score": 2,
            "replies": []
        },
        {
            "author": "shoff58",
            "body": "Either a genius- or mad. Or both.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bridgebeeakrrz",
            "body": "One of the first things I saw was the n word somehow",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Journalist5574",
            "body": "Creative linguistics exercise?  Manic-state word association game? Schizophrenia-related hypergraphia or word-salad?  Brainstorming for some sort of fantasy/sci-fi epic series?  All of the above?",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheYungFaust",
            "body": "This looks like a game my theater director would have us play where we take one word and change a letter at a time until we have a new word",
            "score": 2,
            "replies": []
        },
        {
            "author": "_yilin_",
            "body": "Maybe a made up language?\nEdit: sometimes I write down random stuff that makes no sense because it is like doodling to me and I get to practice a nice handwriting. Doesn't have to be anything tragic unless there are other bad signs of it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rabid_Hermit",
            "body": "I remember my first episode.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KendraNyx",
            "body": "This looks like a weird word association thing. Like I can see the pattern of taking a word, saying it a different way which creates a similar sounding word or phrase and then continue to break that down and go to another word and trying to find a hidden meaning in that? Normally I would say that’s a thing a lot of writers do, but seeing as there’s a lot of strange themes in this I don’t think it’s as innocent as that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "blehitsadino",
            "body": "Looks like the writing of a schizo entering a psychotic state or in one already.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jay_Nodrac",
            "body": "Looks like schizophrenic associations. One thing following from the previous “revelation”. You should watch “A Beautiful Mind” very similar.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CarbonKLR",
            "body": "Paste into chat gpt",
            "score": 2,
            "replies": []
        },
        {
            "author": "Illustrious_Blood_32",
            "body": "Hes Not shizo eez thats a Rhyme Sheet thats why He makes pohnetical comparisons and sillible counts. Its a mix of even and uneben Rhymes maybe for rap...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jakkerak",
            "body": "Is he an aspiring rapper? Looks like it could be language exploration of some kind.\n\nBut yeah. As others said. Maybe a mental health situation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "3003bigo72",
            "body": "What about a crossword game solution or stuff like that? Enigmatic games anagrams, this stuff. He left his solutions around and everyone is looking for the dangerous schizophrenic",
            "score": 2,
            "replies": []
        },
        {
            "author": "Blue_Indica",
            "body": "Dude, all these people saying schizophrenia and that he needs help… what is the harm in being fascinated by, and ‘decoding’, language? Like, he’s not hurting anyone and there are actually some pretty cool associations here. I dig the focus on phonetics and using languages from around the world. What does he need help with? I’d rather him do language stuff on paper than hurt kids like some people do. Stop judging.",
            "score": 5,
            "replies": [
                {
                    "author": "ResponsibilityLast38",
                    "body": "Right. As ive said elsewhere, if hes handing you this page to read as if its sonething that should make sense: may be mental illness. If its his own private notebook/journal its just none of their business.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Blegheggeghegty",
            "body": "That is etymology. Not weird.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Proof-Medicine5304",
            "body": "does he play dungeons and dragons",
            "score": 2,
            "replies": []
        },
        {
            "author": "Arthur_Two_Sheds_J",
            "body": "Schizophrenia",
            "score": 1,
            "replies": []
        },
        {
            "author": "turdfergusonRI",
            "body": "![gif](giphy|3oriO8vwmRIZO6kcNO)",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrsMoonpoon",
            "body": "Schizophrenia. He needs to seek help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Rise9795",
            "body": "[Looks a lot like Paranoid Schizophrenia. ](https://pmc.ncbi.nlm.nih.gov/articles/PMC6056670/)\n\nOf course, you can't diagnose a copy book, but its contents are very unusual.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr_CleanBones",
            "body": "He’s nuts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hugh_jassole7",
            "body": "Run",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ryans_RedditAccount",
            "body": "IDK, but I did notice that there were some television shows mentioned in his notes, so I'm going to assume that there's a connection to his notes and the television shows mentioned.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royalchariot",
            "body": "Looks like classic schizophrenia writing",
            "score": 1,
            "replies": []
        },
        {
            "author": "buddymoobs",
            "body": "Concerning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zaro217",
            "body": "Sometimes these things make sense while dreaming. Unfortunately bro was awake...",
            "score": 1,
            "replies": []
        },
        {
            "author": "derricks350z",
            "body": "I'm betting he has schizophrenia, or something similar. Hope he gets the help he needs",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "As someone who studies demonlogy, none of this stuff is about magic or demons, it sounds more like a trouble mind. Some of it struck me as a bit incel though",
            "score": 1,
            "replies": []
        },
        {
            "author": "Knowledge-Seeker-N",
            "body": "Looks like my high school journal, haha.\n\n\nFun thing is some words rhyme, be it a mental illness or a weird hobby, dude was a poet at heart. This is beautiful, imo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReactionSevere3129",
            "body": "Rap Song",
            "score": 1,
            "replies": []
        },
        {
            "author": "HackedCylon",
            "body": "Jesus ... It's all so clear now ...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Farside3",
            "body": "I think the first couple of lines have something to do with rappers. After that, I think he's writing something to do with Latin and where he thinks words originate from. I'm almost sure that's what it means.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ServiceOnly911",
            "body": "I do see a few translations. Good güt goed for instance. English, German, Dutch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Significant-Tune7425",
            "body": "Get him back on his meds. Nice penmanship. Don’t see that much any more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "2near_death",
            "body": "\"Cock block\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "laura741",
            "body": "Is it not Dungeons and Dragons info?",
            "score": 1,
            "replies": []
        },
        {
            "author": "corgirl1966",
            "body": "Walker Texas Ranger was not on my bingo card",
            "score": 1,
            "replies": []
        },
        {
            "author": "InTheM-A-King",
            "body": "Etymology ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "lemniscate_unicorn",
            "body": "Yall are all saying it's incoherent and illegible. I can understand it. It's WORD ETYMOLOGY. Pick up a dictionary or use Google.\n\nI guess smart people really sound crazy to dumb people.\n\nLooks like highly intelligent and studying where different words originate from.",
            "score": 1,
            "replies": []
        },
        {
            "author": "flyingmutedcolors",
            "body": "Maybe he’s studying word origin?",
            "score": 1,
            "replies": []
        },
        {
            "author": "corgirl1966",
            "body": "Walker Texas Ranger was not on my bingo card",
            "score": 1,
            "replies": []
        },
        {
            "author": "injn8r",
            "body": "I could help decode this, but, it'll take a few days to a week to prepare. I'd have to reach a comparable state of mind. This would require copious amounts of meth and complete avoidance of sleep. I don't think my body could handle that anymore/ever again, I'm old now, and that's a young man's game. I do know a guy who has basically reached a permanent such state, but I don't really want to do the mental gymnastics required to communicate with him.\n\n💡I could give you detailed instructions, directing you through.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rabid_Hermit",
            "body": "Its scary how fluid that is for me to read and follow the pattern. I could continue his works if a ghost writer is required.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheOfficialKramer",
            "body": "He's cray cray",
            "score": 1,
            "replies": []
        },
        {
            "author": "rek0vah",
            "body": "IDK. my mind goes on weird adhd associative sprees sometimes. this tracks to me. is he really intelligent? \n\ni could be gently schizoid or something i suppose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nictnichols",
            "body": "Looks very similar to someone i knows journal entry when they attempted to jot down their thoughts during an acid trip tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careful-Zucchini4317",
            "body": "He’z buggin",
            "score": 1,
            "replies": []
        },
        {
            "author": "Liquidust256",
            "body": "I got really good at pulling off things like this when I was a teenager because I was bored.  You study enough incoherent ramblings of people with severe mental issues then it’s easy as pie to “become one”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chbriggs6",
            "body": "A Beautiful Mind",
            "score": 1,
            "replies": []
        },
        {
            "author": "denebola2045",
            "body": "I was in gifted education and fine until a few traumatic brain injuries and people slipping me drugs out of spite. I'm part Latino and in my small town, Oroville, people didn't like, some of them, a minority being smarter than them, and when I went to Rick's College in Idaho, now named BYU Idaho, just as bad. The only thing Idaho exports is Nazis and potatoes as a Utah radio DJ once joked. But, the TBI did bring more than memory problems. I had to go through speech therapy, cognitive therapy and memory therapy too but I also developed schizophrenia. A TBI per an article I found a few years ago increases your chance of such a mental illness by up to 400%. You can also develop deep depression and bipolar etc. I still have memory issues but I've written stuff kinda sorta like that while off meds but it made more sense. I was just ummm very irritated. Lol I made some scientist friends with my ideas, kinda like Doc on Back to the future getting an idea for the flux capacitor. It's not like I'm a scientist, and my ideas are very basic, am no engineer but I've had enough TBIs to be declared legally dead and I'm still going somehow. I recently presented some ideas to my brother on something for the military he literally says \"damn bro, you're like lex Luther\" ugh lol I hated that comparison. I'll have to add he's not a techie or scientist. He was 101st Airborne and works at a local military base like I did in 2008. I got a letter of recommendation before I left for IT for better pay. However I'm on meds, I'm not delusional. I KNOW there's people way smarter than me but my dream was to be a scientist as a child. I grew up an Air Force brat and many in my family were military. I grew up on Tom Clancy, war movies and other military novels as well. I hung out in the recruiting station in high school reading Leatherneck Magazine. Got approached by recruiters before my TBI and got in the high 90s, I'm told, on my ASVAB. I tried pushing some of my ideas on Research Gate and had made friends there before, and I'm interested in Transhumanism. I was gifted a hardback book from Ray Kurzweil's publisher with his autograph and a laptop sticker and I suppose if I was delusional I'd think it was directly from him and that he \"admired my work.\" Lol there's a thing called citizen science and I still have some smarts in spite of as many concussions as a quarterback facing Lyle Alzado. I have my associates, CompTIA A+,  MCSE, and two cyber security certs. People invited me to defcon twice but I spent my money on food instead. I know, kinda ummm aloof. They got upset because at the time they were friends. I used to install Gentoo Linux exclusively after trying out some other distros and it doesn't make me a genius but in California I was in G.A.T.E. so I was above average. It's the Gifted And Talented Education program and I honestly feel like I wasted my smarts on techie stuff. I wish I'd become an engineer but I was born in the 70s. At least in a small 5k population town, breaking into engineering seemed impossible as a minority and even in Utah, the county mental health system that was used to dealing with repeat offenders, homeless and druggies and still need armed guards, I fell between the cracks. So I switched providers finally and I'm on really good needs. Word of advice. Avoid abilify like the plague. Just Google the unusual side effects and lawsuits. Oh and I have seizures as a result of my TBI. Was taken in an ambulance once and they give me Depakote for that. I'm taking lurasidone HCL, which works well. Warning though, take it at night when you're ready to go to sleep. I set my smartwatch to charge, took it, and fell asleep with my watch still charging. I wanted to measure my sleep lol but yeah, definitely get him help. I was homeless for a bit without needs. People. Target. You. Mentally ill people are targeted for violence and exploitation at a much above average amount compared to the sane people. They can't take care of themselves. I'm lucky, on the streets, the illegals looked after me because I'm Hispanic. And I ended up in jail twice because of my TBI, another potential danger. Oh YouTube look up \"TBI crime Ted talks\" and you'll see why. Lucky, again, twice I was in jail the homies looked after me. It's a Latino thing but jail is crime 101. They did try to recruit me, but the guards stepped in and I declared incompetent and went to mental health court. Quite a demotion from working for the military police as a civilian. 🤷🏼 Long story short, he can potentially end up dead even if only from self medicating with drugs or alcohol or both. Luckily, any mention of drugs or alcohol made me run like speedy Gonzales, my brain and LDS upbringing, plus reading medical encyclopedias on grade school and I knew what drugs can do even before getting to jr high. Or he, if he mixes drugs and alcohol, turn violent and get shot by police. I've seen YouTube video of that. Not all police are trained to deal with that. Plus usually schizo people have issues with the police. I don't, growing up on cop shows too helped. And in Utah they're sooooo helpful! Ohh edited, going off meds, at first I was fine. It was a \"high\" and you think you're fine. You're not. You progressively spiral out of control. You might get actual good ideas, only enforcing \"I'm fine\" but your brain suffers and gets damaged and especially on meds you have withdrawals. Just get second opinions and a good prescriber cuz some think they're God or give zero fucks/have compassion fatigue or something. And spiritual things can help as long as you don't go crazy with that. Exercise, being social, healthy hobbies like photography etc and be social. That helped me a $#1t ton! And choose the right friends. I had some convince me I only had a TBI and \"you can't get mental illness from that, they just wanna control you\" so I went off meds. 💯 Even a TBI needs psych meds a lot of the time even without an obvious mental illness to control anger or impulses (like flipping off my neurologist lol)",
            "score": 1,
            "replies": []
        },
        {
            "author": "amoralambiguity91",
            "body": "“Friend’s brother” eih?",
            "score": -1,
            "replies": []
        },
        {
            "author": "bigSTUdazz",
            "body": "I am Groot.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Individual_Grass1840",
            "body": "![gif](giphy|eI9QrHpSQF73O)",
            "score": -1,
            "replies": []
        },
        {
            "author": "coralwaters226",
            "body": "Word salad, you need to call an ambulance for this man asap",
            "score": -1,
            "replies": []
        },
        {
            "author": "MudOpposite8277",
            "body": "“Friends brother”",
            "score": -2,
            "replies": []
        },
        {
            "author": "mdandy68",
            "body": "Psychosis. Mania w/ psychosis.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Trick_Judgment2639",
            "body": "Definitely needs to see doctors, he's trying to make sense of insanity and that never turns out well",
            "score": -2,
            "replies": []
        }
    ]
}