{
    "title": "Some nutty map a guy stuck in my door",
    "author": "CinderellaSwims",
    "subreddit": "Weird",
    "rank": 3,
    "score": 192,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 80,
    "url": "https://i.redd.it/l3dgmpuw3gpe1.jpeg",
    "id": "1je49ut",
    "selftext": "Grew up in a super religious family and exposed to many different faiths, but this is a lot. Seems like some serious wacko stuff. ",
    "comments": [
        {
            "author": "traumaqueen1128",
            "body": "Worst boardgame ever....",
            "score": 83,
            "replies": [
                {
                    "author": "RichardStinks",
                    "body": "Have you seen the Buddhist version? Never ends! Ya just go around and around and around and...",
                    "score": 30,
                    "replies": [
                        {
                            "author": "traumaqueen1128",
                            "body": "It's like Monopoly, but worse!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "osmiumblue66",
            "body": "Not meant to be snarky but when I saw this the first thing I thought of was, this looks a lot like an old Waffle House menu.",
            "score": 29,
            "replies": [
                {
                    "author": "Hornswagglers_Lament",
                    "body": "Sass the cook and you’ll be looking at hell.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Amethoran",
            "body": "Anyone else hands you this you assume they have schizophrenia a Christian hands you this and it's just normal.  Stop normalizing this behavior fuck these people.",
            "score": 42,
            "replies": [
                {
                    "author": "Which_way_witcher",
                    "body": "NGL, I want to see two of them from different/evangelical branches/cults go at each other for not following the TRUE Christianity.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Full_Rise_7759",
                            "body": "False prophet! RAWR!!!",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Which_way_witcher",
                                    "body": "![gif](giphy|USK0tSpACOfNSEX1kM)",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ThatPhatKid_CanDraw",
                            "body": "Many of these evangelical ones barley have any reverence for the real teachings of Jesus. They really like the zealous violence and hatred of the Old Testament, with people fighting over small tracts of land. (No, I'm not religious)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Which_way_witcher",
                                    "body": "The focus on hate, fear, self loathing and whatnot definitely doesn't seem to jive with the whole vibe of Jesus, does it? \n\nMajor props to Misquoting Jesus by Bart D. Ehrman, a New Testament scholar, for getting my parents out of that evangelical nonsense. They aren't living in that perpetually negative judgement headspace anymore and are finally happy. Thank god, or rather, thank Ehrman!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Artislife61",
                    "body": "Schizophrenia \n\nThis looks a lot like the drawings and writings my ex gf used to bring home from the mental hospital. She said they would fixate on god and satan and sometimes ex presidents.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "AggravatingScholar17",
                    "body": "Most non medicated schizophrenics are Christians as well",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pantsco_1995",
            "body": "I always think these people must’ve done something so so heinous at one point to feel like they have to walk around handing out stuff and putting up “repent” signs and stuff.",
            "score": 12,
            "replies": [
                {
                    "author": "Physical_Relation261",
                    "body": "Most I’ve met have been exactly that, done jail time, been violent, alcoholics etc",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ThatPhatKid_CanDraw",
                    "body": "This diagram looks like they want us to find salvation by crashing into the sun - that's pretty heinous.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BluRobynn",
                    "body": "Yeah. They fuck boys.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Big-Veterinarian-823",
            "body": "Looks psychotic",
            "score": 4,
            "replies": []
        },
        {
            "author": "Chagromaniac",
            "body": "Oh! I haven't seen Chick Tracts since the 70s! Those people need help!",
            "score": 4,
            "replies": [
                {
                    "author": "ExceptingAlice",
                    "body": "I still have one I found in a laundromat in the 90s. It has a little girl being sold into prostitution and getting hooked on drugs. It has a happy ending because she dies and gets to be with Jesus. So..yay?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Chagromaniac",
                            "body": "😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hythy",
                    "body": "Someone down voted me for pointing out that that's what it was.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sallad-Cowboys",
            "body": "I never get anything interesting shoved into my letterbox 🙃",
            "score": 3,
            "replies": []
        },
        {
            "author": "GrimyGoose",
            "body": "Just me on my way to take a dip in the lake of fire 🔥\n\nhttps://preview.redd.it/246etuewfhpe1.jpeg?width=473&format=pjpg&auto=webp&s=d052a313a38692c4679fee9ce8f97cb6d1b75ed3",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lost_my_loser_name",
            "body": "This is how delusional most christians are.",
            "score": 23,
            "replies": [
                {
                    "author": "Treat_Street1993",
                    "body": "These kinds of literature are actually surprisingly divisive. I've gathered a small collection of the little comic books they leave around in public, and they get a little more extreme than you might imagine. According to them, Catholics have all been deceived into worshipping the devil and will all be burning in hell, which is like half of all Christians on earth. So truthfully, this kind of literature is quite provoking to the real majority of Christians.\n\nMost likely Jehovahs Witnesses putting this stuff out.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Which_way_witcher",
                            "body": "> Most likely Jehovahs Witnesses putting this stuff out.\n\nAh yes, the only one true religion that only recently (I think last year?) started allowing beards for men and pants for women.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Treat_Street1993",
                                    "body": "But still no birthday parties allowed!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Which_way_witcher",
                                            "body": "Nor Mother's Day or Thanksgiving! It's the devil...",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RattusNorvegicus9",
                    "body": "I don't think most Christians are like this, it's just that the delusional ones hog our attention with bullshit like this",
                    "score": 9,
                    "replies": [
                        {
                            "author": "brendabuschman",
                            "body": "We aren't. I promise.  We're just as sick of these people as everyone else.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Most_Neat7770",
                    "body": "Not really, I'm a religious Catholic and I learned the point of faith is not whatever the fuck that pamflette is showing",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "niniwee",
                    "body": "Christians have been fractured since the start. You have your various flavors of Gnostics, remnants of Cult of Mithras melding with early concepts of a Savior, Coptic Christians lording everyone in the East, even Paul allowed Stephen to be executed. Each and every word or even syllable in the Bible had been scrutinized and became a word of contention for whatever denomination of Christian out there.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HandlessOrganist",
            "body": "Looks like the art from a Jack Chick Gospel Tract",
            "score": 5,
            "replies": []
        },
        {
            "author": "ScarsAreOnTheInside",
            "body": "That's confusing as hell. 😆",
            "score": 2,
            "replies": [
                {
                    "author": "WarpmanAstro",
                    "body": "As someone who grew up in a church that treated the Left Behind novels like DLC for the Bible, this thing is suppose to educate/scare you about The Future of Mankind.\n\nBasically, it's saying that everyone (accept some Christians) will die one day. Then it hits the big bullet points of The Book of Revelations, which ends with all of the dead being resurrected so they can be judged in a big single file line by God. If your name isn't written in the Book of Life (aka, if you weren't a super good Christian), you get thrown into a big Lake of Fire where even Satan, Death, and the entirety of Hell are suffering for all eternity. If you were good, though, you get to live on New Earth in New Jerusalem, where God is walking around and chatting with everyone.\n\nYou can see how this is one of those \"Scary only from the inside\" sort of things. To someone fully indoctrinated, this shit preoccupies an unhealthy amount of their headspace at times. To anyone who's not, this is just the most boring scavenger hunt ever, because you have to read a bunch of quotes and then tack them together to understand what's being said.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fraggnetti_",
            "body": "I wonder what is served at \"the supper of Armageddon\"",
            "score": 2,
            "replies": [
                {
                    "author": "potent-spirit",
                    "body": "Peanut butter and jelly sandwiches on gluten free bread.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mr_Widetool",
            "body": "Burn it before the madness sets in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ulftar",
            "body": "Sweet, new Christian lore-drop.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tarmagoyf",
            "body": "Plotting the course of one's descent into madness.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheLooseMooseEh",
            "body": "Where are all the paved good intentions?",
            "score": 2,
            "replies": []
        },
        {
            "author": "OrangeP1ckles",
            "body": "i myself am an agnostic and don’t believe in any of this crap. but, like any other mythos, the biblical mythos is honestly pretty cool. i could be bias cause i grew up christian, and probably am. but still, it is pretty cool, regardless of if you believe it or not",
            "score": 2,
            "replies": []
        },
        {
            "author": "Avgsizedweiner",
            "body": "This guy sells me my hair shampoo",
            "score": 2,
            "replies": []
        },
        {
            "author": "DrKokhanbhalz",
            "body": "“Judgement of the great white throne” yeah buddy, every time I get a kebab.",
            "score": 2,
            "replies": []
        },
        {
            "author": "toolarmy_1",
            "body": "Kooky!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lgertp",
            "body": "We have the same table cloth just different color lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "J-W-L",
            "body": "Schizophrenic candy land...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Inevitable_Snap_0117",
            "body": "The fact that insanity so often seems to lead to hyper religiosity says something to me about the imaginary nature of religion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Significant_Wind_778",
            "body": "Don’t think much of the public transport service",
            "score": 1,
            "replies": []
        },
        {
            "author": "VioletShadows23",
            "body": "Ugh, mapquest got real shitty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SalmonSammySamSam",
            "body": "Saving this for later analysis",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hvitr_Lodenbak",
            "body": "I love it when they pitch fear as a conversion tool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arthur_Two_Sheds_J",
            "body": "I’d like to learn more about the death-cheatcode 1 Cor 15:51, please.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emilyalice3",
            "body": "The Cult of Pagemaker",
            "score": 1,
            "replies": []
        },
        {
            "author": "Street_Peace_8831",
            "body": "It’s really hard for people like that to imagine a world that isn’t black and white. The world is full of shades of grey and spectrums, but not if you listen to these people. They think everything is so simple and it’s either their way or hell and that’s just not the case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justachattinaway",
            "body": "I’m a believer and I can’t follow that at all.  Looks like all roads lead to hell according to their roadmap.  Who in the world did this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BluRobynn",
            "body": "It's like the Bible.  Nobody is reading it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BluRobynn",
            "body": "It's like the Bible.  Nobody is reading it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished_View650",
            "body": "I actually find this super intriguing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ladyignorer",
            "body": "https://preview.redd.it/8gxcbl2hpipe1.jpeg?width=720&format=pjpg&auto=webp&s=df420c3d19427bbfcd3ec02ccc2807d882e2b953\n\nReal",
            "score": 1,
            "replies": [
                {
                    "author": "CinderellaSwims",
                    "body": "Ring + 5.56",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hythy",
            "body": "The layout looks like a Chick Tract.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Awesomely_Bitchy",
            "body": "Where it says \" SATAN LOOSED...\" is it not supposed to be \"lost\" or is that some biblical spelling?",
            "score": 0,
            "replies": [
                {
                    "author": "WarpmanAstro",
                    "body": "In the Book of Revelations, Satan gets crated like an unruly cat for 1000 years in a big hole in the ground so that Jesus can rule over the resurrected Christians in peace. After the 1000 years are up, Satan is let out, builds an army, and is immediately thrown into *The* Lake of Fire like a comedy pratfall.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Awesomely_Bitchy",
                            "body": "O.....k... I was just curious of the word \" loosed \" but thank you.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "WarpmanAstro",
                                    "body": "Sorry; they did mean \"loosed\" as in \"let loose\".",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Awesomely_Bitchy",
                                            "body": "No sorry required. Thanx have a great day:)",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZER0_C00LEST",
            "body": "Fucking Jesus freaks… sometimes I wish I could be that blissfully stupid. They have gotten better and better at\n Coming up with new ways to explain away all the holes in logic in their stupid little fairly tale. Just like Hugh Grant said in Heretic “it’s all just an iteration of an iteration of an iteration!”",
            "score": 0,
            "replies": []
        },
        {
            "author": "GingaNinja01",
            "body": "*Sigh* the church has the schizophrenics designing ads again",
            "score": 0,
            "replies": []
        },
        {
            "author": "Most_Neat7770",
            "body": "I'm a religious Catholic and I can't more than say\n\n\nWtf did that fella smoke",
            "score": 0,
            "replies": []
        },
        {
            "author": "LookinAtTheFjord",
            "body": "I'd crumple it up and throw it on the ground then stick a note on my door that says \"Please refrain from sticking propaganda to my door\".",
            "score": -1,
            "replies": []
        }
    ]
}