{
    "title": "Why is that even a feature?",
    "author": "portsherry",
    "subreddit": "comics",
    "rank": 10,
    "score": 12238,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 119,
    "url": "https://www.reddit.com/gallery/1jdya8j",
    "id": "1jdya8j",
    "selftext": "",
    "comments": [
        {
            "author": "Nabhan1999",
            "body": "*checks phone settings*\n\nEverything's off\n\n*Still ugly as hell*",
            "score": 3471,
            "replies": [
                {
                    "author": "HyperfocusedInterest",
                    "body": "I'm convinced some phones have settings that are auto and can't be turned off. Maybe yours is one of those.",
                    "score": 1113,
                    "replies": [
                        {
                            "author": "Nabhan1999",
                            "body": "I appreciate the genuine attempt at help, but I was just going for self deprecating humor hahaha",
                            "score": 351,
                            "replies": []
                        },
                        {
                            "author": "atramors671",
                            "body": "They were making the joke that the ugly isn't the fault of the camera, but genetics.",
                            "score": 145,
                            "replies": [
                                {
                                    "author": "HyperfocusedInterest",
                                    "body": "Yeah, and I'm giving them an excuse to claim it's not genetics, but still the camera's fault ;)\n\n\n(But also I do genuinely believe some cameras auto filter)",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chultist",
                            "body": "Definitely especially Korean/ Chinese phones are known to have software in their cameras because of their beauty standards",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "unicornsaretruth",
                                    "body": "Is that why like half the selfies I see from Chinese exchange students have a filter on in at least one ohoto",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Yondercypres",
                            "body": "Not some, all. ISPs (Image Signal Processors) have been making photos look different since for freaking forever. It's just a byproduct of digital photography.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Duae",
                            "body": "Apparently if you have freckles they can be a good test for that, because a lot of sneaky auto-filters hate them and will remove them.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Immediate-Reach746",
                            "body": "Effectivement, mon ancien téléphone réduisait la taille de ma mâchoire et de mon cou de lui-même, et en vieillissant le processeur était trop lent pour le faire avant de m'afficher l'original et je pouvais voir la modification se faire avec une seconde de délai",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "roidrole",
                                    "body": "Fr*nch detected, initiating orbital strike",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "zekkious",
                            "body": "That's why I use OpenCamera. Every setting in there, belongs to **me**.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mooys",
                    "body": "Part of the problem is how wide the camera lens is. Cameras have really wide lenses, which is great for landscape shots but not necessarily reflecting what your eyes would see.",
                    "score": 74,
                    "replies": [
                        {
                            "author": "novaMyst",
                            "body": "another problem is even if you have a perfect reflection of what you look like you can never know what other people perceive of you.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "PhoenixShade01",
                                    "body": "Another problem is that even if you have a perfect reflection of what you look like, you can never really overcome being butt ugly by birth.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "Zjoee",
                                            "body": "If someone calls me ugly I just say \"at least I don't have to look at me\" haha",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Germane_Corsair",
                                                    "body": "Behold the mirror!",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "Zjoee",
                                                            "body": "The only use I have for mirrors is making faces at myself to make me laugh!",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "patosai3211",
                    "body": "I wish my mirrors had something besides default settings. \n\nOh hey an off button!\n\n*mirror shatters*",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "creegro",
                    "body": "Well there's your problem, screen is still locked and youve been looking at your reflection",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "BeenEvery",
                    "body": "It's because phone lenses are fundamentally shaped differently than your eye's light receptors.\n\nIn short, you think you look different in your phone photos *because you simply do.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "portsherry",
            "body": "[**Source**](https://portsherry.com/comic/why-is-that-even-a-feature/)\n\nFor real though, some recent phones add aggressive post processing to camera photos by default. It's awful and a pain to turn it off.\n\n[Facebook](https://www.facebook.com/portsherrycomic/) \\- [Threads](https://www.threads.net/@portsherry) \\- [Cara](https://cara.app/portsherry) \\- [Instagram](http://www.instagram.com/portsherry) \\- [Subreddit](http://reddit.com/r/portsherry) \\- [Bluesky](https://bsky.app/profile/portsherry.bsky.social)",
            "score": 1896,
            "replies": [
                {
                    "author": "boyawsome876",
                    "body": "My school computer camera always did this thing where it would make my face extremely lopsided for some reason, like my mouth would a flat line and then in the picture it would be completely diagonal, it pissed me off so much that I actually asked a couple people whether my face was actually lopsided, almost all of them said no.\n\nDidn’t use the camera very much but it was still annoying when I did.",
                    "score": 608,
                    "replies": [
                        {
                            "author": "L4rgo117",
                            "body": "Stroke mode",
                            "score": 198,
                            "replies": [
                                {
                                    "author": "mathnerd3_14",
                                    "body": "Dell's palsy",
                                    "score": 92,
                                    "replies": [
                                        {
                                            "author": "EdwardRoivas",
                                            "body": "![gif](emote|free_emotes_pack|smile)",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MilkMan0096",
                                    "body": "Go on…",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Uulugus",
                    "body": "It's like every \"\"smart\"\" TV now coming with that objectively horrendous \"motion smoothing\" BS that makes movies look awful and animation look absolutely horrendous.\n\n*What's the point*.",
                    "score": 254,
                    "replies": [
                        {
                            "author": "PurpleMap1527",
                            "body": "Its made for sports and it doesn't work there either",
                            "score": 128,
                            "replies": [
                                {
                                    "author": "ChangeVivid2964",
                                    "body": "Nah, BFI is made for sports.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "atramors671",
                                    "body": "Its made for video games and it works *great* there, but its definitely not meant for live or recorded formats where frame generation isn't required.",
                                    "score": -63,
                                    "replies": [
                                        {
                                            "author": "stuaxo",
                                            "body": "I thought games was the last place you wanted it.",
                                            "score": 77,
                                            "replies": [
                                                {
                                                    "author": "dutchphoria",
                                                    "body": "It can help to prevent motion sickness but most people get nothing it of it",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "MaelstromSeawing",
                                                            "body": "Motion blur in games ends up *making me* sick... Completely counter intuitive >_<",
                                                            "score": 12,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "henke37",
                                            "body": "Video games don't want filtering, they want low latency.",
                                            "score": 58,
                                            "replies": []
                                        },
                                        {
                                            "author": "Motivated-Chair",
                                            "body": "Videogames is literally the last place you want something making motion less clear when you have to actually react to what is going on in the screen.",
                                            "score": 42,
                                            "replies": []
                                        },
                                        {
                                            "author": "BurningPenguin",
                                            "body": "First thing i turn off whenever i load up a new game",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Steak-Outrageous",
                            "body": "It doesn’t let you change modes?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Uulugus",
                                    "body": "Some do, some don't. The annoying part is most come with it on by default.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tankh",
                            "body": "Remember when YouTube out of the blue added video stabilization to seemingly every new video so they all made you feel seasick? That was a crazy idea",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "IvanTheKindaTerrible",
                            "body": "Color correcting for me. Netflix’s color change every 5 seconds. I tried everything I could find to turn it off, but no luck.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "PurpleMap1527",
                                    "body": "The automatic picture adjustment system often found away from picture settings. Either AI or auto setting on the tv itself. ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "finlandery",
                            "body": "Film maker mode is lifesaver. Disables every bs post processing thing",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pinglenook",
                    "body": "Yeah my phone's selfie camera automatically adds a filter that airbrushes my skin and makes my cheeks slightly narrower and my eyes slightly larger. It's easy to turn off, just tap the \"original\" button that's on the screen, but I have to turn it off *every time* I open the selfie cam and I haven't found how to make \"original\" the default setting. It also makes my kids look ridiculous, as if I put makeup on them.\n\n\n(...If anyone here has a Motorola phone and does know how to make \"original\" the default I'd be very thankful for your advice!)",
                    "score": 68,
                    "replies": [
                        {
                            "author": "3-stroke-engine",
                            "body": "I once had similar complaints with my camera app and I just downloaded a new camera app (open camera).",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "GlorpedUpDragStrip",
                            "body": "I also have a Motorola and had to check what it does as I rarely use the front camera, it defaults to no filter. So maybe that's an android 15 thing as I updated recently",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "YoRHaNo2TypeNB",
                    "body": "I absolutely despise that my phone camera has an aggressive color correction that cannot be turned off. I get some very beautiful sunrise/sunset sky colors often where I live, and my phone will just eat up the strong colors and make it a washed out mess. \n\nI once looked at a small photo dump of pictures taken during a snowy winter. They were taken minutes apart and the snow came in six different colors across ten images.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "-ragingpotato-",
                    "body": "I had a chinese brand phone that would just assume the skin color of the user is white and would use that to color balance the whole image. Looked absolutely horrendous.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "rinart73",
                    "body": "Xiaomi phones smooth the faces by default, even when everything is off. It's annoying",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "elhomerjas",
            "body": "the many wonders of technology",
            "score": 515,
            "replies": [
                {
                    "author": "traumaguy86",
                    "body": "Wonders, Lisa? Or blunders?",
                    "score": 64,
                    "replies": [
                        {
                            "author": "PocketBuckle",
                            "body": "I think that was implied by what they said.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "allwaysnice",
                                    "body": "Implied, PocketBuckle? Or implode?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PocketBuckle",
                                            "body": "OP, make them stop!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Taletad",
            "body": "Welcome to the world of AI correcting pictures",
            "score": 382,
            "replies": [
                {
                    "author": "philmarcracken",
                    "body": "same trick they use on mirrors in womens clothing stores. They'll buy the shit that makes them look better",
                    "score": 68,
                    "replies": [
                        {
                            "author": "Germane_Corsair",
                            "body": "What’s the mirror trick?\n\n\n\nEdit: looked it up. It’s a curved mirror that makes you look slightly slimmer/gives a slight hourglass effect.",
                            "score": 39,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PLACE-H0LDER",
            "body": "?",
            "score": 343,
            "replies": [
                {
                    "author": "Pyode",
                    "body": "Dorian Grey is a story about an immortal person who is immortal because they have a portrait of themselves that ages for them.\n\nhttps://en.m.wikipedia.org/wiki/The_Picture_of_Dorian_Gray\n\nThe joke is that he just turned off her eternal youth.",
                    "score": 1029,
                    "replies": [
                        {
                            "author": "VolcanicBakemeat",
                            "body": "This is nearly it but the painting is his soul and grows uglier as Dorian's vanity leads to sin and wickedness. The phone in the comic is calling the woman an asshole.",
                            "score": 633,
                            "replies": [
                                {
                                    "author": "HarryShachar",
                                    "body": "Yup. This is the joke, not about eternal youth...",
                                    "score": 120,
                                    "replies": []
                                },
                                {
                                    "author": "Thanks_I_Hate_You",
                                    "body": "Came here to explain it so it didn't end up on r/explainthejoke or whatever the sub is but you beat me to it. I've never read the story but I love the movie.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "International-Cat123",
                                            "body": "Thank you. I was gonna post it there if I couldn’t find the answer in the comments.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Dickieman5000",
                                    "body": "In fairness, he was already pretty vain and sinful when the artist first met him.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "ErebusAeon",
                                            "body": "Was he though? I don't have the book around to reference but I recall the story opens with Basil painting Dorian's portrait. He reluctantly introduces Dorian to Lord Henry because he's afraid Henry will be a negative influence on Dorian due to his hedonistic tendencies. \n\nDorian seemed rather normal and well adjusted initially.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Dickieman5000",
                                                    "body": "It's been a while since I read it, but I was left with the impression initially that he was at the very least a bon vivant sort of rich kid. But it has been a while and you mentioning that does click in my head. Be worth rereading sometime soon.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Pyode",
                                    "body": "To be fair I haven't read the book (I only know about it because of the film \"League of Extraordinary Gentlemen\" lol)\n\nBut the article I quoted says it's both his age and his sin and in the image in the comic she just looks older so I don't think it's fair to say for sure my interpretation is definitely incorrect.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Frognificent",
                            "body": "Dorian Gray jokes never get old.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Interesting_Natural1",
                            "body": "Not immortal, just forever young",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "INFP-Dude",
                            "body": "Seems like a very obscure reference. Thank you for explaining it to us.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "IsThisDamnNameTaken",
                                    "body": "I mean, it's one of the most well known novels in the literary canon, and there's currently a Broadway production of it starring Sarah Snook",
                                    "score": 88,
                                    "replies": [
                                        {
                                            "author": "Chidoriyama",
                                            "body": "Depends on the country I suppose. Haven't heard of it where I'm from ",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "author": "nomoreteathx",
                                                    "body": "Where are you from?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "Chidoriyama",
                                                            "body": "India",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "nomoreteathx",
                                                                    "body": "Ah cool. It's a great novel, perhaps Oscar Wilde's best known work. Definitely worth reading if you're even slightly interested.",
                                                                    "score": 24,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "pagla_kheer_kha",
                                                                                    "body": "Found the ICSE person. \n\nDid you ever consider that not everyone is as proficient in classical English literature and maybe they're pretty well versed in their local language literature? Not to mention that not everyone has be literary inclined.\n\nYour ability to instantaneously judge someone is overshadowed only by your arrogance. I wouldn't want you to be seen as a representation of India as well.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MFish333",
                                                    "body": "It's Irish, but it's not like everyone here is also Irish, this is one of the most famous classic novels all over the world.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CaptMcButternut",
                                            "body": "Never read it. I'm just here thinking about League of Extraordinary Gentlemen 😅",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Capital_Cloud6847",
                                    "body": "I dont mean to be rude but i gotta tell ya The picture of Dorian gray by Oscar fucking wilde is extremely well known.\n\nEdit: one could say that it's wildely well known ha",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "dlpfc123",
                                            "body": "I started reading it, (someday I will finish because it seemed interesting). But reading the first few chapters I couldn't help but wonder, are all of these characters supposed to be gay? Even the guy who was apparently a lady's man seemed to be annoyed by women and absolutely enamored by Dorian. It made me wonder if it was on purpose or just because Oscar Wilde couldn't imagine how anyone wouldn't find men attractive.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "ErebusAeon",
                                                    "body": "There's supposedly an uncensored version of Dorian Gray that features many more aspects of the homosexuality exhibited by the charcters that were cut by the editors before publishing. Such as Basil expressing his love for Dorian.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GVAJON",
                                            "body": "By western standards, yes absolutely.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CorpseInTheMaking",
                                    "body": "If it makes you feel better I only knew because of the 1945 film.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "theblackxranger",
                            "body": "TIL and now I understood the reference!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Quo-Fide",
                    "body": "If I remember correctly, which I might not as I last read it five years ago, the Portrait of Dorian Grey is about this man called Dorian Grey who was kinda nice but then became progressively crueler which was  reflected on his Portrait. Again, I'm probably forgetting some details.\n\nIf anyone wants to add something, please do.\n\nEdit. As in, the Portrait kept getting uglier the worse he got.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "ATotallyRealUser",
                    "body": "Reminder that over 50% of this country can't read above a 6-grade level. Sounds like 80+% don't even know what classic books are.",
                    "score": -18,
                    "replies": [
                        {
                            "author": "PLACE-H0LDER",
                            "body": "People when someone hasn't heard of every classic book in existence",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "MFish333",
                                    "body": "Nobody is making fun of people for not knowing this famous book. They're making fun of people getting super defensive when they learn it's well known.",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "chameleonability",
                                    "body": "You just wrote \"?\", so that user had no info about your literacy level ",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DharmaCub",
            "body": "Lmao that's great",
            "score": 47,
            "replies": []
        },
        {
            "author": "shinigami_15",
            "body": "This comic sent me into a very nice rabbit hole\n\nThank you OP",
            "score": 28,
            "replies": []
        },
        {
            "author": "AwarenessGullible470",
            "body": "Ah, that's why they don't make the old Nokia phones any more!",
            "score": 8,
            "replies": []
        },
        {
            "author": "StrongStyleMuscle",
            "body": "I always be thinking people are lying about their size. People I be knowing for sure are heavier than me say their weight is lighter than mine. Then I get  a photo with em & I be looking huge next to them lol. Photos can be humbling sometimes.",
            "score": 6,
            "replies": []
        },
        {
            "author": "stuaxo",
            "body": "I think it's just that we're not used to seeing faces that aren't moving somehow.  Taking pictures is just hard.",
            "score": 7,
            "replies": []
        },
        {
            "author": "SaulsAll",
            "body": "Nooo, by turning it off, all the ugliness will go back into you!  Look at the last panel - you're already losing your smile!",
            "score": 3,
            "replies": []
        },
        {
            "author": "AvantSolace",
            "body": "So I’m not crazy. I look into a mirror, and I’m a good 7/10. Take a photo and suddenly I’m a 3/10.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ironlion45",
            "body": "Cute",
            "score": 2,
            "replies": []
        },
        {
            "author": "RadTimeWizard",
            "body": "I don't know, but that's the kind of black magic I want in my life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LittleBirdsGlow",
            "body": "New book for me yay!",
            "score": 2,
            "replies": []
        },
        {
            "author": "DongayKong",
            "body": "How do I turn this setting of for mirrors?",
            "score": 2,
            "replies": []
        },
        {
            "author": "escape_fantasist",
            "body": "?",
            "score": 4,
            "replies": [
                {
                    "author": "Square-Dragonfruit76",
                    "body": "Dorian Gray is a famous book by Oscar Wilde where a man stays immortally young but has a portrait that grows uglier and uglier as his soul becomes more and more corrupt.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "escape_fantasist",
                            "body": "Thanks for the info",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nhSnork",
            "body": "And more importantly, what are the consequences of turning it off?👀",
            "score": 2,
            "replies": []
        },
        {
            "author": "Interesting_Natural1",
            "body": "Yeah wait till she gets so enamored by her own picture like a modern Narcissus and then one day it smirks funny now she has the impulse to hide it behind a purple curtain inside a locked attic room",
            "score": 1,
            "replies": []
        },
        {
            "author": "Assumption-Weary",
            "body": "This comic reminds me of Gaston",
            "score": 1,
            "replies": []
        },
        {
            "author": "Babki123",
            "body": "I'm going to send this one to Peter I guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "waspwatcher",
            "body": "*turn it back on turn it back on*",
            "score": 1,
            "replies": []
        },
        {
            "author": "notabigfanofas",
            "body": "But if you print out a picture taken in Dorian Grey mode do you stay young forever?",
            "score": 1,
            "replies": []
        },
        {
            "author": "gregorydgraham",
            "body": "Well done! You actually made me snort out loud :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "HornedBat",
            "body": "maybe because I enjoyed Wilde's book - but generally, American humour makes my brain ache. I can feel my cells dying",
            "score": -5,
            "replies": []
        },
        {
            "author": "RansomReville",
            "body": "Generally, if you include a mildly obscure reference, people will enjoy the thing even if it isn't funny because it makes them feel smart.\n\n\nPeople want to go \"Oh I get it because I know the reference, so I want people to know that I found this funny because that means I'm smart!\"",
            "score": -3,
            "replies": []
        },
        {
            "author": "BankTypical",
            "body": "Lol, this is me if I DON'T  actually flip the selfie photo. Somehow, a quick flip takes me from 'eww' to 'accurate'.  I mean, come on; my goth self can see in the irl mirror perfectly fine that I lowkey look like the lovechild of Elvira and Beetlejuice. 🤣   \n  \nThanks for posting this, though; I did some digging on my phone, and apparently, photo optimization was the culprit of my mouth always looking WAY more lopsided in selfies than it did irl. 😄 Like, holy shit, that was actually like SUCH an insecurity of mine, like 'PLEASE tell me it's not that way irl'. Everything else in a selfie was just properly irl accurate here (I was just like 'Yup, this is actually the BankTypical that I see in the mirror'), but never my lips somehow. It's actually been a real pain if I just want to lip-swatch a new lipstick over here; I kind of keep selfies of both lipstick and eyeshadow swatches in order to really find anything in my beauty case here, lol. I just have such a big makeup collection that I kind of need a system to find anything.",
            "score": -7,
            "replies": [
                {
                    "author": "SadLilBun",
                    "body": "Flipping it is what you see in the mirror. But it’s not what everyone else sees.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ProjectOrpheus",
                            "body": "They do have some \"true mirrors\" or whatever that reflect you accurately. Apparently most people end up feeling like they do look better..after some time/initial shock and what nor",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}