{
    "title": "Whispers [OC]",
    "author": "fmsqueeze",
    "subreddit": "comics",
    "rank": 8,
    "score": 2335,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 49,
    "url": "https://www.reddit.com/gallery/1je9unh",
    "id": "1je9unh",
    "selftext": "",
    "comments": [
        {
            "author": "MintasaurusFresh",
            "body": "1) If you could, would you?\n\n2) If no, is it because you don't find yourself attractive?",
            "score": 635,
            "replies": [
                {
                    "author": "fmsqueeze",
                    "body": "I'm not that into dudes so that would be a factor BUT he would sure know how to work the machinery",
                    "score": 384,
                    "replies": [
                        {
                            "author": "bugsrer",
                            "body": "dudes suck",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "DragonBuster69",
                                    "body": "Some blow",
                                    "score": 34,
                                    "replies": []
                                },
                                {
                                    "author": "nomatt18",
                                    "body": "Most, but not all",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Competitive_Hall_133",
                                            "body": "#NotAllMen  >! /s !<",
                                            "score": 12,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Livid_End4117",
                    "body": "There is a line self love and narcissism",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Dshark",
                    "body": "It’s because I’m not gay.  I don’t think I’m bad looking though.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "jzillacon",
                    "body": "No, and yes. I'm bi but my self-esteem isn't great and honestly I'm still baffled that even my partner finds me attractive.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "hajke5",
                    "body": "Yes.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SookHe",
                    "body": "Sure, but one of us will have to wear a dress",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "hidood5th",
                    "body": "But all miracles...require sacrifice.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "stoopidrotary",
                    "body": "1) yes\n\n2) I didn't get this far. Too excited about 1.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BlazikenAO",
                    "body": "Absolutely I would, I’ve heard good things about the view and would love to see it personally",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "AftonsAgony",
                    "body": "Only for the right conditions",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Dendrodes",
                    "body": "Hell yeah I would.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Zombys11",
                    "body": "1. Duh who would \n2 N/A",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "zorfog",
            "body": "I love how this sub is just eye candy porn comics now. And the last slide is always teasing nsfw bonus content on patreon 😂",
            "score": 362,
            "replies": [
                {
                    "author": "noshinare_nira",
                    "body": "The sub has slightly fallen but there are still alot of not porn comics but I do like porn so it's not too bad",
                    "score": 143,
                    "replies": []
                },
                {
                    "author": "CherryFlavorPercocet",
                    "body": "Are these supposed to be funny? Provocative? \n\nI swear half of them the conversations are AI generated. The art isn't but the actual content is.",
                    "score": 83,
                    "replies": [
                        {
                            "author": "CroqueMonsieur",
                            "body": "they’re supposed to get horny dudes to pay for comic porn on patreon",
                            "score": 88,
                            "replies": [
                                {
                                    "author": "zorfog",
                                    "body": "How else are you gonna make money off of webcomics? Very rarely are you going to have an idea noticed or blow up enough to get published/serialized or adapted to animation. And similarly you’ll have a tough chance getting people to pay for comics. Porn, though? People will pay for porn",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Neon_Casino",
                                    "body": "Bingo.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Grimueax",
                            "body": "Porn brain has a tighter grip (heh) on humanity's collective conscious now more than ever.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DaleGribbleShackle",
                    "body": "I hate it. The only thing that keeps me from unsubbing is every so often Gustopher makes an appearance.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Comfortable_Bat5905",
                    "body": "can you blame them when thats one of the few ways to make money doing what they love?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "imahuman3445",
                    "body": "Hey buddy, did you know you can block NSFW creators, and then you won't see any of their posts? It'll be exactly like the good old days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neon_Casino",
            "body": "Can we have a different subreddit for horny comics? Like I am not gonna bash on the creator, but I am more so frustrated with how people keep upvoting the same horny comics every single fucking day. Like so many of them aren't even funny or sometimes don't even have an actual punchline. Just horny. But people keep upvoting them regardless because sex sells.\n\nFucks sake people get it together.",
            "score": 185,
            "replies": [
                {
                    "author": "Majestic-Iron7046",
                    "body": "If you sort by new you get all the other content too.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "LamerGamer1216",
                    "body": "to be fair, they dont need to be funny or have a punch line, this isn't a joke or humor sub, it's for all comics, though i do agree its flooded with too many of the same few comics being popular, you can always block them",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "RogueUsername13",
                    "body": "Block the posting accounts and you won’t see them",
                    "score": 44,
                    "replies": [
                        {
                            "author": "9Neuronflies2Alive",
                            "body": "No no he has a point. It's r/comics not r/porncomics",
                            "score": 21,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "raich3588",
            "body": "Thank you for the reminder a comic doesn't necessarily need to be funny or even entertaining in any way whatsoever.",
            "score": 27,
            "replies": [
                {
                    "author": "That-Grim-Reaper",
                    "body": "God I love these soft core pornography ads please don’t stop give them more",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "discomiseria",
            "body": "I had a stroke trying to comprehend the order in which I was supposed to read all of this, good comic tho.",
            "score": 20,
            "replies": [
                {
                    "author": "some3uddy",
                    "body": "By that you mean you had a stroke while swiping back and forth through the comic? Probably not the only one…",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhiskeyAndKisses",
            "body": "Another sad day being reminded we can't hook up with ourselves from another dimension.",
            "score": 8,
            "replies": []
        },
        {
            "author": "fmsqueeze",
            "body": "Weird store, but they offer stiff competition. \n\nCatch up on all of Rachel's comics on [fmsqueeze.com](http://fmsqueeze.com) or get half off the good stuff during the [fmsqueeze Patreon](https://www.patreon.com/fmsqueeze) Spring Sale now!",
            "score": 32,
            "replies": []
        },
        {
            "author": "zmeme",
            "body": "wtf is the punchline",
            "score": 3,
            "replies": []
        },
        {
            "author": "Stranded_In_A_Desert",
            "body": "To people complaining about these sort of comics: you know you can just block the artist’s profile, right? And then not see their comics anymore? It’s a win-win really, less complaints about them for the people that enjoy them and then you see less of it on your feed.",
            "score": 17,
            "replies": [
                {
                    "author": "Majestic-Iron7046",
                    "body": "Even more hilarious, they keep seeing these comics because they sort by popularity, if you sort by new you see other comics too, they are basically crushing theyr own foot and then screaming they are in pain and it's fault of the guy who made the hammer.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Chronx6",
                            "body": "Not only that, by posting on it they are telling Reddit's algorithm that they will engage with this content and content like it, so it serves them more of it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlienArtFirm",
            "body": "Ahhh the generic horny comic. That's how I know I've hit the bottom of the well. Why bother putting in effort when you're just trying to sell your NSFW patreon anyway.",
            "score": 8,
            "replies": []
        },
        {
            "author": "vid_icarus",
            "body": "I would at some point eventually, but if I looked like her it would be agenda item #1.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oknight",
            "body": "Perfectly symmetrical sex never solved anything... wait, yes it does.",
            "score": 1,
            "replies": []
        },
        {
            "author": "01Rajiv",
            "body": "First a random twin sister gets introduced and now a doppelganger..... What's next ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Replacement_978",
            "body": "This comic strip is super hot but the the side profile of the noses doesnt match the cuteness of the front views",
            "score": -5,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Ok_Replacement_978",
                            "body": "The height of the nose in relation to the mouth and the shape of the nose do not match at all when comparing side profile to the front view. I think it would be better suited without the anime style beak in side profile. Thats all lol...",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutumnAscending",
            "body": "This portrays an unrealistic standard. Lesbain women are never this open.",
            "score": -8,
            "replies": []
        }
    ]
}