{
    "title": "Some kind of big brass key. G'pa worked for ADT 1950s-70s.",
    "author": "Last-Hedgehog-6635",
    "subreddit": "whatisthisthing",
    "rank": 13,
    "score": 116,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/gallery/1jdoh8p",
    "id": "1jdoh8p",
    "selftext": "Serial number on handle, positions on shank labeled T-1-2-3-4-T-1-2-3-4. Hollow tube up to shank. Chromed front piece, presumably for wear with some kind of driver key. Smaller brass key rotates independently from fixed larger brass key. Pic 2 shows a small nub and arrow on bottom of larger key. Probably came from my grandpa's garage, in which he had tons of scavenged old alarm systems and parts after working for ADT in the 1950s-70s.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All comments must be civil and helpful toward finding an answer.\n\n**Jokes and other unhelpful comments will earn you a ban**, even on the first instance and even if the item has been identified. If you see any comments that violate this rule, report them.\n\n[OP](/u/Last-Hedgehog-6635), when your item is identified, remember to reply **Solved!** or **Likely Solved!** to the comment that gave the answer.  Check your [inbox](https://www.reddit.com/message/inbox/) for a message on how to make your post visible to others.\n\n----\n\n[Click here to message RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/whatisthisthing/comments/1jdoh8p/some_kind_of_big_brass_key_gpa_worked_for_adt/]%0A%0ARemindMe!%202%20days)\n\n----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cultural_Library_189",
            "body": "How about a watchman's clock key. The roundsman had to clock in at each station at set time, and used a key",
            "score": 63,
            "replies": [
                {
                    "author": "Last-Hedgehog-6635",
                    "body": "Awesome! You guys are amazing! Thanks so much for solving this mystery!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Ambulating-meatbag",
                    "body": "You had the right answer first, the other guy came along with a Pic and stole your glory.",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ultimate-Lex",
            "body": "Found it!\n\nIt's an ADT Type W watchman's key for an 1180 watchman system. They would do the rounds and the key would fit into systems to ensure that the watchman visited all the waypoints on the route.\n\nhttps://preview.redd.it/jsmxlanh9cpe1.png?width=1079&format=png&auto=webp&s=5e221f1ea68eba3d3108c50cf290a30201b25399",
            "score": 149,
            "replies": [
                {
                    "author": "Last-Hedgehog-6635",
                    "body": "That's it! Thank you! Very helpful detail to understand what this crazy thing is. I don't think I ever saw the rest of this system in my grandpa's garage, but I still have a few boxes to look through. Thanks again!",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "NotOutrageous",
            "body": "Do the pieces separate at all?  It looks like an integrated key and lock body.  I was recently at a trade show and the cabinets in our booths had (smaller) keys that looked a lot like this. You insert the entire thing into the door's lock hole, twist it, and when you pull it out the end pieces stay behind locking the door.\n\nHere is an example of the type of lock.  \n[https://steinlock.com/products/burg-wachter-me-2-lock-blocker-for-furniture](https://steinlock.com/products/burg-wachter-me-2-lock-blocker-for-furniture)",
            "score": 3,
            "replies": [
                {
                    "author": "Last-Hedgehog-6635",
                    "body": "Ah, that's a clever little lock, but that's apparently not the function of this key.\n\nI had to watch a video showing that little thing to fully understand what it is. Great idea. [https://www.youtube.com/watch?v=qAbSMBe-r2E](https://www.youtube.com/watch?v=qAbSMBe-r2E)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dyoelle",
            "body": "Could it be for winding a clock ? I seem to remember that somehow the two parts of the key work simultaneously on the big hand/small hand cilinders inside the clock mechanism which require different tensions because of different rotation speeds (1 hour/12hours).",
            "score": 2,
            "replies": []
        },
        {
            "author": "jibaro1953",
            "body": "Watchman key",
            "score": 2,
            "replies": []
        },
        {
            "author": "Last-Hedgehog-6635",
            "body": "Solved!\n\nThank you guys so much for helping me!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Last-Hedgehog-6635",
            "body": "My title describes the thing as a key. It's big, so it could be to wind up some device, but the serial number and somewhat unique shapes indicate it's intended to only operate on some specific device like a key would. The T-1-2... index marks could be either to function as a key or wind-up tool. I've been curious about this thing for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careful-Can-8501",
            "body": "We had them in a museum i worked in (not in use) in our set each key had a number and you would have walked around and used each one at a set time - carrying a clock device that printed the number and time when inserted and turned. Registering time and location",
            "score": 1,
            "replies": []
        },
        {
            "author": "sinisteraxillary",
            "body": "Crosspost this to some of the locksmith and lockpick subs. I'm sure they'd appreciate it",
            "score": 1,
            "replies": []
        }
    ]
}